{
  "FacilityID": 4850,
  "FacilityName": "DAI Oildale, Inc.",
  "FacilityStr1": "3300 Manor Drive",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93308",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.440556",
  "FacilityLongDecDegs": "-119.011944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 801364571,
  "ParentCompanyName": "DAI Management Consultants, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 801364571,
  "Company2DUNS": 0,
  "OperatorName": "DAI Oildale, Inc.",
  "OperatorStr1": "3300 Manor Drive",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93308",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": "CAL000060664",
  "EPAFacilityID": "100000060505",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "applied for",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 35.44056,
  "FRS_Long": -119.01194,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5663,
      "AltID": "SCR System",
      "FacilityID": 4850,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 6109,
          "ProcessID": 5663,
          "ChemicalID": 56,
          "Quantity": 58000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5782,
          "ProcessID": 5663,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2338,
              "Process_NAICS_ID": 5782,
              "SafetyReviewDate": "1998-04-23 00:00:00",
              "PHA_Date": "1999-06-09 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-09 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-26 00:00:00",
              "TrainingReviewDate": "1999-03-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-26 00:00:00",
              "EquipmentInspectionDate": "1999-06-14 00:00:00",
              "EquipmentTested": "Entire System",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-04-23 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-04-23 00:00:00",
              "AuditCompletionDate": "1998-04-23 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-04-23 00:00:00",
              "HotWorkPermitReviewDate": "1998-07-31 00:00:00",
              "ContractorSafetyReviewDate": "1998-07-28 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-22 00:00:00",
              "CBI_Flag": 0,
              "Description": "SCR System",
              "_chemicals": [
                {
                  "PrimaryKey": 2621,
                  "PreventionProgram3ID": 2338,
                  "ProcessChemicalID": 6109
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4850,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Kern County Environmental Health",
    "CoordinatingAgencyPhone": "6618628700",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4850,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nDAI Oildale, Inc. stores and utilizes anhydrous ammonia in a selective catalytic reduction (SCR) process at their facility northeast of Bakersfield, California.  It is DAI Oildale, Inc.'s policy to comply with all applicable governmental regulations.  Further, it is DAI Oildale, Inc.'s objective to be a responsible citizen of the community in all of its business activities.\n\nDAI Oildale, Inc. emphasizes safe and environmentally sound operating practices and procedures through their employee training programs.  In addition to job specific training, operators and maintenance personnel receive training in fire prevention, hazardous materials handling, safe work methods, and safe use of equipment.  Additionally, emergency response procedures have been established by DAI Oildale, Inc.\n\nDescription of the Stationary Source and Regulated Substances \n\nThe DAI Oildale, Inc. cogeneration facility is owned and operated by DAI Management Consultants, Inc.  The plant, which is located in the Kern River Oil Field, northeast of Bakersfield, California, began commercial operation in the spring of 1990. \n\nCogeneration, in the case of the DAI Oildale, Inc. facility, is the simultaneous production of thermal energy and electrical energy from the combustion of a single fuel source.  Combustion of the fuel takes place in a gas turbine that is physically coupled to an electric generator.  Waste heat from the gas turbine's exhaust flows into a heat recovery steam generator (HRSG).  The HRSG extracts the heat from the exhaust gases and produces steam for thermally enhanced oil recovery.  Electricity is produced at the same time via the electric generator coupled to the combustion turbine.  \n\nAnhydrous ammonia is used at the DAI Oildale, Inc. facility to create a reducing atmosphere in the SCR process.  This reducing atmosphere in the flue gas helps convert nitrogen oxides to nitrogen and water as it passes "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4850,
      "SummaryText": "through the catalytic reactor.  The operation of the SCR system substantially lowers the emissions of nitrogen oxides from the gas turbine.\n\nLiquid ammonia is stored in a 12,417 gallon (water capacity) storage tank.  The maximum intended inventory of the anhydrous ammonia storage tank is based on the American National Standard Institute's K61.1 safety requirements and the Occupational Safety and Health Administration (OSHA) regulations published in Section 1910.111 of 29 CFR (and Section 509 of Title 8, CCR).  These standards and regulations limit the maximum ammonia storage capacity of the tank to approximately 57,900 pounds.\n\nFor purposes of the offsite consequence analyses, the RMP regulations define the toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 ppm).  This concentration has been established by the American Industrial Hygiene Association as the Emergency Response Planning Guideline Level 2 (ERPG-2).  \n\nERPG-2 is the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\n\nWorst-Case Release Scenario and Alternative Release Scenario\n\nOffsite consequence analyses are used as tools to assist in emergency response planning.  The RMP regulations require the owner or operator of a stationary source to analyze the offsite impacts due to an accidental release of a regulated substance.  The offsite consequence analysis for a Program 3 process must analyze the worst-case release scenario and an alternative release scenario.  Since DAI Oildale, Inc.'s SCR system is considered a Program 3 process, both release scenarios were evaluated in the offsite consequence analysis.\n\nThe offsite consequence analysis must include an estimate of the residential population within an area potentially affected by the accidental release scenario.  This are"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4850,
      "SummaryText": "a is defined as a circle with a radius equivalent to the distance the release would travel with concentrations at or above the endpoint.  The circle also defines the area in which potential environmental receptors must be identified.\n\nThe worst case release is defined by the U.S. EPA as the total release of the contents of the single largest vessel or pipe within 10 minutes.  For liquefied gases stored under pressure, the entire contents of the vessel or pipe are assumed to be released as a vapor.  A total vapor release is highly unlikely.  However, this standardized worst case scenario was developed for emergency response agencies to use for planning purposes.\n\nAn alternative release scenario is a release that is more likely to occur than the worst-case release scenario.  For DAI Oildale, Inc., the alternative release scenario was selected based on the results of the Hazard and Operability Study for the ammonia-based SCR process.  The worst credible release event with the highest discharge rate would potentially have the greatest offsite impact.  A failure of the ammonia delivery hose was identified in the Hazard and Operability Study as the worst credible release event having the highest release rate, and therefore, was chosen as the alternative release scenario.    \n\nDAI Oildale, Inc. has analyzed the offsite consequences of the worst-case and alternative release scenarios.  For the worst-case release scenario, the release of 58,000 lbs. of ammonia with a duration of 10 minutes, the plume would travel 2.8 miles at concentrations at or above the endpoint. \n\nSensitive receptor information is provided in the RMP*Submit.  Using 1990 Census data, the population potentially affected within the worst-case release scenario circle is 21,000 people.  Of the sensitive receptors, schools, day care facilities, hospitals, and parks were located within the circle.  There were no environmental receptors within the worst case release scenario circle.\n\nDAI Oildale, Inc. has instal"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4850,
      "SummaryText": "led a passive mitigation system to aid in the control of ammonia if a release were to occur.  This passive mitigation system consists of a concrete containment wall that surrounds the ammonia storage tank and the vaporizer system.  A release of liquid ammonia from the storage tank could be contained in the area.  The containment of the liquid ammonia release would limit the surface area of the ammonia pool that would be in contact with the ambient air, thereby decreasing the rate of evaporation.\n\nThe active mitigation system consists of a water deluge system that can spray water onto and around the ammonia storage tank.  In the event of a fire, this deluge system can be used to cool the tank and help mitigate a temperature induced overpressure release.  The deluge system is automatically activated by a high pressure alarm switch on the storage tank.  The deluge system can also be manually activated by plant personnel.\n\nThe ammonia storage system is also equipped with a water deluge system that can spray water onto and around the storage tank.  In the event of a fire, this deluge system can be used to cool the tank and help mitigate a temperature induced overpressure release. \n\nAlthough mitigation systems are installed, specific mitigation factors cannot be assigned to the systems in accordance with the U.S. Environmental Protection Agency's RMP Offsite Consequence Analysis Guidance document.  Therefore, no mitigation factors were included in the modeling.  As such, the modeling results should be substantially overstated.\n\nIn the alternative release scenario, a failure of the delivery hose was modeled as a release of liquefied ammonia stored under pressure.  For a release of 554 lb/min of anhydrous ammonia, the plume would travel 0.2 mile at concentrations at or above the endpoint.  No residences are located within the 0.2 mile area around the DAI Oildale, Inc. facility.  As such, there would be no population impacts from the alternative release scenario.  There were"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4850,
      "SummaryText": " also no sensitive or environmental receptors within the alternative release scenario circle. \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nA PSM program, which meets the requirements of the general accidental release prevention program, has been developed at DAI Oildale, Inc. to address the anhydrous ammonia system.  The PSM program includes the following chemical-specific prevention steps:\n\n    Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process has been compiled.\n\n    An initial Process Hazard Analysis (PHA) was performed and has been updated and revalidated.\n\n    Written operating procedures have been developed and implemented, and are reviewed at least annually.\n\n    Safe work practices, such as lockout/tagout, confined space entry, opening process equipment or piping, and control over entrance into the facility have been developed and implemented.\n\n    Each employee involved in operating the ammonia system has received initial training and refresher training at least every three years.\n\n    Written mechanical integrity procedures have been established and implemented.\n\n    A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system.\n\n    Pre-startup safety reviews are performed when a modification is made to the ammonia system that is significant enough to require a change in the process safety information.\n\n    Audits are conducted at least every three years to evaluate compliance with the CalARP regulations.\n\n    Incident investigation procedures have been established.\n\n    A written plan of action regarding the implementation of employee participation has been developed and implemented.\n\n    Hot work permits are issued for all hot work operations conducted on or near the ammonia system.\n\n    A Contractor Safety Policy has been developed and implemented.\n\nTo ensure that t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4850,
      "SummaryText": "he general accidental release prevention program and the chemical-specific prevention steps are implemented, DAI Oildale, Inc. has assigned overall responsibility for the RMP elements to the Plant Manager.  The Plant Manager has the overall responsibility for the development, implementation, and integration of the RMP elements.\n\nFive-Year Accident History\n\nDAI Oildale, Inc. has not had any accidental releases from the ammonia-based SCR system that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\nEmergency Response Program\n\nDAI Oildale, Inc. has established emergency procedures and mechanisms to notify emergency responders when there is a need for a response.  However, an emergency response program does not need to be developed for the facility since DAI Oildale, Inc. employees will not respond to accidental releases of ammonia, the facility is included in the community emergency response plan, and appropriate mechanisms are in place to notify emergency responders.\n\nPlanned Changes To Improve Safety\n\nBased on the most recent revalidation of the PHAs, in June, 1999, no changes were recommended.  Through the accidental release prevention program, DAI Oildale, Inc. regularly evaluates the need for any changes to improve safety.  Currently, DAI Oildale, Inc. does not have any additional changes planned to improve safety. \n        \n\n"
    }
  ]
}