{
  "FacilityID": 48521,
  "FacilityName": "Solvay Solexis, Inc. - Orange Facility",
  "FacilityStr1": "4059 FM 1006",
  "FacilityStr2": null,
  "FacilityCity": "Orange",
  "FacilityState": "TX",
  "FacilityZipCode": "77630",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48361",
  "LEPC": "Orange County LEPC",
  "FacilityLatDecDegs": "30.048611",
  "FacilityLongDecDegs": "-093.771944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.solvaysolexis.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 154288492,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Solvay Solexis, Inc.",
  "OperatorStr1": "P. O. Box 3860",
  "OperatorStr2": null,
  "OperatorCity": "Orange",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77631",
  "OperatorZipCodeExt": "3860",
  "FTE": 33,
  "OtherEPAFacilityID": "TXD981513963",
  "EPAFacilityID": "100000154316",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-10-07 00:00:00",
  "SafetyInspectionBy": "Texas Commission on Environmental Quality",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "04/07/06",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-04-04 10:48:22",
  "ErrorReportDate": null,
  "ReceiptDate": "2006-04-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2006-04-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2011-04-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 30.048611,
  "FRS_Long": -93.771944,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70361,
      "AltID": "Fluoropolymers Manufactur",
      "FacilityID": 48521,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 93563,
          "ProcessID": 70361,
          "ChemicalID": 117,
          "Quantity": 210000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 72053,
          "ProcessID": 70361,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 41406,
              "Process_NAICS_ID": 72053,
              "SafetyReviewDate": "2011-03-31 00:00:00",
              "PHA_Date": "2011-06-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-06-11 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Fire Water Monitor",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-12-31 00:00:00",
              "TrainingReviewDate": "2011-03-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Job and Process Specific Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-12-31 00:00:00",
              "EquipmentInspectionDate": "2011-03-22 00:00:00",
              "EquipmentTested": "R-803",
              "ChangeMgmtDate": "2011-02-26 00:00:00",
              "ChangeMgmtReviewDate": "2010-12-31 00:00:00",
              "PreStartupReviewDate": "2010-09-21 00:00:00",
              "ComplianceAuditDate": "2010-05-20 00:00:00",
              "AuditCompletionDate": "2011-06-30 00:00:00",
              "IncidentInvestigationDate": "2011-03-23 00:00:00",
              "InvestigationChangeDate": "2011-03-31 00:00:00",
              "ParticipationPlansReviewDate": "2010-12-31 00:00:00",
              "HotWorkPermitReviewDate": "2011-03-31 00:00:00",
              "ContractorSafetyReviewDate": "2011-01-27 00:00:00",
              "ContractorSafetyEvalDate": "2010-12-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 60482,
                  "PreventionProgram3ID": 41406,
                  "ProcessChemicalID": 93563
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48521,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-02-16 00:00:00",
    "ERTrainingDate": "2010-01-13 00:00:00",
    "CoordinatingAgencyName": "City of Orange Fire Department",
    "CoordinatingAgencyPhone": "4098831050",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48521,
      "SummaryText": "SOLVAY SOLEXIS, INC.\nORANGE PLANT\nRISK MANAGEMENT PLAN EXECUTIVE SUMMARY\n\n1.\tAccidental Release Prevention and Emergency Response Policies\n\nAt the Solvay Solexis Orange Plant, we are committed to operating and maintaining all of our processes in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.\n\nWe are a member of the American Chemistry Council (ACC) Responsible Care Program.  The ACC Responsible Care Program goes beyond the boundaries of regulatory compliance and strives for continuous improvement in industry operations and processes by incorporating health, safety, and environmental protection into all stages of a products life Â¿ design, manufacture, marketing, distribution, use, recycling, and disposal.\n\nThe Orange plant participates in the Orange Community Advisory Panel of local citizens who meet regularly with plant management to discuss various issues, especially those related to environmental, safety, and health.  This mechanism was established to better understand and address the needs and concerns of the local community.\n\nSolvay Solexis has been proactive in communicating our risk management program with the community.  A RMP Community Awareness event was in public meetings during April of 1998 and included participation by local industry and the local emergency response community.  The Community Advisory Panel toured our plant and employees and management were available to answer questions.  Information was distributed that explains our plantÂ¿s safety programs, release scenarios, and emergency response program.  The presentation to the general public was repeated during the communityÂ¿s annual Â¿Gumbo Cook-Off FestivalÂ¿ on May 2,1998.\n\nThe following is taken from Solvay SolexisÂ¿ Corporate Safety Policy:\n\nSolvay Solexis, Inc. (Â¿Solvay SolexisÂ¿) is committed to provid"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48521,
      "SummaryText": "ge plant became fully operational in 1982, was purchased by Ausimont USA, Inc. in 1986, and effective January 1, 2003, changed its name to Solvay Solexis, Inc.\n\nThe regulated substance at the Orange plant is trifluorochloroethylene, a flammable substance which is the primary raw material used in the manufacture of HALAR&reg;. Trifluorochloroethylene is also known as chlorotrifluoroethylene, or CTFE. \n\n3.\tGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe facility is regulated under the OSHA Process Safety Management rules, which regulates the management of process safety.  Our management systems address each of the key features of successful prevention programs including:\n\nProcess Safety Information: A variety of technical documents are kept that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters, and equipment design basis/configuration information.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment.\nProcess Hazard Analysis:  A comprehensive program ensures that hazards associated with the various processes are identified and controlled.  Within this program, each process or process change is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.  This is performed by a team, which identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and makes recommendations for additional prevention and/or mitigation measures when deemed necessary.\nStandard Operating Procedures:  Operating procedures provide clear daily instructions for safely conducting activities involved in each process, consistent with the process safety information.  The written procedures address steps for each operating phase, operating limits, emergency shutdown procedur"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 48521,
      "SummaryText": "cuation procedures, HAZMAT procedures, and emergency response equipment information.\nOur Emergency Response Plan has been coordinated with local emergency management services.  Local community emergency responders also participate in annual drills at the facility.  There is a post-drill review of all exercises to access the effectiveness of the Emergency Response Plan.\nSolvay Solexis is a member of the mutual aid organization, Sabine Neches ChiefÂ¿s Association. Equipment from surrounding companies is made available in the event of an emergency.  The plant has an industrial contract with the city of Orange for Fire Department response.\nEmergency Response Training- All emergency response team members receive annual training in:  alarm identification and response, response to a release, use of personal protective equipment, rescue procedures, evacuation procedures, medical / first aid procedures, action plans dealing with specific scenarios, specifically assigned emergency response duties, regulations review, hazard communication / toxicology / health hazard review, air monitoring equipment, decontamination, containment procedures and spill control techniques.\n\nEmergency Response Equipment and Systems- In the event of an emergency, the following is some of the response equipment available onsite so mitigation activities can begin immediately:\nÂ¿\tHighly trained emergency responders on every shift\nÂ¿\tPersonal protective equipment (e.g., protective clothing, self-contained breathing apparatus)\nÂ¿\tValves to permit isolation of the process (manual or automated)\nÂ¿\tAutomated shutdown systems for specific process parameters (e.g., high level, high temperature)\nÂ¿\tCurbing or diking to contain liquid releases\nÂ¿\tRedundant equipment and instrumentation (e.g., backup power supply for process control system)\nÂ¿\tFire suppression and extinguishing systems\nÂ¿\tDeluge system for specific equipment and raw materials storage area\nÂ¿\tHigh pressure firewater system with remote and manual"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 48521,
      "SummaryText": "water spray suppression systems to cool equipment and to dilute and disperse vapors\nÂ¿\tVideo camera system offers 24 hour remote monitoring of the facility\nÂ¿\tSpill containment equipment and supplies\nÂ¿\tAir monitoring equipment\nÂ¿\tNeutralization of liquid spills\nÂ¿\tTwo-way radio communication with emergency responders\n\n6.\tPlanned Changes To Improve Safety\n\nWe will continue to incorporate the findings from incident investigations and the recommendations developed during process hazard analysis as a means of continuously improving the safety at the Orange Plant."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48521,
      "SummaryText": "e a safe and healthy working environment for its employees and the employees of contractors working at Solvay Solexis sites, and to provide a safe and healthy environment for the communities in which we operate.  It is also the policy of Solvay Solexis that all our operations are in compliance with applicable laws and regulations.  Additionally, it is Solvay SolexisÂ¿ policy to supply all available information pertaining to safe handling and use of its materials to customers.\n\nThe following specific points are included in Solvay Solexis policy.\n\n-Solvay Solexis, in all its operations, is committed to achieving excellence in safety.  All other activities should be consistent with this goal.\n\n-Compliance with safety and environmental laws and regulations is our top priority.  No other operations will take priority over this objective.\n\n-It is Solvay SolexisÂ¿ premise that all accidents and injuries are preventable.  Therefore, every reasonable and practical effort will be made in the interest of preventing accidents that cause personal injury or property damage, both inside the corporation and outside.\n\n-Safety is the direct responsibility of all levels of line management and is an important measure of managerial performance.\n\nThe Orange Plant recognizes and is concerned that every employee shall be furnished a safe and healthful place to work, free from recognized hazards that might cause serious injuries and illness.  Every effort will be made in the interest of accident prevention, health preservation, and fire protection.\n\n\n\n2.\tStationary Source and Regulated Substances\n\nSolvay Solexis has developed and currently markets a family of fluorine based products that are noted for their exceptional resistance to chemical agents and environments, which attack and degrade other materials.  At the Orange plant, various grades of HALAR&reg; are manufactured that are used by customers in a number of applications, including the formulation of wire and cable coatings. The Oran"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48521,
      "SummaryText": "es, and safety and health considerations.\nTraining:   We have established a comprehensive training program to certify operators in both unit operations and emergency response procedures.  This requires operators to demonstrate (through written testing and hands-on examinations) that they have adequate knowledge before they can work independently.  This training includes emphasis on the specific safety and health hazards, emergency operations including shutdown, and safe work practices applicable to the employeeÂ¿s job tasks.  There is annual refresher training for all operators on the operating procedures and chemical hazards of the process.\nMechanical Integrity:  An established preventive maintenance and equipment integrity program promotes that all process equipment is operating within approved limits.  The initial and on-going integrity of process equipment is ensured by determining that the equipment is designed, installed and maintained properly.  This includes testing and inspection of equipment and quality assurance checks of equipment, spare parts and maintenance materials.  Any deficiencies, which are found, are required to be corrected before the equipment is returned to service.\nManagement of Change: A compliance program ensures that changes to equipment, chemicals, technology (including process operating conditions), and operating procedures are properly reviewed and authorized before being implemented. Changes are reviewed to confirm that adequate controls are in place to manage the change and that existing controls have not been compromised by the modification.  All changes are verified with a pre-startup safety review, all relevant process safety information is updated, and all affected employees are notified of the change.\nPre-startup Safety Review:  A pre-startup safety review is performed for all modifications, which resulted in a change in the process safety information.  This review ensures that all construction and equipment is in accordance wit"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48521,
      "SummaryText": "h the design specifications, that the safety, operating, maintenance, and emergency procedures are current and adequate, that a process hazard analysis has been performed if required and that all recommendations have been addressed; and that employees have been trained on the change.\nCompliance Safety Audits: Audits are performed to verify that all procedures and practices developed under the process safety standard are adequate and are being followed.  This is performed by an audit team of both hourly and management personnel.  All findings of the audit are promptly addressed and are tracked to ensure they have been corrected.\nIncident Investigation: All incidents are investigated and appropriate corrective actions are made to prevent recurrence. The investigations are conducted to determine the facts and develop recommendations, which are tracked to completion.  These are reviewed with all employees during monthly safety meetings, as well as any recommendations from our employee safety committee.\nEmployee Participation: Employees are encouraged to participate in all areas of process safety management, including the conduct and development of process hazard analysis and other process safety information.  The Employee Safety Committee meets once per month to review new information and address the concerns of the plant employees.\nHot Work Permit: A permit is required to be issued before any hot work operations can be performed on or near a processing area.  This ensures that all fire prevention and protection have been implemented and that employees in the area are aware of the activity.\nContractors:  All contractors working in the plant receive training on all facility rules and regulations, chemical/process hazards, and emergency procedures.  The contractorÂ¿s safety records are pre-screened before they are hired, and they are periodically audited to ensure that they are working safely and following all plant rules and regulations.\nInspections:  There are a number"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48521,
      "SummaryText": "of safety inspections conducted by plant personnel, including weekly process unit safety inspections by the operators and monthly management inspections.\nMonitoring:  A computer controlled monitoring and process system continuously evaluates key system conditions with alarms/interlocks/shutdown to a manned control room and routine checks are conducted every work shift to promote safe operations.\n\nAs part of our prevention efforts, we have implemented the following chemical-specific prevention steps for CTFE:\nSystem Design: The storage tank and charge pumps are maintained in a diked area. A fixed fire monitor provides coverage for this area.\nAlarms:  Leak detection system sensors immediately alert the operator in the control room if a leak were to occur.  \n\n4.\tFive-year Accident History\n\nThere has not been an accident from a covered process that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the past five years at this facility.\n\n5.\tEmergency Response Program\n\nThe Emergency Response Program is designed to assure that the Solvay Solexis employees are prepared to respond to emergency situations, which may occur at the facility.  The Program involves the following elements:\n\nEmergency Response Plan- We maintain an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  The plan includes instructions for: emergency reporting and plan activation, notification of emergency responders, emergency shutdown procedures, establishment of a emergency command center and field command post, duties of key individuals, procedures for fire, chemical release, off-site spills, hurricane, and bomb threat, eva"
    }
  ]
}