{
  "FacilityID": 48581,
  "FacilityName": "Kenyon Zero Storage/The Freezer Group LLC",
  "FacilityStr1": "100 Benitz Road",
  "FacilityStr2": null,
  "FacilityCity": "Prosser",
  "FacilityState": "WA",
  "FacilityZipCode": "99350",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County LEPC",
  "FacilityLatDecDegs": "46.220139",
  "FacilityLongDecDegs": "-119.734806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G4",
  "LatLongDescription": "ST",
  "FacilityURL": "kenyonzero.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Kenyon Zero Storage",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Kenyon Zero Storage",
  "OperatorStr1": "250 Grandridge",
  "OperatorStr2": null,
  "OperatorCity": "Grandview",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98930",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000106173",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-11-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2004-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2004-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 46.22014,
  "FRS_Long": -119.73481,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70471,
      "AltID": "Refrigeration System",
      "FacilityID": 48581,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 93693,
          "ProcessID": 70471,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 72165,
          "ProcessID": 70471,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 41467,
              "Process_NAICS_ID": 72165,
              "SafetyReviewDate": "1998-08-07 00:00:00",
              "PHA_Date": "1998-05-27 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-08-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Isolation valves;computer control system;automated liquid level controls;pressure vessels to ASME code;pipes welded by certified welders",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-08-07 00:00:00",
              "TrainingReviewDate": "1998-08-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-08-07 00:00:00",
              "EquipmentInspectionDate": "2004-04-01 00:00:00",
              "EquipmentTested": "Pressure Vessels/Relief Valves",
              "ChangeMgmtDate": "1998-08-07 00:00:00",
              "ChangeMgmtReviewDate": "1998-08-07 00:00:00",
              "PreStartupReviewDate": "1998-08-15 00:00:00",
              "ComplianceAuditDate": "2001-07-31 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-08-07 00:00:00",
              "HotWorkPermitReviewDate": "1998-08-07 00:00:00",
              "ContractorSafetyReviewDate": "1998-08-07 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Refrigeration System",
              "_chemicals": [
                {
                  "PrimaryKey": 60557,
                  "PreventionProgram3ID": 41467,
                  "ProcessChemicalID": 93693
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48581,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-08-07 00:00:00",
    "ERTrainingDate": "1999-02-08 00:00:00",
    "CoordinatingAgencyName": "Sunnyside Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48581,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\n1.10 Accidental Release Prevention And Emergency Response Policies\n\nThe Kenyon Zero Storage refrigeration system uses pure anhydrous ammonia (a commonly used refrigerant for\nindustrial systems)as the refrigerant. Given the quantity handled, anhydrous ammonia is considered a\nhazardous substance by EPA. Many of the properties that make ammonia valuable as a refrigerant also requires\nthat precautions and procedures be in place to protect employee and public health and safety during a chemical\nemergency. It is the policy of Kenyon Zero Storage to be in compliance with all applicable federal and state rules\nand regulations.\n\nSafety at our facility is inherent on the manner in which anhydrous ammonia is handled. While the design of the\nfacility incorporates a multitude of safety devices, safe handling procedures combined with appropriate training of\nour personnel are key aspects to maintaining safety at our facility.\n\nWe have a written Process Safety Management (PSM) plan that complies with the regulations stipulated by WAC\n296-67-017. A crucial component of this plan is the Emergency Response Plan, developed in compliance with\nthe Emergency Response provisions of WAC 296-62-3112. The Emergency Response Plan includes pre-\nemergency planning and coordinating with outside parties. This enables those who deal with emergencies to\nhave a course of action to effectively deal with unplanned events.\n\n1.20 Facility Description And Substances Handled\n\n- Kenyon Zero Storage is a facility that stores refrigerated and frozen foods. Production requires the use of a\nrefrigeration system to preserve the integrity of processed foods. This refrigeration process uses ammonia as a\nrefrigerant. Access to the facility is restricted to authorized employees, management personnel, and contractors.\n- The regulated substance handled at this facility is anhydrous ammonia.\n- The ammonia refrigeration system maximum inventory is 12,000 pounds of anhydrous ammonia. There is no\nst"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48581,
      "SummaryText": "andby make-up inventory kept on-site.\n\n1.30 The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls\nand mitigation measures to limit the distances for each reported scenario.\n\nRelease scenarios were modeled using RMP*Comp ( Version 1.06 ), a software program develped by the \nNational Oceanic and Atmospheric Administration (NOAA) and EPA. Offsite receptors were defined using the\nLandView lll (Version 1.0) system. This system estimates residential population within the circle defined by the\nendpoint of the worst-case and alternative release scenarios. In addition, it lists whether certain types of public\nreceptors and environmental receptors are within the circles.\n\n-Worst-Case Scenario. Catastrophic failure of the High Pressure Receiver, located in the engine room, when\nfilled to the greatest amount would release 12,000 pounds of liquid ammonia. This scenario presumes that the \nentire contents are released.\n\nThe distance to the toxic endpoint for the worst-case scenario is 1.5 miles from the point of release. This\ndistance extends beyond the facility fence line, and would encompass a population of 1,190 with the closest\nresidence approximately 1,000 feet from the site. A school is 1 1/4 miles away and a hospital is about one mile\naway, inside of this release zone. A freeway is about 1,000 feet to the west, south and east; the Yakima River\nand industrial facilities are within close proximity. No other public or environmental receptors are located within\nthis zone.\n\nThis worst-case scenario would not likely occur unless an act of nature(e.g., earthquake) physically\ncompromised the tank. The structural integrity of the tank is safeguarded by periodic inspection  for mechanical\nintegrity to prevent a rupture due to tank degradation. The tank is also safeguarded from rupture from over-\npressurization. It is a rated pressure vessel hydro-tested to 375 psi and equipped with 250 psi pressure relief\nvalves. The design spec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48581,
      "SummaryText": "ification of the tank only allows a maximum capacity of 80% at 80 degrees F, limiting the total\namount of ammonia in the system. During high demand, the High Pressure Receiver may only be filled to a \nfraction (-30%) of capacity.\n\n-Alternative Scenario. Several alternative scenarios can generate the equivalent of a 1\" opening in a high\npressure liquid line. Alternative scenarios could include an opening created  by a valve sheared off, a large\ngasket leak, or a pressure relief valve release. These scenarios presumes a release duration of 10 minutes\nresulting in a loss of 12,000 pounds of liquid ammonia. This scenario was selected because a release of this \ntype would occur outdoors resulting in the highest potential exposure to offsite receptors.\n\nThe distance to the toxic endpoint for the alternative scenario is 0.6 miles from the point of release. This\ndistance extends beyond the facility fence line, and would encompass a population of 240 with the closest\nresidence approximately 1,000 feet from the site, inside of this release zone. A school is 1 1/4 miles away and a\nhospital is about one mile away, outside of this release zone. A freeway is about 1,000 feet to the west,south,\nand east; the Yakima River and industrial facilities are within close proximity. No other public or environmental\nreceptors are located within this zone.\n\nThe severity of release from this scenario would likely be less since safety system provisions are in place to limit\nthe release duration to less than ten minutes through the use of appropriately placed isolation valves.\n\n1.40 General Accidental Release Prevention Program And Chemical-Specific Prevention Steps\n\nKenyon Zero Storage complies with EPA's Accidental Release Prevention Rule and with all applicable state\ncodes and regulations. The design and construction of this facility was in accordance with published standards,\ntests or recommended methods of trade, industry or governmental organizations.\n\nKenyon Zero Storage's written PSM pl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48581,
      "SummaryText": "an incorporates many policies and procedures to ensure safe operation\nand maintenance of this facility. Plan elements essential to safe operation of the refrigeration system include\nemployee participation, process hazard information, process hazard analysis, operating prcedures, training,\ncontractor safety, pre-startup safety review, mechanical integrity, management of change, hot-work permits,\nincident investigation, emergency response and planning, and compliance audits. This plan will be reviewed\nannually and updated as necessary by the Kenyon Zero Storage Safety Supervisor.\n\nTraining is provided to ensure that each employee involved in operating a process has been trained in an \noverview of the process, the operating procedures, and safety considerations. This training uses guidelines\ndeveloped by the International Institute of Ammonia Refrigeration (IIAR) and Refrigeration Engineers Technology\nAssociation (RETA). Only qualified maintenance personnel operate and interact with the refrigeration system.\nThis minimizes the chances of inadvertent error in operation that could lead to a release of ammonia. Startup ,\nshutdown, and any onstream adjustments are handled by these qualified persons.\n\n1.50 Five-Year Accident History\n\nThere has been no significant release of ammonia at the Kenyon Zero Storage since the startup in 1998\n\n1.60 Emergency Response Program\n\nKenyon Zero Storage has a written Emergency Response Plan developed to ensure that precautions and \nprocedures are in place to protect employee and public health and safety during a chemical emergency. It \ncomplies with the provisions of WISHA Emergency Response regulations, WAC 296-62-3112. The Emergency\nResponse Plan includes pre-emergency planning and coordinating with outside parties. This enables those who \ndeal with emergencies to have a course of action to effectively deal with unplanned events. This plan has been \nreviewed with the Prosser Fire Department.\n\nThe approach in the development of this plan h"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48581,
      "SummaryText": "as been to identify the ammonia emergencies most likely to occur\nat Kenyon Zero Storage and establish precautions and procedures to protect life safety and health during an \nemergency. The refrigeration process has back-up prevention systems to keep processing malfunctions from \nbecoming ammonia release emergencies. If an emergency does occur, the following response personnel,\nfacilities, and equipment are in place:\n\n-Incident Command Center\n-Emergency Alarm and Communication System\n-Emergency Response Team\n-Safe-Rooms, Evacuation Plans, and Assembly Points\n-Personal Protective Equipment\n\nThe role and procedures for obtaining external emergency assistance have been formally established with the \nProsser Fire Department, including the Yakima Regional HazMat Team stationed in Yakima. The Emergency\nResponse Plan also includes procedures for notification of any potentially affected neighbors.\n\nAll Kenyon Zero Storage personnel will be trained to fulfill their designated responsibilities in an emergency.\nMock emergency drills will be held periodically to maintain familiarity with response actions and identify plan\nelements requiring improvement.\n\nThis plan will be reviewed annually and updated as necessary by the Kenyon Zero Storage Safety Supervisor.\n\n1.70 Planned Changes To Improve Safety\n\nThis is a newly constructed facility that started production operations in 1998. All system components meet\ndesign specifications in ANSI/IIAR 2-1992, equipment, design, and installation of ammonia mechanical\nrefrigerating systems. All pressure vessels are built according to American Society of Mechanical Engineers\n(ASME), Section VIII, Division 1, 1995 Edition (1996 Addenda), ASME Boiler and Pressure Vessel Code,\npressure vessels. Any upgrades or extensive maintenance work performed in the future will be in compliance\nwith those standards applicable at that time.\n\nAll Kenyon Zero Storage personnel are trained to fulfill their designated responsibilities in an emergency. Mock \nemerge"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 48581,
      "SummaryText": "ncy drills will be held periodically to maintain familiarity with response actions and identify elements \nrequiring inprovement.\n\nProcess Hazard Analysis (PHA) Recommendations Resolution did not identify any recommendations that \nrequired resolution prior to startup. The highest hardware recommendation was to install an ammonia detector \nand conduct periodic inspections to prevent a compressor shaft seal leak. Future hardware changes include the\n5-year changeouts of pressure relief valves according to IIAR recommendations. This is due in August, 2003."
    }
  ]
}