{
  "FacilityID": 48954,
  "FacilityName": "The Dannon Company, Inc.",
  "FacilityStr1": "The Dannnon Company, Inc.",
  "FacilityStr2": "216 Southgate Drive",
  "FacilityCity": "Minster",
  "FacilityState": "OH",
  "FacilityZipCode": "45865",
  "Facility4DigitZipExt": "0122",
  "FacilityCountyFIPS": "39011",
  "LEPC": "Auglaize County LEPC",
  "FacilityLatDecDegs": "40.383194",
  "FacilityLongDecDegs": "-084.376252",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dannon.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 57454019,
  "ParentCompanyName": "The Dannon Company, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 57454019,
  "Company2DUNS": null,
  "OperatorName": "The Dannon Company, Inc.",
  "OperatorStr1": "The Dannnon Company, Inc.",
  "OperatorStr2": "216 Southgate Drive",
  "OperatorCity": "Minster",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45865",
  "OperatorZipCodeExt": "0122",
  "FTE": 420,
  "OtherEPAFacilityID": "45865danno21650",
  "EPAFacilityID": "100000117358",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-05-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "2007 Dannon Minster Resubmit",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-06-28 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-06-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-06-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.383619,
  "FRS_Long": -84.374847,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "1",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70909,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 48954,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 94161,
          "ProcessID": 70909,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 72610,
          "ProcessID": 70909,
          "NAICSCode": "31151",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 41567,
              "Process_NAICS_ID": 72610,
              "SafetyReviewDate": "2007-05-09 00:00:00",
              "PHA_Date": "2007-03-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-02-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Error, Facility Siting, Ventilation, Detection",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Emergency Dump Station",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Removed ammonia coils in cooling tunnels and process ares and replaced with glycol cooling",
              "OpProceduresReviewDate": "2007-03-12 00:00:00",
              "TrainingReviewDate": "2007-03-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-03-12 00:00:00",
              "EquipmentInspectionDate": "2006-12-27 00:00:00",
              "EquipmentTested": "Complete mechanical integrity inspection per IIAR bulletin 109 on all refrigeration system.",
              "ChangeMgmtDate": "2007-05-21 00:00:00",
              "ChangeMgmtReviewDate": "2007-05-21 00:00:00",
              "PreStartupReviewDate": "2007-05-03 00:00:00",
              "ComplianceAuditDate": "2006-05-10 00:00:00",
              "AuditCompletionDate": "2006-12-01 00:00:00",
              "IncidentInvestigationDate": "2005-03-04 00:00:00",
              "InvestigationChangeDate": "2005-06-14 00:00:00",
              "ParticipationPlansReviewDate": "2007-03-04 00:00:00",
              "HotWorkPermitReviewDate": "2007-04-20 00:00:00",
              "ContractorSafetyReviewDate": "2007-04-20 00:00:00",
              "ContractorSafetyEvalDate": "2007-04-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 60682,
                  "PreventionProgram3ID": 41567,
                  "ProcessChemicalID": 94161
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 48954,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-04-20 00:00:00",
    "ERTrainingDate": "2007-04-20 00:00:00",
    "CoordinatingAgencyName": "LEPC",
    "CoordinatingAgencyPhone": "4197382147",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48954,
      "SummaryText": "The Dannon Company is proud to inform all interested parties that our company is complying with OSHA's Process Safety Management Standard (PSM), Title 29 Code of Federal Regulations 1910.119, and EPA's Risk Management Program regulations (RMP), Title 40 CFR Part 68. In addition to other state and local codes applicable to our facility and process. We have undertaken this process to deal with the risks involved with the storage, handling, and use of Anhydrous Ammonia in our facility.\n\nOur goal is to promote overall worker, public, and plant safety. The Dannon Company facility is located at 216 Southgate Drive, Minster, Ohio. We manufacture some of the finest cultured dairy products (yogurt) in the world. The facility covers approximately 300,000 square feet and includes processing tanks, piping, packaging equipment, raw materials warehousing, finished goods refrigerated storage, an Ammonia refrigeration engine room, boilers, and miscellaneous utilities. Also located at the facility are a raw milk processing plant, shipping and receiving docks, and a waste water treatment plant. \n\nThe facility produces and ships approximately 400 million pounds of finished product each year.  The refrigeration system required for our production process necessitates the submission of this Risk Management Plan. The refrigeration system contains in excess of 30,000 pounds of anhydrous ammonia. This surpasses the threshold quantity of 10,000 pounds outlined in Process Safety Management and Risk Management Program regulations.\nAccidental release prevention and emergency response policies.\n\nThe Dannon Company has implemented numerous policies and procedures to enable our facility to prevent the occurrence, and minimize the consequences of significant releases of Anhydrous Ammonia as well as other hazardous substances, fires, explosions, and other types of catastrophic accidents. Overall these programs prevent accidental fatalities, injuries, and illnesses and avoid property damage.  Our saf"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48954,
      "SummaryText": "ety programs prevent accidents because they focus on the rules, procedures, and practices, which govern individual processes, activities, or pieces of equipment. These rules are detailed and improved as necessary. They are also communicated to and accepted by all employees at our facility.\n\nThe Dannon Company has organized the information and polices pertaining to the process into a complete library. This library also incorporates the use of videos and computerized tests.\n\nVolume 1 of the PSM/RMP Library incorporates several policies. Many policies are included in Volume 1, the remaining are referenced from other training manuals maintained in the facility.\n\nA policies included in volume 1 is a Plan of Employee Participation. This policy outlines the commitment between management and employees to establish a program for a successful (safe) program.\n\nThe Written Process Safety information includes information on the ammonia inventory at the facility, applicable codes, design standards, and information pertaining to the hazards of ammonia (referenced from the IIAR ammonia Data Book).\n\nA Policy for Opening the Ammonia Refrigeration System has been included. It incorporates procedures for working on the ammonia refrigeration system in the few areas not covered by a standard operating procedure (new equipment tie-ins, isolation and removal of existing equipment, evacuation and abandonment of refrigeration mains, etc.)\n\nThe Support Personnel Entry policy establishes a program that covers the entrance and exit of the facility by employees, management, contractors, and visitors.\n\nAn extensive Contractor Qualification Program has been established to verify that the contractors working in the facility are qualified to work on the system, trained in the hazards associated with their work, and made aware of the hazards presented by the facility to the employees of the contractor.\n\nA Management of Change and Pre-Startup Safety review program has been developed to monitor and pro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48954,
      "SummaryText": "vide a checks and balances system to monitor changes in the facility and to verify that changes are safe and consistent with company policy.\n\nProcedures for conducting Compliance Audits, Mechanical Integrity Inspections, and Process Hazard Analyses have also been developed.\n\nMany more specific programs and policies (Hot Work, Confined Space, Lockout / Tagout, etc.) have been developed. For information specific to these see the Site Safety Coach.\n\nWritten Emergency Response Plan is for all types of emergencies is also included in Volume I of the PSM / RMP Binder System.\n\nVolume 2 incorporates information on the specific system components (Pumps, vessels, compressors, evaporators, evaporative condensers, purgers, piping systems, heat exchangers, the emergency ventilation system, and general safety). This information is used as a reference source for the operator to positively identify system components. This manual also provides a checklist for performing the yearly Mechanical Integrity Inspection.\n\nVolume 3 incorporates a complete valve list. The valve list contains information on the type, port size, identifying number, use, location, model, manufacturer, drawing reference, and normal operating position of each valve in the system.\n\nAlso included in volume 3 is the Process and Instrumentation Diagrams for the individual system components. Flow schematics are included showing the entire system. A Block flow diagram provides a brief overview of the system. Drawings are included showing symbol and abbreviation descriptions. Plan views are included to allow the operator to physically locate equipment in the building.\n\nVolume 4 incorporates a complete set of standard operating procedures, describing the proper steps for preparing components for start-up, starting components, monitoring normal operation of system components, shutting down components as part of normal operation, restarting equipment as part of normal operation, shutting down equipment for maintenance, re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48954,
      "SummaryText": "starting equipment after maintenance, shutting down equipment in emergency situations, restarting equipment after an emergency situations shutdown, and pumpout procedures. Also included as a part of each Standard Operating Procedure is the Technical Operating Specifications for the associate system component. This information includes consequences of deviation from standard operating procedures.\n\nVolume 5 contains Operation and Maintenance Information including manufactures information, spare parts list, maintenance procedures, and preventive maintenance procedures.\n\nA 5 year revalidation Process Hazard Analysis was performed in September of 2003, which highlighted some deficiencies in the system. These items were addressed as part of the continuous improvement of the facility. These items were addressed on the basis of priority (Injuries to personnel). Items of a low priority (Process improvements) were budgeted for completion in a timely manner.\n\nThe Dannon Company also incorporates additional safety items such as tagging of all ammonia system valves and components, a PC / PLC based control system with a graphical operator interface.      The ammonia refrigeration system at The Dannon Company is a standard compression and evaporation style system.\n\nPROCESS DESCRIPTION\n\nThe Dannon Company, Minster, Ohio is a food based processing and distribution facility. The facility incorporates a standard evaporation and compression closed loop ammonia refrigeration system.\n\n5 YEAR ACCIDENT HISTORy\n\nThe Dannon Company is very happy to report that we had no reportable releases at our facility in the last 5 years.\n\nEMERGENCY RESPONSE PLAN\n\nThe Dannon Company has an Emergency Response Plan to establish procedures and guidelines to provide prompt and orderly response to emergencies involving the release of hazardous materials to prevent or minimize the potential health or environmental effects caused by such a release.\n\nThe Plan establishes lines of authority for conducting safe re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48954,
      "SummaryText": "sponse operations, personnel roles and training, and communication procedures.  All employees, including business area coaches and managers are expected to comply with the plan in order to assure its effectiveness.\n\nThe plan provides guidelines for determining emergency recognition, proper levels of response, emergency communication, selection of response personnel, security and control, decontamination, emergency equipment and personal protective equipment.  \n\nThe Emergency Response Team is made up of personnel selected from the Production, Maintenance, and Distribution Staff.  Personnel selected must complete the required OSHA 24 hour HAZWOPER training.  Incident Commanders receive an additional 8 hours of Incident Command Training.  All team members must receive an annual 8 hour refresher training to remain on the team.  Additional training includes monthly meetings, quarterly training sessions and an annual training session in coordination with the Minster Fire Department and Life Squad.\n\nA communication chain of command has been established to assure prompt and efficient response to any hazardous material spill or leak and effective coordination with the Minster-Jackson Township Fire Department.  The Fire Department will then notify the Auglaize County and/or Shelby County HAZMAT Team as necessary and the Auglaize County Emergency Management Agency if it appears neighbors and/or the environment will be affected by an incident.\n\nThe Dannon Company is committed to continuous improvement of our policies, procedures, and facility. It is the intention of The Dannon Company to remain an industry leader. New technology, training techniques, and equipment are continuously being added to our system."
    }
  ]
}