{
  "FacilityID": 4898,
  "FacilityName": "City of Faribault Wastewater Treatment Plant",
  "FacilityStr1": "214 N.E. 14th Street",
  "FacilityStr2": null,
  "FacilityCity": "Faribault",
  "FacilityState": "MN",
  "FacilityZipCode": "55021",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27131",
  "LEPC": null,
  "FacilityLatDecDegs": "44.309722",
  "FacilityLongDecDegs": "-93.266111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Faribault",
  "OperatorStr1": "208 1st Avenue NW",
  "OperatorStr2": null,
  "OperatorCity": "Faribault",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55021",
  "OperatorZipCodeExt": "5105",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000065617",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-12-13 00:00:00",
  "DeRegistrationEffectiveDate": "2010-11-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 44.30605,
  "FRS_Long": -93.27152,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "chlorine and sulfur dioxide were permanently taken out of service",
  "_processes": [
    {
      "ProcessID": 5727,
      "AltID": "Wastewater Treatment",
      "FacilityID": 4898,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 6179,
          "ProcessID": 5727,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5849,
          "ProcessID": 5727,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2378,
              "Process_NAICS_ID": 5849,
              "SafetyReviewDate": "1999-06-04 00:00:00",
              "PHA_Date": "1999-06-07 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-08-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-01 00:00:00",
              "TrainingReviewDate": "1999-03-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-01 00:00:00",
              "EquipmentInspectionDate": "1999-03-01 00:00:00",
              "EquipmentTested": "Entire system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-07 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-07 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-07 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2666,
                  "PreventionProgram3ID": 2378,
                  "ProcessChemicalID": 6179
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4898,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Faribault Fire Department",
    "CoordinatingAgencyPhone": "5073348773",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4898,
      "SummaryText": "This document was developed for the City of Faribaults Wastewater Treatment Facility (Faribault) in an effort to fulfill criteria of the Risk Management Program (RMP), as required by Section 112(r) of the Clean Air Act (CAA), and regulated by 40 CFR, Part 68.  Wastewater Treatment Facility utilizes primary and secondary biological treatment processes (chlorine disinfection followed by sulfur dioxide dechlorination).  The quantity of chlorine used at the Waterwater Treatment Plant (WWTP) is greater than EPA's Threshold Quantity of 2,500 pounds, the criteria for requiring the development and submittal of the information found in this RMP.  A hazard assessment was conducted for the chlorine process and consideration was also given to the other hazardous chemicals at the plant as well.\n\nChlorine is considered toxic by EPA standards.  The same properties that make chlorine valuable as a disinfecting agent, also make it necessary to observe certain safety precautions in handling these chemicals to prevent unnecessary human exposure and to reduce the potential threat or impact to nearby members of the community and the environment.  Safety depends upon the manner in which we handle chemicals; combined with safety devices inherent in the design of this facility; and the training of our personnel.\n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is the City of Faribaults intent to uphold industry standards in the operation of the facility and  it is our policy to adhere to all applicable federal, state, and local laws.  If an emergency was to occur, it is our policy and/or procedure to notify the City of Faribault Fire Department (via the 911 system) and request that they respond to the emergency.\n\nThe Stationary Source and Regulated Substance Handled\n\nChlorine is used at the WWTP as a water disinfectant from March through October.   Typical inventory of chlorine held at the facility is usually 2 one-ton cylinders on-line (separate feeder systems), and a "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4898,
      "SummaryText": "maximum of two one-ton cylinders held in reserve.  Chlorine is received, stored and dispensed from the one-ton cylinders.  The gaseous chlorine passes out of the cylinder, through a vacuum regulator, which converts the chlorine in the cylinder from positive pressure, to the vacuum feed system, where it travels to the chlorine contact tank for disinfecting biologically treated wastewater (a state-of-the-art-practice for release prevention).  Physical access to the chlorine cylinder storage room is restricted by locked doors, with only limited maintenance and operator staff having keys to access these areas. \n\nWorst-Case Release Scenario and the Alternative Release Scenarios\n\nWorst-Case Scenario (WCS) Chlorine -- 2,000 lb. is the maximum quantity of chlorine  in a single storage vessel released in a WCS.  According to EPAs Risk Management Program Guidance for Wastewater Treatment Facilities criteria, the distance to toxic endpoint for this WCS is 1.3 miles.  The facility at the outskirts of a populated, urban area with an estimated population of 1,300 persons living within the 1.3 mile radius (per Landview III software*).  No environmental receptors (as defined by 40 CFR Part 68) are located within this radius.\n\nAlternative Release Scenario (ARS) for chlorine --  The release chosen is a release of liquid chlorine at a rate of 60 lb. per minute in the chlorine storage room. Passive mitigation is considered for the release occurring inside the building.  The distance to toxic endpoint for this ARS is 0.2 miles, which reaches residential housing and an estimated population of 60 persons within the radius.\n\nThe General Accidental Release Prevention Program and the Specific Prevention Steps\n\nIt is this facilitys intent to comply with EPAs accident a release prevention rule and with all applicable state codes and regulations.  The City of Faribault's, WWPT has taken a systematic, proactive approach to evaluating its chemical processes.  Using this approach, the design, t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4898,
      "SummaryText": "echnology, operation and maintenance activities, emergency preparedness plans, training, process changes, and other elements that affect the processes are all considered.  Through evaluation, the consequences of catastrophic releases can be prevented or minimized.\n\nBy fulfilling the required elements of the PSM and RMP standards, WWPT intends to prevent unwanted releases and minimize the impacts of accidental releases of hazardous chemicals, especially into locations that could expose employees, the community and environment to serious hazards.  Our program addresses each of the key features of a successful release prevention program including:\n\n( Maintaining Process Safety Information (PSI): The WWTP maintains up-to date technical information about safe operating limits of the processes and the associated hazards of the chemicals involved.\n( Conducting Process Hazard Analyses (PHA):  The WWTP performs technical analysis of the plants processes in order to anticipate what might go wrong and recommend approaches to minimize the possibilities and affects of such occurrences.\n( Standard Operating Procedures (SOP): We have written technical and administrative procedures used to operate the plant safely.\n( Training:  City of Faribault provides employees with information necessary to ensure safe operation.\n( Mechanical Integrity:  We ensure proper maintenance of the process equipment on an ongoing basis.\n( Management of Change (MOC):  WWTP personnel analyze changes in process equipment, procedures and personnel to understand the impact of those changes in the safe operation of our plant.\n( Pre-Startup Safety Review:  We ensure all necessary elements for operating a safe process are in place prior to introducing the hazardous chemical into a new or modified system.\n( Compliance Audits: We conduct periodic evaluation and updating of the process operation to ensure all RMP elements are being applied properly.\n( Incident Investigation: City of Faribault has procedures for "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4898,
      "SummaryText": "investigating the causes of near-miss or accidental releases and developing measures to prevent future similar occurrences.\n( Employee Participation:  We maintain a philosophy and approach to incorporating the knowledge and experience of our employees from all facets of operation regarding the covered processes.\n( Hot Work Permit:  We have a documented program for controlling the hazards associated with ignition source activities, thereby minimizing potential catastrophic release.\n( Contractors:  City of Faribault upholds policies and procedures for ensuring safe work practices of contractors on the facility and a systematic approach of communicating hazards inherent to the covered processes which the contractor may be working on or near.\n\nOur organization and our employees are committed to the standards that the RMP regulations  call for.  We do business, and we have specific accountabilities and controls to ensure that we are meeting high standards for accident prevention.  City of Faribault has also developed a management system, which identifies job positions and responsibilities to ensure proper management of the RMP.\n\nFive-Year Accident History\n\nThere have been no releases of chlorine or other toxic/extremely hazardous chemicals in the past 5 years, which have resulted in injury, death, offsite consequences, response, or restoration activities.\n\nThe Emergency Response Program\n\nWe have discussed the content and intent of this program with the City of Faribault Fire Department and Public Safety.   We rely on their response capability and trained staff, should an accidental release occur.\n\nPlanned Changes to Improve Safety.\n\nThe WWTP has recently undergone substantial upgrading, which is to designed to improve the safety in the operation of the the facility.  We are implementing enhanced inspection and maintenance routines to better document work activities on the process equipment.  We are also developing and implementing improved emergency response procedures."
    }
  ]
}