{
  "FacilityID": 48993,
  "FacilityName": "2007 AMVAC Chemical Corporation, Axis Plant",
  "FacilityStr1": "12650 Hwy. 43 North",
  "FacilityStr2": null,
  "FacilityCity": "Axis",
  "FacilityState": "AL",
  "FacilityZipCode": "36505",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01097",
  "LEPC": "Mobile County LEPC",
  "FacilityLatDecDegs": "30.951667",
  "FacilityLongDecDegs": "-088.018056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": "www.amvac-chemical.com",
  "FacilityEmailAddress": "johnr@amvac-chemical.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "American Vanguard Corporation",
  "Company2Name": null,
  "CompanyDUNS": 49343924,
  "Company2DUNS": 0,
  "OperatorName": "AMVAC Chemical Corporation",
  "OperatorStr1": "4100 E. Washington Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90023",
  "OperatorZipCodeExt": "4406",
  "RMPContact": "Doug Ashmore",
  "RMPTitle": "V. P., Director of Manufacturing",
  "FTE": 68,
  "OtherEPAFacilityID": "ALR 000 014 332",
  "EPAFacilityID": "100000177998",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-09-26 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-07-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-06-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-06-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 30.94769,
  "FRS_Long": -88.02517,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 70962,
      "AltID": "DDVP/DIBROM",
      "FacilityID": 48993,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 72666,
          "ProcessID": 70962,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 94221,
          "ProcessID": 70962,
          "ChemicalID": 60,
          "Quantity": 200000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 60,
            "ChemicalName": "Bromine",
            "CASNumber": "7726-95-6",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 594221,
          "ProcessID": 70962,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 70963,
      "AltID": "Fortress",
      "FacilityID": 48993,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 72667,
          "ProcessID": 70963,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 94222,
          "ProcessID": 70963,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 94223,
          "ProcessID": 70963,
          "ChemicalID": 63,
          "Quantity": 1300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 63,
            "ChemicalName": "Hydrogen sulfide",
            "CASNumber": "7783-06-4",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 94224,
          "ProcessID": 70963,
          "ChemicalID": 59,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 59,
            "ChemicalName": "Phosphorus trichloride  [Phosphorous trichloride]",
            "CASNumber": "7719-12-2",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 594222,
          "ProcessID": 70963,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 594223,
          "ProcessID": 70963,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 594224,
          "ProcessID": 70963,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 70964,
      "AltID": "K500/K550",
      "FacilityID": 48993,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 72668,
          "ProcessID": 70964,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 94225,
          "ProcessID": 70964,
          "ChemicalID": 59,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 59,
            "ChemicalName": "Phosphorus trichloride  [Phosphorous trichloride]",
            "CASNumber": "7719-12-2",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 594225,
          "ProcessID": 70964,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 48993,
      "SummaryText": "This Risk Management Plan has been prepared for the AMVAC pesticide manufacturing facility located at 12650 Hwy. 43 N. In Axis, Alabama.  The plan has been prepared in accordance with section 112(r) of the Clean Air Act Standard (40 CFR Part 68), RMP.  The intent of this legislation is to protect the public health and safety and the environment from the accidental release of acutely hazardous materials (AHMs).  The preparation and implementation of this RMP by the AMVAC Chemical Corporation, Axis Plant, a handler of acutely hazardous materials, meets the intent of the RMP regulation and the relevent portions of the Alabama Department of Environmental Management regulations.\n\nThe AMVAC Axis facility was originally a portion of the Dupont Mobile Manufacturing Center.  It was purchased from Dupont by AMVAC on 5-18-2001.  The necessary documentation for the facility to comply with the RMP legislation was a part of that purchase agreement.  All of the Hazard and Operability Studies and Process Hazard Analysies were originally documented by Dupont and they have all been reviewed AMVAC in preparation of this RMP.  The AMVAC Axis plant and the Dupont MMC are on a common site.  All site Emergency Response is mutually shared and coordinated by the emergency teams from both companies.\n\n1.0  Accidental Release Prevention and Emergency Response Policies\n\nMission Statement:  AMVAC Chemical Corporation (AMVAC) is committed to the following:\n1.  Providing its customers with environmentally friendly, cost-effective and high-quality products on time.\n2.  Providing a safe and secure working environment for its employees.\n3.  Operating in a manner which meets or exceeds existing laws and regulations and reflects a high level of concern and respect for the local community.\n4.  Investing in its future through aggressive research and development of new products and markets.\n5.  Providing its investors with higher than normal returns.\n\nSafety First Policy:  AMVAC will provide a safe and se"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 48993,
      "SummaryText": "cure environment for its employees while maintaining a high level of concern and respect for the local community.  Safe conditions and full environmental regulartory compliance will be maintained at all of its facilities.  All unsafe conditions/actions will be immediately corrected and management notified.\n\nEnvironmental Health and Safety Mission Statement:  AMVAC Chemical Corporation's Environmental, Health and Safety (EH&S) departments are committed to ensuring that facility operations are conducted in full compliance with existing environmental, health and safety regulations.  To achieve this we follow a four-point plan based on Training, Auditing, Reporting and Enforcement.\n\n2.0  Facility Description and Regulated Substances Handled\n\nAMVAC Chemical Corporation manufactures agricultural pesticides at its plant located at 12650 Hwy. 43 N. In Axis, Alabama.  The facility receives steam, fire water, process water, potable water and air from the Dupont facility located on the common site.  The facility consists of various buildings, chemical reactors, above ground storage tanks, truck loading/unloading stations, railcar unloading stations, peripheral tanks and various ancilliary equipment.\nThe AMVAC Axis plant has a North American Industrial Classification System (NAICS) Code of 32532 for Pesticide and Agricultural Chemical Manufacturing.  The plant manufactures pesticides which require the handling of Acutely Hazardous Materials (AHMs) in quantities which make them subject to the Risk Management Plan Rule (RMPR) requirements of the Clean Air Act (40 CFR 68).\n\n*Listed Toxic Substances:\n1.  Chlorine, CAS 7782-50-5 used in Fortress Synthesis\n2.  Phosphorous Trichloride, CAS 7719-12-2 used in Fortress Synthesis and also in K500/550 Synthesis\n3.  Hydrogen Sulfide, CAS 7783-06-4 used in Fortress Synthesis\n4.  Bromine, CAS 7726-95-6 used in DDVP/Dibrom process\n*Listed Flammable Substances:  None on-site \n\nThe Accutely Hazardous Material associated with the DDVP/Dibrom proc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 48993,
      "SummaryText": "ess is bromine. The bromine is stored onsite in a storage tank, located in an enclosed concrete dike.  Bromine arrives onsite via railcar or truck.  The storage tank is equipped with level control devices that will automatically shut off supply of bromine into the tank. \n\n3.0  The Worst-Case Release Scenario(s) and the Alternative Release Scenario(s):\n\nThe worst case release scenario for this acutely hazardous materials of concern, Bromine was considered.  For the purpose of conducting Offsite Consequence Analysis, absolute worst case and alternative release scenarios were selected.  Worst case scenarios are mandated by the RMP rule.  For the regulated chemicals used at AMVAC these assumed a total failure of all systems in place and a total release of the chemical inventory.  The criteria used to choose an alternative release scenario is an attempt to more closely define a serious release episode that could conceivably occur, but is still substantially more severe than expected with the safety and monitoring equiment in use.  These scenarios include the following:\n\nWorst Case Scenario for covered Toxic Substances:\n\nBromine was the only toxic substance considered for this scenario.  The worst case scenario at AMVAC Axis results from the complete release of contents of the bromine storage tank containing 179,000 pounds into its concrete dike.  The event would have off-site consequenses.  An event of this nature is very unlikely due to process controls described in the report.\n\nAlternative Release Scenarios for each covered Toxic Substance:\n\n\nA leak develops in the pipe on the bottom discharge from the storage tank.  The solution leaks into the concrete containment dike for 20 minutes before the leak is isolated and the flow stopped.\n\n4.0  The Five Year Accident History\n\nThere have been no accidents involving Acutely Hazardous Materials since the aquisition of the Axis plant by AMVAC.\n\n5.0  The Emergency Response Program:\n\nThe AMVAC Axis plant is on a common site with "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 48993,
      "SummaryText": "the DuPont Axis Plant.  Both AMVAC and DuPont have trained emergency response teams.  There is a written agreement between both parties that there will be mutual response for site wide emergencies.\n\nThe AMVAC Axis facility is equiped with mutiple levels of protection.  The potential for spills and releases is low.  In the event that a spill or release occurs, there are established written procedures for the handling emergencies.\n\nThe procedures for handling emergencies include the Emergency Response Plan and the Operating Procedures Manuals for each area.  The Emergency Response Plan for the AMVAC facility includes written procedures for handling releases and spills of hazardous materials in any area and contains specific emergency procedures for bomb threat, firefighting, emergency alarm activation, evacuation, offsite emergencies, local area emergency notification, government agency notification and hurricanes.  The operating procedure manual for each process area contains emergency response information for the area.\n\nTo maintain and upgrade the emergency response capabilities, AMVAC conducts inspections of the facility and the equipment, and emergency response drills are conducted simultaneously with the DuPont drills.  The Emergency Response Plan will be reviewed annually and/or when:\n\nA.  There is a major change in the facility chemicals and or plant operation that changes the potential for fires and the release of a hazardous substance, such that a change in the response is needed for any emergency.\nB.  The plan fails in an emergency.\nC.  There is a change of emergency coordinators/responders.\nD.  There is a change of emergency equipment.\n\nAny incident or emergency which results in a chemical release is reported to the following agencies as applicable:\n\nMobile County Emergency Management Agency, Alabama Emergency Response Commission, Alabama Department Of Environmental Management, National Response Center, Coast Guard Marine Safety Office, Mobile, Mobile Count"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 48993,
      "SummaryText": "y Sheriff, Alabama State Troopers. Any serious work-related injury, illness or death is reported to the OSHA office immediately, but no longer than 8 hours after the employer's knowledge of the incident.  All incidents will be reviewed and investigated as to its cause and methods for future prevention.\n\nAll plant personnel receive training on the implementation of the emergency response plan upon hire, upon changes in the plan and periodic refresher training on the various aspects of the plan.\n\n7.  Planned Changes to Improve Safety\n\nAMVAC Axis currently has no additional detailed or defined plans for any changes such as installation of additional mitigation or control equipment, technology, organizational changes, etc.  However there is an on going program that addresses any and all employee safety related issues and suggestions.  AMVAC will continue to improve the safety performance accordingly."
    }
  ]
}