{
  "FacilityID": 4915,
  "FacilityName": "Johns Manville Corporation, Richmond, IN",
  "FacilityStr1": "814 Richmond Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Richmond",
  "FacilityState": "IN",
  "FacilityZipCode": "47374",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18177",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "39.834444",
  "FacilityLongDecDegs": "-84.914167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.jm.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 45199858,
  "ParentCompanyName": "Johns Manville International, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 45426558,
  "Company2DUNS": null,
  "OperatorName": "Johns Manville International, Inc.",
  "OperatorStr1": "PO Box 5108",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80217",
  "OperatorZipCodeExt": "5108",
  "FTE": 140,
  "OtherEPAFacilityID": "IND006065601",
  "EPAFacilityID": "100000061087",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-01-30 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2001-09-04 00:00:00",
  "DeRegistrationEffectiveDate": "1999-06-21 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.83424,
  "FRS_Long": -84.91441,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5746,
      "AltID": null,
      "FacilityID": 4915,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6201,
          "ProcessID": 5746,
          "ChemicalID": 1,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 5869,
          "ProcessID": 5746,
          "NAICSCode": "327993",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 4915,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Richmond Fire Department",
    "CoordinatingAgencyPhone": "7659837266",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4915,
      "SummaryText": "Johns Manville International, Inc.\nRichmond, Indiana\n\nRMP EXECUTIVE SUMMARY\n\n\n1)  Brief Description of the Richmond, Indiana  Facility:                                          \n                                                                                                  \n    Johns Manville International, Inc., (JM) purchased its Richmond, Indiana, facility in         \n    1937.  The facility manufactures fiberglass building insulation which is sold in              \n    commercial, residential, and retail markets.  There are approximately 750,000 square feet     \n    under roof on 43 acres of urban property.  There are presently about 140 full time            \n    employees who operate the Plant 24 hours a day, 365 days a year.                              \n                                                                                                  \n    Johns Manville places a strong emphasis on safety and environmental leadership.  The          \n    Company fosters a proactive philosophy to ensure that employees work in a safe                \n    environment and that each facility remains in full compliance with all applicable federal,    \n    state, county and local regulations.  JM is also committed to environmental leadership        \n    within the community served.  This commitment is exemplified in the Richmond                  \n    Facility\u0012s strong recycling and waste minimization programs.  The Company\u0012s long term         \n    goal is to have zero process wastes taken to disposal facilities, with all residual materials \n    either recycled or used for beneficial purposes.                                              \n                                                                                                  \n    The facility maintains a good working relationship with all federal, state, county and        \n    local agencies."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4915,
      "SummaryText": "2)  Brief Description of the Accidental Release Prevention and Emergency Response                 \n     Policies at the Johns Manville Facility in Richmond, Indiana:                                 \n                                                                                                  \n    The Johns Manville fiberglass insulation manufacturing plant in Richmond, Indiana             \n    qualifies for the USEPA 112R (40 CFR 68) requirements due to the use of formaldehyde.         \n    The facility exceeds the qualifying threshold of 15,000 pounds of this material on site for   \n    a single process.                                                                             \n                                                                                                  \n    Liquid resin solution containing formaldehyde (above 1% mixture) is delivered to the          \n    facility via truck transport.  Resin solution is stored in cold storage until it is mixed with\n    water and other materials to make a binder solution (less than 1% formaldehyde) which is      \n    applied to glass fibers.  This binder solution is applied in the insulation manufacturing     \n    process as a low VOC binder which acts to bind glass fibers.  The formaldehyde                \n    containing resin solution is stored as a liquid in several 3,800 gallon storage tanks located \n    inside the facility.  The storage vessels are constructed and operated in accordance with     \n    ASME specifications.  The resin storage process is designed to minimize spills in the         \n    event of an accidental release.  The resin storage room is equipped with a dike that          \n    minimizes the surface area of a spill.  In addition, the resin storage room is maintained at  \n    50 degrees F to reduce the volatility of the material."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4915,
      "SummaryText": "Although not a qualifying mitigation  \n    measure for the 112R program, low storage temperatures give plant personnel adequate          \n.   time to react to a release situation by reducing the volatilization rate of the resin material\n    As a result of these factors, Johns Manville has not experienced an accidental release of     \n    formaldehyde over the entire life of the facility.  Modeling impacts indicate that a worst-   \n    case release of formaldehyde from the resin storage tanks would not impact the public         \n    beyond the Facility\u0012s property line and therefore is qualified as a Program 1 facility.       \n                                                                                                  \n    With the exception of minor incidents, it is the Facility\u0012s policy to immediately contact     \n    and rely on outside emergency responders in the event of a significant unforeseen or          \n    accidental release of formaldehyde-containing liquid resin.  Outside responders would         \n    include the local fire department and other community or contractor services as required.     \n                                                                                                  \n                                                                                                  \n3)  Brief Description of the Worst Case Scenario, including Administrative Controls and           \n     Mitigation Measures to Limit the Distances for each Reported Scenario:                        \n                                                                                                  \n    According to 40 CFR 68, the worst-case scenario is to be based on the release of the          \n    greatest amount held in a single vessel, taking into account administrative controls that     \n    limit the maximum quantity.  Under a worst-case scenario, a single vessel containing          \n    3,800 gallons of liquid resin, which includes about 12.0% formaldehyde, is"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 4915,
      "SummaryText": "assumed to         \n    spill with partial containment (dike) in the resin room.  Liquid not contained in the resin   \n    room is assumed to spill outside and covers an area to a depth of one centimeter.             \n    Distance to the toxic endpoint of 12.0 mg/m3 is calculated for Richmond using AFTOX, a        \n    dispersion model that will determine toxic chemical concentrations at hazard distances.       \n    According to AFTOX, a worst-case resin spill and subsequent formaldehyde vaporization         \n    onsite at Richmond will result in a distance of 0.04 miles to the toxic endpoint.  A plant    \n    and topographic map analysis indicates that 0.04 miles from the location of the resin tank    \n    is completely on site.  Therefore, the formaldehyde-containing liquid resin process at        \n    Richmond does not qualify for Program 2 of 112R.                                              \n                                                                                                  \n                                                                                                  \n4)  Brief Description of the Five Year Accident History (68.42):                                  \n                                                                                                  \n    The Richmond facility has never had an accident involving formaldehyde-containing             \n    liquid resin that caused deaths, injuries, property or environmental damage, evacuations,     \n    or sheltering in place.                                                                       \n                                                                                                  \n                                                                                                  \n5)  Brief Description of the Emergency Response Program (68.90 \u0016 68.95):"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 4915,
      "SummaryText": "In the event of an emergency involving the Facility\u0012s formaldehyde-containing liquid          \n    resin system, it is the Facility\u0012s policy to notify the local fire department and other       \n    emergency responders and request that they respond to the emergency.  Plant personnel         \n    have discussed this policy with the fire department; members of the fire department have      \n    inspected the facility.                                                                       \n                                                                                                  \n    In addition to the emergency action and notification procedures described earlier in this     \n    document, Johns Manville complies with and maintains numerous other operational               \n    programs for the purpose of promoting employee safety and minimizing potential hazards        \n    to the surrounding community. These include, but are not limited to:                          \n        a. Emergency Hotline notifications                                                            \n        b. Spill, Prevention, Control and Countermeasure Plan and equipment.                      \n        c.  RCRA Contingency Plan                                                                 \n        d.  Hot Work Permit Program                                                               \n        e.  Safety Lockout-Tagout Program                                                         \n        f.  Extensive safety programs throughout the location                                     \n        g.  Fire Prevention Plan                                                                  \n        h.  Bomb Threat Plan                                                                      \n        i.  Agency, insurance and physicians inspections                                          \n        j.  Job Safety Analyses                                                                   \n        k.  Con"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 4915,
      "SummaryText": "fined Space Entry procedures                                                       \n        l.  Injury Investigation Procedure and Root Cause Analysis                                \n        m.  New and Altered Equipment Inspection (Management of Change)                           \n        n. Outside Contractor Review Policy                                                       \n        o. Community Emergency Response Coordination Policy                                       \n        p.  Various emergency communication systems throughout the facility                       \n                  such as audible alarms, paging systems, hand-held radios, phones,               \n                  visual alarms.                                                                  \n        q.  Right-To-Know Notification Programs issued to State and local                         \n                  agencies (Emission Release Reports, SARA Title III, etc)                        \n        r.  Extensive and detailed employee training in all phases of job related                 \n                  safety, chemical awareness, handling potential spills, HAZCOM,                  \n                  RTK, emergency procedures, notification and numerous other programs"
    }
  ]
}