{
  "FacilityID": 49268,
  "FacilityName": "Freedom Fuels, LLC - Mason City, IA",
  "FacilityStr1": "4172 19th Street SW",
  "FacilityStr2": null,
  "FacilityCity": "Mason City",
  "FacilityState": "IA",
  "FacilityZipCode": "50401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19033",
  "LEPC": null,
  "FacilityLatDecDegs": "43.132400",
  "FacilityLongDecDegs": "-093.264100",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.freedomfuelsllc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Freedom Fuels, LLC",
  "OperatorStr1": "4172 19th Street SW",
  "OperatorStr2": null,
  "OperatorCity": "Mason City",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50401",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Stork",
  "RMPTitle": "General Manager",
  "FTE": 21,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199812",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-04-03 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Hydrochloric Acid Solution",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-08-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-08-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-09-24 00:00:00",
  "DeRegistrationEffectiveDate": "2010-09-30 00:00:00",
  "AnniversaryDate": "2012-08-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 71511,
      "AltID": "Bio-Diesel Plant",
      "FacilityID": 49268,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 73224,
          "ProcessID": 71511,
          "NAICSCode": "32411",
          "_desc": {
            "NAICS_CODE": "32411",
            "NAICS_DESCRIPTION": "Petroleum Refineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 95013,
          "ProcessID": 71511,
          "ChemicalID": 53,
          "Quantity": 54000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 53,
            "ChemicalName": "Hydrochloric acid (conc 37% or greater)",
            "CASNumber": "7647-01-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 595013,
          "ProcessID": 71511,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 49268,
      "SummaryText": "The Freedom Fuels, LLC Bio-Diesel Plant uses hydrochloric acid solution in the process to produce bio-diesel fuel from soy oil.  Hydrochloric acid solution is a substance regulated by the EPA and the properties of hydrochloric acid solution make it necessary to observe certain safety precautions while operating the Bio-Diesel Plant to prevent employee exposure, and to reduce the threat of exposure to nearby members of the community.\n\nFreedom Fuels, LLC chose to follow the EPA's Chemical Accident Prevention Rule, Program Level 3, to prevent a release of hydrochloric acid solution from the Bio-Diesel Plant.  The storage tank for hydrochloric acid solution has a design capacity of 15,000 gallons.\n\nFreedom Fuels, LLC complies with EPA's Accidental Release Prevention Rule, and applicable state codes and regulations to prevent a catastrophic release of hydrochloric acid solution.  The Bio-Diesel Plant has been designed and constructed to meet applicable codes and regulations.  The operators of the Bio-Diesel Plant are required to complete a training program prior to operating the facility.\n\nAn offsite consequence analysis was completed using a computer model to simulate a release of the hydrochloric acid from the Bio-Diesel process.  The worst case scenario considered the loss of the total volume of the storage tank (15,000 gallons or 54,000 pounds) of 37 percent hydrochloric acid solution at a rate of 720 pounds per minute.  The analysis showed that the hydrochloric acid vapor could travel approximately 5.5 miles.  There are approximately 30,664 residents which could be potentially affected in the identified radius.  There are public receptors (schools, residences, hospitals, recreation areas and industrial/commercial buildings) in the potentially affected area.\n\nThe alternative release scenario, which is the most likely scenario, considered a release of 37 percent hydrochloric acid solution from a ruptured unloading hose for a tank truck.  A release of 3,900 pounds of 3"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 49268,
      "SummaryText": "7 percent hydrochloric acid solution over a 2 minute period was considered.  The computer model showed that the hydrochloric acid vapor could travel approximately 0.3 mile.  There are residents, but no other public receptors located in the potentially affected area.  No administrative controls or mitigation measures were used to limit the chemical release distances for either scenario.  \n\nThe Freedom Fuels, LLC Bio-Diesel Plant has an established Emergency Action Plan to respond to emergencies.  The plan was developed in accordance with 29 CFR 1910.38 Emergency Action Plan.  The plan requires Freedom Fuels employees to exit the facility during a fire or hydrochloric acid release to a safe area.  The emergency agencies will be notified of the emergency.  The emergency agencies will notify any potentially affected neighbors.  \n\nThis facility is new and has not experienced a hydrochloric acid release.\n\nFreedom Fuels, LLC evaluated the potential failures of the Bio-Diesel process to determine if the safeguards were sufficient to prevent a catastrophic release of hydrochloric acid solution.  A Process Hazard Analysis was completed on the Bio-Diesel process on April 16-20, 2007.  Planned changes to improve safety resulting from this analysis are documented in the Process Hazard Analysis report in the Process Safety Management Program."
    }
  ]
}