{
  "FacilityID": 49646,
  "FacilityName": "Foster Farms Kansas Dairy",
  "FacilityStr1": "415 Kansas Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Modesto",
  "FacilityState": "CA",
  "FacilityZipCode": "95351",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.646583",
  "FacilityLongDecDegs": "-121.012220",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 51675197,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Foster Farms Kansas Dairy",
  "OperatorStr1": "415 Kansas Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Modesto",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95351",
  "OperatorZipCodeExt": null,
  "RMPContact": "Charles Nelson",
  "RMPTitle": "Operations Manager Fluid Plant A",
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127098",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-03-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-09-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-09-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-08-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-08-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.64763,
  "FRS_Long": -121.01532,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72016,
      "AltID": "Kansas \"A\" System",
      "FacilityID": 49646,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 73733,
          "ProcessID": 72016,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 95560,
          "ProcessID": 72016,
          "ChemicalID": 56,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 595560,
          "ProcessID": 72016,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 72017,
      "AltID": "Kansas \"B\" System",
      "FacilityID": 49646,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 73734,
          "ProcessID": 72017,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 95561,
          "ProcessID": 72017,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 595561,
          "ProcessID": 72017,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 49646,
      "SummaryText": "RISK MANAGEMENT PROGRAM (CalARP)\nAND PROCESS SAFETY MANAGEMENT PROGRAM\n\nAnhydrous Ammonia Refrigeration Systems\nFoster Farms Kansas Avenue Dairy\n\nRevised August 2007\n\n\nEXECUTIVE SUMMARY\n\n\nFoster Farms Dairy revised this document, previously submitted in 2002 and revised in December 2004, due to regulatory requirements requiring re-submittal every 5 years.\n\nFoster Farms Kansas Avenue Dairy (hereafter referred to as Foster Farms or Foster Farms Dairy) prepared a chemical risk management plan (RMP) in general accordance with California Code of Regulations, Title 19, Section 2735.1, et. Seq.  The regulations are also referred to as the California Accidental Release Prevention (CalARP) program.  The Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances.  The federal regulations are codified in Title 40 of the Code of Federal Regulations (CFR), part 68.  \n\nFoster Farms Dairy prepared this RMP to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia handling systems and practices at the facility. Foster Farms Dairy has incorporated state-of-the-art safety features into the ammonia refrigeration systems at the facility as part of system modifications and upgrades.  Foster Farms Dairy will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP. \n\nThe Foster Farms Dairy at 415 Kansas Avenue in Modesto, California is located in an area zoned for commercial and industrial use.  The facility is near Highway 99, which runs north and south through Modesto.  Foster Farms Dairy is a family owned business that processes milk into fluid milk, powdered milk, and butter and packages fruit juices.  Foster Farms Dairy purchased the facility in 1988. Knudsen formerly owned the facility.  The facility has undergone significant modifications since 1988 and the majority of the ammonia refrigeration system components are less th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 49646,
      "SummaryText": "an 15 years old.  \n\nAnhydrous ammonia is used at the facility in two refrigeration systems (\"A\" and \"B\").  The \"A\" system contains approximately 24,000 pounds of ammonia and the \"B\" system contains approximately 13,000 pounds of ammonia.  The ammonia refrigeration systems are closed systems.  The refrigeration systems provide cooling to the cold storage rooms, milk silos, glycol chillers, and air conditioning systems.  The cold rooms are used to store product. Some of the \"A\" side milk silos are jacketed with ammonia coils and store refrigerated milk and fruit juice concentrate.  The glycol chillers supply cooled liquid to processing units and other equipment for refrigeration of raw materials.  The \"A\" system provides refrigeration for the liquid products operations.  The \"B\" system provides refrigeration for powdered processing and other operations.  \n\nThe RMP regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility.  Foster Farms Dairy has incorporated many safety features in the ammonia refrigeration systems to prevent system failures and to mitigate potential releases.  The predominant safety concern with closed-loop ammonia systems is inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion.  The Foster Farms Dairy ammonia systems are continuously monitored by automated control systems that shut down components if deviations from normal operating conditions occur.  Further, the systems are equipped with pressure relief valves on all pressure vessels and most, if not all, locations within the ammonia system where ammonia could become trapped.  These pressure relief valves are manifolded to a water-filled diffusion tank.  Any ammonia vapor that is unintentionally released through pressure relief valves bubbles through water that absorbs the ammonia.  Other safety features at the facility include:\n \n* central computer monitoring and c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 49646,
      "SummaryText": "ontrol system\n* emergency shutdown systems \n* component specific safety shutdowns that are independent of the central computer control system\n* pressure relief valves are replaced every five years\n* fire alarms and sprinkler system \n* an ammonia leak detection system in the engine room and all process areas that contain ammonia equipment\n* a ammonia leak detection system in each machine room\n* an ammonia fire dump system that can be used to relieve pressure in vessels\n* a computerized preventive maintenance program\n* all ammonia piping is color coded\n* all ammonia piping, valves and components are labeled\n* operators receive regular training on ammonia system maintenance, operation and emergency response\n* SOPs for the ammonia system\n* accurate piping and instrumentation drawings for the ammonia system have been prepared\n\nIn addition to the physical features of the ammonia refrigeration systems at the facility, Foster Farms Dairy has extensive administrative controls in place to maintain safe operation of the systems.  Administrative controls include, but are not limited to: formal training programs for system operators and emergency responders, a hot work permit program, a lock-out/tag-out program, a contractor safety program, and a management of change program.  Written standard operating procedures (SOPs) have been written for the ammonia systems at the facility and will provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\n\nFoster Farms Dairy is committed to maintaining the mechanical integrity of the ammonia refrigeration systems.  A computerized preventive maintenance system is utilized to manage the maintenance of the refrigeration systems.  Preventive maintenance at the facility includes shift, daily, weekly and periodic inspection, calibration, testing and overhaul of ammonia system equipment.  The computerized system is used to track equipment performance and to create reports that are use"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 49646,
      "SummaryText": "d by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\n\nThe RMP regulations require a review of the five-year accident history at the regulated facility. There have been no reportable releases at the Kansas Avenue Dairy in the last five years.\n\nIn the unlikely event that an ammonia release that requires emergency response occurs at the facility, Foster Farms Dairy has trained refrigeration system operators for emergency response.  Each operator receives 40 hours of emergency response training consistent with the California Safety Training Institute (CSTI) curriculum, presented by a CSTI certified instructor.  The facility has a written emergency response program that identifies the roles, responsibilities and actions of the emergency responders.  Foster Farms Dairy will not rely on local community responders to mitigate ammonia releases at the facility.  Foster Farms Dairy will rely on community responders for medical assistance and public evacuation or protection in place, if necessary.\n\nChanges to improve safety at the facility are ongoing.  All of the mitigation measures suggested by the process hazard analysis team have been addressed and/or implemented. Significant mitigation measures included:\n\n* spring return valves are now used for all oil draining\n* preventive maintenance and inspection recommendations have been implemented\n* valve and equipment identification was completed\n* administrative programs were prepared and implemented\n* color-coding of the ammonia pipes is completed\n* relocation of SOVs to accessible area for butter cold boxes is completed\n* SOVs were programmed into Utility PLC for emergency shut down of systems\n* audible alarms were installed throughout plant and included in preventive maintenance program\n* liquid and hot gas SOVs throughout plant have been connected to ammonia detection system to close upon detection of ammonia\n* added critical level floats to all glycol chillers\n* preve"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 49646,
      "SummaryText": "ntive maintenance and inspection recommendations have been implemented\n* management evaluated the need for additional catwalks for inspection and maintenance of equipment and decided not to install catwalks\n* management evaluated the need for a water-wash system for the machine room exhaust fans and decided not to install water wash systems\n* Machine room ventilation requirements were updated in March 2002 to comply with current Local Fire Code\n\nFoster Farms will respond to all suggested measures to improve the safety and operations of the ammonia refrigeration system.  Foster Farms' employee participation policy provides a mechanism for all employees to provide comments and concerns to Foster Farms management.  Management responses and support will be consistent with Foster Farms' commitment to safe and environmentally responsible operations.\n\nFoster Farms recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility.  As such, this document and related attachments and program elements will evolve as Foster Farms continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community.  Foster Farms will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations.  However, minor improvements/modifications to the RMP/PSM, related attachments, and program elements will be incorporated consistent with Foster Farms? internal review practices, and Foster Farms will maintain the most current versions on site.  Thus, the most current version RMP/PSM, related documents, and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    }
  ]
}