{
  "FacilityID": 4987,
  "FacilityName": "OSRAM Sylvania Products, Inc. Towanda",
  "FacilityStr1": "Hawes Street",
  "FacilityStr2": null,
  "FacilityCity": "Towanda",
  "FacilityState": "PA",
  "FacilityZipCode": "18848",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42015",
  "LEPC": "Bradford County LEPC",
  "FacilityLatDecDegs": "41.784444",
  "FacilityLongDecDegs": "-76.435556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.sylvania.com",
  "FacilityEmailAddress": "www.sylvania.com",
  "FacilityDUNS": 3044609,
  "ParentCompanyName": "OSRAM Sylvania, Inc.",
  "Company2Name": "Siemens Corporation",
  "CompanyDUNS": 1495928,
  "Company2DUNS": 0,
  "OperatorName": "OSRAM Sylvania Products, Inc.",
  "OperatorStr1": "Hawes Street",
  "OperatorStr2": null,
  "OperatorCity": "Towanda",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18848",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carmen Venezia",
  "RMPTitle": "Safety and Environmental Manager",
  "FTE": 1200,
  "OtherEPAFacilityID": "18848GTPRDHAWES",
  "EPAFacilityID": "100000062576",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-08-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.78444,
  "FRS_Long": -76.43556,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5852,
      "AltID": "Anhydrous ammonia storage",
      "FacilityID": 4987,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5990,
          "ProcessID": 5852,
          "NAICSCode": "335999",
          "_desc": {
            "NAICS_CODE": "335999",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Electrical Equipment and Component Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6314,
          "ProcessID": 5852,
          "ChemicalID": 56,
          "Quantity": 203000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506314,
          "ProcessID": 5852,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 5853,
      "AltID": "Hydrogen storage",
      "FacilityID": 4987,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5991,
          "ProcessID": 5853,
          "NAICSCode": "33599",
          "_desc": {
            "NAICS_CODE": "33599",
            "NAICS_DESCRIPTION": "All Other Electrical Equipment and Component Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6315,
          "ProcessID": 5853,
          "ChemicalID": 149,
          "Quantity": 24522.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506315,
          "ProcessID": 5853,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 5854,
      "AltID": "Ammonia storage",
      "FacilityID": 4987,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 5992,
          "ProcessID": 5854,
          "NAICSCode": "33599",
          "_desc": {
            "NAICS_CODE": "33599",
            "NAICS_DESCRIPTION": "All Other Electrical Equipment and Component Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6316,
          "ProcessID": 5854,
          "ChemicalID": 57,
          "Quantity": 240000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506316,
          "ProcessID": 5854,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 4987,
      "SummaryText": "Facility and Regulated Substances Handled: The OSRAM SYLVANIA Products Inc. (\"OSRAM\") Towanda facility manufactures specialized materials for the cutting tools, lighting and automotive industries.  The facility is subject to Clean Air Act Section 112(r)(7), and the corresponding regulations at 40 C.F.R. Part 68, because of the on-site storage of anhydrous ammonia, hydrogen and aqueous ammonia.  The anhydrous ammonia and hydrogen storage operations comply with Prevention Program 3 of the Risk Management Plan (\"RMP\"), and the aqueous ammonia operations comply with the Prevention Program 2.  The facility stores approximately 200,000 pounds of anhydrous ammonia, 24,000 pounds of hydrogen and 240,000 pounds of aqueous ammonia.\n\nAccidental Release Prevention and Emergency Response Policies: The facility's overall approach and commitment to chemical safety is demonstrated by the implementation of OSHA Process Safety Management (\"PSM\") procedures.  The facility management ensures that facility personnel continue to adhere to these safety procedures.\n\nWorst-Case Release Scenarios and Alternative Release Scenarios: Worst-case release scenarios were conducted for anhydrous ammonia, aqueous ammonia and hydrogen based on several United States Environmental Protection Agency (\"EPA\") models to estimate the greatest distance in any direction to an endpoint that could result in an accidental release of the largest quantity of a regulated substance.  For the regulated toxic substances, the facility considered the release of anhydrous ammonia from the single largest anhydrous ammonia storage vessel, which was a 23,800 gallon aboveground storage tank.  The worst-case release scenario involved the release of the entire contents of this vessel over a 10-minute period.  The distance to the toxic endpoint was 2.1 miles.  This scenario resulted in an impact to public or environmental receptors.\n\nFor the regulated flammable substance, the facility considered a complete release of hydrogen fr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 4987,
      "SummaryText": "om a 16,000 gallon storage vessel.  This worst case scenario results in a vapor cloud explosion with an overpressure of 1 psi to a distance of 0.23 miles. This scenario resulted in an impact to public.  \n\nThe facility also evaluated one alternative release scenario for each of the regulated toxic substances  (anhydrous ammonia and aqueous ammonia), and one alternative release scenario for the flammable substance (hydrogen).  The alternative release scenario for the anhydrous ammonia consisted of a leak in a short valve or pipe on the tank during the transfer of ammonia from the tank.  The facility estimated that safety measures could be implemented to effectively stop such an accidental release within 60 minutes.  Over this time period, the distance to the toxic endpoint of 0.14mg/l for the alternative release was estimated to be 120 yards. This scenario resulted in an impact to public.  \n\nThe alternative release scenario for the aqueous ammonia involved the leak of a pipe or fitting during the transfer of ammonia from the 16,000-gallon storage tank to the process.  The facility estimated this type of leak could be addressed with safety measures and stopped within 30 minutes.  Over this time period, the distance to the toxic endpoint of 0.14 mg/l for the ammonia was estimated to be 0.10 mile. This scenario resulted in an impact to public.  \n\nThe alternative release scenario for the hydrogen involved a 60 minute leak in a flange or pipe during transfer from the storage vessel to the process.  The facility estimates a overpressure due to a vapor cloud explosion of 1 psi to a distance of 0.09 mile. This scenario resulted in an impact to public.\n\nGeneral Accident Release Prevention Program and Chemical-Specific Prevention Steps: The facility has developed and instituted procedures to prevent and effectively respond to any accidental releases from the processes.  These procedures were developed in accordance with both the OSHA PSM standards in 29 C.F.R. 1910.119 and RMP "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 4987,
      "SummaryText": "40 C.F.R. Part 68 requirements.  The facility regularly trains personnel who are responsible for operating and maintaining the processes, both in the classroom and on the job.  Additionally, the anhydrous ammonia storage system complies with OSHA's storage and handling requirements set forth in 29 C.F.R. 1910.11.  The hydrogen storage and supply system is maintained by an outside supplier who incorporates safe procedures.\n\nFive-Year Accident History: The facility has had no RMP-reportable incidents of anhydrous ammonia, hydrogen and aqueous ammonia within the five years proceeding the submittal of the RMP.\n\nEmergency Response Program: The facility has an existing emergency response plan that contains emergency response and coordination procedures for releases from the anhydrous ammonia, hydrogen and aqueous ammonia processes.  This plan coordinates emergency response efforts with the local fire department and local planning commission. \n\nPlanned Changes to Improve Safety: The facility periodically reviews the program, training and maintenance procedures to identify any necessary changes that would improve safety at the facility.  Pursuant to this review procedure, the facility recently installed new control equipment and technology on the ammonia system including an emergency shut-off valve on the railcar side, an ammonia scrubber, a liquid level alarm and a  fire alarm in the control room.  \n\nSummary:  This RMP demonstrates that the facility has satisfied and complied with the requirements of Part 68."
    }
  ]
}