{
  "FacilityID": 49913,
  "FacilityName": "High Desert Power Project",
  "FacilityStr1": "19000 Perimeter Road",
  "FacilityStr2": null,
  "FacilityCity": "Victorville",
  "FacilityState": "CA",
  "FacilityZipCode": "92394",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.593611",
  "FacilityLongDecDegs": "-117.362778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "High Desert Power Project, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "High Desert Power Project, LLC",
  "OperatorStr1": "19000 Perimeter Road",
  "OperatorStr2": null,
  "OperatorCity": "Victorville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92394",
  "OperatorZipCodeExt": null,
  "FTE": 35,
  "OtherEPAFacilityID": "CAR000144493",
  "EPAFacilityID": "100000181288",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1047",
  "SafetyInspectionDate": "2008-11-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-04-27 09:36:57",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-10-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-10-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-10-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.595409,
  "FRS_Long": -117.363355,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72501,
      "AltID": null,
      "FacilityID": 49913,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 96162,
          "ProcessID": 72501,
          "ChemicalID": 57,
          "Quantity": 310000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 74225,
          "ProcessID": 72501,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 26662,
              "Process_NAICS_ID": 74225,
              "SafetyReviewDate": "2003-04-21 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2007-07-19 00:00:00",
              "ChangeCompletionDate": "2007-10-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Double Walled Storage Tank",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Level Alarms",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-10-14 00:00:00",
              "TrainingReviewDate": "2008-06-20 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-04-20 00:00:00",
              "EquipmentInspectionDate": "2007-10-05 00:00:00",
              "EquipmentTested": "Entire System-Daily Walkthrough Inspecitons",
              "ComplianceAuditDate": "2008-10-02 00:00:00",
              "AuditCompletionDate": "2009-11-18 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2002-10-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 27858,
                  "PreventionProgram2ID": 26662,
                  "ProcessChemicalID": 96162
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 49913,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-10-14 00:00:00",
    "ERTrainingDate": "2008-11-14 00:00:00",
    "CoordinatingAgencyName": "Victorville Fire Department",
    "CoordinatingAgencyPhone": "7609555229",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 49913,
      "SummaryText": "tuated with the containment berm.\n\nThe liquid is pulled from the tank through the ammonia shut off valve by a pump.  It then travels to the three Heat Recovery Steam Generators (HRSG) where it is used in separate SCR skid units for each HRSG.  There it flows through a strainer manifold and then flows through a back pressure regulator control valve, a flow control valve to the vaporizer and then the injection grid.  The catalyst bed provides the surface area for the SCR reactions to occur.\n\nThe ammonia shut off valve remains open based on several permissive conditions including, but not limited to: boiler load, reactor temperature, ammonia storage tank level, and metering pump operation.  The aqueous ammonia is mixed with compressed air prior to entering the vaporizer where it is mixed with hot blower air and then fed to either the economizer superheat-side or the economizer reheat-side of the ammonia injection grid in the combustion exhaust stack.\n\nThe NOx in the flue gas reacts with ammonia in the SCR reactor catalyst layers to form harmless elemental nitrogen and water.  The elemental nitrogen and water remain in the flue gas as it passes through the stack to the atmosphere.  The SCR reactor is designed for a NOx reduction efficiency of 89.3% when firing natural gas.\n\nThe maximum aqueous ammonia delivered to the system is 8,000 gallons per visit as that is the capacity of the truck.  As a precaution for an aqueous ammonia spill during delivery, an underground containment tank rests below the loading area.  Any spill of aqueous ammonia would drain to the tank.  \n\nThe SCR system is equipped with various automatic process controls which ensure safe and efficient operation of the SCR reactor, vaporizer, metering pumps, shut-off and regulating valves.  In addition, pressure relief valves automatically engage in the event the system experiences a very high pressure situation. \n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe storage of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 49913,
      "SummaryText": "aqueous ammonia at the High Desert Power Plant is governed by many safety features.  Much of the safety of the process is inherent in the policies and procedures that govern the operation of the process.  For example, the High Desert Power Plant operates in accordance with the California Accidental Release Prevention (CalARP) Program.  The CalARP Program includes a detailed hazard review to identify potential release scenarios, an analysis of the potential consequences associated with select release scenarios and a detailed seismic inspection of the aqueous ammonia process equipment.  In addition to the technical studies, the CalARP Program incorporated preventive programs such as detailed operating and maintenance procedures, incident investigation, training, auditing, and emergency response activities.  Finally, the aqueous ammonia processes are inspected by operators every two hours.\n\n25% Aqueous Ammonia\n\nThe High Desert Power Plant maintains tight control of its aqueous ammonia system through various process controls and monitors.  In the event that the primary engineering or administration controls at the facility fail and result in a release of aqueous ammonia, there are three mechanisms at the facility to minimize the impact:  1) a containment berm surrounding the aqueous ammonia tank sized to hold the entire contents of the tank, 2) an underground storage tank to contain any spills during the unloading process, and 3) both the storage tank and the underground containment tank are double-walled.  There are level controls on the storage tank to alert the operator to extreme level conditions. \n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no releases in the past five years (July 2002 ¿ July 2007) of aqueous ammonia that exceeded the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material.  In addition, there have been no injuries resulting from an aqueous ammoni"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 49913,
      "SummaryText": "a release, nor any releases or ¿near misses¿ that warranted an internal incident investigation.  \n\nEMERGENCY RESPONSE PROGRAM\n\nThe High Desert Power Plant has an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the CalARP document, which is maintained at the facility and updated as necessary.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nThe High Desert Power Plant maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, aqueous ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the RMP regulation, as well as to incorporate facility changes due to the renovation of the facility.\n\nThe High Desert Power Plant has coordinated emergency response efforts with the local fire department, Victorville Fire Department.  In the case of an aqueous ammonia-related emergency, it is the policy of the High Desert Power Plant to evacuate the employees and to allow the fire department to respond to the emergency (potentially with the assistance of trained facility personnel).\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Hazard Review (Hazard and Operability Study), the Seismic Assessment, and the Hazard Review Revalidation study provided mitigation measures to improve the safe operation of the ammonia refrigeration system at the facility.  The status of these issues was addressed during the Hazard Review Revalidation study on July 19, 2007 as part of the CalARP implementation. \n\nThe CalARP team is plan"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 49913,
      "SummaryText": "ning to complete several items over the next year as their continued effort to provide a safe work environment for the High Desert Power Plant employees.  These changes include the following items:\n\n1. Continue to train all employees in CalARP and the facility safety plan/programs.\n2. Continue to have employee involvement in safety plan development.\n3. Continue employee involvement through safety team participation.\n4. Continue internal and external safety audits/inspections and implement changes needed."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 49913,
      "SummaryText": "This Executive Summary contains the High Desert Power Plant¿s administrative and operational programs to prevent aqueous ammonia-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is 25% aqueous ammonia.  The following topics are addressed in this Executive Summary:\n\n· Accidental Release Prevention and Emergency Response Policies\n· Stationary Source and Regulated Substance\n· Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n· Five Year Accident History\n· Emergency Response Program\n· Planned Changes to Improve Safety\n· External Events/Seismic Summary\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe High Desert Power Plant is dedicated to operation of a safe work place for its employees, visitors,  and neighboring community.  The High Desert Power Plant has prepared risk and safety programs to ensure safe handling of the aqueous ammonia system. The High Desert Power Plant conducted the following technical studies to identify potential hazards and the appropriate mitigation measures:  Hazard Review, a Hazard Assessment, and a Seismic Assessment.  In July 2007 a Hazard Review Revalidation was conducted and both a Hazard Assessment Update and Seismic Assessment Revalidation were produced.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nOperations at the facility began in January 2003.  The facility is located at 19000 Perimeter Road in Victorville, California  92394.  \n\nSCR System - 25% Aqueous Ammonia\n\nA 25% aqueous ammonia solution  is used at the High Desert Power Plant in the Selective Catalytic Reduction (SCR)  system to help maintain air quality compliance of the emission stack,  specifically, reducing NOx  emissions.  Once in operating mode, the aqueous ammonia system is automatically controlled based on system demand.  The aqueous ammonia is stored in a 39,300 gallon double walled tank inside a bermed containment area.  Along with the tank, the pump skid is also si"
    }
  ]
}