{
  "FacilityID": 49948,
  "FacilityName": "Airgas Carbonic",
  "FacilityStr1": "103 Industrial St",
  "FacilityStr2": null,
  "FacilityCity": "Hopewell",
  "FacilityState": "VA",
  "FacilityZipCode": "23860",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51670",
  "LEPC": "Hopewell LEPC",
  "FacilityLatDecDegs": "37.303611",
  "FacilityLongDecDegs": "-077.278056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.airgas.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 41138371,
  "ParentCompanyName": "Airgas Carbonic Inc",
  "Company2Name": null,
  "CompanyDUNS": 24492860,
  "Company2DUNS": 0,
  "OperatorName": "Airgas Carbonic Inc",
  "OperatorStr1": "103 Industrial St",
  "OperatorStr2": null,
  "OperatorCity": "Hopewell",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23860",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bruce Worsham",
  "RMPTitle": "Hopewell Carbonic Plant Manager",
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200338",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-02-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-10-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-10-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-10-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "6",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72545,
      "AltID": "Airgas Hopewell",
      "FacilityID": 49948,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 74269,
          "ProcessID": 72545,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 96227,
          "ProcessID": 72545,
          "ChemicalID": 56,
          "Quantity": 12250.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 596227,
          "ProcessID": 72545,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 49948,
      "SummaryText": "\nAirgas Carbonic Liquid Carbon Dioxide and Dry Ice Plant is committed to employee (Associate), public and environmental safety. The company?s accidental release prevention program covers design, installation, operations, maintenance and training. The company's accidental release emergency response policy is to promptly take steps to abate and mitigate, report the situation to appropriate authorities and cooperate with authorities to protect lives and the environment.\n \nThe facility receives, processes and stores liquid carbon dioxide and manufactures dry ice. Anhydrous ammonia, which is used as a refrigerant, is the only substance regulated by the Environmental Protection Agency (EPA) Risk Management Plan (RMP) rule and the OSHA Process Safety Management (PSM) Standard. The maximum inventory of anhydrous ammonia on site is 10,000 pounds.\n\nProcess Safety Information: The Anhydrous Ammonia refrigeration facility is designed and constructed in accordance with accepted engineering and industrial codes and standards. Airgas retains OEM information that describes the chemical hazards, operating parameters and equipment designs associated with Anhydrous Ammonia refrigeration. It diligently identifies process hazards and controls them efficiently.\n\nProcess Hazard Analysis: The Process Hazard Analysis (PHA) is used to review design and operation of the Anhydrous Ammonia refrigeration facility. It was used for initial startup and is repeated every five years unless process change triggers an interim PHA.\n \nOperating Procedures: Airgas uses written operating procedures for process safety. Operating procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. These documents are reviewed annually and are made readily accessible to process operators as well as to maintenance and support associates involved in the refrigeration process.\n\nTra"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 49948,
      "SummaryText": "ining: Airgas provides training to Associates who will operate the Anhydrous Ammonia refrigeration process to ensure they are competent in operation, maintenance and process safety. Refresher training is provided as needed but occurs at least once every three years.\n\nMechanical Integrity: Airgas keeps records of maintenance inspections of the equipment in Anhydrous Ammonia service to ensure proper and safe operations. Process equipment that is regularly inspected includes, among others, pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, process controls and pumps. Only qualified associates perform maintenance on the Anhydrous Ammonia refrigeration system. Furthermore, maintenance associates are given specialized Anhydrous Ammonia safety training. Ammonia equipment deficiencies identified by maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change: Change to the system or equipment components is managed in accordance with written procedure (Management of Change). Associates who would be affected by a modification to the Anhydrous Ammonia refrigeration system are promptly made aware of the changes.\n\nPre-Startup Safety Reviews: Pre-startup safety reviews are used to validate construction, process equipment and operating and maintenance procedure changes prior to placing new or modified ammonia equipment into service.\n\nInternal Audits: Airgas audits itself to ensure that provisions of the RMP rule and PSM standard are fully implemented. These audits are conducted at least every three years and corrective measures are undertaken promptly.\n\nIncident Investigation: Airgas promptly investigates incidents that could have been reasonably expected to result in a catastrophic release of anhydrous ammonia, whether such a release occurred or not. The goal of such incident investigations is to identify the situation (or root cause) leading to the incident as well as any corrective actions necessary to pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 49948,
      "SummaryText": "event the situation from recurring. Incident reports are retained for five years.\n\n \nEmployee Participation: The Company conducts process safety management and accident prevention as a team effort. Associates are strongly encouraged to express their views concerning accident prevention issues and to recommend process safety and procedural improvements. Additionally, Associates have access to all information created as part of the facility?s implementation of the RMP rule and PSM standard, including information resulting from process hazard analyses. Airgas has an excellent record of preventing accidental releases. No accidental release has ever occurred at this facility.\n \nContractors: Occasionally the company hires contractors to conduct specialized maintenance and construction or renovation activities. Prior to selecting a contractor, a thorough evaluation of his safety performance is made. Airgas informs contractors of potential Anhydrous Ammonia hazards and other pertinent (potential) hazards related to the contractor?s work and the company?s processes. Contractors are also informed of procedures that must be followed for emergency response in the event of an accidental release of anhydrous ammonia.\n \nEmergency Response: A written Emergency Response Plan includes accidental releases of anhydrous ammonia and covers all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. Emergency response equipment is regularly inspected and serviced. The plan is regularly reviewed and promptly updated to reflect pertinent changes that would require a modified emergency response. The emergency plan has been coordinated and verified with the Hopewell Local Emergency Planning Committee (LEPC).\n\nFive Year Accident History: No accidents.\n\nPlanned Changes to Improve Safety: None required."
    }
  ]
}