{
  "FacilityID": 50039,
  "FacilityName": "Harris Ranch Beef Company",
  "FacilityStr1": "16277 South McCall Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Selma",
  "FacilityState": "CA",
  "FacilityZipCode": "93662",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": null,
  "FacilityLatDecDegs": "36.502098",
  "FacilityLongDecDegs": "-119.615278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.harrisranch.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Harris Farms Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Harris Farms Inc.",
  "OperatorStr1": "29475 Fresno-Coalinga Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Coalinga",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93210",
  "OperatorZipCodeExt": null,
  "FTE": 625,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200542",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-04-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-11-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-11-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-11-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-11-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72702,
      "AltID": "South Ammonia System",
      "FacilityID": 50039,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 96434,
          "ProcessID": 72702,
          "ChemicalID": 56,
          "Quantity": 18861.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 74432,
          "ProcessID": 72702,
          "NAICSCode": "311611",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 42648,
              "Process_NAICS_ID": 74432,
              "SafetyReviewDate": "2006-02-01 00:00:00",
              "PHA_Date": "2006-04-24 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-04-24 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2006-02-01 00:00:00",
              "TrainingReviewDate": "2006-02-01 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-04-22 00:00:00",
              "EquipmentInspectionDate": "2007-04-22 00:00:00",
              "EquipmentTested": "Pumps in South System Accumulators",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2006-02-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2006-03-01 00:00:00",
              "AuditCompletionDate": "2007-03-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2006-02-01 00:00:00",
              "HotWorkPermitReviewDate": "2006-02-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "South Ammonia Refrigeration System",
              "_chemicals": [
                {
                  "PrimaryKey": 62150,
                  "PreventionProgram3ID": 42648,
                  "ProcessChemicalID": 96434
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50039,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Selma Fire Department",
    "CoordinatingAgencyPhone": "5598912211",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50039,
      "SummaryText": "The Harris Ranch facility is located approximately 1 mile east of highway 43, and 2 miles southwest of highway 99.\nThe facility has developed a Risk Management Program to address California Accidental Release Prevention (CalARP) Program requirements (California Code of Regulations, Title 19, Division 2, Chapter 4.5, Sections 2735-2785).  The facility is extremely diligent in the handling of all chemicals and is dedicated to the safety of its employees and the neighboring community. The facility staff is highly trained and utilizes log sheets and employee rounds to monitor the facility and provide safeguards, while effectively and safely using ammonia as a refrigerant. The facility has a qualified Ammonia Refrigeration Contractor to assist with their operation and maintenance. \n \nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nThe facility has a long standing commitment to its workers and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the ammonia refrigeration system. The facility?s policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\nThe ammonia refrigeration system is used for ice making and to keep the product refrigerated.  No chemical reactions occur during the process cycle of an ammonia refrigeration system.  The operation of a refrigeration system requires controlling the ammonia (NH3) refrigerant pressure and temperature at key points in the system. The ideal cycle considers heat transfer in the condenser and evaporator without pressure losses. The refrigerant leaves the condenser as a high pressure, moderate temperature saturated liquid, and then enters an expansion valve and expands.  Past the expansion valve, the refrigerant is a low pressure, low temperature vapor as it enters the evaporator or ice machi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50039,
      "SummaryText": "ne.  Inside the evaporator or ice machine, the refrigerant gains heat and is evaporated at a constant pressure to become a vapor. This vapor is characterized as a low pressure, low temperature saturated vapor; it leaves the evaporator and enters the compressor, where the refrigerant is compressed. The compressor compresses the vapor at constant entropy and the refrigerant becomes a superheated vapor. The super heated vapor returns to the condenser where it is condensed at constant pressure back to a saturated liquid. Heat transfer to the evaporator and from the condenser occurs with an unlimited temperature difference between the substance emitting the heat and the substance absorbing the heat. This is not true during the de-superheating process in the condenser. This refrigeration process is a closed loop system, which prevents contact with other chemicals; however, the anhydrous ammonia does come into contact with lubricating oil.  The anhydrous ammonia and the oil are compatible and no chemical reaction occurs.\n\nHAZARD ASSESSMENT SUMMARY/OFFSITE CONSEQUENCE ANALYSIS\nWorst-Case Release Scenario \nPer the CalARP Regulations one worst case analysis has been defined for each ammonia refrigeration system.  RMP*Comp was used to determine the maximum downwind endpoint distance.  The results can be found in the Hazard Assessment documentation located behind the Hazard Assessment Tab in the Compliance Workbook.  This worst case release scenario is highly unlikely to occur because of active mitigation measures that can be taken and weather conditions that are unlikely as well.\nAlternative Release Scenario\nThe meteorological conditions specified by regulation for alternative release scenarios were used.  RMP*Comp was used to determine the maximum downwind endpoint distance.  The downwind distance for the alternative release scenarios are significantly less than that for the worst-case scenarios.  The results can be found in the Hazard Assessment documentation located behind "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50039,
      "SummaryText": "the Hazard Assessment Tab in the Compliance Workbook. \nRisk Considerations\nAlthough the storage and use of anhydrous ammonia has inherent potential risks, and worst-case release scenarios can potentially reach the community; the facility has recognized these potential risks and structured its safety systems to make the worst case type of event non-credible.  In addition to the safety practices of the facility and facility personnel that make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event (e.g., In the event of a release, sudden rupture and flashing of ammonia would be highly turbulent.  Turbulence causes entrainment of air and the released vapor dilutes much more quickly than is shown in the model).\nIn addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with an ammonia release:\n?There are process valves to permit isolation of any leaks in place without exposing anyone to the anhydrous ammonia.\n?The system utilizes automatic shut-downs that would prevent a deviation from resulting in a release. \n?Personal Protective Equipment (PPE) is used by plant personnel, as necessary.\n?The system has ammonia sensors that automatically notify an alarm company and activate various alarms and shutdowns.  \n?The machine room is equipped with an emergency ventilation system.\n?The facility has an ammonia dilution tank that all relief valves are discharged into.  The system can also be equalized and dumped into the dilution tank in the event of an emergency. \n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nAs part of the implementation of this CalARP Program, key prevention program elements were implemented by the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50039,
      "SummaryText": " facility to manage process safety issues associated with the use of ammonia for refrigeration.  In addition, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed; this includes common practices outlined by the International Institute of Ammonia Refrigeration (IIAR).  As ammonia is ?self alarming? due to its pungent odor, even minor releases are readily noticeable.  The Prevention Program 3 elements include:\n?Process Safety Information\n?Process Hazard Analysis\n?Operating Procedures\n?Training\n?Mechanical Integrity\n?Management of Change\n?Pre-startup Safety Review\n?Compliance Audits\n?Incident Investigation\n?Employee Participation\n?Hot Work Permit\n?Contractors\n?Emergency Response Plan\n\nIn addition, key emergency response elements were addressed in the Business Emergency Plan (BEP).  The entire prevention program elements are kept in the CalARP/EPA/RMP Compliance Workbook located onsite.  The prevention program elements satisfy the requirements of CalARP, EPA RMP, and OSHA PSM.\n\n FIVE-YEAR ACCIDENT HISTORY\nThere have been no CalARP-applicable releases of ammonia at the facility in at least the past five (5) years. \n\nEMERGENCY RESPONSE PROGRAM\nThe facility has filed a Chemical Inventory Business Emergency Plan with the City of Selma and this plan includes:\n?Emergency Alarm Procedures\n?Evacuation Procedures\n?Safety and Health Considerations\n?Notification Procedures\n \nPLANNED CHANGES TO IMPROVE SAFETY\nSeveral studies have been conducted to examine mitigation measures to improve safety at the facility.  These studies include the following: Process Hazard Analysis, Seismic Assessment, and Hazard Assessment.  Any outstanding recommendations from these studies will have been addressed by April 2007."
    }
  ]
}