{
  "FacilityID": 50070,
  "FacilityName": "Aslan Cold Storage, LLC",
  "FacilityStr1": "1045 Simpson St",
  "FacilityStr2": null,
  "FacilityCity": "Kingburg",
  "FacilityState": "CA",
  "FacilityZipCode": "93631",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": null,
  "FacilityLatDecDegs": "36.509293",
  "FacilityLongDecDegs": "-119.550870",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Scott Critchley",
  "OperatorStr1": "1045 Simpson St",
  "OperatorStr2": null,
  "OperatorCity": "Kingburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93631",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200588",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Program 3",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-11-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-11-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-10-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-10-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72734,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 50070,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 96477,
          "ProcessID": 72734,
          "ChemicalID": 56,
          "Quantity": 12300.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 74466,
          "ProcessID": 72734,
          "NAICSCode": "111339",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 42665,
              "Process_NAICS_ID": 74466,
              "SafetyReviewDate": "2007-10-03 00:00:00",
              "PHA_Date": "2007-10-03 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-10-03 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-10-09 00:00:00",
              "TrainingReviewDate": "2007-10-03 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-10-03 00:00:00",
              "EquipmentInspectionDate": "2007-09-24 00:00:00",
              "EquipmentTested": "Recip Compressor",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2007-10-03 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-10-03 00:00:00",
              "HotWorkPermitReviewDate": "2007-10-03 00:00:00",
              "ContractorSafetyReviewDate": "2007-10-03 00:00:00",
              "ContractorSafetyEvalDate": "2007-10-08 00:00:00",
              "CBI_Flag": 0,
              "Description": "Aslan Cold Storage has prepared a unified Risk & Process Safety Management Program.  The program is in compliance with California?s Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5 Program Level 3 Elements.  At the Federal level, Title 40 CFR Part 68), and California OSHA?s ?Process Safety Management (PSM) of Acutely Hazardous Materials? standard (in California CCR Title 8, Section 5189, ?Process Safety Management of Acutely Hazardous Materials,? and Federally Title 29 Code of Federal Regulations (CFR) 1910.119).  This program has been prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs., which is contained in our refrigeration system.",
              "_chemicals": [
                {
                  "PrimaryKey": 62176,
                  "PreventionProgram3ID": 42665,
                  "ProcessChemicalID": 96477
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50070,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2007-05-01 00:00:00",
    "ERTrainingDate": "2007-05-01 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "5598975457",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50070,
      "SummaryText": "Risk & Process Safety Management Program\n\nPreface ? Executive Summary\n\nfor\n\nAslan Cold Storage\n1045 Simpson St\nKingsburg, CA 93631\nTel. (559) 897-4609\nFax. (559) 897-4640\n\nPrepared by:\n\nCalifornia Controlled Atmosphere\n39138 Road 56\nDinuba, CA 93618\nTel. (559) 591-8874\nFax. (559) 591-8896\nwww.calca.com\n \nTable of Contents for Preface ? Executive Summary\n\n1.    TH ASLAN COLD STORAGE, RMP-PSM PROGRAM\n2.    DESCRIPTION OF AMMONIA SYSTE\n3.    GENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STES\n4.    FIVE YEAR ACCIDENT HISTOY\n5.    EMERGENCY ACTION PLA\n6.    PLANNED CHANGES TO IMPROVE SAFET\n \n?Living Document? Approach To Regulatory Compliance\n\nThis program is intended to meet the spirit and intent of the California Accidental Release Prevention Program (CalARP), CCR Title 19, Chapter 4.5 and the California Process Safety Management Program, CCR Title 8, Section 5189 as enforced by the local Certified Unified Program Agency and the Fed/EPA.  \n\nThis program is intended to be a ?living document.?  As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible. To accomplish this elements have been organized in a way that is consistent with the corporate organization, how frequently different elements are accessed, and who needs to refer to the program.  The order of elements within this organization is not the same as they are listed in the regulations, and in some cases portions of elements may be found in more than one location.   \n\n1.    THE  ASLAN COLD STORAGE, RMP-PSM PROGRAM\nThis is to inform all interested persons, including employees, that Aslan Cold Storage has updated their unified Risk & Process Safety Management Program.  The program is in compliance with California?s Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5 Program Level 3 Elements.  At the Federal level, Title 40 CFR Part 68), and California OSHA?s ?Process Safety Management (PSM) of Acutely Hazardous Materials? stan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50070,
      "SummaryText": "dard (in California CCR Title 8, Section 5189, ?Process Safety Management of Acutely Hazardous Materials,? and Federally Title 29 Code of Federal Regulations (CFR) 1910.119).  This program has been prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs., which is contained in our refrigeration system. \n\nOur program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of anhydrous ammonia. Overall, the program is designed to prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\nOur company has an exemplary safety record, one that we are quite proud of. Our company has many policies and procedures in place to promote overall plant, worker and public safety.  We have: (1) prepared a unified program based on the PSM plan to meet CalARP obligations as well; (2) reorganized the program so that it meshes more closely with general Aslan Cold Storage business practices; and (3) reviewed plan documentation forms and responsibilities.  The unified Risk & Process Safety Management Plan sets forth rules, procedures and practices that will help our employees protect themselves and our neighbors.\n\n2.    DESCRIPTION OF AMMONIA SYSTEM\nAslan Cold Storage operates a commercial storage facility for deciduous tree fruit in Kingsburg, CA.  The facility has an ammonia system that can hold a charge of 12,300 lbs.  The ammonia system provides refrigeration capacity to five cold storage rooms.  The rooms use ?bunker style? coils that contain chilled liquid ammonia.  UDCs provide substantial control and alarm capability.\n\nThe system operates as follows.  High pressure liquid from a high pressure receiver is piped to each cold room where it passes through an expansion valve into a low pressure accumulator vessel mounted in the bunker wall.  Low temperature liquid circulates by thermal conve"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50070,
      "SummaryText": "ction through the evaporator coils located behind bunker walls in the cold rooms.  Low pressure and temperature gas collects in the accumulator vessel, and passes through a pressure regulator into a suction line.  The suction line returns the vapor to one of the primary accumulator vessels located in the engine room, which separates any residual liquid from the gas.  The gas is piped to screw and reciprocating compressors which elevate the temperature and pressure of the gas.  The high pressure discharge from the compressors is sent to four water cooled evaporative condensers where the high pressure gas ammonia is liquified and returned to the high pressure receivers. Liquid separated from the suction return gas in the primary accumulator vessels drains into one of two liquid transfer vessels.  Operation of a float switch activated solenoid valve raises the pressure in the liquid transfer vessel to the point the liquid can be drained into the high pressure receiver.  There are two high pressure receivers, however, they are piped together so that they act in concert.   \n\nThe refrigeration system at Aslan Cold Storage was originally built more than 25 years ago and has been added to and modified several times over the years since then.  The facility was designed and installed by professional refrigeration engineers in accordance with industry standards at the time.  It was also built in compliance with the Uniform Mechanical Code and Uniform Building Code applicable at the time of construction. The system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to the atmosphere if the pressure in the system exceeds their set point.  \n    \nThe ammonia system at Aslan Cold Storage consists of vessels which are interconnected, or which are co-located such that a release of ammonia could impact the ability to operate vessels that are "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50070,
      "SummaryText": "not directly connected.  Therefore, the facility is treated as a single process.\n\n3.    GENERAL ACCIDENT RELEASE & AMMONIA SPECIFIC PREVENTION STEPS\nThe ammonia refrigeration systems at the  Aslan Cold Storage facility are an integral part of the overall business.   The system contains a total charge of approximately 12,300 lbs. It is extremely important that it is maintained and operated in a safe and efficient manner.  Management is committed to making sure that all employees are made aware of the potential danger of an ammonia leak.  Aslan Cold Storage has also conducted an off-site impact analysis of worst-case and alternate-case release scenarios for the purposes of informing the public in the event of an accidental release.  The results of this analysis are reported in the body of the program.\n\nOur refrigeration personnel monitor the ammonia refrigeration system/process and keep an active journal of all procedures and transactions that pertain to ammonia.  In addition, the system/process is checked frequently by our outside refrigeration contractor, California Controlled Atmosphere, who also performs an annual pre-season preventative maintenance review of our system/process equipment. \n\nWe inform our employees of the dangers of an accidental release of ammonia in pre-season safety meetings.  New employees are made aware of the potential risk of ammonia in an employee orientation meeting.  During these meetings we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n4.    FIVE YEAR ACCIDENT HISTORY\nAslan Cold Storage has not had any reportable accidents within the last five years.\n\n5.    EMERGENCY ACTION PLAN\nThis facility?s emergency response program is based on the Cal/OSHA requirements for Emergency Action Plans (in California CCR Title 8, Section 3220, ?Emergency Action Plans.?  Federally, Title 29 CFR 1910.38 and 1910.119), HAZWOPER (standard (in California CCR Title 8, Section 5192, ?Hazardous Waste Operations and Emergen"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50070,
      "SummaryText": "cy Response,? and Title 29 CFR 1910.120). \nStrategically, we will respond defensively to a release.  Under this plan our ammonia refrigeration personnel will take whatever steps are necessary to bring a release under control. The first priority will be to operate the ammonia system to bring a release under control safely, from a distance, without donning personal protective equipment. To better prepare for this type of action, initial training to the defensive level (First Responder, Operations Level) as defined in the HAZWOPER regulations will take place within the next year. All response activities would be done in coordination with the local fire department and the Fresno County Fire Department and the Hazardous Materials Response Team.\n\nEvery year at the beginning of the season we review with our employees our evacuation procedures in the event of an emergency, including an ammonia release. \n\n6.    PLANNED CHANGES TO IMPROVE SAFETY\nOur company has an outstanding safety record, one that we are quite proud of.  Many policies and procedures have been implemented to promote overall plant, worker and public safety.  Nevertheless, Aslan Cold Storage continually strives to improve in all areas, including safety.  Preparation of this Risk & Process Safety Management Program has been the primary recent improvement, and implementation of the program is our plan for improved safety in the near future.\n\nThe Risk & Process Safety Management Program has been written so that program elements are aligned with Aslan Cold Storage business practices rather than the order presented in the law.  Thus, Safe Operating Procedures are grouped together for the benefit of our system operator.  Safe Operating Policies are grouped together so that appropriate office staff may administer them.  The Emergency Action Plan is now separated out and distributed widely through the plant for easy reference.  \n\nThe Risk & Process Safety Management Program documentation forms and company policy forms pe"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 50070,
      "SummaryText": "rtaining to employee, contractor, and community safety have been carefully reviewed so as to prevent unnecessary complexity and redundancy.  Our operator assisted in the writing of Standard Operating Procedures, and they are presented in a format that is easy to use.  \n\nFor the future, Aslan Cold Storage now thinks of the Risk & Process Safety Management Program as a ?living document?.  It is an interactive framework that guides safe action for Aslan Cold Storage employees, but allows for feedback and continual improvement.  Through the Risk & Process Safety Management Program Aslan Cold Storage will continue to profit while maintaining overall plant, worker and public safety."
    }
  ]
}