{
  "FacilityID": 5008,
  "FacilityName": "Phibro-Tech, Inc.",
  "FacilityStr1": "8851 Dice Road",
  "FacilityStr2": null,
  "FacilityCity": "Santa Fe Springs",
  "FacilityState": "CA",
  "FacilityZipCode": "90670",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.95975",
  "FacilityLongDecDegs": "-118.064944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2141950,
  "ParentCompanyName": "Philipp Brothers Chemical Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6989008,
  "Company2DUNS": 0,
  "OperatorName": "Phibro-Tech, Inc.",
  "OperatorStr1": "8851 Dice Road",
  "OperatorStr2": null,
  "OperatorCity": "Santa Fe Springs",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90670",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Ed Vigil",
  "RMPTitle": "Environmental & Safety Manager",
  "FTE": 55,
  "OtherEPAFacilityID": "CAD008488025",
  "EPAFacilityID": "100000065172",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.95995,
  "FRS_Long": -118.0676,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5882,
      "AltID": "Ammonia Etchant System",
      "FacilityID": 5008,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6026,
          "ProcessID": 5882,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6353,
          "ProcessID": 5882,
          "ChemicalID": 56,
          "Quantity": 66000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506353,
          "ProcessID": 5882,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 5883,
      "AltID": "Ferric Chloride System",
      "FacilityID": 5008,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6027,
          "ProcessID": 5883,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6354,
          "ProcessID": 5883,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506354,
          "ProcessID": 5883,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5008,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Phibro-Tech, Inc. facility has an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nPhibro-Tech, Inc. maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThere are several different recovery processes that occur at Phibro-Tech.  The regulated substances of concern at Phibro-Tech, Inc. are ammonia and chlorine.  The processes that use or generate regulated substances include the following:  Copper Chloride System, Copper Ammonium Chloride System, Ferric Chloride Process, and Ammonia Etchant System.  The occurrence of each regulated substances is described below.\n\nCopper Ammonium Chloride System\n\nSpent copper ammonium chloride etchant \"spent\" from various customers is brought to Phibro-Tech by tank truck and other containers (55 gallon drums).  The etchant is pumped from the tank trailer or containers into one of two 16,000 gallon storage tanks, C-8 and C-9.  From storage, the spent ammonium chloride is processed to recover copper and saleable production grade ammonium chloride. \n\nAmmonia Etchant System\n\nAmmonia, carbon dioxide, and other additives are used to produce product grade m"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5008,
      "SummaryText": "aterial from the residual ammonium chloride solutions resulting from the cupric chloride and copper ammonium chloride systems.  The ammonium chloride solutions are piped to the aqua ammonia solution tanks were the ammonia and carbon dioxide are added. \n\nCupric Chloride System\n\nThe cupric chloride process is the same as the process used to recover the spent copper ammonium chloride etchant.  Spent cupric chloride etchant from various customers is brought to Phibro-Tech by tank truck and other containers (55 gallon drums).  The etchant is pumped from the tank trailer or container into one of three storage tanks(C-5, C-6, and C-7).  From storage, the spent cupric chloride is processed to recover copper which is converted to copper oxide, dried and sold.\n\nFerric Chloride System\n\nThe ferric chloride process treats a spent solution containing copper and other trace heavy metals to produce a saleable ferrous chloride material.  Spent ferric chloride is brought to Phibro-Tech by tank truck or 55 gallon drum containers.  The material is stored in a 8500 gallon storage tank and flows from the storage tank to the reactor (F-2A) where it is contacted with scrap iron.  From the reactor(s), the ferrous chloride product is transferred to the chlorinators where it is contacted with chlorine. \n\nThe regulated substances used at the Phibro-Tech facility are ammonia and chlorine.  The facility stores a maximum of 66,000 pound of ammonia in the bulk ammonia tank and 180,000 pounds of chlorine in the 90-tons chlorine tank.\n\nHAZARD ASSESSMENT SUMMARY\n\nWorst Case Release Result Summary\n\nScenario Description: Release of the maximum quantity of chlorine that can be stored in a vessel - 180,000 pounds in 10 minutes.  The release rate of chlorine is calculated to be 18,000 pounds per minute.  The most pessimistic meteorological conditions were used: 1.5 meters/second wind speed, and F stability.  Reference table from the EPA's RMP Guidance for Wastewater Treatment Plants was used.  This releas"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5008,
      "SummaryText": "e reaches off-site and may affect both population and environmental receptors.\n\nAlternative Release Result Summary - Ammonia\n\nScenario Description: A release of ammonia from resulting from a 1/4 inch diameter hole in a pipe.  The release rate of ammonia due to the pressure of the tank is 33 pounds per minute.The meteorological conditions used were 3 meters per second wind speed, and D stability.  Reference table from the EPA's RMP Guidance for Ammonia Refrigeration was used.  This release reaches off-site and may affect population receptors.  No Environmental receptors were affected by the potential release scenario.\n\nAlternative Release Result Summary - Chlorine\n\nScenario Description: A release of a chlorine mixture of gas and liquid from 1/2 inch diameter leak.  The release rate of chlorine due to the pressure of the tank is 149 pounds per minute.  The meteorological conditions used were 3 meters per second wind speed, and D stability.  Reference table from the EPA's RMP Guidance for Wastewater Treatment Plants was used.  This release reaches off-site and may affect population receptors.  No Environmental receptors were affected by the potential release scenario.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Phibro-Tech, Inc. facility including each chemical recovery system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of chemical recovery systems.  These safety features include  ammonia/chlorine sensors, automatic shut down buttons, and scrubbers.\n  \nAmmonia/Chlorine Detectors\n\nThe ammonia sensors are located in the vicinity of the ammonia storage tank, cupric oxide reactor, the maintenance shop, the laboratory, and on the north side of the facility, along the fence line (2).  The ammonia sensors are located outside and therefore are protected with a porous plastic cover to prevent contact with chemicals, dirt, water, or dust contamin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5008,
      "SummaryText": "ants.  The chlorine sensors are located near the chlorine rail car, the chlorine evaporator, the ferric chloride scrubber exhaust piping, and the north and south sides of the ferric chloride process area (2). \n\nEmergency Shut Down Buttons\n\nChlorine and ammonia remote emergency shut down (ESD) buttons are placed throughout the facility.  In the event of an emergency, the operator can use one of these buttons to shut off the chlorine or ammonia flow.  There are five chlorine EDS buttons which are located in the laboratory, ferric chloride process area (2), the maintenance shop, and the production office.  The four ammonia EDS buttons are located near the ammonia etchant area, the maintenance shop, and the production office (2).\n\nAmmonia Scrubber\n\nAmmonia vapors from the reactors as well as the recovery tank and the decant tank, are sent to the packed tower scrubber system.  This system consists of a packed column and a secondary tower that releases to the atmosphere.  This system only vents one of the three reactors at any time during the addition of caustic soda and steam to the reactors.  The ammonium chloride solution flows from the bottom of the scrubber and packed tower back to the ammonium chloride solution tanks.\n\nThe primary scrubber is six feet in diameter and eight feet in height and the secondary tower is 3.5 feet in diameter and five feet in height.  While the reactors are operating, not less than 50 gallons per minute of scrubbing solution at a pressure of 5 psig must be supplied to the scrubber.  There is a pH controller-recorder at the exit of the pump that is set to open the valve to the hydrochloric acid stream if the recorder exceeds a value of 2.  Electrical interlocks are provided as permit requirements that shut down the system if the pH of the scrubbing solution exceeds a value of 6.  This includes stopping the agitators, the flow of steam, and the flow of caustic solution.  Hourly temperature readings for each reactor and hourly pH readings at t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5008,
      "SummaryText": "he scrubber inlet are taken and logged by the operator.  \n\nThe scrubbing system is also equipped with an interlock system that will shut down the reactor agitators, steam flow, and caustic flow if the exhaust blower fails or the scrubbing solution pump flow rate falls below 50 gallons per minute.  The exhaust blower has a pressure sensitive switch to signal the shut down and the circulating pump has a flow meter switch.\n\nFerrous Chloride Scrubber\n\nVapors from the chlorinators are sent to this scrubber.  It is a packed column type scrubber with a two horsepower pump and the following dimensions:  1.5 feet in diameter and 12 feet in height.  Chlorine vapors are collected from the, two chlorinators (at any one time).  Vapors from this scrubber continue to the caustic scrubber prior to venting to atmosphere.\n\nThis scrubber uses a ferrous chloride solution as its scrubbing media which is recirculated through a tank.  The recirculation tank is 10 feet in diameter and 8.5 feet in height.  The circulating fluid to the ferrous chloride scrubber must be replaced when the ferric chloride content reaches 100 grams per liter or less.  Not less than 12 gallons per minute of the ferrous chloride scrubbing solution at a pressure of 17 psig is supplied while the process equipment is operating.  The composition of the circulating solution in the ferrous chloride scrubber is analyzed once per operating day.  It is also equipped with a chlorine detector in the gas exhaust line.  In the event of decreased or no ferrous chloride solution flow to the scrubber or reduced scrubbing capabilities, the flow of chlorine will be automatically shut off at the rail car.  This occurs by either the low flow switch or the chlorine sensor \n\nCaustic Scrubber\n\nThe 1000 gallon caustic scrubber treats vapors from the ferrous chloride scrubber, two ferrous chloride reactors, and a drum wash station.  It is equipped with a level gauge, caustic feed line, recirculation tank, a two horsepower recirculation pu"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5008,
      "SummaryText": "mp, and a five horsepower blower.  The scrubber is 4 feet in diameter and 17 feet in height and there is two inch jaeger tripack packing for seven feet and one inch jaeger tripack packing for 1.5 feet in the mist eliminator at the top of the column.  The recirculation tank is six feet in diameter and six feet in height.  This scrubber is also equipped with a temperature gauge, and a pH indicator and alarm inside the recirculation tank.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThe accident history researched back five years to June 1994 shows that the Phibro-Tech facility has not had an accidental release or \"near miss\" of ammonia and/or chlorine.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Phibro-Tech, Inc. has an emergency response plan in effect at the facility.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nPhibro-Tech, Inc. maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to the renovation of the facility.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAn Initial Hazard & Operability (HAZOP) Study was conducted on October 14-17, 1991 and February 11, 1992 for compliance with the California Risk Management and Prevention Program (RMPP).  On April 21, 1999, this study was reviewed and revalidated for compliance with this regulation.  During th"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 5008,
      "SummaryText": "is revalidation session, all previous recommendations were reviewed.  Any incomplete recommendations were reviewed for applicability and added if necessary to the new list of recommendation.  The following outlines the outstanding mitigation measures as well as new recommendations from the revalidation study.  In Addition, to the Process hazard Analysis, the chlorine and ammonia equipment was examined by a structural engineer to ensure seismic stability.  All recommendations are scheduled to be complete by May 2000.\n\nREV01 Install high level alarms to all vessels with hazardous material to comply with fire code (LAH at 90% and LSH at 95%). See R45 from the initial study.\n\nREV02 Ensure that the operators are wearing proper PPE (gogle/facemask/respirator) during sampling procedure (Cupric Chloride/Copper Ammonium Chloride).  See R57 from the initial study.\n\nREV03 Consider replacing the manual shut down valve on the ammonia tank with an automatic shut off switch. See R91 from the initial study.\n\nREV04 Include in the operating procedures, that the operator verifies the quantity of ammonia being delivered.  Also, the operator should be present during the entire fill procedure. See R93 from the initial study.\n\nREV05 Ensure that the ammonia tank relief valves are tied to the scrubber system.  See R95 from the initial study.\n\nREV06 Install level switches on the aqua ammonia solution tanks to prevent overflow. See R105 from the initial study.\n\nREV07 Consider interlocking the low vacuum sensor to the ammonia shut off valve.  See R117 from the initial study.\n\nREV08 Pending Client Review of R121 from the initial study.\n\nREV09 Pending Client Review of R122 from the initial study.\n\nREV10 Consider installing an expansion chamber.  See R126 from the initial study.\n\nREV11 Tag warning labels on the evaporator inlet valve to prevent trapping chlorine. See R126 from the initial study.\n\nREV12 Check with Chlorine Institute for leak data on wire braided flexible hoses.  See R131 from the "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 5008,
      "SummaryText": "initial study.\n\nREV13 Consider installing an alarm to check the caustic scrubber operation (i.e. digital flow meter). See R157 from the initial study.\n\nREV14 Install level switches to the ferric chloride reactors.  See R177 from the initial study.\n\nREV15 Determine the level of rescue and medical duties for an emergency situation.  Also, include the Fire Department direct line in the cellular telephone memory or on the call-list as the cellular 9-1-1 reaches the CA Highway Patrol.\n\nREV16 Consider posting labels on piping to indicate the direction of flow and equipments listed in the procedures.\n\nREV17 Post warning signs near the evaporator and the loading platform stairs.\n\nREV18 Consider using an outside alarm company to notify managers in case of an after working hour emergency.\n\nREV19 Add inspection schedule to the existing preventive maintenance program.\n\nREV20    Verify operator training certifications and records."
    }
  ]
}