{
  "FacilityID": 5018,
  "FacilityName": "Northwest Ottawa Water Treatment Plant",
  "FacilityStr1": "30 Sherman Street",
  "FacilityStr2": null,
  "FacilityCity": "Grand Haven",
  "FacilityState": "MI",
  "FacilityZipCode": "49417",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26139",
  "LEPC": "Ottawa County LEPC",
  "FacilityLatDecDegs": "43.059194",
  "FacilityLongDecDegs": "-86.236389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Ottawa County Road Commission",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Grand Haven, MI",
  "OperatorStr1": "519 Washington Street",
  "OperatorStr2": null,
  "OperatorCity": "Grand Haven",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000061648",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-09 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": "Michigan",
  "ForeignZipCode": "49417",
  "ForeignCountry": "US",
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-02-07 00:00:00",
  "DeRegistrationEffectiveDate": "2010-02-15 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 43.05963,
  "FRS_Long": -86.23631,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5893,
      "AltID": "Chlorine Storage",
      "FacilityID": 5018,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 6404,
          "ProcessID": 5893,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6038,
          "ProcessID": 5893,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2502,
              "Process_NAICS_ID": 6038,
              "SafetyReviewDate": "1999-05-26 00:00:00",
              "PHA_Date": "1999-05-26 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-02 00:00:00",
              "TrainingReviewDate": "1999-06-02 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-02 00:00:00",
              "EquipmentInspectionDate": "1999-06-02 00:00:00",
              "EquipmentTested": "Chlorine Crane",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-02 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-06-03 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-02 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-02 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-02 00:00:00",
              "ContractorSafetyEvalDate": "1999-04-19 00:00:00",
              "CBI_Flag": 0,
              "Description": "The chlorination process consists of nine 1-Ton containers.  All sections of this prevention program apply to these nine containers.  The prevention program for Northwest Ottawa WTP complies with 40 CFR 68 Subpart D and includes process safety information(PSI), a process hazard analysis (PHA), and procedures for the following:  operating, training, mechanical integrity, management of change, pre-startup safety review, compliance audit, incident investigation, employee participation, hot work permit, and contractors.",
              "_chemicals": [
                {
                  "PrimaryKey": 2813,
                  "PreventionProgram3ID": 2502,
                  "ProcessChemicalID": 6404
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5018,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Ottawa County LEPC",
    "CoordinatingAgencyPhone": "6167384050",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5018,
      "SummaryText": "Northwest Ottawa Water Treatment Plant (WTP) is a municipal drinking water treatment plant.  This facility is located at 30 Sherman Street in Grand Haven, Michigan.\n\nThe following document contains information intended to analyze the impacts of an accidental release of an extremely hazardous substance and to highlight the steps the facility is taking to prevent a release from occurring.  This document meets the requirements of the U.S. Environmental Protection Agency (EPA) Clean Air Act Risk Management Program rules listed in 40 CFR Part 68.  The intent of the rule is to reduce the likelihood of a chemical release and the consequences of a release if one were to occur.  The disinfection process utilizes chlorine which is a regulated substance under the Risk Management Program.\n\nNorthwest Ottawa WTP has a maximum inventory of 18,000 pounds of chlorine, which surpasses the EPA threshold of 2,500 pounds.  The facility is also subject to the Occupational Health and Safety Association (OSHA) Process Safety Management (PSM) program.  Modeling results indicate the worst-case release would cause an offsite impact. Due to these factors, Northwest Ottawa WTP is subject to Program 3 requirements under 40 CFR Part 68.\n\nBecause of the potential hazards when using chlorine, it is essential that steps be taken to minimize the risk of a catastrophic release.  The prevention program for Northwest Ottawa WTP includes process safety information(PSI), a process hazard analysis (PHA), and procedures for the following:  operating, training, mechanical integrity, management of change, pre-startup safety review, compliance audit, incident investigation, employee participation, hot work permit, and contractors.  The purpose of the PSI is to compile and update written process safety information for use by employees, PHA teams, and auditors.  The PHA identifies, evaluates, and controls the  hazards and risks associated with processes using regulated substances.  The operating procedures are i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5018,
      "SummaryText": "nstructions for operating (initial and emergency startup; normal, temporary, and emergency operations; and emergency and normal shutdown).  Training ensures that the operators and other personnel working on or near regulated processes are properly instructed in the hazards and response actions associated with the release of regulated substances.  Mechanical integrity requires the identification, inspection, and testing of the process equipment.  Furthermore,  mechanical integrity creates and implements written practices for maintaining the mechanical integrity of the process equipment.  Management of change reviews the changes made to process chemicals, technology, equipment, and procedures.  The pre-startup review is to be performed in conjunction with the management of change.  The review examines the safety of new and modified regulated processes.  The purpose of the compliance audit is to analyze the owner's or operator's compliance with the requirements of Program 3. Incident investigations review all occasions that resulted in or had the possibility of resulting in a release of the regulated substance.  Employee participation is the involvement of operators or other personnel in the creation and implementation of Program 3 provisions.  Hot work permits are to be issued for all hot work performed on or near a regulated process.  The purpose of the contractor review is to ensure that all contractors are evaluated in their safety performance and programs and to prepare the contractors against the hazards associated with the regulated substances. \n\nTo predict the offsite impact in the event of a release, a hazard analysis was conducted according to the procedures outlined in the rule.  The worst-case release quantity for toxic gases is assumed to be a release of the largest container in the process over a period of 10 minutes.  The maximum quantity of chlorine stored in any one container at the facility is 2,000 pounds.  Therefore, the release rate used in the con"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5018,
      "SummaryText": "sequence modeling was 200 pounds per minute for the entire 10-minute release period.  No mitigation or administrative controls were considered.  Due to the extensive preventative maintenance procedures, training, and emergency response procedures that have been implemented at Northwest Ottawa WTP, it is highly unlikely that this scenario would occur.\n\nFor Program 3 processes, the rule requires that at least one alternative release scenario be analyzed for each regulated toxic substance.  The alternative release scenario must be more likely to occur than the worst-case and must have an offsite impact whenever possible.  Potential alternative release scenarios for Northwest Ottawa WTP include valve leaks, regulator breaks, gasket leaks, and pipe breaks.  Because a regulator break would result in the greatest quantity released and the greatest release rate, this was determine to be the alternative release scenario.  Monitoring equipment located inside Northwest Ottawa WTP will detect low levels of chlorine and alert staff of a possible leak.  In the event of a release inside the facility, there would be prompt response and proper measures would be implemented to control the release.  However, for purposes of this analysis, the entire contents of one container (2,000 pounds) were assumed to be released over a one-hour period.  The chlorine containers are stored in an enclosed room which would provide mitigation of a release should one occur.  The RMP Offsite Consequence Analysis Guidance published by the EPA recommends applying a 55% mitigation factor to the release rate for releases in enclosures.  This factor was used in the alternative release scenario for Northwest Ottawa WTP.  \n\nThe hazard analysis performed for the facility also includes a review of its five year accident history.  During the past five years, Northwest Ottawa WTP has not had an accidental release that met the criteria of 40 CFR 68.42(a).   \n\nNorthwest Ottawa WTP has been actively involved in emerg"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5018,
      "SummaryText": "ency response planning.  They have worked closely with the Ottawa County Local Emergency Planning Committee (LEPC) to develop standard operating procedures (SOPs) for offsite response.  Northwest Ottawa WTP is a Program 3 source and  a non-responding facility.  The Northwest Ottawa WTP Emergency Response Plan outlines procedures for internal response to incidental releases and notification and coordination with the local emergency response organizations in the event of an incidental release which cannot be contained and will have offsite impacts."
    }
  ]
}