{
  "FacilityID": 50216,
  "FacilityName": "Vincennes, IN",
  "FacilityStr1": "409 North Country Market Lane",
  "FacilityStr2": null,
  "FacilityCity": "Vincennes",
  "FacilityState": "IN",
  "FacilityZipCode": "47591",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18083",
  "LEPC": "Knox County LEPC",
  "FacilityLatDecDegs": "38.682500",
  "FacilityLongDecDegs": "-087.425611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Ceres Solutions",
  "Company2Name": "12590",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ceres Solutions",
  "OperatorStr1": "PO Box 432",
  "OperatorStr2": "2112 Indianapolis Road",
  "OperatorCity": "Crawfordsville",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "47933",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000123608",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-07 00:00:00",
  "SafetyInspectionBy": "Indiana State Chemist",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Ceres Solutions",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2007-11-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-11-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-11-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 38.6825,
  "FRS_Long": -87.42561,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-DIGITIZED",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 72935,
      "AltID": "Fertilizer Manufacturing",
      "FacilityID": 50216,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 96728,
          "ProcessID": 72935,
          "ChemicalID": 56,
          "Quantity": 170000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 74669,
          "ProcessID": 72935,
          "NAICSCode": "32531",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 42787,
              "Process_NAICS_ID": 74669,
              "SafetyReviewDate": "2003-10-01 00:00:00",
              "PHA_Date": "2003-04-08 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-12-22 00:00:00",
              "TrainingReviewDate": "2003-12-12 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Video",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-01-15 00:00:00",
              "EquipmentInspectionDate": "2004-04-28 00:00:00",
              "EquipmentTested": "Reactor and related equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2004-01-15 00:00:00",
              "PreStartupReviewDate": "2003-12-18 00:00:00",
              "ComplianceAuditDate": "2002-04-08 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-12-13 00:00:00",
              "HotWorkPermitReviewDate": "2003-12-13 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2004-01-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "Up to 60 times per year 10-34-0 liquid fertilizer is manufactured by combining anhydrous ammonia, super phosphoric acid and water in a converter reactor. The super phosphoric acid is delivered in insulated rail tank cars. The super phosphoric acid is transferred to the reactor via a flexible hose to the reactor tank. The anhydrous ammonia is delivered by a high pressure gas cargo tank truck and stored in a pressurized aboveground storage tank.",
              "_chemicals": [
                {
                  "PrimaryKey": 62343,
                  "PreventionProgram3ID": 42787,
                  "ProcessChemicalID": 96728
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50216,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-02-10 00:00:00",
    "ERTrainingDate": "2004-02-10 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "8128825665",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Indiana State Chemist"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50216,
      "SummaryText": "Executive Summary\n(Revised in accordance with EPA?s requirements for the five year update.)\n\nAccidental Release Prevention and Emergency Response Protocols:  The owners, management and employees of this facility are committed to providing a safe workplace free of accidental releases of anhydrous ammonia.  Health, safety and environmental compliance are a fundamental part of every employee's job.  It is facility protocol to adhere to applicable Federal, State and local laws and to implement appropriate controls to prevent accidental releases of anhydrous ammonia.  If an accidental release were to occur, the facility would respond in accordance with its Emergency Action Plan and is prepared to work with the local fire department, the Local Emergency Action Committee and other authorities to control and mitigate the release and minimize the impact of the release to employees, the environment and the general public.\n\nStationary Source and Regulated Substances Handled: Up to 60 times per year 10-34-0 liquid fertilizer is manufactured by combining anhydrous ammonia, super phosphoric acid and water in a converter reactor.  The super phosphoric acid is delivered in insulated rail tank cars.  The super phosphoric acid is transferred to the reactor via a flexible hose to the reactor tank.  The anhydrous ammonia is delivered by a high pressure gas cargo tank truck and stored in a pressurized aboveground storage tank.\n\nWorst-Case Release Scenario and Alternative Release Scenario:  This facility has developed a worst-case and alternative-case scenario however it has been withheld from this Executive Summary as security-sensitive information as requested by EPA.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps:  This facility complies with EPA's accidental release prevention requirements and applicable State and local codes and regulations.  The following sections 1 through 7 briefly describe the elements of the release prevention program for "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50216,
      "SummaryText": "the handling and storage of anhydrous ammonia.  Sections 8 through 19 briefly describe the release prevention program elements for the liquid fertilizer manufacturing process. \n\n1) Safety Information:  The facility was designed and constructed in accordance with applicable Federal and State regulations.  All plans and procedures maintained at the facility are periodically reviewed by facility management for safety updates and changes.  Material Safety Data Sheets, equipment specifications and the codes and standards used to build and operate the anhydrous ammonia equipment are maintained at the facility. \n\n2) Hazard Review:  Facility management conducts reviews of the hazards associated with the handling and storage of anhydrous ammonia.  The reviews identify the opportunity for equipment malfunctions or human errors that could cause an accidental release, the safeguards used to control hazards and prevent releases, and the steps used to detect or monitor releases.  The results of the reviews are documented and problems identified are addressed in a timely manner.  \n\n3) Operating Procedures:  The facility maintains written operating procedures for the handling and storage of anhydrous ammonia.  The procedures generally follow the provisions of the Occupation Safety and Health Administration (OSHA) standard, 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\" and the American National Standards Institute (ANSI) standard, \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia, K-61.1\".  The written procedures are reviewed by facility management on a regular basis and revised as necessary. \n\n4) Training:  All employees at the facility that handle anhydrous ammonia participate in a training program.  Initial training for new employees consists of classroom type instruction (e.g., reading safety information, operating procedures and response measures followed by a written test) and on-the-job supervision.  Refresher training for all employees is "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50216,
      "SummaryText": "conducted at least once every three (3) years.  The training program is reviewed by facility management on a regular basis and revised as necessary. \n\n5) Maintenance:  The facility maintains written equipment inspection and maintenance procedures.  Storage and transfer/process equipment inspections are performed by qualified personnel on an approximate annual basis and are documented.  Equipment maintenance procedures follow either instructions furnished by the equipment vendors, Federal or State regulations (i.e., the provisions of the OSHA standard, 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\") or industry codes (i.e., the provisions of the ANSI standard, \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia, K-61.1\").  The written procedures are reviewed by facility management on a regular basis and revised as necessary.\n\n6) Compliance Audits:  As required by the RMP rule, compliance audits will be performed at least once every three (3) years.  The audit will be documented and conducted by a person knowledgeable in the safe handling and storage of anhydrous ammonia.  Corrective actions required as a result of each compliance audit will be performed promptly and documented.    \n\n7) Incident Investigation:  Facility management will investigate each incident that results in, or could have reasonably resulted in a catastrophic release of anhydrous ammonia.  The investigation will be performed to identify the situation leading to the incident as well as corrective actions to prevent the release from reoccurring.  Investigation reports will be retained for five years.\n\n8) Process Safety Information:  The process equipment was designed and constructed in accordance with applicable Federal and State regulations.  All plans and procedures for operating the process equipment are periodically reviewed by management for safety updates and changes.  Material Safety Data Sheets, equipment specifications and the codes and standards used to buil"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50216,
      "SummaryText": "d and operate the process equipment are maintained and updated. \n\n9) Process Hazard Analysis:  Management conducts reviews of the hazards associated with the process.  The process hazard analysis reviews identify the opportunity for equipment malfunctions or human errors that could cause an accidental release, the safeguards used to control hazards and prevent releases, and the steps used to detect or monitor releases.  The results of the process hazard analysis reviews are documented and problems identified are addressed in a timely manner.  \n\n10) Operating Procedures:  Written operating procedures for the process are readily accessible to workers who operate and maintain the process equipment.  The operating procedures are periodically reviewed and revised as necessary so that they reflect current practices and changes to the process or equipment. \n\n11) Training:  All operators of the process equipment participate in a training program.  Initial training consists of classroom type instruction that covers health and safety hazards, emergency operations and safe work practices.  Refresher training for all employees is conducted at least once every three (3) years.  The training program is reviewed by management on a regular basis and revised as necessary. \n\n12) Mechanical Integrity:  A written mechanical integrity program is used to maintain the ongoing integrity of the process equipment.  Each employee involved in maintaining the ongoing integrity of process equipment is trained in an overview of that process and its hazards and in the procedures applicable to the employee's job tasks so that the employee can perform the tasks in a safe manner.  Inspections and tests are performed on process equipment following recognized and generally accepted good engineering practices.  The frequency of inspections and tests on process equipment is consistent with applicable good engineering practices.  Documentation of each inspection and test on process equipment is maintained"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50216,
      "SummaryText": " in the appropriate format.  Deficiencies in equipment that are outside acceptable limits are corrected before further use or in a safe and timely manner when necessary means are taken for safe operation.  Appropriate checks and inspections are performed so that equipment is installed properly and consistent with design specifications and manufacture's instructions.\n                                                                                     \n13) Management of Change:  Written procedures are used to manage changes to process chemicals, technology, equipment and procedures.  The written procedures address the following:  technical basis of the proposed change; impact of change on safety and health; modifications to operating procedures; necessary time period for change; and, authorization requirements for the proposed change.  Employees involved in operating a process and maintenance and contract employees whose job tasks will be affected by a change in the process are trained and informed of the change prior to start-up of the process or affected part of the process.  Safety information and operating procedures are updated accordingly.\n\n14) Pre-Startup Review:  When modification to a new stationary source or modified stationary source is significant enough to require a change in process safety information, a review of pre-startup safety is performed.  The pre-startup safety review includes a review of the following:  construction and equipment is in accordance with design specifications; safety, operating, maintenance and emergency procedures are in place and are adequate; for a new stationary source, a process hazard analysis has been performed and recommendations have been resolved or implemented before startup; and, training of each employee involved in operating a process has been completed.\n\n15) Compliance Audits:  As required by the RMP rule, compliance audits will be performed at least once every three (3) years.  The audit will be documented and cond"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 50216,
      "SummaryText": "ucted by a person knowledgeable in the process.  Corrective actions required as a result of each compliance audit will be performed promptly and documented.    \n\n16) Incident Investigation:  Management will investigate each incident that results in, or could have reasonably resulted in a catastrophic release of anhydrous ammonia.  The investigation will be performed to identify the situation leading to the incident as well as corrective actions to prevent the release from reoccurring.  Investigation reports will be retained for five years.\n\n17) Employee Participation: A written plan of action regarding employee participation is readily accessible to workers who operate and maintain the process equipment.  Employees participate in training programs and have access to information developed under the risk management program rule. \n\n18) Hot Work Permits:  Hot work permits are issued on an as-needed basis. Hot work permits may be issued for general welding/fabrication purposes and electrical work. Welding/fabrication and electrical work is completed by experienced personnel.   \n\n19) Contractors:  If a contractor is needed to perform work on process equipment, information regarding the safety performance of the contractor is obtained and evaluated.  Before access to process equipment is given to a contractor, the protocol is to inform the contractor about potential hazards associated with the process, entrance and exit control  and emergency response activities.  Additionally, the contractor must act responsibly.\n\nFive-Year Accident History:  There have been no accidental releases of anhydrous ammonia in the past five (5) years that caused deaths, injuries, or significant property damage at the facility; nor, to our knowledge, resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nEmergency Response Program:  In the event of an emergency, it is facility protocol to notify the local fire department and other emerge"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 50216,
      "SummaryText": "ncy responders and request that they respond to the emergency.  Facility employees will not respond to accidental releases of anhydrous ammonia except for those that are small or incidental, can be controlled at the time of the release by employees in the immediate release area (e.g., shutting a valve) and do not appear to pose an immediate safety or health hazard.  This protocol has been discussed with the local fire department and the other emergency responders and the facility has appropriate mechanisms in place to notify the emergency responders when there is a need for a response.  The facility is also included in the written community emergency response plan developed under the Emergency Planning and Community Right-to-Know Act (EPCRA).\n \nPlanned Changes to Improve Safety:  There are no specific anhydrous ammonia safety changes planned at this time.  However, safety improvement is an on-going process at this facility.  Periodic evaluations are performed to assess the safety of equipment and procedures.\n\nCES"
    }
  ]
}