{
  "FacilityID": 50278,
  "FacilityName": "Golden Oval Eggs - Abbeville",
  "FacilityStr1": "496 Industrial Park Road",
  "FacilityStr2": null,
  "FacilityCity": "Abbeville",
  "FacilityState": "AL",
  "FacilityZipCode": "36310",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01067",
  "LEPC": "Henry County LEPC",
  "FacilityLatDecDegs": "31.555725",
  "FacilityLongDecDegs": "-085.287302",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I6",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "dwinnett@geggs.net",
  "FacilityDUNS": 57212854,
  "ParentCompanyName": "Rembrandt Enterprises Inc.",
  "Company2Name": null,
  "CompanyDUNS": 119893001,
  "Company2DUNS": 868341371,
  "OperatorName": "Golden Oval Eggs, LLC",
  "OperatorStr1": "1419 480th Street",
  "OperatorStr2": null,
  "OperatorCity": "Rembrandt",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50576",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dennis Winnett",
  "RMPTitle": "Plant Manager",
  "FTE": 55,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000071174",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-04-05 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-03-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-12-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2007-11-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-11-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 31.55222,
  "FRS_Long": -85.28833,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "105",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73014,
      "AltID": "Food Processing",
      "FacilityID": 50278,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 74763,
          "ProcessID": 73014,
          "NAICSCode": "311999",
          "_desc": {
            "NAICS_CODE": "311999",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 96814,
          "ProcessID": 73014,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 596814,
          "ProcessID": 73014,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50278,
      "SummaryText": "EXECUTIVE SUMMARY / INTRODUCTIONS;\n\nThe Golden Oval Eggs - Abbeville facility is located at 496 Industrial Park Road in Abbeville, Alabama.  The facility is approximately 34 years old and is located on approximately 5 acres.  \n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY:\n\nGolden Oval Eggs - Abbeville is committed to providing a safe workplace that is operated in an environmentally responsible manner.  Golden Oval Eggs - Abbeville is also committed to comply with all applicable laws and regulations relating to safety in the workplace and the protection of the environment.\n\nAs part of the PSM and Risk Management Program, Golden Oval Eggs - Abbeville has an Emergency Response Plan which provides instructions and responsibilities required of all facility personnel in case of plant emergencies.  The management team is committed to safety and the implementation of safe procedures at the Golden Oval Eggs - Abbeville facility.\n\nGolden Oval Eggs - Abbeville maintains a well trained and equipped staff of 3 refrigeration mechanics.  Each of the refrigeration mechanics has a minimum of 6 years of experience with ammonia refrigeration systems.  The Maintenance Supervisor is trained and designated as the facility Incident Commander.  Appropriate personnel protective equipment including respirators and self-contained breathing apparatus (?SCBAs?) are available on-site for response to ammonia incidents.  \n\nFACILITY OVERVIEW AND REGULATED SUBSTANCES HANDLED:\n\nThe facility is located on approximately 5 acres in Abbeville, Alabama.  The facility consists of several connected buildings with over 90,000 square feed under roof.  Golden Oval Eggs - Abbeville produces and freezes egg products.  Anhydrous ammonia is used as the refrigerant in the facility process.  The operating capacity of the refrigeration system is between 24,000 and 30,000 pounds of ammonia.  No other regulated substances (toxic or flammables) at the facility are stored or used at quantities which woul"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50278,
      "SummaryText": "d require compliance with the Risk Management Program.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM:\n\nGolden Oval Eggs - Abbeville has reviewed, and revised the documents and procedures for compliance with OSHA?s PSM and EPA?s Risk Management Program for ammonia use and storage.  A management system has been established to maintain the elements of the PSM and Risk Management Programs.  Applicable written elements of the PSM and the Risk Management Program are readily accessible by employees.  An automatic ammonia detection system (?ADS?) provides reliable notification of ammonia releases.\n\nFIVE YEAR ACCIDENT HISTORY:\n\nGolden Oval Eggs - Abbeville has not had an accident with the ammonia system.  \n\n\nEMERGENCY RESPONSE PROGRAM:\n\nThe ammonia refrigeration system is covered by the Emergency Response Plan.  If a release of ammonia is detected by the ADS or by employees, the procedures within this manual will be followed including notification of hazardous materials responders (refrigeration mechanics) and, as required, the involvement of the incident commander.  The manual describes the level personnel protective equipment to be used to respond to ammonia incidents.  Facility-wide training regarding emergency procedures and evacuation routes occurs on an annual basis.\n\nGolden Oval Eggs - Abbeville has conducted pre-emergency planning with the local fire department and the county LEPC.  Golden Oval Eggs - Abbeville will work with these agencies as necessary to notify the public about an ammonia release.  The manual also contains procedures for emergency alerting and response procedures for on-site personnel and off-site emergency contacts.  Media relations will be handled by senior management.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\nGolden Oval Eggs - Abbeville is committed to continuous improvement and safe operation of its ammonia refrigeration system and is in the process of addressing corrective actions deemed necessary and as identified in the PHA.  The facility Mech"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50278,
      "SummaryText": "anical Integrity preventative maintenance procedures have recently been reviewed/revised and a new tracking system implemented."
    }
  ]
}