{
  "FacilityID": 50453,
  "FacilityName": "Mirant Potrero, LLC",
  "FacilityStr1": "1201-A Illinois St.",
  "FacilityStr2": null,
  "FacilityCity": "San Francisco",
  "FacilityState": "CA",
  "FacilityZipCode": "94107",
  "Facility4DigitZipExt": "3106",
  "FacilityCountyFIPS": "06075",
  "LEPC": null,
  "FacilityLatDecDegs": "37.756778",
  "FacilityLongDecDegs": "-122.382583",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 126099436,
  "ParentCompanyName": "Mirant Corporation",
  "Company2Name": null,
  "CompanyDUNS": 152912291,
  "Company2DUNS": null,
  "OperatorName": "Mirant Potrero, LLC",
  "OperatorStr1": "1201-A Illinois St.",
  "OperatorStr2": null,
  "OperatorCity": "San Francisco",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94107",
  "OperatorZipCodeExt": "3106",
  "FTE": 33,
  "OtherEPAFacilityID": "94107MRNTP1201A",
  "EPAFacilityID": "100000200873",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "A0026",
  "SafetyInspectionDate": "2005-01-04 00:00:00",
  "SafetyInspectionBy": "California Public Utilities Commission",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2007-12-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-12-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-12-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-06-30 00:00:00",
  "DeRegistrationEffectiveDate": "2011-03-08 00:00:00",
  "AnniversaryDate": "2012-12-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 37.7566,
  "FRS_Long": -122.3834,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73224,
      "AltID": "Ammonia Storage Facility",
      "FacilityID": 50453,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 97131,
          "ProcessID": 73224,
          "ChemicalID": 57,
          "Quantity": 44000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 74989,
          "ProcessID": 73224,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 42943,
              "Process_NAICS_ID": 74989,
              "SafetyReviewDate": "2005-05-31 00:00:00",
              "PHA_Date": "2004-02-02 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-05-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Update procedures and signage and add locks.",
              "OpProceduresReviewDate": "2007-04-10 00:00:00",
              "TrainingReviewDate": "2007-10-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-05-31 00:00:00",
              "EquipmentInspectionDate": "2007-04-04 00:00:00",
              "EquipmentTested": "Storage Tank",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2005-05-31 00:00:00",
              "PreStartupReviewDate": "2005-05-23 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2005-05-31 00:00:00",
              "HotWorkPermitReviewDate": "2005-01-31 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2005-05-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 62600,
                  "PreventionProgram3ID": 42943,
                  "ProcessChemicalID": 97131
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50453,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-06-05 00:00:00",
    "ERTrainingDate": "2007-06-30 00:00:00",
    "CoordinatingAgencyName": "San Francisco Fire Departement",
    "CoordinatingAgencyPhone": "4155583342",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50453,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\nBACKGROUND\r\nMirant Potrero, LLC (Mirant) owns and operates the Potrero Power Plant, an electric power generating facility located in San Francisco, California.  The power plant has been in operation since 1965 and currently consists of four generating units (Units 3 through 6).  Unit 3 is a steam turbine unit with a design capacity of 206 megawatts (MW).   This unit is operated to serve intermediate loads.  Units 4 through 6 are combustion turbine units with a design capacity of 52 MW each and are used primarily for peaking loads.  \r\n\r\nMirant retrofitted the existing Unit 3 with a Selective Catalytic Reduction (SCR) system to reduce emissions of nitrogen oxides (NOX), as required to comply with Bay Area Air Quality Manage¬ment District (BAAQMD) Regulation 9, Rule 11, ¿Nitrogen Oxides and Carbon Monoxide from Electric Power Generating Steam Boilers.¿  Mirant planned an outage of Unit 3 to complete the SCR system retrofit from January 2005 to May 2005, followed by a period of about one month to test and tune the system before resuming normal operations in June 2005.\r\n\r\nThe SCR system uses aqueous ammonia to reduce NOX emissions from the generating unit.  The concentration of ammonia in the aqueous solution is 29.4 percent by weight.  This substance is listed as a hazardous material under both California and federal regulations.  \r\n\r\nTo prevent accidental releases of hazardous materials and to reduce their potential impact on the public and the environment, a federal program was established in 1990, as described in Section 112(r) of the Clean Air Act.  The California Office of Emergency Services established the California Accidental Release Prevention (CalARP) Program (California Office of Emergency Services, 1998) to prevent accidental releases of regulated substances and to mitigate the severity of releases that do occur.  The CalARP Program specifies the regulated substances, oversees adherence to the federal requirements, and provides instruct"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50453,
      "SummaryText": "ions for the preparation of a Risk Management Plan (RMP) and offsite accidental release consequence analysis.  In San Francisco County, the Administering Agency overseeing the CalARP program is the Hazardous Materials Unified Program Agency (HMUPA) of the San Francisco Department of Public Health.  \r\n\r\nAn RMP is required for a stationary source that has more than a threshold quantity of a regulated substance on site.  The threshold quantities of the federal and state regulated substances are defined in Section 2770.5 of the State of California CalARP Regulations.  The requirements for RMP depend on the complexity, potential impacts, and accident history of the process.  The United States Environmental Protection Agency (EPA) and CalARP Regulations define three levels of requirements:  Program 1, Program 2, and Program 3.  The most stringent program, Program 3, is required for certain types of businesses (e.g., pulp mills, petroleum refineries), if the process is subject to federal or state Occupational Safety and Health Administration (OSHA) process safety management (PSM) standards, or if HMUPA determines the accidental risk potential of the process requires the additional measures of Program 3.  The least stringent Program 1 is required for a process that meets the following three requirements:  (1) if a process has not had an accidental release over the past five years, (2) if the toxic endpoint for a worst-case release scenario is less than the distance to a public receptor, and (3) if emergency response procedures are coordinated with the local emergency planning and response organization.  A process that does not meet Program 1 or 3 eligibility requirements must then satisfy Program 2 requirements.\r\n\r\nAfter the addition of the SCR system, the quantity of aqueous ammonia stored and used at the Potrero Power Plant was greater than the threshold quantities specified in the CalARP Regulations, and therefore an RMP was required.  Although aqueous ammonia is listed"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50453,
      "SummaryText": "as a regulated substance in Section 2770.5 of the CalARP regulations, the power generation industry is not specifically subject to the most rigorous (Program 3) RMP requirements and the process does not fall under OSHA PSM.  However, HMUPA has made the Program 2 and 3 requirements identical.  Accordingly, the aqueous ammonia unloading, storage, and handling equipment and processes are subject to Program 2 and 3 of the RMP.  \r\nTo ensure continued compliance with the EPA and CalARP regulations, Mirant will update this RMP within five years of its initial submission, before any additional regulated substance is brought on site, before additional aqueous ammonia storage capacity is installed, before there is a major change that may alter the offsite consequence analysis, within 6 months of a reportable chemical accident (as defined in 40 CFR 68.42), or within one month of a change to the emergency contact information.\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \r\nMirant is committed to being a responsible member of the community in which it operates by giving top priority to operating in a safe and environmentally sound manner.  It is Mirant¿s policy to conduct business in a manner that protects the environment and the health and safety of the public and its employees by:\r\n- Meeting all environmental laws, regulations, and permit requirements.\r\n- Seeking to ensure that environmental laws, regulations and permit requirements are based on sound science and cost-effective technology.\r\n- Pursuing opportunities to enhance the quality of the environment.\r\n- Promoting public and employee understanding of environmental issues and the company¿s environmental activities.\r\n- Establishing company and organizational environmental goals and implementation plans.\r\n- Ensuring that employees are aware of their individual roles and responsibilities in implementation of this environmental policy.\r\n\r\nTo minimize accidental releases of hazardous materials, numerous envi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50453,
      "SummaryText": "ronmental, health, and safety programs are implemented at the Potrero Power Plant.  The release prevention programs implemented in conjunction with this RMP strengthen the existing safety and environmental programs at the Potrero Power Plant.\r\n \r\nSTORAGE AND HANDLING OF REGULATED SUBSTANCE\r\nThe only federal and CalARP regulated substance to be stored and handled on site is aqueous ammonia, which is used in the SCR system to reduce NOX emissions from the Unit 3 boiler.  In the SCR system, aqueous ammonia is pumped from the storage tank to vaporizers which produce a uniform distribution of gaseous ammonia that is mixed with the combustion exhaust gases from the unit and passed over a reducing catalyst to reduce the NOX emissions from the stack exhaust.  \r\n\r\nThe SCR system uses ammonia, a reducing agent, to reduce only NOX species by oxidation-reduction reactions in the presence of a catalyst.  Typically, the catalyst, which increases the reaction rate and thus improves the NOX removal efficiency, is composed primarily of titanium and vanadium oxides.\r\nThe optimum temperature range for the SCR NOX reduction process is 600 to 700 ?F.  In the presence of the catalyst, the following NOX removal reactions occur at the boiler economizer outlet temperatures:\r\n\r\nReduction of NO\r\n4 NO + 4 NH3 + O2 ---->\t4 N2 + 6 H2O\r\nReduction of NO2\r\nNO + NO2 + 2 NH3 ---->\t2 N2 + 3 H2O\r\n\r\nThese reactions are exothermic, but do not result in a significant temperature rise across the SCR system because of the low NOX levels involved.\r\n\r\nThe systems that handle aqueous ammonia at Potrero Power Plant are the aqueous ammonia unloading and storage facility, the aqueous ammonia vaporization skid, and the ammonia injection grid/SCR reactor.  These systems are discussed below.\r\n\r\nThe aqueous ammonia unloading and storage facility is located near the eastern portion of the developed property of the Potrero Power Plant, to the northwest of Unit 3.  The aqueous ammonia unloading and storage facility cons"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50453,
      "SummaryText": "ists of a truck unloading station and one aqueous ammonia storage tank.  The storage facility is designed and constructed to receive and store aqueous ammonia for the retrofitted Unit 3 SCR.\r\n\r\nThe storage facility includes one 20,000 gallon carbon steel storage tank, approximately 10 feet in diameter by 36.5 feet long.  The tank is constructed in compliance with Uniform Building Code Seismic Zone 4 (ICBO, 1997) and American Society of Mechanical Engineers Boiler and Pressure Vessel Code Section VIII, Division 1, Rules for Construction of Pressure Vessels.  The maximum design pressure and temperature for the tank is about 50 pounds per square inch gauge (psig) and 150°F, respectively.\r\n\r\nThe horizontal aqueous ammonia storage tank is supported on concrete foundations within a walled containment basin approximately 64 feet long by 28 feet wide (inside dimensions).  The height of the tank is minimized to reduce earthquake impacts and visual impacts to the general public.  The basin is sloped to a centrally located drain that leads to a covered sump that runs the width of the containment area beneath the tank.  The overall dimensions of the sump are approximately 26 feet long, 28 feet wide, and 7 feet deep.  The sump has a design capacity of 31,300 gallons to provide a volume more than sufficient to hold 100 percent of the contents of the tank, plus rainfall equivalent to the maximum rainfall recorded in 24 hours in the past 51 years at the San Francisco airport (5.59 inches in 1982, WRCC 1948-1999).  Although the sump has been sized to accommodate rainfall in accordance with the applicable codes, a sump pump is provided to keep it free of rainwater.  The sump pump is interlocked with the ammonia monitoring system so that it will not operate if ammonia vapors are detected.\r\n\r\nTruck delivery is the only mode of aqueous ammonia transport to the Potrero Power Plant and an unloading facility is provided for tanker trucks.  An individual tanker truck can transport approxima"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 50453,
      "SummaryText": "tely 6,600-gallons of aqueous ammonia.  The route taken by the tanker truck to the Potrero Power Plant has been selected to minimize traffic and populated areas.  The Unit 3 aqueous ammonia unloading station itself consists of an ammonia fill line, through which aqueous ammonia is pumped from the delivery truck to the tank, and a vapor return line whereby vapor pressure between the tank and the truck is equalized.  A double basket strainer is used to remove solid impurities from the aqueous ammonia as it is unloaded from the tanker truck.  The concrete slab of the unloading facility is sloped to drain any accidental tanker truck releases through a drain hole and a 16-inch pipe.  The pipe leads to the sump under the ammonia storage tank .  The drainage system is designed so that the drain openings has at least twice the area of the delivery hose, enabling near-immediate drainage to the sump in the event of a spill.\r\n\r\nIn the event of an accidental release that collects in the sump, if the contents meet the discharge regulations for hazardous waste as defined by Title 22 of the California Code of Regulations, sump contents will either be discharged to the plant¿s oily water separator system, neutralized, and then discharged through the plant's existing discharge permit, or emptied by means of a submersible sump pump into a vacuum truck for transport and treatment.\r\n\r\nAdditional safeguards include a dedicated hydrant hose reel with a nozzle that can be set to spray, mist, or stream.  A wind flag is also installed above the tank to determine wind direction in the event of a spill.  In the event of a spill into the sump, the exposure to the atmosphere of the aqueous ammonia will be limited to the grated opening of the sump.  The sump design limits air flow over any aqueous ammonia spill contained in the sump, thereby limiting mass transfer from the ammonia solution to the atmosphere.\r\n\r\nAqueous ammonia is pumped from the storage tanks to spray nozzles in the ammonia vapo"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 50453,
      "SummaryText": "rizer units on the injection skids near the SCR reactor.  The vaporizers produce a uniform distribution of gaseous ammonia in the diluent stream.  The diluent stream is then transported to the injection grid. \r\n\r\nMore specifically, the aqueous ammonia travels through ¾ inch stainless steel piping from the storage tank through the ammonia forwarding pump and to the ammonia vaporization skids.  The ammonia piping from the storage tank containment area to the vaporization skids is located above ground except for where the piping cross the roadway south of the ammonia storage facility.  That portion of the piping crosses the roadway via a covered trench.  Portions not of the ammonia piping that are outside the tank containment area have double walled piping.\r\n\r\nThe ammonia vaporizer uses boiler combustion air to vaporize the aqueous ammonia.  Two 100 percent capacity dilution air fans (1 operating, 1 spare) boost the pressure of the combustion air to overcome the resistance of the system components and provide sufficient flow for full vaporization of the aqueous ammonia.  Local control by temperature set point maintains the vaporizer outlet mixing temperature.  In the vaporizer, aqueous ammonia is sprayed into the hot dilution air stream to vaporize the aqueous ammonia and promote mixing.  This mixture is then transported to the injection grid.\r\n\r\nThe ammonia injection grid mixes the diluent stream with boiler flue gas prior to the mixture entering the SCR reactor.  The SCR reactor converts most of the oxides of nitrogen from the flue gas into nitrogen gas and water, which is released from the stack.\r\nThe injection grid is located upstream of the SCR reactor.  This allows thorough mixing of the ammonia diluent stream with the turbulent flue gas from the Unit 3 boiler.  Although the oxidation-reduction reaction is initiated by the injection of ammonia at the injection grid, all of the reaction is completed in the SCR reactor by passing the mixture over a catalyst compose"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 50453,
      "SummaryText": "d primarily of titanium and vanadium oxides.  To maximize the reduction of NOx to nitrogen gas and water vapor, a small amount of excess ammonia (ammonia slip) must be added to the flue gas.  The treated flue gas, containing small amounts of residual NOX and excess ammonia, is discharged out the stack, as allowed under the plant's air permit.  \r\n\r\nThe excess ammonia or ammonia slip complies with BAAQMD Regulation 9, Rule 11, which restricts ammonia concentrations out of the stack to 10 parts per million (ppm) dry (volume basis) at 3 percent oxygen (based on a 1-hour average).  Based on detailed dispersion modeling conducted as part of the BAAQMD air permit application for the SCR system (Mirant, 2003), maximum ground level ammonia concentration is expected to be approximately 0.02 ppm.  This concentration is well below the ERPG-1 (Emergency Response Planning Guidelines) value for ammonia of 25 ppm.  The ERPG¿1 is defined as the maximum airborne concentration below which it is believed most individuals could be exposed for up to one hour without perceiving a clearly defined objectionable odor.  In addition, as part of the permit application submitted to BAAQMD, a health risk assessment was conducted to ensure that the ammonia slip would not result in significant adverse health effects.  Ammonia is not a known carcinogen but is known as an acute and chronic non-carcinogenic health hazard.  Emissions of ammonia that result in an acute or chronic index of less than 1.0 are not considered significant.  The health risk assessment predicted that the excess emissions of ammonia out of the Unit 3 stack results in acute and chronic indices of 0.0046 and 0.0007 respectively, which are much less than the 1.0 threshold.  Thus, ammonia slip is not predicted to have significant adverse health effects.\r\nThe SCR process is controlled with feed-forward and feedback control loops.  Upstream NOX analyzers measure the NOX concentration at the SCR reactor inlet.  This signal is combined"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 50453,
      "SummaryText": "with a boiler flue gas flow signal to generate an inlet NOX loading signal.  The feed-forward NOX loading signal is converted to a theoretical ammonia demand signal, based on the stoichiometry of the NOX oxidation-reduction reactions.  The ammonia demand signal regulates the rate at which aqueous ammonia will be pumped to the vaporizers.  The outlet NOX is then measured and a trim signal is generated and sent to the ammonia flow control valves for finer tuning.\r\n\r\nThe aqueous ammonia solution for the SCR system at Potrero Power Plant is 29.4 percent ammonia by weight, with the balance of the weight being water.  Aqueous ammonia is a corrosive material although the degree of danger associated with the substance is considered to be minor.  As identified previously, ammonia is not a known carcinogen, but it poses acute and chronic non-carcinogenic health hazards to the respiratory system and chronic non-carcinogenic health hazards, such as skin irritations or other effects.  Acute health hazards are those that occur from short exposures to airborne ammonia vapor, whereas chronic health effects are those that occur as a result of long-term exposures.\r\n\r\nThough some insoluble ammonia is present in the ammonia solution, the solution has a very low vapor pressure compared to anhydrous ammonia, a more concentrated form of ammonia that is used for other SCR systems.  The ammonia present does not readily vaporize if the solution is released to the atmosphere.  If the ammonia evaporates from the solution, the ammonia vapor is irritating at levels above a few parts per million by volume (ppmv) and is acutely toxic in high concentrations.  A one-hour average ammonia vapor concentration above 200 ppmv could cause respiratory irritation to exposed individuals.  Other exposure levels have also been defined for ammonia.  For example, the National Institute for Occupational Safety and Health (NIOSH) lists ammonia as having an Immediately Dangerous to Life or Health (IDLH) of 300 ppm."
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 50453,
      "SummaryText": "In addition, the American Conference of Governmental industrial Hygienists, Inc (ACGIH) recommends a Threshold Limit Value (TLV) of 25 ppm (8-hour Time Weighted Averages) and a Short Term Exposure Limit (STEL) of 35 ppm (15 minute average) for ammonia.  The TLV is defined as level of exposure that the typical worker can experience without an unreasonable risk of disease or injury.  STEL is defined as the concentration to which workers can be exposed continuously for a short period of time without suffering from irritation, tissue damage, or unconsciousness.\r\n\r\nAmmonia vapor is flammable in dry air at concentrations of 16 percent to 25 percent, but requires a very high temperature source for ignition.  Ammonia concentrations directly above an aqueous ammonia spill is not expected to approach these concentrations; therefore aqueous ammonia is not anticipated to have an explosive flammability potential.\r\n \r\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\nSafety was the foremost consideration in the design of the aqueous ammonia unloading and storage facility.  The aqueous ammonia storage tank is enclosed within a walled containment basin that slopes and drains to a centrally located covered sump beneath the tank that runs the length of the containment area.  There is also a walled containment pad under the tanker truck unloading facility that drains rapidly into the covered sump under the tank.\r\n\r\nMany accident prevention safeguards are implemented in the aqueous ammonia storage area.  For example, in the event of a power outage, standby backup power needed for all required electrical systems, such as monitors and alarms, will be provided by an Uninterruptible Power Supply.  Also, hot work permits are required for specific activities that present the potential for fire, and personnel involved in such operations will receive appropriate training.\r\n\r\nTo minimize impacts from accidental releases, workers are trained in the safe handli"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 50453,
      "SummaryText": "ng of hazardous materials, use of response equipment, procedures for mitigation of a release, and coordination with local emergency response organizations.  To avoid or minimize impacts from an accidental release of hazardous materials, non-hazardous or less hazardous materials are used, where possible, and engineering controls are implemented.  For example, aqueous ammonia was selected for the SCR system over anhydrous ammonia because it is less hazardous.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\nLarge quantities of aqueous ammonia have not been present at Potrero Power Plant prior to the construction of the 20,000-gallon ammonia storage tank.  During the past five years at the facility, no accidents involving regulated substances or other extremely hazardous substances have resulted in deaths, injuries or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  In fact, Mirant¿s Contra Costa Power Plant and Pittsburg Power Plant, which have working SCR systems, have not had any such accidents over the past five years.\r\n \r\nEMERGENCY RESPONSE PROGRAM\r\nPotrero Power Plant has coordinate emergency response programs with the San Francisco Fire Department (SFFD) and the San Francisco Department of Public Health- Health-Hazardous Materials Unified Program Agency (HMUPA).  Periodically, the SFFD inspects the facilities that store and handle flammable hazardous materials at Potrero Power Plant to ensure that the applicable Uniform Fire Code requirements are being met.  The SFFD visits at least once per year to in order to ensure timely, effective, safe response plans.\r\n\r\nIn the unlikely event of an accidental release of a hazardous substance, any employee who identifies a spill will notify the Control Operator of the location and condition of the spill.  The Control Operator will activate the site paging network and inform personnel of the details of the spill.  Only incidental accidental spi"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 50453,
      "SummaryText": "lls will be handled by Potrero Power Plant employees.  However, if the size of the spill is not incidental, the SFFD will be asked to assist with spill response.  Any release or threatened release of aqueous ammonia that could significantly impact human health, safety, or the environment, must also be reported immediately upon discovery to City and County of San Francisco Department of Public Health HMUPA and California Office of Emergency Services (State Warning Control Center) in addition to the San Francisco Fire Department.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nTo continue operating a safe, accident-free facility, the safety features described in previous sections of this Executive Summary were implemented during the construction of the aqueous ammonia storage and handling facilities.  Regular equipment inspections, maintenance, and safety reviews will ensure continued safe operations at Potrero Power Plant.  Mirant's Safety Committee meets at least four times a year to review and develop the safety and health programs for the Potrero Power Plant. \r\n\r\nAlso, to improve the safety of the aqueous ammonia storage and handling systems at Potrero Power Plant, a Hazard Review was conducted as part of this RMP, which resulted in several recommendations to improve the system's safety. \r\n\r\nREFERENCES\r\nICBO (International Conference of Building Officials), 1997.  Uniform Building Code, 1997.\r\n\r\nMirant California, LLC, 2003.  Bay Area Air Quality Management District Application for Authority to Construct/Permit to Operate, October 2003.\r\n\r\nWRCC (Western Regional Climate Center) 1948-1999.  WRCC website, www.wrcc.dri.edu, accessed on January 23, 2004."
    }
  ]
}