{
  "FacilityID": 50471,
  "FacilityName": "Dreyer's Grand Ice Cream Distribution Center",
  "FacilityStr1": "1351 DuPont Court",
  "FacilityStr2": null,
  "FacilityCity": "Manteca",
  "FacilityState": "CA",
  "FacilityZipCode": "95336",
  "Facility4DigitZipExt": "6004",
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.786944",
  "FacilityLongDecDegs": "-121.195556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.dreyers.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 66563859,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Dreyer's Grand Ice Cream",
  "OperatorStr1": "1351 DuPont Court",
  "OperatorStr2": null,
  "OperatorCity": "Manteca",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95336",
  "OperatorZipCodeExt": "6004",
  "FTE": 65,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192828",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-02-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-03-11 13:10:08",
  "ErrorReportDate": null,
  "ReceiptDate": "2007-12-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2007-12-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-12-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 37.786944,
  "FRS_Long": -121.195556,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73280,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 50471,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 97193,
          "ProcessID": 73280,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 75045,
          "ProcessID": 73280,
          "NAICSCode": "42443",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 42970,
              "Process_NAICS_ID": 75045,
              "SafetyReviewDate": "2007-10-01 00:00:00",
              "PHA_Date": "2005-06-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-08-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Diffusion tank; ventilation system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Training and mechanical integrity program modifications; valve tagging; pipe labeling; signage; restricted access measures",
              "OpProceduresReviewDate": "2007-10-11 00:00:00",
              "TrainingReviewDate": "2006-05-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-12-07 00:00:00",
              "EquipmentInspectionDate": "2007-12-04 00:00:00",
              "EquipmentTested": "Electrical equipment",
              "ChangeMgmtDate": "2006-02-15 00:00:00",
              "ChangeMgmtReviewDate": "2007-11-20 00:00:00",
              "PreStartupReviewDate": "2005-08-12 00:00:00",
              "ComplianceAuditDate": "2007-11-26 00:00:00",
              "AuditCompletionDate": "2008-03-01 00:00:00",
              "IncidentInvestigationDate": "2005-10-22 00:00:00",
              "InvestigationChangeDate": "2005-10-26 00:00:00",
              "ParticipationPlansReviewDate": "2007-11-20 00:00:00",
              "HotWorkPermitReviewDate": "2007-11-20 00:00:00",
              "ContractorSafetyReviewDate": "2007-11-16 00:00:00",
              "ContractorSafetyEvalDate": "2007-08-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 62632,
                  "PreventionProgram3ID": 42970,
                  "ProcessChemicalID": 97193
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50471,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "San Joaquin County OES",
    "CoordinatingAgencyPhone": "2094683969",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 50471,
      "SummaryText": "d extends to select markets in the Far East and the Edy¿s brand extends to the Caribbean and South America. For more information on the company, please visit www.dreyersinc.com.\n\nThe Starbucks trademark is owned by Starbucks U.S. Brands, LLC and is licensed to the Starbucks Ice Cream Partnership, a joint venture partnership between Dreyer¿s and Starbucks Holding Company.  In the U.S. the Häagen-Dazs trademark is sub-licensed to Dreyer¿s by Nestlé.  All other trademarks are owned by Société des Produits Nestlé S.A., Vevey, Switzerland.\n\nRegulated Substance Handled\n\nThis facility utilizes anhydrous ammonia as a heat transfer fluid in the plant refrigeration system.  The system is a single-stage, multi-suction, economized mechanical refrigeration system that utilizes recirculated liquid feed to the evaporator coils.  Cooling is provided to the 10°F Shipping Dock and to the -20°F freezer.  The system charge is 13,000 lbs.\n\nOne high-temperature screw compressor provides suction and compression for the high temperature cooling, while two low-temperature screw compressors serve the low-temperature cooling requirements.  A swing screw compressor can back-up either the high-temperature or low-temperature requirements as needed.\n\nThe heat of compression in the high-pressure compressor discharge is removed in the evaporative condenser.  The condenser drains high-pressure liquid to the thermosiphon / high-pressure receiver for screw compressor cooling and recirculator package liquid ammonia as required.  Liquid from the high-temperature recirculator (HTR) and the low-temperature recirculator (LTR) is pumped to the evaporators as needed for cooling at the dock and in the freezer.\n\nEvaporator piping and valve trains are located on the roof, while the freezer evaporators are located in rooftop penthouse units above the freezer and the dock evaporators are suspended from bar joists inside the dock area.  The evaporator coils are defrosted with hot gas from the high stage discharge"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 50471,
      "SummaryText": "EXECUTIVE SUMMARY\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nDreyer¿s Grand Ice Cream uses anhydrous ammonia for refrigeration of retail quantities of ice cream products for wholesale distribution.  Ammonia is the only hazardous chemical used at this facility that is subject to the CalARP program or federal RMP requirements.\n\nThis facility recognizes the hazards associated with the use of highly hazardous chemicals.  As a reflection of our policy to adhere to all applicable federal, state, and local laws and regulations, we submit this plan to address the hazards inherent with the use of ammonia.  Our program addresses safety precautions regarding the handling and operation of this covered system as well as proper training for those who operate and maintain the system.  The company training policy requires that all employees will be properly trained for a job position before assignment to that job.\n\nOur accidental release prevention program is clearly defined by the OSHA Process Safety Management (PSM) Program for this facility.  This prevention program follows industry-recommended standards for preventing unnecessary human exposures and reducing the threat to the health of our employees as well as to members of the community and the surrounding area.  Safety depends upon the manner in which we handle these chemicals, the safety devices inherent in the design of this facility and its processes, and the training that we provide our personnel.  This Plan is updated as required by law.\n\nOur Emergency Action Plan (EAP) details the response this facility will take as a result of an uncontrolled release of ammonia.  The Plan includes procedures for notification of the local emergency responders.  This EAP also includes a specific protocol for responding to an ammonia release and assigns an Emergency Coordinator to implement the response.  This Plan is current and updated as required by law and conforms to the requirements for an Emergency Action Plan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50471,
      "SummaryText": "as per 29 CFR ? 1910.38.\n\nThis facility has also coordinated with the local emergency responders and will maintain close contact to ensure that the responders are familiar with the system and with the general safety and accidental release program at our plant.\n\nIt is the policy of this facility to devote the time, energy, and capital toward maintaining prevention and response programs appropriate to the inherent dangers with the use of hazardous chemicals.\n\n \nTHE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe Stationary Source\n\n The Dreyer¿s Grand Ice Cream Distribution Center is located at 1351 DuPont Court in Manteca, California at the end of DuPont Court.  The facility lies approximately 500 yards west of State Highway 99 and 500 yards north of State Highway 120 near the intersection of the two highways.  The facility is situated in an area comprised primarily of light industrial facilities, commercial and office areas, some agricultural lands, and residential areas.\n\nThis facility stores ice cream products for distribution under approximately 98,000 square feet of total warehouse space, with approximately 70,000 square feet of refrigerated space.  The remaining areas include office areas, the control room, and the engine room.  There is no manufacturing at this facility.\n\nThe distribution center employs approximately 65 people and operates six days per week.  The hours of operation vary from a two-shift schedule 17 hours per day to a full 24-hour operation, depending on the season.\n\nThe following history was extracted from the Dreyer¿s Inc. website (www.dreyers.com):\n\nDREYER¿S HISTORY\n\nDreyer¿s American Dream\n\nWilliam Dreyer began his love affair with ice cream in 1906 when, as a galley boy, he earned the prestigious job of making a frozen dessert to celebrate his German ship¿s arrival in America.  After a brief career making ice cream in New York, he settled in northern California and began a 20-year apprenticeship with ice cream makers such as Nationa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50471,
      "SummaryText": "l Ice Cream Company and Peerless Ice Cream.\n\nDreyer opened his own ice creamery in Visalia, California, and won First Prize at the 1921 Pacific Slope Dairy Show.  Over the next two decades, he taught ice cream courses at the University of California and served as an officer in the California Dairy Industries Association. \n\nGrand Beginnings\n\nDreyer found a business partner and kindred spirit in renowned candy-maker Joseph Edy after moving to Oakland, California.  Dreyer¿s ice cream expertise and Edy¿s candy-making acumen created a winning combination. Their small ice cream factory on Grand Avenue quickly became a gathering place.  ¿Grand¿ has been part of the company name ever since ¿ both as a reminder of the company¿s birthplace on Grand Avenue and a declaration of the outstanding quality of their ice cream.\n\nThe Birth of Rocky Road\n\nAt the time of Rocky Road¿s birth in 1929, almost all ice cream was made in three flavors ¿ vanilla, chocolate, and strawberry ¿ and was always served as sundaes.  Dreyer added walnuts (later replaced with almonds) to his chocolate ice cream and, using his wife¿s sewing shears, cut marshmallows into bite-sized pieces to make the first batch of Rocky Road. Dreyer and Edy picked a flavor name to give folks something to smile about in the face of the Great Depression.  Rocky Road became America¿s first blockbuster flavor and remains one of the best-selling flavors of all time.  Dreyer invented a number of other flavors that are still made today, including Toasted Almond and Peppermint Stick.\n\nChange & Growth\n\nIn 1946, William Dreyer¿s only son joined the ice cream business and Joe Edy focused on his candy business.  In July 1947, Edy and Dreyer officially dissolved their partnership.  The Dreyers opened a state-of-the-art ice cream plant in 1948.  In 1963, Dreyer¿s son sold the company to his key officers ¿ Al Wolff, Bob Boone and Ken Cook.  Dreyer remained active in the company until his death in 1975. \n\nThe company was purchased in 1977"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50471,
      "SummaryText": "by T. Gary Rogers and W. F. (Rick) Cronk.  Under Rogers¿ and Cronk¿s direction, Dreyer¿s Grand Ice Cream expanded its distribution to become the leading manufacturer, marketer and distributor of packaged ice cream in the United States.\n\nIn 2003, the Company merged with Nestlé Ice Cream Company, LLC (NICC) to form Dreyer¿s Grand Ice Cream Holdings, Inc.  After 26 years in the ice cream business, Dreyer¿s President W.F. (Rick) Cronk retired in 2003 from the business he did so much to build.\n\nA year later, Dreyer¿s introduced its resoundingly successful Slow Churned¿ Grand Light® Ice Cream with half the fat, one-third fewer calories and all the flavor found in full-fat premium ice cream.  A few months later, Dreyer¿s acquired Silhouette Brands, producers of outstanding low-fat and low carb snacks marketed under the Skinny Cow® and Skinny Carb® brands.\n\nIn 2005, Dreyer¿s launched Häagen-Dazs® Extra Rich Light with 1/2 the fat and same great taste as the original and Dibs® bite-sized ice cream snacks, recognized as Best New Product of the year by four industry publications.\n\nIn 2006, Dreyer¿s became a wholly-owned subsidiary of the Nestlé® family, and is no longer a publicly-traded company.\n\nToday, Dreyer¿s Grand Ice Cream is a $2 billion company.  Dreyer¿s Grand Ice Cream Holdings, Inc., and its subsidiaries manufacture and distribute a full spectrum of ice cream and frozen dessert products.  Brands of frozen dessert products currently manufactured or distributed by Dreyer¿s in the United States include Grand, Slow Churned®, Dibs®, Häagen-Dazs®, Nestlé® Drumstick®, Nestlé Crunch®, Nestlé® Butterfinger®, Nestlé® Toll House®, Nestlé® Carnation®, Nestlé® Push-Up®, Frosty Paws®, Eskimo Pie®, Chipwich®, Fruit Bars, Starbucks® and The Skinny Cow®. \n\nThe company¿s premium products are marketed under the Dreyer¿s brand name throughout the Western states and Texas, and under the Edy¿s® brand name throughout the remainder of the United States.  Internationally, the Dreyer¿s bran"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 50471,
      "SummaryText": "line.\n\n\n\n\n\n\n\nPRIMARY SYSTEM COMPONENTS\n\n\n4   Screw Compressor Packages\n1   Evaporative Condenser\n1   High-Pressure / Thermosiphon Receiver\n1   High Temperature Recirculator with two ammonia pumps\n1   Low Temperature Recirculator with two ammonia pumps\n2   Oil Pots (one at each recirculator)\n5   Evaporator Coil Units (10°F Shipping Dock)\n4   Evaporator Coil Units (-20°F Freezer)\n1   Auto Purger\n1   Ammonia Diffusion Tank (18,000 gal. capacity)\n\nAdditional system components include:\n\n?   Interconnecting piping; and\n?   Control valves\n\nSafety systems include:\n\n?   Pressure relief valves on all pressure vessels;\n?   Compressor safety cutouts and control panels to shut down the compressor operation if safe operating conditions are exceeded;\n?   Liquid level float switches;\n?   High level vessel alarms;\n?   Ventilation system for continuous and emergency ventilation;\n?   Emergency Control Station with emergency ventilation fan switch and emergency shutdown switch;\n?   Ammonia vapor detection and alarm system for response to elevated levels of ammonia vapor.  Detection will trigger the emergency ventilation system, emergency shutdown, and audible/visual alarms at preset levels;\n?   Spring-loaded, self-closing oil drain valves;\n?   Manual stop valves;\n?   Manual and solenoid-controlled ¿King Valve¿ to stop liquid refrigerant flow from the high-pressure receiver to other components in the system;\n?   Physical barriers to protect equipment/piping from collisions (e.g. bollards);\n?   Fire extinguishers; and\n?   Emergency showers and eyewash stations\nThere is an oil pot at each recirculator and each oil pot vessel is equipped with a self-closing spring-loaded drain valve for safety.  All pressure vessels in the system have dual safety relief valves (SRV's) to protect the respective vessel against overpressure conditions.  All SRV's relieve to an ammonia diffusion tank via a common discharge piping system.  An auto purger removes non-condensibles and air as required to maintain"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 50471,
      "SummaryText": "an efficient refrigeration process.\n\nA qualified refrigeration contractor monitors system conditions on a regular basis.  Maintenance activities are also contracted to the contractor (see Mechanical Integrity program for more information).  The ammonia refrigeration system is continually monitored and controlled by the system PLC, safety switches, level switches, alarms, and compressor microprocessors.  An autodialer alerts the refrigeration contractor and facility management in the event of system deviations.  All personnel have been trained in the proper emergency response procedures.  The facility maintains an Emergency Action Plan for response to ammonia releases, which includes notification and evacuation protocols.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL SPECIFIC PREVENTION STEPS\n\nThis facility complies with the California Accidental Release Prevention (CalARP) Program, the federal EPA Accidental Release Prevention Program, and the California and federal OSHA Process Safety Management (PSM) Programs.  Chemical specific prevention steps taken by this facility to maintain safety in the ammonia refrigeration process are outlined in the PSM Program elements.  The PSM Program elements include process safety information, process hazard analysis, operator training, contractor qualification, operating procedures, pre-startup safety review, hot work permitting, management of change, mechanical integrity, incident investigation, compliance audits, and emergency response elements to prevent accidental releases.\n\nThis facility maintains a program for qualifying contractors who work on, or around, the ammonia refrigeration system.  The Contractor Qualification Program includes procedures for reviewing contractor safety records and includes provisions for periodic safety performance evaluations.  Dreyer¿s strives to ensure that those contractors who operate, maintain, or monitor the system have received the required training to perform their work"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 50471,
      "SummaryText": "safely.  In addition to the requisite understanding of the process equipment and proper operating and maintenance procedures, the contractor must be able to recognize abnormal conditions and the steps to correct deviations, along with emergency shutdown procedures.\n\nThe general safety program includes hazardous communication, forklift operation, first aid, emergency response, and additional programs as necessary to maintain a safe operation as outlined in the Dreyer¿s Risk and Safety Systems Manual.\n\nTHE FIVE-YEAR ACCIDENT HISTORY\n\nThis facility has had no reportable releases from the ammonia refrigeration system process since it began operation in August 2005.\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nAll employees are trained to understand the requirements of the Emergency Action Plan.  The Emergency Action Plan includes release notification for emergency responders and the procedures for evacuation.  The Emergency Coordinator implements the response in coordination with the local emergency responders (i.e. the fire department).  It is the policy and practice to conduct evacuation drills four times per year and to evaluate the performance of the evacuations.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nA Process Hazard Analysis (PHA) was performed as required prior to initial startup of the system in 2005.  The PHA Team developed a list of recommendations to improve safety and all recommendations were implemented as scheduled and assigned.\n\nCurrently, the facility is working to improve minor discrepancies with the mechanical integrity program documentation and the procedures for qualifying contractors.  Some supporting procedures will also be modified to enhance safety and improve documentation.  A Follow-Up Log has been created to address program deficiencies with assigned responsibilities and completion dates.  Those changes are expected to be completed by March 1, 2008."
    }
  ]
}