{
  "FacilityID": 50553,
  "FacilityName": "CWLP's Dallman Power Station",
  "FacilityStr1": "3100 Stevenson Drive",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "IL",
  "FacilityZipCode": "62707",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17167",
  "LEPC": "Sangamon County LEPC",
  "FacilityLatDecDegs": "39.754444",
  "FacilityLongDecDegs": "-089.602778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.cwlp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 781719075,
  "ParentCompanyName": "City of Springfield",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Springfield",
  "OperatorStr1": "Municipal Center East",
  "OperatorStr2": "800 East Monroe",
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62757",
  "OperatorZipCodeExt": null,
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000181509",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "167120AA0",
  "SafetyInspectionDate": "2007-06-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-01-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-01-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-01-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-01-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 39.758237,
  "FRS_Long": -89.607638,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "1",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73378,
      "AltID": "SCR air pollution control",
      "FacilityID": 50553,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 97304,
          "ProcessID": 73378,
          "ChemicalID": 56,
          "Quantity": 467040.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 75145,
          "ProcessID": 73378,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 43036,
              "Process_NAICS_ID": 75145,
              "SafetyReviewDate": "2007-03-01 00:00:00",
              "PHA_Date": "2006-03-17 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-03-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-04-01 00:00:00",
              "TrainingReviewDate": "2007-04-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-03-01 00:00:00",
              "EquipmentInspectionDate": "2007-12-01 00:00:00",
              "EquipmentTested": "Tanks, piping, pressure relief system, vaporizer",
              "ChangeMgmtDate": "2006-04-26 00:00:00",
              "ChangeMgmtReviewDate": "2007-02-07 00:00:00",
              "PreStartupReviewDate": "2003-02-15 00:00:00",
              "ComplianceAuditDate": "2005-09-08 00:00:00",
              "AuditCompletionDate": "2006-03-17 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-03-01 00:00:00",
              "HotWorkPermitReviewDate": "2007-03-08 00:00:00",
              "ContractorSafetyReviewDate": "2007-02-20 00:00:00",
              "ContractorSafetyEvalDate": "2007-02-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 62709,
                  "PreventionProgram3ID": 43036,
                  "ProcessChemicalID": 97304
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50553,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Springfield Fire Department",
    "CoordinatingAgencyPhone": "2177888450",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 50553,
      "SummaryText": "ion facilities include the Dallman and Lakeside coal-fired power plants, the Dallman 31/32 and 33 sulfur dioxide scrubbers, a maintenance facility and a wastewater treatment plant, all located within the CWL&P plant complex on the shore of Lake Springfield.  The Division maintains an operations dispatch center and transmission and distribution (T&D) engineering office; electric overhead, underground, substation and service offices; and approximately 30 substations around the city. \n\nDallman Power Station was built in 1968 to answer the increasing electric demand of a growing city.  The first Dallman generator placed on line was Dallman 1, with a maximum capacity of 86 MW.  It was followed by a second 87 MW unit in 1972.  In 1978, a third turbine generator, with a maximum capability of 199 MW, more than doubled the power station's total generating capacity.  These three coal-fired units are intended to meet customer base load.  In 2000, Dallman's three generators used 927,535 tons of coal and 123,171 gallons of oil to generate 1,736,707 MWH of electricity. \nAll Dallman units are designed to burn coal.  Particulate emissions from the three units are controlled by electrostatic precipitators. In addition, the three units are equipped with flue gas desulfurization systems (scrubbers) to control sulfur dioxide (SO2) emissions. The scrubber for Dallman 3 was installed in 1980.  A second scrubber, serving the two older units, was put into operation in June 2001 in response to requirements of the 1990 Clean Air Act Amendments.  All three Dallman units are now equipped with SCR units for the reduction of NOx emissions.\n\nThe SCR process requires ammonia and the anhydrous ammonia storage facility includes two 50,000-gallon storage tanks with supporting unloading equipment, vapor compressors, piping to convey the liquid ammonia, vaporizers to convert ammonia from a liquid to a gas, and a gas dilution and injection system to inject ammonia into the SCR emission control system."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50553,
      "SummaryText": "For the purpose of the RMP, anhydrous ammonia is the only one regulated substance at the facility.  With two 50,000-gallon storage tanks, the maximum amount of anhydrous ammonia in the storage facility at any time is 467,040 pounds and the maximum amount contained in the largest single vessel is 233,520 pounds.\n\nIII. Summary of Worst Case and Alternative Release Scenarios\n\nThe worst-case release scenario and an alternative release scenario were identified and analyzed to determine the distance to endpoint for each assumed release.  To perform the required offsite consequence analysis for the facility, EPA¿s RMP*Comp program was used. \n\nThe worst-case release scenario, as mandated by EPA¿s rule on accidental release prevention, involves the rupture of the largest storage tank, in this case one of the 50,000-gallon storage tanks, and the release of all 233,520 pounds of anhydrous ammonia over a 10-minute period.  The maximum amount of ammonia that can be stored in the tank is limited to that quantity by high-liquid-level controls and alarms.  No other mitigative device was considered in the analysis.  Under worst-case meteorological conditions of Class F stability and 1.5 meters per second wind speed, the distance to endpoint for the ammonia is 5.6 miles.  For ammonia, the endpoint concentration is 0.14 milligrams per liter, or 200 parts per million, in air.\n\nThe alternative release scenario involves the release of 5,570 pounds of ammonia over 10 minutes from a failure to close manually the purge vent valve before beginning the ammonia unloading operation.  Although there is a water spray system that would be activated in this event and lessen the impact of the leaking chemical, it was not considered in this analysis.  Using typical meteorological conditions of Class D stability and 3 m/s wind speed, the distance to endpoint for the ammonia is 0.1 mile for the same endpoint concentration of 0.14 milligrams per liter, or 200 parts per million, in air.\n\n IV. Description"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50553,
      "SummaryText": "maintains procedures for safely conducting activities related to the SCR process.  The procedures cover the required operational phases including initial startup, normal startup, normal shutdown, temporary operations, emergency shutdown, emergency operations, and startup following a turnaround or emergency shutdown. The information is readily available to operators and maintenance personnel involved in the process and the information is periodically reviewed to assure it is current.\n\nD.  Training - CWL&P's training program, as it relates to the SCR process, has been implemented to ensure that all personnel involved in the operation and maintenance of the process are properly trained in the workings of the process and are knowledgeable of the hazards of the process.  These personnel were given initial training and will be provided with refresher training at least every three years or more often if needed.\n\nE.  Mechanical Integrity - CWL&P conducts well-documented maintenance checks on process equipment to ensure safe and reliable operations. All process equipment routinely checked includes storage tanks and pressure vessels, piping systems, relief and venting systems, controls and pumps, emergency shutdown systems, and monitoring devices. All maintenance operations conducted on the SCR process are performed by qualified personnel who have had proper training.  Equipment deficiencies identified by the maintenance checks are corrected promptly and safely.\n\nF.  Management of Change - CWL&P maintains written procedures to manage changes in the process equipment, procedures and monitoring technology.  Personnel whose job tasks are affected by a modification in the process are promptly apprised of the modification and provided training to address new requirements.\n\nG.  Pre-Startup Review - A pre-startup safety review was conducted prior to the startup of the new process.  Established pre-startup safety review procedures assured that construction, equipment, and operating a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 50553,
      "SummaryText": "nd maintenance procedures were suitable for a safe startup before actually placing the process equipment into operation.\n\nH.  Compliance Audits - CWL&P will conduct compliance audits of the risk management plan at least every three years and develop a written report of the findings.  Any corrective actions required as a result of the audits will be promptly and safely implemented.\n\nI.  Incident Investigations - Any incident that results in or could reasonably have resulted in a significant release of a regulated substance will be promptly investigated. Written procedures ensure that investigations will be undertaken to identify the circumstances leading to the incident.  Corrective action will be taken to ensure that the situation leading to the incident does not reoccur.  All investigation reports will be retained for at least 5 years.\n\nJ.  Employee Participation - CWL&P believes in a team approach to process safety management and accident prevention in which employees are routinely consulted in these matters.  Employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information developed through implementation of the RMP, including information resulting from process hazard analyses.  These policies are contained in a written employee participation plan that is part of the RMP.\n\nK.  Hot Work Permits - CWL&P has developed and implemented a hot work permit program to be used whenever hot work operations are conducted on or near the SCR process.  The hot work permit must be issued and signed by the appropriate supervisory personnel.\n\nL.  Contractors - CWL&P develops partnerships with contractors to effectively conduct business and maintain generation facilities, especially in maintenance and construction activities.  Prior to selecting a contractor, CWL&P evaluates the qualifications of the contractor including its safety performance.  Written procedures are in p"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 50553,
      "SummaryText": "lace to ensure that contractors are properly informed of known potential hazards related to the contractor's work on or near the regulated process, including the emergency response procedures to follow in the event of an accidental release of ammonia.\n\nV. Five Year Accident History \n\nNo accidents have occurred within the SCR process for the past 5 years.\n\nVI. Emergency Response Program\n\nThe Part 68 rule distinguishes between those facilities that will respond to accidental releases of regulated substances and those that will not.  The requirements for non-responding facilities are covered in Section 68.90 of the rule.  For these facilities, an emergency action plan is required.  For a responding facility, the requirements are covered in Section 68.95 of the rule and a much more comprehensive emergency response plan is needed.  \n\nTo determine whether a facility is a responding one, the EPA interpretation of response is commonly used.  It is the definition of response used in the OSHA HAZWOPER standard in 29 CFR 1910.120(a)(3) and is defined as ¿a response effort by employees from outside the immediate release area or by other designated responders ¿ to an occurrence which results, or is likely to result, in an uncontrolled release of a hazardous substance.¿  This definition specifically excludes responses to incidental releases, which are those ¿where the substance can be absorbed, neutralized, or otherwise controlled at the time of release by employees in the immediate release area, or by maintenance personnel.¿  If the release of chemical is substantial or clearly growing in size, the leak is no longer considered incidental and employees should not respond unless they are specifically trained in response procedures and the facility has an emergency response program that meets the requirements of 40 CFR 68.95. \n\nFor non-responding facilities, an emergency action plan must include these elements:  (1) emergency escape procedures and emergency escape route assignmen"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 50553,
      "SummaryText": "ts; (2) procedures to be followed by employees who remain to operate critical plant operations before they evacuate; (3) procedures to account for all employees after emergency evacuation has been completed; (4) rescue and medical duties for those employees who are to perform them; (5) the preferred means of reporting fires and other emergencies; and (6) names or regular job titles of persons or departments who can be contacted for further information or explanation of duties under the plan.\n\nCWL&P has an emergency action plan in place to address and react to accidental releases of hazardous materials.  The plan includes such requirements as adequate first-aid and medical treatment, notification of local emergency response agencies and the public, and qualified contractor responder for post-incident response and decontamination of affected areas.  The plan will be promptly updated to address any pertinent changes within the process that would require a modification of the emergency action plan. \n\nVII. Planned Changes to Improve Safety\n\nCWL&P is always receptive to suggestions from employees to improve safety.  Employee meetings that focus on safety issues are held regularly.  Further, employees are trained to recognize hazards and to present ideas to eliminate them or minimize the potential consequences of those hazards.  The many recommendations made during the process hazard analyses have been considered for implementation."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 50553,
      "SummaryText": "This executive summary provides a brief overview of the risk management plan as it has been developed and implemented at the Dallman Power Station, one of several facilities owned and operated by City Water, Light & Power.\n\nI. Accidental Release Prevention and Emergency Response Policies\n\nEmployee safety and environmental protection are the drivers for City Water, Light & Power (CWL&P) policies at our Dallman Power Station.  In our view, environmental protection includes the health and welfare of the community surrounding Dallman.  This is why CWL&P has installed selective catalytic reduction (SCR) equipment to reduce air pollution and use ammonia as the most efficient chemical in the industry to accomplish this reduction.  The use of ammonia means that CWL&P must develop and implement a risk management plan to prevent the accidental release of ammonia to the atmosphere.  We have done so and provide a description of that plan here.\n\nCWL&P is committed to environmental leadership in managing its generating station for the public benefit, including the production of reliable, competitively priced power.  CWL&P also assures that employees are aware of their environmental responsibilities, which include the safe and responsible use of chemicals for air pollution reduction.  CWL&P management and employees are responsible for maintaining compliance with environmental requirements and striving for environmental excellence in performing their respective duties.  Beyond the development and implementation of this RMP, CWL&P¿s commitment to environmental protection extends to the review of new developments in safe technologies, operating procedures, and emergency preparedness.  All such activities are conducted in accordance with the most current environmental and health and safety regulatory requirements.\n\nII. Stationary Source and Regulated Substances Handled\n\nCWL&P is the sole supplier of electricity for Springfield, Illinois residents and businesses. CWL&P's Electric Divis"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50553,
      "SummaryText": "of Release Prevention Program\n\nThe prevention program is arguably the most important element of the RMP.  Its successful implementation requires the active participation of plant employees and managers in conducting activities aimed at preventing accidental releases of regulated chemicals.  If a prevention program could be perfect, there would be little need for emergency response activities, since no unexpected releases would occur.  Accordingly, a well-developed and properly implemented prevention program lowers the possibility of an accidental release and minimizes the consequences of a release should once occur.  The prevention program for the Dallman SCR process consists of twelve elements, which are briefly described here.\n\nA.  Process Safety Information - CWL&P maintains documentation of the needed safety information concerning chemical hazards, SCR system operating parameters, and process equipment designs and specifications.  This information was used as the basis for the Process Hazard Analysis and is readily available for review and reference by employees.\n\nB.  Process Hazard Analysis - CWL&P conducted detailed process hazard analyses (PHAs) of the process to ensure that the hazards associated with the process were identified and controlled effectively. The What-If analysis methodology was used to assess these hazards.  The analyses, in the form of workshops, were conducted by a team of qualified personnel with expertise in engineering, control logics, and process operations and facilitated by a person trained in the assessment methodology used.  The findings and recommendations that resulted from the workshops were addressed.  The What-If analysis was initially conducted on May 15-17, 2002 and a review of that PHA was conducted on August 27-28, 2002.  A pre-startup safety review of the system was conducted prior to the ammonia arriving on-site. The new PHA was reviewed and revised on March 17, 2006.\n\nC.  Operating Procedures - CWL&P has established and"
    }
  ]
}