{
  "FacilityID": 50574,
  "FacilityName": "Michigan Freeze Pack",
  "FacilityStr1": "835 S. Griswold St.",
  "FacilityStr2": null,
  "FacilityCity": "Hart",
  "FacilityState": "MI",
  "FacilityZipCode": "49420",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26127",
  "LEPC": "Oceana County LEPC",
  "FacilityLatDecDegs": "43.690278",
  "FacilityLongDecDegs": "-086.359722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 186222329,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Mike Sutton",
  "OperatorStr1": "835 S. Griswold St.",
  "OperatorStr2": null,
  "OperatorCity": "Hart",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49420",
  "OperatorZipCodeExt": null,
  "FTE": 65,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000141857",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-05-18 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-01-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-01-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-01-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-01-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 43.690278,
  "FRS_Long": -86.359722,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73418,
      "AltID": "Ammonia",
      "FacilityID": 50574,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 97358,
          "ProcessID": 73418,
          "ChemicalID": 57,
          "Quantity": 25000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 75186,
          "ProcessID": 73418,
          "NAICSCode": "311411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 43070,
              "Process_NAICS_ID": 75186,
              "SafetyReviewDate": "2005-02-02 00:00:00",
              "PHA_Date": "2005-02-02 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-12-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-03-12 00:00:00",
              "TrainingReviewDate": "2007-03-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-03-09 00:00:00",
              "EquipmentInspectionDate": "2007-03-09 00:00:00",
              "EquipmentTested": "All vessels, compressors, piping, valves and pumps",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2007-03-16 00:00:00",
              "PreStartupReviewDate": "2007-03-21 00:00:00",
              "ComplianceAuditDate": "2005-02-25 00:00:00",
              "AuditCompletionDate": "2005-03-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-03-21 00:00:00",
              "HotWorkPermitReviewDate": "2007-03-20 00:00:00",
              "ContractorSafetyReviewDate": "2007-03-20 00:00:00",
              "ContractorSafetyEvalDate": "2007-03-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 62749,
                  "PreventionProgram3ID": 43070,
                  "ProcessChemicalID": 97358
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50574,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-03-16 00:00:00",
    "ERTrainingDate": "2007-03-12 00:00:00",
    "CoordinatingAgencyName": "Oceana LEPC",
    "CoordinatingAgencyPhone": "2318734372",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50574,
      "SummaryText": "MICHIGAN FREEZE PACK\n          \n                                                                    Executive Summary\n\nSystem Process Overview\n\nMichigan Freeze Pack owns and operates a food processing facility at this location.  The primary function that the company serves is the processing, freezing, and packaging of fresh fruits and vegetables.  Raw product from the growers is received, usually in truck load quantities, delivered to the facility to be processed.  The product is off loaded from the truck and placed in the cooler waiting to be processed.  The product is then graded and cut into customer specifications.  After the product is cut, it is blanched, then run through a IQF Freezer (individually Quick Frozen), and packaged into various size containers as per customer order.  The already frozen product is then taken by forklift to a cold stroage warehouse owned by Hanson Cold Storage Co. that is connected to our facility.\n\nThe temperatures in storage and freezing areas are properly maintained by the use of a permanently installed closed ammonia refrigeration system.  The primary function of the ammonia refrigeration system is to remove heat from the product and the storage area, in order to lower the temperatrues, and to reject this heat to the ambient atmosphere.  This system consists of compressors, evaporators, vessels, ammonia pumps and condensers necessary for the completion of removing the heat and rejecting it to the atmosphere.\n\nBasic Refreigeration Process Overview:\n\nLiquid ammonia is supplied to the evaporator located in the coolers and freezers, by either pumps or high pressure (150 psi to 180 psi).  The pressure of the liquid ammonia is reduced as it enters the evaporator.  Heat is supplied to the evaporator coil surface by electric motor driven fans.  The air circulated across the outside of the coils is warmer than the refrigerant inside the coils, thus causing evaporation of the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50574,
      "SummaryText": "liquid into a vapor.  This vapor is then drawn into the compressor suction, which compresses the vapor into a higher-pressure superheated gas.  The compressor discharge, which contains the higher-pressure gas, is then pipped to the evaporative condensers.  The corresponding temperature of the higher-pressure gas is then cooled by the ambient air and water sprayed on the outside of the condenser coils.  This cooling process of the higher-pressure gas causes the gas to condense into liquid, which is then supplied to the room area evaporators to continuously repeat the cycle.\n\nThe refrigeration is controlled and operated automatically by the means of a Pocess Logic Controller, PLC.  The PLC cycles the equipment on and off to maintain the proper area temperatures.  The PLC also serves to monitor many safety cut outs as well as the monitoring of equipment operation in order to address alarm conditions that might occur.\n\nThe Ammonia refrigerant that is used in the refrigeration system has been classified by OSHA as being a hazardous chemical.   Any facility containing Ammonia in excess of the threshold limitaion, 10,000 lbs, set for by OSHA ,is required to develop and implement a Process Safety Management program, PSM.  We currently store approximatly 25,000 lbs of ammonia in our system.  We have not had any accidental releases in the past 5 years. \n\nSAFETY AND HEALTH POLICY\n\nEvery employee at Michigan Freeze Pack is entitled to a safe and healthful workplace.  All employees will follow safe and healthful work practices, obey  safety and health rules and regulations, and work in a manner which maintains high safety and health standards. We will provide and maintain, safe and healthful working conditions, and we will establish and insist upon work methods and practices that promote a safe and healthful workplace at all times.  Nurturing a positive employee environment with open communication, employee involvement, participation, and respect will help Michigan Freeze Pack"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50574,
      "SummaryText": "achieve high safety and health performance.\n\nEMERGENCY PLANNING\n\nThis plan has been developed as a guide for all personnel during an emergency situation.   It is the responsibilty of the facility manager to, directly or indirectly, instruct all personnel in their specific responibilities as defined by this plan.  It is the responsibility of all personnel to know their responsibilites and to react to all alarms and signals during and emergency in a swift, yet safe, manner.  Emergency contacts and telephone numbers are included in the Emergency Action Plan (EAP).\n\nPurpose:\n\nThe pupose of the Empergency Planning is to ensure that all employees, visitors, and contractors of Michigan Freeze Pack are instructed and kept informed of an emergency procedures in the event of emergency, such as an ammonia leak, tornado, fire or bomb threat.\n\nScope:\n\nThis plan covers all individuals that work for or contracted to work for Michigan Freeze Pack.\n\nProcedures:\n\n1.  An Emergency Action Plan must be written specifically for each individual facility.\n     \n     A.  The plan must meet the provisions of 29 CFR 1910.120(q).\n     B.  The plan must be reviewed and updated at least annually or when a major change is required.\n     C.  The plan must be signed be the facility Manager.\n\n2.  The Emergency Action Plan for each facility must show the following minimum information (see attached EAP).\n\n     A.  Escape routes and procedures for all work areas\n     B.  Procedures and those responsible for orderly shutdown of equipment or operations. \n     C.  An accountablitiy system to ensure all employees, visitors, and contractors are accounted for.\n     D.  Show all employees that are assigned for first aid and available at a predetermined location during an emergency.\n     E.  Employees that are assigned for rescue or response duties must be identified in the EAP and should be available at a\n          predetermined location.\n     F.  Alarm system for sufficient warning.\n     G.  Emergency tele"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50574,
      "SummaryText": "phone numbers are to be posted in a conspicuous location throughout the facility.\n     H.  Provide a means to test the alarm system at least annually.  (see attached fire, ammonia and tornado drill assessment\n          forms)\n     I.  A back-up means of alarm shall be determined and maintained.\n     J.  The EAP shall show the proper handling of small releases of ammonia.\n     K.  Training of a sufficient number of persons shall be conducted to assist in the orderly evacuation of all employees, visitors\n           and contractors.\n     L.  Initial training upon hire and then at least annually or whenever the plan has a substantial change.\n     M.  A written copy of the plan shall be kept in the workplace and made available to employees upon request.\n     N.  First responder training shall be given to those that are required to distinguish between incidental spills and spills that \n          require evacuation and the assistance of emergency responders.\n\nHAZMAT RESPONSE STANDARD OPERATING PROCEDURES\n\nStandard Operating Procedures\n\nThe following Standard Operating Proceedures are to be adhered to in the event of a HAZMAT required release:\n\n1.  Notification of a release will be annoucned by a senior plant offical on duty.\n2.  The level of plant evacuation will be determined and followed as written in the Emergency Action Plan based on the areas on\n     contaminaiton\n3.  Machinery is to be shut down as described in the Emergency Action Plan upon the evacuation of the facility.\n4.  HAZMAT Team notification shall be made in accordance to the Notification Procedures Section of the Emergency Action Plan.\n5.  No person is allowed to re-enter the facility at this time..  Entry will only be allowed by the entery team member with\n     authorization of the local HAZMAT Team.\n6.  Once the HAZMAT Team has arrived, the entry team will immediately begin taking vitals while being briefed on the situation\n     by either the facility Manager or the senior Maintenance employee on duty.\n7"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50574,
      "SummaryText": ".  The Incident Commander will begin to delegate the responsiblities of each team member based on the individual's training, \n     experience and qualifications.\n8.  For an unkown concentration level, the entry team must wear Level A protection.  If after testing the hazardous atmosphere,\n     it is determined that the concentration level is between 20 ppm and 300 ppm and not rising, the protection level of the entry\n     team members may be reduced to Level C PPE.\n9.  In the event the local Hazmat Team is called to respond, they will take scene control.\n10.  Information supplied by the evacuation will be evaluated by the Incident Command Team.  This team is to be immediately\n       notified if its is determined any person is unaccounted for.  A quick precise action plan will be developed by the Incident \n       Command Team.  No attempt to locate persons not accounted for will involve endagering lives of will involve endagering lives \n       of others by re-entry into the emergency areas.  Professional emergency response crews arriving at the facility will be \n       notified in order to locate all personnel not accounted for. \n11.  The local HAZMAAT Team will determine the best methods to control and mitigate the situation.\n12.  Only those persons trained in the 24-hour Technician Level may enter the facility.  Prior to entry team A must test the \n       atmosphere.  For an ammonia release with concentration levels at or above 1.6% or (16,000 ppm), entry is not permitted.\n13.  Once the release has been mitigated and the entry team has exited the building they must go through decontamination.  \n       Procedures for establishing the Decon Zone are to be followed.\n14.  After decontamination, vital sign will be taken by qualified medical personnel and liquids given to replenish lost body fluids as \n      necessary.\n15.  The command team and all local authorities involved with the incident must conduct a debriefing to critique the incident.\n16.  Scene command is com"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 50574,
      "SummaryText": "pletely returned to facility management upon termination of the HAZMAT incident.\n\nAnnual HAZMAT Drills\n\nAt least once a year, a HAZMAT exercise which all equipment is utilized, will be conducted,  a critique of the annual drills will be held following the exercise.  A written record of the critique will be maintained by the Safety Manager."
    }
  ]
}