{
  "FacilityID": 50632,
  "FacilityName": "Pacific Ethanol Madera, LLC",
  "FacilityStr1": "31470 Avenue 12",
  "FacilityStr2": null,
  "FacilityCity": "Madera",
  "FacilityState": "CA",
  "FacilityZipCode": "93673",
  "Facility4DigitZipExt": "2869",
  "FacilityCountyFIPS": "06039",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.922167",
  "FacilityLongDecDegs": "-119.975000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.pacificethanol.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pacific Ethanol, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cheryl Pagard",
  "OperatorStr1": "400 Capitol Mall, Suite 2060",
  "OperatorStr2": null,
  "OperatorCity": "Sacramento",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95814",
  "OperatorZipCodeExt": null,
  "RMPContact": "Cheryl Pagard",
  "RMPTitle": "Safety and Environmental Coordinato",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000197191",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-03-13 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-01-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-01-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-01-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-06-17 00:00:00",
  "DeRegistrationEffectiveDate": "2014-04-21 00:00:00",
  "AnniversaryDate": "2013-01-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Aqua Ammonia - Reduced Concentration to 19%",
  "_processes": [
    {
      "ProcessID": 73488,
      "AltID": "Aqueous ammonia tank",
      "FacilityID": 50632,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75258,
          "ProcessID": 73488,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 97440,
          "ProcessID": 73488,
          "ChemicalID": 57,
          "Quantity": 51000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597440,
          "ProcessID": 73488,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 73489,
      "AltID": "Denaturant Tank",
      "FacilityID": 50632,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75259,
          "ProcessID": 73489,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 97441,
          "ProcessID": 73489,
          "ChemicalID": 155,
          "Quantity": 210000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 78340,
              "ProcessChemicalID": 97441,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 78341,
              "ProcessChemicalID": 97441,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 597441,
          "ProcessID": 73489,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50632,
      "SummaryText": "Pacific Ethanol Madera, LLC operates as an ethanol fuel production plant located in the city of Madera, in Madera County, California.  As a requirement of the Clean Air Act Amendments 112(r) Accidental Release of Hazardous Air Substances program, Pacific Ethanol Madera, LLC completed a risk management plan (RMP) for chemicals stored on-site above RMP reporting thresholds. Regulated chemicals at Pacific Ethanol Madera, LLC include isopentane and pentane  (each exceed 10,000 pound threshold) and aqueous ammonia (exceeds 20,000 pound threshold).\n\nAccidental Release Prevention and Emergency Response Policies\nPacific Ethanol Madera, LLC is committed to the protection of its employees, the greater community and the environment from hazardous substances used in the ethanol production process, specifically aqueous ammonia and isopentane and pentane (constituents of the natural gasoline used as a denaturant).  The ammonia is used for pH control directly in the process feed mixture to fermentation.  The denaturant is added to ethanol to make the ethanol unfit for human consumption.  It is the policy of Pacific Ethanol Madera, LLC to comply with all applicable federal, state, and local laws.  In the event of an emergency, including an accidental release of toxics and flammables, it is the policy of Pacific Ethanol Madera, LLC to notify the Madera Fire Department and the Madera County Sheriff Department and evacuate all employees at the facility.  \n\nRegulated Substances Handled\nThe facility produces fuel grade ethanol from corn and a process by-product known as wet distillers' grain with solubles, which is used as a livestock feed.  Aqueous ammonia is stored on-site and used in the ethanol production process for pH control.  The maximum amount of aqueous ammonia stored is approximately 51,000 pounds (20-30 percent ammonia in solution).  The fuel ethanol production process requires use of a denaturant (natural gasoline) which may contain approximately 40 percent pentane and appr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50632,
      "SummaryText": "oximately 7 percent isopentane, both RMP-regulated substances.  The maximum amount of denaturant on-site is approximately 210,000 pounds (total pentane approximately 85,000 pounds; total isopentane approximately 15,000 pounds).  The natural gasoline is stored in an above ground tank as a liquid and is mixed with the fuel ethanol in the final stage of production; this tank is located in the facility tank farm area which includes a secondary containment dike.  Unleaded fuel may also be used as a denaturant in place of natural gasoline and does not contain any regulated constituents above the threshold quantity.  Pacific Ethanol Madera, LLC has evaluated the worst-case and alternative case scenarios as they relate to the regulated substances.  An Emergency Response Program (Integrated Contingency Plan) for these scenarios has been prepared and implemented. Pacific Ethanol Madera, LLC has coordinated emergency response with the local authorities and will conduct periodic drills.  \n\nGeneral Accidental Release Prevention Program\nThrough completion of this RMP, Pacific Ethanol Madera, LLC has complied with the EPA requirements under 40 CFR Part 68 and OSHA Process Safety Management (PSM) requirements, as well as California regulations at CCR Title 8, Section 5189 and CCR Title 19 D-2, Chapter 4.5.  Process safety information, safe work practices such as Hot Work, Confined Space Entry and Lockout/Tagout, and operations and maintenance procedures are documented on-site as part of the facility PSM/RMP Prevention Program.  Periodic functions such as process hazard analysis, training, management of change, pre-startup safety reviews, and incident investigation are conducted on a regular basis as outlined in the PSM/RMP Prevention Program.  Audits of the overall RMP and Prevention Program will be conducted on a regular basis to assure compliance with EPA regulations.\n\nFive Year Accident History\nPacific Ethanol Madera, LLC does not have a history of accidents related to RMP regul"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50632,
      "SummaryText": "ated programs which may have caused death, injuries, environmental or property damage, evacuations or in-place sheltering in the last five years.  The facility commenced operation on October 31, 2006.\n\nEmergency Response Program\nPacific Ethanol Madera, LLC is included in the community emergency response plan and has developed their own written emergency response plan (Integrated Contingency Plan, or ICP).  This plan includes actions to respond to accidental releases of regulated substances, actions to inform the public and local agencies responding to accidental releases and emergency health care information.  Pacific Ethanol Madera has provided a copy of the ICP to the Madera Fire Department and the Madera County Environmental Health Department. Pacific Ethanol Madera, LLC conducts routinely employee training on the ICP and periodically evaluates the plan for necessary revisions.\n\nPlanned Changes to Improve Safety\nPacific Ethanol Madera, LLC completed its most recent Process Hazard Analysis (PHA) of the aqueous ammonia and flammables processes in August 2007. A number of recommendations to improve facility safety were accepted as part of the PHA process, and a timeline was developed to track the recommendations to completion.  A complete summary of the PHA process and recommendation tracking progress is maintained at the facility.  The following presents a brief summary of the recommendations.\n\nAmmonia system: Relocation of stormwater drain; posting of emergency contact information at loading area and instituting a wheel-chock policy for delivery drivers; reconfiguring piping at chemical receiving area; investigating delivery equipment; accompanying drivers during delivery process; addition of level alarms to ammonia tank; labeling of hose connections; updating P&IDs to reflect site conditions; verifying that all covered equipment is in maintenance database.  Pacific Ethanol Madera, LLC anticipates that these changes will be implemented on or before November 19, 20"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50632,
      "SummaryText": "08.\n\nFlammables system: Verifying that all flammables equipment is in maintenance database; posting of emergency contact information at loading area and instituting a wheel-chock policy for delivery drivers; investigating delivery equipment procedures with drivers; reroute electrical cart traffic away from potentially explosive areas; install retractable grounding rail at truck loadout; update P&IDs to reflect site conditions.  Pacific Ethanol Madera, LLC anticipates that these changes will be implemented on or before December 31, 2008."
    }
  ]
}