{
  "FacilityID": 5067,
  "FacilityName": "DSM Desotech, Inc.",
  "FacilityStr1": "1122 St. Charles Street",
  "FacilityStr2": null,
  "FacilityCity": "Elgin",
  "FacilityState": "IL",
  "FacilityZipCode": "60120",
  "Facility4DigitZipExt": "8443",
  "FacilityCountyFIPS": "17089",
  "LEPC": "Kane County LEPC",
  "FacilityLatDecDegs": "42.011111",
  "FacilityLongDecDegs": "-88.268806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 622405298,
  "ParentCompanyName": "DSM Finance USA, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "DSM Desotech, Inc.",
  "OperatorStr1": "1122 St. Charles Street",
  "OperatorStr2": null,
  "OperatorCity": "Elgin",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60120",
  "OperatorZipCodeExt": "8443",
  "FTE": 80,
  "OtherEPAFacilityID": "60120DSTNC1122S",
  "EPAFacilityID": "100000064075",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "96030073",
  "SafetyInspectionDate": "1999-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2010-04-16 00:00:00",
  "DeRegistrationEffectiveDate": "2006-01-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.01228,
  "FRS_Long": -88.27097,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5946,
      "AltID": "Unloading/delivery",
      "FacilityID": 5067,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6457,
          "ProcessID": 5946,
          "ChemicalID": 77,
          "Quantity": 10200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6091,
          "ProcessID": 5946,
          "NAICSCode": "32551",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 5947,
      "AltID": "Storage",
      "FacilityID": 5067,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6458,
          "ProcessID": 5947,
          "ChemicalID": 77,
          "Quantity": 20400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6092,
          "ProcessID": 5947,
          "NAICSCode": "32551",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5067,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-04-01 00:00:00",
    "ERTrainingDate": "1999-05-01 00:00:00",
    "CoordinatingAgencyName": "Elgin Fire Department",
    "CoordinatingAgencyPhone": "8479316175",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "RCRA 40 CFR 262 for large quantity generators",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5067,
      "SummaryText": "Facility Description and Operations\nThe DSM Desotech, Inc. facility in Elgin, Illinois formulates and manufactures ultraviolet light (UV) and electron beam (EB) cured coatings and resins that are used by various industries in a multitude of applications.  For example, one specific industry that frequently uses DSM's products is the fiber-optic cable industry.  The Elgin, Illinois facility houses offices, a research and development laboratory, manufacturing activities, and a warehouse for raw materials and finished product. \n\nProduction of the coatings is completed in a process that is analagous to cooking from a recipe.  For a given batch of product that is being produced, there is a specification (similar to a recipe) that dictates the raw materials used, the procedures for mixing them together, and how to complete the reaction.  Weigh tanks (similar to measuring cups), blend tanks (similar to mixing bowls) and reactors (similar to pots and pans) are used in the process.  Reactions typically take 12 to 24 hours to complete, and when the reaction is finished, the original raw materials have been polymerized.  Polymerization is the same process that causes liquid cake batter to become a solid cake once it is baked.  In this case, DSM's products are only partially polymerized.  Final polymerization and the formation of a solid \"dry\" coating happens only upon product exposure to ultraviolet light (u.v.) in a customer's process.  \n\nBecause of the time required to complete a batch of product, DSM production is completed over five 24-hour days.  \n\nMaterials\nDSM Desotech employs a variety of organic chemicals in the production of UV/EB coatings and resins.  General classes of chemicals used include acrylates, polyols, isocyanates, monomers, photoinitiators, inhibitors and diluents.  In addition, an acetone solvent cleaning system is used to clean the equipment used in production.  \n\nThe only chemical subject to the Risk Management Program (RMP) requirements of 40 CFR 68.13"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5067,
      "SummaryText": "0 that is used by DSM is toluene diisocyanate (TDI), mixed isomers (CAS Registry Number 26471-62-5).  TDI is listed as a toxic liquid.  The threshold quantity of TDI for RMP applicability is 10,000 pounds in any single process.  Processes that were identified to be subject to RMP based on the quantity of TDI in the process consist of delivery/unloading and storage.  Although TDI is received and stored in quantities that exceed the RMP applicability threshold, there are no product formulations that require an excess of 10,000 pounds of TDI to be used to produce a batch of product.\n\nWorst Case Release Scenario\nA worst case release scenario was conducted assuming a release of 200 gallons of TDI from a tote storage tank.  As dictated in 40 CFR 68.25(d), the release scenario was assumed to be an instantaneous release of the contents of the largest vessel.  Since the TDI is received and stored at two different locations within the plant, the release was assumed to occur at two different locations, and the potential receptors within the distance to endpoint centered at each location were evaluated.  \n\nThe distance to the endpoint was calculated using an atmospheric dispersion model for denser-than-air gases (SLAB).  The results of the modeling indicated a distance to the endpoint of 0.0031 miles (approximately 16 feet).  The corresponding release rate was calculated to be 0.00571 pounds per minute, and the release duration was 5,955 hours.  These results were obtained assuming no passive mitigation to inhibit the release.  In reality, a release from the facility would most likely occur indoors where the building enclosure and a dike around the building would help to keep the release contained inside the DSM building.\n\nWhile entering the results of the worst-case scenario analysis using EPA's RMP*Submit software, it was noted that the program is unable to accept the results of the modeling listed above because the values are outside of the expected range for these parameter"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5067,
      "SummaryText": "s.  EPA has acknowledged that this may be a problem in certain instances, and for purposes of completing the RMP, advised inputting the smallest numbers that would be accepted into RMP*Submit.  This paragraph is intended as an explanation of why the values reported in the RMP differ from those values that were obtained through modeling.\n\nFive-year accident history\nThere have been no accidents at the Site from the regulated processes within the last five years that resulted in either onsite deaths, injuries, or significant property damage or offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage. \n\nEmergency response \nDSM is not required to complete an Emergency Response Plan to fulfill the requirements of the Risk Management Program for Program 1 processes; however, DSM is required to perform emergency planning under several regulations including Occupational Safety and Health Administration (OSHA) regulations, Resource Conservation and Recovery Act (RCRA) regulations for large quantity hazardous waste generators, Clean Water Act regulations, and Emergency Planning and Community Right to Know Act (EPCRA) regulations.  Specific documents that DSM has prepared to address emergency response include an Emergency Preparedness Plan; an Emergency Response Plan; and a Spill Prevention, Control and Countermeasure (SPCC) Plan.  \n\nDSM has established procedures in case of an emergency at the facility.  These procedures assign responsibility for implementing the emergency response plan, assuring safety of onsite workers, notifying the proper authorities, and coordinating any necessary cleanup and/or decontamination activities.  DSM has retained an outside hazardous materials contractor who can respond to onsite incidents if needed.\n\nThe Elgin Fire Department and the Kane County Local Emergency Planning Committee (LEPC) have been notified of DSM's emergency response procedures.\n\nAccident Prevention\nDSM has established a series of safe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5067,
      "SummaryText": "work practices that are used to minimize the likelihood of a hazardous material release.  Practices are updated or added as necessary to address any newly identified hazards.  In the event of a release, passive mitigation (i.e. dikes, building enclosure) is available to prevent migration of the spilled material beyond the plant building itself.\n\nCommitment to Safety, Health and Environment\nDSM Desotech, Inc. aims to maintain business activities that do not adversely affect safety or health, and it is therefore the objective of the company to evaluate its practices and processes to ensure that they are safe to employees, the public, and the environment.  DSM's corporate policy on Safety, Health and the Environment is consistent with the Responsible Care Programme of the European Chemical Industry Council and with the International Chamber of Commerce Business Charter for Sustainable Development.\n\nDSM complies with a variety of safety and environmental regulations including the Emergency Planning and Community Right to Know Act (EPCRA) Sections 301-303 (Emergency Planning), Sections 311/312 (Hazardous Chemical Inventory Reporting), and Section 313 (Toxic Release Inventory Reporting); Occupational Safety and Health Administration (OSHA) Section 1910.38 for worker safety; and Resource Conservation and Recovery Act (RCRA) Section 40 CFR 262 for large quantity hazardous waste generators.  In addition, DSM has submitted an application for an operating permit under Title V of the Clean Air Act Amendment; at the time of the writing of this summary, DSM's Title V application continues to be under review by the Illinois Environmental Protection Agency."
    }
  ]
}