{
  "FacilityID": 5070,
  "FacilityName": "Ciba Specialty Chemicals Water Treatments, Inc.",
  "FacilityStr1": "2301 Wilroy Road",
  "FacilityStr2": "P.O. BOX 820",
  "FacilityCity": "Suffolk",
  "FacilityState": "VA",
  "FacilityZipCode": "23439",
  "Facility4DigitZipExt": "0820",
  "FacilityCountyFIPS": "51800",
  "LEPC": "Suffolk LEPC",
  "FacilityLatDecDegs": "36.782778",
  "FacilityLongDecDegs": "-76.536389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "www.cibasc.com",
  "FacilityDUNS": 76670959,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Ciba Specialty Chemicals",
  "OperatorStr1": "2301 Wilroy Road",
  "OperatorStr2": "P.O. BOX 820",
  "OperatorCity": "Suffolk",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23439",
  "OperatorZipCodeExt": "0820",
  "FTE": 385,
  "OtherEPAFacilityID": "VAD076670959",
  "EPAFacilityID": "100000064459",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-08-05 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.77736,
  "FRS_Long": -76.54321,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5952,
      "AltID": "Acrylamide Manufacture",
      "FacilityID": 5070,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6464,
          "ProcessID": 5952,
          "ChemicalID": 25,
          "Quantity": 535000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6097,
          "ProcessID": 5952,
          "NAICSCode": "32599",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2511,
              "Process_NAICS_ID": 6097,
              "SafetyReviewDate": "1999-05-11 00:00:00",
              "PHA_Date": "1995-08-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1996-12-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Catalytic oxidizer, Nitrogen Blanketing",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Foam system, Fire Cladding",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-11 00:00:00",
              "TrainingReviewDate": "1999-02-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1996-05-31 00:00:00",
              "EquipmentInspectionDate": "1999-05-12 00:00:00",
              "EquipmentTested": "Columns: DC311,320,321,322 Heat exchangers: HE311,321,322,323,324,325,326,327,32 Condensers J321-KOC,1BC,2BC,3BC Process vessels: PV302,305,312,313A&B,314,315 VE309,321,322,323,329,351,702,720",
              "ChangeMgmtDate": "1999-05-12 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-14 00:00:00",
              "PreStartupReviewDate": "1999-05-11 00:00:00",
              "ComplianceAuditDate": "1999-03-24 00:00:00",
              "AuditCompletionDate": "1999-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-08-24 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-14 00:00:00",
              "ContractorSafetyReviewDate": "1998-02-02 00:00:00",
              "ContractorSafetyEvalDate": "1998-08-24 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2823,
                  "PreventionProgram3ID": 2511,
                  "ProcessChemicalID": 6464
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5070,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-23 00:00:00",
    "ERTrainingDate": "1999-06-02 00:00:00",
    "CoordinatingAgencyName": "City of Suffolk Fire Department",
    "CoordinatingAgencyPhone": "7579232110",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5070,
      "SummaryText": "1)  Facility Description\n\nEstablished in 1983, the Suffolk facility of Ciba Specialty Chemicals Water Treatments Inc. (\"Ciba\") has more than 150 employees in production units that operate around the clock, seven days a week.  Our two finished product plants produce chemicals which are used in all phases of water treatment, from municipal waste water treatment to paper making.  Additionally, our Monomers group produce raw materials used by the finished product plants. The site covers 225 acres on the west side of Wilroy Road, 1/2 mile north of the Wilroy Industrial Park.  Ciba Suffolk is a state-of-the-art specialty chemicals manufacturing facility with some of the nation's most advanced production units, laboratories, and equipment.\n\n2)  RMP Chemicals on Site\n\nWe have two chemicals on our site that are listed under the RMP rule:  acrylonitrile and ammonia solution.  Acrylonitrile is a very commonly used in the manufacture of acrylic fibers, which are substitutes for wool and cotton, and ABS plastics, which are utilized in telephone, television, and computer housings as well as in molded automobile parts like dashboards and bumpers.  Acrylonitrile, as a toxic chemical, represents our most serious potential hazard.\n\n3)  Process Description\n\nIn January 1997 we began operating a plant to produce acrylamide, a chemical we had previously imported or purchased.  We utilize a process called catalytic hydration to produce acrylamide.  This process consists of reacting acrylonitrile with water in the presence of a catalyst.  The end result is a solution of acrylamide in water.  This continuous process (24 hours/day, 7 days/week, 52 weeks/year) is operated by well trained process technicians using a state-of-the-art computer control system.  The plant is shutdown twice each year for preventive maintenance and equipment inspection/testing.  Acrylonitrile is delivered to the site exclusively in top-offloading rail cars.  It is unloaded into one of three 220,000 lb. storage tanks"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5070,
      "SummaryText": "in rotation, which are never filled to more than 80% capacity.  The in-process inventory of acrylonitrile is, in comparison to storage inventory, very low due to it's rapid conversion to acrylamide.\n\n4)  Potential Release Scenarios\n\nUtilizing the RMP rule requirements, we analyzed two potential release scenarios, a worst case and an alternative case, for acrylonitrile.  Acrylonitrile is treated as a toxic chemical under RMP.\nIn each scenario, a release is defined and, using modeling of how the vapor cloud will disperse in the atmosphere, the distance to a toxic endpoint is calculated.  The EPA has defined the toxic endpoint for acrylonitrile as 76 milligrams per cubic meter (beyond this point, a one hour exposure is not considered capable of causing irreversible damage to human health). For the worst case scenario we utilized \nthe EPA look-up table models, and for the alternative case we utilized ALOHA modeling software.\n\n5)  Worst Case Scenario\n\nThe worst case release is considered to be the release of the contents of a storage tank of acrylonitrile.  Our tanks are contained within a concrete dike, therefore the released acrylonitrile will lie within the diked area and begin to evaporate.  The vapor would then disperse in the atmosphere dependent on prevailing atmospheric conditions.  Using the EPA RMP Guidance for Off-site Consequence Analysis, the \ndistance to the toxic endpoint is 1.16 miles.  It should be noted that the worst case scenario be considered a highly unlikely event.  \nDesign, construction, operation, and testing of the acrylonitrile storage tanks are such that a catastrophic failure of this kind is extremely remote.  The worst case scenario is also extremely unlikely because:\n- there is an acrylonitrile sensor in the diked area which would warn of a leak.\n- the diked area can be covered in foam which suppresses vapor formation. This foam system operates automatically in case of fire, but can also be remotely operated from a process control room in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5070,
      "SummaryText": "case of a leak.  Foam can also be injected into the storage tanks, also operated from the process control room.\n- the entire process, off-loading, and storage area are monitored by remote tilt/zoom color cameras from the process control room.\n- spillage due to overfilling of storage tanks is highly unlikely as each tank is equipped with an independent high-level shutoff mechanism. \n- storage tanks are equipped with remotely activated shut-off valves, allowing negation of impact in the event of a leak in any associated pipework.\n- storage tanks walls are subject to ultrasonic testing\n\n6)  Alternative Case Scenario\n\nSpillage from a rail car is the alternative case for acrylonitrile.  Rail cars represent the second largest containers of acrylonitrile and are the only other major inventory on site.\nThe scenario we considered is the catastrophic failure of a three inch transfer hose used while off-loading the rail car.  At the beginning of the off-load, the car is 97% full therefore the nitrogen used to pressurize the car (at 20 psi) would displace very little acrylonitrile before equalizing with atmospheric pressure.  If, however, the hose failed half-way through the off-load, there would be sufficient energy to displace almost all of the contents remaining in the rail car.  Using ALOHA modeling software, the distance to the toxic endpoint is 0.33 miles.  The analysis did not consider any mitigating actions to reduce the volume of the leak or to suppress the subsequent vapor release.\nAlthough the alternative case scenario is somewhat less remote than the worst case, it is still a very unlikely occurrence because:\n- transfer hoses are inspected and pressure tested before each off-load.\n- the off-loading operation is physically monitored 100% of the time at the off-loading station.\n- a derailer is placed on the railroad track in front of the car being off-loaded (preventing any other car mistakenly on the track from reaching the off-loading car).\n- a remotely operated spr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5070,
      "SummaryText": "inkler system an be employed in case of a spill, reducing the amount of vapor released.\n- an acrylonitrile detector, mounted beneath the off-loading station, would detect any spillage.\n- a remotely operated shutdown switch is in place which would close all transfer and nitrogen valves on the off-loading lines, \nshut down the transfer pump, and close the storage tank fill lines.\n\n7)  Safety Philosophy\n\nThe Ciba Suffolk site has a strong and improving safety culture, led by our site manager.  Our guiding principles are the six codes of management practice found in the Chemical Manufacturers Association's Responsible Care(r) initiative.  Three of the codes are particularly relevant to this discussion: Process Safety (PS), Employee Health & Safety (EHS), and Community Awareness and Emergency Response \n(CAER).  Our PS efforts are managed via a committee comprising employees from each production area and EHS personnel.  The committee meets monthly, monitors performance and progress, and updates and improves PS policies and practices.  Our CAER program is evidenced by our participation in the Ciba Community Advisory Panel (CAP) and other community outreach efforts.  The CAP is comprised of Ciba employees, residents of our neighborhood, civic leaders, emergency services representatives, and a local high school chemistry teacher.  The CAP has met at least monthly since its beginning and is a forum for our neighbors to express their interest and concerns with our site.  \nThe Suffolk site is also in the process of enacting the Occupational Safety and Health Administration's (OHSA's) Voluntary Protection Program.  We will apply to OSHA for this participation in the VPP program by January 2000. \n\n8)  Five Year Accident History\n\nWe have not experienced any accidents or incidents which meet the RMP definition.  The acrylamide process has operated with no lost time accidents since beginning operation in January 1997.\n\n9)  Emergency Response\n\nOur emergency response efforts are led a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5070,
      "SummaryText": "nd directed by a five person committee which meets quarterly to review progress, recruit, schedule training, allocate resources, and liaise with the Suffolk Local Emergency Planning Committee (LEPC).  We have over 70 people trained as emergency responders and support personnel, 52 of those fully trained as emergency responders (normally a minimum of ten on site at all times).  There are also 15 people trained as Emergency Medical Technicians (EMT's).\nOn-site drills are held five times each year; four drills during shift rotations, the fifth a full site drill. Additionally, we participate in an annual drill held by the LEPC which includes local emergency services and other local industry.  We have an automated on-site emergency notification system which is to be upgraded later this year.  Off-site response is initiated via the Suffolk Emergency Response Plan, and is coordinated by the Suffolk Department of Emergency Services in conjunction with the Suffolk Fire Department."
    }
  ]
}