{
  "FacilityID": 50771,
  "FacilityName": "Crest Foam Industries Incorporated - NJRMP version",
  "FacilityStr1": "100 Carol Place",
  "FacilityStr2": null,
  "FacilityCity": "Moonachie",
  "FacilityState": "NJ",
  "FacilityZipCode": "07074",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34003",
  "LEPC": "Bergen County OEM",
  "FacilityLatDecDegs": "40.837222",
  "FacilityLongDecDegs": "-074.048889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.crestfoam.com",
  "FacilityEmailAddress": "info@crestfoam.com",
  "FacilityDUNS": 1539386,
  "ParentCompanyName": "British Vita PLC",
  "Company2Name": null,
  "CompanyDUNS": 1539386,
  "Company2DUNS": null,
  "OperatorName": "Crest Foam Industries Incorporated",
  "OperatorStr1": "100 Carol Place",
  "OperatorStr2": null,
  "OperatorCity": "Moonachie",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07074",
  "OperatorZipCodeExt": null,
  "FTE": 63,
  "OtherEPAFacilityID": "CRSTF100CA",
  "EPAFacilityID": "100000093178",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-01-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-02-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-02-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-01-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.837222,
  "FRS_Long": -74.048889,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C03",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73675,
      "AltID": null,
      "FacilityID": 50771,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 97651,
          "ProcessID": 73675,
          "ChemicalID": 77,
          "Quantity": 170000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 75447,
          "ProcessID": 73675,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 27071,
              "Process_NAICS_ID": 75447,
              "SafetyReviewDate": "2003-04-10 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "International Isocyanate Institute Recommendations for the handling of Toluene Diisocyanate",
              "FR_Comments": null,
              "HazardReviewDate": "2003-04-10 00:00:00",
              "ChangeCompletionDate": "2003-07-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2002-01-21 00:00:00",
              "TrainingReviewDate": "2003-07-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-07-10 00:00:00",
              "EquipmentInspectionDate": "2005-12-09 00:00:00",
              "EquipmentTested": "Fittings, Strainers, Injectors, Plate Exchangers, Metering Pumps, Diverter Valves, Check Valves, Gauges, Level Indicators, Rotometers, Scott Packs",
              "ComplianceAuditDate": "2001-10-01 00:00:00",
              "AuditCompletionDate": "2002-01-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 28281,
                  "PreventionProgram2ID": 27071,
                  "ProcessChemicalID": 97651
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50771,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-06-07 00:00:00",
    "ERTrainingDate": "2003-07-10 00:00:00",
    "CoordinatingAgencyName": "Local Emergency Planning Commission",
    "CoordinatingAgencyPhone": "2016419100",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50771,
      "SummaryText": "Introduction\n\nCrest Foam Industries Incorporated uses Toluene Diisocyanate (TDI) to manufacture flexible polyurethane foam products at its plant in Moonachie, New Jersey.  The TDI is received in 40,000 pound truckload quantities and off loaded into storage containers.  The total quantity of TDI at the plant never exceeds 170,000 pounds.  Crest Foam Industries Incorporated initially developed a Risk Management Program (RMP) for the facility in order to comply with the requirements of New Jersey¿s Toxic Catastrophe Prevention Act (TCPA).  The RMP being submitted is derived from that original plan.\n\nCrest Foam Industries Incorporated has developed a thorough program for the safe handling of TDI at their plant. This program has been successfully operating since September 1988.  The program is audited annually by the NJ Department of Environmental Protection.  The company has not had a reportable accident in over five years.  This executive summary describes the elements of the Crest Foam Industries Incorporated RMP program which include: \n\n¿\tStandard Operating Procedures\n¿\tSafety Review\n¿\tPreventive Maintenance\n¿\tOperator Training\n¿\tAccident Investigation\n¿\tRisk Assessment\n¿\tEmergency Response\n¿\tRisk Management Program Audits\n\nStandard Operating Procedures\n\nStandard Operating Procedures include the following elements:  process flow sheets; procedures for normal operations; description of abnormal conditions and appropriate corrective actions; description of emergency conditions and appropriate corrective actions; pre-startup, startup, and shutdown procedures; description of safety devices; safety procedures; sampling procedures; material data sheets; manpower requirements; and development of an index to procedures and information.  The Standard Operating Procedures are continually updated to reflect any changes modifications to the system.  \n\nSafety Review\n\nThe Safety Review involves comparing facility design, equipment, and operations with the current state-of-the-art."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50771,
      "SummaryText": "The safety review also requires that the plant be visually inspected to determine if safety devices are functioning properly, if actual operating conditions are within design limits, and if the actual conditions reflect Standard Operation Procedures. The findings and any deficiencies are then documented in a written report.  A number of documents must be prepared to facilitate the safety review.  These documents include:  process description and process chemistry, process flow sheets, piping and instrument diagrams, facility location maps, site plans and equipment layout, electrical one-line diagrams, electrical area classification drawing, specifications far safety release devices, specifications for materials of construction, EHS inventories, and a listing of external forces and events (such as floods. power outages, etc.) that could influence safe operations. The documents required to support a safety review have been assembled from existing drawings.  The company¿s plant engineer performs the formal safety review on an annual basis.\n\nPreventive Maintenance\n\nThe preventative Maintenance Program consists of procedures for maintaining equipment safety, establishing the frequency and scheduling of maintenance work, and documenting the process.  The Preventive Maintenance Program includes:  a listing of TDI-related equipment; procedures for controlling equipment modifications; a schedule for equipment inspections; schedule and procedures for testing safety devices; schedule and procedures for check of safety instruments; procedures for commissioning/decommissioning equipment; schedule and content of preventive maintenance training; procedures for maintenance by outside contractors; permits and checklists for TDI-related equipment entries, lockouts, and welding; central filing system for tracking inspections, breakdowns and repairs suitable for data retrieval and analysis; and tables comparing the actual to planned program of preventive maintenance, inspection, and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50771,
      "SummaryText": "tests.  The execution of the plan is the responsibility of the Foam Line manager and the Plant Manager.\n\nOperator Training\n\nThe Operator Training Program includes:  written job descriptions; procedures to qualify operators; frequency and duration of programs; training manuals and guidelines for instructors; documents to track training program for each employee; and a table summarizing operator training performed during the year.  A combination written and video cassette Operator Training Program has been developed and is in use along with on-the-job training for all operators.  \n\n Accident Investigation\n\nThe Accident Investigation Procedure includes:  written procedures for TDI accident investigations, an accident report form, a form to track the status of corrective actions, an employee error form, and a year-end summary form.  The program includes the review of past risk reduction measures and the training of the TDI operators in the use of the accident report forms.  The company¿s Lab/Chemist is responsible for managing this program.\n\nRisk Assessment\n\nCrest Foam Industries Incorporated completes a hazard analysis at least once every 5 years for the TDI system.  The hazard analysis involves reviewing equipment failure records and accident reports to identify possible causes of accidental releases of TDI using a \"what if' analysis or another accepted procedure.  The accident scenarios are then classified as major or minor, depending on the amount of TDI that could be released.  A possible major release is defined as one in which the quantity of TDI released would be five times the acute toxicity concentration.  Risk reduction measures are then developed.\n\nFor major releases, the risk reduction measures are evaluated by means of a risk assessment.  This involves estimating the extent, travel speed and concentration of the release using a dispersion analysis, if applicable, and then estimating the consequences on surrounding populations.  For minor releases, the risk"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50771,
      "SummaryText": "reduction measures are recommended based on an estimate of the reduction in probability or quantity of the release. The result of the hazard analysis is then summarized in a written report.\n\nEmergency Response\n\nA written emergency Response Plan has been prepared and includes the following elements:  a description of the TDI operations and their location; a list of emergency response equipment and their location; the name of the site emergency coordinator and alternates; organization charts identifying in-house emergency response teams, emergency response support from contract or mutual aid groups, and government responders to the emergency; a description of the site's emergency notification system; a description of on-site monitoring equipment for TDI; procedures to mitigate and control effects of a spill; procedures for first aid and medical treatment at off-site facilities; an evacuation plan for site personnel; and a plan for building re-entry. The program also includes training of the emergency response team, conducting evacuation drills, and evaluating personnel performance during evacuation drills.  The plan has been transmitted to the local fire department by the responsible manager and is incorporated into the community¿s response plan.\n\nRisk Management Program Audits\n\nAn audit of the plant's Risk Management Program is completed annually and a written report is prepared and reviewed by the responsible manager. Written procedures for conducting the audit have been developed and are implemented by our safety coordinator."
    }
  ]
}