{
  "FacilityID": 50832,
  "FacilityName": "Taft Manufacturing Company",
  "FacilityStr1": "19815 South Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "Taft",
  "FacilityState": "CA",
  "FacilityZipCode": "93268",
  "Facility4DigitZipExt": "1192",
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.144400",
  "FacilityLongDecDegs": "-119.237778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "LF",
  "FacilityURL": "www.bakerhughes.com",
  "FacilityEmailAddress": "Ryan.Fordyce@bakerpetrolite.com",
  "FacilityDUNS": 617641055,
  "ParentCompanyName": "Baker Hughes Corporation",
  "Company2Name": null,
  "CompanyDUNS": 174987909,
  "Company2DUNS": 0,
  "OperatorName": "Taft Manufacturing Company",
  "OperatorStr1": "P.O. Box 11192",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93389",
  "OperatorZipCodeExt": "1192",
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000099298",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-06-11 00:00:00",
  "SafetyInspectionBy": "Kern County Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-02-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-02-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-02-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-02-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 35.13664,
  "FRS_Long": -119.44851,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73797,
      "AltID": "Packaging and Storage",
      "FacilityID": 50832,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 97820,
          "ProcessID": 73797,
          "ChemicalID": 22,
          "Quantity": 1000000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 97821,
          "ProcessID": 73797,
          "ChemicalID": 129,
          "Quantity": 260000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 75569,
          "ProcessID": 73797,
          "NAICSCode": "32532",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 43275,
              "Process_NAICS_ID": 75569,
              "SafetyReviewDate": "2003-11-21 00:00:00",
              "PHA_Date": "2003-11-21 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-02-24 00:00:00",
              "TrainingReviewDate": "2003-03-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-06-14 00:00:00",
              "EquipmentInspectionDate": "2004-05-17 00:00:00",
              "EquipmentTested": "Hydrotesting Acrolein Skids and Cylinders",
              "ChangeMgmtDate": "2004-06-16 00:00:00",
              "ChangeMgmtReviewDate": "2004-02-19 00:00:00",
              "PreStartupReviewDate": "2004-02-17 00:00:00",
              "ComplianceAuditDate": "2004-06-16 00:00:00",
              "AuditCompletionDate": "2004-12-31 00:00:00",
              "IncidentInvestigationDate": "2004-06-12 00:00:00",
              "InvestigationChangeDate": "2005-06-30 00:00:00",
              "ParticipationPlansReviewDate": "2004-02-19 00:00:00",
              "HotWorkPermitReviewDate": "2004-02-19 00:00:00",
              "ContractorSafetyReviewDate": "2004-02-19 00:00:00",
              "ContractorSafetyEvalDate": "2004-06-03 00:00:00",
              "CBI_Flag": 0,
              "Description": "The packaging and storage process unit consists of acrolein storage in cylinders, skids, ISO containers and railcars and propylene in railcars.  There is also a cylinder/skid filling operation.  There exists a single PHA for this process and the production area.  This process is protected by firewater and foam monitors, hydrocarbon area detectors and acrolein detectors.  In addition the propylene railcars are protected with a deluge system.",
              "_chemicals": [
                {
                  "PrimaryKey": 63005,
                  "PreventionProgram3ID": 43275,
                  "ProcessChemicalID": 97820
                },
                {
                  "PrimaryKey": 63006,
                  "PreventionProgram3ID": 43275,
                  "ProcessChemicalID": 97821
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50832,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-02-26 00:00:00",
    "ERTrainingDate": "2004-05-13 00:00:00",
    "CoordinatingAgencyName": "State of CA EH&S Department",
    "CoordinatingAgencyPhone": "6618628700",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50832,
      "SummaryText": "Executive Summary\n\n\nThe Taft Manufacturing Company facility located in Taft, California is subject to the U.S. Environmental Protection Agency's Risk Management Program (RMP) for Accidental Release [40 CFR 68] because its Acrolein production, storage and loading process contains more than the threshold quantities of acrolein (CAS No. 107-02-8) and propylene (CAS No. 115-07-1). Acrolein is a toxic and flammable substance which is a liquid at ambient temperatures.  Propylene is a flammable substance which is a gas at ambient conditions, but is carefully stored under pressure as a liquid at the Taft Manufacturing Company.\n\nThe Taft Manufacturing Company uses air propylene and steam to produce specification-grade acrolein.  The raw materials are feed into a reactor with a catalyst that converts the propylene to acrolein.  The acrolein is separated from the other reactant by-products and residues in a series of quench columns, a stripper, and two distillation columns.  The acrolein is stored in three 1,000 gallon vessels and ultimately transferred to the railcar storage at the repackaging plant.\n\nA maximum inventory of XXXXXX lbs of propylene can be on site at any one time in railcar storage. Acrolein is stored in three 1,000 gallon process tanks and dedicated railcars. A maximum of XXXXXX lbs of acrolein can be in the process at anyone time, with up to XXXXXX lbs present in a single storage tank or vessel.\n\nThe Taft Manufacturing Company utilizes standard operating procedures, training, administrative and engineering controls, and other safety practices to assure that acrolein and propylene are handled in a safe manner. There has not been a fire, explosion, or release event at the facility plant in the last five years which has impacted people or property offsite.  Details of the facility's extensive prevention program are summarized in Section 3.0.\n\n\n1. Accidental Release Prevention and Emergency Response Facilities\n\nWe at the Taft Manufacturing Company are strongly co"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50832,
      "SummaryText": "mmitted to employee, public, and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.\n\n2. The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass the manufacturing and transfer of Acrolein, a chemical used in oilfield and agricultural applications, into bulk storage containers and then into transfer and shipping/dispenser containers.  We also rework and service the containers.\n\nThe regulated substance is used as a pesticide and algaecide. \n\n\n3.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA as well as the requirements of Ca. Code of Regulations , Title 19, Public Safety, Div. 2, Off. Of Emerg. Ser., Chapter 4.5 Ca. Accidental Release Prevention (CalARP) Program. A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification requirements.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information ? The Taft Manufacturing Company maintains a detailed record of safety information that describes chemical hazards, operating parameters, and equipment designs associated with all processes.\n\nProcess Hazard Analyses - Our facility conducts comprehensive studies to ensure that hazards associated with our processes are identified a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50832,
      "SummaryText": "nd controlled efficiently.  The methodology used to carry out these analyses is the HAZOP method.  The studies are undertaken by a team of qualified personnel with expertise in engineering, plant operations, and/or maintenance.  Employees are involved in making suggestions to improve the safety and environmental operation of their work environment.  The analyses are reviewed and revalidated at least every five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures - For the purposes of safely conducting activities within our covered processes, the Taft Manufacturing Company maintains written operating procedures.  These procedures address normal operations, including startup, shutdown, and emergency operations.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining ? The Taft Manufacturing Company has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. \n\nMechanical Integrity ? The Taft Manufacturing Company carries out well documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Baker Petrolite Corporation also participates in a quarterly leak detection and repair program.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are provided specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change - Written procedures are in place at the Taft Manufacturing Company to manage changes in process chemicals, technology, equipment, and procedures.  Process opera"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50832,
      "SummaryText": "tors, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and provided training to deal with the modification.\n\nPre-startup Safety Reviews - Pre-startup safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at the Taft Manufacturing Company.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.  There has been one significant change to our loading processes since 1985.  With the addition of the manufacturing plant in 2003 the facility developed a need for greater acrolein storage.  In 2004 the on-site storage will be changed from bulk ISO container to 17,300 gallon bulk railcars.  The railcars will be located in the same locations formerly occupied by the ISO containers and will be tied into the transfer and loading system with the same connections and equipment.  This additional storage is a significant step forward in that the manufacturing facility now has a greater buffer against production swings between seasons.\n\nCompliance Audits ? The Baker Petrolite Corporation (another Baker Hughes company) supports the Taft Manufacturing Company by conducting internal audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits of RMP covered processes are conducted at least every three years and any corrective actions required as a result of the audits are initiated in a safe and prompt manner.\n\nIncident Investigation ? The Taft Manufacturing Company promptly investigates any incident that has resulted in, or could have reasonably resulted in, a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the relea"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50832,
      "SummaryText": "se from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation ? The Taft Manufacturing Company truly believes that process safety management and accident prevention requires a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses.\n\nContractors - On occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The Taft Manufacturing Company has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are informed of all the procedures for emergency response should an accidental release of a regulated substance occur. Concurrently, contractors are required to provide full information including MSDS for any hazardous chemicals, processes or procedures they use to which our employees may be exposed\n\nIn addition to the activities outlined above, we recognize the hazard to operations represented to many operations in California by earthquakes by conducting daily and monthly documented structural integrity inspections of equipment used in Acrolein storage and transfer as well as all other piping systems on site.  In addition, an independent contractor, Furmanite F.E.I.P. conducts quarterly documented inspections of all site piping, couplings, and valves.  Handling and transfer of acrolein is conducted externally.  All piping and transfer systems were constructed in compliance state and federal codes and are so maintained.  The transfer and loading facility was constructed in 1985 and the manufacturing plant was completed in 2003 in c"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 50832,
      "SummaryText": "ompliance with the Uniform Building Code for Kern County.  All related permits and inspection documentation is on file with the Kern County Building Permitting Dept.\n\n4.    Five-year Accident History\nThe Taft Manufacturing Company has had an excellent record of preventing accidental releases over the last five years.  Due to our stringent release prevention policies, there have been no accidental releases of the RMP regulated substance over this period which resulted in a recordable injury to persons, or damage to property or the environment.\n\n5.   Emergency Response Plan\n\nThe Taft Manufacturing Company maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n6.   Planned Changes to Improve Safety\nThe Taft Manufacturing Company is committed to continuously improving the safety of our facility.  In order to reduce production fluctuations and the potential adverse impact on the manufacturing area of the plant, we are increasing our on-site storage capacity for produced acrolein.  In order to increase our storage capacity, we are replacing the ISO storage containers with railcars.  In addition to the increased storage volume, the railcars provide greater structural protection for the acrolein and a larger margin of safety during transfer operations.  We expect this change to be implemented by the third quarter of 2004."
    }
  ]
}