{
  "FacilityID": 50844,
  "FacilityName": "Tedia Company, Inc.",
  "FacilityStr1": "1000 Tedia Way",
  "FacilityStr2": null,
  "FacilityCity": "Fairfield",
  "FacilityState": "OH",
  "FacilityZipCode": "45014",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39017",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "39.348710",
  "FacilityLongDecDegs": "-084.522380",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.tedia.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 76784040,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tedia Company, Inc.",
  "OperatorStr1": "1000 Tedia Way",
  "OperatorStr2": null,
  "OperatorCity": "Fairfield",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45014",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Operational Excellence Manager",
  "FTE": 68,
  "OtherEPAFacilityID": "OHD076784040",
  "EPAFacilityID": "100000201505",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1409030683",
  "SafetyInspectionDate": "2006-12-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-02-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-02-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-02-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-02-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73811,
      "AltID": null,
      "FacilityID": 50844,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75583,
          "ProcessID": 73811,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 97835,
          "ProcessID": 73811,
          "ChemicalID": 4,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 4,
            "ChemicalName": "Chloroform  [Methane, trichloro-]",
            "CASNumber": "67-66-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 97836,
          "ProcessID": 73811,
          "ChemicalID": 92,
          "Quantity": 61000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 92,
            "ChemicalName": "Ethyl ether  [Ethane, 1,1'-oxybis-]",
            "CASNumber": "60-29-7",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 97837,
          "ProcessID": 73811,
          "ChemicalID": 125,
          "Quantity": 42000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597835,
          "ProcessID": 73811,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597836,
          "ProcessID": 73811,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 597837,
          "ProcessID": 73811,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50844,
      "SummaryText": "Tedia Company Inc. holds the individual safety and health of every employee of the highest importance.  In addition to complying with all Ohio and Federal safety codes and regulations, Tedia make all reasonable efforts to prevent work related injuries and illness.  To meet these ends, Tedia:\n?    Has established and is maintaining an employee Safety Team to represent all work groups.  Membership is rotating so that as many employees as possible will have an opportunity to participate in creating a safer workplace,  \n?    Schedules regular safety inspections are conducted to discover and correct unsafe conditions and work practices.  \n?    Investigates every accident, injury, and near miss, regardless of its severity, with the intent of preventing similar accidents or injuries in the future because accidents and injuries represent flaws in our work processes.\n?    Provides suitable personal protective equipment for all employees.  PPE is available at all times and is required to be worn for designated work tasks.  \n\nFor more than 30 years, Tedia has specialized in the manufacture of high-purity laboratory and industrial chemicals for our customers around the world.  Manufacturing over 500 solvents and acids in 12 grades (including HPLC, GC, Anhydrous, Pesticide, and Bio), Tedia provides extraordinary quality and the ability to customize purification to individual customers? requirements.  Tedia routinely handles quantities ranging from 100ml to bulk tankers.  UN rated packaging used to ship products includes standard fiber board boxes and more specialized items such as septum-sealed Anhydrosolv bottles and returnable stainless steel Recycletainers.\n\nThe chemicals at Tedia covered by the EPA?s Risk Management Program are chloroform, ethyl ether, and pentane.  The maximum quantities that can be stored on site are 180,000 pounds of chloroform, 61,000 pounds of ethyl ether, and 42,000 pounds of pentane.  These quantities are approximate values.  Chloroform is an EPA toxic; pentane i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50844,
      "SummaryText": "s a flammable; ethyl ether is a flammable.  Bulk quantities of these chemicals are received in tankers, which are connected to the site?s storage tanks for unloading.  These chemicals are distilled in batches ranging from 500 to 1500 gallons (the pentane is additionally treated with oleum) on site, and then stored on site in containers ranging from 100 mL to 204 L prior to shipping.  Inventory quantities are highly variable, sometimes dropping as low as 45% of the maximum intended inventory.  Although no single vessel may exceed the regulated quantity at a given time, there are enough of these vessels co-located that the regulated quantity could be exceeded in a single release.  These processes are Program 3 processes because public receptors are included within the greatest distance to endpoint indicated by the worst-case scenarios and the processes themselves fall under NAICS code 325199.\n\nIn addition to being subject to the EPA regulation, Tedia complies with OSHA PSM, as well as the RCRA and CERCLA requirements due to the large quantities of hazardous solvents distilled and stored on site.  \n\nTo meet these requirements and to ensure the safety of our employees, Tedia has, and continues to improve, a comprehensive prevention program.  All new employees receive a safety briefing before they enter the work areas.  The initial briefing is followed by in-depth training within 60-days of employment.  General Safety Rules, encompassing everything from safe lifting to proper PPE to spill cleanup procedures, are issued to all employees on their first day, and are emphasized throughout their daily work. Posters throughout the facility and bulletin board postings, including daily safety and housekeeping checks, are a constant reminder to employees of their responsibility in creating a safer workplace for everyone at Tedia.  As further incentive, a bonus is rewarded awarded to every employee when there are no injuries, reportable incidents, or fires each month.  More struct"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50844,
      "SummaryText": "ured safety involvement is effected through monthly safety meetings (for all employees) and the involvement of the Employee Safety Team in accident prevention activities. \n\nDue to Tedia?s high standard in safety, there have been no releases of the regulated substances during the past five years.  \n\nTedia Company Inc. submits annual reports to the Butler County LEPC and SERC (the State Emergency Response Commission) listing quantities of regulated chemicals.  All facilities that report to the Butler County LEPC in this manner are included in their emergency response plans.  As part of their annual training program, Fairfield Fire Department engine companies and paramedics participate in a familiarization tour of Tedia facilities.  Due to the large quantities of hazardous chemicals stored in its facilities, Tedia employees are not required to attempt to fight fires.   Employee responsibilities in the event of a fire are to safely shutdown all equipment where it can be done without jeopardizing their safety, to evacuate the building by the nearest exit, and to report to the designated rally point.  The alarm used in the Tedia production facility provides internal notification only.  In the event of a fire, the Fairfield Fire Department will be automatically notified whenever the emergency sprinkler system is activated.  As a means of preparing for such an emergency, biannual evacuation drills are held. \n\nTedia believes that its safety posture can always be improved and is involved in several programs to introduce new safety systems and update existing ones. Our efforts to excel extend into all facets of safety development. \n?    Training: Our Safety and Training Manager is complete the 30-hour OSHA course in General Industry Safety.  Monthly safety meetings will continue, as will the development of formal lesson plans and schedules for regulatory compliance training.\n?    New equipment and technology:  Fall protection equipment and apparatus for the Reactor Room and tanker l"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50844,
      "SummaryText": "oading and unloading are scheduled to be purchased this year, decreasing the risk of injury from falls.  A permanent system of transfer pipes will be installed, reducing the risk of spills on the dock in the tank trailer storage area.  To streamline Tedia processes and diminish the risk of operator error, automation is also being introduced.  Additional fans will be installed in the Reactor Room to further improve the air quality ventilation in the area.\n?    Organizational changes: The Safety Team has been established, and will take an increasingly active role as the year continues.  In addition, this team will be responsible for implementing the employee participation plans required under this act.  \n?    Participation:  Tedia is completing the 10 Step Plan with the Ohio Bureau of Workers? Compensation, with 5 steps scheduled for this year and five for next year.    As part of this plan, the Safety and Training Manager or the Manager of Administration will attend 3 courses offered by the Bureau for further training.  Because we value the safety of the community in which we live and work, Tedia has participated in the Greater Hamilton Safety Council since 2004. \n?    Plans: The interim Air Quality Management Plan is being updated quarterly.  Once data is available for the entire year, a final plan will be prepared by December.  A Consolidated Safety Management Plan incorporating all facets of the existing safety plans, from safe workplace habits to stress, security, and personal protective equipment, is projected to be in place by the close of 2007."
    }
  ]
}