{
  "FacilityID": 50948,
  "FacilityName": "Carter Lake Filter Plant",
  "FacilityStr1": "7100 West County Road 8E",
  "FacilityStr2": "6981 West County Road 8E",
  "FacilityCity": "Berthoud",
  "FacilityState": "CO",
  "FacilityZipCode": "80513",
  "Facility4DigitZipExt": "8963",
  "FacilityCountyFIPS": "08069",
  "LEPC": "Larimer County LEPC",
  "FacilityLatDecDegs": "40.323611",
  "FacilityLongDecDegs": "-105.206389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 877221507,
  "ParentCompanyName": "Little Thompson Water District",
  "Company2Name": "Central Weld County Water District",
  "CompanyDUNS": 165001546,
  "Company2DUNS": 92774025,
  "OperatorName": "Carter Lake Filter Plant",
  "OperatorStr1": "7100 West County Road 8E",
  "OperatorStr2": null,
  "OperatorCity": "Berthoud",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80513",
  "OperatorZipCodeExt": "8963",
  "RMPContact": "Mark Maddox",
  "RMPTitle": "Plant Manager",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000153273",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-07-29 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-02-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-02-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-02-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-02-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 40.32112,
  "FRS_Long": -105.20792,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73987,
      "AltID": "chlorine",
      "FacilityID": 50948,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75764,
          "ProcessID": 73987,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 98037,
          "ProcessID": 73987,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 598037,
          "ProcessID": 73987,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50948,
      "SummaryText": "RMP EXECUTIVE SUMMARY\n\nThis is the Risk Management Plan (RMP) executive summary for the Carter Lake Filter Plant (CLFP) located in Berthoud, Colorado.   The North Plant facility is under construction and should be completed in March or April 2008.  Once the North Plant facility is operational, it will have all the EPA?s RMP regulatory procedures in place.\n\nINTRODUCTION\n\nThe management of the CLFP is committed to employee, public, and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  However, if such a release does occur, CLFP will coordinate with the Berthoud Fire District, which provides trained emergency response personnel to control and mitigate the effects of a release.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe CLFP has one regulated substance present at its facility, chlorine. The maximum inventory of chlorine at the CLFP facility is 28,000 pounds (lbs).\n\nMANAGEMENT SYSTEM \nThe EPA?s RMP regulations require that a qualified person or position be designated with the overall responsibility for the development, implementation, and integration of the RMP elements.  In addition, if responsibility is assigned to people or positions other than the person or position with overall responsibility for the RMP, the names of people or positions are defined in an organizational chart or other similar documentation.\n\nHAZARD ASSESSMENT \n\nTo perform the required offsite consequence analysis for the CLFP facility, we have used the EPA?s RMP COMP 2004?  program was used. The following paragraphs provide details of the chosen scenarios.  \n\nToxic Worst-case Scenario \n\nThe worst-case scenario involves a catastrophic release from the North Plant or Sou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50948,
      "SummaryText": "th Plant chlorine storage room.  The scenario involves the release of 2,000 pounds (lbs) of gaseous chlorine for ten minutes (min).  The release rate (lbs/min) is calculated to be 200 lbs/min.  A distance to the endpoint of 2.2 miles is obtained, which affects a residential population of approximately 500 people within this distance.  \n\n\n\nAlternative-case Scenario\n\nThe alternative-case scenario involves a release from the North Plant or South Plant chlorine storage room.  The scenario involves the release of 2, 000 lbs of chlorine in a gaseous for 50 minutes.  The release rate (lbs/min) is calculated to be  40 lbs/min, and a distance to the endpoint of 0.2 miles is obtained which affects a residential population of approximately seven people within this distance. \n\nFLAMMABLE WORST-CASE ANALYSIS\n\nNot applicable\n\nFLAMMABLE ALTERNATIVE-CASE ANALYSIS\n\nNot applicable\n\nPREVENTION PROGRAM\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA?s RMP regulations.  The following sections briefly describe the elements of the release prevention program that are in place at the stationary source.\n\nProcess Safety Information\nThe CLFP maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.  \n\nHazard Review \nThe CLFP?s safety committee conducts a hazard review to identify, evaluate, and control the risk associated with substances, processes, and procedures for regulated processes.   The EPA?s RMP regulations require that the hazard review will be updated at least once every five years, or whenever a major change in the process occurs.    \n\nStandard Operating Procedures\nFor the purposes of safely conducting activities related to the covered process, the CLFP maintains written standard operating procedures.  These procedures address various modes of operation such as initial start-up, no"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50948,
      "SummaryText": "rmal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and start-up after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved with the process. \n\nTraining\nThe CLFP has a training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with the process.  New employees receive initial training in process operations followed by on-the-job supervision until they are deemed competent to work independently.   Refresher training is provided at least every three years or more frequently if needed. \n\n\nMaintenance \nThe CLFP has a maintenance program which includes maintenance checks on process equipment to ensure proper functions.   Maintenance operations are carried out by qualified personnel with training in maintenance practices.  Any equipment deficiencies identified during a maintenance check are corrected in a safe and timely manner. \n\nCompliance Audits\nThe CLFP conducts internal audits to determine whether the provisions set our under the EPA?s RMP rule are being implemented.  The last compliance audit was completed on December 3, 2007.  \nIncident Investigations\nThe CLFP has procedures in place to promptly investigate any incident that has resulted in or could reasonably result in a catastrophic release of a regulated substance.  Investigation are completed by the Safety Committee to identify the situation leading to the incident, and corrective actions to prevent the release from reoccurring. \n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe CLFP has had no accidental releases of chlorine in the past five years.  \n\nEMERGENCY RESPONSE PLAN\n\nThe CLFP facility has its own emergency response plan (ERP).  The ERP includes specific actions to be taken in response to accidental releases of regulated substances.  The ERP also includes a public media relation policy.  The Berthoud Fire Department is the first responder to any chlorine e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50948,
      "SummaryText": "mergencies.  The Berthoud Fire Department can request a hazardous material team for appropriate support in an emergency. \n\nRMP PROGRAM\n\nThe CLFP  updated its RMP in November and December 2007.  The facility  will continue to refine its preventative maintenance program, standard operating procedures, maintenance, and training program."
    }
  ]
}