{
  "FacilityID": 50949,
  "FacilityName": "Voltaix LLC",
  "FacilityStr1": "197 Meister Avenue",
  "FacilityStr2": null,
  "FacilityCity": "North Branch",
  "FacilityState": "NJ",
  "FacilityZipCode": "08876",
  "Facility4DigitZipExt": "6022",
  "FacilityCountyFIPS": "34035",
  "LEPC": "Branchburg Twp LEPC",
  "FacilityLatDecDegs": "40.605745",
  "FacilityLongDecDegs": "-074.715119",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.voltaix.com",
  "FacilityEmailAddress": "info@voltaix.com",
  "FacilityDUNS": 173293994,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "John de Neufville",
  "OperatorStr1": "197 Meister Avenue",
  "OperatorStr2": null,
  "OperatorCity": "North Branch",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08876",
  "OperatorZipCodeExt": "6022",
  "RMPContact": "Joe Szulczewski",
  "RMPTitle": "Safety Administrator",
  "FTE": 65,
  "OtherEPAFacilityID": "NJD173293994",
  "EPAFacilityID": "100000193471",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-02-05 00:00:00",
  "SafetyInspectionBy": "Branchburg Bureau of Fire Prevention",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-02-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-02-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-02-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-08-23 00:00:00",
  "DeRegistrationEffectiveDate": "2016-06-23 00:00:00",
  "AnniversaryDate": "2010-10-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 73988,
      "AltID": "Diborane Manufacturing",
      "FacilityID": 50949,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75765,
          "ProcessID": 73988,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 98038,
          "ProcessID": 73988,
          "ChemicalID": 76,
          "Quantity": 330.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 76,
            "ChemicalName": "Diborane",
            "CASNumber": "19287-45-7",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 98039,
          "ProcessID": 73988,
          "ChemicalID": 52,
          "Quantity": 350.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 52,
            "ChemicalName": "Boron trifluoride  [Borane, trifluoro-]",
            "CASNumber": "7637-07-2",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 598038,
          "ProcessID": 73988,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 598039,
          "ProcessID": 73988,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 73989,
      "AltID": "BF3 Storage",
      "FacilityID": 50949,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 75766,
          "ProcessID": 73989,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 98040,
          "ProcessID": 73989,
          "ChemicalID": 52,
          "Quantity": 2750.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 52,
            "ChemicalName": "Boron trifluoride  [Borane, trifluoro-]",
            "CASNumber": "7637-07-2",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 598040,
          "ProcessID": 73989,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50949,
      "SummaryText": "Executive Summary Voltaix Inc.                   TCPA ID# 5382\n\nIntroduction and \"The stationary source and regulated substances handled\"\nVoltaix, Inc. manufactures a portfolio of products which are used in chemical vapor deposition (CVD) and in ion implantation processes for manufacturing silicon-based semiconductor devices.  Voltaix gases are used in improving semiconductor performanve. One of the gases used for silicon chip manufacturing is diborane.  Voltaix utilizes a patented \"dry\" process, meaning that no organic solvents are used in manufacturing diborane.  Using in-house purification and distillation techniques the diborane is further purified to yield an ultra high purity product.  The current Voltaix diborane product has very low levels of hydrocarbons, carbon dioxide and higher borane impurities.  Using similar purification and distillation techniques, Voltaix purifies outsourced high purity boron trifluoride to yield an ultra high purity grade product.  Inventories of diborane and boron trifluoride are closely monitored..\n\n\"The accidental release prevention and emergency response policies at the stationary source\"\n\nVoltaix handles a variety of hazardous materials including gases liquids and solids, that might be any combination of toxic, flammable, air or moisture sensitive, corrosive, or a compressed gas.  Handling these materials requires a high degree of awareness of their hazards as well as training in the appropriate, safe-handling procedures.\nVoltaix's approach to chemical safety is an integral part of our general safety policy which is to operate our facilities in a safe and responsible manner.  This includes incorporating and adhering to all applicable Federal, State and Local regulations.  In addition, we incorporate, to the best of our knowledge and ability, all appropriate safe practices guidelines for our industry, including but not limited to; the Chemical Manufacturer's Association, the Compressed Gas Association and the Semiconductor Equi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50949,
      "SummaryText": "pment and Materials Institute.\nVoltaix's safety policy includes the following sections: a) Commitment, b) Safety is first and foremost, c) Safety is for everyone, d) Training, e) Incident Reporting, f) Housekeeping, g) Communication, h) New Process Safety and g) Responsibility.  It is the intent of this policy to provide a safe workplace.  The basis of safety is training.  Each new employee is instructed in the basic Voltaix Safety Procedures when hired.  When assigned to a new job each employee is instructed in both the operation itself and the necessary precautions.  No employee at Voltaix is permitted to perform any process operation until they have been trained and deemed fully competent for that task. For all procedures, employees are protected from potential hazards by the use of proper personal protective equipment (PPE), equaling or exceeding the required under CFR 29 (OSHA).  Safety meetings are conducted regularly and attendance by all personnel is mandatory.  During these meetings, any incidents, defined very broadly and normally consisting of \"near miss\" incidents - those abnormal situations which could conceivably have resulted in injury or property damage under other circumstances, which may have occurred since the last safety meeting, are reviewed by all.  Employees are encouraged to participate in general discussions and dissemination of information.  These safety meetings are also used to present and review safety practices, new technologies, improved safety measures, existing practices and procedures.  \n\n\"The general accidental release prevention program and chemical-specific prevention steps\"\nThe diborane manufacturing operations are located in Class HI space for manufacturing (BOCA 1990).  The building foundation is designed in accordance with ACI 301 Specifications for Structural Concrete for Buildings (use group H-2 and H-4).  This space has a four-hour firewall for all internal walls with explosion venting in the ceiling (i.e., the roof).  The"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50949,
      "SummaryText": " facility is equipped with fire sprinklers and gas monitors.  Outside gas storage pad is protected by padlocks, fencing and barbed- wire and is equipped with a sprinkler system and gas monitoring system.  The fire system, gas detection system and intrusion alarms are continuously monitored at a remote central station.  \n \nAll unloading and loading of cylinders from trucks is performed at an isolated loading dock in the connected building immediately adjacent to the manufacturing area.  In the event of a power failure an emergency generator provides backup power to the entire facility.  Diborane cylinders are packed with dry ice during storage, which will maintain temperatures for up to 2 days in the event of power failure or damage to the mechanical refrigeration equipment.  Boron trifluoride is stored in a HAZBIN, a separately sprinkled, four-hour fire rated enclosure within the warehouse, equipped with a gas monitor interlock and connected to an automated scrubber.  Emergency backup lighting is provided.  Process vents, pressure relief valves, and EHS storage room vents are piped to scrubber systems.  The scrubber systems are designed to handle each concentration and quantity at the capacity determined to be the largest release - before breakthrough - based on the hazard analysis and risk assessment performed for that operation.  A gas detector is provided for diborane and boron trifluoride in various locations, primarily in the exhaust ducting and operator work area.  The alarm system is monitored continuously at a remote central station. \n\n\"The emergency response program\"\n\nAny incident, which may lead to a chemical spill, gas leak or fire, is considered to be an emergency requiring an immediate response.  The size and type of an emergency determine the nature and extent of the response.  Voltaix has an emergency response plan and emergency response team on site.  The emergency response plan was designed using the following guidelines: NFPA 471 (Recommended Pract"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50949,
      "SummaryText": "ices for Responding to Hazardous Materials Incidents), NFPA 472 Standard for Competence of Responders to Hazardous Materials Incidents), CFR 1910:120 (OSHA, Hazardous Waste Operations and Emergency Response) and N.J.A.C.7:71 (New Jersey Toxic Catastrophe Prevention Act).  Elements of the emergency response plan include a) Pre-emergency planning b) Training drills, c) An emergency notification system, d) Documentation of possible scenario response, e) First - aid, f) Portable gas detectors, g) Outside communication, h) Arrangements with Local Agencies (including LEPC), i) Re-entry and site recovery.  Voltaix also participates in an informal arrangement between four specialty gas companies in nearby Bucks County Pennsylvania involving cross training in emergency response procedures.  Voltaix is also a member of COMPGEAP, Compressed Gas Emergency Action Plan, which is a voluntary mutual aid network of compressed gas producers coordinated by the Compressed Gas Association, established for cooperative responses to transportation emergencies.   \nVoltaix is in frequent contact with several local agencies and officials.  The Local Emergency Planning Committee is provided with copies of the Voltaix Emergency Response Plan.  The Committee is invited to each of the Voltaix Emergency Drills.  The North Branch Volunteer Fire Company and the Branchburg Police Department have been provided with copies of Voltaix's Community Right-to-Know filing which lists the materials in the facility and their locations and the Voltaix Emergency Response Plan.  Voltaix is inspected annually by the Branchburg Township Fire Official, and regularly by the NJDEP under the TCPA and NJCRTK Programs. \n\n\"Planned changes to improve safety\"\n\nAt Voltaix improved safety is a constant and on-going endeavor.  Voltaix has added both senior and mid-level staff in the engineering and regulatory management areas.   As Voltaix continues to grow, process and safety improvements will include more automated process c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50949,
      "SummaryText": "ontrol strategies and safety interlocks, reducing the likelihood of human errors.\n\n\n\n\n\n\n\"The five-year accident history\" \nDuring the last 5-year accident history there have been no reportable accidents with diborane or boron trifluoride."
    }
  ]
}