{
  "FacilityID": 5097,
  "FacilityName": "Topeka KS - N. Topeka Waste Water Treatment Plant",
  "FacilityStr1": "1600 NW Button Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Topeka",
  "FacilityState": "KS",
  "FacilityZipCode": "66618",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20177",
  "LEPC": "Shawnee County LEPC",
  "FacilityLatDecDegs": "39.0765",
  "FacilityLongDecDegs": "-95.701917",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "topeka.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Topeka, WPCD",
  "OperatorStr1": "1115 NE Poplar",
  "OperatorStr2": null,
  "OperatorCity": "Topeka",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66616",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": "KS0042714",
  "EPAFacilityID": "100000062825",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-10-15 00:00:00",
  "DeRegistrationEffectiveDate": "1999-08-15 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.0765,
  "FRS_Long": -95.701917,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 5985,
      "AltID": "Chlorine",
      "FacilityID": 5097,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6507,
          "ProcessID": 5985,
          "ChemicalID": 62,
          "Quantity": 60000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6131,
          "ProcessID": 5985,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3178,
              "Process_NAICS_ID": 6131,
              "SafetyReviewDate": "1999-06-21 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-01 00:00:00",
              "ChangeCompletionDate": "1999-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-21 00:00:00",
              "TrainingReviewDate": "1999-06-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-21 00:00:00",
              "EquipmentInspectionDate": "1999-05-01 00:00:00",
              "EquipmentTested": "Chlorine gas detector - see CMMS system for documentation",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3264,
                  "PreventionProgram2ID": 3178,
                  "ProcessChemicalID": 6507
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "ProcessID": 5986,
      "AltID": "sulfur dioxide",
      "FacilityID": 5097,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6508,
          "ProcessID": 5986,
          "ChemicalID": 49,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6132,
          "ProcessID": 5986,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5097,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-21 00:00:00",
    "ERTrainingDate": "1999-06-21 00:00:00",
    "CoordinatingAgencyName": "Shawnee County Department of Emerg",
    "CoordinatingAgencyPhone": "7852338300",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5097,
      "SummaryText": "Executive Summary \n\nAccidental Release Prevention and Emergency Response Policies\nThe North Topeka Wastewater Treatment Plant (North Topeka WWTP), located at 1600 Button Road in Topeka, Kansas, prevents accidental releases of chlorine and sulfur dioxide by training and adhering to industrial and applicable codes and implementing good engineering practices.  North Topeka WWTP's prevention program, safety information, hazard reviews, operating procedures, training, maintenance, compliance audits, and incident investigation procedures are continuously updated.  Every employee of the North Topeka WWTP is trained to be aware of the potential for chlorine and sulfur dioxide releases and disturbance of the systems.  \n\nIn an emergency, the North Topeka WWTP's first consideration is the safety of personnel and the community.  The second consideration is the protection of property, equipment, and the facility.  The North Topeka WWTP maintains emergency response procedures that allow North Topeka WWTP personnel and the local fire department to respond to releases.  The North Topeka WWTP has a HazMat Response Team that can assist the fire department and provide operational support as required. If required, the fire department coordinates the emergency response with other local emergency response organizations per the Emergency Action and Response Plan.\n\nAll employees are trained to recognize releases of chlorine or sulfur dioxide and to activate the emergency response procedures as required.  The HazMat Response Team receives additional training to enable them to respond to releases of chlorine and sulfur dioxide.\n\nThe North Topeka WWTP: Chlorine and Sulfur Dioxide\nThe plant uses chlorine and sulfur dioxide to disinfect wastewater effluent.  The North Topeka WWTP has the capacity to store 60,000 pounds of chlorine and 10,000 pounds of sulfur dioxide.  Since these quantities exceed the Risk Management Plan (RMP) thresholds for toxic substances, they must be addressed in the RMP"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5097,
      "SummaryText": ".  The North Topeka WWTP does not store or use any other RMP regulated substances above threshold quantities that are regulated by the Environmental Protection Agency (EPA) through 40 Code of Federal Regulations (CFR) Part 68. \n\nOffsite Consequence Analysis\nModels and Guidance\nRegulation 40 CFR Part 68.25 allows for the use of publicly available techniques that account for specified modeling conditions and are recognized by industry as current practice.  For the worst-case release scenario, the Risk Management Program Guidance for Wastewater Treatment Plants, created by the United States Environmental Protection Agency (EPA) Office of Solid Waste and Emergency Response, was used. RMP*Comp, developed by the National Oceanic and Atmospheric Administration (NOAA) and EPA, was used to model the alternative release scenario. Credit for passive and active mitigation devices such as containment and scrubbers were included in the alternative release scenario modeling using RMP*Comp.  Both guidance documents are appropriate models because they are well documented, publicly available, and recognized by the wastewater treatment industry as applicable modeling tools. \n\fWorst-Case Release Scenario\nFor regulated toxic substances that are normally gas at ambient temperature, but stored as a liquid under pressure, EPA requires the worst-case release scenario to involve the release of the greatest amount of that substance held in a single vessel.  The regulations require that the release occurs within a ten-minute time period and takes into account wind speed, atmospheric stability conditions, elevation of the release, and gas density (either a dense or a buoyant gas).  The analysis considered a wind speed of 1.5 meters per second and F atmospheric stability.  The release occurred at ground level (0 feet) with rural topography surface roughness.  To account for gas density in the dispersion analysis, chlorine and sulfur dioxide were considered dense gases. \n\nA catastrophic scenario"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5097,
      "SummaryText": "of the 1-ton container is a 2,000-pound release at a rate of 200 pounds per minute.  The distance to the endpoint is 3.0 miles for chlorine and 3.1 miles for sulfur dioxide.  Since 3.1 miles is greater than the distance for chlorine, a release of a sulfur dioxide 1-ton container is North Topeka WWTP's worst-case release scenario.\n\nAlternative Release Scenario\nSince alternative release scenarios are more likely to occur than the worst-case scenarios, these scenarios are more suitable in emergency planning.  Based on the five-year accident history, the North Topeka WWTP site has not had a release of chlorine or sulfur dioxide that has migrated off the plant boundaries.\n\nThe alternative scenarios for chlorine and sulfur dioxide are process piping releases from a failure at a flange, joint, weld, valve and valve seals, and drains or bleeds.  The scenarios results in a gas release through the 5/16-inch-diameter openings.  The 30-minute releases have rates of 0.242 and 0.156 pounds per minute for chlorine and sulfur dioxide, respectively.  The scrubber is assumed to actively mitigate 99% of the release.  Using RMP*Comp, the estimated distances to the endpoint is 0.1 miles for both chlorine and sulfur dioxide.  \n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\nNorth Topeka WWTP's prevention program consists of safety information, hazard reviews, operating procedures (Standard Operating Procedures), training, maintenance, compliance audits, and incident investigations.\n\nTo prevent releases, the North Topeka WWTP compiled chlorine and sulfur dioxide safety information, including:  Material Safety Data Sheets (MSDS); maximum intended inventory; safe upper and lower temperatures, pressures, and flows; equipment specifications; and codes and standards used to design, build, and operate the chlorine and sulfur dioxide systems. \n\nA hazard review was conducted for the chlorine and sulfur dioxide systems.  The hazard review team consisted of plant manag"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5097,
      "SummaryText": "ement, process operation and maintenance personnel, and consulting process design engineers.  The team analyzed the hazards associated with the chlorine and sulfur dioxide processes using the what-if technique.  The hazard review team documented recommendations and set a schedule for implementation.\n\nThe North Topeka WWTP has adopted written Standard Operating Procedures (SOPs) that provide system descriptions, specifications, and operating procedures for the chlorine and sulfur dioxide systems.  The North Topeka WWTP Operations and Maintenance Manual provides procedures for operating scenarios including equipment startup, normal operations, normal and emergency shutdown, inspections, trouble-shooting trees, temporary operation, restartup, and consequences of deviation.  \n\nThe North Topeka WWTP has a training program with guidelines for conducting regular, structured plant training for employees, including operators and maintenance personnel.  Records of the training program, including content of the course, course manual, examination, and record of attendance are maintained.   \n\nIn-house and out-sourced maintenance personnel perform preventative maintenance, inspection, and equipment testing to ensure safe operations at the North Topeka WWTP.  The North Topeka WWTP uses a computerized maintenance management system (CMMS) to schedule, track, and document preventative and corrective maintenance activities. The CMMS infrastructure management system is a work order based system that generates work orders for preventive and corrective maintenance activities, and allows for organization and documentation of inventory, labor, materials, equipment, and contract management expenses. \n\nThe compliance audit process will be performed at least once every three years to ensure that the RMP procedures and practices are adequate and being followed.  To complete a compliance audit, the North Topeka WWTP must demonstrate that documentation, employees' knowledge (interviews), and the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5097,
      "SummaryText": "physical facility (through inspection) comply with 40 CFR Part 68.\n\nThe RMP incident investigation program outlines the RMP investigation process.  If the chlorine or sulfur dioxide incident is reportable, the employee completes an Incident Report form.  An Incident Investigation Team investigates how the incident occurred and determines whether errors can be corrected by instituting safeguards for the process or whether employees need additional training.  The Supervisor of Plant Operations and Maintenance - on the advice of the Incident Investigation Team -  will promptly implement corrective actions.  This information will be entered on the RMP Incident Report Form and Summary and signed by the Supervisor of Plant Operations and Maintenance.\n\nThe Five-Year Accident History\nThe five-year accident history must include releases from regulated processes that resulted in deaths, injuries, damage on site; or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  In the past five years, no releases resulted in an injury related to a regulated toxic substance at North Topeka WWTP.\n\nEmergency Response Program\nIn a release, the North Topeka WWTP would use the City of Topeka, Water Pollution Control Comprehensive Safety Program Manual - Emergency Action and Response Plans.  The Water Pollution Control Division has a HazMat Response Team to respond to releases or potential releases of hazardous substances for the purpose of stopping the release.  This team approaches the point of release to plug, patch, or otherwise stop the release of the hazardous substance. \n\nIn case of an emergency, the local fire department would be notified, followed by members of the Water Pollution Control Division Hazmat Response Team. The fire department would assume the responsibility of the Incident Command System and provide the Incident Control Commander. Members of the Hazmat Response Team would function under the Incident Control Commande"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5097,
      "SummaryText": "r and provide the operational support. Notification procedures are outlined in the Emergency Action and Response Plan and  will be initiated by the Incident Control Commander. After initial site assessment, the Control Commander would notify and coordinate emergency response with other local emergency response organizations such as the police department and the Shawnee County Department of Emergency Management if necessary. These organizations would also notify the public, if necessary.\n\nPlanned Changes to Improve Safety\nTo improve safety, the North Topeka WWTP made changes based on the Hazard Review conducted for the chlorine and sulfur dioxide systems.  The review prompted a list of recommendations that were implemented.  The most significant change to improve safety include:\n\n\t \tAdd to the preventative maintenance program.\n\t \tAdd visual inspection of the Chlorine/Sulfur Dioxide Building to operators' day-shift duties.\n\t \tInvestigate locking the Chlorine/Sulfur Dioxide Building doors for increased security.\n\t \tInvestigate an audible alarm on the SCADA system.\n\t \tCheck with legal department to determine if contractor training requirements need to be incorporated into contracts.\n\t \tMake minor changes to Standard Operating Procedures.\n\t \tNotify personnel, by memo, email, or bulletin board message, when a chlorine or sulfur dioxide delivery is scheduled.\n\t \tForm a plan to handle monorail failure with container suspended and incorporate into training."
    }
  ]
}