{
  "FacilityID": 50981,
  "FacilityName": "EP Newington Energy, LLC",
  "FacilityStr1": "200 Shattuck Way",
  "FacilityStr2": null,
  "FacilityCity": "Newington",
  "FacilityState": "NH",
  "FacilityZipCode": "03801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33015",
  "LEPC": "Newington LEPC",
  "FacilityLatDecDegs": "43.105000",
  "FacilityLongDecDegs": "-070.806944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Essential Power, LLC",
  "Company2Name": null,
  "CompanyDUNS": 119341845,
  "Company2DUNS": 0,
  "OperatorName": "EP Newington Energy, LLC",
  "OperatorStr1": "200 Shattuck Way",
  "OperatorStr2": null,
  "OperatorCity": "Newington",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03801",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000180546",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "TV-0058",
  "SafetyInspectionDate": "2011-04-20 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-03-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-02-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-02-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-02-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 43.105,
  "FRS_Long": -70.80694,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 74024,
      "AltID": "NH3 for NOx Reduction",
      "FacilityID": 50981,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 98082,
          "ProcessID": 74024,
          "ChemicalID": 56,
          "Quantity": 17700.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 75801,
          "ProcessID": 74024,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 43400,
              "Process_NAICS_ID": 75801,
              "SafetyReviewDate": "2007-12-31 00:00:00",
              "PHA_Date": "2007-05-08 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-12-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "handheld direct reading instruments and colormetric detector tubes",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Administrative changes",
              "OpProceduresReviewDate": "2011-12-01 00:00:00",
              "TrainingReviewDate": "2011-06-22 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-03-31 00:00:00",
              "EquipmentInspectionDate": "2011-04-01 00:00:00",
              "EquipmentTested": "Valves, gauges, tanks, deluge system, vaporizer, heaters, blowers, controls, and alarms.",
              "ChangeMgmtDate": "2011-11-14 00:00:00",
              "ChangeMgmtReviewDate": "2010-12-22 00:00:00",
              "PreStartupReviewDate": "2011-11-21 00:00:00",
              "ComplianceAuditDate": "2011-04-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-05-08 00:00:00",
              "HotWorkPermitReviewDate": "2007-05-08 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "System Overview\n\n\n\nThe anhydrous ammonia system provides storage, vaporization, transfer, and injection control facilities for the ammonia gas to support the selective catalytic reduction system (SCR) in the heat recovery steam generator (HRSG).  The application of Selective Catalytic NOx Reduction Technology (the process) reduces nitrogen oxide air emissions from the station.  There are two HRSG's in the plant, designated as Train 1 and Train 2.  Each HRSG has its own dedicated anhydrous ammonia storage and delivery system.  The system description below pertains to the Train 1 design and operation.  The Train 2 system design and operation is identical to Train 1.\n\n\n\nAmmonia Storage Vessel\n\n\n\nEach of the two ammonia storage and supply systems includes a 2,000-gallon horizontal, cylindrical, pressure vessel for storing liquefied anhydrous ammonia.  The storage vessel is sized to provide approximately 2.5 days of continuous supply of ammonia at the design usage rate of 144 lbs/hr for NOx reduction to 9 ppmv based on a 24-hour per day operation of No. 2 Fuel Oil at -10?F in the GTG.  When the GTG is firing with natural gas, the vessel has approximately 10-14 days of storage.  The vessel is mechanically rated for 265 psig at 170?F.  The level in the vessel is administratively controlled to a maximum of 82% level, equivalent to 1,715 gallons.  The maximum intended site inventory of ammonia is therefore 3,430 gallons (17,700 pounds) in total for the two ammonia storage vessels.\n\n\n\nAnhydrous ammonia is supplied by tanker truck through a liquid fill connection.  This connection is supported by a bulkhead containment wall designed to withstand the force arising from a tanker truck pulling away while still connected.  An emergency shut-off valve is also provided at both the liquid fill and vapor return line to allow quick shut-off of liquid and vapor flow in the event that there is an accidental pull-away of a truck or a hose rupture.  Ammonia is stored in a liquid state in equilibrium with its vapor at saturation conditions in a pressurized vessel.  The vessel is maintained at approximately 100 psig and 64?F by an electric vaporizer under drum pressure control via a PID loop controller (1CI-PIC-1570) modulating the heat input to the ammonia vaporizer.  \n\n\n\nThe ammonia storage vessel temperature is monitored through the local indicator (1CI-TI-1570).  The level in the vessel is monitored through the local gauge (1CI-LI-1571), and remotely through the DCS (1CI-LI-1570).  A local level indicator (1CI-LI-1570A) and a local horn for high level alarm (1CI-LAH-1570) are also provided at the truck unloading station.  The ammonia tank pressure is indicated through a local gauge (1CI-PI-1571) and remotely through the DCS (1CI-PI-1570).  A high pressure switch (1CI-PSH-1572) will shut-off the vaporizer if the drum pressure increases to 165 psig.   The tank is supplied with a dual pressure relief valve set at 265 psig; excess flow valves at all fluid flow nozzles; and thermal relief valves set at 325 to 350 psig on associated liquid ammonia lines.  \n\n\n\nIn Fall of 2007, ammonia liquid crossover piping was installed to connect the two individual storage tanks.  The piping and associated manual valves facilitate the transfer of liquid ammonia between tanks.  The addition of the piping minimizes the need to remove large amounts of liquid ammonia from the system in order to prepare for maintenance activities. \n\n\n\nIn December of 2011, ammonia vapor crossover piping was installed.  The piping ties together the two ammonia vapor headers that are routed to each individual ammonia/air dilution skid and SCR.  The piping allows complete isolation of an individual storage tank while operating both SCR's from one storage tank and vaporizer.  However, due to the process design of the ammonia vaporizers, this operation is only possible while operating the facility on natural gas.  A single vaporizer is not designed sufficiently to supply both SCR's at base load operation.  \n\n\n\nAmmonia Vaporizer\n\n\n\nThe ammonia vessel is kept at the desired operating pressure of 100 psig by an electric vaporizer via a local PID loop pressure controller (1CI-PIC-1570).  Liquid anhydrous ammonia is vaporized by direct contact with the heating element.  The liquid ammonia feed line to the vaporizer is protected from over pressure at blocked in condition by a thermal relief valve (1CI-PSV-1582) set at 350 psig.  The ammonia vapor is piped back via the vapor line into the storage vessel.  The vapor from the vessel is then sent to the dilution air and injection control skid.  A remote pressure controller (1CI-PC-1573) set at 50 psig is provided on the vapor line to ensure a constant feed pressure to the dilution air system.  A high temperature cut-off switch (1CI-TSH-1571) is provided to shut-down the vaporizer if the heating element is in excess of 200?F.\n\n\n\nAmmonia Dilution Air and Injection Control Skid\n\n\n\nA dilution air and injection control skid is supplied for each HRSG to support the operation of the associated SCR system.  The skid consists of 100%-spare Dilution Air Blowers (1CI-BLR-1001A/B), Dilution Air Heaters (1CI-HTR-1001A/B), Ammonia/Air Mixer (1CI-MIX-1001), Ammonia Filter (1CI-FLT-1001) and Ammonia Accumulator (1CI-ACC-1001).\n\n\n\nAmmonia vapor is fed from the storage vessel to the dilution air and injection control skid under constant pressure control (1CI-PC-1573) set at 50 psig.  The ammonia injection rate is regulated via corresponding flow valves (1CI-FV-1600A [for oil operation] and -1600B [for natural gas operation]) under its respective flow controller (1CI-FC-1600).  The controller is reset by a function block (1CI-FY-1600) that automatically calculates the required ammonia injection rate to achieve the required NOx reduction depending on the GTG load and fuel type, as well as the firing rate of the HRSG duct burner.  The function block (1CI-FF-1601) receives the GTG exhaust gas calculated inlet NOx concentration signal (1GT-AI-1000) from the GTG MARK V control system.  This function block also receives a calculated inlet NOx signal for the duct burner from the DCS via 1FG-FI-1802, 1CI-AY-1535 and 1CI-AI-1535.  The signal from 1CI-FF-1601 is sent to 1CI-FY-1600 and acts as a feedforward signal to rapidly adjust the ammonia flow valve to follow changes in load.  The ammonia flow is trimmed via a feedback signal (1CI-FF-1600, 1HR-AI-1513 & 1HR-AI-1533) from the exhaust NOx analyzer (1HR-AIT-1513) located at the stack.  Depending on the GTG fuel type, the NOx outlet analyzer indicator in the DCS is 1HR-AI-1513 for GTG firing with fuel oil and 1HR-AI-1533 for GTG firing with fuel gas.  The combined feedforward and feedback signal is used to stimulate a faster response to modulate the ammonia flow valves (1CI-FV-1600A/B).  This allows rapid achievement of the specified outlet NOx without any large deviations from the setpoint.  A hand control station in the DCS (1CI-HS-1600) is provided for the operator to switch between the GTG firing mode.  This sets the appropriate constants for the base ammonia flow demand and trim calculations.\n\n\n\nThe ammonia dilution air and injection control skid is supplied with 100%-spare ammonia Dilution Air Blowers (1CI-BLR-1001A/B).  Each blower is provided with an inlet filter/silencer unit.  The air flowrate is measured by 1CI-FT-1602 and monitored in the DCS via 1CI-FI-1602.  The air is heated in an electric Dilution Air Heater (1CI-HTR-1001A/B) prior to mixing with ammonia.  The air temperature outlet of the heater is 225?F and is monitored in the DCS (1CI-TI-1601).  The heater is controlled in the range of 200?F to 250?F by temperature switch (1CI-TSL-1601, 1CI-TSH-1601).  A local high temperature switch (1CI-TSH-1603A/B) is also provided to shut-off heater at 250?F.\n\n\n\nThe regulated ammonia flow passes through the Ammonia Filter (1CI-FLT-1001) and Ammonia Accumulator (1CI-ACC-1001) to remove any condensate.  It then flows to the Ammonia/Air Mixer (1CI-MIX-1001) where it is diluted with heated air from the Dilution Air Heater (1CI-HTR-1001A/B) before injection into the SCR catalyst.  Once mixed, the ammonia/air mixture is injected into the HRSG directly upstream of the SCR catalyst reactor via injection/balancing piping.  \n\n\n\nThe ammonia injection control is activated automatically by a minimum condition permissive on the temperature at the SCR catalyst reactor inlet (1CI-TY-1503).  The system also needs to meet the following injection permissive conditions:  \n\n\n\nA.) GTG load greater than 50% (1GT-JL-1006), \n\nB.) Dilution air temperature (1CI-TI-1601) leaving the dilution air heater greater than 150?F, \n\nC.) Dilution air flow greater than 3,000 lb/hr (1CI-FI-1602), \n\nD.) Flue gas temperature at SCR reactor (1CI-TY-1503) within a specified range (430 - 750?F for natural gas, 518 - 750?F for fuel oil), \n\nE.) Ammonia injection System On switch (1CI-HS-1601) is enabled.  \n\n\n\nThe system is automatically shutdown in the event of a GTG trip (1GT-XA-1009), or loss of the start permissive conditions specified above.  In case of failure of the online Dilution Air Blower, the standby spare unit is automatically started through DCS logic.  Each blower is provided with running status (1CI-XL-1622A/B) in the DCS.  Each heater is also provided with a heater on signal (1CI-XL-1623A/B) and heater trouble alarm (1CI-XA-1623A/B) in the DCS.\n\n\n\n\n\nStart-Up \n\n\n\nAmmonia vessel is filled to a maximum of 82% storage volume per code requirement (OSHA 29CFR 1910).\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 63163,
                  "PreventionProgram3ID": 43400,
                  "ProcessChemicalID": 98082
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 50981,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2012-03-07 00:00:00",
    "ERTrainingDate": "2010-06-14 00:00:00",
    "CoordinatingAgencyName": "Newington Fire Dept. (LEPC)",
    "CoordinatingAgencyPhone": "6034369441",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 50981,
      "SummaryText": "Executive Summary\n\nNewington Energy - Newington, \n\n\n\nThe Newington Energy Power Project (NEL) is a 525 MW natural gas and oil fired combined cycle power plant located at 200 Shattuck Way in Newington, NH.  The project lies approximately 1,000 feet from the Piscataqua River in a mixed zone area.  The NEL Facility is owned and operated as a merchant power facility using state-of-the-art technology and environmental controls that provide extremely high operational efficiency and low air emissions.  Through the use of natural gas (primary fuel) and ultra low sulfur No. 2 Fuel Oil (back-up fuel), the facility generates enough power to supply 700,000 homes in New England.\n\n\n\nSystem Overview\n\n\n\nThe anhydrous ammonia system provides storage, vaporization, transfer, and injection control facilities for the ammonia gas to support the selective catalytic reduction system (SCR) in the heat recovery steam generator (HRSG).  The application of Selective Catalytic NOx Reduction Technology (the process) reduces nitrogen oxide air emissions from the station.  There are two HRSG's in the plant, designated as Train 1 and Train 2.  Each HRSG has its own dedicated anhydrous ammonia storage and delivery system.  The system description below pertains to the Train 1 design and operation.  The Train 2 system design and operation is identical to Train 1.\n\n\n\nEach of the two ammonia systems consist of a pressurized storage vessel supplied with a 100% directly heated vaporizer, an ammonia dilution air and injection control skid for the HRSG, and transfer piping.  The individual ammonia dilution air and injection control skid includes two 100% dilution air blowers and heaters, an ammonia/air mixer, and the associated injection/balancing piping routed to the HRSG.  The SCR is used to reduce the emissions level of nitrogen oxides (NOx) generated from the operation of the gas turbine generator (GTG), and of the duct burners in the HRSG.  Ammonia is injected into the exhaust gas stream at the proper"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 50981,
      "SummaryText": " temperature section in the HRSG that contains the SCR catalyst modules and converts the NOx into nitrogen and water before discharge of the exhaust gas to the atmosphere via the stack.\n\n\n\nEach of the two ammonia storage and supply systems includes a 2,000-gallon horizontal, cylindrical, pressure vessel for storing liquefied anhydrous ammonia.  The storage vessel is designed to provide approximately 2.5 days of continuous supply of ammonia at the design usage rate of 144 lbs/hr for NOx reduction to 9 ppmv based on a 24-hour per day operation of No. 2 Fuel Oil at -10?F in the GTG.  When the GTG is firing with natural gas, the vessel has approximately 10-14 days of storage.  The vessel is mechanically rated for 265 psig at 170?F.  The level in the vessel is administratively controlled to a maximum of 82% level, equivalent to 1,715 gallons.  The maximum intended site inventory of ammonia is therefore 3,430 gallons (17,700 pounds) in total for the two ammonia storage vessels.\n\n\n\nAnhydrous ammonia is supplied by tanker truck through a liquid fill connection.  This connection is supported by a bulkhead containment wall designed to withstand the force arising from a tanker truck pulling away while still connected.  An emergency shut-off valve is also provided at both the liquid fill and vapor return line to allow quick shut-off of liquid and vapor flow in the event there is an accidental pull-away of a truck or a hose rupture.  Ammonia is stored in a liquid state in equilibrium with its vapor at saturation conditions in a pressurized vessel.  The vessel is maintained at approximately 100 psig and 64?F by an electric vaporizer under drum pressure control via a PID loop controller modulating the heat input to the ammonia vaporizer.\n\n\n\nAmmonia Storage Vessel\n\n\n\nThe ammonia storage vessel temperature is monitored through the local indicator.  The level in the vessel is monitored through the local gauge, and remotely through the DCS.  A local level indicator and a local horn fo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 50981,
      "SummaryText": "r high level alarm are also provided at the truck unloading station.  The ammonia tank pressure is indicated through a local gauge and remotely through the DCS.  A high pressure switch will shut-off the vaporizer if the drum pressure increases to 165 psig.  The tank is supplied with a dual pressure relief valve set at 265 psig, excess flow valves at all fluid flow nozzles, and thermal relief valves set at 325 to 350 psig on associated liquid ammonia lines.\n\n\n\nIn Fall of 2007, ammonia liquid crossover piping was installed to connect the two individual storage tanks.  The piping and associated manual valves facilitate the transfer of liquid ammonia between tanks.  The addition of the piping minimizes the need to remove large amounts of liquid ammonia from the system in order to prepare for maintenance activities. \n\n\n\nIn December of 2011, ammonia vapor crossover piping was installed.  The piping ties together the two ammonia vapor headers that are routed to each individual ammonia/air dilution skid and SCR.  The piping allows complete isolation of an individual storage tank while operating both SCR's from one storage tank and vaporizer.  However, due to the process design of the ammonia vaporizers, this operation is only possible while operating the facility on natural gas.  A single vaporizer is not designed sufficiently to supply both SCR's at base load operation.\n\n\n\nThe ammonia vessel is kept at the desired operating pressure of 100 psig by an electric vaporizer using a local PID loop pressure controller.  Liquid anhydrous ammonia is vaporized by direct contact with the heating element.  The liquid ammonia feed line to the vaporizer is protected from over pressure at blocked in condition by a thermal relief valve set at 350 psig.  The ammonia vapor is piped back via the vapor line into the storage vessel.  The vapor from the vessel is then sent to the dilution air and injection control skid.  A remote pressure controller set at 50 psig is provided on the vapor line "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 50981,
      "SummaryText": "to ensure a constant feed pressure to the dilution air system.  A high temperature cut-off switch is provided to shutdown the vaporizer if the heating element is in excess of 200?F.  \n\n\n\nAmmonia Dilution Air and Injection Control Skid\n\n\n\nA dilution air and injection control skid is supplied for each HRSG to support the operation of the associated SCR system.  The skid consists of 100%-spare Dilution Air Blowers, Dilution Air Heaters, Ammonia/Air mixer, Ammonia Filter, and Ammonia Accumulator.\n\n\n\nAmmonia vapor is fed from the storage vessel to the dilution air and injection control skid under constant pressure control set at 50 psig.  The ammonia injection rate is regulated via a flow control valve under its respective flow controller.  There are two separate ammonia flow control valves, one for liquid fuel firing and one for natural gas firing.  The controller is reset by a function block that automatically calculates the required ammonia injection rate to achieve the required NOx reduction depending on the GTG load and fuel type, as well as the firing rate of the HRSG duct burner.  The function block receives the GTG exhaust gas calculated inlet NOx concentration signal from the GTG MARK V control system.  This function block also receives a calculated NOx signal for the duct burner from the DCS control system.  The combined signal from the function block acts as a feedforward signal to rapidly adjust the ammonia flow valve to follow changes in load.  The ammonia flow is trimmed via a feedback signal from the exhaust NOx analyzer at the stack.   The combined feedforward and feedback signal is used to stimulate a faster response to modulate the ammonia flow control valve.  This allows rapid achievement of the specified outlet NOx without any large deviations from the setpoint.  A hand control station in the DCS is provided for the operator to switch between the GTG firing mode.  This establishes the appropriate constants for the base ammonia flow demand and trim cal"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 50981,
      "SummaryText": "culations.\n\n\n\nThe ammonia dilution air and injection control skid is supplied with 100%-spare ammonia Dilution Air Blowers.  Each blower is provided with an inlet filter/silencing unit.  The air flowrate is measured and monitored in the DCS.  The air is heated in an electric Dilution Air heater prior to mixing with ammonia.  The outlet temperature of the air heater is controlled in the range of 200?F to 250?F by the DCS.  A local high temperature switch is also provided to shut off the heater at 250?F.\n\n\n\nThe regulated ammonia flow passes through an Ammonia Filter and Ammonia Accumulator to remove any condensate.  It then flows to the Ammonia / Air Mixer where it is diluted with heated air.  Once mixed, the ammonia/air mixture is injected into the HRSG directly upstream of the SCR catalyst reactor via injection/balancing piping.  \n\n\n\nThe ammonia injection control is activated automatically by a minimum condition permissive on the temperature at the SCR catalyst reactor inlet.  The system also needs to meet the following injection permissive conditions:  \n\n\n\nA.) GTG load greater than 50%, \n\nB.) Dilution air temperature leaving the dilution air heater greater than 150?F, \n\nC.) Dilution air flow greater than 3,000 lb/hr, \n\nD.) Flue gas temperature at SCR reactor within a specified range (430-750?F for natural gas, 518-750?F for fuel oil), \n\nE.) Ammonia injection System On switch is enabled.  \n\n\n\nThe system is automatically shutdown in the event of a GTG trip, or loss of the start permissive conditions specified above.  In case of failure of the online Dilution Air Blower, the standby spare unit is automatically started through DCS logic.  Each blower is provided with running status in the DCS.  Each heater is also provided with a heater on signal and heater trouble alarm in the DCS.\n\n\n\nRisk Management Plan (RMP) and Process Safety Management (PSM)\n\n"
    }
  ]
}