{
  "FacilityID": 51351,
  "FacilityName": "Detroit WWTP-Chlorination/Dechlorination Facility",
  "FacilityStr1": "9401 West Jefferson",
  "FacilityStr2": null,
  "FacilityCity": "Detroit",
  "FacilityState": "MI",
  "FacilityZipCode": "48209",
  "Facility4DigitZipExt": "2676",
  "FacilityCountyFIPS": "26163",
  "LEPC": "City of Detroit LEPC/Fire Dept",
  "FacilityLatDecDegs": "42.280556",
  "FacilityLongDecDegs": "-083.118889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dwsd.org",
  "FacilityEmailAddress": "public.affairs@dwsd.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Detroit",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Detroit / DWWTP",
  "OperatorStr1": "9300 West Jefferson",
  "OperatorStr2": null,
  "OperatorCity": "Detroit",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48209",
  "OperatorZipCodeExt": "2676",
  "RMPContact": "Stephen Kuplicki",
  "RMPTitle": "Assistant Director - WWOG",
  "FTE": 800,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000113021",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "SRN:B2103",
  "SafetyInspectionDate": "2005-01-26 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-04-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-04-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-04-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-04-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.28133,
  "FRS_Long": -83.1286,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 74647,
      "AltID": "Chlorination",
      "FacilityID": 51351,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 76452,
          "ProcessID": 74647,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 98998,
          "ProcessID": 74647,
          "ChemicalID": 62,
          "Quantity": 1100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 598998,
          "ProcessID": 74647,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 74648,
      "AltID": "Dechlorination",
      "FacilityID": 51351,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 76453,
          "ProcessID": 74648,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 98999,
          "ProcessID": 74648,
          "ChemicalID": 49,
          "Quantity": 1100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 598999,
          "ProcessID": 74648,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51351,
      "SummaryText": "The owner or operator of a stationary source subject to the risk management program rule under the Clean Air Act, section 112 (r) (7) of 40 CFR Part 68 is required to submit a single Risk Management Plan that includes the information required in ?? 68.155 through 68.185 for all covered processes. As specified in ? 68.155, the owner or operator must provide an executive summary that includes a brief description of the Risk Management Plan. At Detroit Wastewater Treatment Plant (DWWTP), chlorine is used to disinfect the treated wastewater and sulfur dioxide is used to remove the residual chlorine or to dechlorinate the treated wastewater to protect the organisms in the river when it is discharged . Chlorine and sulfur dioxide are stored in 90 ton tank cars. DWWTP has shut down the old chlorination facility since March 31, 2003, as the new chlorination facility is successfully in operation. MIOSHA did the site consultation at DWWTP for the new dechlorination facility on May 22, 2002 and for the new chlorination facility on January 27, 2003. The following elements describe the Risk Management Plan as per ? 68.155, for the new Chlorination and Dechlorination processes at the Detroit Wastewater treatment Plant.\n\n1.    The accidental release prevention and emergency response policies at the stationary source.\n\n    Detroit Water and Sewerage Department, under which DWWTP is being operated, is strongly committed to employee, public and environmental safety. The  chlorination and dechlorination processes at DWWTP have been designed and constructed per the applicable codes and engineering standards.  Currently, the chlorination and the dechlorination processes are working and meet the good engineering practices. Also, a preventive maintenance program consisting of equipment calibration and replacement of components to maintain process performance has been implemented. The chemical supplier makes the tank car inspection, cleaning, repair, interior system tests and relief valve tests."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51351,
      "SummaryText": " \n\n    At DWWTP, a set of seven (7) detectors is placed throughout the new administration building and at the junction chamber.  Their function is to warn of chlorine gas in the air and to activate the automatic shut off mechanism of the air intake to the various parts of the new administration building. \n\n    A sulfur dioxide or chlorine leak will be detected by the gas detector system in the new facilities. The sensors are located in the tank car storage buildings, chemical feed equipment rooms, and in the basements. The area of the alarm or malfunction will be indicated on the control panels. Alarm information will be sent to annunciator panels in the tank car storage buildings, Chlorination and Dechlorination facility maintenance rooms, Chlorination and Dechlorination control rooms and to the scrubbers.\n\n    The caustic soda air wash system chemically neutralizes chlorine as well as sulfur dioxide from a leak inside the building before the gas escapes to the outside atmosphere.\n\n    Flashing red lights are provided at the entrances to the chlorination and dechlorination buildings.  This is to alert the area personnel that there is or was a leak inside the buildings. Chlorine sensor at the junction chamber triggers visual alarms locally as well as in the Plant Control Center (PCC).\n\n    Detroit Wastewater Treatment Plant has designated the Detroit Fire Department as the official responder in case of an accidental release. The plant supervisor will also notify the police to be prepared for an evacuation of the neighboring residents if the need occurs. Other agencies to be notified in the event of accidental releases of chlorine or sulfur dioxide are City of Detroit Local Emergency Planning Committee     ( LEPC ), Michigan Department of Environmental Quality (MDEQ) Pollution Emergency Alert System, The Environmental Protection Agency (EPA), The National Response Center (NRC) which will notify the appropriate federal agencies, Ontario Ministry of Environment, Canada Consulate Gene"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51351,
      "SummaryText": "ral Office, and Detroit Water and Sewerage Department's Systems Control Division.\n\n2.    Stationary source and regulated substances handled.\n\n    Detroit Wastewater Treatment Plant provides secondary treatment for flows up to 930 MGD. During wet weather periods, incremental flows above 930 MGD receive primary treatment and disinfection prior to discharge to the Detroit River. At the pump stations, raw wastewater from the Jefferson Interceptor, Oakwood Interceptor and North Interceptor-East Arm receive coarse screening and grit removal and are then pumped to the primary tanks.  Ferric chloride and/or ferrous chloride are added to the raw wastewater for phosphorous removal. The wastewater is pumped from the Intermediate Lift Pump Station to the secondary treatment facilities where treatment is provided by the activated sludge method.  Following final clarification, the wastewater is disinfected by the addition of chlorine, dechlorinated by the addition of sulfur dioxide, and discharged to the Detroit River. Treated wastewater can be discharged to the Rouge River if hydraulically or structurally necessary. The primary solids and secondary activated solids are gravity thickened and dewatered by either centrifuge or belt filter presses.  The main sludge disposal method is by incineration and landfill of the ash.  Excess sludge is lime stabilized and landfilled.\n\nThe primary components of the new chlorination process are six (6) 90-ton rail cars, sixteen (16) evaporators, sixteen (16) chlorinators, sixteen (16) 4\" injectors, two (2) diffusers and the scrubber system.\n\n The primary components of the dechlorination process are six (6) 90-ton rail cars, fourteen (14) evaporators, fourteen (14) sulfonators, fourteen (14) 3\" injectors, two (2) diffusers and the scrubber system.\n\n3.    The general accidental release prevention program and chemical-specific prevention steps.\n\n    Periodic training is provided for the operations laboratory and maintenance staff personnel assigned to the  chl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51351,
      "SummaryText": "orination and dechlorination processes. The training consists of reviewing the manuals and actual hands-on field operation of the equipment.  Leak detection and equipment isolation procedures are also included in this training. \n\n    The preventive maintenance program consists of equipment calibration and replacement of components to maintain process performance. Rupture disc replacement is performed annually to prevent premature chlorine and sulfur dioxide releases caused by eroded or fatigued disks.  A total inspection and/or replacement of the process piping are performed at 5-year intervals. The sensors in the new chlorination and dechlorination facilities have microprocessors that contain instructions and store information.\n \n4.    The five -year accident history.\n\n    We did not have any reportable accidental releases in the past five years.\n\n5.    The Emergency Response Program.\n\n    The Detroit Wastewater Treatment Plant has designated the Detroit Fire Department as the official emergency responder. We have a written Emergency Response Plan to deal with accidental releases of chlorine or sulfur dioxide.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n    In the event of fire and other emergencies at the DWWTP, employees are alerted by an alarm system to evacuate the affected area to the safe zone. The public will also be notified.  Flashing red lights are provided at the entrances to the chlorination and dechlorination buildings to indicate the presence of chlorine or sulfur dioxide. Chlorine sensor at the junction chamber triggers visual alarms locally as well as in the Plant Control Center (PCC).\n\n6.    Planned changes to improve safety.\n\n    DWWTP has recently constructed a new chlorination and dechlorination facility and installed new equipment to improve the overall safety of the chl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 51351,
      "SummaryText": "orination and dechlorination processes. Maintenance section has planned to intensify their training of new employees on the new equipment."
    }
  ]
}