{
  "FacilityID": 5143,
  "FacilityName": "Seitz Foods, Inc.",
  "FacilityStr1": "4501 Packers Avenue",
  "FacilityStr2": null,
  "FacilityCity": "St. Joseph",
  "FacilityState": "MO",
  "FacilityZipCode": "64502",
  "Facility4DigitZipExt": "0247",
  "FacilityCountyFIPS": "29021",
  "LEPC": "Buchanan  Cnty Emerg. Plng Com",
  "FacilityLatDecDegs": "39.768889",
  "FacilityLongDecDegs": "-94.854444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "peggy.wood@saralee.com",
  "FacilityDUNS": 7134372,
  "ParentCompanyName": "Sara Lee Corporation",
  "Company2Name": null,
  "CompanyDUNS": 5213962,
  "Company2DUNS": null,
  "OperatorName": "Seitz Foods, Inc.",
  "OperatorStr1": "4501 Packers Avenue",
  "OperatorStr2": null,
  "OperatorCity": "St. Joseph",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64502",
  "OperatorZipCodeExt": "0247",
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000062077",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-05-25 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2007-04-27 00:00:00",
  "DeRegistrationEffectiveDate": "2001-09-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 39.72749,
  "FRS_Long": -94.86721,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Sold facility",
  "_processes": [
    {
      "ProcessID": 6049,
      "AltID": null,
      "FacilityID": 5143,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6576,
          "ProcessID": 6049,
          "ChemicalID": 56,
          "Quantity": 12400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6196,
          "ProcessID": 6049,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2584,
              "Process_NAICS_ID": 6196,
              "SafetyReviewDate": "1998-04-30 00:00:00",
              "PHA_Date": "1998-05-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "sewer pump shutdown",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "additional training",
              "OpProceduresReviewDate": "1998-11-30 00:00:00",
              "TrainingReviewDate": "1998-04-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-05-31 00:00:00",
              "EquipmentInspectionDate": "1998-05-31 00:00:00",
              "EquipmentTested": "all major equipment",
              "ChangeMgmtDate": "1999-02-11 00:00:00",
              "ChangeMgmtReviewDate": "1998-04-30 00:00:00",
              "PreStartupReviewDate": "1999-02-11 00:00:00",
              "ComplianceAuditDate": "1998-12-31 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": "1993-05-31 00:00:00",
              "InvestigationChangeDate": "1993-06-30 00:00:00",
              "ParticipationPlansReviewDate": "1998-04-30 00:00:00",
              "HotWorkPermitReviewDate": "1998-04-30 00:00:00",
              "ContractorSafetyReviewDate": "1998-06-30 00:00:00",
              "ContractorSafetyEvalDate": "1998-04-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 2910,
                  "PreventionProgram3ID": 2584,
                  "ProcessChemicalID": 6576
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5143,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-04-30 00:00:00",
    "ERTrainingDate": "1998-09-10 00:00:00",
    "CoordinatingAgencyName": "St. Joseph Fire Department",
    "CoordinatingAgencyPhone": "8162724802",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5143,
      "SummaryText": "Background Data\n\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), Seitz Foods, Inc. (Seitz) submits this Risk Management Plan (RMP) for operations at their St. Joseph, Missouri facility. Seitz operations include the processing of meat products (hot dogs and sausages) for public consumption packaged under the familiar brand names of Seitz, Fairgrounds, Hygrade, Dillions, and Schnucks.  Seitz has been in operation at this facility for over 40 years providing quality meat products and over 160 jobs to the local community.\n\nAccidental Release Prevention and Emergency Response Policy\n\nSeitz is committed to protecting the health of its employees, the surrounding community, and the environment; therefore it is Seitz policy to manage a safe and healthy workplace, protect the environment, and maintain compliance with safety, health and environmental regulations: 40 CFR 68 as well as Occupational Safety and Health Organization (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations Chapter 1910, Section 119 (29 CFR 1910.119), and OSHA's Hazardous Operations and Emergency Response regulations (29 CFR 1910.120).\n\nSeitz maintains the following safety policy to protect the health and safety of its employees and the surrounding community:\n\nThe objective of the Seitz Foods, Inc., Safety Policy is to prevent all injuries.\n\nThe purpose of the Safety Policy is to protect employees from needless suffering and hardship and to develop a sense of responsibility and team spirit necessary for a successful business.  Because the line organization has the responsibility for operations activities of the company, each manager and supervisor must accept full responsibility for safety of each employee.\n\nIt is possible to safeguard all operating exposures that may result in injuries.\n\nIt is preferable to eliminate the sources of danger.  However, wher"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5143,
      "SummaryText": "ends offsite and includes public receptors.\n\nThe worst-case release scenario was developed following EPA regulations and is not considered to be a likely release scenario.  During normal operations Seitz maintains the receivers at 40% capacity.  Only during pump-down operations do the receivers have the potential to be filled to 70% of capacity.  The receivers are operated in pump-down mode less than 3% of the time during the year.  \n\nAlternative Release Scenario\n\nA more realistic release scenario (alternative release) was developed by Seitz taking into consideration the 40-year history of operation's experience and the hazards identified in the process hazard analyses (PHAs) conducted to ensure that Hygrade Food's hazards are identified and minimized.  These analyses were conducted under the Occupational Safety and Health Organization (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations Chapter 1910, Section 119 (29 CFR 1910.119).  The most likely alternate release scenario identified by Seitz would be an evaporator impact from a forklift, causing a pipe rupture.  In developing the release parameters of this alternative scenario Seitz considered average response time to shut the system down and mitigation provided by the building structure.  \n\n Accidental Release Prevention Program\n\nTo prevent and mitigate accidental releases of anhydrous ammonia, Seitz has implemented several precautionary measures, such as process/equipment controls, standard operating procedures, preventative maintenance programs, employee training and audit programs.\n\nSeitz has developed and implemented a PSM program and as such, has evaluated the system for the potential of anhydrous ammonia releases.   Some of the controls installed to prevent catastrophic releases of ammonia are process equipment (vents, pressure relief valves, backup pumps, and manual shutoffs) and automated controls (automatic shut-offs).  In addition, Seitz has trai"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5143,
      "SummaryText": "ned approximately 8 personnel to respond to potential ammonia releases (HazMat team).\n\nSeitz has developed standard operating procedures for all employees and contractors that have contact with the ammonia refrigeration system that incorporate safety measures into the procedures.  These safety procedures were developed by refrigeration system operators and are reviewed and updated at least weekly as operators are using the procedures.  Process safety information for the refrigeration system is reviewed weekly as well.  Seitz encourages employee participation in development of the control measures used at the plant by means of a safety incentive program.  In addition, Seitz maintains a rewards program for employee safety suggestions.  Pursuant to written management of change procedures established by Seitz, any changes to the operating procedures are communicated to affected employees.\n\nSeitz understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases; therefore Seitz has implemented a preventative maintenance program.  The preventative maintenance program is scheduled, documented and managed to ensure that regular maintenance occurs on the system.  Also, to ensure the mechanical integrity of critical refrigeration system components, testing (thermographic studies) is conducted by an independent third party on an annual basis.\n\nTo ensure that Seitz control measures are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system:\n\n7 In accordance with the PSM program, Seitz conducts detailed PSM compliance audits every three years that incorporates review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot w"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5143,
      "SummaryText": "e this is not reasonable or practical, supervision must resort to such measures as the use of guards, safety devices and protective clothing.  No matter what the exposure, an effective safeguard can be provided.\n\nTraining of employees is a responsibility of supervisors.  Each employee must understand that he or she has a responsibility of work safely.\n\nIt is good business from the standpoint of both efficiency and economy to prevent personal injuries on the job and off of the job.  In addition to humanitarian considerations, injuries cost money and reduce efficiency.\n\nSafety is a condition of their own safety and the safety of the people with which they work.  Employees are expected to accept safety when they join the company; their own safety and the safety of the people with which they work.\n\nStationary Sources and Regulated Substances\n\nSeitz is required to maintain low temperatures in the food processing areas of the plant that are within standards required by the United States Department of Agriculture (USDA) to ensure quality in the final products.  Seitz uses anhydrous ammonia (the 112(r) regulated substance) as a refrigerant to maintain the 127,000-ft2 facility within the required range of operating temperatures.  Anhydrous ammonia is an industry-standard refrigerant for meat processing plants.  Seitz refrigeration system consisting of receivers, compressors, evaporators, condensers, and piping can contain a maximum amount of approximately 12,400 pounds of anhydrous ammonia.\n\nWorst Case Release Scenario\n\nAs required by 40 CFR 68 Subpart B, Seitz has evaluated a worst-case release scenario for anhydrous ammonia using the parameters specified by the EPA.  Seitz worst case release scenario is the rupture of the largest single receiver (RC-1) over a 10-minute period.  The receiver has a high level shut-off switch which limits the capacity to 70% of the total capacity (5,346 pounds).  Using the EPA's RMP*Comp program, the maximum distance to the toxic endpoint ext"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5143,
      "SummaryText": "ork permit procedures, and contractor safety procedures.\n7 Seitz is audited by the local fire department regularly\n7 Seitz is audited by the USDA on an annual basis\n7 Seitz property insurance carrier also conducts independent audits/tests on an annual basis\n \n Five-Year Accident History\n \n Over the last five years, Seitz has not experienced an accidental off-site release of anhydrous ammonia.\n \n Emergency Response Program\n \n Seitz has developed a comprehensive emergency response program designed to protect both employees and the community in the event of a release.  This program is fully described in a document entitled Emergency Planning and Response in order to facilitate response efforts in the event of an off-site anhydrous ammonia release.  Included in the Emergency Planning and Response document are measures to be taken internally by Seitz and procedures to inform local emergency response agencies.\n \n Seitz has trained approximately eight on-site personnel to respond to accidental ammonia releases.  These personnel are trained in accordance with 29 CFR 1910.120, OSHA's Hazardous Operations and Emergency Response regulations according to their duties and function.  These personnel receive initial training and annual update training thereafter.\n \n To assure that the local governmental response agencies are familiar with Seitz emergency response procedures, Seitz has submitted copies of the Emergency Response Plan for review and approval by the local agencies.  The following local agencies have reviewed Seitz emergency response procedures:\n \n7 St. Joseph Fire Department\n7 Buchanan County EPC (LEPC)\n \n To plan for an ammonia release with off-site effects, Seitz includes procedures/equipment to mitigate the release, procedures to inform local response agencies and procedures for public communication.\n \n In the event of an anhydrous ammonia release with off-site effects, the Local Emergency Planning Committee will warn the general public.\n \n Continuous Efforts to"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5143,
      "SummaryText": "Improve Safety\n \n As part of Seitz continuous efforts to improve the performance of its safety systems, several changes are planned at the facility to improve safety and prevent anhydrous ammonia releases.  These changes are scheduled to be implemented by April 1, 1999 (except replacement of the recirculator, scheduled for replacement December 1999).  Scheduled improvements include updating training, providing additional lighting, valve labeling, installing high temperature cut-outs and warning devices."
    }
  ]
}