{
  "FacilityID": 51926,
  "FacilityName": "SYSCO Food Services of Las Vegas, Inc.",
  "FacilityStr1": "6201 E. Centennial Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Las Vegas",
  "FacilityState": "NV",
  "FacilityZipCode": "89115",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32003",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "36.233000",
  "FacilityLongDecDegs": "-114.958750",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I5",
  "LatLongDescription": "PU",
  "FacilityURL": "www.sysco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "SYSCO Corporation",
  "Company2Name": null,
  "CompanyDUNS": 51099661,
  "Company2DUNS": null,
  "OperatorName": "David DeVane",
  "OperatorStr1": "6201 E. Centennial Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Las Vegas",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89115",
  "OperatorZipCodeExt": null,
  "FTE": 298,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000186531",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-09-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Ammonia Refrigeration System",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-06-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-06-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-06-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 36.275659,
  "FRS_Long": -115.035993,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75420,
      "AltID": "Refrigeration System",
      "FacilityID": 51926,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 100016,
          "ProcessID": 75420,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 77236,
          "ProcessID": 75420,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 44266,
              "Process_NAICS_ID": 77236,
              "SafetyReviewDate": "2008-05-22 00:00:00",
              "PHA_Date": "2007-04-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-06-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-05-22 00:00:00",
              "TrainingReviewDate": "2008-05-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-05-22 00:00:00",
              "EquipmentInspectionDate": "2008-06-06 00:00:00",
              "EquipmentTested": "Ammonia Refrigeration System",
              "ChangeMgmtDate": "2007-06-11 00:00:00",
              "ChangeMgmtReviewDate": "2008-05-22 00:00:00",
              "PreStartupReviewDate": "2003-04-18 00:00:00",
              "ComplianceAuditDate": "2003-07-09 00:00:00",
              "AuditCompletionDate": "2003-08-09 00:00:00",
              "IncidentInvestigationDate": "2007-06-02 00:00:00",
              "InvestigationChangeDate": "2007-06-03 00:00:00",
              "ParticipationPlansReviewDate": "2008-05-22 00:00:00",
              "HotWorkPermitReviewDate": "2008-05-22 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2008-05-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 64370,
                  "PreventionProgram3ID": 44266,
                  "ProcessChemicalID": 100016
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 51926,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-10-31 00:00:00",
    "ERTrainingDate": "2007-11-02 00:00:00",
    "CoordinatingAgencyName": "North Las Vegas Fire Department",
    "CoordinatingAgencyPhone": "7026331102",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Nevada Chemical Accident Prevention Program (CAPP)",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51926,
      "SummaryText": "SYSCO Food Services of Las Vegas, Inc. Executive Summary\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nWe at SYSCO Food Services of Las Vegas, Inc. are committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as the design, installation, operating procedures, maintenance, and employee training associated with the ammonia refrigeration system at our facility.  It is our policy to implement appropriate control measures to prevent possible releases of Ammonia (anhydrous).  Unforseeable, if such a release does occur, our highly trained employees are on hand to control and mitigate the effects of the release.  We are also completely coordinated with the North Las Vegas Fire Department, who provides our on-site emergency response services.\n\n2.  The Stationary Source and the Regulated Substances Handled:\n\nWe have one regulated substance present at our facility.  That substance is Ammonia (anhydrous).  The maximum inventory of Ammonia (anhydrous) that is expected to be present in this facility, based on process/operational requirements, is 16,950 pounds.\n\n3.  The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps:\n\nOur facility has taken the following steps as required by 40 CFR Part 68 of the Clean Air Act.  Our Ammonia (anhydrous) process is subject to the OSHA PSM Standard 29 CFR 1910.119.  Our facility is also subject to the EPCRA Section 302 reporting requirements.  The following sections briefly describe the elements of the accidental release prevention program that is in place at our facility.\n\nProcess Safety Information:\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our process are identified and controlled efficiently.  The methodology used to carry out these analyses is the What-If Checklist.  The studies are undertaken by a team of qualified personnel wi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51926,
      "SummaryText": "th expertise in engineering and process operations and are revalidated at a regular interval of every five years.  Any findings related to the hazard analyses are addressed in a timely manner.\n\nOperating Procedures:\n\nSysco Food Services of Las Vegas, Inc. maintains written operating procedures.  These procedures address various modes of operation such as initial start-up, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and start-up after a turnaround.  The information is regularly reviewed and is readiliy accessible to operators and maintenance personnel involved in the process.\n\nTraining:\n\nSysco Food Services of Las Vegas, Inc. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  New employees receive basic classroom training in process operations, followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least annually and more frequently if needed.\n\nMechanical Integrity:\n\nSysco Food Services of Las Vegas, Inc. carries out highly documented maintenance checks on process equipment to ensure proper operation.  Process equipment examined by these checks include pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with special training in maintenance practices.  Furthermore, these personnel are given specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a timely manner.\n\nManagement of Change:\n\nWritten procedures are in place at Sysco Food Services of Las Vegas, Inc. to manage change in process chemicals, technology, equipment and processes.  Process operators, maintenance personnel, or any other employees whose job tasks are affected by a modification"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51926,
      "SummaryText": "in process operations, are promptly made aware of, and given, information and training to safely manage the modification.\n\nPre-Startup Reviews:\n\nPre-startup reviews releated to new processes, and to modifications of established processes are conducted as a regular practice at Sysco Food Services of Las Vegas, Inc.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe start-up prior to placing equipment into operation.\n\nCompliance Audits:\n\nSysco Food Services of Las Vegas, Inc. conducts audits on a regular basis to determine whether the provisions required by the RMP regulation are being implemented.  These audits are completed at least every three years and any corrective actions required as a result of the audits are completed in a timely manner.\n\nIncident Investigation:\n\nSysco Food Services of Las Vegas, Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of Ammonia (anhydrous).  These investigations are conducted to identify the circumstances leading up to the incident, as well as any corrective actions to prevent the release or near-miss from recurring.  All accident/incident reports are retained for a minimum of 5 years.\n\nEmployee Participation:\n\nSysco Food Services of Las Vegas, Inc. believes that process safety management and accident prevention require a team effort.  Company employees and contractors are urged to express their views concerning accident prevention issues and to recommend improvements for the ammonia refrigeration system.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP regulation, including information resulting from process hazard analyses, in particular.\n\nContractors:\n\nOccasionally, Sysco Food Services of Las Vegas, Inc. hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51926,
      "SummaryText": "a thorough evaluation of the contractor's safety performance is completed.  Sysco Food Services of Las Vegas, Inc. has a strict policy of informing contractors of known potential hazards related to the contractor's work and the process.  Contractors are also informed of all of the procedures for emergency notification, evacuation and personnel accountability, should an accidental release of Ammonia (anhydrous) occur.\n\n4.  5-Year Accident History:\n\nNo reportable accidents or incidents have occurred at this facility during the past 5 years.\n\n5.  Emergency Response Plan:\n\nSysco Food Services of Las Vegas, Inc. is included in the written community emergency response plan.  The facility also has it's own emergency response plan.  The emergency response plan includes specific actions to be taken in response to accidental releases of regulated substances.  The emergency response plan includes procedures for informing the public and local response agencies of a chemical release.  The emergency response plan also includes information on emergency health care.\n\nThe date of the most recent review/update of the emergency response plan is: October 31, 2007\n\nThe date of the most recent emergency response plan training of employees is: November 2, 2007\n\nThe local agency coordinating the facility emergency response plan is the North Las Vegas Fire Department, which has a phone number of: 702-633-1102\n\n6.  Planned Changes to Improve Safety:\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  We will continue our annual facility emergency notification, evacuation and accountability training and drills.  All visitors, vendors, contractors and employees sign or check in and out of our facility.  In addition, they all receive emergency notification, evacuation and accountability training, or are the responsibility of another Sysco employee, when they enter the facility."
    }
  ]
}