{
  "FacilityID": 51953,
  "FacilityName": "Micronutrients, Div of Heritage Technologies, LLC.",
  "FacilityStr1": "1550 Research Way",
  "FacilityStr2": null,
  "FacilityCity": "Indianapolis",
  "FacilityState": "IN",
  "FacilityZipCode": "46231",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18097",
  "LEPC": "Marion County LEPC",
  "FacilityLatDecDegs": "39.743333",
  "FacilityLongDecDegs": "-086.298333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.MICRONUTRIENTS.net",
  "FacilityEmailAddress": "Brian.Wilson@micro.net",
  "FacilityDUNS": 49714657,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Fred Steward",
  "OperatorStr1": "1550 Research Way",
  "OperatorStr2": null,
  "OperatorCity": "Indianapolis",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46231",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian M. Wilson",
  "RMPTitle": "EHS & Compliance Manger",
  "FTE": 64,
  "OtherEPAFacilityID": "46321MCRNT1550R",
  "EPAFacilityID": "100000038292",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 39.74307,
  "FRS_Long": -86.29702,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75450,
      "AltID": "Inorganic Salt Production",
      "FacilityID": 51953,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 77266,
          "ProcessID": 75450,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 100049,
          "ProcessID": 75450,
          "ChemicalID": 56,
          "Quantity": 54000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 600049,
          "ProcessID": 75450,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 51953,
      "SummaryText": "Executive Summary\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Micronutrients, we are committed to operating and maintaining all of our processes in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented including:\n- A description of our facility and use of Anhydrous Ammonia as regulated by EPA?s RMP regulation\n- An overview of our accidental release prevention programs\n- A five-year accident history for accidental releases of chemicals regulated by EPA?s RMP rule\n- An overview of our emergency response program\n- An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nMicronutrients, a Division of Heritage Technologies, LLC. located in Indianapolis, IN, manufactures Tri-Basic Copper Chloride (TBCC).  TBCC is a low dust, free flowing insoluble crystal used as a dietary source of copper for commercial animal feed industries.  Micronutrients employees a proprietary/patented process which utilizes copper bearing acidic and alkaline solutions to produce a copper based salt, TBCC, and an ammoniacal etchant solution used in printed circuit board manufacturing.  The acidic and alkaline solutions used as feedstocks in the production of TBCC would be classified as wastes if they were not recycled through Micronutrients? production process.  As a company dedicated to environmentally sustainable production, Micronutrients maximizes the reuse concept of environmental compliance through adaptive uses of current chemical engineering technology.\n\nMicronutrients operates a pilot scale resea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 51953,
      "SummaryText": "rch and development facility currently being used to develop a commercial process for manufacturing Tetra-Basic Zinc Chloride (TBZC).  TBZC is a low dust, free flowing insoluble crystal designed for use as a dietary source of zinc for the commercial animal feed industry.\nMicronutrients utilizes anhydrous ammonia, carbon dioxide, hydrochloric acid, sodium hydrosulfide, incoming acidic/basic feedstock solutions, copper oxide, zinc oxide, copper scrap, trace catalysts, and other chemicals in our production process.  Anhydrous ammonia has been identified as the only one having the potential to cause significant offsite consequences in the event of a substantial accidental release.  \nMicronutrients takes its responsibility for employee and environmental safety seriously; through engineering controls and best management practices the release and impact of an anhydrous ammonia release is prevented and mitigated.  Examples include process area detectors (toxic vapor analyzers), vents, relief systems, check valves, scrubbers, manual and automatic shutoffs, interlocks, excess flow devices, alarms and procedures.  Equipment inspections, incident investigations, and routine audits of safety and operation procedures are performed to ensure necessary practices and measures are in place.  Each employee is trained in the operation of the anhydrous ammonia delivery systems, safety programs and safety procedures during orientation and through periodic training.  Information about Micronutrients and its commitment to environmental, health and safety issues is communicated to our employees, customers and the surrounding community through our website, meetings, and our environmental and quality policies.\n\nTOXICS\n\nAnhydrous Ammonia is stored in an above ground tank with a 54,000 pound capacity.  The ammonia is used in TBCC production, ammo redissolve operations, formulated etchant production, and the pilot plant.\n\nMicronutrients accidental release prevention program and contingency plann"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 51953,
      "SummaryText": "ing efforts help effectively manage hazards posed to our employees, the public, or the environment due to our use of Anhydrous Ammonia.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVETNTION STEPS\n\nMicronutrients takes a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Micronutrients management systems address the following as features of our prevention programs:\n- Process Safety Information\n- Process Hazard Analysis\n- Operating Procedures\n- Training\n- Mechanical Integrity\n- Management of Change\n- Pre-Startup Review\n- Compliance Audits\n- Incident Investigations\n- Employee Participation\n- Hot Work Permit\n- Contractors\nAs part of Micronutrients? prevention efforts, we have implemented the following Anhydrous Ammonia release prevention steps:\n1. Employee Training\n2. Internal Ammonia Sensors with Alarms\n3. Pressure Relief Valves\n4. Inspection and maintenance of Equipment\n5. Scrubber Systems\nThese elements of Micronutrients? prevention program work together to prevent accidental chemical releases.  Micronutrients and our employees are committed to the standards set by these management systems as the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nMicronutrients will keep records for all significant accidental chemical releases that occur at our facility.  To date, Micronutrients has not had a release of Anhydrous Ammonia off of the facility property.\n\nEMERGENCY RESPONSE PROGRAM\n\nMicronutrients maintains a contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we communicate our plan with the local fire department and the LEPC.\n\nP"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 51953,
      "SummaryText": "LANNED CHANGES TO IMPROVE SAFETY\n\nMicronutrients continues to inspect equipment to assess mechanical integrity in an effort to further prevent significant accidental chemical releases.  Our effort to strengthen and grow our predictive and preventive maintenance programs are ongoing."
    }
  ]
}