{
  "FacilityID": 5199,
  "FacilityName": "City of DanburyWest Lake Filter Plant",
  "FacilityStr1": "149 Westville Avenue Ext.",
  "FacilityStr2": null,
  "FacilityCity": "Danbury",
  "FacilityState": "CT",
  "FacilityZipCode": "06811",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09001",
  "LEPC": "Danbury LEPC",
  "FacilityLatDecDegs": "41.397083",
  "FacilityLongDecDegs": "73.478583",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Danbury",
  "OperatorStr1": "155 Deer Hill Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Danbury",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06810",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000064155",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-09-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2002-10-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.396575,
  "FRS_Long": -73.480353,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6133,
      "AltID": "Chlorine",
      "FacilityID": 5199,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6668,
          "ProcessID": 6133,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6283,
          "ProcessID": 6133,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5199,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-01 00:00:00",
    "ERTrainingDate": "1999-04-01 00:00:00",
    "CoordinatingAgencyName": "Danbury Fire Department",
    "CoordinatingAgencyPhone": "2037961550",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5199,
      "SummaryText": "EXECUTIVE SUMMARY\nPURPOSE\nChlorine gas is used as a disinfectant in the West Lake Water Treatment plant.  Having chlorine in contact with the filtered water for the proper amount of time (detention time) kill's pathogenic bacteria that would otherwise cause gastric and intestinal distress, sickness, or death. \nSTORAGE\nChlorine is delivered to the water plant in one ton containers.  These containers contain liquid chlorine and are equipped to discharge liquid or gaseous chlorine.  A maximum of five one ton containers is stored at any one time in the chlorine storage room.\nPROCESS SAFETY MANAGEMENT AT WEST LAKE FILTER PLANT\nThe Public Utilities Department Risk Management Program includes the following key elements to mitigate the effects of potential chlorine release hazards:\n Operator training\n Preventive maintenance program\n Process specific safety equipment\n Written standard operating procedures, with management and union participation\n Hazard review of equipment and procedures\n Inspection program\nIn addition, the Public Utilities Department has had a long history of having a health & safety committee, quick and decisive disciplinary action for any one violating proper safety procedures.  We utilize all of the following resources to maintain a safe working environment.\n Chlorine detectors\n Right to know program (CFR 1910.120)\n Personal protective equipment program\n Experts from the Danbury Fire and Health departments to assist us in reviewing equipment and procedures\nDESCRIPTION OF THE FACILITY AND THE REGULATED SUBSTANCES HANDLED\nThe West Lake Water Treatment plant has a design capacity to handle 10 million gallons per day.  The plant is a conventional design (sedimentation, flocculation) with two rapid sand filters.  Water flows by gravity through a thirty-inch pipeline from West Lake Reservoir, located approximately three miles away.  The raw water flows into the plant and is injected with aluminum sulfate.  The water containing aluminum sulfate proceeds into th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5199,
      "SummaryText": "e rapid mix bay where the alum and water are mixed.  The water then flows into to separate flow trains (east & west).  The water proceeds into two flocculation tanks where the water containing alum is gently mixed to ensure proper contact with suspended solids in the water.  The water then flows into the sedimentation tanks where the \"flocs\" (colloidal aluminum hydroxide settle to the bottom of the tank and the supernatant flows in to the filter area.  Once the water has made it into the filter, the filter media (sand) removes any remaining solids in the water.  From here the water is injected with caustic soda (for pH control), chlorine (for disinfection), and fluoride (for dental hygiene).  At this point the water is stored in a 523,000 gallon low clearwell waiting to be pumped to the 523,000 high clearwell and then to distribution.  Chlorine is the only substance handled at the plant that is regulated by 40CFR68 Accidental Release Prevention Requirements Risk management Program 112(r)(7).\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\nThe facility complies with EPA's accident prevention rule and all applicable state and local regulations.  The chlorine system is maintained and operated in accordance with applicable codes and state law.\nWest Lake Treatment plant maintains self-contained breathing apparatus (SCBA) and The Chlorine Institute's emergency kit (\"B\" type) for one-tone containers.  The kit contains the various devices required to cap, plug, and stop a leak in a one-ton container. Ton containers are equipped with fusible plugs that melt between 158OF and 165OF to relieve pressure and prevent a rupture of the container in case of fire or a very high temperature exposure. Since water plant personnel are not 40-hour HAZWOPR trained they are not authorized to respond to chlorine leaks.  The Danbury Fire Department is the primary contact for chemical response in Danbury.  Chlorine gas is heavier than air and the West Lake"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5199,
      "SummaryText": "plant has chlorine sensors located in the chlorine storage room.  The chlorine alarm when activated notifies the plant operator there is a chlorine leak.  The alarm will also activate a ducted exhaust fan that will pull vapors from the floor the vent them through the roof into the atmosphere.\nFIVE YEAR ACCIDENT HISTORY\nThe West lake Filter plant has never had an accident involving chlorine that required hospitalization, care by a physician, death, injury, property/environmental damage, evacuations, or sheltering-in-place.\nEMERGENCY RESPONSE PROGRAM\nThe West Lake Filter Plant has a site specific Chlorine Emergency Response Plan dated May 17, 1995, which outlines employee procedures in the event of an emergency.\nPLANNED CHANGES TO IMPROVE SAFETY\nNo changes are planned at this time.\nOFF-SITE CONSEQUENCE ANALYSIS\nThe impact area of a potential release of chlorine was determined using ALOHA Modeling Software. The worst case analysis is the potential release of chlorine from a single container over a ten-minute period.  The alternative release is using a sheared pigtail. The results are detailed in the RMP."
    }
  ]
}