{
  "FacilityID": 5200,
  "FacilityName": "Northeast Advanced Pollution Control Facility",
  "FacilityStr1": "3290 State Road 580",
  "FacilityStr2": null,
  "FacilityCity": "Clearwater",
  "FacilityState": "FL",
  "FacilityZipCode": "34695",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12103",
  "LEPC": null,
  "FacilityLatDecDegs": "28.023056",
  "FacilityLongDecDegs": "-82.708611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Clearwater",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Clearwater",
  "OperatorStr1": "1605 harbor Drive",
  "OperatorStr2": null,
  "OperatorCity": "Clearwater",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33755",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joseph Reckenwald",
  "RMPTitle": "Superintendent, Engr. Dept., WPC",
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000064173",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-01-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-03-26 00:00:00",
  "DeRegistrationEffectiveDate": "2004-02-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 28.02589,
  "FRS_Long": -82.70593,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6134,
      "AltID": "disinfection",
      "FacilityID": 5200,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6284,
          "ProcessID": 6134,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6669,
          "ProcessID": 6134,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506669,
          "ProcessID": 6134,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5200,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\n\n1.1 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY SUMMARY\n\nThe Northeast Advanced Pollution Control Facility (the Facility) is located at 3290 State Road 580, just east of McMullen Booth Road, Clearwater, Pinellas County, Florida.  As one of only three municipal waste water treatment plants in the City of Clearwater (the City), the Facility is a critical part of the City's municipal waste water treatment system.  \n\nThe City is committed to operating this and its other facilities in a manner that is protective of the health and safety of City and Contractor employees, the public, and the environment.  In addition, the City is committed to operating this and its other facilities in full compliance with all applicable Occupational Safety and Health Administration (OSHA) and Environmental Protection Agency (EPA) regulatory requirements.\n\nTo ensure that the Facility is operated in a safe manner and in compliance with applicable OSHA and EPA regulations relevant to accidental release prevention, the City has developed a separate Process Safety Management (PSM) Plan and a Risk Management Plan (RMP).  Among the important components of the RMP are the City's system of policies and procedures for operation and maintenance of the regulated process, and the City's Emergency Response Plan (ERP) specific to this Facility.  \n\nThe City has designated their Water Pollution Control Superintendent as the individual with primary responsibility and accountability for seeing that this RMP and its associated components accurately reflect Facility conditions and that the RMP is fully implemented at the water pollution control facilities.   \n\n\n1.2 STATIONARY SOURCE DESCRIPTION\n\nThe Facility is designed to treat waste water from the City's sanitary sewer system.  Among the various processes that comprise the overall treatment operation is disinfection to remove potentially harmful biological contaminants.  This is an essential process to the overall perf"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5200,
      "SummaryText": "ormance of waste water treatment.  \n\nDisinfection is accomplished by the addition of chlorine to the waste water. Chlorine is delivered to the Facility and stored in one-ton containers as a liquid under pressure.  Within the container, chlorine gas is present in the head space.  When a container is placed in use, chlorine gas is drawn off the head space for use in the process, and additional liquid volatilizes within the container.  \n\nThe maximum intended chlorine inventory at this location is 24,000 pounds, stored in twelve one-ton containers.  Only two containers (4,000 lb) are on-line and in use at any given time.  Two additional containers (4,000 lb) remain in a stand-by mode connected to a manifold associated with the process such that when the two active containers are empty, the two stand-by containers can be brought on line without interruption to the disinfection process.  The remaining eight one-ton containers (16,000 lb) are stored on trunnions adjacent to the process so that they are readily available as replacements for empty containers.  Based on the need for uninterrupted waste water treatment, the critical importance of the disinfection process, and the anticipated flow rate through the Facility, 24,000 lb of chlorine is considered to be the minimum feasible inventory.   \n\nA small portion of the Facility's effluent is diverted to a circular clarifier for use as reclaimed water, primarily for irrigation purposes.  A separate chlorination system is used to disinfect this low-flow process, using 150-pound cylinders which are not part of the risk management regulations due to the low quantity present.  The remainder of the Facility's effluent is directed via underground piping to the East Advanced Pollution Control Facility for dechlorination using sulfur dioxide.\n\n\n1.3 WORST CASE AND ALTERNATIVE CASE RELEASE SCENARIOS\n\nThe worst case release scenario involves a release of 2,000 lb of chlorine over a period of ten minutes.  This is the quantity of a full"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5200,
      "SummaryText": " ton container, which is the largest single vessel associated with the process, and the time period for release required by the regulatory definition of the worst case scenario.  There are presently no chlorine system passive mitigation measures in place at the Facility that would limit the quantity of the release as defined by the regulatory requirements.\n\nIn addition to assuming a release of the total quantity of chlorine in a full ton container, the worst case scenario included other worst case assumptions, such as a low wind speed (1.5 meters per second (m/s)), a highly stable Class F atmosphere, and the maximum ambient temperature over a three year period (100oF).  These worst case assumptions contributed to a highly conservative, large distance to the chlorine toxic endpoint of 0.0087 milligrams per liter (mg/L), or 3 parts per million (ppm), as defined by the regulations.  Under these worst case conditions, the toxic endpoint for chlorine was determined using the DEGADIS model with DEGATEC interface to be 2.2 miles from the point of release.  \n\nUsing the methodology prescribed in the regulations results in potential impacts to public receptors, including a potentially impacted residential population of 38,000.  There were no known environmental receptors, such as wildlife refuges, within this area.  \n\nIt is important to recognize that the regulations require the identification of the potentially impacted population using a circle with a radius that is the maximum distance to the toxic endpoint.  In actuality, the released gas would most likely take the form of an elongated plume, impacting the population within only a portion of the circle located in the downwind direction from the source.  The size of the actual impacted population would therefore likely be only a fraction (estimated to be on the order of 20%) of the potentially impacted population identified in the worst case release scenario analysis.  Thus, a more reasonable estimate of the potentially im"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5200,
      "SummaryText": "pacted population, assuming the worst case release scenario, would likely be on the order of 7,600.\n\nIt is also important to note that the toxic endpoint of 3 ppm used to determine the maximum distance from the source for estimating potential impacts is at the low end of the 3 ppm to 5 ppm range likely to cause mild health effects comprising a slight irritation of the nose and upper respiratory tract, and not more serious health consequences or death. \n\nA more realistic, alternative release scenario was also examined.  This scenario is summarized below.\n\n A whip, the zinc-clad copper tube used to connect containers to the manifold, breaks resulting in the release of the contents of a half-full container of chlorine over a 30-minute period.  Realistic ambient conditions comprising a 3.0 meters per second (m/s) wind speed, Class D atmospheric stability, and 73oF temperature were used.  The distance to the toxic endpoint for chlorine was determined using the DEGADIS model and DEGATEC interface to be approximately 0.81 mile from the point of release.  The potentially impacted population was estimated to be 8,100, whereas the more likely actual impacted population would be on the order of 1,600.  Potential public receptors were located within the endpoint radius, but there were no identified environmental receptors.\n\n\n1.4 ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe Facility has an accidental release prevention program that is based upon a foundation of employee awareness and proactive system maintenance.  This program is documented in the RMP.  The effectiveness of this program, which meets or exceeds all requirements of applicable RMP regulations, is evident by the fact that the Facility has had no significant releases of chlorine in the five years prior to the date of the RMP.\n\n\n1.5 FIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases at the Facility in the five years prior to the date of the RMP that resulted in injuries or death to Facility or Contractor"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5200,
      "SummaryText": " employees onsite or the off-site public, or damage to potential environmental receptors.  \n\n\n1.6 EMERGENCY RESPONSE PROGRAM\n\nThe Facility has an Emergency Response Plan (ERP) that defines the sequence of actions to be taken by Facility employees in the event of an accidental release of chlorine.  This ERP has been communicated to the Clearwater Fire and Rescue Department (CFRD) and the Local Emergency Planning Committee (LEPC).  It is the City's policy with regard to emergency response that its personnel are trained to the First Responder Awareness Level.  These are individuals who are likely to witness or discover a hazardous substance release and who have been trained to initiate an emergency response sequence by notifying the proper authorities of the release.  They would take no further action beyond notifying the authorities of the release.  Thus, it is the City's policy for employees to call 911 in the event of a release emergency and allow the local Hazardous Materials (HazMat) Response Team to mitigate the release conditions.  The CFRD is presently responsible for determining when evacuation of off-site areas is necessary, and for public notification.\n\n\n1.7 PLANNED CHANGES TO IMPROVE SAFETY\n\nThe RMP incorporates a number of modifications to Facility procedures designed to improve employee safety awareness, enhance safe operations and maintenance of the chlorine system, reduce the potential for accidental releases to occur, and increase the speed and effectiveness of the Facility's response should a release occur."
    }
  ]
}