{
  "FacilityID": 52091,
  "FacilityName": "Colton Plant",
  "FacilityStr1": "695 S. Rancho Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Colton",
  "FacilityState": "CA",
  "FacilityZipCode": "92324",
  "Facility4DigitZipExt": "0947",
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "35.083333",
  "FacilityLongDecDegs": "-117.375000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 621961929,
  "ParentCompanyName": "California Portland Cement Company",
  "Company2Name": "Taiheiyo Cement USA, Inc.",
  "CompanyDUNS": 690535786,
  "Company2DUNS": 0,
  "OperatorName": "D. M. Robertson",
  "OperatorStr1": "695 S. Rancho Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Colton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92324",
  "OperatorZipCodeExt": "0947",
  "RMPContact": "Gary E. Thornberry",
  "RMPTitle": "Environmental/Plant Svcs Manager",
  "FTE": 135,
  "OtherEPAFacilityID": "CAD008256372",
  "EPAFacilityID": "100000178274",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "800181",
  "SafetyInspectionDate": "2008-03-08 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-07-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-07-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-06-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-08-16 00:00:00",
  "DeRegistrationEffectiveDate": "2009-11-18 00:00:00",
  "AnniversaryDate": "2013-06-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.05761,
  "FRS_Long": -117.33359,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75730,
      "AltID": "Aqueous Ammonia Injection",
      "FacilityID": 52091,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 77551,
          "ProcessID": 75730,
          "NAICSCode": "32731",
          "_desc": {
            "NAICS_CODE": "32731",
            "NAICS_DESCRIPTION": "Cement Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 100357,
          "ProcessID": 75730,
          "ChemicalID": 57,
          "Quantity": 76900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 600357,
          "ProcessID": 75730,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52091,
      "SummaryText": "California Portland Cement Company has installed an Ammonia Injection System at its Colton Plat to denox the effluents of two rotary cement kilns.  Aqueous ammonia plays an important rolde in reducing emissions from the plant. Given the quantity of aqueous ammonia, the Colton Plant should comply with the California Accidental Release Prevention (CalARP) regulation.  Based on worst case release calculations, it has been concluded that the Colton Plant may comply with program level 1 of CalARP.\n\nCalifornia Portland Cement Company has established a comprehensive safety and emergency response program to minimize the likelihood and severity of all potential accidental mishaps at the plant including release of aqueous ammonia from the Ammonia Injection System.  The Colton Plant staff is highly trained and utilizes modern equipment to monitor plant operations.\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nCalifornia Portland Cement Company has adopted and implemented safety and emergency response policies.  The policies are designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nThe implementation plan for the emergency response and safety policies includes specific steps that Colton Plant management expect its employees to take to protect the health and safety of themselves, other employees, and the community.\n\n\nStationary Source and Regulated Substance\n\nThe Ammonia Injection System  ath the Colton Plant is used for reducing emissions of Nitrogen Oxides from the two rotary cement kilns.  Aqueous ammonia is stored in a 10,000 gallon storage tank, which is designed, constructed and installed according to vessel codes and standards.  The tank is located within a secondary containment with sufficient capacity to contain the entire contents of the storage tank.\n\nAqueous ammonia is pumped from the storage tank using two centrifugal pumps into injection"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52091,
      "SummaryText": " manifolds.  From the manifold, aqueous ammonia is injected into the rotary cement kilns where it reacts with effluent gases.\n\nThe storage tank is located next to the fluidized bed boiler on the west side of the kiln storage silos.  The pumps are located within the secondary containment.  Therfore, and leaks from the pumps or associated piping or valves will be confined to the secondary containment.  The pipes that carry aqueous ammonia to the injection manifolds are routed via dedicated pipe racks along the waste heat boilers, onto the Kiln End Housing Structure, and finally underneath the kiln walkway.  The piping is protected by these various structures from exposure to any external forces.  In fact, the entire system is located at an isolated area of the plant and is not exposed to any vehicle traffic or other external sources of potential harm.\n\n\nHazard Assessment Sumary\n\nA worst case release analysis was conducted using the Federal EPA's recommended assumptions and methodology for dispersion analysis.  The entire contents fo the storage tnak (i.e., 10,000 gallons) was assumed to be spilled into the diked area at 77oF (for an average ambient condition) and 110oF (modeling worst possible condition of the liquid itself, that may never take place).  Using methodologies prescribed by the Federal EPA for aqueous ammonia evaporation from a pool and dispersion downwind (assuming F stability and 1.5 m/s wind speed), it was concluded that for both temperature levels, ammonia vapors will not reach an offsite receptor above the threshold concentration (i.e., 200 ppm) specified in the regulations.\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nCalifornia Portland Cement Company has established a strict safety policy and implementation program.  As part of this program, the potential hazards of aqueous ammonia are recognized and the proper handling of that substance is expected of the employees.  The instructions provided in the Material Saf"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52091,
      "SummaryText": "ety Data Sheet for aqueous ammonia are followed.  All employees have been made aware of the hazards of aqueous ammonia.  \n\n\nFive-Year Accident History\n\nThe five-year accident history (i.e., June 2003 to June 2008) for the California Portland Cement Company Colton Plant Ammonia Injection System reveals that there have been no reportable accidents during this period.\n\n\nEmergency Response Program\n\nCalifornia Portland Cement Company has an emergency response plan in effect for the Colton Plant to handle potential emergency situations at this facility.  Key elements of the emergency response plan include specific steps that Colton Plant management expect its employees to take to protect the health of employees and the community.  The plan includes key phone numbers and contact points, vicinity and evacuation maps, plans for evacuation, fire, injury, earthquake, chemical spill, and health hazards.  The plan includes requirements for conducting exercises and training sessions to ensure that all employees of the plant are knowledgeable about the emergency response plan.\n\n\nPlanned Changes to Improve Safety\n\nThe Ammonia Injection System was designed according to the latest industry codes, standards and practices at the time.  To minimize the possibility of any unconfined spill from the storage tank, pumps, valves and truck unloading connection points are installed inside a diked area.  As mentioned above, storage tank, pumps, valves, and piping are located in an area of the plant that is isolated from other activities and therefore the system is not exposed to any external sources of harm.  The system is operated by qualified personnel using established practices.  System design was reviewed for the risk of upsets for worst case release scenarios.  No additional risk reduciton measures could be identified."
    }
  ]
}