{
  "FacilityID": 52109,
  "FacilityName": "Champion Technologies' Odessa Plant",
  "FacilityStr1": "115 Proctor Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Odessa",
  "FacilityState": "TX",
  "FacilityZipCode": "79762",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48135",
  "LEPC": "Ector County LEPC",
  "FacilityLatDecDegs": "31.873333",
  "FacilityLongDecDegs": "-102.302778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "SW",
  "FacilityURL": "www.champ-tech.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 102475845,
  "ParentCompanyName": "Permian Mud Services, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7935257,
  "Company2DUNS": 7935257,
  "OperatorName": "Champion Technologies, Inc.",
  "OperatorStr1": "115 Proctor Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Odessa",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79762",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Bolding",
  "RMPTitle": "Plant Manager",
  "FTE": 90,
  "OtherEPAFacilityID": "79760CHMPN115P",
  "EPAFacilityID": "100000137602",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-04-02 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-04-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-07-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-07-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-07-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 31.87526,
  "FRS_Long": -102.30276,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75763,
      "AltID": "Ammonia Neutralization",
      "FacilityID": 52109,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 77586,
          "ProcessID": 75763,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 100448,
          "ProcessID": 75763,
          "ChemicalID": 56,
          "Quantity": 67000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 600448,
          "ProcessID": 75763,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 75764,
      "AltID": "Bisulfite Process",
      "FacilityID": 52109,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 77587,
          "ProcessID": 75764,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 100449,
          "ProcessID": 75764,
          "ChemicalID": 49,
          "Quantity": 93000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 600449,
          "ProcessID": 75764,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52109,
      "SummaryText": "Executive Summary for Champion Technologies, Inc., Odessa Plant\n\n1. Accidental Release Prevention and Emergency Response Policies\nThe safety of employees, company operations, and the public are management's most important objectives. The Champion Technologies, Inc. Safety Policy states that the company ?is committed to providing the processes, facilities, standard training, discipline and work culture to ensure a safe work environment for all employees, safety for the communities in which we operate, safe competitive products for our customers, and protection of shareholder assets.? The Odessa plant has developed a comprehensive operational program designed to minimize the potential for accidental releases and to facilitate effective response to accidental releases which includes protection of the public.\n\n2. The Stationary Source and the Regulatory Substances Handled\nThe Odessa plant is located at 115 Proctor Avenue, Odessa, TX. The manufacturing plant is a batch chemical processing and blending facility which produces industrial organic chemicals used primarily in the oil & gas industry. The plant is staffed 24 hours a day, 7 days a week, year round and has full time security personnel. The chemical plant operates three batch chemical reactors and a number of product blenders.\n\nThe following twp RMP-regulated substances are present as raw materials:\n?    Anhydrous Ammonia (NH3) ? Toxic regulated\n?    Anhydrous Sulfur Dioxide (SO2) ? Toxic regulated\n\nThe facility also uses acids (hydrochloric and phosphorus acids, etc.), amines, inorganic bases and petroleum-based and alcohol based solvents (xylene, toluene, aromatic naphthalene, isopropyl alcohol, and methanol). Raw materials are received by rail car, bulk cargo tank truck, and in drums and totes. Finished products are shipped via rail car, bulk cargo tank truck and in drums and totes.\n\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps \nA number of processes at this facility"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52109,
      "SummaryText": " are subject to the OSHA Process Safety Management (PSM) standard under 29 CFR 1910.119. The plant PSM program incorporates all of the PSM elements identified in the regulation. The standards and procedures developed for the PSM program are applied uniformly in the plant to both PSM covered processes and other chemical processes to ensure that the plant is operated safely. The plant operations have also incorporated the requirements of the 40 CFR Part 68 accidental release prevention program into plant operational procedures and practices. The processes at Champion have hazards that must be managed to ensure continued safe operation. Section 7 of the RMP describes existing safety features applicable to prevention of accidental releases of regulated substances at the facility. The accident prevention program is applied to all RMP-regulated processes at Champion. Collectively, these prevention program activities help prevent potential accidental scenarios that could be caused by equipment failures and human error.\n\n4. Five-year Accident History\nThe facility has not experienced any reportable accidents in the past 5 years.\n\n5. Emergency Response Program\nChampion has implemented a written emergency response plan to handle accidental releases of hazardous materials. The plan includes all aspects of emergency response including bringing releases under control (when feasible), adequate first aid and medical treatment, evacuations, and the notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. Employees receive training in emergency procedures. To ensure proper functioning, emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within processes that would require a modified emergency response. The emergency plan has been coordinated with and verified by the Ector County Local Emergency Planning Committee (L"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52109,
      "SummaryText": "EPC). At all times there is at least one employee either on the facility premises or on-call (i.e., available to respond to an emergency by reaching the facility within a short period of time) with the responsibility for coordinating all emergency response measures. This emergency coordinator is thoroughly familiar with all aspects of the facility's emergency response plan, all operations and activities at the facility, the location and characteristics of material/waste handled the location of all records within the facility, and the facility layout. In addition, this person has the authority to commit the resources needed to carry out the emergency response plan.\n\n6. Planned Changes to Improve Safety\nThe Odessa Plant continues to improve safety at the facility through capital investments in facilities and technology to minimize and, where possible, eliminate the potential for releases (including improved perimeter controls and security). The plant is also a Responsible Care member and is in the process of developing a site-specific safety management system conforming to the RC-14001 Environmental Management System standard which includes processes for managing safety, security, and community awareness and protection."
    }
  ]
}