{
  "FacilityID": 52108,
  "FacilityName": "Waycross Water Pollution Control Plant #2",
  "FacilityStr1": "3450 Screven Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Blackshear",
  "FacilityState": "GA",
  "FacilityZipCode": "31516",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13229",
  "LEPC": "City of Waycross Fire Dept.",
  "FacilityLatDecDegs": "31.244722",
  "FacilityLongDecDegs": "-082.312778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "CE",
  "FacilityURL": "www.esginc.net",
  "FacilityEmailAddress": "smurphy@esginc.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Waycross, Georgia",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Waycross",
  "OperatorStr1": "3450 Screven Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Blackshear",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31516",
  "OperatorZipCodeExt": null,
  "RMPContact": "Frank W Baugh",
  "RMPTitle": "City Engineer",
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000203157",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-04-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-07-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-07-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-07-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75761,
      "AltID": "chlorination process",
      "FacilityID": 52108,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 77584,
          "ProcessID": 75761,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 100446,
          "ProcessID": 75761,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 600446,
          "ProcessID": 75761,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 75762,
      "AltID": "dechlorination process",
      "FacilityID": 52108,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 77585,
          "ProcessID": 75762,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 100447,
          "ProcessID": 75762,
          "ChemicalID": 49,
          "Quantity": 5000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 600447,
          "ProcessID": 75762,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52108,
      "SummaryText": "This executive summary provides a brief overview of the Risk Management Program (RMP) and the associated policies at the Waycross Water Pollution Control Plant #2(Plant #2), owned by the City of Waycross, GA and operated by ESG Operations, Inc.\n\n1.0 Accidental Release Prevention and Emergency Response Policies\n\nESG Operations, Inc. believes it is important to provide a safe workplace to its employees and minimize the impact of its operations on the surrounding community and the environment.  Accordingly, ESG has developed proactive safety and environmental programs, which rely upon active employee participation and management leadership and support.  This same proactive philosophy was employed in the development and implementation of the Waycross WPCP RMP for the chlorine system.  ESG Operations, Inc. has determined that the OSHA Process Safety Management standard also applies to the chlorine storage and chlorination process and therefore has prepared this RMP to comply with the RMP Program 3 requirements.  By doing so, ESG affirms its proactive safety and environmental philosophy and acknowledges the inherent value of full RMP compliance.\n\nThe RMP prevention program is arguably the most important element of the rule.  Its program elements require the active participation of facility employees and management in conducting activities aimed at preventing accidental releases of chlorine, a regulated chemical under the RMP regulation.  If prevention activities could be completely successful, there would be no need for emergency response activities, since no releases would occur.  Accordingly, a well-developed and properly implemented prevention program will lower the possibility of an accidental release and minimize the consequences of a release should one occur.\n\nESG Operations, Inc. takes an active role in preventing accidental releases by ensuring that its employees are well-informed regarding the hazards associated with chlorine and sulfur dioxide at plant #2 and ac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52108,
      "SummaryText": "tively participate in process hazard analysis.  ESG Operations, Inc has been operating the system for approximately three years and the system has never been subject to the RMP requirements.  The quantity of chlorine stored onsite has historically been below the threshold trigger of 2500lbs, however future plant loading capacity require the storage of greater than 2500lbs.  Additionally, the quantity of sulfur dioxide at the facility is expected to increase to greater than 5,000lbs and as such ESG has chosen to include sulfur dioxide as part of the RMP as well.  The employees working on the chlorine and sulfur dioxide systems are properly trained in the safe operation and handling of these systems.  Refresher training is provided to the employees annually.  They are aided in this work by standard operating procedures.\n\nESG Operations, Inc. management understands its duty to provide a safe working environment and to take measures to prevent accidents which may have an effect on the surrounding community.  Additionally, ESG Operations, Inc. has established procedures for emergency notification and response. \n\n\n\n2.0 Stationary Source and Regulated Substances\n\nThe Water Pollution Control Plant #2 owned by the City of Waycross, GA is located in Blackshear, Georgia.  The facility treats 3.6 MGD daily average, 4.5 daily peak and 6.2 MGD storm peak of wastewater through a series of physical and chemical treatment operations.  Incoming wastewater initially passes through an automated screening and grit removal process before being passing through primary clarifiers, trickling filters, aeration, secondary clarification, sand filtration and is then pumped to the rapid  infiltration bed treatment plant for additional filtration.  Final effluent is disinfected by chlorination  and subject to dechlorination prior to discharge.  Solids are de-watered by belt filter press prior to landfill.\n\nThe Waycross WPCP utilizes chlorine as a biocide in the treatment of wastewater and sulfur "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52108,
      "SummaryText": "dioxide as a de-chlorination agent.  The chlorine is stored in one-ton cylinders with a maximum intended inventory of two (2) containers (4000 lbs).  The sulfur dioxide is stored in one-ton cylinders with a maximum intended inventory of three (3) containers (6000lbs).    As required by the RMP Regulation, ESG Operations, Inc. has conducted the Offsite Consequence Analysis and reported it to EPA using RMP Submit 2004.\n\n3.0 General Accidental Release Prevention Program and Chemical-specific Prevention \nSteps\n\nThe prevention program and chemical-specific prevention steps are described in detail in the Waycross WPCP RMP manual.  The prevention program includes the following elements:\n\n3.1 Process safety information, which includes information pertaining to the hazards of chlorine in the process, process technology and process equipment.\n3.2 Process hazard analysis (PHA), which includes a systematic evaluation of the hazards of the chlorine and sulfur dioxide processes, identification of previous process incidents, engineering and administrative controls, consequences of failure of the engineering and administrative controls, facility siting, human factors, and possible safety and health effects of failure of controls.  PHA was first performed in July 2008.\n3.3 Operating procedures, which include steps for each operating phase, operating limits, safety and health considerations and safety systems and their functions.  The operating procedures were developed and validated in July 2008.\n3.4 Training for each Waycross WPCP employee involved in operating the chlorine system.\n3.5 Mechanical integrity procedures to maintain the on-going integrity of the chlorine process equipment.\n3.6 Management of change procedure to manage changes (other than replacements in kind) to the chlorine system.  The management of change procedures were developed and implemented in July 2008.  Signs are posted alerting employees to this requirement.\n3.7 Pre-startup safety review for additions or sig"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52108,
      "SummaryText": "nificant modifications to the chlorine process or any new regulated chemical process.\n3.8 Compliance audits at least every three years moving forward will be conducted to evaluate compliance. \n3.9 Incident investigation, to be conducted and documented for each incident that resulted in, or could have reasonably resulted in a catastrophic release of chlorine from the facility.\n3.10 Employee participation in the development and implementation of the facility RMP employee access to RMP information.\n3.11 Hot Work prohibition policy on or near the chlorine system when chlorine in present in the affected section of the process.  The Hot Work Procedures were reviewed in July 2008.  Signs are posted alerting employees to this Hot Work procedure requirement.\n3.12 Contractor management program, to ensure appropriate evaluation and selection of qualified contractors for work on or near the chlorine system, proper notification of contractors regarding known chlorine system hazards and the Waycross WPCP emergency evacuation plan, limited access to the chlorine process and evaluation of contractor performance.\n\nIn addition to these elements, the chlorine and sulfur dioxide storage areas at the Waycross WPCP are equipped with leak detectors that are designed to continuously monitor the air for chlorine and sulfur dioxide gas.  If the chlorine or sulfur dioxide sensors detect a specified level of chlorine or sulfur dioxide, alarms will be activated and a high rate ventilation system can be activated.  The ventilation system withdraws gas and air from a low elevation in the storage rooms to an outdoor location.  The alarm system is maintained and tested on a regular basis to ensure proper operation should there be a release.  Records of testing are maintained in the site maintenance management system - GBA.  Management of Change procedures will be used for the upgrades to the chlorine system.  Signs are posted alerting employees to the Management of Change requirement.\n\n4.0 Five Yea"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 52108,
      "SummaryText": "r Accident History\n\nThere have been no accidental releases of chlorine.\n\n5.0 Emergency Response Program\n\nThe facility has established and maintains an Emergency Notification Program that is coordinated with local response agencies, including the Waycross Fire Department.  The program is described in detail in the manual and meets the requirements of 40 CFR 68.95, which includes facility notification to emergency responders and evacuation procedures.  The goals of the program are to protect onsite employees from the hazardous effects of chlorine release and to minimize the effects of such releases on the general public.  This program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\n6.0 Planned changes for Improved Safety\n\nIdeas for changes to improve safety are actively sought from employees.  Employee participation meetings which focus on safety issues are held regularly at the Waycross WPCP.  Employees are encouraged and trained to recognize hazards and to present ideas to eliminate them or to minimize the potential consequences of such hazards.\n\nAs part of the development of the Waycross WPCP RMP program, the initial PHA was performed in July 2008 with key employees to meet the prevention program requirements.\n"
    }
  ]
}