{
  "FacilityID": 5211,
  "FacilityName": "Madison Farmers Elevator Company",
  "FacilityStr1": "222 Farmer Avenue South",
  "FacilityStr2": null,
  "FacilityCity": "Madison",
  "FacilityState": "SD",
  "FacilityZipCode": "57042",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46079",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "44.001944",
  "FacilityLongDecDegs": "-97.135556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "mfarmers.hcpd.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Madison Farmers Elevator Company",
  "OperatorStr1": "P.O. Box F",
  "OperatorStr2": "222 Farmer Avenue South",
  "OperatorCity": "Madison",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57042",
  "OperatorZipCodeExt": null,
  "RMPContact": "Karla Tolley",
  "RMPTitle": "Agronomy Manager",
  "FTE": 15,
  "OtherEPAFacilityID": "057354-SD-001",
  "EPAFacilityID": "100000065564",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-01 00:00:00",
  "SafetyInspectionBy": "State Dept. of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2003-03-07 00:00:00",
  "DeRegistrationEffectiveDate": "2003-02-26 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 44.00194,
  "FRS_Long": -97.13556,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6146,
      "AltID": "Anhydrous Ammonia Sales",
      "FacilityID": 5211,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6296,
          "ProcessID": 6146,
          "NAICSCode": "45439",
          "_desc": {
            "NAICS_CODE": "45439",
            "NAICS_DESCRIPTION": "Other Direct Selling Establishments"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6681,
          "ProcessID": 6146,
          "ChemicalID": 56,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506681,
          "ProcessID": 6146,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5211,
      "SummaryText": "Madison Farmers Elevator Company is an independent company serving the Lake County area.  The facilities owned and operated by the company include a supply store, a grain elevator, and a fertilizer retailing operation.  These facilities are located near the city of Madison.\n\nThe site contains only one substance present in a large enough quantity to be subject to the Risk Management Rule.  Anhydrous ammonia is stored at the site prior to sales to independent consumers.  It is contained in one large tank which has a maximum capacity of 16,000 gallons.  Administrative policy at the facility dictates that the tank never be filled above 85% of maximum capacity.  Therefore, the maximum amount of anhydrous ammonia that will ever be present at the site is 14,000 gallons, or 80,000 pounds.  It must also be noted that this maximum amount is normally present for a short period of time, when seasonal demand for this product is likely to be high.  The tank is located in the southeast quarter of the property and stands separate from other features on the property.  \n\nThe site is located near the southeast edge of the city of Madison, which has a population of roughly 6,300 people.  The area immediately surrounding the site contains mainly commercial and industrial facilities, but some residences are present.  The main residential areas of Madison lie to the east and northeast of the site.  Several industrial features are located near the site, including railyards, equipment lots, livestock production facilities, and manufacturing plants.  The areas beyond the city limits to the west and south are primarily agricultural lands which are sparsely populated.  \n\nThe worst-case and alternative release scenarios for the site were modeled using RMP Comp.  In the worst-case scenario, 80,000 pounds of anhydrous ammonia gas would be released over a period of 10 minutes.  Using a wind speed of 1.5 m/sec and an F Atmospheric Stability Class, it was determined that the distance to the toxic en"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5211,
      "SummaryText": "dpoint would be 3.3 miles.  No passive mitigation was considered in this model.  This radius would encompass the entire city of Madison.  Using the USGS quadrangles for this area, it was estimated that a residential population of up to 7,200 people may be present within this radius.  Potential receptors include residences, schools, hospitals, commercial, office, and industrial areas, and the municipal airport.  Environmental receptors within this radius include Lake Herman State Park, as well as numerous sloughs and wetlands.  \n\nA transfer hose failure was determined to be a likely alternative release scenario.  It was estimated that no more than 2 minutes would be required to halt the flow of anhydrous ammonia if this were to occur.  An estimated 600 pounds of ammonia would be released over this duration.  Assuming a wind speed of 3 m/sec and an Atmospheric Stability Class of D, it was determined that the distance to the toxic endpoint would be 0.1 miles.  No active or passive mitigation was considered in this model.  Receptors within this radius include residences and industrial areas.  It is estimated that a residential population of up to 10 people may be present within this radius.  Environmental receptors as defined in the data elements are not present within this radius.  \n\nThe facility has an excellent safety record.  No reportable accidents or incidents as referred to in the data elements have occurred within the past five years.  This safety record is the result of the priority that safety is given at the facility.  The small number of employees who handle anhydrous ammonia eases ensuring that proper training is provided and proper procedures are followed.  Any new employees, or employees who may be switching to new duties, are provided with a combination of classroom and on-the-job training.  Competency testing in the form of oral and written tests is performed.  Additionally, employees are then observed closely over the initial months of employment at th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5211,
      "SummaryText": "e facility by the facility management to ensure proper job performance.  Any knowing violation of safe working procedures is not tolerated.  Safety meetings are conducted periodically.  Safety and emergency response plans are prepared in-house and updated periodically.  Inspections of equipment at the facility are also periodic.  A walk through inspection of the process area is performed on a daily basis.  \n\nThe major hazard at the facility is the release of anhydrous ammonia to the atmosphere.  Some of the scenarios which could lead to this are equipment failure, damage to the tank from external sources (collision, etc.), corrosion of the tank and/or valves and piping, overfilling an/or overpressurization, and failure of transfer mechanisms.  However, the possibility of these occurring is limited by the presence of such safety features as relief valves, check valves, interlocks, an emergency air supply, grounding equipment, emergency power, manual and automatic shutoffs, a backup pump, and an excess flow device.  Transfer mechanisms are also locked closed when not in use.  \n\nThe emergency response program for the facility is coordinated with the Lake County LEPC.   It includes actions to be taken in case of a release, emergency health care information, and an extensive contact list for informing the public and local agencies.  The plan is reviewed periodically.  Facility personnel receive training for emergency response in order to minimize any delays in dealing with an accidental release.  Personal protective equipment is maintained at the site and employees are trained in its use.  \n\nIn summary, Madison Farmers Elevator Company has an excellent safety record.  However, this record has not resulted in complacency.  Management and employees are dedicated to performing their duties safely, and have demonstrated that they are willing to comply with all applicable standards and guidelines.  Changes in record keeping and reporting required under the RMP Rule will be im"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5211,
      "SummaryText": "plemented in the facility safety plan.  No additions or facility modifications are planned at this time."
    }
  ]
}