{
  "FacilityID": 52133,
  "FacilityName": "Cascade Grain Products",
  "FacilityStr1": "81200 Kallunki Road",
  "FacilityStr2": null,
  "FacilityCity": "Clatskanie",
  "FacilityState": "OR",
  "FacilityZipCode": "97016",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41009",
  "LEPC": "Oregon LEPC",
  "FacilityLatDecDegs": "46.173333",
  "FacilityLongDecDegs": "-123.162083",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Cascade Grain Holdings",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Cascade Grain Products",
  "OperatorStr1": "8513 NE Hazel Dell Avenue, Suite 20",
  "OperatorStr2": null,
  "OperatorCity": "Vancouver",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98665",
  "OperatorZipCodeExt": null,
  "FTE": 47,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000203175",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "05-0006",
  "SafetyInspectionDate": "2008-06-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-07-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-07-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-04-10 00:00:00",
  "DeRegistrationEffectiveDate": "2013-03-18 00:00:00",
  "AnniversaryDate": "2013-07-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 46.174838,
  "FRS_Long": -123.165632,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75789,
      "AltID": "11",
      "FacilityID": 52133,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 100474,
          "ProcessID": 75789,
          "ChemicalID": 57,
          "Quantity": 296000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 77612,
          "ProcessID": 75789,
          "NAICSCode": "325193",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 44497,
              "Process_NAICS_ID": 77612,
              "SafetyReviewDate": "2008-06-18 00:00:00",
              "PHA_Date": "2007-09-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-03-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-05-20 00:00:00",
              "TrainingReviewDate": "2008-05-30 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-05-20 00:00:00",
              "EquipmentInspectionDate": "2008-05-19 00:00:00",
              "EquipmentTested": "Ammonia Tank",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2008-03-07 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-05-20 00:00:00",
              "HotWorkPermitReviewDate": "2008-04-18 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 64639,
                  "PreventionProgram3ID": 44497,
                  "ProcessChemicalID": 100474
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52133,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-06-26 00:00:00",
    "ERTrainingDate": "2008-06-26 00:00:00",
    "CoordinatingAgencyName": "Oregon Emergency Response Center",
    "CoordinatingAgencyPhone": "8004520311",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 52133,
      "SummaryText": "each employee will be conducted.  If the evaluation is below acceptable performance levels in regards to safety, further training will be provided.  Training for the PSM/RMP program will be provided as often as necessary, but no less than once every 3 years.\n\nRecords are kept for all training for each employee involved in the PSM/RMP program.  The record will contain the identity of the employee, the dates of training, and the means used to verify the training.\n\n\n\n7.0\tContractors\n\nThis section applies to contractors performing maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to a covered process.  It does not apply to contractors providing incidental services which do not influence process safety, such as janitorial work, food and drink services, laundry, delivery or other supply services.\n\nCGP shall obtain and evaluate information regarding the contract employer¿s safety performance and programs.  This may include information on injury and illness rates, experience rates, and contractor references.  An injury and illness log related to the contractor¿s work in process areas will be maintained.\n\nThe contract employer shall ensure that each employee is trained to safely perform tasks, shall ensure that each employee is instructed in the known potential fire, explosion or toxic release hazards and the associated emergency action plan, training must be documented, ensure that each employee follows the rules, and shall advise the employer of any unique hazards presented by their work.\n\nCGP has created a contractor orientation and agreement sheet to ensure all CGP obligations are met and carried out.  More details about these items can be found in the Contractor Orientation and Approval procedure.  \n\n8.0\tPre-Startup Safety Review\n\nPre-Startup safety reviews (PSR) shall be performed on new and/or modified facilities and/or processes that require a change in the process safety information.  The pre-startup safety review shall take place"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 52133,
      "SummaryText": "d space entry procedures as indicated in section 5.0 of this plan.    \n\n11.0\tManagement of Change\n\nManagement of change (MOC) has been established to manage changes to process chemicals, technology, equipment (except for `replacement in kind¿), procedures and changes to facilities that affect the covered process.  Details of MOC can be found in the MOC program in the Procedure Manual.\n\n12.0\tIncident Investigation\n\nIncident Investigations are performed to determine the root cause(s) of incidents in order to prevent future occurrences.  All incidents will be promptly investigated and documented following the incident.  Time is of the essence when performing incident investigations.  Facts can be confused over time.  \n\nEmployees involved in the incident will be interviewed to obtain as much information as possible.  Cooperation of employees is essential to the investigation.  The focus is to find facts, not to place blame.  \n\nAll resolutions and corrective actions will be documented on the report.  The incident investigation reports will be retained.  See the Incident Investigation Program for more details.\n\n13.0\tEmergency Planning and Response\n\nCGP has developed an Integrated Contingency Plan (ICP).  This plan includes emergency planning and response procedures.  It includes emergencies such as bomb threats, severe weather, evacuation, fire/explosion, etc.  All employees are trained according to their responsibility when hired and annually thereafter.  Drills will also be conducted to verify the effectiveness of the program and to ensure employee understanding.  See the ICP for more details.\n\n14.0\tCompliance Audits\n\nCGP will use compliance audits as a technique to gather sufficient facts and information to verify compliance.  A team will be used perform audits of this program.  Theses audits will be conducted every 3 years.\n\nThe team will be selected based on their knowledge, experience and training.  The audit will compare what is actually done with the written PSM/R"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 52133,
      "SummaryText": "MP program.  It may include a review of relevant documentation, inspection of the facility, and interviews with plant personnel.  The interviews will assist in determining the effectiveness of training and assessing the knowledge of the employee.  The written program may be evaluated for adequacy of content, frequency of training, effectiveness of training in terms of its goals and objectives as well as how it fits into meeting the programs requirements.  \n\nThe audit will be documented.  It will include the areas audited, deficiencies, and corrective actions.  If necessary the PSM/RMP program will be updated.  Audit records can be found in Appendix 8.\n\n15.0\tTrade Secrets\n\nSeveral processes and materials with fall into the areas of trade secrets as set forth in OSHA 1910.119(p), especially information listed in Section 3.0.  CGP may require team members and those working on-site to sign confidentiality agreements (CA).  See the confidentiality agreement program for more details.\n\nTrade secret information shall be made available to team members involved in the process safety information process, plant operations, and incident investigations.  It shall also be made available to anyone involved in emergency planning and emergency response and compliance audits.  Receiving this information require signing a CA."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 52133,
      "SummaryText": "Process Safety Management (PSM) & Risk Management Plan (RMP)\n\nPurpose ¿ The purpose of this document is to provide instruction for Berggruen BioFuels Holdings, LLC* and its subsidiaries to prevent and/or minimize the consequences of unwanted and catastrophic releases of hazardous chemicals especially into locations that could expose employees and the surrounding communities to serious hazards. \nResponsibility ¿ Management is responsible for ensuring all aspects of the PSM/RMP program are implemented and carried out.  Supervisors and Employees must be familiar with and have an understanding of the hazards, operating procedures, safety systems, start-up procedures, shutdown procedures, training contractor involvement, maintenance, emergency planning, and emergency response.\n\nChange Notes ¿ \n\nRev. 01 ¿05/20/2008 ¿ Original Release.\n\nDefinitions\n\t\n1.0\tCatastrophic release ¿ a major uncontrolled emission, fire, or explosion, involving one or more highly hazardous chemicals, that presents serious danger to employees in the workplace.\n2.0\tFacility ¿ the buildings, containers, or equipment which contains a process.\n3.0\tHighly hazardous chemical ¿ a substance possessing toxic, reactive, flammable, or explosive properties.  Over 10,000 pounds of a flammable liquid or gas, and/or listed in 29 CFR 1910.199, App. A or 40 CFR 68.130, App. A.\n4.0\tProcess ¿ any activity involving a highly hazardous chemical including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  For purposes of this definition, any group of vessels which are interconnected and separate vessels which are located such that a highly hazardous chemical could be involved in a potential release shall be considered a single process.\n\nTable of Contents\n\n1.0\tIntroduction to PSM/RMP\n2.0\tEmployee Participation\n3.0\tProcess Safety Information\n3.1\tChemical Hazard Information\n3.2\tTechnology Information\n3.3\tEquipment Information\n4.0\tProcess Hazard Analysi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52133,
      "SummaryText": "s\n5.0\tOperating Procedures\n6.0\tTraining\n7.0\tContractors\n8.0\tPre-Startup Safety Review\n9.0\tMechanical Integrity\n10.0\tNon-routine Work Authorizations\n11.0\tManagement of Change\n12.0\tIncident Investigation\n13.0\tEmergency Planning and Response\n14.0\tCompliance Audits\n15.0\tTrade Secrets\n\n1.0\tIntroduction to PSM/RMP\n\t\t\t\nThis program applies to any process that involves a chemical at or above the specific threshold quantities list in Appendix A of 29 CFR 1910.119 (PSM) or Appendix A of 40 CFR 68.130 (RMP).  \n\nProcess Safety Management (PSM)\n\nAccording to 29 CFR 1910.119, a PSM is required for facilities which have a process that involves a flammable liquid or gas on-site in one location, in a quantity of 10,000 pounds or more and is not a hydrocarbon solely used for work place consumption as a fuel, or is stored in an atmospheric tank that is kept below the boiling point without the benefit of chilling or refrigeration.  \n\nEthanol, natural gasoline and denatured ethanol are defined as flammable liquids.  The storage of flammable liquids in atmospheric tanks is exempt from coverage; however the Occupational Safety and Health Administration (OSHA) has indicated that accidents involving flammable liquids would be investigated under the general duty clause.  Manufacturing processes that store or use greater than 10,000 pounds of a flammable liquid are covered.  The distillation, dehydration and evaporation portion of the CGP process contains greater than 10,000 pounds of ethanol, a flammable substance. \n\nSolutions with ammonia content greater than 44 percent and in a quantity greater than 15,000 pounds are regulated under the PSM standard.  The facility is also subject to regulations under EPA RMP 40 CFR Part 68 (see below) and meets the Program 3 eligibility requirements.  One of the requirements of a facility subject to Program 3 is to conduct a PSM review of the covered process.\n\nRisk Management Plan (RMP)\n\nAccording to 40 CFR Part 68, a RMP is required for facilities that co"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52133,
      "SummaryText": "ntain more than a threshold quantity of a regulated substance in a process, as determined under Part 68.115.  Cascade Grain Products (CGP) stores more than the 20,000 pound threshold of aqueous ammonia with a concentration greater than 20%, which is an RMP regulated substance.  Aqueous Ammonia is the only RMP regulated substance.\n\n2.0\tEmployee Participation\n\nIt is CGP¿s desire to assure full participation in the PSM and RMP.  This involvement will lead to a better understanding by all of the hazards, operating procedures, safety systems, start-up procedures, shut-down procedures, contractor involvement, maintenance, emergency planning and emergency response necessary to implement a full and complete program.  \n\nThis program will be available to each employee to ensure they are consulted in the development of the Process Hazard Analysis (PHA) and all other aspects of this program.  Upon request, they will also be given access to the PHA¿s and other information required under this standard.  An agreement explaining this information will be provided to each employee.  This letter will be signed, returned to the HR/Safety Manager and kept in Appendix 1.  \n\nA safety committee has been created and may be available to assist with any aspect of this program.\n\n3.0\tProcess Safety Information\n\nProcess safety information shall include information pertaining chemical hazards, technology, and equipment.\n\n3.1\tChemical Hazard Information\n\nChemical hazard information shall include information pertaining to hazards of the highly hazardous chemicals used or produced by the process, and the information pertaining to the equipment in the process.  Information pertaining to highly hazardous chemicals in the process shall consist of toxicity information, permissible exposure limits, physical data, reactivity data, corrosivity data, thermal and chemical stability data, and hazardous effect of mixing different materials.  \n\nThe chemicals for the CGP facility that apply, but are not limited"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52133,
      "SummaryText": "to, ammonia, natural gasoline, ethanol and denatured ethanol.  The Material Safety Data Sheets (MSDS) for these chemicals can be found in Appendix 2.\n\n3.2\tTechnology Information\n\nTechnology information shall include information on the following:\n\no\tProcess Flow Diagram ¿ See Appendix 3.\no\tProcess Chemistry or Brief description of the process ¿ See Appendix 4.\no\tMaximum Intended Inventory ¿ Basically, this is limited to highly hazardous chemicals as required by OSHA. \no\tSafe Upper and Lower Limits ¿ This information can be found in the standard operating guidelines and/or operating manuals created by CGP and provided by the design engineer.\no\tConsequences of Deviations ¿ These consequences have been determined for safety, and most quality and environmental purposes during the Hazard and Operability Study (HAZOP).\n\n3.3\tEquipment Information\n\nEquipment information shall include information on the following:\no\tMaterials of Construction ¿ This has been determined by the design company.  Manuals and specification sheet for most of the equipment has been provided.  Other drawings, such as P&ID¿s, may have additional details.\no\tPiping & Instrumentation Diagrams (P&ID¿s) ¿ All available drawings can be found in the Administration Building.  They will be used to assist in the analysis, troubleshooting and quality assurance of our systems.\no\tElectrical Classification ¿ These classifications are made to ensure the equipment is properly operated and isolated from flammable hazard along with meeting the NFPA class codes.\no\tRelief System Design & Design Basis ¿ These systems are intended to be one of the last lines of defense against rupture of equipment due to excessive pressure.  Information on these systems may be found in the maintenance management systems or in the P&ID¿s.\no\tVentilation Design¿ These may be documented within P&ID¿s or within the maintenance management system.\no\tDesign Codes & Standard Employed ¿ These may be documented within P&ID¿s or within the maintenance"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 52133,
      "SummaryText": "management system.\no\tMass & Energy Balances ¿ See Appendix 5 for details.\no\tSafety Systems ¿ These systems consist of interlocks, detection or suppression systems.  Most of the details for this system can be found in the P&ID¿s.\n\n4.0\tProcess Hazard Analysis\n\nAn initial process hazard analysis (PHA) on these processes has been performed.  The PHA was appropriate to the complexity of the process and has identified, evaluated, and controlled the hazards involved.  The methodology used for the initial PHA was a Hazard and Operability Study (HAZOP).  See Appendix 6 for details.\n\nThe PHA is designed to analyze the possible causes and consequences of fires, explosions, releases of toxic chemicals, and major spills of hazardous chemicals.  We shall focus on the equipment, instrumentation, utilities, human actions (routine and non-routine) and external factors that might effect the process.\n\nAt least every 5 years after completion of the initial PHA, the PHA shall be updated and revalidated by a team meeting the qualifications as determined by this program to assure that the PHA is consistent with the current process.  For this update, one or more of the following methodologies can be used, as appropriate:\no\tWhat-if\no\tChecklist\no\tWhat-if Checklist\no\tHazard and operability study (HAZOP)\no\tFailure mode and effects analysis\no\tFault tree analysis\n\n5.0\tOperating Procedures\n\nWritten operating procedures have been developed and implemented to provide clear instruction for safely conducting activities involved in each process consistent with the process safety information and shall address the following phases.\no\tOperating Phase\n¿\tInitial Startup\n¿\tNormal Operations\n¿\tTemporary Operations\n¿\tEmergency Shutdown\n¿\tEmergency Operations\n¿\tNormal Shutdown\n¿\tStartup following a turnaround\n\no\tOperating Limits\n¿\tConsequences of deviation\n¿\tStep required to correct or avoid deviation\n\no\tSafety and Health Considerations\n¿\tProperties of, and hazards presented by, the chemicals used in the proce"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 52133,
      "SummaryText": "ss\n¿\tPrecautions necessary to prevent exposure, including engineering controls, administration controls, and personal protective equipment\n¿\tControl measures to be taken in physical contact or airborne exposure occurs\n¿\tQuality control for raw materials and control of hazardous chemical inventory level\n¿\tAny special or unique hazards\n\no\tSafety system and their functions\n\nWritten operating procedures are readily available to the employees.  Most of which will be found in the control room.  These procedures will be reviewed as often as necessary to assure they reflect the current practice.  They will be certified annually.  This certification will be reflected with a revision date and/or signature and date.  \n\nSafe work practices have been developed and implemented to provide for the control of hazards during operations.  These practices shall apply to both the employees and contracted employees.  Some of the safe work practices include lockout/tagout, confined space entry, line breaking, and access.  All of these can be found on the server and/or in the procedures manual.  \n\n6.0\tTraining\n\nEach employee involved in the operating process will be trained in an overview of the process and in standard operating procedures.  In addition, employees will be trained on safe work practices, emergency evacuation, safety procedures, routing and non-routine work authorization activities, confined space entry, LOTOTO, and many other areas as necessary to protect the employee and process.\n\nTraining may be conducted with different techniques such as hands-on, classroom, on-the-job, video programs, written materials, and any other technique to provide clear and effective training.  Employees may be tested in some areas to ensure their competence and knowledge of the area.\n\nRefresher training shall be provided as determined.  CGP wants to ensure that the employee involved understands and adheres to the current operating procedures of the process.  Formal and information evaluation of"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 52133,
      "SummaryText": "prior to the introduction of highly hazardous chemicals.  This will include verifying that construction and equipment are in accordance with design specifications, verifying that all safety, operating, maintenance, and emergency procedures are in place and/or properly updated, employees are trained, and the pre-startup safety review team shall ensure that all items identified during the process hazard analysis have been accounted for.\n\nChanges in the process safety information include:\no\tInformation associated with the highly hazardous chemicals ¿ Toxicity information, PELs, physical data, concentrations, etc. \no\tInformation regarding to process technology ¿ PFDs, inventory amounts, safe upper and lower operating limits, deviations, etc.\no\tInformation pertaining the process equipment ¿ Materials of construction, P&IDs, electrical drawings, PSVs, safety systems, energy balance, etc.\n\nA team shall conduct the PSR.  The team shall be cross functional in nature.  Its membership shall consist of team members from various levels and areas of the facility.  It also my enlist contractor assistance in this process.  The size and structure of the team may also vary based on the complexity of the PSR.  Team members not designated may also request participation in this.\n\nFor existing processes that have been shutdown for major modification shall go through the management of change (MOC) process before any changes are implemented.    The MOC process requires that a PSR be completed any time there is a change in the PSI.\n  \nOnce the PSR is complete, it will be given to the HR/Safety Manager for recordkeeping.  See PSR form in Appendix 7.  \n\n9.0\tMechanical Integrity\n\nMechanical Integrity applies to several types of process equipment including pressure vessels and storage tanks, piping systems (including piping components such as valves), relief and vent systems and devices, emergency shutdown systems, controls (including monitoring devices and sensors, alarms, and interlocks), an"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 52133,
      "SummaryText": "d pumps.  For each of this process equipment, inspections and testing, training, maintenance, and quality assurance will be performed.\n\nTo manage the mechanical integrity, a maintenance management system will be used.  The functions of the this system will include the equipment ID #¿s, procedures/frequency of preventive maintenance in accordance with manufacturer¿s instruction, documenting deficiencies and corrective actions, documenting inspections and testing, controlling spare parts inventory, and the ability to evaluate trends for troubleshooting purposes.  A set of manuals will be kept for each piece of equipment, where available.\n\nEach inspection and test performed on process equipment will be documented in the maintenance management system.  This will include the date of the inspection or test, the name of the person who performed the inspection or test, the serial or equipment ID #, a description of the inspection or test performed, the results, and criteria for acceptable test results.  \n\nEach employee involved in the maintenance of this equipment will be properly trained.  This training will consist of an overview of the process and its hazards and in the procedure applicable to the employee¿s task to assure they can perform the tasks in a safe manner.\n\nFor Quality Assurance purposes, process equipment will be checked to assure it is suitable for the process application for which it is used including spare parts.  This information will also be documented within the maintenance management system.  \n\n10.0\tNon-routine Work Authorizations\n\nThe non-routine work authorizations for the CGP facility include Hot Work Permits.  Details of this permit and how is used can be found in the Hot-Safe Work Program.  The permit documents that the fire prevention and protection requirements have been implemented prior to the beginning of hot work operations.\n\nCGP will control all non-routine work in the process areas.  This may also include LOTOTO, line breaking, and confine"
    }
  ]
}