{
  "FacilityID": 52142,
  "FacilityName": "Pinedale Natural Gas",
  "FacilityStr1": "PO Box 649",
  "FacilityStr2": "108 N Jackson Ave",
  "FacilityCity": "Pinedale",
  "FacilityState": "WY",
  "FacilityZipCode": "82941",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56035",
  "LEPC": "Sublette County LEPC",
  "FacilityLatDecDegs": "42.822617",
  "FacilityLongDecDegs": "-109.870590",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Summit Energy, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Steve Shute",
  "OperatorStr1": "PO Box 649",
  "OperatorStr2": "108 N Jackson Ave",
  "OperatorCity": "Pinedale",
  "OperatorStateFIPS": "WY",
  "OperatorZipCode": "82941",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000203193",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-07-15 00:00:00",
  "ErrorReportDate": "2008-07-15 00:00:00",
  "ReceiptDate": "2008-07-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-07-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-07-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 42.822617,
  "FRS_Long": -109.87059,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75798,
      "AltID": "Gas & Liquid Processing",
      "FacilityID": 52142,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 100483,
          "ProcessID": 75798,
          "ChemicalID": 118,
          "Quantity": 12240.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 100484,
          "ProcessID": 75798,
          "ChemicalID": 125,
          "Quantity": 10800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 100485,
          "ProcessID": 75798,
          "ChemicalID": 98,
          "Quantity": 9360.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 77621,
          "ProcessID": 75798,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52142,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-08-03 00:00:00",
    "ERTrainingDate": "2007-08-03 00:00:00",
    "CoordinatingAgencyName": "Sublette County LEPC",
    "CoordinatingAgencyPhone": "3073674378",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 52142,
      "SummaryText": "which is a vital part of any safety program.  Training is conducted according to a schedule so employees and contractors are given the most up to date information available.  All new and modified equipment is designed with appropriate safety controls and devices."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 52142,
      "SummaryText": "Summit Energy, LLC Pinedale Natural Gas Facility Risk Management Plan Executive Summary\n\nAccidental Release Prevention and Emergency Response Policies\nThe Pinedale Natural Gas Facility is committed to protecting the health and safety of company personnel, contractors working in the facility, our neighbors and the surrounding community and the environment.  This commitment is strongly supported by senior management and is demonstrated by the resources invested in accident prevention, such as employee training and in considering safety in the design, installation, operation and maintenance of our facility.  This location implements both administrative and engineering controls to reasonably minimize the risk of an uncontrolled release of a hazardous substance.  The facility does not anticipate having any type of uncontrolled release.  However, if an uncontrolled release does occur, the personnel at the facility in cooperation with local agencies are trained to respond, minimize and eliminate any exposure that would occur to protect employees and the surrounding area.\n\nDescription of Stationary Source and Regulated Substances\nPinedale Natural Gas is a facility which receives raw natural gas from well production.  The raw gas is dehydrated and contaminants removed.  Marketable gas is delivered via pipelines.  Natural gas liquids are extracted and stored on site. The extracted natural gas liquids include propane, butane, pentane and hexane+ natural gasoline mixture that are delivered to market via transportation vehicles.  There are no listed toxic substances which exceed their respective threshold quantities stored at this facility.  \n\nHazard Assessment ¿ Worst Case Scenario\nThe Worst Case Scenario for this facility is a release of a flammable mixture that would result as a failure of a natural gas liquids storage tank releasing the entire contents instantaneously to the atmosphere having an offsite impact.  EPA¿s RMP*Comp¿ was used to calculate this release scenario.  T"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52142,
      "SummaryText": "his type of scenario is unlikely to occur.  In addition, qualified individuals operate this facility daily.  The equipment is inspected and maintained according to a preventative maintenance schedule further reducing the likelihood of this release occurring.\n\nHazard Assessment ¿ Alternative Release Scenario\nAn Alternative Release Scenario was not explored for this facility as it falls under a Level 1 Risk Management Plan.\n\nTraining\nAn established comprehensive training program has been developed and implemented at the facility.  All employees are trained in an overview of the process as well as in appropriate safe work practices per the corporate safety guidelines.  In addition to training required of all employees, personnel having responsibilities under the operating and maintenance procedures are trained in those procedures.\n\nSafe Work Practices\nSafe work practices have been developed to ensure safe operations that are consistent with industry practice and meet regulatory requirements.  Safe work practices include site control, lockout/tagout, line breaking, confined space entry and hot work to ensure the safety and well being of employees and the surrounding area.\n\n5 Year Accident History\nThe Pinedale Natural Gas facility is a newly constructed gas plant.  As such, there have been no releases of listed Hazardous Substances which have resulted in offsite effects.\n\nEmergency Response Program\nPinedale Natural Gas has a written emergency response procedure to protect workers, ensure public safety and to protect the environment.  These procedures include response to a hazardous substance release, evacuation, accounting for personnel and company and agency notification.  The emergency response plan is coordinated with the local emergency responders including local law enforcement and the Sublette County LEPC.\n\nPlanned Changes to Improve Safety\nThe plant personnel are continually developing new ways to improve the safety of the facility.  This is done through training"
    }
  ]
}