{
  "FacilityID": 52193,
  "FacilityName": "City of Sweetwater Water Treatment Plant",
  "FacilityStr1": "169 CR 217",
  "FacilityStr2": null,
  "FacilityCity": "Sweetwater",
  "FacilityState": "TX",
  "FacilityZipCode": "79556",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48353",
  "LEPC": "Nolan County LEPC",
  "FacilityLatDecDegs": "32.444603",
  "FacilityLongDecDegs": "-100.421837",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Sweetwater",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Sweetwater",
  "OperatorStr1": "P.O. Box 450",
  "OperatorStr2": null,
  "OperatorCity": "Sweetwater",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79556",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eddy Campbell",
  "RMPTitle": "Director of Utilities",
  "FTE": 7,
  "OtherEPAFacilityID": "1000 0019 0198",
  "EPAFacilityID": "100000190198",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-02-13 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-07-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-07-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-07-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 75892,
      "AltID": "Water Disinfection",
      "FacilityID": 52193,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 77716,
          "ProcessID": 75892,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 100597,
          "ProcessID": 75892,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 600597,
          "ProcessID": 75892,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52193,
      "SummaryText": "The City of Sweetwater, Texas (City), operates the Sweetwater Water Treatment Plant (WTP) located in Nolan County, Texas.  The WTP provides potable water to the City of Sweetwater, City of Trent, City of Roby, and Bitter Creek Water Supply Corporation (WSC). Chlorine gas is used in the disinfection process at the water treatment plant with up to ten (10) 2,000-pound chlorine cylinders stored on-site. The City also uses 19% ammonium hydroxide (19% available aqueous ammonia) in its treatment plant which is not a covered process subject to risk management planning. Because the stored quantity of chlorine onsite exceeds the threshold quantity for chlorine, the City developed this Risk Management Plan based on storage and use of chlorine.\n\nAs part of the requirements for the Risk Management Prevention Program, a Hazard Assessment was conducted that evaluated worst case and alternative chlorine release scenarios.  The worst-case release scenario is based on the American Water Works Association?s (AWWA?s) Compliance Guidance and Model Risk Management Program Scenario I.D. CLW-2 and involves the release of the entire contents of a 2,000-pound cylinder over a 10-minute period as a result of a catastrophic failure of a single 1-ton chlorine cylinder. The distance to the toxic endpoint as determined using a temperature correction factor of 1.0239 is 3.072 miles. LandView6 was utilized to determine the potential number of off-site residents affected by this scenario to be 9,686 persons with public receptors in the release area consisting of residences, schools, a hospital, commercial/industrial buildings and recreation areas. The distance to the toxic endpoint in the alternative release scenario as determined using AWWA?s CLA-5 scenario, and a temperature correction factor of 1.0239 is 0.870 miles. Using LandView6 it was determined that the potential number of off-site residents affected by this scenario would be 230 persons with public receptors in the release area consisting "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52193,
      "SummaryText": "of residences and commercial/industrial buildings. There are no environmental receptors in the worst-case or alternative release areas.\n\nIn order to oversee implementation of the plan, a Management System overseen by the City?s Director of Utilities (Director) will be implemented to ensure that the Plan and associated Prevention Program are properly implemented and maintained up-to-date. The Prevention Program includes  written operating procedures used in conjunction with on-the-job training to ensure that operators are proficient in performing their duties before being allowed to work alone.  Operators conduct daily inspections and insure that the equipment used in the disinfection process is operated and maintained according to the manufacturers? recommendations.  Because of these efforts, the WTP has not had a chlorine release that resulted in an injury, either on-site or off-site, within the previous five (5) years.  As part of the Program, the City will periodically perform compliance audits, hazard reviews and incident investigations, when necessary.  \n\nThe City?s WTP complies with the emergency response regulations per OSHA 29 CFR 1910.38 as well as with applicable fire codes and the standards set forth by the Chlorine Institute.  Pursuant to risk management planning requirements, the WTP has developed an emergency action plan and has coordinated with the City of Sweetwater Fire Department and the Nolan County Local Emergency Planning Committee (LEPC) to provide emergency response should a chlorine release occur.  Certified plant operators are trained to evacuate the facility and to notify the City Fire Department and Nolan County LEPC as soon as possible.  The City of Sweetwater Fire Department will oversee chlorine release response procedures, including the evacuation of surrounding residents."
    }
  ]
}