{
  "FacilityID": 52303,
  "FacilityName": "Underwood Fruit & Warehouse Company",
  "FacilityStr1": "6550 Washington State Route 14",
  "FacilityStr2": null,
  "FacilityCity": "Bingen",
  "FacilityState": "WA",
  "FacilityZipCode": "98605",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53039",
  "LEPC": "Klickitat County LEPC",
  "FacilityLatDecDegs": "45.720556",
  "FacilityLongDecDegs": "-121.477778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 151163490,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Underwood Fruit & Warehouse Company",
  "OperatorStr1": "PO Box 1096",
  "OperatorStr2": null,
  "OperatorCity": "White Salmon",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98672",
  "OperatorZipCodeExt": "1096",
  "RMPContact": "Ed Ing",
  "RMPTitle": "Assistant Superintendent",
  "FTE": 60,
  "OtherEPAFacilityID": "CRK000041360",
  "EPAFacilityID": "100000084829",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-09-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "20080806 (Bingen, WA)",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-08-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-08-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-08-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-08-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 45.71972,
  "FRS_Long": -121.47861,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-DIGITIZED",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76026,
      "AltID": "Refrigerated Warehouse",
      "FacilityID": 52303,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 77854,
          "ProcessID": 76026,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 100769,
          "ProcessID": 76026,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 600769,
          "ProcessID": 76026,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52303,
      "SummaryText": "\n1.0    EXECUTIVE SUMMARY\n\n1.10    Accidental Release Prevention And Emergency Response Policies\n\nThe Underwood Fruit & Warehouse Company refrigeration system uses pure anhydrous ammonia (a commonly used refrigerant for industrial systems) as the refrigerant.  Given the quantity handled, anhydrous ammonia is considered a hazardous substance by EPA.  Many of the properties that make ammonia valuable as a refrigerant also requires that precautions and procedures be in place to protect employee and public health and safety during a chemical emergency.  It is the policy of Underwood Fruit & Warehouse to be in compliance with all applicable federal and state rules and regulations.    \n\nSafety at our facility is inherent on the manner in which anhydrous ammonia is handled.  While the design of the facility incorporates a multitude of safety devices, safe handling procedures combined with appropriate training of our personnel are key aspects to maintaining safety at our facility.\n\nWe have a written Process Safety Management (PSM) plan that complies with the regulations stipulated by WAC 296-67-017.  A crucial component of this plan is the Emergency Response Plan, developed in compliance with the Emergency Response provisions of WAC 296-62-3112.  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events. \n\n1.20    Facility Description And Substances Handled\n\n?    Underwood Fruit & Warehouse stores and distributes fruits.  Storage and distribution requires the use of a refrigeration system to preserve the integrity of the fruits.  This refrigeration process uses ammonia as a refrigerant.  Access to the facility is restricted to authorized employees, management personnel, and contractors.\n?    The regulated substance handled at this facility is anhydrous ammonia.\n?    The ammonia refrigeration system maximum inventory is 14,000 pounds of an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52303,
      "SummaryText": "hydrous ammonia.  There is no standby make-up inventory kept on-site.\n\n1.30    The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario. \n\nRelease scenarios were modeled using RMP*Comp (Version 1.07), a software program developed by the National Oceanic and Atmospheric Administration (NOAA) and EPA.  Offsite receptors were defined using the LandView 5 (Version 1.0) system.  This system estimates residential population within the circle defined by the endpoint of the worst-case and alternative release scenarios.  In addition, it lists whether certain types of public receptors and environmental receptors are within the circles.\n\n1.40    General Accidental Release Prevention Program And Chemical-Specific Prevention Steps \n\nUnderwood Fruit & Warehouse complies with EPA?s Accidental Release Prevention Rule and with all applicable state codes and regulations.  The design and construction of this facility was in accordance with published standards, tests or recommended methods of trade, industry or governmental organizations.  \n\nUnderwood Fruit & Warehouse?s written PSM plan incorporates many policies and procedures to ensure safe operation and maintenance of this facility.  Plan elements essential to safe operation of the refrigeration system include employee participation, process hazard information, process hazard analysis, operating procedures, training, contractor safety, pre-startup safety review, mechanical integrity, management of change, hot-work permits, incident investigation, emergency response and planning, and compliance audits.  This plan will be reviewed annually and updated as necessary by the Underwood Fruit & Warehouse Safety Supervisor. \n\nTraining is provided to ensure that each employee involved in operating a process has been trained in an overview of the process, the operating procedures, and safety considerations.  This training u"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52303,
      "SummaryText": "ses guidelines developed by the International Institute of Ammonia Refrigeration (IIAR) and Refrigeration Engineers Technology Association (RETA).  Only qualified maintenance personnel operate and interact with the refrigeration system.  This minimizes the chances of inadvertent error in operation that could lead to a release of ammonia.  Startup, shutdown, and any onstream adjustments are handled by these qualified persons.  \n\n1.50    Five-Year Accident History\n\nThere has been no significant release of ammonia at Underwood Fruit & Warehouse in the past five years.\n\n1.60    Emergency Response Program\n\nUnderwood Fruit & Warehouse has a written Emergency Response Plan developed to ensure that precautions and procedures are in place to protect employee and public health and safety during a chemical emergency.  It complies with the provisions of WISHA Emergency Response regulations, WAC 296-62-3112.  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties. This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.  This plan will be reviewed with the Bingen Fire Department.\n\nThe approach in the development of this plan has been to identify the ammonia emergencies most likely to occur at Underwood Fruit & Warehouse and establish precautions and procedures to protect life safety and health during an emergency.  The refrigeration process has back-up prevention systems to keep processing malfunctions from becoming ammonia release emergencies.  If an emergency does occur, the following response personnel, facilities, and equipment are in place:\n\n?    Incident Command Center\n?    Emergency Alarm and Communication System\n?    Emergency Response Team\n?    Safe Rooms, Evacuation Plans, and Assembly Points\n?    Personal Protective Equipment\n\nThe role and procedures for obtaining external emergency assistance have been formally established with the Bingen Fire Department, including the LEPC Department of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52303,
      "SummaryText": "Emergency Services stationed in Klickitat County.  The Emergency Response Plan also includes procedures for notification of any potentially affected neighbors.  \n\nAll Underwood Fruit & Warehouse personnel will be trained to fulfill their designated responsibilities in an emergency.  \n\nThis plan will be reviewed annually and updated as necessary by the Underwood Fruit & Warehouse Safety Supervisor.\n\n1.70    Planned Changes To Improve Safety\n\nThis facility started production operations in 1952.  All system components meet design specifications in ANSI/IIAR, equipment, design, and installation of ammonia mechanical refrigerating systems.  All pressure vessels are built according to American Society of Mechanical Engineers (ASME), ASME Boiler and Pressure Vessel Code, pressure vessels.  Any upgrades or extensive maintenance work performed in the future will be in compliance with those standards applicable at that time.\n\nAll Underwood Fruit & Warehouse personnel are trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify elements requiring improvement.\n\nFuture actions to improve safety include improving training for some plant personnel, scheduling a meeting with local responders and completing more evaluations for contractors who work on (or could impact) the refrigeration system."
    }
  ]
}