{
  "FacilityID": 52361,
  "FacilityName": "Danisco USA, Inc.",
  "FacilityStr1": "10994 Three Mile Road",
  "FacilityStr2": null,
  "FacilityCity": "Thomson",
  "FacilityState": "IL",
  "FacilityZipCode": "61285",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17015",
  "LEPC": "Carroll County LEPC",
  "FacilityLatDecDegs": "42.002500",
  "FacilityLongDecDegs": "-090.110833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.danisco.com",
  "FacilityEmailAddress": "craig.myers@danisco.com",
  "FacilityDUNS": 21433537,
  "ParentCompanyName": "Danisco, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Danisco USA, Inc.",
  "OperatorStr1": "10994 Three Mile Road",
  "OperatorStr2": null,
  "OperatorCity": "Thomson",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61285",
  "OperatorZipCodeExt": null,
  "FTE": 82,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000077524",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "FESOP 015813AAA",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": "Hydrogen System",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-08-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-08-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-08-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-03-26 00:00:00",
  "DeRegistrationEffectiveDate": "2020-03-18 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 41.999892,
  "FRS_Long": -90.110004,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C03",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76118,
      "AltID": "Hydrogen",
      "FacilityID": 52361,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 100892,
          "ProcessID": 76118,
          "ChemicalID": 149,
          "Quantity": 11827.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 77946,
          "ProcessID": 76118,
          "NAICSCode": "311999",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 44715,
              "Process_NAICS_ID": 77946,
              "SafetyReviewDate": "2003-03-01 00:00:00",
              "PHA_Date": "2004-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2003-03-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-12-31 00:00:00",
              "TrainingReviewDate": "2003-04-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-04-30 00:00:00",
              "EquipmentInspectionDate": "2004-06-04 00:00:00",
              "EquipmentTested": "pump system (Lactitol)",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2003-06-27 00:00:00",
              "PreStartupReviewDate": "2004-06-03 00:00:00",
              "ComplianceAuditDate": "2003-12-15 00:00:00",
              "AuditCompletionDate": "2004-03-17 00:00:00",
              "IncidentInvestigationDate": "2004-04-22 00:00:00",
              "InvestigationChangeDate": "2004-04-22 00:00:00",
              "ParticipationPlansReviewDate": "2003-12-31 00:00:00",
              "HotWorkPermitReviewDate": "2003-11-26 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2003-11-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 64932,
                  "PreventionProgram3ID": 44715,
                  "ProcessChemicalID": 100892
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52361,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2004-02-24 00:00:00",
    "ERTrainingDate": "2004-03-26 00:00:00",
    "CoordinatingAgencyName": "Thomson Fire Protection District",
    "CoordinatingAgencyPhone": "8152598255",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52361,
      "SummaryText": "Introduction and General Information\nDanisco USA, Inc. (Danisco) owns and operates a hydrogenation facility located three miles north of Thomson, IL. It produces hydrogenated sugars (Xylitol and Lactitol) for commercial and industrial uses. The facility stores one chemical in excess of the threshold quantities listed in the US EPA Accidental Release Protection Regulations in the Clean Air Act Section 112® (RMP). The facility is located at latitude 42.002500 and longitude -090.110833, in a rural setting in Carroll County, Illinois. The terrain in the local vicinity is flat to gently rolling land surface in a rural agricultural setting. The Mississippi River is located approximately one mile west of the facility, and the land use in that direction is agricultural. To the east, the land use is also agricultural, and the land to the south immediately abutting the facility is also agricultural, but approximately three miles south of the facility is the village of Thomson, IL. The land to the north of the facility is also agricultural lands, and the city of Savanna, IL is approximately seven miles north.\nAccording to the 1992 data for the Quad Cities Airport in Moline, IL, (nearest data source), the prevailing wind in the vicinity comes out of the south to northwest (approximately 180o to 330o). The average wind speed is 7.21 Knots (8.29 miles per hour). The stronger winds come out of 300o to 330o with velocities of as much as 17 to 21 Knots, and on limited occasions (<1%) the wind velocities exceed 21 Knots. The quadrant from 180o to 270o provides the majority of the winds. They are less intense (11 to 16 Knots maximum) but represent approximately 35% of the windy days. Winds are calm approximately 12.3% of the time. This data is based on 24 hours a day, 365 days per year for the year 1992. In computing and modeling the worst case scenarios the atmospheric stability class was set to F and the wind speed was set at 1.5 meters per second in accordance with the US EPA gui"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52361,
      "SummaryText": "dance. For the alternative scenarios, a wind speed of 1.5 meters per second and an atmospheric stability class of D was used in accordance with the US EPA guidance. This was necessary due to the lack of the most recent three-year meteorological data.\n\nAccident History\nDanisco operates a modern facility with state of the art safety policies, practices and systems. There were no accidental releases of regulated chemicals, but nine incidents that involve the hydrogenation process occurred during the preceding five years.  These include the following:\nDate - Process - Description\n3/21/00 - Hydrogenation - Air Products driver noted a small flame present in the vent stack.  Service technician was called in to repair.  No other response required.  No property damage or injury.\n8/10/01 - Hydrogenation - Small catalyst fire when filter housing was opened for repair.  Filters should be flooded at all times to insure catalyst is always wet.  Fire extinguished by staff.  No response required.  No property damage or injury.\n3/3/01 - Hydrogenation - Small leak in catalyst tank piping.  Unit was taken out of service immediately for repair.  Follow-up meeting held to review PM procedure.  No response required.  No property damage or injury.\n3/21/02 - Hydrogenation - All gas detectors alarmed in Lactitol hydrogenation.  Found a bleed valve open which was not listed on L/T checklist.  Follow-up meeting reviewed and updated L/T checklist.  No response required.  No property damage or injury.\n11/26/02 - Hydrogenation - Small fitting cracked on hydrogen storage system.  Notified Air Products for repair.  System was shutdown until repaired.  No other response required.  No property damage or injury.\n6/6/03 - Hydrogenation - Rupture disc blown on Lactitol reactor due to slow response of hydrogen control valve.  Valve controls were adjusted.  No response required.  No property damage or injury.\n6/21/03 - Hydrogenation - Found biral pump white hot with flames.  Activated emergency stop"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52361,
      "SummaryText": "and confirmed fire was out.  No alarms sounded to indicate failure.  All follow-up action is documented in CAR C03-06.  No response required.  No property damage or injury.\n8/12/03 - Hydrogenation - Hydrogen alarms activated in Xylitol hydrogenation building.  Valve had been left open which could have resulted in catalyst spill.  Follow-up action is to install limit switches with interlocks tied into the DCS.  Work orders have been written to have this done in both Lactitol and Xylitol hydrogenation units.  No response required.  No damage or injury.\n3/4/04 - Hydrogenation - Hydrogen storage unit shut down due to loss of all pressure and level readings.  All safety systems worked as expected.  Air Products notified.  No other response required.  No property damage or injury.\n\nThere have been no off-site consequences involving regulated processes or regulated chemicals at the facility.  There is no five-year accident history involving either regulated processes or regulated chemicals that involve significant property damage, personal injury or death.\n\nEmergency Assistance\nEmergency assistance is provided by the Thomson, IL Fire Protection District with mutual aid assistance agreements with Savanna, IL, and Mount Carroll, IL Fire Departments.  Savanna is located approximately 7.0 miles north of the facility and Mount Carroll is located approximately 9.0 miles east of Savanna, for a total response distance of 16.0 miles.  Mutual aid response times are approximately 30 minutes from the initiation of notice.  There is a Local Emergency Planning Commission (LEPC) for Carroll County, IL. and is located in Mount Carroll, IL.  Although this organization is formed, it is not active and does not provide emergency response or coordination services at this time.  Danisco has trained personnel in emergency response and emergency operations.  Each supervisor is trained to coordinate the response, assigning duties to personnel working in the area via the plant emergency notificatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52361,
      "SummaryText": "n system.  Additional support is provided through cooperation with the outside agencies once they arrive on site.\n\nProcess Safety Information\nDanisco maintains all of the safety information required by RMP.  This includes Material Safety Data Sheets (MSDS), maximum intended inventories of regulated chemicals, safe upper and lower temperatures, pressures and flows, and equipment specifications and manufacturing codes.  The facility has been designed by industry-accepted standards and good engineering practices.  Updates to the safety information will be made through the management of change procedures.\n\nHazard Reviews and Process Hazard Analyses\nDanisco performs hazard reviews or process hazard analyses (as appropriate) on all systems and has a program to address any deficiencies noted during the review.  These reviews are performed by facility personnel that are thoroughly familiar with the processes, using generally accepted procedures.  Reviews are repeated at least every five years.\n\nOperating Procedures\nAll operations at the facility are conducted using standard operating procedures by staff that is thoroughly trained on system operations.  The operating procedures cover steps for all aspects of the operation to include:  initial startup, normal operation, temporary operation, emergency shutdown and startup after emergency shutdown.\n\nTraining\nDanisco provides all personnel with appropriate training to include initial and annual refresher training.\n\nMechanical Integrity\nMaintenance is accomplished by a computerized work order system to assure that preventative and corrective maintenance is performed by the required dates.  All maintenance personnel are trained to perform the various functions required by the work orders.  All process equipment is inspected in accordance with generally accepted engineering practices consistent with industry standards.  There is a program to address noted maintenance deficiencies.\n\nManagement of Change\nThe facility has a management"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 52361,
      "SummaryText": "of change policy that requires a review of all proposed changes except for replacement in kind.  Management of change requires that those employees affected by the change be informed of and receive training in the change prior to startup.\n\nPre-Startup Review\nThe facility performs pre-startup reviews and provides employees training in the new or modified process prior to its startup.\n\nCompliance Audits\nThe facility has a policy requiring an annual audit to ensure compliance with all relevant environmental legislation and regulations.  The audit is to be performed by a person familiar with all relevant US environmental rules and regulations.  There is also a procedure to address the audit findings on a timely basis.\n\nIncident Investigations\nThe facility has an incident investigation procedure (TEPM-4.5-02).  All incidents are documented and reviewed to determine the appropriate preventative measures.  These investigations occur within forty-eight hours of the incident and involve an incident investigation team that consists of representatives of the operations staff, management, and any contractors that may provide expertise in the investigation.  Any recommendations made by the investigation team are acted upon by the facility as soon as possible.  All incident investigation reports are maintained for at least five years.\n\nEmployee Participation\nThe facility has a written procedure (S-43, reviewed 12/29/2003) that requires employee participation in the development and maintenance of process hazard analyses.\n\nHot Work Permits\nThe facility has a Work Permit procedure (S-31, reviewed 11/26/2003) which includes hot work permitting.  This procedure is compliant with the RMP requirements.\n\nContractors\nThe facility has a Contractor Safety procedure (S-14, reviewed 11/26/2003) which is compliant with the RMP requirements.\n\nEmergency Response\nThe facility has an Emergency Response procedure (TEPM-4.4-01, revised 2/24/2004), intended to protect human health and the environmen"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 52361,
      "SummaryText": "t.  The procedure includes method of notification of emergency response agencies and the public.  All employees are trained on the plan and the emergency equipment available at the facility.  The Emergency Response procedure is updated as needed and reviewed minimally once per year.  The facility conducts coordinated drills with local emergency response agencies to ensure that in the event of an emergency, all response personnel are familiar with the requisite tasks.\n\nConclusions\nDanisco operates a modern, well-managed facility with ample maintenance, training, and emergency planning to minimize, to the extent possible, the possibility of adverse effect on human health and the environment.  If an accident should occur, the Facility is fully capable of responding in a manner that will minimize the possibilities of off-site consequences.  Management is committed to proper and safe operations and has the full support and cooperation of the operation and maintenance staffs."
    }
  ]
}