{
  "FacilityID": 52380,
  "FacilityName": "Flowers Frozen Bakery, Inc.",
  "FacilityStr1": "140 Folmar Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Montgomery",
  "FacilityState": "AL",
  "FacilityZipCode": "36105",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01101",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "32.265556",
  "FacilityLongDecDegs": "-086.366667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Flowers Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Flowers Foods, Inc.",
  "OperatorStr1": "140 Folmar Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Montgomery",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36105",
  "OperatorZipCodeExt": null,
  "FTE": 151,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000048977",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2090074",
  "SafetyInspectionDate": "2007-02-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Montgomery, AL Resubmital 8/2007",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-08-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-08-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-08-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.26701,
  "FRS_Long": -86.36018,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "6",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76142,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 52380,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 100921,
          "ProcessID": 76142,
          "ChemicalID": 56,
          "Quantity": 12500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 77971,
          "ProcessID": 76142,
          "NAICSCode": "311812",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 44732,
              "Process_NAICS_ID": 77971,
              "SafetyReviewDate": "2005-10-27 00:00:00",
              "PHA_Date": "2005-10-27 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-02-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2007-06-04 00:00:00",
              "TrainingReviewDate": "2007-07-18 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-09-06 00:00:00",
              "EquipmentInspectionDate": "2005-09-05 00:00:00",
              "EquipmentTested": "MI Audit",
              "ChangeMgmtDate": "2007-08-20 00:00:00",
              "ChangeMgmtReviewDate": "2005-11-04 00:00:00",
              "PreStartupReviewDate": "2007-08-25 00:00:00",
              "ComplianceAuditDate": "2007-05-02 00:00:00",
              "AuditCompletionDate": "2007-11-02 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-01-30 00:00:00",
              "HotWorkPermitReviewDate": "2007-01-30 00:00:00",
              "ContractorSafetyReviewDate": "2007-01-30 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The Risk Management Prevention Program for this facility is the OSHA required Process Safety Management documentation based on 29CFR1910.119.",
              "_chemicals": [
                {
                  "PrimaryKey": 64953,
                  "PreventionProgram3ID": 44732,
                  "ProcessChemicalID": 100921
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52380,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Montgomery HAZMAT Team",
    "CoordinatingAgencyPhone": "2022412022",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52380,
      "SummaryText": "Executive Summary\n\n1. Accidental Release Prevention and Emergency Response Policies\nWe at Flowers Frozen Bakery, Inc. are committed to employee, public and environmental safety.  Our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance demonstrates this commitment, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our highly trained refrigeration personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with Montgomery HAZMAT Team, which provides additional emergency response expertise.\n\n\n2. The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities revolve around the storage and distribution of products for our many retail outlets.  \n\nAnhydrous ammonia is the only regulated substance present at our facility.  The entire ammonia inventory is attributed to its use as a refrigerant.\n\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.  To evaluate the worst case and alternative release scenarios for ammonia we have used the methodology given in the Model Risk Management Program and Plan for Ammonia Refrigeration by SAIC.  The details of the chosen scenarios are located within the Risk Management Program that is located on site.\n \n4. The Accidental Release Prevention and the Chemical-Specific Prevention Programs\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA.  In addition, our facility is subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notificati"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52380,
      "SummaryText": "on requirements.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nFlowers Frozen Bakery, Inc. maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all the processes.\n\nProcess Hazard Analysis\nThe methodology used to carry out the analysis is What If-Checklist.  The analyses are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered process, Flowers Frozen Bakery, Inc. maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is reviewed and is readily accessible to operators involved with the process.\n\nTraining\nFlowers Frozen Bakery, Inc. has a training program in place to train employees who are operating the process or are associated with the process.  Refresher training is provided at least every three (3) years and more frequently as needed.\n\nMechanical Integrity\nFlowers Frozen Bakery, Inc. carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and compressors.  Maintenance procedures are carried out by qualified personnel with a background in maintenance practices.  Training is provided to the personnel as needed.  Any equipment deficiencies identified during maintenance checks are corrected in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52380,
      "SummaryText": " a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Flowers Frozen Bakery, Inc. to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel and all other employees whose job tasks are affected by a change in a process are promptly made aware of and offered training to deal with the changes.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in the established process are conducted as a regular practice at Flowers Frozen Bakery, Inc.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nFlowers Frozen Bakery, Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP Rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nFlowers Frozen Bakery, Inc. promptly investigates any incident that could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nFlowers Frozen Bakery, Inc. believes that process safety management and accident prevention is a team effort.  Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information collected as part of the facility's compliance with the RMP Rule including information resulting from process hazard analyses.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52380,
      "SummaryText": "nd construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Flowers Frozen Bakery, Inc. has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all applicable procedures for emergency response to an accidental release of a regulated substance.\n\n\n5. Five-year Accident History\nFlowers Frozen Bakery, Inc. has an excellent record of preventing accidental releases over the last 5 years.  Continued attention to maintenance and operations this exemplary record is expected to continue.\n\n\n6. Emergency Response Plan\nFlowers Frozen Bakery, Inc. has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n7. Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Continued training, and program reviews are some of the major steps we want to take to improve safety at our facility.  These changes are expected to be implemented in a timely manor."
    }
  ]
}