{
  "FacilityID": 52381,
  "FacilityName": "IFF Chemical Holdings Inc",
  "FacilityStr1": "2051 N. Lane Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Jacksonville",
  "FacilityState": "FL",
  "FacilityZipCode": "32254",
  "Facility4DigitZipExt": "1529",
  "FacilityCountyFIPS": "12031",
  "LEPC": "LEPC District 4",
  "FacilityLatDecDegs": "30.347778",
  "FacilityLongDecDegs": "-081.752222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4073516,
  "ParentCompanyName": "International Flavors and Fragrances Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1534833,
  "Company2DUNS": null,
  "OperatorName": "IFF Chemical Holdings Inc.",
  "OperatorStr1": "2051 N. Lane Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Jacksonville",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32254",
  "OperatorZipCodeExt": "1529",
  "FTE": 98,
  "OtherEPAFacilityID": "32205NNCMP2051N",
  "EPAFacilityID": "100000034811",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0310071-010-AV",
  "SafetyInspectionDate": "2004-12-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-08-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-08-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-08-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 30.34774,
  "FRS_Long": -81.7494,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R03",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76143,
      "AltID": "AHCL transfer system",
      "FacilityID": 52381,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 100922,
          "ProcessID": 76143,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 77972,
          "ProcessID": 76143,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 44733,
              "Process_NAICS_ID": 77972,
              "SafetyReviewDate": "2008-06-20 00:00:00",
              "PHA_Date": "2007-12-10 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-09-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-07-30 00:00:00",
              "TrainingReviewDate": "2008-08-15 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Open Air Classroom - During Installation - Equipment Not Yet In Operation",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-08-15 00:00:00",
              "EquipmentInspectionDate": "2008-08-15 00:00:00",
              "EquipmentTested": "Carbone Unit, Chlorine Scrubber, Chiller",
              "ChangeMgmtDate": "2008-07-21 00:00:00",
              "ChangeMgmtReviewDate": "2008-01-08 00:00:00",
              "PreStartupReviewDate": "2008-08-12 00:00:00",
              "ComplianceAuditDate": "2006-04-17 00:00:00",
              "AuditCompletionDate": "2006-09-30 00:00:00",
              "IncidentInvestigationDate": "2008-03-08 00:00:00",
              "InvestigationChangeDate": "2008-03-09 00:00:00",
              "ParticipationPlansReviewDate": "2008-01-08 00:00:00",
              "HotWorkPermitReviewDate": "2008-08-12 00:00:00",
              "ContractorSafetyReviewDate": "2008-04-29 00:00:00",
              "ContractorSafetyEvalDate": "2008-04-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 64954,
                  "PreventionProgram3ID": 44733,
                  "ProcessChemicalID": 100922
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52381,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-08-20 00:00:00",
    "ERTrainingDate": "2008-09-01 00:00:00",
    "CoordinatingAgencyName": "LEPC District 4",
    "CoordinatingAgencyPhone": "9042790885",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29 CFR 1910.156, 40 CFR 112 and 40 CFR 300",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52381,
      "SummaryText": "IFF Chemical Holdings Inc (IFF) is committed to providing each employee and the citizens of the surrounding community with a safe working and living environment. It is IFF's policy to conduct chemical manufacturing operations in a safe and environmentally sound manner. IFF has the expertise, experience and training to handle the materials used at the Jacksonville facility in a safe and environmentally sound manner. In the event of an incident at the facility or involving our materials, IFF is committed and prepared to properly respond so that life and property are protected to the greatest extent possible.\n\nIFF processes turpentine at the Jacksonville facility and converts it to various terpene and synthetic aroma chemicals. Several hazardous substances are used in IFF's processes, but IFF has only one substance in a \"covered process\"  subject to the US Environmental Protection Agency's  Accidental Release Rule(under Program 3), due to its potential for off-site consequences in the unlikely event of a major release. This substance is Chloride, which is delivered to the facility by rail in 90-ton tank cars and used directly from the tank cars. Chlorine is a common industrial chemical that has been safely used for many decades. It is stored as a liquid under pressure in the rail car, transferred to a vaporizer and piped directly to the process where it is used as a reactant. Only the tank car holds a sufficient quantity of Chlorine to pose a risk for off-site consequences in the event of a release. If released, the Chlorine will immediately vaporize and form a dense, visible greenish-yellow cloud that is carried by the wind as it dissipates.\n\nChlorine vapor is highly irritating to breathe and toxic. A sufficiently high dose can be fatal. In the event of a release, concentrated vapor can be recognized by its dense, greenish-yellow plume. Its irritating, pungent odor can be detected in very low concentrations. Anyone exposed to a release should avoid the vapor plume if"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52381,
      "SummaryText": "possible or take shelter inside a building until the plume passes, which would be a matter of minutes under typical weather conditions. Sheltering-in-place involves entering an enclosed building, immediately closing windows and doors, turning off all ventilating or air conditioning systems, turning on the radio or TV for emergency bulletins and staying calm until it is announced that the emergency is over.\n\nEPA's Accidental Release Rule requires the description and analysis of a worst-case release scenario. Recognizing the extreme unlikelihood of a worst-case release, the EPA also requires at least one alternative, or \"more likely\" scenario to be described and analyzed. The probability of an alternative release scenario occurring at IFF's facility is also very low.\n\nEPA requires IFF's worst-case scenario to be described as a near-instantaneous release of an entire rail car full of Chlorine under worst-case weather conditions, where the vapor plume would dissipate the least and extend the farthest. Although extremely unlikely to occur, such a release under these worst-case conditions could result in a vapor plume traveling a long distance before dissipating to safe concentrations. Numerous similar scenarios exist throughout the nation and in every large city. Rail tank cars are extremely durable, being designed to safely transport dangerous chemicals in everyday commerce and to withstand railroad crashes. At IFF, the rail cars are securely parked inside the facility at the end of a rail siding and are not exposed to any traffic or other hazardous conditions while in use.\n\nIFF's analysis considered possible release scenarios described by the Chlorine Institute in its off-site consequences analysis document, Pamphlet 160. The Chlorine Institute is a long-established and authoritative industry association of producers and users of chlorine, anhydrous hydrogen chloride (AHCL) and hydrochloric acid. Chlorine and AHCL have similar properties and are handled and transported"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52381,
      "SummaryText": "in nearly identical manners. IFF has over thirty years of experience in handling AHCl but is eliminating AHCl in bulk and switching to Chlorine. Among the possible alternative release scenarios described in Pamphlet 160, several were recognized to be generally applicable to IFF's covered process. The scenario chosen as IFF's alternative release scenario utilizes the specific features of IFF's transfer system and typical Jacksonville weather data. It is expected that IFF's release scenarios will be very similar to those described by many other facilities handling similar chemicals with similar transfer systems. \n\nIFF's alternative release scenario is described as a partial rupture of a transfer hose used to convey liquid Chlorine from the rail car to the facility piping. A large or complete rupture of the hose would activate the \"excess-flow\" valve  inside the rail car, causing it to instantaneously close when the flow exceeds 250 lb. per minute. Therefore, this scenario describes a partial rupture  where the flow would approach, but not exceed, 250 lb./min. and not automatically close the excess-flow valve. As soon as such a release is detected by chlorine vapor detectors it would be immediately terminated by closing a remote-activated shutoff valve upstream of the hose. The duration of the release would be the elapsed time to detect and terminate it, conservatively estimated to be three minutes. Such a release, although unlikely, could result in the very limited surrounding neighborhood being exposed to unsafe concentrations of Chlorine vapors for several minutes. The affected distance and duration would depend on the exact rate and duration of the release and the prevailing weather conditions. This is one of several possible alternative scenarios that were identified and analyzed, but it is considered possibly more likely to occur and would result in greater exposure than the other scenarios. The rupture of a vapor transfer hose or a stuck-open rail car relief va"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52381,
      "SummaryText": "lve could have similar, but probably somewhat less severe consequences.\n\nIFF's release scenarios were caculated by RMP Comp.\n    \nThe Chlorine Institute describes and promotes the use of systems and equipment for the safe transport and handling of these chemicals. IFF's Chlorine unloading and transfer system was designed built in 2008 and incorporates the state-of-the-art safety features described in the Chlorine Institute's Pamphlet 57. Safety features include strategically placed release detection sensors coupled with automatic emergency stop computer programs, closed circuit color television monitoring and fail-safe remote-actuated shutoff valves, including remote-actuated shutoff valves close-coupled to the rail cars upstream of the transfer hoses. Burst diaphragms protecting the transfer system from over pressurization are vented to a caustic scrubber to prevent the release of Chlorine. Operating, maintenance, and supervisory personnel trained to operate the system and to respond to any emergency situation are on duty 24 hours a day, every day of the year. The transfer system is designed, operated and maintained in accordance with OSHA's Process Safety Management Standard, as detailed in Section 7 of this document. IFF's facility is also certified and operated in accordance with ISO 9000.\n\nThere have been no reportable accidents involving Chlorine in more than fifteen years.\n\nIFF Chemical Holdings Inc. has always recognized its responsibility to manage AHCL safely (now Chlorine) and to be able to respond to an accidental release. The switch from AHCl to Chlorine will comprise the same type of responsibility. These are similar materials as far as how they are handled and used. We have over 30 years of experience handling AHCl and that experience can be directly applied to Chlorine usage. A formal Emergency Response Plan has been in place for more than two decades and is kept up to date. The specific response plan for Chlorine is very similar to AHCl. Facility pe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 52381,
      "SummaryText": "rsonnel are trained in their appropriate level of emergency response and retrained annually, in accordance with formal procedures and OSHA's \"HAZWOPER\" rule (29 CFR 1910.120). Training for Chlorine is very similar. Drills are conducted annually and occasionally involve the participation of the city's Hazardous Materials Response Team. Jacksonville's Emergency Preparedness Division, Fire and Rescue Department, would be notified immediately in the event of a major release and would be responsible for conducting off-site response activities.\n\nIncidents and near misses are required to be thoroughly investigated to learn what can be done to further improve the safety of IFF's systems and procedures. IFF is always actively seeking to improve safety and reduce risk to its employees and the surrounding community. We will use our long standing Safety Record for the handling of AHCl and apply the same type of Emergency Management to Chlorine."
    }
  ]
}