{
  "FacilityID": 5239,
  "FacilityName": "National Frozen Foods Corporation",
  "FacilityStr1": "436 State Street",
  "FacilityStr2": null,
  "FacilityCity": "Chehalis",
  "FacilityState": "WA",
  "FacilityZipCode": "98532",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53041",
  "LEPC": "Lewis County LEPC",
  "FacilityLatDecDegs": "46.666389",
  "FacilityLongDecDegs": "-122.971667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "peixenberger@nationalfrozenfoods.com",
  "FacilityDUNS": 9262064,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "National Frozen Foods Corporation",
  "OperatorStr1": "436 State Street",
  "OperatorStr2": null,
  "OperatorCity": "Chehalis",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98532",
  "OperatorZipCodeExt": null,
  "RMPContact": "Pat Sauter",
  "RMPTitle": "Plant Manager",
  "FTE": 315,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000066224",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-05-31 00:00:00",
  "SafetyInspectionBy": "WISHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 46.70448,
  "FRS_Long": -122.95469,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6179,
      "AltID": "ammonia",
      "FacilityID": 5239,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6329,
          "ProcessID": 6179,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6714,
          "ProcessID": 6179,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506714,
          "ProcessID": 6179,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5239,
      "SummaryText": "\nNATIONAL FROZEN FOODS CORPORATION\nCHEHALIS, WASHINGTON\n\nRISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\n\nBackground Data\nUnder Section 112(r)(7) of the Clean Air Act, and in accordance with Title 40 of the Code of Federal Regulations, Chapter 68 (40 CFR 68), promulgated by the Environmental Protection Agency (EPA), National Frozen Foods Corporation (\"National\") submits this Risk Management Plan (RMP) for operations at their State Street facility in Chehalis, Washington. National's operations include the processing, freezing, and packaging of vegetables such as peas, corn, and carrots for public consumption.  National has been in operation at this facility for over 91 years, providing quality frozen vegetables and over 315 jobs to the local community.\nAccidental Release Prevention and Emergency Response Policy\nNational is committed to protecting the health of its employees, the surrounding community, and the environment; therefore, it is National's policy to manage a safe and healthy workplace, protect the environment and maintain compliance with safety, health, and environmental regulations: 40 CFR 68 as well as Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations, Chapter 1910, Section 119 (29 CFR 1910.119), and OSHA's Hazardous Operations and Emergency Response regulations (29 CFR 1910.120).\nStationary Sources and Regulated Substances\nNational is subject to Section 112(r) of the Clean Air Act because ammonia, a regulated substance, is present at the facility in amounts greater than 10,000 pounds.  National is required to maintain low temperatures in the food processing areas of the plant that are within standards required by the United States Department of Agriculture (USDA) to ensure quality in the final products.  National uses anhydrous ammonia (the 112(r) regulated substance) as a refrigerant to maintain the facility within the required range of operating temperature"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5239,
      "SummaryText": "s.  Anhydrous ammonia is an industry-standard refrigerant for refrigeration facilities. National's refrigeration system, consisting of receivers, compressors, evaporators, condensers, and piping, can contain a maximum amount of 30,000 pounds of anhydrous ammonia at certain times during the process season; normally working capacity is far less than this amount.\nWorst-Case Release Scenario\nAs required by 40 CFR 68 Subpart B, National has evaluated a worst-case release scenario for anhydrous ammonia using the parameters specified by the EPA.  National's worst-case release scenario is the rupture of the largest single high pressure receiver (9,000 pounds) when filled to 100 percent capacity over a 10-minute period.  Using the EPA's RMP Look-Up Tables in the Model Risk Management Program and Plan for Ammonia Refrigeration Facilities, the maximum distance to the toxic endpoint is 1.2 miles.\nThe worst-case release scenario was developed following EPA regulations and is not considered to be a likely release scenario.  During normal operations, National maintains the receivers at 50 to 60 percent capacity.  During pump-down operations, the receivers have the potential to be filled to a greater capacity, approaching the management threshold of 70 percent, or occasionally higher.  The receivers are operated in pump-down mode 10 percent of the time during the year. As a conservative approach to the worst-case release scenario, the rupture of a full (9,000 pounds) receiver was analyzed.\nAlternative Release Scenario\nA more realistic release scenario (alternative release) was developed by National taking into consideration the 91-year history of operation's experience and the hazards identified in the process hazard analyses (PHAs) conducted to ensure that National's plant hazards are identified and minimized. These analyses were conducted under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5239,
      "SummaryText": "of Federal Regulations Chapter 1910, Section 119 (29 CFR 1910.119).  Using the default alternative release scenario in the Model Risk Management Program and Plan for Ammonia Refrigeration Facilities, distributed by the EPA, the maximum distance to the toxic endpoint is 450 feet or 0.09 mile.\nAccidental Release Prevention Program\nThe last major upgrade of the refrigeration facility occurred in 1990, when everything was designed according to the existing ANSI/IIAR Standard for Equipment, Design, And Installation of Ammonia Mechanical Refrigerating Systems.  To prevent and mitigate accidental releases of anhydrous ammonia, National has implemented several precautionary measures, such as process/ equipment controls, standard operating procedures (SOPs), preventive maintenance programs, employee training, and audit programs.\nNational has developed and implemented a PSM program pursuant to OSHA regulations and, as such, has evaluated the system for the potential of anhydrous ammonia releases.  Some of the controls installed to prevent catastrophic releases of ammonia are process equipment (vents, pressure relief valves, backup pumps, and manual shutoffs) and automated controls (automatic shut-offs and electrical distribution system grounding).\nNational has developed standard operating procedures (and regularly reviews, revises, and enhances those procedures) for all employees and contractors that have contact with the ammonia refrigeration system. The SOPs incorporate safety measures into the procedures and were developed by refrigeration system operators.  They are reviewed on a monthly basis by means of an SOP review session.  Process safety information for the refrigeration system is reviewed during these monthly meetings as well.  Each crew chief on each shift conducts daily safety meetings with employees under his responsibility.  National encourages employee participation in development of the control measures used at the plant by means of newsletters and training s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5239,
      "SummaryText": "essions. Pursuant to written management of change procedures established by National, any changes to the operating procedures are to be communicated to affected employees.\nNational understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases; therefore, National has implemented a preventive maintenance program.  The preventive maintenance program is scheduled, documented and managed to ensure that regular maintenance occurs on the system.\nTo ensure that National's control measures are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system:\n* In accordance with the PSM program, National conducts detailed PSM compliance audits every 3 years.  Each audit incorporates review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\n* In addition, National is audited by the Chehalis Fire Department every 2 years.\n* National is audited by the USDA and FDA on a yearly basis.\n* National's insurance carrier also conducts independent audits every 2 years.\n* The Washington Industrial Safety and Health Act (WISHA) Division of the State Department of Labor and Industry conducts audits once every 3 years.\n* The American Institute of Baking (AIB) conducts yearly audits.\nFive-Year Accident History\nOver the last 5 years, National has not experienced an accidental release of anhydrous ammonia from the ammonia refrigeration system causing any onsite death, injury or significant property damage, or known offsite death, injury, property damage, environmental damage, evacuations, or sheltering in place.\nEmergency Response Program\nNational has developed a comprehensive emer"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5239,
      "SummaryText": "gency response program designed to protect both employees and the community in the event of a release. This program is fully described in Section 12 of the Risk Management Program and is titled Emergency Response Plan. \nTo assure that the local governmental response agencies are familiar with National's emergency response procedures, National has submitted copies of the Emergency Response Plan for review and approval by the following local agencies:\n* Chehalis Fire Department\n* Lewis County LEPC.\nTo plan for an ammonia release with offsite effects, National's Emergency Response Plan includes procedures to mitigate the release, procedures to inform local response agencies, transportation maps for response agencies, evacuation route maps, and procedures for public communication.\nIn the event of an anhydrous ammonia release with offsite effects, the general public will be warned by police and fire vehicles equipped with public address systems.\nContinuous Efforts to Improve Safety\nAs a result of National's initial process hazard analyses and as part of National's continuous efforts to improve the performance of its safety systems, several changes are planned at the facility to improve safety and prevent anhydrous ammonia releases. These changes are scheduled to be implemented by May 2000 and include the following:\n* Submit copies of Emergency Response Plan to Washington State Patrol, in addition to the Chehalis Fire Department, and Lewis County LEPC.\n* Explore with Lewis County LEPC, Chehalis Fire Department, and other industries in the area the formation of a local HazMat team to respond to hazardous material spills and releases in the local area.\n* Install ammonia detectors (installation date in future).\n* Review, revise, and enhance written SOPs.\n* Consider valve numbering for process control.\n\n"
    }
  ]
}