{
  "FacilityID": 5250,
  "FacilityName": "Lemolo Chlorine Station, L.S. 96",
  "FacilityStr1": "Johnson Rd/ Hiway 305",
  "FacilityStr2": null,
  "FacilityCity": "Poulsbo",
  "FacilityState": "WA",
  "FacilityZipCode": "98370",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53035",
  "LEPC": "Kitsap County LEPC",
  "FacilityLatDecDegs": "47.719722",
  "FacilityLongDecDegs": "-122.623056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A3",
  "LatLongDescription": "AE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Kitsap County Public Works, Wastewater Division",
  "Company2Name": null,
  "CompanyDUNS": 71185191,
  "Company2DUNS": 0,
  "OperatorName": "Kitsap County Public Works W.W.",
  "OperatorStr1": "614 Division Str. M.S.27",
  "OperatorStr2": null,
  "OperatorCity": "Port Orchard",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98366",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ralph DeClements",
  "RMPTitle": "Operations Managers",
  "FTE": 0,
  "OtherEPAFacilityID": "CRK000007420",
  "EPAFacilityID": "100000066643",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Chlorine used for odor control",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-01-15 00:00:00",
  "DeRegistrationEffectiveDate": "2004-01-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 47.71972,
  "FRS_Long": -122.62306,
  "FRS_Description": "ATMOSPHERIC EMISSIONS TREATMENT UNIT",
  "FRS_Method": "ADDRESS MATCHING-STREET CENTERLINE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6191,
      "AltID": "Chlorine Disenfection",
      "FacilityID": 5250,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6341,
          "ProcessID": 6191,
          "NAICSCode": "92411",
          "_desc": {
            "NAICS_CODE": "92411",
            "NAICS_DESCRIPTION": "Administration of Air and Water Resource and Solid Waste Management Programs"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 6728,
          "ProcessID": 6191,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 506728,
          "ProcessID": 6191,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5250,
      "SummaryText": "6-15-99\n   \n           Executive Summary for Risk Management Program for Kitsap County Public Works\n                                               Lemolo Chlorine Station, L.S. # 96\n\n* The Lemolo Chlorine Station is located at Johnson Road and Hiway 305, just outside of the city limits of Poulsbo in Kitsap County. This station is an odor control station treating the wastewater from the city of Poulsbo. This station has the capacity to hold two one ton cylinders of chlorine gas. One container  is on line and one is a spare. The station is monitored by radio telemetry and is checked two or more times a week. The station is not staffed.\n\n* The accidental release prevention and emergency response policies available to the employees of Kitsap County Public Works, who work at the station include:\n\nRelated Policies contained in the Kitsap County Public Works Safety Manual, Revised 10-98.\nAfter Normal Working Hours Duty List - Standard Operating Procedures.\nChlorine Leaks - Standard Operating Procedures.\nLock Out - Tag Out, The Policy.\nConfined Space, The Policy.\nRespiratory Protection,  The Policy.\nAll these documents are written at the direction of Randy Casteel, Director of Public Works.\nChemical Hazard Communications\nIncludes Department of Labor and Industries Guidelines \nWAC 296-62-054 through WAC 296-62-05425\n\n* The Worst Case Scenarios for the Lemolo Chlorine Station, L.S. # 96\nThis would be a chlorine gas release from the Lemolo Chlorine station. This would be a gas release after midnight, when there is no one at the station. The chlorine leak detector senses a chlorine leak and the radio telemetry sends in a chlorine leak alarm to the Central Kitsap Tr. Plant auto dialer. The auto dialer calls out the on call personnel. The chlorine station emergency blower comes on and starts to vent the chlorine gas from inside the Lemolo Chlorine station to an engineered piping system, which mixes the chlorine gas with the waste water flow. During this time that it takes for the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5250,
      "SummaryText": " on call duty personnel to arrive, which is approximately 10 to 20 minutes, the public which is down wind to the north direction has called the fire department with a complaint of a smell of chlorine in the air. On call personnel will work with the fire department personnel and the local emergency personnel to alert down wind residents , which are located in the down wind quadrant using the program designed by the Kitsap County Public Works personnel. State Patrol and the fire department personnel will monitor roads and control traffic in the area. Areas affected mainly would be residential and the Hiway 305 corridor. \nWorst case scenarios for the Lemolo Chlorine station gas release are reduced by the checking of the chlorine tanks, gas piping, detectors and radio telemetry twice a week. The chlorine and telemetry equipment is on a database monitored by a periodic maintenance program. Personnel use this program which takes the manufacturers' maintenance recommendations for a piece of equipment and use the information to perform maintenance in a timely fashion. The chlorine Supply Company checks the chlorine cylinders on a regular basis.\n\n* The alternative scenario for the Lemolo Chlorine station.\nThere is a chlorine leak at the Lemolo Chlorine station. This would be a gas release after midnight, when there is no one at the station. The chlorine leak detector senses a chlorine leak and the radio telemetry sends in a chlorine leak alarm to the Central Kitsap Tr. Plant dialer. The auto dialer calls out the on call personnel. The chlorine station emergency blower comes on and starts to vent the chlorine gas from inside the Lemolo Chlorine station to an engineered piping system  which mixes the chlorine gas with the waste water flow. No chlorine gas escapes from the Lemolo Chlorine station during the time it takes for the on call personnel to arrive at the station. This time frame is from 10 to 20 minutes. On call personnel do not smell chlorine from outside the Lemolo C"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5250,
      "SummaryText": "hlorine station when they arrive and do their investigation. On call personnel following standard operating procedures for a response to a chlorine leak, enter the Lemolo Chlorine station, determine the problem and correct a piping problem, stopping the chlorine leak. Problem was corrected by securing the chlorine cylinder and leaving it off line until a maintenance crew can restore the system to normal operation.\n\n* The general accidental release prevention program and chemical - specific prevention steps.\nThe Central Kitsap Tr. Plant personnel, who monitor and run the Lemolo Chlorine station will by guided by the OSHA - PSM rule and the DOT P 5800.5 Emergency Response Guide, Kitsap County Public Work's Safety manual, standard operating procedures and Washington state Department of Labor and Industry WAC's, in their daily activities. Improved documentation and new computer programs like the Chlorine initial isolation and protective action program will improve safety and response time.\n\n* The five year accident history\nThere have been no accidental releases of chlorine in the last five years from the Lemolo Chlorine station.\n\n*The emergency response program for Lemolo Chlorine station, Kitsap County personnel and the City of   Poulsbo K. C. fire District 18\nKitsap county personnel have met with the City of Poulsbo's K. C. Fire District Battalion Chief to further develop an emergency response and responder program. The fire department will take an active role to alert the public during an actual event.\nTools provided by Kitsap County.\nMap; Chlorine: Initial Isolation and Protective Action distances\nDemonstrates both large and small spill protective action distances, eight directional quadrants are used to map population and wind direction.\nReports: Chlorine Response Report\nProvides notification information for a gas release in a given quadrant (s). Useful information is population counts, name, address and a phone number of potential persons to evacuate.\nTraining: Mo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5250,
      "SummaryText": "nthly meetings will be scheduled to include training and information sessions with the fire department and LEPC.\nKitsap County Public Works will continue emergency response and chlorine training with its employees and local fire department personnel.\nDrills; Kitsap County Public Works and local emergency personnel will plan and conduct emergency response to a chlorine leak including simulated public notification and traffic control.\nPublic Notification: Kitsap County Public works will work with the local emergency planning committee to determine a course of action to notify the public.\n\n* Planned changes to improve safety.\nJune 29, 1999, meeting with fire department to demonstrate Chlorine isolation and response program.\nJuly 6, 7, 1999, will be Confined Space and Respiratory protection training.\nAugust 18, 19, 20, 1999 will be confined space and rescue.\nWithin the next three years construction will begin on a new Lemolo Chlorine station replacing gaseous chlorine with liquid chlorine solution as a means of disinfection."
    }
  ]
}