{
  "FacilityID": 52505,
  "FacilityName": "Arclin Surfaces, Inc",
  "FacilityStr1": "2301 N Columbia Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Portland",
  "FacilityState": "OR",
  "FacilityZipCode": "97217",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41051",
  "LEPC": null,
  "FacilityLatDecDegs": "45.588771",
  "FacilityLongDecDegs": "-122.690793",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 181227158,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Arclin Surfaces, Inc",
  "OperatorStr1": "PO Box 17307",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97217",
  "OperatorZipCodeExt": null,
  "FTE": 41,
  "OtherEPAFacilityID": "97217RGNVR2301N",
  "EPAFacilityID": "100000050605",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "26-3009",
  "SafetyInspectionDate": "2003-06-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": "Portland Oregon Facility",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-09-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-08-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 45.588771,
  "FRS_Long": -122.690793,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76342,
      "AltID": "Resin Manufacturing",
      "FacilityID": 52505,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 101136,
          "ProcessID": 76342,
          "ChemicalID": 1,
          "Quantity": 231600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 78176,
          "ProcessID": 76342,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 44878,
              "Process_NAICS_ID": 78176,
              "SafetyReviewDate": "2000-09-01 00:00:00",
              "PHA_Date": "2000-09-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-10-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "1)Thermal oxidizer, 2)Rupture disc routed to containment",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "LEL monitor on Thermal Oxidizer",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2003-10-01 00:00:00",
              "TrainingReviewDate": "2004-04-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2004-05-03 00:00:00",
              "EquipmentInspectionDate": "2004-05-03 00:00:00",
              "EquipmentTested": "Formadehyde system",
              "ChangeMgmtDate": "2004-01-15 00:00:00",
              "ChangeMgmtReviewDate": "2004-01-15 00:00:00",
              "PreStartupReviewDate": "2002-11-01 00:00:00",
              "ComplianceAuditDate": "2001-08-01 00:00:00",
              "AuditCompletionDate": "2001-10-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2000-09-01 00:00:00",
              "HotWorkPermitReviewDate": "2000-09-01 00:00:00",
              "ContractorSafetyReviewDate": "2004-05-10 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 65113,
                  "PreventionProgram3ID": 44878,
                  "ProcessChemicalID": 101136
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52505,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-09-01 00:00:00",
    "ERTrainingDate": "2003-06-01 00:00:00",
    "CoordinatingAgencyName": "Portland Fire Bureau",
    "CoordinatingAgencyPhone": "5038233700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 52505,
      "SummaryText": "ed.  Under conservative weather conditions (1.5 m/s wind velocity, stability class F), the distance to the toxic end-point of 0.012 mg/L was estimated to be 921 yards using the ALOHA model.  We rounded this result to 0.5 miles in our report. \r\n\r\nAn alternative release scenario has also been submitted for formaldehyde solution.  The alternative release scenario assumes an instantaneous loss of the entire contents of formaldehyde storage tank #40.  The tank contains 33,500 Gallons of 50% (w/w) formaldehyde solution in water.  The solution is stored at 140oF (60oC).   The release is fully contained in the diked area below the tank (passive mitigation control).  Volatilization of the spilled material occurs at a rate dependent upon the vapor pressure of formaldehyde gas over a 50% solution of formaldehyde in water.  The vapor pressure of formaldehyde at 140oF is 17 mm Hg.  The solution is presumed to cool upon contact with the concrete containment berm.  The cooled formaldehyde (which exists in aqueous solution as polyoxymethyleneglycol) begins to precipitate at approximately 125oF.  A release rate of 1.76 lbs/minute was calculated using the ALOHA evaporation calculator.  A release duration of 60 minutes was used.  Using assumed weather conditions of 3 m/s wind velocity and a stability class of D, the distance to the toxic end-point of 0.012 mg/L was estimated to be 113 yards using the ALOHA model with a direct release scenario.  We rounded this result to 0.1 miles in our report.\r\n\r\n\r\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\r\n\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  Arclin voluntarily participates with Oregon OSHA's Safety and Health Achievement Recognition Program (SHARP) to further enhance plant safety and compliance."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 52505,
      "SummaryText": "substance.  No incidents have occurred in more than 5 years.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  Arclin uses the Kepner-Tregoe Problem Analysis program for incident analysis.  Many of our employees have been formally trained in this process.  All incident analysis reports are retained for a minimum of 5 years.  \r\n\r\nEmployee Participation\r\nArclin Surfaces truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, in particular information resulting from process hazard analyses.\r\n\r\nContractors\r\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Arclin Surfaces has a strict policy of informing the contractors of known potential hazards related to the contractor's work and Arclin's processes.  Plant specific safety rules are presented and explained and violations of these rules constitute grounds for termination of the contractor's service agreement.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\n\r\n5. Five-year Accident History\r\n\r\nArclin Surfaces has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.  The plant has had no time-loss accidents in more than 4 years.  No accidents involving hazardous materials have occurred in more than 5 years.\r\n\r\n\r\n6. Emergency Response P"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 52505,
      "SummaryText": "lan\r\n\r\nArclin Surfaces maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is inspected and serviced annually.  Arclin maintains accounts with emergency response contractors to provide cleanup services in the event of a major release.  In addition, the emergency response plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\r\n\r\n\r\n7. Planned Changes to Improve Safety\r\n\r\nOver the years, many safety developments have resulted from the implementation of the various elements of our accidental release prevention program.  Many of these have come from our own employees and operators.  Our safety record confirms that our programs are working extremely well.  It is our intention to continue to emphasize our current plan and encourage employee input.  At this time, all recommended changes have been implemented.\r\n\r\n\r\n\r\n1"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 52505,
      "SummaryText": "Arclin Surfaces, Inc\r\nPortland, Oregon \r\n\r\nRISK MANAGEMENT PLAN\r\nExecutive Summary\r\n\r\n1. Corporate Policies\r\n\r\nWe at Arclin Surfaces are strongly committed to employee, public and environmental safety.  This commitment is inherent to the comprehensive accidental release prevention program that we have in place for our facility.  This program covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances from our operations.  \r\n\r\n\r\n2. The Stationary Source and the Regulated Substances Handled\r\n\r\nOur facility's primary activities encompass manufacturing of phenolic resin and phenolic overlays.  We store and use only one regulated substance (formaldehyde solution) at our facility.  The formaldehyde solution is a 50% (by weight) solution of formaldehyde in water and is used as a raw material to manufacture phenolic resins and glues.\r\n\r\nThe maximum inventory of formaldehyde solution at our facility is currently 321,600 lbs.\r\n\r\n\r\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\r\n\r\nTo perform the off-site consequence analysis for our facility, we have used ALOHA evaporation calculations and dispersion modeling.  We compared these results to manual calculations using the look-up tables and equations provided by the EPA in the RMP Off-site Consequence Analysis Guidance.  There was close agreement between these methods.  The use of RMPComp32 software was rejected as the program did not support 50% formaldehyde or release temperatures greater than 77oF.  The following paragraphs provide details of the chosen scenarios.  \r\n\r\nThe worst-case release scenario for formaldehyde (which is considered an EPA Program 3 toxic substance at Arclin) assumes an instant"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52505,
      "SummaryText": "aneous loss of the entire contents of formaldehyde storage tank #40.  The tank contains 33,500 Gallons of 50% (w/w) formaldehyde solution in water.  The solution is stored at 140oF (60oC).   The release is fully contained in a 61?x85?x1.5? diked area beneath the tank (passive mitigation control).  Volatilization of the spilled solution is known to occur at a rate dependent upon the vapor pressure of formaldehyde gas over a solution of formaldehyde in water.  The vapor pressure of 50% formaldehyde at 140oF is 17 mm Hg, according to J.F. Walker (Formaldehyde, 3rd Edition, Reinhold Publishing, NY, NY.  1964).  \r\n\r\nThe formaldehyde solution is presumed to remain at the storage temperature (140oF) in the concrete containment berm.  The ALOHA Evaporation Calculator was used to estimate the release rate of formaldehyde from solution.  (This program uses measured vapor pressures of formaldehyde gas above aqueous solutions of formaldehyde ranging in concentration from 0 to 40% to calculate the vapor pressure and evaporation rate of formaldehyde under specified conditions.  To estimate the release rate and vapor pressure of a 50% solution at 140oF, we extrapolated the ALOHA data.)   A release rate of 10.83 lbs/minute and a vapor pressure of 22.2 mm Hg were returned from the ALOHA Evaporation Calculator.  \r\n\r\nThe calculator uses temperature, formaldehyde concentration, wind speed, puddle length and puddle width as inputs and returns initial evaporation rate and initial vapor pressure.  It cannot make adjustments for dis-continuous puddles of spilled formaldehyde (such as a release into a containment area containing other storage tanks) and thereby exaggerates the evaporative surface area and overestimates evaporation rates when the puddle is not continuous.  No correction was made for this error.\r\n\r\nThe results were modeled in ALOHA using the initial evaporation rate as a direct release input.  A release duration of 60 minutes was used.  A total release of 650 lbs was calculat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52505,
      "SummaryText": "The following sections briefly describe the elements of our release prevention program that are in place at our stationary source.\r\n\r\nProcess Safety Information\r\nArclin Surfaces maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\r\n\r\nProcess Hazard Analysis\r\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is the use of a checklist and what-if scenario analysis.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are re-evaluated when new equipment or processes are added or at the  intervals specified in the PSM regulations.  Any findings related to the hazard analysis are addressed in a timely manner.\r\n\r\nOperating Procedures\r\nFor the purposes of safely conducting activities within our covered processes, Arclin Surfaces maintains written Standard Operating Procedures.  These procedures address virtually all elements of plant operation including such aspects as initial process start-up, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and start-up after process repairs or modifications.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\r\n\r\nTraining\r\nArclin Surfaces has a comprehensive training program in place to ensure that employees who are operating processes are fully competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every other year and when processes are modified, new equipment installed or as deemed necessary by operations mana"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 52505,
      "SummaryText": "gement.\r\n\r\nMechanical Integrity\r\nArclin Surfaces carries out documented maintenance checks on process equipment to ensure proper functions.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices and chemical safety.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\nWritten procedures are in place at Arclin Surfaces to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\nPre-startup Reviews\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Arclin Surfaces.  These reviews are conducted to confirm that construction, equipment, operation and maintenance procedures are suitable for safe start-up prior to placing equipment into service.\r\n\r\nCompliance Audits\r\nArclin Surfaces conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  Arclin also uses a continuous behavioral-based safety audit program (STOP) in which all employees participate to promote safe plant operation.\r\n\r\nIncident Investigation\r\nArclin Surfaces immediately investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated"
    }
  ]
}