{
  "FacilityID": 52529,
  "FacilityName": "City of Turlock",
  "FacilityStr1": "901 South Walnut Road",
  "FacilityStr2": null,
  "FacilityCity": "Turlock",
  "FacilityState": "CA",
  "FacilityZipCode": "95380",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.484100",
  "FacilityLongDecDegs": "-120.870200",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Turlock",
  "OperatorStr1": "901 South Walnut Road",
  "OperatorStr2": null,
  "OperatorCity": "Turlock",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95380",
  "OperatorZipCodeExt": null,
  "RMPContact": "John S. wilson",
  "RMPTitle": "Division Manager",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000123868",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-04-23 00:00:00",
  "SafetyInspectionBy": "Central San Joaquin Valley Risk Management Agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-09-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-09-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-09-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2022-01-28 00:00:00",
  "DeRegistrationEffectiveDate": "2022-01-12 00:00:00",
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.48583,
  "FRS_Long": -120.86722,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76448,
      "AltID": "wastewater treatment",
      "FacilityID": 52529,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 78290,
          "ProcessID": 76448,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 101279,
          "ProcessID": 76448,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 601279,
          "ProcessID": 76448,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52529,
      "SummaryText": "CITY OF TURLOCK CALIFORNIA\nREGIONAL WATER QUALITY CONTROL FACILITY\nRISK MANAGEMENT PROGRAM (CalARP)\nAND PROCESS SAFETY MANAGEMENT PROGRAM\n\nChlorine system\n\nEXECUTIVE SUMMARY\nRevised August 2008\n\nThe City of Turlock Regional Water Quality Control Facility (RWQCF) prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) for its wastewater plant in general accordance with state and federal regulations. The state risk management regulations, also referred to as the California Accidental Release Prevention Program (CalARP), are codified in California Code of Regulations (CCR), Title 19, Section 2745, et. seq. The Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances. The federal regulations are codified in the Code of Federal Regulations (CFR), Title 40, Section 68. Finally, both the California Occupational Safety and Health Administration (CalOSHA) and the Federal Occupational Safety and Health Administration (OSHA) regulate facilities with certain acutely hazardous materials under the PSM standards as defined in CCR, Title 8, Section 5189 and CFR Title 29, Part 1910, Section 119, respectively.\n\nRWQCF prepared the RMP/PSM Program to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous chlorine handling systems and practices at the facility. In the unlikely event that a chemical release does occur at the facility, RWQCF has written an Emergency Response Program and personnel are trained in the appropriate response measures, relying on emergency services provided by the local fire department and the Stanislaus County Hazardous Materials Response team. RWQCF will continue to improve chlorine-handling safety through the implementation of the prevention program elements of the RMP/PSM Program.\n\nRWQCF?s wastewater plant is located at 901 South Walnut Road, Turlock, California. The area is zoned for industrial use. This facility processes wastew"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52529,
      "SummaryText": "ater for Turlock and surrounding communities, processing approximately 13.4 million gallons of wastewater per day.  \n\nChlorine is used in the facility?s water treatment system. The chlorine system, which is an open system, contains approximately 36,000 pounds of chlorine in ton-containers. The system takes liquid chlorine from ton-containers, changes the liquid to a gas in evaporators, and then provides gaseous chlorine to water injectors which mix the gas with water to form a disinfecting agent.  The disinfecting agent is piped to various points at the water treatment facility.\n\nThe RMP regulations require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling systems covered by the RMP. Program 3 requirements of the RMP apply to the RWQCF facility due to the quantity of chlorine used. Program 3 facilities are required to evaluate a worst-case release scenario (release parameters are defined by the regulations) and an alternative release scenario. The regulations define a worst-case release scenario as ??the greatest amount held in a single vessel?released as a gas over 10 minutes.?  An alternative release scenario is identified as a release that is more likely to occur at the facility.\n\nThis facility has prepared worst-case and alternative release scenarios.  These are not summarized herein as recommended by EPA, but are presented in the RMP.\n\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility. RWQCF has incorporated many safety features in the chlorine system to prevent system failures and to mitigate potential releases. The predominant safety concern with chlorine systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to chlorine expansion. The RWQCF chlorine system is continuously monitored by automated control systems that shut down ton-cylinder valves "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52529,
      "SummaryText": "if deviations from normal operating conditions occur. Liquid chlorine piping is protected by expansion tanks wherever the possibility of trapping liquid chlorine exists.  Further, the system is equipped with pressure relief valves on all liquid piping and most, if not all, additional locations within the chlorine system where chlorine could become trapped.  Pressure relief valves vent to a chlorine scrubber system for chlorine removal.\n\nOther safety features at the facility include: \n? Storage Room emergency ventilation system\n? Chlorine leak detection in storage room and control areas\n? Remote emergency shutdown switch\n? Fire sprinklers throughout the chlorine facility\n? Component specific safety shutdowns\n\nIn addition to the physical features of the chlorine system at the facility, RWQCF has extensive administrative controls in place to maintain safe operation of the system. Administrative controls include, but are not limited to, formal training programs for system operators, emergency training, a hot work permit program, a lockout/tagout program, a contractor safety program, incident investigation program, mechanical integrity program, management of change program, pre start-up safety review program and an RMP/PSM auditing and inspection program. Written standard operating procedures (SOPs) are being prepared for the chlorine system at the facility. The SOPs will provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\n\nRWQCF is committed to maintaining the mechanical integrity of the chlorine system. A preventive maintenance system is utilized to manage the maintenance of the system. Preventive maintenance at the facility includes shift, daily, weekly, and periodic inspection; calibration; testing; and overhaul of chlorine system equipment. The system is used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52529,
      "SummaryText": "ns from normal operating parameters.\n\nThe RMP/PSM regulations require a review of the five-year accident history at the regulated facility. RWQCF has had no reportable accidental release of chlorine during the past five years.\n\nRWQCF has performed a Process Hazard Analysis (PHA) in 2008 and has received a new list of suggested mitigating measures.  RWQCF management has responded to all suggested mitigation measures promptly and has established completion schedules for proposed actions. Management responses and support will be consistent with RWQCF?s commitment to safe and environmentally responsible operations.  Changes suggested at the PHA included:\n\n? Revision of SOPs to better reflect current system configuration\n? Identifying and numbering valves on P&ID and equipment\n? Addition of an overpressure switch on vacuum manifold with alarm signal to SCADA\n\nRWQCF recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous chlorine handling operations at its facility. As such, this document and related attachments and program elements will evolve as RWQCF continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community. RWQCF will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the RMP/PSM, related attachments, and program elements will be incorporated consistent with RWQCF?s internal review practices, and RWQCF will maintain the most current versions on site. Thus, the most current version RMP/PSM and related documents and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    }
  ]
}