{
  "FacilityID": 52532,
  "FacilityName": "Burney Forest Power",
  "FacilityStr1": "35586-B Hwy 299E",
  "FacilityStr2": null,
  "FacilityCity": "Burney",
  "FacilityState": "CA",
  "FacilityZipCode": "96013",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06089",
  "LEPC": "Region III LEPC",
  "FacilityLatDecDegs": "40.879515",
  "FacilityLongDecDegs": "-121.719811",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 195641709,
  "ParentCompanyName": "Burney Biomass Power LLC.",
  "Company2Name": "Forest Products L.P.",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "North American Energy Services",
  "OperatorStr1": "35586-C Hwy 299E",
  "OperatorStr2": null,
  "OperatorCity": "Burney",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "96013",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ronald A. Gawer",
  "RMPTitle": "Plant Manager",
  "FTE": 25,
  "OtherEPAFacilityID": "CAL000313057",
  "EPAFacilityID": "100000089673",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "87-TV-27k",
  "SafetyInspectionDate": "2008-04-23 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-09-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-09-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-09-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 40.87751,
  "FRS_Long": -121.72569,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76452,
      "AltID": "ammonia injection",
      "FacilityID": 52532,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 78294,
          "ProcessID": 76452,
          "NAICSCode": "221119",
          "_desc": {
            "NAICS_CODE": "221119",
            "NAICS_DESCRIPTION": "Other Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 101283,
          "ProcessID": 76452,
          "ChemicalID": 56,
          "Quantity": 52530.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 601283,
          "ProcessID": 76452,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52532,
      "SummaryText": "RMP Submit Executive Summary 090808\n\nIn response to the requirements of the California Code of Regulations and Federal EPA, this California Accidental Release Prevention (EPA Risk Management) Program document (CalARP/RMP) has been developed for the Burney Forest Power (BFP) located in Burney, California.  BFP is owned by Burney Forest Products, A Joint Venture, and operated by North American Energy Services (NAES).\n\nPlant Process Information:  BFP consists of two biomass-fired (wood) boilers, which produces an electric power output of 28.4 megawatts (MW).  Principle process equipment includes the boilers, steam turbine, air pollution control systems, fuel handling systems, ammonia storage and delivery system, and a cooling tower. The site elevation is approximately 3250 ft. above mean sea level. \n\nEmission controls incorporate Best Available Control Technology (BACT). Each boiler is equipped with electrostatic precipitators for control of particulate matter, and ammonia injection (Thermal DeNOx) for the control of nitrogen oxide (Nox) emissions. Anhydrous ammonia is used as the Nox reduction reagent. A 12,000-gallon anhydrous ammonia storage tank is currently used at the site. Additional project components include a power distribution center, continuous emission monitoring system, fuel handling and ash processing systems. \n\nSubstances Used/Stored: Anhydrous ammonia, CAS# 1336-21-6\n\nAccidental Release Prevention Steps:  BFP is committed to public safety, personnel safety, continued reliable operation, and regulatory compliance.  Based on this commitment, the Plant Manager has overall responsibility for the development and implementation of the RMP.  A management system has been developed with clearly defined accountability and responsibility for the RMP Program.\n\nTo help ensure that a worst-case or alternative release scenario does not occur, BFP maintains a release prevention program with the primary focus of protecting the public and plant employees from the hazard"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52532,
      "SummaryText": "s associated with an accident or release involving anhydrous ammonia.  The multifaceted program includes the use of: ammonia gas detectors and alarms to rapidly alert operators to any problems; safety information to document the safe process design; process hazards analyses to evaluate the chemical and process hazards, operating procedures to ensure that the system is operated safely, maintenance, inspection, and testing to ensure that the system is properly maintained; safe work practices to ensure that employees working on and around the processes are aware of the hazards, can perform their job duties safely, and know the actions to be taken in an emergency; Incident Investigation procedure to investigate incidents and \"near misses\" to determine root causes and make needed safety improvements; and, periodic Compliance Audits to ensure that our programs are working as they should.\n\nFive-Year Accident History:  There have been no releases of anhydrous ammonia from the ammonia system that would fall subject to the reporting requirements (e.g., no deaths, injuries, significant property damage, environmental damage, or sheltering-in-place) within the past five years.\n\nEmergency Response:  In the event that an anhydrous ammonia release does occur, BFP has an emergency response program that coordinates emergency response with the Burney Fire Prevention District.  Additionally, the plant has emergency operations procedures in place detailing appropriate emergency actions to help mitigate the effects of any release. \n\nMaintaining A Safe Operation:  BFP will continually work to safely manage the hazards of anhydrous ammonia to protect the community we serve and the employees working for us. The Risk Management Program will be maintained to reduce the risk of accidental releases through training, procedures, equipment maintenance, and safe work practices. Periodically, we will audit our program, review our Process Hazard Analysis, coordinate with the community emergency resp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52532,
      "SummaryText": "onse organization, and will update our program as needed to assure safe and efficient control and management of the ammonia system.  \n\nCurrent Changes:  BFP has recently experienced an internal and external review of the CalARP program and has identified opportunities for improvement and necessary updates. A new Process Hazard Analysis (PHA) has been conducted, the Off-site Consequence Analysis has been re-evaluated, an MOC has been implemented for the installation of additional ammonia sensors, procedures have been consolidated to fit current operator standards and administrative changes have been implemented for consistency with the updated RMP elements.  All other elements of the RMP registration have been updated appropriately."
    }
  ]
}