{
  "FacilityID": 52608,
  "FacilityName": "Ashland Specialty Chemical Co. -Calumet City, IL",
  "FacilityStr1": "14303 Paxton Ave",
  "FacilityStr2": null,
  "FacilityCity": "Calumet City",
  "FacilityState": "IL",
  "FacilityZipCode": "60409",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.636944",
  "FacilityLongDecDegs": "-087.567778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PP",
  "FacilityURL": "www.ashspec.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 115791261,
  "ParentCompanyName": "Ashland, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 5003264,
  "Company2DUNS": 5003264,
  "OperatorName": "Ashland Specialty Chemical Company",
  "OperatorStr1": "14303 Paxton Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Calumet City",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60409",
  "OperatorZipCodeExt": null,
  "RMPContact": "Russell Montgomery",
  "RMPTitle": "Plant Manager",
  "FTE": 68,
  "OtherEPAFacilityID": "60409SHLND142ND",
  "EPAFacilityID": "100000037658",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "031039AAA",
  "SafetyInspectionDate": "2007-02-21 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Calumet City",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-03-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-09-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-09-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2012-12-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 41.63667,
  "FRS_Long": -87.56528,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76620,
      "AltID": "Formalin",
      "FacilityID": 52608,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 78467,
          "ProcessID": 76620,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 101509,
          "ProcessID": 76620,
          "ChemicalID": 1,
          "Quantity": 92000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 601509,
          "ProcessID": 76620,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 76621,
      "AltID": "Vinyl Acetate Monomer",
      "FacilityID": 52608,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 78468,
          "ProcessID": 76621,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 101510,
          "ProcessID": 76621,
          "ChemicalID": 29,
          "Quantity": 67000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 601510,
          "ProcessID": 76621,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52608,
      "SummaryText": "Accidental release prevention and emergency response policies:\n  \nAshland Specialty Chemical Company (Ashland) relies on numerous policies and programs to ensure early identification of and proper response to potential emergencies, including: \n\n     Training and drills in emergency preparedness, hazardous materials training, disaster response and\n     control, first-aid, and fire-and-rescue techniques;\n\n     Frequent auditing of all preparedness programs; safety training and education; and\n\n     Regular review, follow-up, and maintenance of all company operations and equipment.  \n\nOur facilities regularly invite local fire departments and emergency responders to tour and inspect our plants, participate in joint emergency drills, and gain familiarity with our operations.  Our facilities have written emergency preparedness plans that are updated regularly. \n\nAshland facilities typically host open houses every 3 to 5 years as an opportunity for neighbors to learn about our commitment to safety.  Ashland makes an effort to support our communities through sponsorship of local activities and participation in local organizations.\n \nDescription of facility and the regulated substances handled:\n  \nAshland's Calumet City facility manufactures a variety of acrylic and phenolic resins for the Specialty Polymers and Adhesives industry.  Fifty weight percent formaldehyde (formalin) and vinyl acetate monomer are the two substances present which are regulated under the USEPA Risk Management Program Rule, 40 CFR 68.\n\nFor more information, visit our web site at www.ashspec.com or contact the Plant Manager.\n\nThe worst-case release scenario:\n\nThe USEPA RMP regulations require the worst-case release scenario to assume that the entire contents of the largest vessel are released.  This event is highly unlikely and has never occurred at our facility.  The USEPA requires that one worst-case scenario be reported to represent all regulated toxic substances held above the threshold quantity.  "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52608,
      "SummaryText": "Additional worst-case release scenarios must be reported for those covered processes that could potentially affect different offsite public receptors.  Ashland reported the worst-case scenarios for both formaldehyde and vinyl acetate monomer because they have the potential to impact upon different public receptors.  The Calumet City facility has never had a release of formaldehyde or vinyl acetate monomer that resulted in an offsite impact.  Based on our analysis using USEPA-approved modeling methods, the worst-case release scenario could potentially affect offsite receptors.  The administrative controls and passive mitigation measures considered in the worst-case analysis for both formaldehyde and vinyl acetate monomer were diked containment, foam vapor mitigation systems/water deluge system, vapor detection, video camera coverage and restricted capacity.\n\nThe alternative-case release scenario:\n\nThe USEPA RMP regulations require an analysis of the alternative-case release scenarios.  The alternative-case release scenario represents an accidental release that is more reasonable than the worst-case, but is still highly unlikely to occur.  The USEPA requires that the results of the alternative-case release scenario analysis be reported for each toxic present.  Based on our analysis using USEPA-approved methods, the alternative-case release scenarios for formaldehyde and vinyl acetate monomer do not impact offsite public receptors.  There were no specific administrative controls or passive mitigation measures considered in the analysis to limit the distances reported.  The active mitigation measure considered in the alternative-case analyses for each of the covered chemicals involved recognition of an individual present during unloading operations.\n\nGeneral accidental release prevention program and chemical-specific prevention steps:\n \nThis facility is operated in strict accordance with the USEPA prevention program requirements.  A written management system is in place"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52608,
      "SummaryText": " with operating and maintenance procedures for the covered processes.  These procedures ensure rigorous training for operations employees, an effective mechanical integrity program, numerous management checks and balances, and strict attention to changes in the operations with a thorough review and examination of potential incidents that could lead to an accidental release.  Ashland maintains a 24-hour corporate emergency reporting system that can speedily coordinate emergency response with top management and quickly communicate key first-aid or medical information to local health care providers.  This facility has emergency medical treatment information readily available for use in the event of an emergency.  \n\nFive-year accident history. \n\nDuring the past five years, we have not had any releases of the regulated substances that have resulted in or could have resulted in an offsite impact.  \n\nEmergency response program:\n \nMost facility employees are trained to the 24 hour Technician level; however, \"emergency response\" releases (as defined in 29CFR1910.120) requiring offensive actions are generally handled by outside emergency response teams. Site employees will generally implement defensive actions.  Our facilities regularly invite local fire departments and emergency responders to tour and inspect our plants, gain familiarity with our operations, and participate in joint emergency drills.  Our facilities have written emergency preparedness plans that are updated regularly.  The facility currently has five fixed foam systems for fire control and vapor mitigation.  In addition, the facility has three fixed water deluge systems.  The plant maintains a 4,000 gallon foam inventory.      \n  \nPlanned changes to improve safety:\n\nOur facilities continually evaluate and implement employee suggestions and recommendations resulting from process hazard analyses.  We make changes to improve reliability and safety based on information developed within our organization and indus"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52608,
      "SummaryText": "try.  Toward continuous improvement, we are looking at ways to minimize risk through process improvement, process re-design, and formulation substitution.  Ashland is committed to the Chemical Manufacturers Association's Responsible CareSM Initiative Management Code on Process Safety and will be pursuing ISO 14001 Certification as well as OSHA VPP ."
    }
  ]
}