{
  "FacilityID": 52688,
  "FacilityName": "Wimmer's Meat Products, Inc.",
  "FacilityStr1": "6126 West Grant Street",
  "FacilityStr2": null,
  "FacilityCity": "West Point",
  "FacilityState": "NE",
  "FacilityZipCode": "68788",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31039",
  "LEPC": "Cuming County LEPC",
  "FacilityLatDecDegs": "41.838889",
  "FacilityLongDecDegs": "-096.722778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.wimmersmeats.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7261431,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Dave Wimmer",
  "OperatorStr1": "6126 West Grant Street",
  "OperatorStr2": null,
  "OperatorCity": "West Point",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68788",
  "OperatorZipCodeExt": null,
  "FTE": 135,
  "OtherEPAFacilityID": "3103900013",
  "EPAFacilityID": "100000184016",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-04-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-10-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-10-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-10-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-10-01 00:00:00",
  "DeRegistrationEffectiveDate": "2015-09-03 00:00:00",
  "AnniversaryDate": "2013-10-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 41.83845,
  "FRS_Long": -96.7219,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76745,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 52688,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 101659,
          "ProcessID": 76745,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 78593,
          "ProcessID": 76745,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 45191,
              "Process_NAICS_ID": 78593,
              "SafetyReviewDate": "2006-09-13 00:00:00",
              "PHA_Date": "2007-01-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-06-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-09-23 00:00:00",
              "TrainingReviewDate": "2006-09-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-12-03 00:00:00",
              "EquipmentInspectionDate": "2003-12-03 00:00:00",
              "EquipmentTested": "All compressors, all condensers, all evarorators, and all valves and piping",
              "ChangeMgmtDate": "2008-09-23 00:00:00",
              "ChangeMgmtReviewDate": "2008-09-23 00:00:00",
              "PreStartupReviewDate": "2003-09-29 00:00:00",
              "ComplianceAuditDate": "2006-09-13 00:00:00",
              "AuditCompletionDate": "2011-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-05-03 00:00:00",
              "HotWorkPermitReviewDate": "2008-02-11 00:00:00",
              "ContractorSafetyReviewDate": "2008-02-11 00:00:00",
              "ContractorSafetyEvalDate": "2008-02-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 65515,
                  "PreventionProgram3ID": 45191,
                  "ProcessChemicalID": 101659
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52688,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-04-22 00:00:00",
    "ERTrainingDate": "2008-04-12 00:00:00",
    "CoordinatingAgencyName": "West PointVolunteer Fire Department",
    "CoordinatingAgencyPhone": "4023726009",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "NA",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52688,
      "SummaryText": "Risk Management Plan\nExecutive Summary\n\nWimmer¿s Meat Products\nWest Point, NE\n\nWimmer¿s Meat processing plant is centrally located in the community of West Point, NE.  The plant processes various pork, beef and animal products into high-quality Sausage and Ham products.  This facility is subject to the Environmental Protection Agency¿s Risk Management Program rules under the Clean Air Act Amendments of 1990.\n\nThe Risk Management Program rules require facilities handling threshold amounts of certain chemical substances to submit Risk Management Plans for the prevention of accidental releases of these substances.  The plan submission must include hazard assessments defining possible off-site impacts of certain regulated substance release scenarios, a five-year accident history, description of the facilities accidental release prevention program, and an emergency response program. \n\nThe following is the Executive Summary of the Risk Management Plan for Wimmer¿s Meat Products, West Point, NE.\n\nFacility Snapshot\nThis facility, constructed in 1940, was owned and operated by Ocoma Foods prior to Wimmer¿s acquisition of the plant in 1957.  The plant produces more than 11 million pounds of product annually.\n\nImpact on the community\n¿\tWimmer¿s employs 135 area residents at a combined annual salary of approximately $3 million.\n¿\tWimmer¿s supports the city of West Point and the State of Nebraska with state and local taxes.\n¿\tThe facility purchases more than $500,000 of local services; electricity, natural gas, water, wastewater treatment, and other miscellaneous items.\n\n\nEmployee snapshot\nWimmer¿s employees are involved in community activities.  The facility supports the United Way, American Cancer Society, Regional Blood Bank, Volunteer Fire and Rescue, and other community support organizations. \n\nPollution Prevention Policy\nWimmer¿s Meat Products is committed to protecting the environment and preserving our natural resources for future generations. We pledge to eliminate or r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52688,
      "SummaryText": "educe our use of toxic substances and to minimize our use of energy and the generation of all wastes to the extent technically and economically feasible. We strive to prevent the generation of pollution at the source, but, where that cannot be achieved, we are committed to environmentally sound methods of recycling, treatment and disposal. By preventing pollution at the source, we strive to achieve cost savings, increase operational efficiencies, improve the quality of our products and services, maintain a safe and healthful workplace and improve the environment.\n\nStationary Source and Regulated Substances\nThe Wimmer¿s plant handles and stores large quantities of anhydrous ammonia for its refrigeration operations.  Ammonia storage and handling constitute the processes covered by the EPA Risk Management rule.\n\nAccidental Release Prevention and Emergency Response Policy\nThe management and employees of this facility are committed to the prevention of any accidental releases of hazardous and regulated substances and to minimize the effects of any such releases that may occur.  Prevention of accidental releases is critical to the safe operation of this plant, to the safety of its employees, and to the safety of the general public.\n\nTo achieve its goals of accident and accidental release prevention, the facility is committed to the following:\n¿\tA knowledgeable and highly trained and motivated employee group\n¿\tA well designed facility that is maintained and operated in a superior manner\n¿\tImprovements that enhance safety and accident prevention where appropriate\n¿\tExcellence in safety programs and practices; a superior safety and accident record\n¿\tPreparation and training for emergency response and mitigation\n\nThe plant has a written Emergency Response Plan in effect.  Wimmer¿s Meat Products is committed to responding to and mitigating any accidental releases of ammonia to minimize the impact to employees, the community, and environment.  The response plan is coordinated w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52688,
      "SummaryText": "ith the Local Emergency Planning Committee, Emergency Response Agencies and the plant has interacted with possible responding agencies regarding the plan and activities at the plant.  Employees are trained in the implementation of the plan and in possible response activities that could be required in the event of an emergency.  The plant has developed a Hazardous Materials Team made up of plant employees who are trained to respond in the event of an ammonia release on site.\n\nPrevention Program\nWimmer¿s Meat Products is subject to the OSHA Process Safety Management rule, 29 CFR 1910.119.  Therefore, under the EPA Risk Management Rule, the plant is a Program 3 facility with a Program 3 Prevention Program. The OSHA Process Safety Management /EPA Prevention Program consists of facility management policies and procedures which promotes and recognizes process safety and the prevention of accidents in plants that handle, use, store, and process hazardous chemical materials. The procedures address all aspects of plant activities including training, maintenance, operating procedures, process reviews, maintenance, safe work practices, incident investigation, audit, and other activities in a manner to provide controls to prevent errors, failures, and inadvertent changes in a process that could result in accidents.\n\nWimmer¿s Meat Products adheres to the requirements of Process Safety Management and has written policies and procedures addressing all aspects of Process Safety Management and EPA Prevention Programs.  The Prevention Program consists of several elements and policies which are briefly outlined below: \n¿\tEmployee Participation¿Employees are involved in all aspects of the program and are provided any information developed in the program.  Employees participate in process reviews, assist with development of procedures, and all other aspects of the program.\n¿\tProcess Safety Information--All necessary process information and records are maintained including information on"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52688,
      "SummaryText": "the hazards of the chemicals, process technology, safe operating limits, equipment records and design requirements\n¿\tProcess Hazard Analysis--Process hazard analysis and review are conducted by employee teams to identify and correct any perceived hazards.  These reviews are updated regularly, or when change indicates the necessity of additional review.\n¿\tOperating Procedures¿Operating procedures are in place for all aspects of operation including emergency operation and shutdown, limits and methods to correct or avoid deviations from limits, safety and health considerations of operations and the chemicals involved, and safety system operation and function.\n¿\tOperating Training¿All operators are trained initially in the process and its operating procedures and receive refresher training not less than every three years.  In reality, operator training is a continual and ongoing process.  Operator training includes on the job training with more experienced operators and classroom type instruction.\n¿\tContractors¿Contractor selection includes review of safety performance and programs.  Contractors are oriented to known hazards in the facility, the emergency plan, and are required to adhere to facility safe work practice procedures.  Contractor performance is periodically evaluated as necessary to assure work is completed in a safe and correct manner.\n \n¿\tPre-startup Safety Review¿A safety review is conducted on any significant modification of the facility to assure that equipment is installed in accordance with design, all necessary procedures including safety procedures are in place, training is completed, and that all requirements of management of change are completed.\n¿\tMechanical Integrity¿Procedures for inspection, testing, and correction of equipment are in place.  A quality assurance procedure assures equipment, parts, materials, and installation are suitable for the application intended.\n¿\tSafe Work Practices¿Procedures and policies for work permits and maintenan"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 52688,
      "SummaryText": "ce and operating actions are in place for accident prevention.\n¿\tManagement of Change¿No changes are allowed in the process or procedures without review and authorization. The procedure is to assure the safety of the change and to prevent unintended consequences as a result of change.\n¿\tIncident Investigation¿Any incident which results in a significant release or could have reasonably resulted in such a release is promptly investigated by a facility team.  Findings of the investigation and recommendations for corrective action are documented as are the resolution of the recommendations and corrective actions.\n¿\tEmergency Planning and Response¿The Process Safety Management/Prevention Program includes the facility Emergency Response Plan.\n¿\tCompliance Audit¿Compliance with the program is audited at least every three years to verify compliance with these procedures.  Findings, if any, are documented and any deficiencies are corrected and documented.  The audit is conducted by persons knowledgeable of the facility, but not directly connected with the facility.\n\nEmergency Response Plan\nThe Wimmer¿s plant has a written Emergency Response Program as required by the Risk Management rule and other Environmental Protection Agency and OSHA rules.  This Plan is coordinated with the local community response plan and is available to those responding agencies.  Emergency planning and Community Right-To-Know information as required under SARA Title III has been provided to the State Emergency Response Commission, Local Emergency Planning Committee, and other appropriate agencies such as the local fire department. \n\nThe facility is an active participant in the Local Emergency Planning Committee and interacts with various local agencies in its emergency planning such as fire departments, law enforcement agencies, and hospitals.  Employees receive annual training in the response plan and also receive various safety training, both in general, and in the competencies relative to their r"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 52688,
      "SummaryText": "equired roles in the plan.  Periodically, the plan is practiced in a table top, classroom type setting, and also drilled in mock emergencies including participation by outside responding agencies.\n\nWorst Case Toxic Release-Ammonia\nThe Risk Management rule requires that the largest amount in a single vessel be considered the release quantity for the worst case event unless smaller quantities handled at different conditions result in a greater distance to the regulated endpoint of consideration.  This is a requirement of the rule regardless of whether the event is likely, or, could even reasonably occur. The worst case release assumes, as required by the rule, that this entire amount is released as a result of a catastrophic failure of a tank. Since this facility is located in a populated area, the toxic cloud formed by the evaporating ammonia would reach offsite endpoints and nearby public receptors.\n\nIt should be emphasized that the possibility of such an event as described by the worst case is so low as to be non-existent.  Many identical and similar tanks are in existence all over the world and have been in service for many years.  We are aware of no such failure of these tanks nor, even lesser failures of a nature that would provide for an accidental release of quantities less than indicated above.  Analysis of this scenario is required by the rule, and, as such, was completed.\n\nAlternate Case Toxics - Ammonia\nMore likely release events tend to concentrate in areas where the ammonia product is handled such as failure of smaller valves, lines, and hoses. Significantly lower quantities are involved, various shutdown safeguards, and operator intervention all tend to mitigate and limit the consequences of such failures. This alternate release scenario consists of a valve leak, which discharges the contents of the pipe for 10 minutes prior to the emergency shut-off.  The effects of this scenario are identified in our Risk Management Plan submitted to EPA. \n\n5-Year Acc"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 52688,
      "SummaryText": "ident History\nThe Risk Management rule requires inclusion of the five-year accident history of the facility for all accidental releases that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  The Wimmer¿s Meat plant has had no significant releases in the past five years.  During this same period they have upgraded approximately 90% of the mechanical refrigeration system to meet both personal safety and food safety goals.\n\nPlanned Changes for Safety Improvements\nSafety improvements are a continual and ongoing process at the plant, facilitated by the EPA Prevention Program and OSHA Process Safety Management Program.  Formal process hazard analysis is conducted at least every five years, but review is constant through management of change procedures, operator training, incident investigation, and mechanical integrity programs.  Wimmer¿s Meat Products has contracted with third party contractors to assist with implementation Process Safety Management and Risk Management Programs.  As a result, changes relevant to safety occur continuously, as needs are identified through these procedures and policies."
    }
  ]
}