{
  "FacilityID": 52702,
  "FacilityName": "4220 South Kildare Boulevard",
  "FacilityStr1": "4220 S. Kildare",
  "FacilityStr2": null,
  "FacilityCity": "Chicago",
  "FacilityState": "IL",
  "FacilityZipCode": "60632",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.815556",
  "FacilityLongDecDegs": "-087.733611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "daley.john@sbcglobal.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "4220 South Kiladre LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "4220 South Kildare LLC",
  "OperatorStr1": "4220 S. Kildare BLvd",
  "OperatorStr2": null,
  "OperatorCity": "Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60632",
  "OperatorZipCodeExt": null,
  "FTE": 289,
  "OtherEPAFacilityID": "ILR000046664",
  "EPAFacilityID": "100000028515",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-08-21 00:00:00",
  "SafetyInspectionBy": "City of Chicago- Env. Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": "Chicago, IL (Submitted)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2008-10-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-10-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-10-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 41.81602,
  "FRS_Long": -87.73145,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76770,
      "AltID": "Ammonia Refrigeration sys",
      "FacilityID": 52702,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 101694,
          "ProcessID": 76770,
          "ChemicalID": 56,
          "Quantity": 57500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 78618,
          "ProcessID": 76770,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 45216,
              "Process_NAICS_ID": 78618,
              "SafetyReviewDate": "2004-04-21 00:00:00",
              "PHA_Date": "2004-06-09 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-07-23 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2004-04-21 00:00:00",
              "TrainingReviewDate": "2008-06-19 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-01-01 00:00:00",
              "EquipmentInspectionDate": "2008-06-01 00:00:00",
              "EquipmentTested": "Compressors - switches, safeties and controls.  Pump packages - switches, safeties and controls.",
              "ChangeMgmtDate": "2008-08-01 00:00:00",
              "ChangeMgmtReviewDate": "2008-08-01 00:00:00",
              "PreStartupReviewDate": "2008-09-08 00:00:00",
              "ComplianceAuditDate": "2007-05-07 00:00:00",
              "AuditCompletionDate": "2008-05-07 00:00:00",
              "IncidentInvestigationDate": "2008-08-23 00:00:00",
              "InvestigationChangeDate": "2008-08-23 00:00:00",
              "ParticipationPlansReviewDate": "2004-04-21 00:00:00",
              "HotWorkPermitReviewDate": "2004-04-21 00:00:00",
              "ContractorSafetyReviewDate": "2004-04-21 00:00:00",
              "ContractorSafetyEvalDate": "2004-05-14 00:00:00",
              "CBI_Flag": 0,
              "Description": "\n \n\nPREVENTION PROGRAM DESCRIPTION  \n\nThe 4220 Kildare Blvd. hazardous material release Prevention Program is built on the OSHA Process Safety Management Standard for ammonia refrigeration systems.  The first element in the safe function of ammonia refrigeration equipment is in the design itself. All components in the system were designed and installed in compliance with ANSI, ASHRAE, ASME,  Pressure Vessel Codes and all other applicable design safety standards in effect at the time of construction.  In order for this system to function safely and effectively over a long period of time, it must be properly maintained and monitored for system integrity and functional efficiency.  Maintenance and monitoring is accomplished by employees trained to follow safe procedures when operating the equipment from normal start-up to running and emergency shut-down. Also built into the system are automated and manual safeguards that monitor and maintain pressures, temperatures, liquid levels and warning systems that alert operators to respond early to operational deviations before they  become emergencies.\n\nOperator training also includes participation in hazard analysis studies and emergency response procedures that permit hands-on practice in the use of personal protection equipment in an emergency scenario.  The hazard analysis (\"what-if\") study helps operators and emergency responders understand how to evaluate and manage an emergency situation safey and effectively in order to mitigate the potential releases.  Lock-out/tag-out procedures are very important for preventing further hazards around malfunctioning equipment or when making even minor repairs on the system.\nSpill containment and clean-up training is important so that effects of a spill are minimized.  \n\nGeneral employee training involves a knowledge of ammonia hazards, warning systems and evacuation procedures.",
              "_chemicals": [
                {
                  "PrimaryKey": 65549,
                  "PreventionProgram3ID": 45216,
                  "ProcessChemicalID": 101694
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52702,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2002-10-22 00:00:00",
    "ERTrainingDate": "2003-07-13 00:00:00",
    "CoordinatingAgencyName": "Chicago Fire Department",
    "CoordinatingAgencyPhone": "7738475417",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52702,
      "SummaryText": "4220 South Kildare LLC\n\nChicago\n\nEXECUTIVE SUMMARY OF\n THE EPA RISK MANAGEMENT PLAN \n\n\nThe 4220 South Kildare Blvd.Management has elected to implement the requirements of the Risk Management Plan at all locations in order to operate each facility in accordance with regulations and support of best industry standards.  The ultimate objective is to minimize the risk of an accidental ammonia release.  The facility management has developed an Emergency Response Plan along with training to ensure a fast and efficient response in the event of an accidental hazardous material release, fire or other emergency situation.\n\nIn order to prevent a potential accidental ammonia release at any Atlas Cold Storage facilities, the Company has an ongoing review process for design and operating procedures.  This assists in ensuring the refrigeration systems comply with OSHA, EPA and all other local, state and federal regulatory agency safety standards, as well as its own internal standards.\nThe 4220 South Kildare Blvd. has a rigorous emergency response training program that follows the guidelines of federal, state and local regulatory agencies.  The management believes that cooperative emergency response training must include company employees, local emergency responders and regulatory agency people in order to provide a safe workplace and a safe environment.  In an emergency, all personnel are trained to cooperate with fellow employees and other support personnel as directed by the Emergency Response Incident Commander. \n\nThe 4220 South Kildare Blvd, is a refrigerated warehousing facility. The large majority of products stored are refrigerated foods for human consumption and inherently pose no known environmental or safety risks.  Ammonia, a regulated substance, is the commonly used refrigerant in industrial grade refrigeration systems that maintain low storage temperatures and can be safely managed by trained operators.  The ammonia refrigeration process functions within a closed pipin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52702,
      "SummaryText": "g network serving the facility operations.  The refrigeration system in this facility contains approximately 57,500 pounds of ammonia inventory for this process.\n\nThe 4220 South Kildare Blvd. is committed to safe management and operation of the closed Ammonia Refrigeration System.  Maintenance employees are trained to observe operational procedures designed to be as fail-safe as possible to prevent accidental release of ammonia at any time.  Should any accidental release occur, all maintenance employees are certified Emergency Hazardous Material Responders and are required to observe safe emergency response procedures.  They are trained to work in conjunction with the local Emergency Planning Commission to minimize the impact of any accidental releases.\n\nAs part of the 4220 South Kildare Blvd.'s safety programs, we have adopted the OSHA Process Safety Management Plan as an integral part of our base safety manual.  The OSHA PSM Program has been implemented and covers the entire scope of safe operation procedures of the ammonia refrigeration system from start-up and normal operations to potential emergency response operations and subsequent clean-up and restoration of systems.  Normal operations rely on the following:\n\n? The Maintenance Management Procedures are used to perform preventative\n maintenance and to maintain records of all maintenance work performed.  This\n helps to ensure that the closed ammonia system continues to work safely,\n reliably and efficiently in the originally intended manner.\n \n? Any set specifications of systems temperature, pressure, level or power \n interruption, that are exceeded or violated will normally trigger an alarm and\n safety shutdown.  Maintenance technicians are notified of a deviation from\n normal operational specifications through indicator or alarm systems.\n \n? In the event of deviations, technicians are trained to analyze the situation,\n follow personal safety procedures at all times, determine that everything\n is under contro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52702,
      "SummaryText": "l and correct problems and/or deviations.\n \n? If a problem cannot be corrected immediately, the equipment needing\n repair service will be safely locked out of service until such time as\n repairs have been completed.\n -3-\n \n? If a problem cannot be safely handled by the Maintenance Personnel, procedures are in place to obtain the required resources to correct the situation.\n \n During the past five years there have been no accidental releases at this facility.\n \n \n EMERGENCY RESPONSE OPERATIONS READINESS INCLUDES THE THE FOLLOWNG PROGRAMS:\n \n? Written procedures for emergency operations include emergency evacuation\n procedures, emergency shutdown instructions, emergency response training\n expectations, emergency response unit coordination plans, regulatory agency\n notification and other pertinent information.\n \n? The Emergency Response Plan is for managing emergency responses.  It\n identifies response teams, assigns specific emergency tasks to each team,\n provides emergency contact information and sets up procedures for recovery\n of information systems.  It also provides forms for logging emergency\n operations from beginning to end of these operations and forms to facilitate\n a systematic incident investigation and corrective measures to prevent\n recurrence of a similar incident.\n \n? The Emergency Response Training program includes all maintenance\nemployees and local emergency responders.  This establishes an effective\nand informed emergency response team that is familiar with systems and\npotential hazards.\n\nIt is the intent of the 4220 South Kildare Blvd. to not only meet any regulatory requirement, but also take a pro-active approach into implementing these requirements as part of a working safety plan.  Atlas Cold Storage is in a constant review process of its operations and industry standards to provide a safe working environment for our employees, customers and neighbors."
    }
  ]
}