{
  "FacilityID": 52707,
  "FacilityName": "McLane Southern California",
  "FacilityStr1": "4472 Georgia Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "San Bernardino",
  "FacilityState": "CA",
  "FacilityZipCode": "92407",
  "Facility4DigitZipExt": "1857",
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.168889",
  "FacilityLongDecDegs": "-117.343056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Tim Paradoski",
  "OperatorStr1": "4472 Georgia Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "San Bernardino",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92407",
  "OperatorZipCodeExt": "1857",
  "FTE": 350,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000157313",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-10-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-10-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-09-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2009-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.1676,
  "FRS_Long": -117.34158,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 76775,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 52707,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 101700,
          "ProcessID": 76775,
          "ChemicalID": 56,
          "Quantity": 25000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 78623,
          "ProcessID": 76775,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 45219,
              "Process_NAICS_ID": 78623,
              "SafetyReviewDate": "2008-02-22 00:00:00",
              "PHA_Date": "2009-09-09 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-09-09 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-02-22 00:00:00",
              "TrainingReviewDate": "2008-02-22 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-02-22 00:00:00",
              "EquipmentInspectionDate": "2008-09-01 00:00:00",
              "EquipmentTested": "Whole System (5 Year Iechanical Integrity Inspection)",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2008-02-22 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-02-22 00:00:00",
              "HotWorkPermitReviewDate": "2008-02-22 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2008-02-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 65553,
                  "PreventionProgram3ID": 45219,
                  "ProcessChemicalID": 101700
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52707,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-02-22 00:00:00",
    "ERTrainingDate": "2007-02-24 00:00:00",
    "CoordinatingAgencyName": "San Bernardino County Fire Dept",
    "CoordinatingAgencyPhone": "9093868401",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52707,
      "SummaryText": "This Executive Summary contains McLane Southern California¿s administrative and operational programs to prevent ammonia-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is anhydrous ammonia.  The following topics are addressed in this Executive Summary:\n\n? Accidental Release Prevention and Emergency Response Policies\n? Stationary Source and Regulated Substance\n? Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n? Five Year Accident History\n? Emergency Response Program\n? Planned Changes to Improve Safety\n? External Events\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nMcLane Southern California is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the process solution equipment at the facility. \n\nMcLane Southern California senior management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. McLane Southern California¿s safety and environmental policies as they relate to the ammonia refrigeration system are administered by the VP of Distribution, who conducts inspections of the facility to ensure compliance.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe system at 4472 Georgia Blvd. in Riverside, California was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes at the time of construction.  The facility was originally constructed in 1985.\n\nThe ammonia refrigeration system uses 24,700 pounds of ammonia to provide refrigeration for the Dock, Cooler, and Freezer. The majority of the system is located in the engine room including vessels a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52707,
      "SummaryText": "nd compressors.  The condensers are mounted on the roof, and all of the evaporators are located in their respective cold areas.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe McLane Southern California ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with Cal/OSHA's Process Safety Management regulation.  The facility conducts preventative maintenance and any necessary minor repairs in house, but an outside contractor is hired for major repairs or maintenance.\n\nThe facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code, which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors in the engine room as well as sensors near the evaporators, and automatic shut down systems.  In addition, the majority of the ammonia is maintained inside the engine room and just outside of the engine room (condensers). All pressure vessels are equipped with pressure relief valves that are piped to the atmosphere.\n\nIn addition to the Uniform Mechanical Code, McLane Southern California has developed a preventive maintenance program that utilizes the services of a professional refrigeration contractor to complete regularly scheduled inspections and tests of the ammonia refrigeration system as well as repairs as needed to process equipment.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no reportable incidents at McLane Southern California in the past five years (September 2003 ¿ September 2008). [CCR Title 8, § 5189(e)(2)(G)]\n\nA small ammonia release occurred on August 6, 2008, releasing approximately 63-70 pounds of ammonia.  The release resulted when a refrigeration contractor inspecting an evaporator unit with a water leak removed the evapor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52707,
      "SummaryText": "ator cover and struck a quarter inch liquid ammonia line, severing it.  It was determined that the configuration of the piping is somewhat awkward when removing the cover.  No one was injured during the release.  The HAZOP team studied the scenario surrounding the accident and made recommendations to prevent future occurrences of this type of incident.\n \nEMERGENCY RESPONSE PROGRAM\n\nThe McLane Southern California facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document. This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nThe operator of the facility maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations.\n\nIn case of an ammonia emergency, the operator of the McLane Southern California facility plans to evacuate all employees in the facility and activate the facility¿s Emergency Response Team (in conjunction with the refrigeration contractor) to respond to the situation.  If necessary, they will alert the local emergency responders (fire department) for assistance. The operator of the facility plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazards Analysis, including a Hazard and Operability (HAZOP) study and a Facility Inspection, provided mitigation measures to improve safety at the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52707,
      "SummaryText": "McLane Southern California facility located at 4472 Georgia Blvd. in San Bernardino, California.  The McLane Southern California safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n1. Continue to train all employees in the facility Safety Plan/Programs.\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n \nEXTERNAL EVENTS\n\nExternal events were considered during the HAZOP as any type of catastrophic failure (i.e. line break).  Catastrophic failures encompass the following external events: meteorite impact, missile impact, sabotage, and war.  A catastrophic line failure of the ammonia system could result in a line break which was examined in the Hazard Assessment.  The following are some of the external events examined in this study.  \n\nSabotage\n\nThe McLane Southern California facility has no history with any type of sabotage and the facility is unaware of any sabotage activities in the area.  The entire facility is locked by key or by coded entry.\n\nExtreme Temperatures\n\nExternal events including various weather conditions were also considered during the HAZOP.  High summer temperatures were considered under the guide words More Pressure and More Temperature.  Similarly, low winter temperatures were considered under the guide words Less Temperature and Less Pressure.  The lowest temperature recorded in San Bernardino was 14 °F (January, 1944) while the highest temperature recorded was 113 °F (July, 1943).  The saturation pressure of ammonia at 115°F is approximately 251 psig.  If pressure within the ammonia system were to approach 251 psig, the ammonia compressors would automatically shut down. \n\nAlthough various weather conditions are co"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 52707,
      "SummaryText": "mmon experiences at the facility, they are not considered to be a contributing factor to hazardous material accidents in California.  For incidents where the weather condition was identified, clear weather was reported for 90% of the incidents.  The remaining 10% of the incidents occurred during rain (4%), fog (3%), other (2%) which includes snow, hail and electrical storms, and the unknown category (1%). \n\nFlooding\n\nAccording to the Climate Diagnostic Center, most rainfall in San Bernardino occurs during the winter months, while summers are nearly rainless in the San Bernardino area.  Heavy rainfall and flooding have not been a safety concern for the McLane Southern California facility. In the event of flooding, the ammonia system could be manually shut down until conditions warrant returning to normal operations.\n \nFire\n\nFires were considered under the guide words More Pressure and More Temperature during the HAZOP study.  Due to the lack of combustible material at the facility, a fire is unlikely.  In the event of a fire, the pressure relief valves would relieve the excess pressure by venting ammonia into the atmosphere.  Also, ammonia sensors/alarms and smoke detectors have been installed in key locations in the event of an emergency.  Ammonia alarms alert on-site personnel as well as the off-site personnel.\n\nExtreme Winds\n\nThe majority of the ammonia process equipment is located indoors and is protected from extreme winds.  The remaining outdoor equipment is designed for rugged conditions, utilizing durable construction materials such as steel.  Ammonia equipment at the site is not anticipated to be affected by strong winds.  Strong winds are most likely to disrupt the facility's electrical supply."
    }
  ]
}