{
  "FacilityID": 52831,
  "FacilityName": "Reddy Ice-Dallas (311)",
  "FacilityStr1": "4320 Duncanville Road",
  "FacilityStr2": null,
  "FacilityCity": "Dallas",
  "FacilityState": "TX",
  "FacilityZipCode": "75236",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.690113",
  "FacilityLongDecDegs": "-096.907277",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.reddyice.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Reddy Ice Corp",
  "Company2Name": null,
  "CompanyDUNS": 364514133,
  "Company2DUNS": 364514133,
  "OperatorName": "Reddy Ice Corp",
  "OperatorStr1": "8750 North Central Expressway",
  "OperatorStr2": "Suite 1800",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75231",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joey Tasher",
  "RMPTitle": "Plant Manager",
  "FTE": 60,
  "OtherEPAFacilityID": "75236RDDYC4320D",
  "EPAFacilityID": "100000177989",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Dallas 5-yr Resubmittal (10/23/08)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-04-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-10-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2008-10-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-10-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.69098,
  "FRS_Long": -96.90848,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 77032,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 52831,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 78883,
          "ProcessID": 77032,
          "NAICSCode": "312113",
          "_desc": {
            "NAICS_CODE": "312113",
            "NAICS_DESCRIPTION": "Ice Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 102166,
          "ProcessID": 77032,
          "ChemicalID": 56,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 602166,
          "ProcessID": 77032,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52831,
      "SummaryText": "PROCESS SUMMARY\nThe Reddy Ice-Dallas (311) facility manufactures packaged ice for wholesale/retail distribution. The facility has a production capacity of approximately 850 tons of ice per day and maintains approximately 36,000 pounds of anhydrous ammonia as a refrigerant for ice production and storage. The facility is a state-of-the-art plant constructed in 2002.\n\nThe refrigeration system is a standard closed-loop design with two distinct refrigeration loops, the high stage/icemaker system and the low stage/freezer system. The system has five screw compressors, four evaporative condensers, ten P-34A-XL-LOF Vogt ice machines, two recirculators, a thermosyphon vessel, a controlled pressure receiver vessel, nine evaporators and a water chiller. A Programmable Logic Controller (PLC) monitors the system and controls the system operation. In addition to the PLC, each of the compressors has numerous protective controls, (motor overload, high discharge temperature, high discharge pressure, low suction pressure, and low oil pressure) which will shut down the compressor if operating limits are exceeded. Pressure safety relief valves are installed on all pertinent equipment and are piped to discharge to a water-filled diffusion tank in the event of a release. \n\nThe facility has multiple safeguards pertinent to the anhydrous ammonia process. These include exhaust purge fans, controls that shut down the compressors if operating limits are exceeded, and the capability of shutting down the entire system remotely if required. An ammonia detection and alarm system is installed to notify employees in the event of an ammonia leak. Administrative controls are in place that limit the utilization of vessels to less than 20% to 30% of their maximum capacities.\n\nAnhydrous ammonia, when properly used, has proven to be a safe and reliable refrigerant. The sharp odor of ammonia provides its own warning agent. Practically all accidents involving anhydrous ammonia can be avoided through the fa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52831,
      "SummaryText": "cility?s program of proper employee training; knowledge of the equipment and procedures; and the development, maintenance, and implementation of effective operating and maintenance procedures for all ammonia equipment.\n\nThe company has developed an emergency response plan that includes procedures for notification of emergency authorities/agencies and the public, evacuation of personnel, and establishment, training, and outfitting of an emergency response and entry team for each shift.\n\nRISK MANAGEMENT PREVENTION PROGRAM 3\nBased on the Reddy Ice-Dallas facility?s ammonia inventory, location, and requirement to meet OSHA PSM standards, it has been determined the facility is subject to Accident Prevention Program 3 requirements. This accident prevention program is a way to make safe operations and accident prevention systematic throughout the facility. Reddy Ice Corporate Management and Reddy Ice-Dallas management are committed to operating a safe and compliant facility for the protection of its employees, the public, and the environment. A Combined Process Safety Management/Risk Management (PSM/RM) Program has been developed to meet the accidental release prevention requirements of EPA?s Risk Management Program (40 CFR Part 68) and OSHA?s Process Safety Management Standard (29 CFR 1910.119) under the Clean Air Act. The Combined PSM/RM Program contains thirteen elements, establishing requirements for employee participation, safety information, hazard analysis, pre-startup safety review, standard operating procedures, employee training, management of change, mechanical integrity/preventive maintenance, hot work permits, contractor qualification, release incident investigation, compliance audits, and trade secrets. These elements are tied together by a management system to ensure development, implementation and integration of the Program requirements.\n\nMANAGEMENT SYSTEM\nA management system has been developed to oversee the implementation of the PSM/RM Program elements. T"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52831,
      "SummaryText": "he plant manager has been identified as PSM/RM Program Coordinator, with overall responsibility for developing, implementing and integrating the Program requirements. Under the PSM/RM Program, various responsibilities have been assigned to other individuals. The plant engineer is responsible for portions of the program closely tied to the refrigeration equipment and operation. A safety committee with rotating membership meets each month to present a safety meeting and address any safety issues brought up by employees during the month.\n\nHAZARD ASSESSMENT\nAs required by the Risk Management Program regulations, the Reddy Ice-Dallas facility has conducted a hazard assessment including offsite consequence analyses (OCAs) for potential accidental releases of anhydrous ammonia. The OCAs describe the potential offsite exposure to surrounding areas from an accidental release. A worst-case release scenario and alternative release scenarios were calculated using the EPA RMP*Comp modeling program, and the potentially affected offsite population and facilities were identified. \n\nFIVE-YEAR ACCIDENT HISTORY\nThe Reddy Ice-Dallas facility has not had any releases that would require reporting as part of a five-year accident history.\n\nEMERGENCY PLANNING AND RESPONSE\nThe Reddy Ice-Dallas facility operates under an Emergency Response Plan (ERP) that includes procedures for: notifying the public and local emergency responders; emergency evacuation/response procedures; use of emergency alarms and equipment; employee training in evacuation and response procedures; annual training, medical exams, and equipment maintenance for inhouse responders; first aid for ammonia exposure; and periodic review and updating of the emergency response plan. Reddy refrigeration employees are HAZWOPER trained and equipped to assist with entry and equipment control in the event of an ammonia release at the facility if needed.\n\nIn addition, the facility has coordinated emergency response activities with the Dal"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52831,
      "SummaryText": "las County LEPC and the Dallas Fire Department, and has appropriate mechanisms in place to notify emergency responders if needed. The ammonia inventory is verified and reported annually to the state and local authorities, and the plant is incorporated into the community emergency response plan developed under 42USC.\n\nPLANNED CHANGES\nThe Reddy Ice-Dallas facility is a recently-constructed state-of-the-art plant. No significant changes are planned to the facility or operations. Reddy Ice facilities operate an ongoing program of preventive and predictive maintenance to identify and implement changes that may result in improved safety and operations."
    }
  ]
}