{
  "FacilityID": 52889,
  "FacilityName": "Columbus Foods, LLC.",
  "FacilityStr1": "3190 Corporate Place",
  "FacilityStr2": null,
  "FacilityCity": "Hayward",
  "FacilityState": "CA",
  "FacilityZipCode": "94545",
  "Facility4DigitZipExt": "3916",
  "FacilityCountyFIPS": "06001",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "37.624444",
  "FacilityLongDecDegs": "-122.111667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Columbus Foods, LLC.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Columbus Foods, LLC.",
  "OperatorStr1": "3190 Corporate Place",
  "OperatorStr2": null,
  "OperatorCity": "Hayward",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94545",
  "OperatorZipCodeExt": "3916",
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120736",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Meat Processing Facility",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-10-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-10-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-10-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2013-10-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 37.6249,
  "FRS_Long": -122.11169,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "51",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 77092,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 52889,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 102226,
          "ProcessID": 77092,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 78943,
          "ProcessID": 77092,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 45418,
              "Process_NAICS_ID": 78943,
              "SafetyReviewDate": "2008-06-26 00:00:00",
              "PHA_Date": "2007-05-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "sprinkler for fire",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "process conditions sensors, operator  Inspection",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-06-24 00:00:00",
              "TrainingReviewDate": "2008-06-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "drills and exercises",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-06-24 00:00:00",
              "EquipmentInspectionDate": "2008-06-24 00:00:00",
              "EquipmentTested": "enclosure, secondary containment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2008-06-24 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-06-24 00:00:00",
              "HotWorkPermitReviewDate": "2008-06-24 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 65940,
                  "PreventionProgram3ID": 45418,
                  "ProcessChemicalID": 102226
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 52889,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-06-24 00:00:00",
    "ERTrainingDate": "2008-06-24 00:00:00",
    "CoordinatingAgencyName": "City of Hayward Fire Department",
    "CoordinatingAgencyPhone": "5105834900",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Cal/OSHA[8 CCR 3220], Cal/OSHA PSM [8 CCR 5189], Cal/OSHA HAZWOPR[8 CCR 5192"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 52889,
      "SummaryText": "Executive Summary\n\nAccidental Release Prevention and Emergency Response Policies\nColumbus Foods, LLC (Columbus Foods) is committed to operating in a safe and environmentally sound manner and being a responsible member of the community by making safety information available to the community.  \n\nColumbus Foods Safety Policy states ¿Columbus Manufacturing is committed to providing and maintaining a safe and healthy workplace for all employees.  An Injury Illness Prevention Program (IIPP) has been implemented to help provide better workplace protection for employees and to reduce losses resulting from accidents and injuries.  While Eugene ¿Duffy¿ Raggio VP of Operations Development is ultimately responsible for safety, Al Garcia Plant Operations Manager, and Tom McLaughlin, Safety Manager have been given the authority and responsibility for the Health and Safety Program for Columbus Manufacturing.  \n\nColumbus Manufacturing has also created a Safety Steering Committee comprised of the Director of Manufacturing, Plant Operations Managers, Safety Manager, and Human Resources Personnel, as well as a Safety Committee to help insure the full implementation of the Company¿s Safety Program.  This committee is comprised of Managers, Supervisors, and Employees from many of the work areas at Columbus Manufacturing.\n\nEach Supervisor is responsible for the Safety of their employees.  Supervisors and Managers are also responsible for implementing and maintaining the IIPP in their work areas.  \n\nMonthly safety training is required for all employees¿.\n\nThe managers request and solicit any input from the work force to further this policy.  Persons may give direct information or anonymous communication.  The OSHA poster will be prominently displayed next to this statement.  ¿No person can have any reprisal taken against them for bringing these matters to the attention of the management.\n\nSafety is a top priority at Columbus Foods.  This is reflected in its proactive planning, state-of-t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 52889,
      "SummaryText": "he-art equipment, employee training, and coordination with the Hayward Fire Department (HFD) to prevent accidental releases from occurring and instituting controls to rapidly mitigate a release should it occur.\n\nFacility Description\nColumbus Foods owns and operates a meat processing/sausage manufacturing plant (NAICS Code 311612, SIC Code 2013) at 3190 Corporate Place, Hayward, California. The plant, occupying approximately 6.3 acres, is a state-of-the art facility constructed in 1991, which uses an ammonia refrigeration system. The plant's vapor compression refrigeration system contains approximately 12,000 pounds of anhydrous ammonia as a refrigerant. Columbus Foods acquired the plant in 2007 and has since made minor modifications to the refrigeration system.  The plant was previously owned and operated by Ito Cariani, Inc.  \n\nAccess to the manufacturing and office building is strictly controlled through locked doors and a security alarm system. The plant is located in the Eden Landing Industrial Park at the southeast corner of Corporate Avenue and Corporate Place.  The industrial park and surrounding area is used for light industrial manufacturing and commercial warehousing activities.  The Nimitz freeway (Highway 880) and the San Mateo Bridge are located approximately 1/2-mile from the facility.  The nearest body of water is the San Francisco Bay to the west.  Schools, hospitals and residences are located 1/4-mile to 1/2-mile east of the site.\n\nRegulated Substances and CalARP Program Levels\nThis Risk Management Plan (RMP) document has been prepared to satisfy Cal-ARP program requirements for the only covered process at the facility, the ammonia refrigeration system. At atmospheric temperatures and pressure, ammonia is a colorless gas with a sharp intensely irritating odor.  Depending on the concentration and duration of exposure, the health effects of ammonia gas can range from mild to severe irritation to the lining of the nose, eyes, throat and lungs.  Inhalat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 52889,
      "SummaryText": "ion of high concentrations may injure the lungs with potentially fatal results.  Due to its low odor threshold, ammonia has very good ¿warning properties¿ because its odor can be detected at a level about 200 times lower than the ERPG-3 level (Table 1).  The toxic end point defined by EPA is the ERPG-2 - used as a planning guideline to protect against offsite exposure - is 200 parts per million (ppm). The Cal/OSHA permissible exposure level for an 8-hour day is 25 ppm.\n\nThe refrigeration facility using anhydrous ammonia is potentially subject to the following regulations: \n¿\tFederal Risk Management Program (RMP) regulations (Title 40, Code of Federal Regulations, Part 68), also known as the federal Accidental Release Prevention Program. Ammonia threshold quantity (TQ) 10,000 pounds.\n¿\tCalifornia Accidental Release Prevention (CalARP) Program - Health & Safety Code, Davison 20, and California Code of Regulations (CCR) Title 19, Division 2. Ammonia TQ 100 pounds.\n¿\tOccupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) Standard (29 CFR, 1910.119). Ammonia TQ 10,000 pounds\nPlanning requirements for regulated substances are defined in a three-tier program (Programs 1 through 3) based upon:\n¿\tThe potential for off-site consequences associated with a worst-case accidental release.\n¿\tAccident history.\n¿\tApplicability of the OSHA PSM Standard. \nProgram 1 processes are those with no public receptors within the distance to the endpoint from a worst-case release and with no accidents with offsite consequences (deaths, injuries or requiring response or restoration activities for an environmental receptor) during the past five years.  Program 2 processes are those that are not eligible for Program 1 or subject to Program 3 requirements.  Processes ineligible for Program 1 and subject to OSHA PSM or California OSHA programs; or that are described by one of ten specified NAICS codes, are placed in Program 3. The CalARP requirements are most stringen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 52889,
      "SummaryText": "t for Program 3 processes and least stringent for Program 1 processes.  The Columbus Foods facility¿s 12,000 pounds of ammonia exceed the OSHA PSM TQ of 10,000 pounds.  Therefore the facility is subject to the CalARP Program 3 requirements. The local administering agency (AA) for the CalARP Program is the HFD.\n\nProcess Description\nThis facility's primary refrigeration equipment consists of packaged plant components housed in a mechanical room.  The ancillary equipment includes piping, valves and evaporators located in drying rooms and storage rooms throughout the plant. The two-stage system is used to refrigerate several operations and areas at the plant.  Details of the mechanical compression refrigeration process are provided in the process flow diagrams (Appendix A) and in the main text of the report. The equipment includes a high pressure receiver, a low pressure receiver, five refrigeration compressors, an evaporative condenser, pumps, vessels, piping, control valves, pressure relief valves, regulators, control instrumentation, microprocessor-controller and alarms.  The condenser is located outside the building for heat rejection to the atmosphere. Part of the rejected heat is reclaimed through heat exchange with domestic hot water through a double-pipe heat exchanger (ammonia in inner pipe, water in outer pipe) located on the roof. The approximately 4,000-gallon high-pressure receiver is located outside the building on the southeast side (Figure 2).  Two 18,500-gallon emergency dump tanks with an ammonia diffuser system are located on the south side of the building.\n\nEngineering and Administrative Controls to Prevent Accidental Releases\nVarious engineering and administrative controls are in place to prevent accidental releases of ammonia.  The process can be manually shutdown using emergency switches located in the control room, compressor room and the front lobby.  The engineered and administrative controls include the following as described here and in Appen"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 52889,
      "SummaryText": "dix C:\n1.\tEarthquake/seismic protection and structural bracing designed to account for a credible seismic event:  Mechanical equipment including pressure vessels and piping inside the facility will be anchored as required by the uniform Building Code (UBC) for Seismic Zone 4.  Bracing installed in 1990-1991 was designed to UBC 1988.\n2.\tVapor/Gas Suppression and Containment:  The mechanical room has self-closing, tight fitting doors that open outward.  There are no openings from the mechanical room that will allow ammonia to escape to other parts of the building.  The exhaust system fans can be activated from emergency switches located inside and outside the mechanical room.  Exhaust has been provided for the mechanical room separately, therefore, should a leak occur ammonia will be restricted to the mechanical room preventing entry to the rest of the building.\n3.\tOver or Under Pressure Controls:  If high pressure occurs a relief valve opens and ammonia is released at a predetermined safe rate (depending on device and vessel) until the pressure drops below the set point of the relief valve; the valve then reseals.\n4.\tOver or Under Temperature:  High temperature will result in high pressure within the system.  Relief valves will then release the overpressure (see Over or Under Pressure Controls).  \n5.\tGas or Vapor Detection:  An automatic ammonia leak detection and alarm system provides continuous gas/vapor monitoring capability.  A total of fifteen ammonia detectors are installed monitoring all rooms containing refrigeration evaporators (see Figure 2 for locations).  In the event of a leak audible and visual alarms are actuated when ammonia concentration reaches 30 ppm to alert plant personnel and the security company. The purpose is to rapidly detect an ammonia release and take immediate corrective action such as shutdown, affected area/equipment isolation and repair and if necessary, evacuation.\n6.\tAutomatic shutdown will occur in response to a rupture in a safety"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 52889,
      "SummaryText": "valve.  High pressure in a refrigeration vessel will cause the safety valve to release enough ammonia to drop the pressure below the valve setting.  The valve will then close stopping ammonia discharge.\n7.\tComputerized monitors and control devices will prevent releases.  The refrigeration system is controlled by an electronic control system connected via modem to a computer.  The control system can shut down any system component or the entire system should temperature and/or pressure exceed system design.  A system malfunction will also be announced and displayed on the computer system to the plant operator.\n8.\tElectrical failure will result in the refrigeration system shutting down.  Emergency power is available to power the exhaust ventilation system for the mechanical room and the ammonia leak detection and alarm system.\n9.\tFire in the facility will result in the immediate initiation of the emergency dump procedures for the ammonia refrigerant.  This will promptly and safely reduce refrigerant system pressure.  A fire extinguishing system has been installed in the plant according to UBC, UFC, and NFPA requirements.  In addition, fire extinguishers are located throughout the facility.\n10.\tTreatment of dumped ammonia is accomplished by the emergency dump system to capture discharged ammonia and sufficiently dilute the effluent prior to discharge to the sanitary sewer.\n11.\tDelivery systems are designed to minimize releases.  Delivery of ammonia to the plant will be by truck to the receiver vessel only.  No internal or portable tanks will be located within the facility.  Pipes and connections are to be welded and installed in accordance with UBC, UMC and ASME standards.  Local gas shut-off valves will be at the high pressure receiver and at all equipment connections to allow for periodic maintenance, repair and isolation in the event of a problem or emergency.  Solenoid shut-off valves are placed at the main refrigerant supply line from the high pressure receiver to"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 52889,
      "SummaryText": "the mechanical room to assure effective isolation. Operators can isolate receiver vessels, pumps and compressors in case of a release\n12.\tRegular preventive maintenance of refrigeration system components is performed to keep the equipment in top working order.\n13.\tAmmonia pipelines and high and low pressure systems are color coded and labeled to prevent mistakes such as opening the wrong valve.\n14.\tInventory Control: Ammonia will only be added to the system when required.  After initial charging this may be annual but recharging is not anticipated for two to three years.  Inventory control is provided by a gage at the high-pressure receiver.  This will be the only place that ammonia can be introduced into the system and it will be monitored by operators and the delivery truck operator when charging and recharging operations occur.\n15.\tOver or under filling is possible during charging or recharging of any chemical handling system.  However, this system will be refilled no more than annually, system charging and refilling will be done under the direct supervision of the plant manager/engineer and system vendor.  The ammonia system inventory will be strictly managed and vendor safety procedures will be followed.\n\nOffsite Consequence Analysis\nColumbus Foods performed its OCA using EPA¿s RMP Comp® software. The models incorporate a number of assumptions and estimate toxic endpoint distances (distance at which ammonia concentration in air is 200 parts per million by volume) for each scenario - Worst-Case Release scenario (WCS) and Alternate Release Scenario (ARS) given ambient conditions and the assumed mass of the release.  \n\nWorst-Case Scenario\nThe worst-case scenario is the EPA-mandated assumption that the entire 12,000 pounds of ammonia in the plant will be released to the atmosphere in just 10 minutes (a highly unlikely event). This scenario is the WCS as defined in the CalARP regulation sections 2750.3 (a)(2)(A) and (c)(1). For the WCS, a catastrophic rupture of the"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 52889,
      "SummaryText": "high-pressure ammonia tank located at the North East corner of the plant (Figure 2) was considered.\nThe results for the WCS were generated using the EPA's RMP Comp® software.  The release results assumed the following conditions for a WCS:\n\n¿\tNeutrally buoyant gas.\n¿\tTen-minute release at the rate of 1,200 pounds per minute.\n¿\tUrban topography.\n¿\tF stability class.\n¿\tWind speed of 1.5 meters per second.\n\nModeling parameters are shown in Table 2 and results of the worst-case analysis are presented below.\n¿\tUsing RMP Comp® with the worst-case meteorological conditions, the end point distance is estimated at approximately 1.2 miles from the facility (see RMP Comp® output in Appendix D).  The affected area is represented as a circle of radius 1.2 miles (Figure 3).\n¿\tUsing 2000 census data from Land View 6, the estimated residential population within the worst-case radius is approximately 12,500.\n¿\tAccording to Land View 6 census data, seven schools and one hospital are located within the worst-case circle at distances between 1/4-mile to 1.2-mile from the facility (Figure 3).  However upon checking with the Hayward Unified School District only six of the schools were found to exist. A list of these public receptors is presented as Table 3. Environmental receptors include the Don Edwards San Francisco Bay National Wildlife Refuge (Land View 6).\n\nAlternative Release Scenario\n\tThe ARS for the ammonia refrigeration system is a release of ammonia to the atmosphere from operation of a relief valve or rupture disk failure on the high-pressure receiver.  It was estimated that approximately 10 percent of the charge would be lost (RMPP 1991) based on relief valves sized to code requirements.  However, to be conservative, it was assumed that 25 percent of the ammonia charge (3,000 pounds) would be released at a rate of 53.3 pounds per minute (relief valve capacity).  \n\t\n\tThe results for the ARS were also generated using the EPA's RMP Comp®. The release results assumed the followi"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 52889,
      "SummaryText": "ng conditions for the ARS: \n¿\tNeutrally buoyant gas.\n¿\t57-minute release.\n¿\tUrban topography.\n¿\tD stability class.\n¿\tWind speed of 3.0 meters per second.\n\n\tModeling parameters are shown in Table 2 and the modeling results are as follows.\n¿\tUsing RMP Comp, the Endpoint distance is estimated at approximately 0.1 miles (see RMP-comp output in Appendix D) or about 500 feet from a release. The affected area is represented as a circle of radius 500 feet (Figure 4).\n¿\tUsing Land View 6, 2000 census data, no public receptors such as schools or hospitals were identified.  The residential population within a 500-foot circle was estimated at 0.  \n\nMitigating measures will act to limit the calculated distances for the WCS and ACS, although to be conservative no credit for mitigating measures was taken. Tall buildings, piping racks and surrounding equipment will act as a barrier and tend to passively mitigate the release should it occur.  For the ACS active mitigation measures such as pumping down the system would also limit and mitigate the release.\n\nThe General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nColumbus Foods has developed a formal management system to plan, organize, implement and control the risk management program elements.  This management system satisfies the requirements of Section 2735.6 of the CalARP regulation - and ensures that the risk management program elements will be developed and continually improved.  \n\nChemical specific prevention programs described in this RMP include an updated PHA, an updated OCA and a Prevention Program including all required prevention program elements (Program Level 3).  These elements include the following: Management System, Chemical-Specific Prevention Steps, Process Safety Information, PHA, Operating Procedures, Training, Mechanical Integrity, Management of Change, Compliance Audits, Incident Investigation, Employee Participation, Hot Work Permit, and Contractor Safety.  \n\nThe Five-Year Acc"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 52889,
      "SummaryText": "ident History\nColumbus Foods compiled a five-year accident history for all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  The compilation of this information satisfies the requirements of Section 2750.9 of the CalARP regulation. An estimated 20 pounds of ammonia were released on April 7, 2008 due to the operation of a relief valve.  The incident was reported to the HFD and the USEPA.  However, this release did not cause any offsite consequences as defined in the USEPA or CalARP regulations (evacuation, emergency response, injury or death).  The plant has not had any incidents that affected offsite receptors in the last 5 years.\n\nThe Emergency Response Program\nColumbus Foods has an Emergency Response Plan (ERP) that allows it to respond to any emergency.  The facility maintains a cooperative relationship with the HFD and relies upon the HFD for response to fires or hazardous materials emergencies. Plant personnel are trained in emergency evacuation. Designated employees will coordinate their efforts with the fire department, security company and ammonia plant vendors as necessary. Columbus Foods works closely with the HFD to prevent ammonia release or fires from occurring and to quickly mitigate either type of emergency.  Emergency evacuation drills will be conducted involving plant personnel and the HFD.  Mr. Hugh Murphy at (510) 583-4924 is Columbus Foods point of contact at the HFD.\n\nThe facility has a number of built in safeguards to prevent ammonia releases.  In the case of an ammonia release (concentration of 30 parts per million-ammonia) from inside the plant the following would occur:\n¿\tAmmonia sensors from the network located throughout the plant would detect the release.  Audible and visual alarms would alert plant personnel, and the security company. \n¿\tTrained employees will"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 52889,
      "SummaryText": "initiate pump-down procedures. Ammonia will be pumped into the high-pressure receiver outside the building. The King valve and solenoid valves located on the refrigerant liquid supply lines would shut off, isolating the high pressure receiver and keeping ammonia from flowing into the plant.\n¿\tRefrigerant liquid supply pumps to the entire plant would shut off, stopping flow of ammonia to the plant and the compressors.\n\nThe alarm panel is placed in the front lobby, with emergency shutdown switches and alarm locations clearly marked.  Trained employees are aware and can initiate manual shutdown or ammonia dump procedures with push buttons located on the front panel.  A first responder (HFD) also has the ability to shut down the ammonia plant or initiate an emergency dump from the front panel.  These procedures can also be initiated from the compressor room or the control room.  In the event of a fire all personnel will follow the ERP and evacuate the area.  Fire in the facility will activate the sprinkler system and automatically initiate the emergency dump procedure for ammonia.  Properly trained employees can respond to incipient fires requiring one fire extinguisher after notifying the fire department.\n\nPlanned Changes to Improve Safety\nPlanned changes to improve safety were developed as a result of conducting the PHA.  ----- action items meeting the selection criteria were identified.  All these action items are in progress and scheduled for completion by their assigned due date."
    }
  ]
}