{
  "FacilityID": 53124,
  "FacilityName": "TVA Colbert Fossil Plant",
  "FacilityStr1": "900 Colbert Steam Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Tuscumbia",
  "FacilityState": "AL",
  "FacilityZipCode": "35674",
  "Facility4DigitZipExt": "6906",
  "FacilityCountyFIPS": "01033",
  "LEPC": "Colbert County Ems",
  "FacilityLatDecDegs": "34.742330",
  "FacilityLongDecDegs": "-087.849900",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.tva.gov",
  "FacilityEmailAddress": "tvainfo@tva.gov",
  "FacilityDUNS": null,
  "ParentCompanyName": "Tennessee Valley Authority",
  "Company2Name": null,
  "CompanyDUNS": 1883032,
  "Company2DUNS": null,
  "OperatorName": "David H. Schavey",
  "OperatorStr1": "900 Colbert Steam Plant Road",
  "OperatorStr2": null,
  "OperatorCity": "Tuscumbia",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35674",
  "OperatorZipCodeExt": "6906",
  "FTE": 500,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184588",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "701-0100-Z009",
  "SafetyInspectionDate": "2006-07-18 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2008-12-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2008-12-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2008-12-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-11-19 00:00:00",
  "DeRegistrationEffectiveDate": "2013-11-15 00:00:00",
  "AnniversaryDate": "2013-12-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.7415,
  "FRS_Long": -87.84796,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 77441,
      "AltID": "Anhydrous Ammonia System",
      "FacilityID": 53124,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 102888,
          "ProcessID": 77441,
          "ChemicalID": 56,
          "Quantity": 161910.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 79306,
          "ProcessID": 77441,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 45649,
              "Process_NAICS_ID": 79306,
              "SafetyReviewDate": "2003-12-15 00:00:00",
              "PHA_Date": "2008-12-02 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-05-02 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Catchment Basin",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Remote video camera surveillance",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "isolation valves",
              "OpProceduresReviewDate": "2008-10-01 00:00:00",
              "TrainingReviewDate": "2003-11-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-06-01 00:00:00",
              "EquipmentInspectionDate": "2008-12-01 00:00:00",
              "EquipmentTested": "Tank, pumps, compressors, piping, valves, vaporizer, instrumentation",
              "ChangeMgmtDate": "2008-04-08 00:00:00",
              "ChangeMgmtReviewDate": "2008-05-12 00:00:00",
              "PreStartupReviewDate": "2003-11-26 00:00:00",
              "ComplianceAuditDate": "2006-10-20 00:00:00",
              "AuditCompletionDate": "2007-04-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2003-11-26 00:00:00",
              "HotWorkPermitReviewDate": "2003-11-26 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2003-11-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 66373,
                  "PreventionProgram3ID": 45649,
                  "ProcessChemicalID": 102888
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 53124,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2007-08-27 00:00:00",
    "ERTrainingDate": "2008-04-25 00:00:00",
    "CoordinatingAgencyName": "Colbert County Emergency Mgt",
    "CoordinatingAgencyPhone": "2563868558",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 53124,
      "SummaryText": "review was conducted prior to the startup of the new process.  Established pre-startup safety review procedures assured that construction and installation of covered process equipment, operating and maintenance procedures are suitable for a safe startup prior to placing equipment into operation and all elements of the RMP are in place.\n\nCompliance Audits ¿ TVA conducts environmental and safety audits on a regular basis and will determine whether the provisions set out under the RMP rule are being\nimplemented.  The audits will be conducted at least every 3 years and any corrective actions required as a result of the audits will be promptly and safely implemented.\n\nIncident Investigations ¿ Any incident that results in or could reasonably result in a significant release of a regulated substance is promptly investigated.  Procedures\nensure that investigations are undertaken to identify the circumstances leading to the incident as well as any corrective actions to prevent the situation surrounding the\nrelease does not reoccur.  All reports will be retained for at least 5 years.\n\nEmployee Participation ¿ TVA believes in a team approach to process safety management and accident prevention.  Employees are encouraged to express their views\nconcerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information developed through implementation of\nthe RMP, including information resulting from process hazard analyses.\n\nContractors ¿ TVA develops partnerships with contractors to effectively conduct business and operate generation facilities, especially in maintenance and construction\nactivities.  Prior to selecting a contractor, TVA evaluates the qualifications of the contractor including their safety performance.  Procedures are in place to ensure that contractors are properly informed of known potential hazards related to the contractor¿s work and the process involved, including the emergency response procedures in the e"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 53124,
      "SummaryText": "I.  Accidental Release Prevention and Emergency Policies\n\nEnvironmental protection and enhancement are essential elements of TVA¿s integrated resource management mission.  TVA exhibits progressive environmental leadership\nin managing its unified river and power system for multiple public benefits, including the production of reliable, competitively priced power.  TVA is committed to setting the\nstandard for environmental excellence among utilities and federal agencies, and to making the Tennessee Valley a model in sustainable energy, resource, and economic\ndevelopment and management.  TVA assures that employees are aware of their environmental responsibilities; use effective environmental processes, and are held accountable\nfor performance.\n\nTVA management and employees will be responsible for maintaining compliance with environmental requirements and striving for environmental excellence in performing\ntheir respective duties.  We will assure environmental protection and reduce risks to our employees and communities in which we operate through proper environmental\nreview of new developments and through safe technologies, operating procedures, and emergency preparedness.  All activities will be conducted in accordance with current\nenvironmental and health and safety regulatory requirements.\n\nII.  Stationary Source and Regulated Substances Handled\n\nThe affected facility consists of an anhydrous ammonia storage facility including two 18,000 gallon storage tanks with supporting unloading equipment, liquid transfer\npumps, piping to convey the liquid ammonia, vaporizers to convert ammonia from a liquid to a vapor, an ammonia vapor transport line, and a gas dilution and injection\nsystem to inject ammonia into a flue gas conditioning system.\n\nThere is only one regulated substance at the facility ¿ anhydrous ammonia.  With two 18,000 gallon storage tanks, the maximum amount of anhydrous ammonia in the\nstorage facility at any time is 162,000 pounds and the maximum amount cont"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 53124,
      "SummaryText": "vent of an accidental release of a regulated substance.\n\nV.  Five Year Accident History\n\nThere have been no accidents since the anhydrous ammonia system was put into operation five years ago.\n\nVI.  Emergency Response Plan\n\nTVA has an emergency response plan in place to respond to accidental releases of hazardous materials.  The plan includes all aspects of emergency response plan\nrequirements including adequate first aid and medical treatment, safe shelter-in-place locations, notification of local emergency response agencies and the public, and\nqualified contractor responder for post-incident decontamination of affected areas.  The plan will be promptly updated to address any pertinent changes within the process that would require a modification of the emergency response plan.  In addition, periodic emergency response drills are conducted to keep employees, contractors, and local responders familiar with the plan.\n\nVII.  Five Year Update\n\nIn accordance with the requirements of 40 CFR Part 68, Risk Management Plans for all TVA facilities are reviewed in detail prior to the five-year anniversary of the\noriginal submission of the RMPs.  An audit was conducted December 1 and 2, 2008 for the purpose of of revalidating the Colbert Fossil Plant RMP.  Many of the dates\nprovided in this submittal, referring to the most recent review of various parts of the RMP program, coincide with this audit."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53124,
      "SummaryText": "ained in the largest single vessel is 81,000 pounds.\n\nIII.  Summary of Worst Case and Alternative Release Scenarios\n\nThe Worse Case Release Scenario and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distance to the end\npoint for each reported scenario, were developed.  To perform the required offsite consequence analysis for the facility, the very conservative EPA RMP*Comp model\nwas used.\n\nThe worst case release scenario involves the complete rupture of one 18,000 gallon storage tank.  A maximum release of 81,000 pounds of anhydrous ammonia over a\n10 minute period was considered.  The released quantity has not been limited by a system of administrative controls.  Under worst case meteorological conditions of\nClass F stability and 1.5 m/s wind speed, the ammonia vapor would have offsite end point concentrations impacting populated areas.\n\nThe alternative case release scenario with the worst credible case offsite impact involves the release of 17,000 pounds of liquid ammonia loss from the failure of a\n3-inch fitting or from ruptured liquid piping.  Under typical meteorological conditions of Class D stability and 3 m/s wind speed, the ammonia vapor would have offsite\ntoxic end point levels.\n\nIV.  Description of Release Prevention Program\n\nProcess Safety Information ¿ TVA maintains documentation of safety information concerning chemical hazards, operating parameters, and equipment designs and\nspecifications associated with the process.\n\nProcess Hazard Analysis ¿ TVA conducted comprehensive analyses of the process to ensure that hazards associated with the process were identified and controlled\neffectively.  The Hazardous and Operability Study (HAZOP) analysis methodology was used to assess the potential hazards of the process.  The study was conducted\nby a team of qualified personnel with expertise in engineering, control logics, and process operations.  Findings resulting from the analysis were addressed.  T"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53124,
      "SummaryText": "he HAZOP\nanalysis was conducted on June 3-6, 2003 and a pre-startup HAZOP review was conducted on November 24, 2003.\n\nOperating Procedures ¿ TVA has established and maintained procedures for safely conducting activities within our covered process.  The procedures cover various\noperational phase including initial startup, normal startup, normal shutdown, temporary operations, emergency shutdown, emergency operations, and startup following a\nturnaround or emergency shutdown.  The information is readily available to operators and maintenance personnel involved in the process and the information is periodically\nreviewed to assure it is current.\n\nTraining ¿ TVA¿s training program is comprehensive and is implemented to ensure that all personnel involved in the operation and maintenance of the process are\nproperly trained in the safe operation and maintenance of the process and knowledgeable of the hazards of the process.  The personnel are provided with refresher\ntraining at least every three years or more often if needed.\n\nMechanical Integrity ¿ TVA conducts well documented maintenance checks on process equipment to ensure safe and reliable operations.  All process equipment\nroutinely checked includes storage tanks and pressure vessels, piping systems, relief and venting systems, controls and pumps, emergency shutdown systems, and\nmonitoring devices.  All maintenance operations conducted on the covered process are performed by qualified personnel who have had proper training.  Equipment\ndeficiencies identified by the maintenance checks are corrected promptly and safely.\n\nManagement of Change ¿ TVA maintains written procedures to manage changes in the process equipment, procedures and monitoring technology which assures that\nany changes meet regulatory requirements.  Personnel whose job tasks are affected by a modification in the process are promptly apprised of the modification and\nprovided training to address the modification.\n\nPre-Startup Review ¿ A pre-startup safety"
    }
  ]
}