{
  "FacilityID": 53506,
  "FacilityName": "Food Lion Distribution Center # 2",
  "FacilityStr1": "6500 Enterprise Drive",
  "FacilityStr2": null,
  "FacilityCity": "Disputanta",
  "FacilityState": "VA",
  "FacilityZipCode": "23842",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51149",
  "LEPC": "Prince George County LEPC",
  "FacilityLatDecDegs": "37.161861",
  "FacilityLongDecDegs": "-077.284389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A3",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3448560,
  "ParentCompanyName": "Food Lion, LLC",
  "Company2Name": "Delhaize America, Inc.",
  "CompanyDUNS": 90322194,
  "Company2DUNS": 90322194,
  "OperatorName": "Food Lion, LLC",
  "OperatorStr1": "2110 Executive Drive",
  "OperatorStr2": null,
  "OperatorCity": "Salisbury",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28147",
  "OperatorZipCodeExt": null,
  "FTE": 225,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000183883",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-10-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Dispuntanta 2008",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-02-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-01-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-01-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-01-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.16066,
  "FRS_Long": -77.28556,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "150",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 77971,
      "AltID": "Refrigeration",
      "FacilityID": 53506,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 103833,
          "ProcessID": 77971,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 79848,
          "ProcessID": 77971,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 45951,
              "Process_NAICS_ID": 79848,
              "SafetyReviewDate": "2008-10-07 00:00:00",
              "PHA_Date": "2008-10-07 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-11-03 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-12-01 00:00:00",
              "TrainingReviewDate": "2008-10-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-09-17 00:00:00",
              "EquipmentInspectionDate": "2008-12-02 00:00:00",
              "EquipmentTested": "Full Refrigeration System",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2008-10-07 00:00:00",
              "PreStartupReviewDate": "2008-01-10 00:00:00",
              "ComplianceAuditDate": "2008-09-17 00:00:00",
              "AuditCompletionDate": "2008-09-17 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-12-01 00:00:00",
              "HotWorkPermitReviewDate": "2010-12-01 00:00:00",
              "ContractorSafetyReviewDate": "2010-12-01 00:00:00",
              "ContractorSafetyEvalDate": "2010-12-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "As a vital element of the facility?s prevention program, Food Lion Distribution Center # 2 inaugurated a Process Safety Management Program as mandated by OSHA Standard 29 CFR 1910.119 (Process Safety Management).  Food Lion Distribution Center # 2 has also implemented strict preventive maintenance procedures and an Emergency Action & Response Plan (ERP).  Release of ammonia is specially covered in the Emergency Action & Response Plan and contains all required actions in the event of release of ammonia.  As part of the facility's accidental release prevention, training is conducted for employees and new hires.  Accidental release prevention, training and awareness are reinforced annually and as operations at thefacility dictates.",
              "_chemicals": [
                {
                  "PrimaryKey": 67038,
                  "PreventionProgram3ID": 45951,
                  "ProcessChemicalID": 103833
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 53506,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2008-10-07 00:00:00",
    "ERTrainingDate": "2008-09-17 00:00:00",
    "CoordinatingAgencyName": "Prince George County, VA (LEPC)",
    "CoordinatingAgencyPhone": "8047332609",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53506,
      "SummaryText": "\n\n\n\n\n\n\n\n\n\n\nHazard Assessment\nof the\n Ammonia Refrigeration System\nat the\nFood Lion DC 20\nDisputanta, VA \nFacility\n\n\n\n\n\nPrepared for:\n\nFood Lion\n\n\n\n\nPrepared by:\n\nLarry Aleksandrich\n\n\n \n\n1.0    MANAGEMENT SUMMARY\n\nThis report describes the results of a hazard assessment conducted to analyze the  ammonia refrigeration system located at the FOOD LION  facility (DC20) in Disputanta, Virginia.  The purpose of the hazard assessment was to evaluate the impact of significant accidental releases on the public health and the environment, and to develop of history of such releases.  The hazard assessment was conducted in accordance with the requirements of the EPA's Risk Management Program (RM program), 40 CFR Part 68 (subpart (B), Hazard Assessment).\n\nMr. Larry Aleksandrich was the project manager for the hazard assessment.  \n\nMr. Chuck Rohda coordinated the hazard assessment for FOOD LION. \n\nThe worst-case release scenario for toxic materials at the Disputanta Plant involves the release of 14,000 pounds of anhydrous ammonia over a 10 minute period due to the failure of the receiver in the Engine Room.  \n\nUnder worst-case conditions, an ammonia cloud could travel 1.0 miles before being diluted below 200 ppm.\n\nThe alternative release scenario for toxic materials at the Disputanta Plant involves the release of 865 pounds of ammonia over a 15 minute period due to the release of ammonia from a pressure relief valve.  \n\nUnder alternative release conditions, ammonia could travel 0.2 miles being diluted below 200 ppm.\n\nThe worst-case and alternative release scenarios for toxic materials are unlikely for the following reasons:\n\nA?    The weather conditions that were used for the worst-case release scenario do not occur, while those used for the alternative case are uncommon;\nA?    Industry standards are followed for the design and manufacture of the equipment in the ammonia refrigeration system;\nA?    The engine room contains ammonia detectors and ventilation fans that should detect and mitigate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53506,
      "SummaryText": " the effects of any ammonia releases;\nA?    Ammonia is not corrosive in this service; \nA?    The facility has a preventive maintenance program in place to maintain the on-going integrity of the ammonia refrigeration equipment;\nA?    The facility has a training program designed to ensure that the system is operated by qualified personnel; and,\nA?    The facility emergency response procedures that enable trained personnel to respond quickly to isolate any potential releases.\n\nNo ammonia-related accidents that resulted in significant on-site or offsite consequences were identified for the Disputanta Plant in the previous five years. \n\nTherefore no accidents will be included in the five-year accident history prepared as part of the Risk Management Plan (RMP).\n \n2.0    INTRODUCTION\n\nFOOD LION  operates an ammonia refrigeration system at its food distribution facility located in Disputanta, Virginia.  The ammonia refrigeration system is subject to the Program 3 requirements of the EPA's RM program because there is more than 10,000# on site. \n\nThis report describes the results of a hazard assessment conducted to analyze the ammonia located at the Disputanta plant.  The purpose of the hazard assessment was to evaluate the impact of significant accidental releases on the public health and the environment, and to develop of history of such releases.  The scope of this report is limited to the equipment and procedures associated with the ammonia refrigeration system at the Disputanta, Virginia.  The hazard assessment did not address the hazards of shipping ammonia to this site.  The scope of this report was further limited to a review of the worst-case and alternative case release scenarios.  The procedures used to identify these scenarios are discussed in the following sections.\n\nLarry Aleksandrich has expended his best professional efforts in performing this work.  However, it should be noted that this report describes a joint work effort between Larry Aleksandrich and FOOD LION  personnel"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53506,
      "SummaryText": " using information on the Disputanta Plant provided by FOOD LION  and their personnel. \n\n\n\n\n\n\n\n\n3.0    HAZARD ASSESSMENT PROCEDURES: AMMONIA\n\nThe procedures used to conduct the ammonia hazard assessment are outlined by the following major steps:\n\n1.    Define the Hazard Assessment Requirements\n2.    Define the Worst-Case Release Scenario\n3.    Determine the Release Rate for the Worst-Case Release Scenario\n4.    Define the Alternative Release Scenario\n5.    Determine the Release Rate for the Alternative Release Scenario\n6.    Estimate the Distance to the Endpoint for the Release Scenarios\n7.    Define the Offsite Impacts for the Release Scenarios\n\nProcedures for each of these steps are provided.\n\n3.1    Define the Hazard Assessment Requirements\n\nAmmonia is the only toxic substance at the Disputanta Plant that is subject to the requirements of the EPA's RM program.  Plants that handle regulated toxic substances must analyze:\nA?    One worst-case release scenario for the toxic substance that results in the greatest distance in any direction above the toxic endpoint.\n\nA?    Additional worst-case release scenarios if other release scenarios could affect different public receptors. \n\nA?    At least one alternative release scenario for each toxic substance in covered processes.\n\n3.2    Define the Worst-Case Release Scenario\n\nThe worst-case toxic release scenario is defined as the release of the largest quantity of a toxic material from a vessel or process line failure that results in the greatest distance to an endpoint.\n\nThe largest single vessel or process line containing a RM Program listed toxic material at the Disputanta plant is the ammonia receiver located in the Engine Room.  The worst-case toxic release scenario involves a release from the receiver.\n\nThere were no additional worst-case toxic release scenarios identified that could affect receptors different from those potentially affected by a release from the receiver.  Therefore, only one worst-case toxic release scenario was analyzed.\n\n3.3    Determine"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53506,
      "SummaryText": " the Release Rate for the Worst-Case Release Scenario\n\nThe worst-case scenario can take into account administrative controls that are in place to limit the maximum quantity of the toxic substance in the vessel or pipe.  Administrative controls are defined in the regulations as \"written procedural mechanisms used for hazard control.\"\n\nThe ammonia system contains a maximum ammonia inventory of 14,000 pounds. \n\nWe next determined whether any passive mitigation systems can be considered during the worst-case scenario analysis.  Passive mitigation is defined in the regulations as \"equipment, devices, or technologies that function without human, mechanical, or other energy input.\"  Passive mitigation systems must be able to withstand the physical effects of the worst-case accident scenario if they are to be considered.\n\nThe compressor room was considered as passive mitigation during the worst-case analysis of the ammonia receiver.\n\nSince the worst-case toxic release scenario involves the release of liquid under pressure (from a vessel or pipe above 0 psig), we assumed that the total amount of material was released as a gas over a period of 10 minutes.  The release rate, in pounds per minute, is the total mass released (in pounds) divided by 10 (minutes).\n\nFor a worst-case toxic release scenario involving the ammonia high pressure receiver, the total release rate is 1,400 pounds of gas per minute (14,000 pounds over a 10 minute period).\n\n3.4    Define the Alternative Release Scenario\n\nAlternative release scenarios represent scenarios that are more realistic than the worst-case scenarios.  These scenarios should be considered in the facility's emergency response plan.  At least one alternative release scenario must be analyzed for each toxic substance handled in a covered process.  The release involved must be large enough to exceed the toxic endpoint offsite, unless no such scenario exists.\n\nIn order to identify the alternative release scenario, we reviewed the facility accid"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 53506,
      "SummaryText": "ent history (including near-misses), considered accident scenarios identified in the hazard analyses of the ammonia refrigeration system, and reviewed guidance prepared by the EPA (Risk Management Program Guidance for Ammonia Refrigeration (40 CFR Part 68)).\n\n\nOne alternative toxic release scenario was identified for the Disputanta Plant: an ammonia release from a pressure relief valve on the receiver.\n\n3.5    Determine the Release Rate for the Alternative Release Scenario\n\nThe mass release rate was calculated for the alternative release scenario using the material properties (e.g., pressure and temperature) and the assumed leak .\n\nThe unmitigated mass release rate from the pressure relief valve was estimated to be 57.7 pounds per minute.  \n\nWe next determined whether any administrative controls, passive mitigation systems, or active mitigation systems could be considered during the alternative toxic release scenario analysis.  Definitions and examples of administrative controls and passive mitigation systems are provided in Section 4.3.  Active mitigation systems are defined in the regulations as \"equipment, device, or technologies that need human, mechanical, or other energy input to function.\"\n\nAdministrative controls such as inventory control, passive mitigation systems such as the building in which the engine room exists, and active detection systems such as ammonia sensors with alarms were considered during the analysis of the alternative toxic release scenario.\n\nThe duration of the release was estimated for the alternative release scenario by estimating the amount of time required for the relief valve to close.\n\nThe amount of time for the pressure relief valve to stop relieving associated with the alternative toxic release scenario was estimated to be 15 minutes for the Disputanta Plant.\n\n3.6    Estimate the Distance to the Endpoint for the Release Scenarios\n\nThis section describes the method that was used to estimate the distance to the toxic endpoint for the wors"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 53506,
      "SummaryText": "t-case and alternative toxic release scenarios.  The distances to the toxic endpoint depended on the parameters that are described below.  Values for these parameters were chosen based on the guidelines provided in this section and in 40 CFR 68.22.\n\nA?    Toxic Endpoint\n\nThe EPA has established endpoints for the purpose of determining the distance over which releases could pose hazards to the public or the environment.  For toxic substances they are in the form of minimum concentration levels for each substance and are listed in an appendix to the RM Program regulations.\n\nToxic substance endpoints are based on the American Industrial Hygiene Association's (AIHA's) Emergency Response Planning Guideline - 2 (ERPG-2).  ERPG-2 values represent the maximum airborne concentration that AIHA believes nearly all individuals could be exposed for up to an hour without experiencing or developing irreversible or other serious human health effects or symptoms that could impair their ability to take protective action. \n\n The ERPG-2 for anhydrous ammonia is presently 200 ppm (0.24 mg/L). This endpoint was used for the analysis of the worst-case and the alternative toxic release scenarios.\n\nA?    Wind Speed/Atmospheric Stability Class\n\nWind speed is an estimate of how fast the wind is traveling.  The wind speed may be expressed in miles per hour (mph), meters per second (m/s), or knots.\n\nAtmospheric stability class is a general indication of the degree of mixing present in the atmosphere.  It is a function of wind speed and solar radiation.  Stability class \"A\" represents extremely unstable atmospheric conditions with a high mixing.  \"A\" stability conditions occur on clear days with high wind speeds. Stability class \"F\" represents extremely stable or calm conditions with little atmospheric mixing.  \"F\" stability conditions occur on overcast nights with low wind speeds.  Refer to Exhibit 2 in the EPA's RMP Offsite Consequence Analysis Guidance for more information on stability class.\n\nA wi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 53506,
      "SummaryText": "nd speed of 1.5 meters per second and \"F\" atmospheric stability class was used for the worst-case toxic release scenario.\n\nTypical meteorological conditions (wind speed of 3 meters/second and a stability class of \"D.\") were used for the analysis of the alternative toxic release scenario.\n\nA?    Ambient Temperature/Humidity\n\n25oC and 50 percent relative humidity were used during the analysis of the worst-case and alternative toxic release scenarios.\n\nA?    Height of Release\n\nThe worst-case scenario was analyzed assuming ground level release and the alternative toxic release scenario was analyzed assuming ground level release.\n\n\nA?    Surface Roughness\n\nWe used urban topography because the facility is surrounded by trees and buildings.\n\nA?    Dense or Neutrally Buoyant Gases\n\nAnhydrous ammonia was analyzed as a neutrally buoyant gas.\n\nA?    Temperature of Released Substance\n\nWe assumed that ammonia was released at its boiling point\n\nA?    Analysis Method\nWe used the reference tables contained in the EPA's Risk Management Program Guidance for Ammonia Refrigeration for the analysis of the worst-case and alternative toxic release scenarios.\n\nExhibit 4-4 in the EPA's Guidance indicates that under worst-case conditions an ammonia cloud could travel 1.0 miles before being diluted below 200 ppm.\n\n Exhibit 4-6 in the EPA's Guidance indicates that under alternative release conditions an ammonia cloud could travel 0.2 miles before being diluted below 200 ppm.\n\n\n\n\n3.7    Define the Offsite Impacts for the Release Scenarios\n\nThe population that could be affected by the ammonia release scenarios was estimated using LandView VI.  LandView VI  is a computer mapping system that includes databases from the EPA, the Bureau of the Census, the U.S. Geological Survey, the Nuclear Regulatory Commission, the Department of Transportation, and the Federal Emergency Management System.  The population means any person except employees or contractors who work at the stationary source.\n\nApproximately 588 people resid"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 53506,
      "SummaryText": "e within 1.0 miles of the Disputanta Plant and thus could be affected by the worst-case ammonia release scenario. \n\nApproximately 0 people reside within 0.2 miles of the Disputanta Plant and thus no one could be affected by the alternative ammonia release scenario.\n\nThe potential public receptors that could be affected by the ammonia release scenarios were identified using USGA maps, local site maps, LandView VI, and site inspections.  Public receptors include schools (public and private, elementary, secondary, or higher education); residences; hospitals; prisons; public recreational areas or arenas (including stadiums, parks, and public swimming pools); and major commercial, off or industrial areas (e.g., industrial parks, off buildings, shopping malls, and commercial areas).\n\n\n\n\n\n\n\n\n\nThe following public receptors are located within a 1.0 mile radius of the Disputanta plant:\n\nSchools:            Yes\nResidences:        Yes, see population table\n    Hospitals:        None\n    Prisons:            None\n    Recreation Areas:    None\n      Commercial:        Yes\n\nThe following public receptors are located within a 0.2 mile radius of the Disputanta plant:\n\nSchools:            None            \n    Residences:        None\n    Hospitals:        None\n    Prisons:            None\n    Recreation Areas:    None\n\nThe potential environmental receptors which could be affected by the release scenarios were identified using USGA maps, local site maps, and during site inspections.  Environmental receptors include: national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preservations, or refuges; federal wilderness areas.\n\nThere are no environmental receptors located within a 1.0 mile radius of the Disputanta Plant\n    \n\n\n    SUMMARY OF AMMONIA HAZARD ASSESSMENT\n\n    \nWORST-CASE RELEASE SCENARIO    \nALTERNATIVE\n RELEASE SCENARIO\n\nDESCRIPTION OF SCENARIO    \nFailure of the ammonia \nreceiver    \nRelease from pressure relief valve \n\n\nQUANTITY RELEASED    \n14,000 pounds    \n865 pounds\n\nRELEASE RATE    \n1,400 pounds per minute    \n57.7 pounds per minute\n\nRELEASE DURATION    \n10 minutes    \n15"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 53506,
      "SummaryText": " minutes\n\nPASSIVE MITIGATION DEVS    None    None\n\nACTIVE MITIGATION DEVS    \nNone    \nAmmonia sensors, alarms, and shutdown devices \n\nENDPOINT    \n200 ppm (0.24 mg/L)    \n200 ppm (0.24 mg/L)\n\nDISTANCE TO ENDPOINT    \n1.0 miles    \n0.2 miles\n\nPOPULATION     \n588 people    \n0 people\n\nPUBLIC RECEPTORS    \nSee Description Above    \nSee Description Above\n\nENVIRONMENTAL RECEPTORS    \nNone    \nNone\n \n4.0    FIVE-YEAR ACCIDENT HISTORY\n\nA five-year accident history must be prepared as part of the hazard assessment and included in the Risk Management Plan (RMP).  The purpose of the five-year accident history is to identify and describe each accidental release from a covered process within the previous five years that resulted in significant on-site or offsite consequences to help prevent the recurrence of similar releases.\n\nNo ammonia-related incidents were identified for the Disputanta facility in the previous five years that resulted in significant on-site or offsite consequences.\n\n"
    }
  ]
}