{
  "FacilityID": 53507,
  "FacilityName": "Americold Logistics - Plant City, Frontage",
  "FacilityStr1": "302 North Frontage Road",
  "FacilityStr2": null,
  "FacilityCity": "Plant City",
  "FacilityState": "FL",
  "FacilityZipCode": "33565",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12057",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "28.036667",
  "FacilityLongDecDegs": "-082.124167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Art Al Holding, LLC",
  "Company2Name": null,
  "CompanyDUNS": 58149378,
  "Company2DUNS": 0,
  "OperatorName": "AmeriCold Logistics, LLC",
  "OperatorStr1": "10 Glenlake Parkway, Suite 800",
  "OperatorStr2": null,
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30028",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Elliott",
  "RMPTitle": "SE Regional Compliance Manager",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000133367",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-03-10 00:00:00",
  "SafetyInspectionBy": "University of South FL, USF Safety Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Plant City, Florida",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-03-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-01-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-01-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-01-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 28.03612,
  "FRS_Long": -82.12417,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 77972,
      "AltID": "Building 1",
      "FacilityID": 53507,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 79849,
          "ProcessID": 77972,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 103834,
          "ProcessID": 77972,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 603834,
          "ProcessID": 77972,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53507,
      "SummaryText": "Executive Summary\n\nA.  Describe  Accidental Release Prevention and Emergency Policies\n\nVersaCold Logistics Services is a refrigerated warehousing and distribution facility.  The large majority of products stored are refrigerated foods for human consumption and inherently pose no know environmental or safety risks.  Refrigeration grade anhydrous ammonia, a regulated substance, is the chemical commonly used in industrial refrigeration systems to maintain low temperatures for storage.  Inherent properties of anhydrous ammonia make it the refrigerant of choice and widely accepted as being among the most efficient as well as being environmentally friendly.  It can be safely managed by trained operators.\n\nVersaCold Logistics Services Management has implemented the requirements of the Risk Management Plan at this location in order to operate this facility in accordance with regulations and support of best industry standards.  The ultimate objective is to minimize the risk of an accidental ammonia release.  The facility safety management has developed an Employee Emergency Action and Fire Prevention Plan along with emergency procedures and training to protect the employees, the public and the environment.  These safety fundamentals are based on International Institute of Ammonia Refrigeration, Ammonia Safety and Training Institute, the International Association of Fire Chiefs, and International Association of Refrigerated Warehouse guidance. VersaCold Logistics Services employees responsible for managing the ammonia refrigeration process are provided first responder training by specialists that are authorized to train. VersaCold Logistics Services management believes it is important that employees participate in emergency response planning with local responders in order to be adequately trained in handling emergency situations with anhydrous ammonia systems.  This specialized HAZMAT training follows the guidelines of federal, state and local regulatory agencies.  In the eve"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53507,
      "SummaryText": "nt any offensive response activity is required, it is allowed only when conducted in a coordinated response Unified Command under the authority of the local emergency management.  The first responder training includes facility managers, refrigeration employees, and local emergency responders in order to protect life safety and the environment while providing a safe workplace.  Preventing accidental ammonia releases at VersaCold Logistics Services by following process safety management practices is an important part of daily operations.  PSM is the method to manage the ammonia refrigeration system properly.  This creates a safety culture to ensure the facility complies with OSHA, EPA state and local requirements as well as its own internal standards.\n\nVersaCold Logistics Services is committed to safe management and operation of the closed Ammonia Refrigeration System.  Maintenance employees are trained to observe operational procedures designed to be as fail-safe as possible to prevent accidental release of ammonia at any time.  Should any accidental release occur, all refrigeration employees are required to observe safe emergency response procedures.  They are trained to work in conjunction with the Local Emergency Planning Commission to minimize the impact of any accidental releases. \n\nAccidental Release Prevention and Emergency Policies are designed to comply with OSHAs Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, 29 CFR 1910.119) and EPAs Risk Management Program (RM program) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR Part 68). The purpose of the accidental release prevention and emergency action programs is to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53507,
      "SummaryText": " physical property damage. \n\nB.  Stationary Source and Regulated Substances Handled\n\nThis facility operates an ammonia refrigeration system to provide cooling and freezing capabilities.  The amount of anhydrous ammonia (CAS #7662-41-7) contained in this system is in excess of 10,000 pounds.  The ammonia inventory of this system is approximately 13,000 lbs.  Since ammonia releases from this system could pose a risk of offsite public impact and is regulated under the OSHA PSM standard (29 CFR 1910.119), the system is subject to the Program 3 requirements of the EPAs RM program.\n\nThe closed loop ammonia refrigeration system at the facility provides (2) major suction pressures (temperatures) for use in the preservation of perishable food products. Through the use of multiple stages (2) of compression the refrigeration system provides refrigerant temperatures of +20F. With the use of low suction booster compressors and provides temperatures of -30F. And -45F. \nwith the use of intermediate suction compressors.\n\nThe higher pressure portions of the system include the condenser, located on the roof, along with refrigerant vent lines where any leaks can dissipate to the air, joining ammonia produced by lightning where it can be consumed as it goes through a natural biodegrading process.  Normal safeties include: high pressure cut-outs, relief valves, and ventilating systems for machinery room areas.  \n\nC.  Description of the Accidental Release Prevention Program\n\nThe prevention program (OSHA Process Safety Management CFR 1910.119) consists of the following elements:  \n\nEmployee Participation\nProcess Safety Information\nProcess Hazard Analysis\nOperating Procedures\nTraining\nContractors\nPre-startup Safety Review\nMechanical Integrity\nHot Work Permits\nManagement of Change\nIncident Investigation\nCompliance Audits\n\nD.  Five-Year Accident History  \n\nThere have been no reportable incidents in the past five years.  \n\nE.  Description of the Emergency Response Program  \n\nThis facility has"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53507,
      "SummaryText": " an Emergency Action Plan. This facility will call in local emergency personnel in the event of a significant ammonia release.  The facility is included in the community Emergency Response Program coordinated by the LEPC.  \n\nF.  Planned Changes to Improve Safety  \n\nA  Process Hazard Analysis was conducted on December 10, 2008.  Any recommendations resulting from this analysis will be evaluated and implemented as required."
    }
  ]
}