{
  "FacilityID": 53586,
  "FacilityName": "Dole Berry Company - Watsonville",
  "FacilityStr1": "480 W. Beach Street",
  "FacilityStr2": null,
  "FacilityCity": "Watsonville",
  "FacilityState": "CA",
  "FacilityZipCode": "95076",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06087",
  "LEPC": "County of Santa Cruz Environ.",
  "FacilityLatDecDegs": "36.906665",
  "FacilityLongDecDegs": "-121.764999",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "NE",
  "FacilityURL": "coastalberry.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Dole Fresh Vegetables Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dole Berry Company",
  "OperatorStr1": "480 W. Beach St.",
  "OperatorStr2": null,
  "OperatorCity": "Watsonville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95076",
  "OperatorZipCodeExt": null,
  "FTE": 560,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000171048",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-03-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "2008 Contact Changes",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-02-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-02-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-01-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-01-03 00:00:00",
  "DeRegistrationEffectiveDate": "2018-04-27 00:00:00",
  "AnniversaryDate": "2014-01-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 36.90621,
  "FRS_Long": -121.76565,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 78093,
      "AltID": "NH3 Refrig.(Measured Inv.",
      "FacilityID": 53586,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 103976,
          "ProcessID": 78093,
          "ChemicalID": 56,
          "Quantity": 11463.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 79977,
          "ProcessID": 78093,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 46035,
              "Process_NAICS_ID": 79977,
              "SafetyReviewDate": "2008-04-02 00:00:00",
              "PHA_Date": "2004-12-03 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-12-03 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "forklift impact",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "redundant controls",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "SRV replacement",
              "OpProceduresReviewDate": "2005-03-10 00:00:00",
              "TrainingReviewDate": "2005-01-31 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2005-03-08 00:00:00",
              "EquipmentInspectionDate": "2008-01-14 00:00:00",
              "EquipmentTested": "Visual  inspection of compressors, exposed piping, condensers, SRV's and ventilation",
              "ChangeMgmtDate": "2000-05-27 00:00:00",
              "ChangeMgmtReviewDate": "2005-01-31 00:00:00",
              "PreStartupReviewDate": "2004-03-03 00:00:00",
              "ComplianceAuditDate": "2008-01-14 00:00:00",
              "AuditCompletionDate": "2008-07-15 00:00:00",
              "IncidentInvestigationDate": "2000-04-26 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2005-01-31 00:00:00",
              "HotWorkPermitReviewDate": "2005-01-31 00:00:00",
              "ContractorSafetyReviewDate": "2005-01-31 00:00:00",
              "ContractorSafetyEvalDate": "2005-01-31 00:00:00",
              "CBI_Flag": 0,
              "Description": "NH3 Refrig.(Measured Inv.); Storage of strawberries (SIC0723)",
              "_chemicals": [
                {
                  "PrimaryKey": 67137,
                  "PreventionProgram3ID": 46035,
                  "ProcessChemicalID": 103976
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 53586,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2005-03-22 00:00:00",
    "ERTrainingDate": "2003-03-21 00:00:00",
    "CoordinatingAgencyName": "Watsonville Fire Department",
    "CoordinatingAgencyPhone": "8317286110",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53586,
      "SummaryText": "RMP Executive Summary\n\nDole Berry Company\nWatsonville Beach St. Facility\n\nIntroduction\nThe Risk Management Program at Dole Berry Company complies with US EPA and Cal ARP requirements. \n\nThe procedures for complying with the RM Program regulations are outlined by the following major steps:\n1.    Identify Covered Processes\n2.    Determine Program Level\n3.    Establish a Management System\n4.    Conduct a 5-year Accident History\n5.    Perform Hazard Assessments\n6.    Develop an Accident Prevention Program\n7.    Develop an Emergency Response Program and\n8.    Prepare a Risk Management Plan (RMP)\n\nPublication or sharing of OCA portions of RMP materials can be in violation of the Chemical Safety Information, Site Security and Fuels Regulatory Relief Act (PL106-40). \n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Dole Berry Company are strongly committed to employee, public and environmental safety.  Our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training demonstrates this commitment.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities revolve around processing and storage of fresh strawberries.  This activity is consistent with SIC 0723/ NAICS 115114 post harvest crop activities. Anhydrous ammonia is the major regulated substance present at our facility.  The entire ammonia inventory is attributed to use as a refrigerant. Ammonia (anhydrous) is used as a refrigerant in a closed loop refrigeration system. The calculated inventory of ammonia at our facility exceeds 10,000 lbs. \n  \n\n \n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nThe worst-case release scenario mandated by the RMP Rul"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53586,
      "SummaryText": "e is a standardized hypothetical situation intended to promote \"dialogue\". According to the International Institute of Ammonia Refrigeration \"The worst-case situation represents an extremely improbable (and for many facilities impossible) set of circumstances rather than a credible accident scenario. Release quantities and hazard distances derived there from for the worst-case scenario should not be used as a basis for emergency response planning.\"\n\nTo evaluate the worst case and alternative release scenarios for ammonia we have used the methodology given in the Model Risk Management Program and Plan for Ammonia Refrigeration by SAIC.  To perform the required offsite consequence analyses for other substances we have used.  Details are not provided in the Executive Summary as required in recent rulemaking.\n\nAlternate case scenario has also been evaluated and included. \n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1998 Edition.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nDole Berry Company maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all the processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What if /Checklist.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years.  Any findings rel"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53586,
      "SummaryText": "ated to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Dole Berry Company maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup afte rmaintenance.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\nTraining\nDole Berry Company has a comprehensive training program in place to ensure that employees who are operating processes are completely competent in the operating procedures associated with these processes.  Refresher training is provided at least every 3 years and more frequently as needed.\n\nMechanical Integrity\nDole Berry Company carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance procedures are carried out by qualified personnel or Refrigeration Contractors with a strong background in maintenance practices.  Specialized training is provided to these personnel as needed.  Any equipment deficiencies identified during maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Dole Berry Company to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel and all other employees whose job tasks are affected by a change in a process are promptly made aware of and offered training to deal with the changes.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Dole Berry Company.  These"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53586,
      "SummaryText": " reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nDole Berry Company conducts audits on a regular basis to determine whether the provisions set out under the RMP Rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nDole Berry Company promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years. Any incidents that release a reportable amount of Ammonia require updating the 5 year Accident History and filing a revised RMP with the EPA.\n\nEmployee Participation\nDole Berry Company truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information collected as part of the facility's compliance with the RMP Rule including information resulting from process hazard analyses.\n\nHot Work Permit\nAt Dole Berry Company Hot Work Permit procedures are in place and enforced. Preventing accidents related to welding and cutting while alerting others at the facility that this type of work is occurring are important prevention steps.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Dole Berry Company has a strict polic"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 53586,
      "SummaryText": "y of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response to an accidental release of a regulated substance.\n\n\n5.    Five-year Accident History\nDole Berry Company has an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period at our Cold Storage facility. Any reportable release requires updating the Accident History within 6 months.\n\n6.    Emergency Response Plan\nDole Berry Company has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is regularly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response. Any changes in Emergency Contact information is reported within 30 days.\n\n7.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Additional management integration and written documentation along with continuous mechanical room ventilation are some of the steps we want to take to improve safety at our facility.  These changes should be implemented by 12/3/2005."
    }
  ]
}