{
  "FacilityID": 5380,
  "FacilityName": "Quittacas Water Treatment Plant",
  "FacilityStr1": "Negus Way; Off Rte 105",
  "FacilityStr2": null,
  "FacilityCity": "Rochester",
  "FacilityState": "MA",
  "FacilityZipCode": "02770",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25023",
  "LEPC": "Rochester LEPC",
  "FacilityLatDecDegs": "41.785778",
  "FacilityLongDecDegs": "-70.9165",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "DSantos@www.ci.new-bedford.ma.us",
  "FacilityDUNS": null,
  "ParentCompanyName": "New Bedford Water Department",
  "Company2Name": null,
  "CompanyDUNS": 46001402,
  "Company2DUNS": null,
  "OperatorName": "New Bedford Water Department",
  "OperatorStr1": "238 Middleboro Road",
  "OperatorStr2": null,
  "OperatorCity": "East Freetown",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02717",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000066821",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-08-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2002-07-30 00:00:00",
  "DeRegistrationEffectiveDate": "2002-05-29 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.785778,
  "FRS_Long": -70.9165,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6358,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 5380,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 6909,
          "ProcessID": 6358,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6513,
          "ProcessID": 6358,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3324,
              "Process_NAICS_ID": 6513,
              "SafetyReviewDate": "1999-03-15 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "10 State Standards; DEP Guidelines; Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "1999-03-18 00:00:00",
              "ChangeCompletionDate": "1999-11-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "New SCBA & escape respirators; new gas detector; external horn and beacon, windsock; labeling",
              "OpProceduresReviewDate": "1999-06-18 00:00:00",
              "TrainingReviewDate": "1999-06-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-18 00:00:00",
              "EquipmentInspectionDate": "1999-04-23 00:00:00",
              "EquipmentTested": "Chlorination equipment and accessories: Wallace & Tiernan Day 3000 ppd Switchover Unit; Wallace & Tiernan 2000 ppd V-2000 Chlorinator; preventative maintenance kits",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3412,
                  "PreventionProgram2ID": 3324,
                  "ProcessChemicalID": 6909
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5380,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Rochester Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 5380,
      "SummaryText": "for the Risk Management Program and the Head Operator for providing maintenance of the program.  Evaluation of risks from chlorine has involved inspecting existing facilities and compiling safety information for chlorine.  This led to conducting a hazard review to identify deficiencies in equipment and operation which could be improved as part of the Risk Management Program. \n\nPlanned Changes\n\nAs a result of the hazard review, operational changes include reducing the amount of chlorine stored on site to ensure that never more than 8 one-ton containers are present at the Water Treatment Plant.  Planned improvements include providing new self-contained breathing apparatuses and escape respirators, replacing the chlorine gas detector, installing a windsock, and installing an outdoor beacon and horn to serve as an alarm during emergency conditions.\n\nCompliance audits will be conducted by the Water Department every three years to evaluate the implementation of the Risk Management Program.  Incident investigation reports will be generated for any incident to track problems, eliminate potential recurrence of accidents, and provide a safe working environment for all employees.  \n\nAccident History\n\nOver the past five years there has not been any reportable accidents involving chlorine.\n\nPrevention Program\n\nPreventative maintenance service is performed annually on all chlorination equipment by a qualified service technician to ensure that all equipment has been inspected, tested and calibrated.  Preventative maintenance is a critical component of equipment maintenance and can serve to prevent accidental releases of chlorine resulting from equipment failure.  In addition to the annual inspection plant operators perform routine maintenance service which serves to monitor the day-to-day operation of equipment and ensure proper performance.  Additionally, the Department of Environmental Protection conducts on-site sanitary surveys of the Quittacas Water Treatment Plant facilitie"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 5380,
      "SummaryText": "Facility and Regulated Substance Handled\n\nThe Quittacas Water Treatment Plant is located on Negus Way off Route 105 in Rochester, Massachusetts.  It is a 45 million-gallon-per-day filtration plant that treats water from the Quittacas Ponds to provide drinking water for the City of New Bedford and surrounding towns.  The Quittacas Water Treatment Plant is a conventional filtration plant consisting of coagulation, flocculation, sedimentation, filtration and disinfection.  Disinfection is an essential process and is achieved through use of chlorine, which is an EPA regulated substance.  Eight one-ton containers of chlorine (16,000 pounds) are present at the Water Treatment Plant which is in excess of the regulatory threshold and thus requires development of a Risk Management Program.  \n\nFour one-ton containers of chlorine are present in the Scale Room and four one-ton containers are present in the Storage Room.  The Scale Room is comprised of two chlorine scales, each holding 2 one-ton cylinders, so that one scale can be in operation while the second is on standby.  Chlorine gas is withdrawn from the on-line pair of cylinders and an automatic chlorine gas switchover system transfers gas flow from an exhausted source to a standby source to ensure continuous disinfection as required by Federal law.  Chlorine gas from the ton containers is fed through the chlorine gas manifold to the chlorinators (one on-line and one standby) located in the adjacent Chlorinator Room.  The chlorinators and accessories are designed to control the chlorine flow rate and to direct the gas flow to ejectors which combine the gas with water to form a chlorine solution for disinfection.\n\nRisk Management Program\n\nDevelopment of the Risk Management Program for the Quittacas Water Treatment Plant has served as an opportunity to evaluate operational and safety issues associated with the use of chlorine.  The Water Department has identified the Assistant Superintendent for providing overall leadership"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5380,
      "SummaryText": "s to inspect equipment and determine that operation and maintenance procedures are adequate and is able to produce and distribute safe drinking water.\n\nStandard operating procedures have been developed for all operating conditions involving chlorine to ensure uniform operation by all treatment plant operators.  Treatment plant operators also receive on-the-job and classroom training in use of chlorination equipment.  Outside courses have included Handling Chlorine and Anhydrous Ammonia Emergencies by Region One Regional Response Team in cooperation with the Massachusetts Emergency Management Agency, Hazardous Materials Technical Level Training by New England Water Works Association, and Chlorine Safety and Handling Seminar by Jones Chemicals.\n\nWorst-Case Release Scenario\n\nThe worst-case release scenario was determined to be the complete release of chlorine from a single one-ton container.  This represents the greatest amount held in a single vessel on-site.  Since chlorine is a gas at ambient temperature it was assumed to be released over a period of ten minutes in accordance with the Risk Management Plan regulations.  Because chlorine gas is denser than air, the SLAB computer model was used which was developed by the USAF Engineering and Services Center and the American Petroleum Institute to simulate atmospheric dispersion of denser-than-air gas releases.  In accordance with EPA modeling requirements for worst case releases, a wind speed of 1.5 meters per second and atmospheric stability class of F were used in conjunction with rural topography surface roughness coefficients.  The SLAB model determined that the maximum distance to a toxic endpoint of 3 parts per million of chlorine generated from the worst-case release scenario is 2.9 miles.  While the actual impact area would depend on the prevailing wind direction, the potential impact area lies within a circle around the Water Treatment Plant with a radius of 2.9 miles.  This radius equates to an area of"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5380,
      "SummaryText": "26.4 square miles, and includes residential areas, schools, recreational areas, and churches.   \n\nAlternative Release Scenario\n\nThe alternative release scenario selected is a scenario for the accidental release of chlorine due to a failure of a one-inch schedule 80 PVC pipe connected to 2 one-ton cylinders.  Since 2 one-ton cylinders are manifolded together and are on-line at all times, the potential for a leak drawing from two cylinders is a possible scenario.  The total chlorine release estimated from this condition is 634 lbs over 27 minutes.  (American Water Works Association Research Foundation, Compliance Guidance and Model Risk Management Program for Water Treatment Plants, 1998)  Local meteorological conditions from the nearby New Bedford Airport were used for average daily temperature, humidity, wind speed and stability class.  The SLAB model determined that the maximum distance to a toxic endpoint of 3 parts per million of chlorine generated from this alternative release scenario is 0.3 miles.  The alternative release scenario has a significantly smaller potential impact area of 0.28 square miles in which there are not any residences, schools, churches, etc.  There is public access on lands surrounding the Water Treatment Plant and these are the only public receptors that would be affected by an alternative release.\n\nEmergency Response Policies\n\nA mutual aid agreement was developed between the Rochester Fire Department and the New Bedford Fire Department to respond to notification of a chlorine release at the Quittacas Water Treatment Plant.  Since the Water Treatment Plant is within Rochester but is owned and operated by the City of New Bedford, it was determined that a mutual aid agreement would allow for a timely response and best use of available resources.  The Rochester Fire Department and New Bedford Fire Department will both respond to notification of a chlorine release.  The New Bedford Fire Department's HAZMAT team will be part of the response te"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5380,
      "SummaryText": "am.\n\nThe Water Department submits Tier Two chemical inventory reports to the Rochester Local Emergency Planning Committee (LEPC) in accordance with the Emergency Planning and Community Right-To-Know Act.  This information is provided on an annual basis to enable the LEPC to account for all chemicals within its jurisdiction.  The Water Department has made the Assistant Superintendent available to serve on the LEPC to ensure that the Water Treatment Plant is properly represented."
    }
  ]
}