{
  "FacilityID": 53884,
  "FacilityName": "Chaparral Gas Plant",
  "FacilityStr1": "492 Shugart Road",
  "FacilityStr2": null,
  "FacilityCity": "Carlsbad",
  "FacilityState": "NM",
  "FacilityZipCode": "88220",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35015",
  "LEPC": "Eddy County LEPC",
  "FacilityLatDecDegs": "32.653472",
  "FacilityLongDecDegs": "-103.895028",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.epco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Enterprise Field Services, LLC",
  "Company2Name": null,
  "CompanyDUNS": 135476534,
  "Company2DUNS": 135476534,
  "OperatorName": "Enterprise Products Operating, LLC",
  "OperatorStr1": "2727 North Loop West",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77008",
  "OperatorZipCodeExt": "1044",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000206056",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "2008 First Submission",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-03-04 17:10:33",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-03-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-03-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-03-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 32.630257,
  "FRS_Long": -103.873545,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 78578,
      "AltID": "Hydrocarbon Liquid Extrac",
      "FacilityID": 53884,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 104659,
          "ProcessID": 78578,
          "ChemicalID": 155,
          "Quantity": 11000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 86184,
              "ProcessChemicalID": 104659,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 86185,
              "ProcessChemicalID": 104659,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 86186,
              "ProcessChemicalID": 104659,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 86187,
              "ProcessChemicalID": 104659,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 86188,
              "ProcessChemicalID": 104659,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 86189,
              "ProcessChemicalID": 104659,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 86190,
              "ProcessChemicalID": 104659,
              "ChemicalID": 125
            }
          ]
        },
        {
          "ProcessChemicalID": 104660,
          "ProcessID": 78578,
          "ChemicalID": 155,
          "Quantity": 2500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 86191,
              "ProcessChemicalID": 104660,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 86192,
              "ProcessChemicalID": 104660,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 86193,
              "ProcessChemicalID": 104660,
              "ChemicalID": 98
            }
          ]
        },
        {
          "ProcessChemicalID": 104661,
          "ProcessID": 78578,
          "ChemicalID": 155,
          "Quantity": 220000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 86194,
              "ProcessChemicalID": 104661,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 86195,
              "ProcessChemicalID": 104661,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 86196,
              "ProcessChemicalID": 104661,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 86197,
              "ProcessChemicalID": 104661,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 86198,
              "ProcessChemicalID": 104661,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 86199,
              "ProcessChemicalID": 104661,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 80491,
          "ProcessID": 78578,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 53884,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-02-10 00:00:00",
    "ERTrainingDate": "2009-02-25 00:00:00",
    "CoordinatingAgencyName": "Eddy County LEPC",
    "CoordinatingAgencyPhone": "5058879511",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53884,
      "SummaryText": "Chaparral Gas Plant\nEnterprise Products Operating LLC.\nExecutive Summary\nRisk Management Plan\n\n\n\nAccidental Release Prevention and Response\n\n\nEnterprise Products Operating, LLC, has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of the facility¿s processes.  It is the practice of Enterprise Products Operating LLC (Enterprise) to implement reasonable controls to prevent foreseeable releases of substances.  However, if a release does occur, trained personnel will respond to, control and contain the release.\n\n\nDescription of the Stationary Source and Regulated Substances\n\nThe Chaparral Gas Plant located in Eddy County, New Mexico, is  owned by Enterprise Field Services L.L.C. and is operated by Enterprise Products Operating, LLC..\n\nThe Chaparral Gas Plant is a cryogenic turboexpander gas processing facility that utilizes cooling and pressure reduction to reduce the temperature of an inlet, field gas stream to a very low temperature, causing liquifiable hydrocarbons to condense from the gas stream.   The mixed hydrocarbon liquid stream (Y-Grade product) is treated to remove carbon dioxide and is pumped as a mixed product via pipeline to fractionation facilities elsewhere.  The plant discharge gas stream (residue gas) flows from the plant via a residue gas pipeline to market..  \n\nThe Chaparral Gas Plant was evaluated to determine if any regulated flammable substances exceeded the threshold quantity.  Enterprise identified the regulated substances and quantities to be kept on site based on the process design and the size of the proposed process vessels.  Listed flammable substances which will be present above the threshold quantities at the Chaparral Gas Plant are natural gas (methane), ethane, propane, iso-butane, normal butane, iso-pentane and pentane.  The Plant is designed t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53884,
      "SummaryText": "o operate with one operator in attendance 24 hours per day, seven days per week, with occasional shutdowns for major equipment maintenance.  There are no other gas processing, gas compression or industrial facilities nearby.  The Chaparral Gas Plant is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulation.  Due to the presence of regulated flammable materials above the threshold quantity, the Chaparral Gas Plant is being registered as an EPA Risk Management Program 1 facility..  \n\n\nOffsite Consequence Analysis Results\n\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site, but no toxic substances above the threshold quantity.  The calculated distance for the Worst Case Scenario is less than the distance to the nearest offsite receptor.  Since there have been no accidents with offsite consequences within the last five years and emergency response is coordinated with the Local Emergency Planning Commission, the plant qualifies as an RMP Program 1 facility.\n\nGeneral Accident Release Prevention Program\n\nThe following is a summary of the safety and accident prevention program in place at the Chaparral Gas Plant.  The location safety management program is in place to comply with the OSHA Process Safety Management (PSM) regulation, CFR 1910.119.)  The processes at the plant are also regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation.  However, the remote location of the Chaparral Gas Plant allows the facility to be registered as an RMP Program 1 faciltiy, which does not need to have an accident prevention program to protect the public.  The following describes the standard Enterprise safety management program that is in place to protect the employees at the Chaparral Gas Plant.\n \n\nEmployee Participation\n\nActive employee participation and involvement in the deve"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53884,
      "SummaryText": "lopment and implementation of the plant¿s safety program is an important step toward achieving the objective to prevent or minimize the consequences of catastrophic releases of toxic, reactive, flammable or explosive chemicals.  Employee involvement helps to insure that all perspectives regarding safety compliance and accident prevention are considered and that the best ideas are implemented.  Open communications are encouraged between supervisors and employees regarding all aspects of safety and health issues concerning the employees and the public.\n\nEnterprise strongly promotes employee involvement in safety issues through existing programs.  These programs include regularly scheduled safety meeting, tail-gate safety meetings, hazard communications, Safety Suggestion Forms, a ¿near-miss¿ reporting system and special training programs such as emergency response training, first aid training, etc.\n\nEnterprise actively seeks employee involvement in the development and conduct of all accident prevention activities through the appropriate existing safety programs.  Accident prevention is discussed at the regularly scheduled safety meetings and/or during special training sessions if necessary.  Employees are encouraged to discuss accident prevention with their supervisors and to bring any questions, comments or suggestions forward for open discussion.\n\nProcess Safety Information\n\nNecessary process safety information is readily available to all employees.  Enterprise keeps a variety of technical documents that are used to help maintain a safe operating process.  These documents address chemical properties and associated hazards, limits for key process parameters, specific chemicals inventories and equipment design basis/configuration information.\n\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations is provided in material safety data sheets (MSDS) which are available online through the Enterprise ImageWave MSD"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53884,
      "SummaryText": "S viewer..\n\nEnterprise also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure ratings, temperature ratings and electrical rating of equipment.  This information in combination with written procedures and trained personnel provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to insure that safety features in the process are not compromised.\n \n\nProcess Hazard Analysis (PHA)\n\nEnterprise Products Operating, LLC has a comprehensive program to help insure that hazards associated with gas processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and insure that adequate controls are in place to manage these hazards.\n\nEnterprise primarily uses the hazard and operability (HAZOP) and What-if/Checklist method analysis technique to perform these evaluations.  The analyses are conducted using a team of Enterprise staff which has operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\nThe PHA team findings are forwarded to local and corporate management for resolution.  Implementation of mitigation options in response to PHA findings for existing facilities is based on a relative risk ranking assigned by the PHA team.  This ranking helps insure that potential accident scenarios are assigned the highest risk receive immediate attention.  For a new facility, the PHA team recommendations are forwarded to the Engineering Contractor for installation. All approved mitigation options in response to PHA team findings are tracked until they ar"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 53884,
      "SummaryText": "e completed.  The final resolution of each finding is documented and retained.\n\nOperating Procedures\n\nThe Chaparral Gas Plant will have and maintain written procedures that address various modes of process operations such as; (1) start-up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown and (6) initial startup of a new process.  These procedures provide guidance for experienced operators and also provide the basis for training new operators.  Operating procedures are periodically reviewed and are updated when necessary if the operators discover procedural errors, or if changes in operating conditions require a change in the operating procedures.\n\nThe intent of the operating procedures is to provide workable, useful and clearly written instructions for conducting operating activities.  To have effective operating procedures, the task and procedures directly and indirectly related to the covered process must be appropriate, clear, consistent and most importantly communicated to employees.  Operating procedures are specific instructions or details on what steps are taken or followed in carrying out the stated procedures.  The specific instructions include the applicable safety precautions and appropriate information on safety implications.\n \n\nTraining\n\nIn addition to training on operating procedures, the Chaparral Gas Plant has a comprehensive training program for all employees involved in operating the process.  New employees receive basic training in gas compression and process plant operations.  In addition, all operators receive work practice training related to the safe accomplishment of operating and maintenance tasks.  Individual operating technicians are empowered with the implementation of the location Hot Work Permit program, and receive necessary training in the procedures utilized to authorize and permit hot work.\n\nContractors\n\nThe Chaparral Gas Plant uses contractors during periods of increased maintenance or co"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 53884,
      "SummaryText": "nstruction activities.  Because some contractors work on or near process equipment, the plant has procedures in place to insure that contractors (1) perform their work in a safe manner, (2) have appropriate knowledge and skills, (3) are aware of the hazards of their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site specific safety rules and (6) inform plant personnel of any hazards that they find while performing their work.  This is accomplished by providing contractors with an orientation session that covers (1) a process overview, (2) information about the safety and health hazards, (3) emergency response plan requirements and (4) safe work practices prior to beginning their work.  In addition, the Chaparral Gas Plant utilizes contractors whose safety programs and performance have been evaluated during a company contractor selection process.  Enterprise personnel periodically monitor on site contractor performance to insure that contractors are fulfilling their safety obligations.\n\nMechanical Integrity\n\nThe Chaparral Gas Plant will utilize well established company practices and procedures for maintaining process equipment.  The basic aspects of this program include (1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting equipment deficiencies, when identified and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n\nEnterprise incorporates quality assurance measures into equipment purchases and repairs.  This helps insure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.  Continuing equipment and controls maintenance scheduling is accomplished utilizing the Enterprise MPACT compute based maintenance program.\n \n\nSafe Work Practices\n\nThe Chaparral Gas Plant has long standing safe work practices in p"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 53884,
      "SummaryText": "lace to help insure worker and process safety.  Examples of these include: (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to insure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work) and (5) a permit and procedure to insure that adequate precautions are in place before entry into a confined space.  These procedures, along with training of affected personnel, form a system to help insure that operations and maintenance activities are performed safely\n\nIncident Investigation\n\nThe Chaparral Gas Plant will promptly investigate any incidents that result in or reasonably could result in  a fire/explosion, major property damage, environmental loss, or personal injury.  The goal of each investigation is to gather the facts, determine the root cause, and develop corrective action to prevent the reoccurrence of the incident or a similar incident.  The investigation team will document its findings, develop recommendation(s) to prevent a reoccurrence and forward these results to the business management team for resolution.\n\nChemical Specific Prevention Steps\n\nThe processes at the Chaparral Gas Plant have hazards that must be managed to insure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\nUniversal Prevention Activities\n\nThe Enterprise standard accident prevention program summarized above is applied to all RMP covered processes at the Chaparral Gas Plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\nSpecialized Safety Features\n\nThe Chaparral Gas Plant has safety features and controls to help contain/co"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 53884,
      "SummaryText": "ntrol a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\n\nRelease Detection\n\n*Hydrocarbon (hazardous gas) detectors and alarms\n*Plant video surveillance system\n\nRelease Containment and Control\n\n*Process relief valves that discharge to a flare to capture and incinerate episodic releases.\n*Valves to permit isolation of the process (manual or automated).\n*Automatic shutdown systems for specific process parameters (e.g., high temperature).\n*Curbs or dikes to contain liquid releases.\n*Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system)\n\nRelease Mitigation\n\n*Hand-held fire extinguishers   \n*Personnel trained in emergency response and procedures.\n*Personnel protective equipment (e.g., chemical protective clothing, self-contained breathing apparatus, etc.)\n\n\nFive Year Accident History\n\nThe Chaparral Gas Plant, which is subject to Risk Management Program jurisdiction, is a new facility with no prior accident history..  \n\n\nEmergency Procedures Information\n\nThe Chaparral Gas Plant maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the plant facilities.  \n \n\nThe overall emergency procedure program for the Chaparral Gas Plant is coordinated with the.Eddy County Local Emergency Planning Commission (LEPC). The Chaparral Gas Plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 53884,
      "SummaryText": "incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, the Chaparral Gas Plant will conduct periodic emergency drills that involve the LEPC and emergency response organizations, and will provide periodic refresher training to local emergency responders regarding the hazards of regulated substances in the plant.\n\n\nPlanned Changes to Improve Safety\n\nEnterprise Products Operating, LLC is committed to the safe design and operation of all of its processing and fractionation plants and liquid hydrocarbon terminals.  The design team for the plant is currently installing equipment recommended by the Chapparl Gas Plant Process Hazard Analysis team to improve the safe design of the facility.  If the startup and operation of the Chaparral Gas Plant reveals any safety deficiencies, they will be corrected at the earliest possible time."
    }
  ]
}