{
  "FacilityID": 53892,
  "FacilityName": "TRANSFLO Cincinnati Terminal",
  "FacilityStr1": "3601 Gerninger Ave",
  "FacilityStr2": null,
  "FacilityCity": "Cincinnati",
  "FacilityState": "OH",
  "FacilityZipCode": "45214",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39061",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "39.144861",
  "FacilityLongDecDegs": "-084.545361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.transflo.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "TRANSFLO Terminal Services",
  "Company2Name": null,
  "CompanyDUNS": 7941321,
  "Company2DUNS": 0,
  "OperatorName": "TRANSFLO Terminal Services, Inc.",
  "OperatorStr1": "500 Water Street",
  "OperatorStr2": "J-975",
  "OperatorCity": "Jacksonville",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32202",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000206083",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-11-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-03-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-03-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-06-22 00:00:00",
  "DeRegistrationEffectiveDate": "2012-06-01 00:00:00",
  "AnniversaryDate": "2014-03-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 78587,
      "AltID": "LPG Transfer",
      "FacilityID": 53892,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 104674,
          "ProcessID": 78587,
          "ChemicalID": 118,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 104675,
          "ProcessID": 78587,
          "ChemicalID": 98,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 104676,
          "ProcessID": 78587,
          "ChemicalID": 129,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 80500,
          "ProcessID": 78587,
          "NAICSCode": "48821",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 46347,
              "Process_NAICS_ID": 80500,
              "SafetyReviewDate": "2008-12-04 00:00:00",
              "PHA_Date": "2008-10-07 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Emergency shut offs for fuel isolation",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Loader in attendance to identify leaks",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-12-31 00:00:00",
              "TrainingReviewDate": "2008-12-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-10-07 00:00:00",
              "EquipmentInspectionDate": "2008-12-04 00:00:00",
              "EquipmentTested": "Entire unit was inspected by supplier and test",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2008-12-04 00:00:00",
              "PreStartupReviewDate": "2008-12-10 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-12-10 00:00:00",
              "HotWorkPermitReviewDate": "2008-10-07 00:00:00",
              "ContractorSafetyReviewDate": "2008-10-07 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "3.0    Prevention Program\n\n\n\nThe transload process at TRANSFLO has a NAICS Code of 48211 and is considered a ?Program 3? level prevention program as described in Subpart C of 40 CFR 68 (68.48 through 68.60).  This terminal utilizes a series of terminal specific work instructions and procedures for the daily operations including the transload of LPG products.  Specific documents referenced in the RMP are found in an electronic operating procedures manual accessible to the terminal management and employees.  Written copies of work instructions are available at the terminal but are not considered controlled documents.  The seven requirements for the prevention program are described below and will be implemented on a daily basis at the Cincinnati terminal.\n\n\n\n3.1    Safety Information (40 CFR 68.48)\n\n\n\nRMP safety information requirements include compiling written information concerning equipment and processes.  Compiled information must address:\n\n\n\n?    Materials Safety Data Sheets (MSDS)\n\n?    Maximum inventory\n\n?    Storage and Process limits\n\n?    Equipment Specifications\n\n?    Codes and Standards\n\n\n\nTRANSFLO maintains a current MSDS for LPG products in the in the terminal managers office and in the terminal Hazard Communication station as required for 29 CFR 1910.1200.   Maximum inventory is limited to the track space for LPG railcars.   There is no fixed storage of LPG at the terminal.\n\n\n\nThe transfer unit is supplied by Superior Energy Services, Inc. of Berea, OH.  All replacement equipment is supplied by SES, Inc.   The transfer unit was designed and constructed to meet the National Fire Protection Association (NFPA Liquefied Petroleum Gas Code- NFPA 58- 2004 and 2008 edition.    Copies of the transfer unit equipment specifications, a process flow diagram and other technical information are maintained on the TRANSFLO Intranet portal for terminal and employee use. \n\n\n\nThe MSDS for LPG products, equipment specification and product storage information are included in this RMP as Attachment 3-1.\n\n\n\n3.2    Process Hazard Analysis ? PHA (40 CFR 68.50)\n\n\n\nAn initial hazard review was conducted on the transfer process and equipment by TRANSFLO personnel, the equipment supplier and outside safety professional consultants during the normal TRANSFLO new business development process. The Process Hazard Analysis (PHA) using a What If/Checklist as recommended using EPA ?Risk Management Plan Guidance for Propane Storage Facilities? was conducted on October 6, 2008 at the Toledo, OH terminal.  Attending were Greg Rhoads, CSP (PHA team leader); Bill Young, SES Inc. (equipment designer and NFPA 58 expert); John Thomas, SES Inc. (equipment technician); and Jeff Bechtel, TRANSFLO REM and LPG unit operator and maintenance technician. \n\n\n\nA Process Hazard Analysis was conducted on October 7th, 2008.  Process Safety Information (PSI) developed for this process was reviewed by a team familiar with the operation. The PSI and PSA documentation is maintained electronically on the Transflo Intranet. The Pre-Startup Safety Review (PSSR) was conducted on December 10th, 2008 by TRANSFLO HS&E staff and a HS&E consultant, GR&A Inc, familiar with PSSR requirements and the process safety information.\n\nTransfer Employee Training was also conducted at this time.\n\n\n\nTo prevent / control the catastrophic release of LPG, the following controls are integrated into the transfer process:\n\n\n\na.    Railcar-\n\no    Double shelf couplers (to prevent tank punctures during car handling)\n\no    9/16? tank shell and 11/16? tank heads\n\no    Enclosed valves and fittings in a protective dome.\n\no    Safety relief valve for tank car. \n\n\n\n\n\nb.    Terminal Physical Plant\n\no    Bonded and grounded track\n\no    Transfer area marked off during active transfers to limit adjacent traffic \n\no    Lighting in transfer area.\n\n\n\n\n\nc.    Transfer Unit\n\no    On board self proving ground system (Sculley)\n\no    Emergency shutoff valves (ESV?s)  \n\no    Remote electrical shut of capability\n\no    Closed loop vapor recovery system\n\n\n\n\n\n3.3    Operating Procedures (40 CFR 68.52)\n\n\n\nTRANSFLO operating procedures address the steps for each operating phase, operating limits and safety system and their functions.\n\n\n\nSpecific requirements are as follows:\n\n\n\n?    Initial start up\n\n?    Normal operations\n\n?    Temporary Operations\n\n?    Emergency Operations\n\n?    Normal Shutdown\n\n?    Start up following a turnaround or emergency shutdown\n\n?    Consequences of deviations\n\n?    Equipment inspections\n\n\n\nTransfer process work instructions were developed for this unit and are used as the basis for training employees who will be operating the system.  These procedures will be maintained at the terminal office and will be used for employee evaluation and audit purposes.  These work instructions are included in Attachment 3-3.\n\n\n\nIn addition to the transfer work instruction, the terminal operator follows established TRANSFLO procedures for the inspection of inbound railcars, inbound cargo trailers and general health, safety and environmental procedures.  Copies of these are included in Attachment 3-3\n\n\n\n\n\n3.4    Training    (40 CFR 68.54)\n\n\n\nAs required under 40 CFR 68.54, training requirements for new operators at TRANSFLO include training on operating procedures and must cover health and safety hazards, emergency operations, and safe work practices applicable to the employee normal job or function.  Refresher training is provided at least every three years.  The facility also determines that each operator has received and understands the training requirements and keeps a record of complete training for each employee with the date of the training and the method used to verify that the employee understand the subject matter.\n\n\n\nThe training program includes classroom and on job instruction with emphasis on safety and health hazards and emergency response procedures.  These materials are maintained in the terminal manager?s office.  Verification that the operators understand the materials is accomplished through written tests, verbal questioning and hands-on demonstrations.  More detailed training documentation and information is given in Attachment 3-4.\n\n\n\n3.5    Mechanical Integrity /Maintenance  (40 CFR 68.56)\n\n\n\nAs required by the regulations, TRANSFLO implements a maintenance program that includes the preventative maintenance, inspection and testing of the LPG transfer unit.  The specific required provisions are as follows:\n\n\n\n?    Written procedures- Administrative guidance\n\n?    Training\n\n?    Inspection and Testing\n\n\n\nTRANSFLO follows a maintenance program to assure system equipment integrity is maintained.\n\n\n\nTerminal personnel are responsible for level-1 maintenance on the transfer equipment that includes:\n\n\n\n?    Daily inspection of the transfer unit\n\n?    Cleaning of the unit\n\n?    Hose inspections (visual)\n\n?    Unit tire pressure\n\n?    Unit lubrication\n\n?    Unit electrical cord and plug inspection\n\n\n\nAll maintenance on the unit?s meter, pump or electrical systems are performed by he equipments supplier, RBT Inc., TRANSFLO Regional Equipment Mangers or qualified outside contractors using internal maintenance procedures specific by individual component suppliers.\n\n\n\nMaintenance and testing of the railroad tank cars and ISO containers are the responsibility of the car or container owners or leasors.\n\n\n\nPrior to start up the transfer unit at this terminal was inspected by SES, Inc. personnel and leak tested to ensure its safe operation.   All liquid hoses were replaced with LPG service hoses. \n\n\n\n3.6    Pre-Start Up Safety Review (PSSR)\n\n\n\nA Pre-start Up Safety Review will be held prior to the start of LPG operations, with the terminal operators, management and TRANFLO field personnel.  The PSSR included the following subjects:\n\n\n\n?    Review of the MSDS and hazards for propane\n\n?    Training on the work Instructions for transfer of propane \n\n?    LPG railcar and truck fittings and design\n\n?    Review of terminal EAP and emergency action for a propane release\n\n?    Transfer unit inspection and maintenance procedures\n\n?    Management of change requirements and process\n\n\n\nThe Process Safety Information was reviewed and the location of this information discussed. \n\n\n\n\n\n3.7    Management of Change\n\n\n\nNo changes to the transfer unit equipment or configuration will be allowed without approval by the Director of Operations and the Director of HS&E using the attached form.  Replacement in kind for worn or damaged equipment such as hoses, swivels, sight glass, electrical components or nitrogen hoses is permitted without MOC form submittal.\n\n\n\nThe latest Work Instructions which, document the transfer procedures and sequence, are available to all affected persons but cannot be changed without following the MOC process using the attached form.  Any changes to the Work Instructions must be approved by both the Director of Operations and the Director of HS&E.   Approval of any WI changes will be communicated to the terminal management, REM?s, MFO?s and HS&E Document Control file.  Once approved, the HS&E department will make any changes. \n\n\n\nThese requirements were discussed in the PSSR with affected parties. \n\n\n\n3.8    Compliance Audits (40 CFR 68.58)\n\n\n\nTRANSFLO is required to conduct compliance audits at least every 3 years from the date of RMP submission.  The audit must include an evaluation of the design and effectiveness of risk management program elements and a field inspection of the safety and health conditions and practices to verify that systems are effectively implemented and operational.  The compliance audits will be conducted by at least one person knowledgeable in the LPG products transfer process.  TRANSFLO will comply with the following document requirements:\n\n\n\n?    The employer must certify the compliance audits\n\n?    A written report of the findings of the audit shall be developed.\n\n?    The employer shall promptly determine and document an appropriate response to each of the findings of the audit.\n\n?    The employers shall document that any deficiencies have been corrected.\n\n?    The employer shall retain the most recent compliance audits reports.\n\n?    The compliance audits shall be made available to employees and their designated representatives.\n\n\n\nAs required, TRANSFLO will undergo an audit every 3 years.  The first audit is scheduled for November 2009.   In addition to the scheduled RMP specific audit, TRANSFLO has an active terminal operation audit system that includes a review the following:\n\n\n\n?    Terminal HS&E regulatory compliance\n\n?    Terminal employee training\n\n?    Transfer operations including compliance with Work Instructions, procedures and polices\n\n?    Terminal physical plant maintenance and documentation\n\n?    Transfer equipment inspection, maintenance and documentation.\n\n\n\nTRANSFLO Operations and HS&E personnel conduct these audits.  The Director of Operations reviews the results of these audits and items of nonconformance are the responsibility of the Manger of Field Operations and the contract operator for correction.\n\n\n\n\n\n\n\n\n\n3.9    Incident Investigation  (40 CFR 68.60)\n\n\n\nIncident investigation is the process of identifying the underlying causes of incidents and implementing steps to prevent similar events from occurring.  The RMP requires the investigation of each incident that resulted in, or could reasonable have resulted in a catastrophic release of regulated substance, employee injury or off site impact.\n\n\n\nThe specific requirements of the incident investigation are as follows:\n\n\n\n?    Initiate an investigation promptly, no later than 48 hours after the incident.\n\n?    Establish an investigation team with at least one team member knowledgeable in the transfer process.\n\n?    Summarize the investigation in a report, including:\n\no    Date of incident\n\no    Date investigation begin\n\no    Description of the incident\n\no    Factors contributing to the incident\n\no    Root cause of the incident\n\no    Any recommendations to prevent future incidents\n\n\n\nAddress and resolve the team?s finding and recommendations\n\n?    Document resolutions and corrective actions\n\n?    Review the report with affected personnel and contactors where applicable\n\n?    Retain the report for five years.\n\n\n\nTRANSFLO has established incident investigation procedures for the LPG transfer process as follows:\n\n\n\n1.    The facility maintains an updated comprehensive Emergency Action pan (EAP) for injuries, spills, fires and other credible terminal threats.  All employees are trained on the activation of the EAP and their roles.  An annual response exercise is held and includes an invitation to the local fire department to attend using the EAP.\n\n2.    All product releases are reported following the incident reporting procedures list in the EAP.\n\n3.    Upon completion of the emergency phase of the incident, a formalized incident investigation process is initiated using the documents listed in attachment 3-7.\n\n\n\nTRANSFLO holds an incident review conference call or on-site investigation meeting within 5 days of any spill or incident with employee injury, evacuation or off site consequence.  Senior operations personnel lead this call from TRANSFLO, the contract operator and other groups or agencies with significant incident involvement.\n\n\n\nThe LPG transfer process will be in operation at the Cincinnati, OH terminal by February 13, 2009.  This is a new product for this terminal but uses equipment, procedures and processes used in this terminal and the TRANSFLO network for over several years.  There have been no incidents or releases of LPG involving this equipment or process.\n\n\n\n3.10    Employee Participation\n\n\n\nTRANSFLO Terminal Services, Inc. employees and those employees of the terminal contract operators are considered employees covered by the Employee Participation program as required for OSHA 1910.119 Process Safety Management regulations.   TRANSFLO has developed an employee participation program that is available on the TRANSFLO intranet portal HS&E folder. \n\n\n\nEmployees have access to all PSI developed for this process and records of inspections and maintenance activities.   All employees are able to voice concerns over work place hazards and conditions to their supervisor, the terminal manager and TRANSFLO field personnel (MFO?s, REM?s and HS&E staff).\n\n\n\nTerminal managers, loader personnel and other interested parties are included in the PSSR prior to beginning this operation at the terminal. \n\n\n\n\n\n3.11    Hot Work, Confined Space and Lock Out/Tag Out Programs\n\n\n\nTRANSFLO maintains document policies and standards for the following high hazard operations at its terminals:\n\n?    Hot Work (including any welding or cutting operations that employ an open flame or electrical arc. \n\n?    Confined Space Entry (including any permit required confined space operations).\n\n?    Lock Out/Tag Out\n\n\n\nIn addition to the TRANSFLO standard on these topics, each contract operator has policies and procedures in place to address these activities.  Terminal managers enforce these policies and employees are trained on the procedures on a routine basis (with training documented in the employee training record). \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n3.12    Contractors\n\n\n\nOutside contractors are limited to the equipment and scope of work they are permitted to perform on the LPG transfer process.    \n\n\n\nProcess Component    Examples of Work    Qualification\n\nTransfer unit    Level I maintenance\n\n\n\n\n\n\n\nHose replacement\n\n\n\n\n\n\n\nHardware replacement\n\n\n\n\n\n\n\nCompressor repair\n\n\n\nElectrical system repair    Terminal employees following written procedures.\n\n\n\nTF-REM using replacement in kind hoses or MOC approved.\n\n\n\n\n\nTF-REM using replacement in kind equipment or MOC approved.\n\n\n\nSES Inc. only\n\n\n\nSES, Inc. approved contractor only\n\nRail tank car    Tank car inspection and testing\n\n\n\nValve repair (non-emergency)    AAR qualified tank shop or repair personnel.\n\n\n\n\n\nTrack repair    Bonding and grounding systems    Qualified track repair contractor with continuity tested by licensed electrician.\n\nHighway cargo tank    Tank inspection and qualification\n\n\n\nValve repair    Not covered by TRANSFLO operations as equipment s not TRANSFLO owned or controlled.\n\nEmergency response contractor    Tank car repair (emergency)\n\n\n\n    Must be CSX approved contractor and have OSHA trained and qualified HAZWOPER personnel.",
              "_chemicals": [
                {
                  "PrimaryKey": 67603,
                  "PreventionProgram3ID": 46347,
                  "ProcessChemicalID": 104674
                },
                {
                  "PrimaryKey": 67604,
                  "PreventionProgram3ID": 46347,
                  "ProcessChemicalID": 104675
                },
                {
                  "PrimaryKey": 67605,
                  "PreventionProgram3ID": 46347,
                  "ProcessChemicalID": 104676
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 53892,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2008-10-11 00:00:00",
    "ERTrainingDate": "2008-12-10 00:00:00",
    "CoordinatingAgencyName": "Cincinnati Fire Dept",
    "CoordinatingAgencyPhone": "5133526220",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53892,
      "SummaryText": "Executive Summary (40 CFR 68.155)\n\nBackground Data\n\nIn accordance with Title 40 of the Code of Federal Regulations, chapter 68 (40 CFR 68) promulgated by the Federal Environmental Administration (EPA), TRANSFLO Terminal Services, Inc. has prepared this Risk Management Plan (RMP) for operations involving Liquefied Petroleum Gas (LPG) at their Cincinnati, OH facility.  The TTSI terminal provides transloading services of bulk products between rail and truck transportation modes.  The Cincinnati TRANSFLO terminal has been in operation since 1990.  The terminal is located at 3601 Geringer Avenue, Cincinnati, OH.\n\nAccidental Release Prevention and Emergency Response Policy\n\nTRANSFLO is committed to protecting the health and safety of its employees, contract operators, the surrounding community and the environment; therefore it is TRANSFLO policy to maintain compliance with 40 CFR 68.\n\nStationary Sources and Regulated Substances\n\nTRANSFLO will handle liquefied petroleum gas (LPG) products at this terminal, transloading product from railroad tank cars into highway cargo trailers in quantities in excess of 8,000 gallons per cargo trailer which will exceed the 10,000 pound threshold quantity listed in 40 CFR 68, Appendix A.\n\nWorst Case Scenario\n\nAs required by 40 CFR 68 Subpart B, TRANSFLO has evaluated a worst-case release scenario for LPG products using the parameters specified by the EPA.  TRANSFLO?s worst-case release scenario is the rupture of a single railroad tank car with subsequent product release over a 10-minute period.  In developing the release parameters of the worst-case scenario, TRANSFLO has not considered any passive mitigation measures.  Using the EPA?s RMP*Comp software program, it was determined that the distance to the toxic endpoint in this scenario has the potential to result in a release with offsite consequences.  The worst-case release scenario was developed following EPA regulations and is considered to have an extremely low probability of occurren"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53892,
      "SummaryText": "ce.\n\nAlternative Release Scenario\n\nTRANSFLO also evaluated several other release scenarios considered to have a higher level probability of occurrence (although a very low probability) based upon a review of over 10 years of incident data from chemical transloading operations.  This 10 year period included the safe handling of over 500,000 rail to truck chemical transloads.  After a careful review of both the worst-case and alternative release scenarios, TRANSFLO has decided to include one alternative release scenario into the RMP document.  \n\nThe alternative release scenario identified by TRANSFLO is the failure of a product transfer hose.  In developing the parameters of Alternative Release Scenario 1, TRANSFLO considered the average response time of terminal personnel to control the release and safely shut the transfer unit down.   Using the EPA RMP*Comp software program and EPA?s RMP offsite Consequence Analysis Guidance Document, the distance to the flammable endpoint in the alternative release scenario has the potential to result in minor site consequences at a distance much less than the worst-case scenario and would largely be limited to terminal property itself.\n\nAccidental Release Prevention Program\n\nTo prevent and mitigate accidental releases of LPG products, TRANSFLO has implemented several precautionary measures:\n\n?    TRANSFLO has developed standard operating procedures (SOP?S) for the Transloading of LPG products from railcar to highway cargo tank for use by trained and qualified personnel.\n?    TRANSFLO encourages contract operator employees to voice concerns, offer suggestions and contribute to procedures, policies and processes involving this product.  Employees are expected to follow established procedures until employee driven process changes are implemented, training conducted and communicated to all affected persons.\n?    TRANSFLO conducts operational audits and inspections to insure compliance with established operating procedures, maintenance of trans"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53892,
      "SummaryText": "fer equipment and facility physical systems.\n?    A documented inspection and maintenance program for the transfer unit, railcars and cargo tanks used for this operation is in place and will be maintained for the life of this operation.  These processes include preventative maintenance of the transfer unit to maintain on-board safety and control systems.\n\nThe transfer unit has been designed and constructed to meet or exceed the requirements outlined in the National Fire Protection Association (NFPA) Liquefied Petroleum Gas (LPG) Code (2008 ed.).  A review of the National Fire Code finds this operation is in compliance with all requirements of the code.\n\nTRANSFLO will conduct initial familiarization sessions with the local emergency responders as part of the terminals emergency action plan (EAP).   In addition, the following agencies inspect the TRANSFLO terminal on a regular basis:\n\nU.S. Department of Transportation- Federal Railroad Administration- Hazardous Materials Inspectors  \n\nCincinnati Fire Division\n\n\n\n\nFive- Year Accident History\n\nTRANSFLO has not handled LPG at this facility on a routine basis during the past five years.  There are no accidents or releases to report.\n\nEmergency Response Program\n\nTRANSFLO and the contract operator have documented emergency response plans and procedures in place at this facility to respond to and safety mitigates any release or accident involving LPG products.  Included in the emergency response plan are measures to be taken internally by TRANSFLO contract operators to control the release, if possible, and to make initial notification to local responders and to TRANSFLO headquarters.\n\nOperator personnel at the terminal are trained to the Hazardous Materials Operations level as outlined in 29 CFR 1910.120 Hazardous Waste Operations and Emergency Response.  These employees may also perform activities under the specialist employee definition as defined by 1910.120.  These personnel receive annual training on activation of the faci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53892,
      "SummaryText": "lity emergency action plan, their roles in an emergency and accident notification procedures.\n\nTo assure that the local municipal response agencies are familiar with TRANSFLO emergency response procedures and copies of the Emergency Action plan (EAP) have been shared with and reviewed by local responders.  In the event of a significant release of LPG products that involve off site populations, these populations will be notified through the LEPC.\n\nPlanned Changes to Improve Safety\n\nTRANSFLO and its contract operators have implemented a continuous training program for employees and preventative maintenance procedures for the transfer unit to ensure a high level of safety performance and regulatory compliance.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRMP Certification Statement\n\nTo the best of the undersigned?s knowledge, information and belief formed after reasonable inquiry, the information submitted in the RMP is true, accurate and complete.\n\n\n\n_____________________________         ___Jan M. Barnes________________\nSignature                      Print Name\n\n\nDirector - Health Safety and Environmental_                                            _______\nTitle                                 Date"
    }
  ]
}