{
  "FacilityID": 53918,
  "FacilityName": "C&S Wholesale Grocers, Inc. - West Sacramento",
  "FacilityStr1": "3777 Channel Drive",
  "FacilityStr2": null,
  "FacilityCity": "West Sacramento",
  "FacilityState": "CA",
  "FacilityZipCode": "95619",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06113",
  "LEPC": null,
  "FacilityLatDecDegs": "38.562599",
  "FacilityLongDecDegs": "-121.569344",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cswg.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "C&S Wholesale Grocers, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "C&S Wholesale Grocers, Inc.",
  "OperatorStr1": "7 Corporate Drive",
  "OperatorStr2": null,
  "OperatorCity": "Keene",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03431",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bryan Granger",
  "RMPTitle": "Vice President of Compliance-Legal",
  "FTE": 450,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000187898",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-12-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-03-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-03-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-02-18 00:00:00",
  "DeRegistrationEffectiveDate": "2009-09-30 00:00:00",
  "AnniversaryDate": "2014-03-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 78626,
      "AltID": null,
      "FacilityID": 53918,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 80539,
          "ProcessID": 78626,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 104731,
          "ProcessID": 78626,
          "ChemicalID": 56,
          "Quantity": 11300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 604731,
          "ProcessID": 78626,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 53918,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nThe attached Registration contains a summary of the C&S Wholesale Grocers, Inc. ? West Sacramento administrative and operational programs to prevent ammonia-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is anhydrous ammonia.  The following Data Elements (RMP*Submit) sections are attached:\n\na. Section 1: Registration Information\nb. Section 2: Toxics - Worst Case Release\nc. Section 3: Toxics - Alternative Release\nd. Section 4: Flammables - Worst Case Release (NOT APPLICABLE)\ne. Section 5: Flammables - Alternative Release (NOT APPLICABLE)\nf. Section 6: Five Year Accident History\ng. Section 7: Prevention Program 3 Component \nh. Section 8: Prevention Program 2 Component (NOT APPLICABLE)\ni. Section 9: Emergency Response Component\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nC&S Wholesale Grocers, Inc. ? West Sacramento is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the process solution equipment at the facility. \n\nC&S Wholesale Grocers, Inc. ? West Sacramento?s senior management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. C&S Wholesale Grocers, Inc. ? West Sacramento?s safety and environmental policies as they relate to the ammonia refrigeration system are administered by the Regional Maintenance Manager, who conducts inspections of the facility to ensure compliance.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe system at 3777 Channel Drive in West Sacramento, California was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53918,
      "SummaryText": "at the time of construction.  \n\nThe ammonia refrigeration system is a closed system that cycles the refrigerant from liquid to gas and back again.  The system, consisting of vessels, piping, valves, and process equipment, cycles 12,600 pounds of ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for dock operations, cooler and freezer storage.  The majority of the system is located in the engine room including vessels and compressors.  The condensers are mounted on the roof, and the evaporators are located in their respective cold areas.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe C&S Wholesale Grocers, Inc. ? West Sacramento ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with Cal/OSHA's Process Safety Management regulation.  The facility conducts maintenance and any necessary minor repairs in house, but an outside contractor is hired for major repairs.\n\nThe facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code, which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors in the engine room as well as sensors near the evaporators, and automatic shut down systems.  In addition, the majority of the ammonia is maintained inside the engine room and just outside of the engine room (condensers).  All pressure vessels are equipped with pressure relief valves that are commonly piped to a relief header.\n\nIn addition to the Uniform Mechanical Code, C&S Wholesale Grocers, Inc. ? West Sacramento has developed a preventive maintenance program to complete regularly scheduled inspectio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53918,
      "SummaryText": "ns and tests of the ammonia refrigeration system as well as repairs as needed to process equipment.\n\nEMERGENCY ACTION PLAN\n\nThe C&S Wholesale Grocers, Inc. ? West Sacramento facility has an emergency response plan in effect.  The Emergency Action Plan (Plan) has been developed by C&S Wholesale Grocers, Inc. ? West Sacramento and is included in the Emergency Planning and Response section of the PSM/RMP/CalARP document which is maintained at the facility.\n\n  1.) To save lives.\n  2.) To minimize and avoid injuries.\n  3.) To protect the environment.\n  4.) To minimize property damage.\n\nThe C&S Wholesale Grocers, Inc. ? West Sacramento facility maintains a safety committee whose members include the designated incident commander for the facility and the maintenance department at a minimum.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan is reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations, as well as to incorporate facility changes.\n\nThe C&S Wholesale Grocers, Inc. ? West Sacramento is non-responding and the facility plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no releases of ammonia that exceeded the reportable quantity of 100 pounds.  In addition, there have been no injuries resulting from an ammonia release.   [CCR Title 8, ? 5189(e)(2)(G)]\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazards Analysis Revalidation (performed on July 1, 2008), including a Hazard and Operability (HAZOP) study and a Facility Inspection, provided mitigation measures to improve safety at the C&S Wholesale Grocers, Inc. ? West Sacramento facility located at 3777 Channel Drive in West Sac"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53918,
      "SummaryText": "ramento, California. The C&S Wholesale Grocers, Inc. ? West Sacramento safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n1. Continue to train all employees in the facility safety plan/programs.\n\n2. Continue to have employee involvement in safety plan development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\nA Three Year Compliance Audit was conducted for the facility on June 17, 2008 to determine the necessary updates for the old PSM/RMP program that was in place at the facility.  The Audit determined that the facility should update the entire program.  The new PSM/RMP/CalARP is in place at the facility and is dated December 2008.\n\nDATA ELEMENT NOTES\n\nItem numbers 7.8a, 7.8b, 7.9a, 7.9b, and 7.10 have been intentionally left blank.  These items (Compliance Audits, Incident Investigation, etc.) have been developed for C&S Wholesale Grocers, Inc. ? West Sacramento and will be implemented when required.  In addition, the Emergency Action Plan outlines notification procedures and reporting procedures in the event of an emergency, which could include fire, ammonia release, blackout, and earthquake."
    }
  ]
}