{
  "FacilityID": 53922,
  "FacilityName": "FAG Bearings Corporation",
  "FacilityStr1": "3900 Rangeline Road",
  "FacilityStr2": null,
  "FacilityCity": "Joplin",
  "FacilityState": "MO",
  "FacilityZipCode": "64804",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29145",
  "LEPC": "Newton County LEPC",
  "FacilityLatDecDegs": "37.045833",
  "FacilityLongDecDegs": "-094.465556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "NW",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 48533657,
  "ParentCompanyName": "Scheaffler Group USA, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Fag Bearings Corporation",
  "OperatorStr1": "3900 Rangeline Road",
  "OperatorStr2": null,
  "OperatorCity": "Joplin",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64804",
  "OperatorZipCodeExt": null,
  "FTE": 320,
  "OtherEPAFacilityID": "64804FGBRN3900R",
  "EPAFacilityID": "100000206127",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-30 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-03-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-03-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-03-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2010-03-23 00:00:00",
  "DeRegistrationEffectiveDate": "2010-03-11 00:00:00",
  "AnniversaryDate": "2014-03-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 37.046299,
  "FRS_Long": -94.470711,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 78634,
      "AltID": "Heat Treat",
      "FacilityID": 53922,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 104740,
          "ProcessID": 78634,
          "ChemicalID": 98,
          "Quantity": 13440.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 80547,
          "ProcessID": 78634,
          "NAICSCode": "332991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 46377,
              "Process_NAICS_ID": 80547,
              "SafetyReviewDate": "2009-01-09 00:00:00",
              "PHA_Date": "2009-01-09 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-02-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Purge system",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Furnace Malfunction",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-01-09 00:00:00",
              "TrainingReviewDate": "2009-01-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-02-01 00:00:00",
              "EquipmentInspectionDate": "2009-01-13 00:00:00",
              "EquipmentTested": "Furnace",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-01-09 00:00:00",
              "PreStartupReviewDate": "2009-01-13 00:00:00",
              "ComplianceAuditDate": "2009-01-12 00:00:00",
              "AuditCompletionDate": "2009-02-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-01-09 00:00:00",
              "HotWorkPermitReviewDate": "2009-01-09 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2009-01-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 67644,
                  "PreventionProgram3ID": 46377,
                  "ProcessChemicalID": 104740
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 53922,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-01-09 00:00:00",
    "ERTrainingDate": "2008-05-09 00:00:00",
    "CoordinatingAgencyName": "Joplin Fire",
    "CoordinatingAgencyPhone": "4176230403",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 53922,
      "SummaryText": "nstrations are used to help impart knowledge\nto the employees.  Tests and demonstrations are used to verify that an employee understands the\ntraining material before the employee can work on the Heat Treat system involving Propane.\n\n\n 4.1.5  Mechanical Integrity\nThe Heat Treat system and equipment is maintained to help prevent equipment failures that\ncould endanger employees and contractors, the public, or the environment. The mechanical integrity\n(preventive maintenance) program includes an inspection and testing program to help identify\nequipment deterioration and damage well before the equipment can fail.\n\n 4.1.6  Management of Change\nThe Management of Change procedure is a written procedure that requires the review and approval\nof all proposed changes to the Heat Treat system.  This includes chemicals, equipment, technology, and \nprocedures to help ensure that the change does not negatively affect safe operations.  All changes other\n than replacement-in-kind (e.g., replacing a valve with an identical valve) must be approved through the\n Management of Change procedure.  This helps to ensure that inadvertent consequences of changes are \nprevented, safety consequences of changes are addressed, affected process safety information and \nprocedures are updated, and affected employees are notified of the changes.\n\n4.1.7  Pre-startup Safety Review\nSafety reviews of new or modified processes are performed before placing them into service to help\nensure their safe operation.  This review confirms that:\n  ¿  construction activities and equipment are in accordance with design specifications;\n  ¿  adequate safety, operating, maintenance, and emergency procedures are in place;\n  ¿  employee training has been completed; and\n  ¿  for a covered process (regulated process), a Process Hazard Analysis has been performed if\n  the process is new, or management of change requirements have been completed if an existing\n  process has been modified.\n\n\n 4.1.8    Compliance Audit\nOne of t"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 53922,
      "SummaryText": "EXECUTIVE SUMMARY\nFAG BEARINGS CORPORATION\nJoplin, Missouri\nNewton County\n\nOVERVIEW\nFAG Bearings Corporation is committed to operating in a manner that is safe for our employees,\ncontractors, the surrounding community, and the environment.  To meet this commitment, we have\nestablished systems to ensure safe operation of plant processes, which includes the safe and proper\nhandling of hazardous substances at the plant.  One component of these systems is a Risk\nManagement Program (RMP), which manages the risks involved with using hazardous substances. \nFAG's RMP complies with the requirements of the Environmental Protection Agency's\n(EPA's) regulation 40 CFR  68, Accidental Release Prevention Requirements:  Risk Management\nPrograms.  This regulation is also referred to as the RMP rule.  One of the requirements of the\nRMP rule is to submit an executive summary in the Risk Management Plan  describing\nthe RMP at our facility.  This document is intended to satisfy the executive summary\nrequirement of the RMP rule and to provide a description of the RMP.  \n\nFAG Bearings Corporation in Joplin, Mo. has a heat treat operation which utilizes propane that will be above the threshold quantity limit of 10,000 pounds.  This RMP along with the PSM plan presents a comprehensive program designed to reduce the potential for unwanted releases, fires, or catastrophic explosions of highly flammable chemicals.  The Propane is used as a fuel and atmospheric control for the Heat Treat system.  Design engineering led to the facility having four individual 1,000 gallon tanks connected and stored together to provide the Propane into Heat Treat.\nFAG Bearings / Joplin, Mo.  Risk Management Program consists of three elements:\n\n  1. A hazard assessment to identify (a) the potential offsite consequences of hypothetical accidental\n  releases and (b) accidents that have occurred during the last 5 years associated with the\n  substances regulated by the RMP rule (see Sections 3 and 5 of this executive"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 53922,
      "SummaryText": "summary);\n  2. A prevention program to help maintain and safely operate processes containing significant\n  quantities of substances regulated by the RMP rule (see Section 4 of this executive summary);\n  and\n  3. An emergency response program to provide guidance to the plant for responding to accidental\n  releases of regulated substances from processes covered by the RMP rule (see Section 6 of this\n  executive summary).\n\nAlthough the RMP helps ensure that FAG¿s RMP covered system is maintained and operated in a safe \nmanner,  it is only one component of the plant's overall safety program.  In fact, a comprehensive safety \nprogram exists that establishes many levels of safeguards against accidents.\n\nCONSIDERATIONS\nPreventing releases of the regulated substances used.\nWhen a regulated substance is used, the equipment that contains it is carefully designed, built, and\noperated to reduce the likelihood of an accidental release.  All applicable federal, state, corporate,\nand industry standards are strictly adhered to in the design, construction, and operation of the\nequipment.\n\nLimiting damage from a release or fire.\nFAG's main objective is to prevent the accidental release or fire / explosion involving Propane from \noccurring.  In the unlikely event of a release, employees are trained to recognize incidents, quickly \nassess the severity of an incident, and respond to mitigate the incident.  Coordination with the county's \nLocal Emergency Planning Commission (LEPC) is crucial to protect the health and safety of the \nsurrounding community.  Emergency planning efforts have been performed and will continue with the \nlocal officials with Newton  County Emergency Services.  In short, actions have been taken to ensure \nappropriate plans are in place to minimize the impact of an incident on our employees and the \ncommunity.\nFAG Bearings safety program consists of a number of elements, many of which are beyond what is\nrequired by the RMP rule.  This RMP executive summary is writ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 53922,
      "SummaryText": "ten to describe only those parts\nof the safety program required by the RMP rule for FAG Bearings.\n\nELEMENTS\n 1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nFAG is committed to the safety of its employees and contractors, the public, and to the protection\nof the environment.  All appropriate steps have been taken to prevent an incident involving Propane.  \nThese steps include (a) training programs for personnel, (b) programs to help ensure safety in the \ndesign, installation, operation, and maintenance of our process, and (c) programs to evaluate the \nhazards of our processes.\n\nIn the event of an accidental release, FAG will be prepared to respond in a manner that will be\nsafe for our employees and will minimize any injury to the public and the environment.  The plant\nhas a trained employees how to properly respond in the event of an incident. \n\n2.   REGULATED SUBSTANCE USED AT FAG Bearings / Joplin, MO.\nFAG Bearings has one substance (Propane) in sufficient quantity to be regulated by the RMP rule.  The \nPropane used at this facility is covered by the RMP rule.  As stated  previously, Propane will be used as a \n fuel and for atmospheric control for the heat treat process.\n\n3.   OFFSITE CONSEQUENCE ANALYSIS\n\n\tNo Description in summary per RMP requirements.\n\n4.  ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC\n   PREVENTION STEPS\nFAG Bearings / Joplin, MO.  has developed a comprehensive prevention program that complies with the\n Occupational Safety and Health Administration's (OSHA's) Process Safety Management (PSM) \nRegulation found in 29 CFR 1910.119.  For FAG Bearings, the prevention program requirements of EPA's \nRMP rule are also satisfied by this PSM program.  The following sections briefly describe the elements of \nthe prevention program that address the RMP rule requirements.\n\n 4.1  Prevention Program\nThe accident prevention program for Propane consists of the following 12 elements:\n\n 4.1.1  Process Safety Information\nA number of t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 53922,
      "SummaryText": "echnical documents are maintained and are readily available at the plant, including an\nemergency preparedness plan (called the Integrated Contingency Plan, or ICP), to help ensure that\nfacility and local emergency responders are aware of the hazards.  The PSI include the MSDS for Propane \nthat gives chemical, physical, and other hazards.  This process safety information is available to our \nemployees and contractors, as well.\n\n 4.1.2  Process Hazard Analysis\nProcess Hazard Analysis of the Heat Treat process involving Propane was performed and will be\n periodically updated to identify process hazards, as well as to establish recommendations that will\n improve the safe operation of the RMP covered process.  FAG established a group that  systematically \naddressed the hazards associated with operation of Heat Treat associated with Propane.  The team then \nprepared a written report describing the results of the analysis, including a list of recommendations.  \nResponsibility for resolving the recommendations was assigned to plant personnel, and, when \nappropriate, changes to enhance the safety of the system were implemented.  This analysis is revised at \nleast every 5 years to ensure it is current.\n\n 4.1.3  Operating Procedures \nFAG Bearings engineers, EHS, maintenance, operators, and management worked together to develop\n and maintain operating procedures to define how tasks related to the Heat Treat involving Propane \nshould be safely performed.  The operating procedures are used to train employees and serve as \nreference guides for appropriate actions to take during both normal operations and process upsets.\n\n 4.1.4    Training\nEmployees are trained to safely and effectively perform their assigned tasks.  The training program\nincludes both initial and refresher training that covers (a) a general overview of the system, (b) the\nproperties and hazards of Propane, and (c) a detailed review of the operating procedures\nand safe work practices.  Classroom training and demo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 53922,
      "SummaryText": "he cornerstones of an effective prevention program is a regular, thorough assessment.  A\nprogram is in place to perform compliance audits of our RMP-covered processes every 3 years to\nbe certain the prevention program is effectively addressing the safety issues of the process.  These\naudits are performed by a team that includes personnel knowledgeable in the Heat Treat system, the\nRMP and PSM requirements, and safety involved with Propane.  This will help ensure safe operation of \nthe Heat Treat system.  The results of the audit are documented, recommendations are resolved, and \nappropriate enhancements to the prevention program are implemented.\n\n 4.1.9  Incident Investigation\nA program is in place to investigate any incidents or near misses that could reasonably result in\nserious injury to personnel, the public, or the environment so that similar accidents can be prevented\nin the future.  The requirements to identify and report any incident requiring investigation are\ncommunicated to employees.  In the event of an incident, an investigation team would be assembled,\nand the investigation would be initiated as soon as possible, but always within 48 hours of the\nincident.  The results of the investigation are documented, recommendations are resolved, and\nappropriate process improvements are implemented.\n\n 4.1.10 Employee Participation\nA written employee participation program exists for our RMP covered process to help ensure that\nthe safety concerns of our employees are addressed.  This is completed within our PSM Program.  We \nencourage active participation of personnel in the prevention program activities of all processes at the\n plant.  \n\n4.1.11 Hot Work Permits\nA Hot Work Permit Program exists, which is intended to control spark or flame-producing activities\nthat could result in fires or explosions at Wateree Station.  This program conforms to OSHA\nrequirements.  Training on hot work activities and on the requirements of the hot work permit\nprogram is included in o"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 53922,
      "SummaryText": "ur new employee orientation.\n\n4.1.12   Contractors\nA program is in place to help ensure that contractor activities related to the RMP covered Heat Treat \nsystem involving Propane are performed in a safe manner.  Contractor supervisors are informed of the \nhazards of the processes on which they and their employees will work, our safe work practices, and our \nemergency response procedures.  Contractors are required to ensure that training has been performed \nfor each of their employees before he/she performs work at the plant.  Routine verification that this \ntraining has been provided is performed.\n\n4.2   Chemical-specific Prevention Steps\nIn addition to the required prevention program elements, safety features specific to the Heat Treat \nSystem involving Propane have been implemented.  Manual shutoff valves, alarms on the equipment,\n and other systems have been provided.\n\n5.   FIVE-YEAR ACCIDENT HISTORY\nThere have been no recordable releases or incidents involving Propane within the last five years.  \n\n\n\n\n6.   EMERGENCY RESPONSE PROGRAMS\nFAG's Emergency Response Team personnel will respond to an incident within the Heat Treat system \ninvolving Propane.  The Integrated Contingency Plan (ICP) has been developed to help facilitate the \nevacuation of employees and to ensure the safety of FAG Bearings and local emergency responders who \ncould be called on to respond to an incident.  \nThe ICP addresses:\n  ¿  informing local emergency responders about incidents that could reasonably result in\n  offsite consequences;\n  ¿  providing emergency medical assistance;\n  ¿  obtaining outside assistance to control and contain incidents;\n  and\n  ¿  plan review and upkeep.\n\nEmployees are trained to recognize and report known, or even perceived, emergency situations. \nEmployees and contractors are trained in evacuation procedures.  The ICP complies with other federal \ncontingency plan regulations [i.e., OSHA regulation 29 CFR 1910.38(a) and 1910.120(q)]. Hazardous \nmaterial inventory h"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 53922,
      "SummaryText": "as been provided to the LEPC and local fire department, as required by the \nEmergency Planning and Community Right-To-Know Act.  \n\n7.   PLANNED CHANGES TO IMPROVE SAFETY\nFAG Bearings is committed to continuous improvement of the safety process using recommendations\ndeveloped through the prevention program and a program soliciting safety suggestions from our\nemployees.  Standard operating and safety procedures for the RMP covered process are reviewed\nperiodically to ensure that they are correct, and training is provided to employees on a wide variety\nof safety and operating topics."
    }
  ]
}