{
  "FacilityID": 5422,
  "FacilityName": "Allied Frozen Storage, Inc.",
  "FacilityStr1": "2501 Broadway",
  "FacilityStr2": null,
  "FacilityCity": "Cheektowaga",
  "FacilityState": "NY",
  "FacilityZipCode": "14227",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36029",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "42.900472",
  "FacilityLongDecDegs": "-78.783667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": "www.alliedfrozenstorage.com",
  "FacilityEmailAddress": "allied@eznet.net",
  "FacilityDUNS": 114181340,
  "ParentCompanyName": "Allied Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Charles Pecorrela",
  "OperatorStr1": "250 State Street",
  "OperatorStr2": null,
  "OperatorCity": "Brockport",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14420",
  "OperatorZipCodeExt": null,
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000068231",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-01 00:00:00",
  "SafetyInspectionBy": "Kemper Insurance Co.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-06-26 00:00:00",
  "DeRegistrationEffectiveDate": "2019-06-17 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 42.90099,
  "FRS_Long": -78.78006,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6413,
      "AltID": "ammonia(anhydrous)",
      "FacilityID": 5422,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7008,
          "ProcessID": 6413,
          "ChemicalID": 56,
          "Quantity": 14215.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6569,
          "ProcessID": 6413,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2788,
              "Process_NAICS_ID": 6569,
              "SafetyReviewDate": "1999-04-01 00:00:00",
              "PHA_Date": "2000-01-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1995-02-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "new computer monitoring system",
              "OpProceduresReviewDate": "1999-06-07 00:00:00",
              "TrainingReviewDate": "1999-06-11 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-08 00:00:00",
              "EquipmentInspectionDate": "1999-04-22 00:00:00",
              "EquipmentTested": "All 4 Frick screw compressors were tested.  All process equipment were last inspected/tested on 5/3/97 by Mollenberg-Betz, Inc.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-09 00:00:00",
              "PreStartupReviewDate": "1999-06-09 00:00:00",
              "ComplianceAuditDate": "1996-01-01 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-07 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-07 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3178,
                  "PreventionProgram3ID": 2788,
                  "ProcessChemicalID": 7008
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5422,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-09 00:00:00",
    "ERTrainingDate": "1995-06-01 00:00:00",
    "CoordinatingAgencyName": "Forks Fire Department",
    "CoordinatingAgencyPhone": "7166838688",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5422,
      "SummaryText": "Allied Frozen Storage, Inc. is a 217,000 square foot storage facility located on Broadway and Allied Drive in Cheektowaga, New York.  We store frozen, perishable cooler, and dry products for many Western New York companies, as well as out of state and Canadian companies.  We handle many customer endpoint shipments for our storage clients.  We store the majority of the product in pallet racking, utilizing all available space to its fullest.  Our facility consists of 117,000 square feet of freezer space, 30,470 square feet of cooler space, and 69,530 square feet of dry storage, office and dock space.\n\nThe refrigeration system or process that we use for our freezers and coolers is a single stage ammonia system containing approximately 14,200 pounds of anhydrous ammonia.  This ammonia is used in a compression and evaporation cycle.\n\nAnhydrous ammonia is considered to be a toxic chemical and has several health hazards associated with it.  Ammonia, when in a liquid form, can cause severe burns if contact is made with the skin or eyes.  Ammonia vapors will cause irritation to the eyes and lungs with significant injuries occuring with overexposure to the same.  Other skin and respiratory diseases will be aggrevated by exposure to ammonia.  Anhydrous ammonia is a colorless gas, when in that state, and has a very pungent odor.  When released, in a liquid state, ammonia will evaporate much quicker than water.\n\nOur refrigeration process utilizes 4 Frick screw compressors to maintain temperature.  Each unit can be used individually while the other compressors may be used as 100% backup.  Compressor discharge pressure and system condensing pressure is maintained through the use of two (2) Imeco roof top condensers.  The entire system is monitored by Upstate Electrical Technologies, Inc. with critical point sensors tied into our ADT Security System.\n\nThe Upstate Electrical Technologies Refrigeration Monitoring and Control System is state of the art and was just upgraded in June"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5422,
      "SummaryText": "of 1999.  The system monitors and controls the following:\n\nControl of Compressors- \n\n                 - Frick Compressors (4)\n\nSequencing of two (2) Evaporative Condensers-\n\n                 - Fans and Pumps\n                 - Make-up Water\n\nVessel Control\n\n                 - High Pressure Receiver\n                 - Control Pressure Receiver\n                 - Accumulator\n                 - Dump Tanks (3)\n\nAmmonia Detection Sensor Monitoring (12)\n\nRefrigeration Safety Shutdowns\n\nEmergency Shutdown Station\n\nAir Handling Units (19)\n\nSystem History Trending on all temperatures, pressures, and levels\n\nField Devices\n\n                 - Temperature Transmitters\n                 - Pressure Transducers\n                                    - Condenser Discharge Pressure\n                                    - Condenser Suction Pressure\n\nVessel Level Floats/Level Indicators\n\nCompressor Room Monitoring and Control\n\n                 - System Pressure\n                 - Compressors\n                 - Evaporative Condenser System\n                 - High Pressure Receiver\n                 - Control Pressure Receiver\n                 - Accumulator\n                 - Dump Tanks\n                 - Air Handling Units\n                 - Electrical Meter Pulse\n\nIf any monitoring or control point within the refrigeration system reaches levels outside normal operating specifications, the entire refrigeration system is automatically shut down.  The shut down triggers an alarm through our ADT System and local authorities and management of Allied are dispatched to the facility.\n\nCurrently, Allied Frozen Storage has a maintenance mechanic on staff that handles daily inspections and physical monitoring of the ammonia refrigeration system.  The maintenance mechanic works with a local refrigeration company,  Mollenberg/Betz, when repairs are required on the system.  Mollenberg/Betz is also contracted to perform periodic preventative maintenance and system inspections and submitting management repo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5422,
      "SummaryText": "rts on the system.  Mollenberg/Betz also monitors our system through an offsite dial into our computer monitoring and control system.  Mollenberg/Betz is an outstanding service company and does a tremendous job of responding to our needs.  However, utilizing a 3rd party for the above service is not only costly, but restricted to dispatch calls to our site as needed.  Allied Frozen Storage has a concern about the time lag of dispatching to our site, plus not having onsite personnel capable of handling major repairs to the system.\n\nAllied Frozen Storage is in the process of upgrading its on site physical monitoring and maintenance of the refrigeration system.  A corporate refrigeration engineer position will be filled and based at our facility in Cheektowaga, New York.  The refrigeration engineer will be responsible for daily inspections, control and monitoring, repairs and maintenance and training and directing our Emergency Response Team.  With this addition to our staff, virtually all refrigeration maintenance, repairs, monitoring and Emergency Response situations will be handled in house with Allied Frozen Storage personnel.\n\nAllied Frozen Storage, Inc. has utilized two (2) specific release scenarios in our RMP report.  Both the worst case and alternative case release scenarios were considered to occur during our hours in which the facility is unmanned.  These hours are from Saturday afternoon until 6 A.M. Monday morning, as well as major holidays.\n\nOur worst case release scenario uses the largest of our process vessels as a model.  Our process includes a controlled pressure receiver that could, at times, contain about half of our operating anhydrous ammonia.  This receiver, in the unlikelyhood of a rupture, could release all 14,200 lbs. of anhydrous ammonia into our engine room and subsequently into the atmosphere.  Ammonia, when stored as a liquid under pressure, is totally released within a ten (10) minute period.  We considered our building as mitigation"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5422,
      "SummaryText": ", since the receiver is contained within the facility, to slow the release into the atmosphere.  This scenario could have an offsite impact of over a one (1) mile radius.  Wind direction, wind speed, ambient temperature/humidity all play a part in how much of an impact it would have in our community.  Again, keeping in mind that our facility could be manned during such a release, we have to consider the ability of our actions in reponse and containment of any such incident.\n\nAllied Frozen Storage, Inc. has considered an alternative release that could be more likely to occur but still unlikely due to our daily inspections.  Our process includes two (2) evaporative condensers used to cool the ammonia gas after it has cycled through the system.  These condensers are mounted on the roof of our facility.  We modeled a possible break in an evaporative coil containing ammonia gas.  An accidental release in this scenario would be immediate into the atmosphere.  The offsite consequence has a radius of approximately .10 miles.  This endpoint distance is of course, effected by atmosphere conditions and may be slightly greater or reduced.  Our ability to respond and shutdown this part of the process is greater because of the estimated release rate of 2.4 pounds per minute.  The distance to an endpoint was not increased, however, in the event of a prolonged, undetected release.  We have facility appointed emergency responders within 5 minutes of our facility, also increasing the likelyhood of reducing offsite consequences.\n\nAllied Frozen Storage is actively participating in safety meetings and training to maintain, as well as being proactive in the changing regulations facing these times.  We have learned from the mistakes of others. we know that being involved and concerned with both our employees and the community is of the utmost priority.  Members of both our management team and union employees participate in hands on training.\n\nWe have our own Emergency Response Program and"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5422,
      "SummaryText": "plan to respond to accidental releases of toxic chemicals in our facility.  The response team consists of 5 people who have all successfully completed a 24 hour hazardous materials technician program.  We coordinate our program with Forks Fire Co. and drill twice yearly.  Our emergency response plan is onsite and reviewed regularly.  Allied's program consists of step-by-step procedures in notifying the proper authorities and coordination of emergency response proceedures with local responders.  Most members of our management team are involved in aspects of this plan.  We refresh our technical training once yearly with an eight (8) hour refresher course.  We utilize standardized forms and notes for documenting aspects of an emergency response situation.  Our program meets our operational needs and currently has not been called into action.  We rely on Forks Fire Co. for our first aid needs and do not require our employees to respond to possible injuries that may pose a threat of contamination due to blood-borne pathogens.  All members of the emergency response team have 24 hour emergency numbers to be contacted for immediate response to a release.  We are prepared with the necessary equipment to respond quickly and responsibly to an inside release.  However, much of our efforts will be coordinated with local emergency responders to effectively maintain any environmental impact that a large release may cause."
    }
  ]
}