{
  "FacilityID": 54417,
  "FacilityName": "ANNISTON ARMY DEPOT",
  "FacilityStr1": "7 FRANKFORD AVENUE",
  "FacilityStr2": null,
  "FacilityCity": "ANNISTON",
  "FacilityState": "AL",
  "FacilityZipCode": "36201",
  "Facility4DigitZipExt": "4199",
  "FacilityCountyFIPS": "01015",
  "LEPC": "Calhoun County LEPC",
  "FacilityLatDecDegs": "33.624000",
  "FacilityLongDecDegs": "-085.968000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "WWW.ANAD.ARMY.MIL",
  "FacilityEmailAddress": "AMSTA-AN-CO@ANAD.ARMY.MIL",
  "FacilityDUNS": null,
  "ParentCompanyName": "U.S. DEPARTMENT OF DEFENSE",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "COL. S. B. KELLER, COMMANDER",
  "OperatorStr1": "7 FRANKFORD AVENUE",
  "OperatorStr2": null,
  "OperatorCity": "ANNISTON",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36201",
  "OperatorZipCodeExt": "4199",
  "FTE": 7000,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000044828",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "301-0023",
  "SafetyInspectionDate": "2008-11-20 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "RMP UPDATE JUNE 2009",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-07-28 00:00:00",
  "DeRegistrationEffectiveDate": "2015-02-17 00:00:00",
  "AnniversaryDate": "2014-06-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 33.659439,
  "FRS_Long": -85.969439,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "5000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79435,
      "AltID": "IGLOO K-701",
      "FacilityID": 54417,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 105988,
          "ProcessID": 79435,
          "ChemicalID": 58,
          "Quantity": 35000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 81369,
          "ProcessID": 79435,
          "NAICSCode": "49319",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 81370,
          "ProcessID": 79435,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 79436,
      "AltID": "IGLOO K-1001",
      "FacilityID": 54417,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 105989,
          "ProcessID": 79436,
          "ChemicalID": 58,
          "Quantity": 31000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 81371,
          "ProcessID": 79436,
          "NAICSCode": "49319",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 81372,
          "ProcessID": 79436,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 54417,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-06-25 00:00:00",
    "ERTrainingDate": "2009-03-25 00:00:00",
    "CoordinatingAgencyName": "CALHOUN COUNTY EMERG. MGMT. AGENCY",
    "CoordinatingAgencyPhone": "2564350540",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54417,
      "SummaryText": "Executive Summary\r\n1. Introduction\r\nThe Anniston Army Depot (ANAD) has prepared a Risk Management Plan (RMP), including an executive summary, for the warehousing, storage, and preventive maintenance of the Lance Missile Motor Assemblies (MMAs) that contain two liquid propellants, which are classified as toxic chemicals by the U.S. Environmental Protection Agency (EPA). MMAs are stored in Stradley-type earth-covered magazines (ECMs), referred to as igloos. The igloos are concrete-reinforced, earth-covered structures. Since the initial RMP submission on 16 June 1999, the number of MMAs stored at ANAD has decreased, so that 1,1-dimethylhydrazine is no longer present in quantities above the RMProgram rule applicability threshold of 15,000 pounds. The RMP, along with the Executive Summary, complies with EPA's Chemical Accident Prevention Provisions, under Section 112 (r) of the Clean Air Act Amendments (CAAA) of 1990, codified in 40 Code of Federal Regulations (CFR) Part 68.\r\n2. Accidental Release Prevention and Emergency Response Policies\r\nANAD¿s accidental release prevention and emergency response policies comply with the EPA and Occupational Safety and Health Administration (OSHA) requirements. ANAD personnel who work with the MMAs are thoroughly trained in the aspects of safe handling, preventive maintenance, accident prevention, and emergency response actions, as required by the Department of the Army (DoA) and U.S. Department of Defense (DoD) standards, and EPA and OSHA regulations. ANAD personnel are provided with state-of-the art equipment to perform their duties. Specific handling, preventive maintenance, and emergency response procedures have been developed for the safe handling and storage of MMAs that contain the two toxic chemicals. \r\nANAD has coordinated emergency response with the Calhoun County Local Emergency Planning Committee (LEPC). The Fire and Emergency Services Division of ANAD is staffed around the clock with trained firefighter and emergency res"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54417,
      "SummaryText": "ponse medical personnel and is fully equipped to respond to emergencies. Additionally, ANAD has agreements with the local fire departments and medical treatment facilities to offer assistance upon request.\r\nANAD has an excellent accident-free record of MMA storage and maintenance during the last five years. \r\n3. Stationary Source and Regulated Substances Information\r\n3.1 General Process Description: ANAD stores MMAs for the purpose of transporting them to other locations for productive use. Each MMA has two separate cylinders, each containing a liquid propellant. The two liquid propellants are inhibited red fuming nitric acid and unsymmetrical dimethylhydrazine. The two liquid propellant cylinders are encased in the outer airtight missile motor case, which provides secondary containment. The liquid propellants ignite when mixed in a controlled fashion and provide propulsion to the missile. \r\n3.2 RMP Program Level: The RMP threshold quantity for nitric acid 100 percent (also known as fuming nitric acid) is 15,000 pounds and for 1,1-dimethylhydrazine (isomeric form of unsymmetrical dimethylhydrazine) is also 15,000 pounds. The MMA storage processes are eligible for RMP Program 1, based on the following:\r\n1. The MMA storage processes have not had an accidental release of regulated substances¿fuming nitric acid or 1,1-dimethylhydrazine¿that resulted in offsite death, injury, response, or restoration activities for an exposure of an environmental receptor. \r\n2. The distance to the toxic endpoint for a worst-case release is less than the distance to any public receptor. \r\n3. Emergency response procedures have been coordinated between ANAD and the Calhoun County LEPC.\r\n4. In addition, the process is exempt from OSHA Process Safety Management (PSM) regulations because the MMA storage igloos are ¿normally unoccupied remote facilities¿ as defined in 29 CFR 19010.119(a)(2)(iii).\r\n3.3 MMA Storage Igloos: The MMAs are stored in Stradley-type earth-covered magazines (ECMs), refer"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54417,
      "SummaryText": "red to as igloos. The igloos are concrete-reinforced, earth-covered structures. The igloos are 80 feet long, 25 feet wide, and 14 feet tall, and offer 2,000 square feet of floor space. Each igloo is designed with three small vents, each equipped with a fusible link that melts in the event there is a fire or explosion. The igloos offer the third level of containment. \r\nEach MMA contains 1,107 pounds (88 gallons) of fuming nitric acid and 375.6 pounds (58 gallons) of unsymmetrical dimethylhydrazine. The MMA storage quantities and locations are as follows: \r\n3.4 Igloo K-701: Igloo K-701 stores 32 MMAs, for a total of 12,019 pounds of unsymmetrical dimethylhydrazine and 35,424 pounds of fuming nitric acid. Unsymmetrical dimethylhydrazine storage is less than the RMP threshold quantity of 15,000 pounds. However, nitric acid (100 percent) storage at this location exceeds the RMP threshold quantity, and therefore, is subject to the RMP Program 1.\r\n3.5 Igloo K-1001: Igloo K-1001 stores 28 MMAs, for a total of 10,517 pounds of unsymmetrical dimethylhydrazine and 30,996 pounds of fuming nitric acid. Unsymmetrical dimethylhydrazine storage is less than the RMP threshold quantity of 15,000 pounds. However, nitric acid (100 percent) storage at this location exceeds the RMP threshold quantity, and therefore, is subject to the RMP Program 1.\r\n4. General Accidental Release Prevention Program and Chemical-specific Prevention Steps\r\nThe MMA storage processes in Igloos K-701 and K-1001 at ANAD are subject to RMP Program 1. Although the Chemical Accident Prevention Provisions in 40 CFR 68, Subsection 12(b), do not require a prevention program for processes subject to RMP Program 1, ANAD has several programs, including the hazard review analysis; the Standing Operating Procedures (SOPs) for MMA handling, storage, and inspection; procedures for shipping the MMAs; training programs for personnel; the Hazardous Waste Guidance and Emergency Response Plan (HWG&ERP); and an incident investiga"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54417,
      "SummaryText": "tion program. \r\nReview and Certification of Procedures: All procedures are reviewed once every 2 to 3 years or whenever a different type of missile component is planned to be stored at ANAD. The most recent hazard review and certification of the SOP for the MMA inspection was completed in March 2009. The most recent hazard review and certification of the SOP for MMA storage, loading, and unloading procedures was completed in April 2009. The U.S. Army¿s Defense Ammunition Center provides initial training to new personnel assigned to inspect MMAs and certification to all personnel inspecting the MMAs. The ANAD procedures pertaining to ammunition also are reviewed and approved by the Defense Ammunition Center. \r\nMMA Inspection: The MMAs containing the liquid propellants and the storage igloos are inspected every month by a trained and certified team of personnel. Before entering the igloo, air around the igloo is sampled with a multi-gas detector kit, which contains different indicator tubes for fuming nitric acid and unsymmetrical dimethylhydrazine that change color in the presence of toxic fumes of the respective chemical. If no leaks are detected, the inspection team enters the igloo to examine the MMAs individually. Each MMA has a built-in leak detector on the exterior of the casing. If a leak is suspected, the ANAD personnel are trained and equipped to take immediate action to contain the leak.\r\nSite Security: ANAD is a physically secure facility with controlled access through a security gate. The ammunition area, where the igloos are located, has an additional level of security. Access to the ammunition area is limited to persons with special badges or escorted by a person having a Restricted Area badge. \r\n5. Five-year Accident History\r\nNo accidental releases have occurred with the MMA storage and maintenance processes during the last 5 years.\r\n6. Emergency Response Program\r\nIn accordance with the requirements in the Chemical Accident Prevention Provisions in 40"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 54417,
      "SummaryText": "CFR 68, Subsection 12(b), for the RMP Program 1 processes, ANAD has coordinated emergency response procedures with the Calhoun County LEPC. Additionally, ANAD has an emergency response program above and beyond the requirements for the RMP Program 1 process, which meets the requirements for RMP Program 2 and Program 3 processes. \r\nThe ANAD emergency response program, titled Hazardous Waste Guidance and Emergency Response Plan (HWG&ERP) incorporates the emergency response plan, which is implemented by ANAD Fire Department personnel who are trained to control, contain, and clean up accidental releases with the help of onsite emergency response equipment. The HWG&ERP covers the accidental release of hazardous waste, nonhazardous waste, and emergency spill response. The HWG&ERP was updated in June 2008; it is reviewed and updated once every 2 to 3 years. \r\nPersonnel working with the MMA storage process undergo annual safety and emergency response training to obtain re-certification. The ANAD Fire Department is the first responder for any incident involving toxic and hazardous chemicals. The ANAD Fire Department includes a staff of 11 persons per shift and four full-time inspectors, with fire stations located in both the eastern and western sections of ANAD. The staff includes certified paramedics and certified emergency medical technicians. The Fire Department has two HazMat response trucks and a HazMat trailer, two pumper trucks, a ladder truck, two ambulances, 26 SCBA units and an equal number of spare tanks, 11 Level A suits, and 18 Level B suits. In addition, the Fire Department has portable pumps and access to several pieces of earth-moving equipment, such as bulldozers, backhoes, vacuum trucks, dump trucks, tanker trucks, and road scrapers, as needed. Several chemicals are available onsite to neutralize spills. Fire extinguishing systems are located throughout ANAD. \r\nThe ANAD Fire Department coordinates resources under the Calhoun County Emergency Management Agenc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 54417,
      "SummaryText": "y (EMA) Community Response Plan. The resources under the Community Response Plan include the Anniston, Oxford, Lincoln, and Talladega City fire departments and the Oxford Rescue Squad. Additionally, the ANAD medical dispensary is available for treating non-critical injuries. If the injuries are critical, ANAD has the resources such as ambulances and helicopters to transport victims to any of the three, local, full-service hospitals. Because ANAD is a physically secure facility, any part of the facility or the entire facility can be cordoned off in the event of emergency. Although the accidental release does not affect the offsite population or environment, the Calhoun County EMA, under the direction of Calhoun County Sheriff¿s office, can evacuate zones outside of ANAD that might be affected by an accidental release. \r\n7. Planned Changes to Improve Safety\r\nMMAs are not in the active inventory of the U.S. Army and are being phased out. The MMA stockpile at ANAD is expected to decrease over time. Since the initial RMP submission in June 16, 1999, the number of MMAs stored at ANAD in Igloo K-701 has decreased from 40 to 32, and the number stored in Igloo K-1001 has decreased from 36 to 28. This decreased storage has reduced the 1,1-dimethylhydrazine storage quantity in each of the Igloos K-701 and K-1001 to below the RMP threshold of 15,000 pounds. Every effort is being made to send the MMAs stored at ANAD to other facilities for productive use."
    }
  ]
}