{
  "FacilityID": 54466,
  "FacilityName": "Arcadia Water Treatment System",
  "FacilityStr1": "1228 South Bundy Drive",
  "FacilityStr2": null,
  "FacilityCity": "Los Angeles",
  "FacilityState": "CA",
  "FacilityZipCode": "90025",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.043667",
  "FacilityLongDecDegs": "-118.466472",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Santa Monica",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Santa Monica/Attn: Gary R.",
  "OperatorStr1": "1228 South Bundy Drive",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90025",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000084918",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-08-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2012-09-11 00:00:00",
  "DeRegistrationEffectiveDate": "2012-09-11 00:00:00",
  "AnniversaryDate": "2014-06-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 34.04335,
  "FRS_Long": -118.46662,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79510,
      "AltID": "Chlorination",
      "FacilityID": 54466,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 106069,
          "ProcessID": 79510,
          "ChemicalID": 62,
          "Quantity": 5500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 81450,
          "ProcessID": 79510,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 46894,
              "Process_NAICS_ID": 81450,
              "SafetyReviewDate": "2008-06-03 00:00:00",
              "PHA_Date": "2009-12-03 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-03-03 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Updated policies & procredures",
              "OpProceduresReviewDate": "2008-06-03 00:00:00",
              "TrainingReviewDate": "2008-06-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-02-03 00:00:00",
              "EquipmentInspectionDate": "2009-02-03 00:00:00",
              "EquipmentTested": "chlorine tanks, vacuum regulators, chlorinators, and injectors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-02-03 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2008-06-03 00:00:00",
              "AuditCompletionDate": "2009-06-11 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-06-24 00:00:00",
              "HotWorkPermitReviewDate": "2009-02-03 00:00:00",
              "ContractorSafetyReviewDate": "2009-02-03 00:00:00",
              "ContractorSafetyEvalDate": "2009-02-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 68420,
                  "PreventionProgram3ID": 46894,
                  "ProcessChemicalID": 106069
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 54466,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Local Fire Station #37",
    "CoordinatingAgencyPhone": "3105758537",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54466,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe City of Santa Monica operates the Arcadia Water Treatment System to disinfect existing groundwater supplies.  The City's senior management is committed to offer superior service while maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. \n\nThe City of Santa Monica maintains a safety committee whose members are the designated emergency coordinators for the facility.  The City also has an Emergency Action Plan (Plan) in effect, which is detailed in the Emergency Planning and Response section of the PSM document maintained at the facility.  The Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations, and to ensure that the plan is kept current.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Arcadia Water Treatment System is located at 1228 South Bundy Drive.  The facility is situated approximately 2 miles southwest of the University of California, Los Angeles (UCLA), and approximately 2 miles northwest of the Santa Monica Municipal Airport.  The intersection of the San Diego Freeway (Interstate 405) and Santa Monica Freeway (Interstate 10) is approximately three miles southeast  of the facility.  The immediate area is primarily residential.  Wilshire Boulevard is lined with commercial business and office buildings north of the facility.  Saltair Avenue and Texas Avenue define the eastern and southern borders, respectively, and are residential areas.\n\nThe Arcadia Water Treatment Plant treats approximately 280 million gallons of water per month.  The facility utilizes a chlorine gas injec"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54466,
      "SummaryText": "tion process to disinfect existing groundwater supplies.  There are two separate systems:  1) one-ton container system and 2) 150-pound cylinder system.  The one-ton container system is currently not in service.  The facility has maintained the PSM/RMP documentation in the event that one-ton containers are needed to be brought on site for emergency treatment purposes.  \n\nThe general setup includes the chlorine storage containers, a vacuum regulator secured to each container, two moisture trap/chlorine filters, five v-notch chlorinators, and five chlorine injectors.  The vacuum operated system utilizes the vacuum created at the injector to maintain a vacuum in the entire system.  The subsequent vacuum on the v-notch chlorinator regulates the volume of gas received from the vacuum regulator.  The vacuum regulators are mounted directly to the gas outlet valve on the respective container.  The vacuum regulators require a minimum vacuum pressure to operate; therefore, a break in a vacuum line will automatically shut down the system.  The chlorine injectors are located in the chlorination building; therefore all chlorine is in solution and is not considered a regulated substance.  \n\nThe Arcadia Water Treatment System has the capability to store a maximum of two (2) one-ton chlorine containers and ten (10) 150-pound chlorine cylinders (5,500 lbs) in the chlorine storage room.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nCity of Santa Monica has a Process Safety Management program in place to manage the handling of chlorine.  In addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  This includes common practices outlined by the Chlorine Institute.  In the event that the primary engineering or administration controls at the facility fail and result in a release of chlorine, there are two mechanisms in the plant to minimize the impact: 1) chlorine sensors / detectors and 2) a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54466,
      "SummaryText": "larms.  The chlorine sensors that trigger visual alarm are located in the chlorine storage room.  Once a chlorine concentration of 1 ppm is detected by the sensors, the chlorine alarm system will notify operators of the chlorine leak through the Supervisory Control and Data Acquisition (SCADA) system.\n\nFIVE YEAR ACCIDENT HISTORY\n\nAn investigation into the facility's accident history revealed that in the last five years (March 2004-March 2009), there have been no releases of chlorine that exceeded the Federal Reportable Quantity of 10 pounds or the California threshold of any release at the City of Santa Monica - Arcadia Water Treatment Plant.  In addition, there have been no injuries resulting from a chlorine release.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe City of Santa Monica has an emergency action plan in effect at the facility.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document.  This Plan was designed to meet the following objectives: \n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nThe City of Santa Monica maintains a safety committee whose members include the emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility. \n\nThe Plan also includes the Emergency training for all City of Santa Monica employees. The City of Santa Monica performs periodic emergency evacuation drills to ensure that all employees are familiar with the evacuation routes and assembly areas. \n\nThe Emergency Response Plan is reviewed and updated by the City of Santa Monica Water Reclamation Plant responsible person, Mr. Gary Richinick at least once a year.  This Plan will be review and updated to ensure compliance with the PSM, RMP, and CalARP regulations,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54466,
      "SummaryText": "and to ensure that the plan is kept current.\n\nThe City of Santa Monica has coordinated emergency response efforts with the local Fire Department Station #37.  In the case of a chlorine-related emergency, its is the policy of City of Santa Monica to evacuate the employees and to allow the fire department to respond to the emergency. \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis (PHA) revalidation provided mitigation measures to improve safety at the City of Santa Monica Arcadia Water Treatment System.  The PHA was comprised of one session that included a discussion of any changes to the chlorine system since the 2004 PHA revalidation, a detailed review of the recommended action items generated during the 2008 PSM/RMP Three-Year Audit, a discussion of the facility's accident history dating back five years, the completion of chlorine checklists, external events checklist, emergency response plant checklist, the completion of a Hazard and Operability (HAZOP) study, and a site inspection.  Another site inspection was performed by Argos Engineers, Inc. on February 24, 2009 for the seismic study.  The recommended changes from both the seismic study and the PHA study are scheduled to be completed by September  2009.\n\nIn addition, the facility is planning to complete several items over the next year as their continued effort to provide a safe work environment for Arcadia Water Treatment System employees.  These changes include the following items:\n\n1.  Continue to train all employees in Process Safety Management and the facility's safety programs.\n\n2.   Continue to have employee involvement in updating and refining Process Safety Management and the facility's safety programs.\n\n3.  Continue employee involvement through the Employee Participation program.\n\n4.  Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}