{
  "FacilityID": 54599,
  "FacilityName": "US Foodservice - Los Angeles Division",
  "FacilityStr1": "15155 Northam Street",
  "FacilityStr2": null,
  "FacilityCity": "La Mirada",
  "FacilityState": "CA",
  "FacilityZipCode": "90638",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.883743",
  "FacilityLongDecDegs": "-118.007496",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.usfoodservice.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 926581737,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "US Foodservice",
  "OperatorStr1": "15155 Northam Street",
  "OperatorStr2": null,
  "OperatorCity": "La Mirada",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90638",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerry Gerlach",
  "RMPTitle": "Facility Manager",
  "FTE": 240,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000049413",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-10-14 00:00:00",
  "SafetyInspectionBy": "Delta",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 33.88467,
  "FRS_Long": -118.00926,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79702,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 54599,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 81643,
          "ProcessID": 79702,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 106298,
          "ProcessID": 79702,
          "ChemicalID": 56,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 606298,
          "ProcessID": 79702,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54599,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nU.S. Foodservice is one of the largest broadline foodservice distributors in the United States. The company distributes food and related products to over 250,000 customers, including restaurants, healthcare facilities, lodging establishments, cafeterias, schools and colleges. U.S. Foodservice markets and distributes more than 43,000 national, private label, and signature brand items and employs more than 29,500 foodservice professionals.  As stated on OUR website, ?U.S. Foodservice is one of the leading broad line foodservice distributors in the United States, with yearly revenues exceeding $19 billion. Our corporate office is strategically positioned between Washington, D.C. and Baltimore, Maryland, in one of the fastest growing business corridors in the country - Columbia, Maryland. With over 100 distribution centers nationwide, U.S. Foodservice is conveniently located for quick and easy, local access for all existing and potential customers. \n\nU.S. Foodservice believes that yesterday, today, and tomorrow, our success depends upon our customers' success. That's why U.S. Foodservice works hard to nurture the very best customer relations - our goal is to be the industry leader.?\n\nU.S. Foodservice?s senior management is not only committed to offer superior service, but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  The facility maintains a Safety Committee whose members are the designated incident commanders for the facility.  U.S. Foodservice has an Emergency Response Plan (Plan) in effect, which is detailed in the Emergency Action and Response section of the PSM document maintained at the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations tha"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54599,
      "SummaryText": "t may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE \n\nConstruction of the ammonia refrigeration system at US Foodservice was completed in 1995 with expansions occurring in 2001 and 2005-2006. The facility is located at 15155 Northam Street, La Mirada, California 90638. The system was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes. The US Foodservice facility receives and distributes food and food products to local vendors. The ammonia refrigeration system uses 22,000 pounds of ammonia for dock operations, warehouse cold storage, and freezer storage. The majority of the system is located in the ammonia engine room including vessels and compressors. The condensers are mounted on the engine room roof, and all of the evaporators are located in their respective cold storage rooms/areas. \n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS \n\nThe US Foodservice ammonia refrigeration system has many safety features. Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system. For example, the US Foodservice facility operates in accordance with OSHA's Process Safety Management regulation. \n\nThe US Foodservice facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system. These safety features include a water diffusion tank, ammonia sensors in the machine room as well as sensors in selected cold storage areas, and automatic shut down systems. In addition, the majority of the ammonia is maintained inside the engine room and just outside of the ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54599,
      "SummaryText": "chine room (condensers). All pressure vessels are equipped with pressure relief valves that are commonly piped to the water diffusion tank. \n\nA 2,000 kW backup generator is maintained on site to power the entire facility including the ammonia refrigeration system and all associated sub-systems.  The contractor makes routine visits to the facility to ensure the integrity of the ammonia equipment is kept up.\n\nIn addition, the facility uses a professional refrigeration service contractor to assist in maintaining and repairing as necessary the ammonia system.\n\nFIVE YEAR ACCIDENT HISTORY \n\nThere have been no significant releases at the facility over the past five years (May 2004 ? May 2009) of ammonia that exceeded the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material.  In addition, there have been no injuries resulting from an ammonia release, nor any releases or ?near misses? that warranted an internal incident investigation.\n\nEMERGENCY RESPONSE PROGRAM \n\nThe US Foodservice has an emergency action plan in effect at the facility.  The Emergency Evacuation and Action Plan (Plan) is detailed in the PSM/RMP document maintained at the facility.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nUS Foodservice maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the Risk Managemnet regulations, as well as to incorporate"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54599,
      "SummaryText": " facility changes due to the merger of the former owner with US Foodservice.\n\nUS Foodservice has coordinated emergency response efforts with the local fire department (La Mirada Fire Department) and with the contracted refrigeration operation and maintenance firm.  In the case of an ammonia-related emergency, it is the policy of US Foodservice to evacuate and to allow the fire department and the refrigeration contractors to respond to the emergency.  All employees at US Foodservice are given emergency evacuation training during New Employee Orientation and Department Safety Meetings.  Annual emergency evacuation drills are held at the facility.\n\nPLANNED CHANGES TO IMPROVE SAFETY \n\nThe US Foodservice facility has a long history of implementation of the CalARP, RMP, and PSM requirements in the form of Process Hazard Analysis studies, PHA Revalidations, and Three-Year Compliance Audits.  The most recent study conducted was in April 2009 where the status of previous recommendations was reviewed with most action items being determined to be complete.  The Revalidation study recrommendations are scheduled to be complete by April 2010.  \n\nIn addition, the facility is planning to complete several items over the next year as their continued effort to provide a safe work environment for US Foodservice employees in La Mirada, California.  These changes include the following items:\n\n1.  Continue to train all employees in Process Safety Management and the facility?s safety programs.\n2.  Continue to have employee involvement in updating and refining Process Safety Management and the facility?s safety programs.\n3.  Continue employee involvement through the Employee Participation program.\n4.  Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}