{
  "FacilityID": 54592,
  "FacilityName": "City of Austin Wastewater Treatment Facility",
  "FacilityStr1": "1205 Main Street South",
  "FacilityStr2": null,
  "FacilityCity": "Austin",
  "FacilityState": "MN",
  "FacilityZipCode": "55912",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27099",
  "LEPC": "MN 100 (District 1 LEPC, MN)",
  "FacilityLatDecDegs": "43.655556",
  "FacilityLongDecDegs": "-092.973611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.ci.austin.mn.us",
  "FacilityEmailAddress": "austwwtf@smig.net",
  "FacilityDUNS": 78667946,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Austin",
  "OperatorStr1": "1205 Main Street South",
  "OperatorStr2": null,
  "OperatorCity": "Austin",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55912",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": "MN0022683",
  "EPAFacilityID": "100000131788",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-18 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 43.65583,
  "FRS_Long": -92.97464,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79695,
      "AltID": "Chlorination/dechlorinati",
      "FacilityID": 54592,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 106290,
          "ProcessID": 79695,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 106291,
          "ProcessID": 79695,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 81636,
          "ProcessID": 79695,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 47017,
              "Process_NAICS_ID": 81636,
              "SafetyReviewDate": "2008-07-11 00:00:00",
              "PHA_Date": "2007-03-06 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-10-08 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-09-04 00:00:00",
              "TrainingReviewDate": "2008-09-04 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-09-04 00:00:00",
              "EquipmentInspectionDate": "2009-06-11 00:00:00",
              "EquipmentTested": "Regulators, Injectors, Actuators, Cylinders and Sulfur Dioxide Monitor",
              "ChangeMgmtDate": "2007-10-08 00:00:00",
              "ChangeMgmtReviewDate": "2007-04-27 00:00:00",
              "PreStartupReviewDate": "1992-06-01 00:00:00",
              "ComplianceAuditDate": "2007-04-27 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-04-27 00:00:00",
              "HotWorkPermitReviewDate": "2007-04-27 00:00:00",
              "ContractorSafetyReviewDate": "2007-04-27 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "This process involves the use, storage, handling, or on-site movement of co-located vessels seperately containing the regulated substances chlorine and anhydrous sulfur dioxide above their threshold quantity.  Every element of the Prevention Program applies to both substances (or units).",
              "_chemicals": [
                {
                  "PrimaryKey": 68580,
                  "PreventionProgram3ID": 47017,
                  "ProcessChemicalID": 106290
                },
                {
                  "PrimaryKey": 68581,
                  "PreventionProgram3ID": 47017,
                  "ProcessChemicalID": 106291
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 54592,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2008-06-11 00:00:00",
    "ERTrainingDate": "2006-03-22 00:00:00",
    "CoordinatingAgencyName": "City of Austin Fire Department",
    "CoordinatingAgencyPhone": "5074333405",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54592,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\n\n\nThe City of Austin Wastewater Treatment Facility (WWTF) has developed its Risk Management Program with the intention of preventing the releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of any releases that do occur.  As a responsible member of the local community, it is the City of Austin's desire to minimize the risks posed by the WWTF.  To this end, the City of Austin submits its Risk Management Plan to communicate with the public and responders and to assist in the preservation of public safety and environmental protection.\n\n\n\nThe Accidental Release Prevention and Emergency Response Policies at Our Facility\n\nIt is the policy of City of Austin WWTF to provide employees with a work place free of recognized health and safety hazards in an effort to conserve our human, physical and financial resources.  The health and well-being of all personnel is important.  It is our policy that everything within reason shall be done to maintain a safe and healthy workplace for all employees.  \n\n \n\nEach employee has a place in our accident prevention program and is expected to cooperate fully in all measures taken in loss prevention.  The ultimate goal of the health and safety program is to prevent and reduce employee injuries and illnesses through the administration of an effective health and safety program.  Elements of this program are:\n\n\n\n* Maintenance of safe and healthful working conditions.\n\n* Ensuring employee adherence to proper operating practices and procedures designed to prevent injuries and illness.\n\n* Observing and applying federal, state, and local safety regulations.\n\n* Ensuring employees are properly trained and instructed on job procedures prior to job assignments.\n\n* Providing safety meetings for all employees as a means of obtaining new and updated information and training.\n\n* Conducting periodic safety and fire inspections to identify potential haza"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54592,
      "SummaryText": "rds in the workplace.\n\n* Conducting accident investigations to determine the cause of accidents and the actions necessary to prevent future reoccurrences.\n\n\n\nWhen feasible, we will eliminate or reduce the exposure to hazards by applying engineering controls.  When engineering controls are infeasible or fail to completely control the hazards, administrative controls will be used to minimize employee exposure.  When these types of controls do not adequately control the hazards, appropriate Personal Protective Equipment will be issued, and employees will be trained in its proper use and required to wear it.\n\n\n\nEmployees are required to read all safety rules and to know and follow them. A copy of the safety rules is given to each employee.  New employees receive a copy upon hire.  Employees are asked to sign an acknowledgment card that states that they have read the safety rules and understand them.  This card is kept in the employee personnel file.\n\n\n\nUpon initial assignment to a job, employees will be trained in the chemical hazards of the work and appropriate safe work practices and personal protective measures to be employed as per the Minnesota Employee Right-to-Know Act.  This initial training will be provided on the job by the Maintenance Foreman and by fellow employees.  The level of training is relevant to the employee's role and responsibilities and is directed at protecting the employee and the environment.\n\n\n\n\n\n\n\nOur Facility and the Regulated Substances Handled\n\n\n\nThe City operates two separate treatment plants.  The City was awarded the Environmental Protection Agency's 1998 National Award of Excellence for outstanding operation and maintenance.  Clean water has always been a priority for the City of Austin.  \n\n\n\nThe City's sanitary sewer system dates back to 1904.  The domestic plant was constructed in 1925 and has been through five upgrades.  The industrial plant was constructed in 1958 and has been expanded twice.  \n\n\n\nTwo treatment plants serve the res"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54592,
      "SummaryText": "idents and businesses of Austin.  Over 100 miles of sanitary sewer lines and 20 lift stations convey wastewater to the domestic plant.  Beginning with primary treatment in the early 1910?s this plant has been upgraded five times to keep pace with the ever-changing regulatory requirements and the increase growth in the City.  This facility is operating at better than 90% efficiency and is currently operating at 75% of design capacity.\n\n\n\nThe industrial plant was constructed in 1958 to treat the industrial strength wastewater from the Hormel Foods Corporation.  This facility uses a unique treatment process to remove the high amounts of ammonia, organic matter and solid matter in the wastewater.  This facility is operating at better than 90% efficiency and is currently operating at 70% of design capacity.  \n\n\n\n\n\nIndustrial Plant\n\nWastewater Processes\n\nThe wastewater from the George A. Hormel & Company goes through pretreatment tanks which are designed to remove fat, oil, grease and grit.  A lift station pumps an average of 1.8 million gallons per day of wastewater to two equalizing/digestion tanks.  The mixed liquor in the equalizing/digestion tanks is pumped to two secondary digesters.\n\n\n\nAnaerobic Contact Digestion\n\nTwo million gallon digesters biologically reduce the organic and solids by means of high-rate mixing and recirculation.  This process produces high volumes of methane gas which is used as fuel in the boiler to heat the digesters.\n\n\n\nNinety percent of the organic matter and 80% of the solid matter is reduced in this process.  The treated wastewater flows to an aeration tank that strips the methane gas from the liquid prior to flowing into four solids separators.  The settled solids (sludge) are returned to the equalizing/digestion tanks for more treatment.\n\n\n\nNitrification \n\nWastewater from the domestic and industrial plants is combined at this stage.  Six nitrification cells biologically remove ammonia nitrogen.  This process pumps wastewater to the cells"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54592,
      "SummaryText": ".  Ammonia-specific bacteria attached to plastic media in the cells remove ammonia nitrogen in wastewater before going to the final clarifiers for suspended solids removal.\n\n\n\n\n\nDomestic Plant\n\nWastewater Processes\n\nPreliminary Treatment\n\nA main pump station pumps an average of 3.5 million gallons per day of wastewater into the aerated grit chamber.  Rags and grit are removed in this process area to improve treatability of the wastewater.  A flow equalization tank is utilized to store and distribute the wastewater evenly to the primary treatment process.\n\n\n\nPrimary Treatment\n\nThree primary clarifiers remove more than 65% of the suspended solids.  The solids settle and are pumped as ?sludge? to the anaerobic digesters.  The sludge is biologically stabilized before being land applied on area farmland.\n\n\n\nSecondary Treatment (High-Rate Filters)\n\nFour trickling filters biologically remove 85% of the organic matter present in wastewater.  The bacteria consume the organic matter in the wastewater as it trickles over eight feet of rock media.  The treated wastewater flows to intermediate clarifiers for suspended solids removal.\n\n\n\nNitrification \n\nWastewater from the domestic and industrial plants is combined at this stage. Six nitrification cells biologically remove ammonia nitrogen.  This process pumps wastewater to the cells.  Ammonia-specific bacteria attached to plastic media in the cells remove ammonia nitrogen in wastewater before going to the final clarifiers for suspended solids removal.\n\n\n\nClarification\n\nFour final clarifiers remove the remaining suspended solids in the nitrification effluent.  These solids are recirculated to the primary treatment area.  The final ?clarified? water flows to the chlorine contact tanks for disinfection.\n\n\n\nDisinfection\n\nThe treated effluent from both plants combines prior to being disinfected.  The wastewater then enters the Chlorine Contact Tank where chlorination begins.  The chlorine utilized in the chlorination process is conta"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 54592,
      "SummaryText": "ined in one-ton pressurized cylinders which are stored in the Chlorination Building.  Here the chlorine is mixed as a solution and introduced to the wastewater at the ?front end? of the Chlorine Contact Tank.  The maximum quantity of chlorine on-site at any one time is five cylinders, or 10,000 pounds.  \n\n\n\nThe de-chlorination occurs at the ?back end? of the Chlorine Contact Tank prior to the wastewater's discharge to the Cedar River.  The sulfur dioxide used in this process is also contained in one-ton pressurized cylinders that are stored in the Dechlorination Building.  Here the sulfur dioxide is mixed as a solution and then introduced to the Chlorine Contact Tank.  The maximum quantity of sulfur dioxide on-site at any one time is three cylinders, or 6,000 pounds.  \n\n\n\nThe effluent from the two treatment plants contribute to 35% of the flow in the Cedar River. \n\n\n\nChlorine and sulfur dioxide are the regulated substances and the quantities stored on site make both chemicals subject to RMP requirements.\n\n\n\n"
    }
  ]
}