{
  "FacilityID": 54648,
  "FacilityName": "City of Manhattan Water Treatment Plant",
  "FacilityStr1": "1201 N. Third Street",
  "FacilityStr2": null,
  "FacilityCity": "Manhattan",
  "FacilityState": "KS",
  "FacilityZipCode": "66502",
  "Facility4DigitZipExt": "5497",
  "FacilityCountyFIPS": "20161",
  "LEPC": "Riley County LEPC",
  "FacilityLatDecDegs": "39.191111",
  "FacilityLongDecDegs": "-096.561667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": "www.ci.manhattan.ks.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Manhattan",
  "Company2Name": null,
  "CompanyDUNS": 87770178,
  "Company2DUNS": 0,
  "OperatorName": "City of Manhattan",
  "OperatorStr1": "1101 Poyntz Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Manhattan",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66502",
  "OperatorZipCodeExt": "5497",
  "RMPContact": "Robert Pugh",
  "RMPTitle": "Asst Director Public Works",
  "FTE": 12,
  "OtherEPAFacilityID": "KS2016112",
  "EPAFacilityID": "100000086612",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-29 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-12-30 00:00:00",
  "DeRegistrationEffectiveDate": "2011-12-07 00:00:00",
  "AnniversaryDate": "2014-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.2,
  "FRS_Long": -96.56667,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79755,
      "AltID": "Drinking water treatment",
      "FacilityID": 54648,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 81698,
          "ProcessID": 79755,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 106366,
          "ProcessID": 79755,
          "ChemicalID": 62,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 606366,
          "ProcessID": 79755,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54648,
      "SummaryText": "Release prevention and emergency response policies\nThe City of Manhattan takes an active role in preventing accidental releases at this facility by ensuring that its employees are properly trained in the safe operation and maintenance of the process subject to the Part 68 rule - drinking water treatment.  They are trained in the safe handling of the regulated substance - chlorine gas.  The City has also developed and maintained a risk management policy that contains general safety rules.  Although these general rules do not specifically address the covered process and its regulated substance, compliance with the general rules will significantly reduce the potential for accidental release of this substance.\nWith regard to emergency response, the City has established and maintained procedures for emergency notification and response.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.  Employees at this facility do not respond to a significant release of the regulated substance (chlorine gas) but would immediately notify the Manhattan Fire Department.  Employees of the facility take measures to stop very small leaks.\nCity management understands its duty to provide a safe working environment at this facility and to take measures to prevent accidents that may have significant negative impacts on the surrounding community.  This understanding is reflected in procedures described and referenced in this document.\n\nFacility and regulated substance\nThe City of Manhattan WTP treats ground water from a wellfield near the Big Blue River to provide drinking water to the community.  It does this through a series of physical and chemical treatment operations that include flocculation and sedimentation, disinfection, and final filtration.  The treated water, now ready for use by the public, is pumped into the distribution system.  The design capacity of the treatment plant is 20 million gallons per day. The regulated"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54648,
      "SummaryText": " substance stored, handled, and used at this facility is chlorine gas, liqified under pressure.  The chlorine is stored in 150-pound cylinders with a maximum intended inventory of 74 cylinders on site.  All of the cylinders are stored inside a designated room in the main building.\n\nAccidental release prevention program\nThe prevention program elements that are most critical in preventing accidental releases in this facility include classroom training, on-the-job employee training, written operating procedures for the covered process, and a process equipment preventive maintenance program. Should the prevention program fail to prevent a release, the facility is equipped with engineering controls designed to minimize the affect of the release on the surrounding community.  These include a vacuum regulator close to the storage containers and an alarm to warn employees of a leak.  The chlorine storage containers are kept inside of a building to mitigate the effects of a release.\n\nFive-year accident history\nThere has been no accidental release of a regulated substance from this facility in the past five years that meets the requirements of 40 CFR 68.42(a).\n\nEmergency response program\nThis facility has established and maintains an emergency action plan that is coordinated with local response agencies.  The goals of the program are to protect onsite employees from the hazardous effects of the releases and to minimize the effects of accidental releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.The action plan includes procedures for emergency recognition, continuation of critical plant operations, and employee evacuation.\n\nPlanned changes to improve safety\nIdeas for changes to improve safety are actively sought from employees.  Employee meetings that focus on safety issues are held at this facility, and employees are trained to recognize hazards and present ideas to eliminate them or to minimize the pote"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54648,
      "SummaryText": "ntial consequences of those hazards.\nDuring the development of the RMP document, and subsequently, hazard reviews are conducted with key employees to meet the prevention program requirements.  During these reviews, recommendations are made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been or will be considered for implementation.  Though not all recommendations may be implemented, the exercise will provide all affected employees with a heightened awareness of safety issues related to the covered process."
    }
  ]
}