{
  "FacilityID": 54657,
  "FacilityName": "Potomac Water Filtration Plant",
  "FacilityStr1": "12200 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Potomac",
  "FacilityState": "MD",
  "FacilityZipCode": "20854",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24031",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "39.044823",
  "FacilityLongDecDegs": "-077.261363",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.wsscwater.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 883279549,
  "ParentCompanyName": "Washington Suburban Sanitary Commission",
  "Company2Name": null,
  "CompanyDUNS": 3258654,
  "Company2DUNS": null,
  "OperatorName": "Washington Suburban Sanitary Commis",
  "OperatorStr1": "14501 Sweitzer Lane",
  "OperatorStr2": null,
  "OperatorCity": "Laurel",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "20707",
  "OperatorZipCodeExt": null,
  "FTE": 27,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000113432",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-02-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.04087,
  "FRS_Long": -77.25253,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79766,
      "AltID": "Chlorination of Water",
      "FacilityID": 54657,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 106380,
          "ProcessID": 79766,
          "ChemicalID": 62,
          "Quantity": 80000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 81709,
          "ProcessID": 79766,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 47072,
              "Process_NAICS_ID": 81709,
              "SafetyReviewDate": "2009-03-23 00:00:00",
              "PHA_Date": "2009-04-10 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "Yes",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-02-26 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Vehicle collision; unloading",
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Chlorine louvers and exhaust automatically shut down with loss of power",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-09-23 00:00:00",
              "TrainingReviewDate": "2008-09-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": "State certification",
              "MaintenanceReviewDate": "2008-12-24 00:00:00",
              "EquipmentInspectionDate": "2008-12-24 00:00:00",
              "EquipmentTested": "Manifold valves, flexible lines, tank yoke valves, gas filter strainer pads, vacuum regulator, gas pressure reducing valve strainers, drip leg heaters were checked.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2006-06-20 00:00:00",
              "PreStartupReviewDate": "1999-05-14 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1997-09-23 00:00:00",
              "InvestigationChangeDate": "1997-12-31 00:00:00",
              "ParticipationPlansReviewDate": "2008-09-23 00:00:00",
              "HotWorkPermitReviewDate": "2007-10-30 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 68647,
                  "PreventionProgram3ID": 47072,
                  "ProcessChemicalID": 106380
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 54657,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-03-01 00:00:00",
    "ERTrainingDate": "2009-03-01 00:00:00",
    "CoordinatingAgencyName": "County Dept. of homeland Sec. LEPC",
    "CoordinatingAgencyPhone": "2407772327",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54657,
      "SummaryText": "Potomac Water Filtration Plant EPA/RMP Executive Summary 3/23/09\n\nI. THE WASHINGTON SUBURBAN SANITARY COMMISSION\n\nThe Washington Suburban Sanitary Commission (WSSC) is a quasi-government agency established by the Maryland General Assembly in 1918 as a regional (bi-county) organization under Article 29 of the Annotated Code of Maryland, to provide water and sewer services for two Maryland counties adjacent to Washington DC. WSSC provides water and sewer to both Prince George's and Montgomery Counties in Maryland, serving 400,000 customer accounts and an area of nearly 1000 square miles\n\nII. THE VISION AND MISSION OF THE WSSC\n\nThe WSSC Vision - Since we are entrusted by our communities to provide safe drinking water, to ensure reliable service and to safeguard the environment, we will demonstrate, through our daily performance in meeting these responsibilities, the importance of earning the trust and advocacy of our customers. We will be recognized as pioneers in our field and will be looked up to by our peers. Our leadership role and community involvement will forge working partnerships that place trust in our customers interests as they place trust in our tested experience.\n\nWe inspire among our employee sensitivity and responsiveness to customers needs, with a commitment to excellence at every level in the organization. We will develop an empowered and diverse workforce representative of the public we serve and one that will exhibit a sense of individual values that translate into teamwork, pride and personal responsibility.\n\nOur Mission ¿ We are entrusted by our community to provide safe and reliable water, life¿s most precious resource and return clean water to our environment, all in a financially responsible manner. \n\n\nIII. FULFILLING OUR VISION AND MISSION\n\nTo fulfill our mission of providing safe, reliable water that meets or exceeds all standards for purity and of returning clean water to the environment, all in an efficient, financially responsible manner,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54657,
      "SummaryText": "WSSC operates and maintains an extensive array of highly automated facilities. Our two water filtration plants, drawing from the Potomac and Patuxent rivers, produce an average of 166 million gallons of pure water per day, and over 5000 miles of water mains deliver that product to homes and business in Prince George¿s and Montgomery Counties. The Commission operates three reservoirs, with a total capacity of 14 billion gallons to ensure a reliable water supply for all seasons and conditions.\n\nIV. POWERS AND RESPONSIBILITIES\n\nA six member Commission governs WSSC (three for each county). The Commissioners are appointed to four year terms by their respective county executives, and confirmed by their county councils.\n\nThe Commissions power and responsibilities area set forth in state law and in subsequent legislative amendments. The Maryland general assembly conferred these powers upon the WSSC to enable it to fulfill its principal functions.\n\nThe Commissions major functions are to:\n- Provide for the construction, operation and maintenance of water supply and sanitary sewerage systems in Montgomery and Prince George¿s Counties;\n- Approve the location of and issue permits for utilities installed in public ways; and\n- Establish water consumption rates, sewerage usage rates, connection charges, front foot benefit charges and permit fees, and if required, cause ad valorem taxes to be levied.\n\nThe Commission also:\n- Reviews preliminary subdivision plots as to suitability of water and sewer design, and review street grades for those streets in which there are Commission facilities;\n- Formulates regulations, issues permits for, and inspects all plumbing and gas fitting installation;\n- Conducts examinations for master and journeyman plumbing and gas fitters and issue licenses to those qualified to perform plumbing and gas fitting work.\n\nV. THE PRODUCTION TEAM\n\nThe Production Team is responsible for providing overall supervision, management, coordination and administration of th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54657,
      "SummaryText": "e water and wastewater plants. The Team office formulates operating policy and procedure, provides technical advice to the Commission staff and participates in inter and intra-agency meetings. The Team Chief serves as Chairman of the Blue Plains Regional Committee, and the Principal Civil Engineer serves as Chairman of the Blue Plains Technical Committee. These committees are charged with administration of the Inter-municipal Agreement, or IMA, which governs regional coordination on Blue Plain issues. The Team Chief also serves as WSSC¿s representative on the Council of Government¿s Environmental and Public Works Directors Committee (a committee that develops environmental policy recommendations for the Board of Directors), the Montgomery County Water Quality Advisory Group (which advises the council on water policies) and Chairman of the WSSC Plumbing Board (which makes policy recommendations regarding the plumbing code). The Team Chief provides the supervision, management, and administrative control of all water and wastewater groups.\n\nPart of the team¿s mission is to provide a reliable supply of high quality water to the WSSC district. In particular, the team is responsible for the maintenance and operation of the Commissions watersheds, impounding dams and reservoirs, water filtration plants, and the water distribution system. The Team is also responsible for the maintenance of adequate volume and pressure of water for firefighting and of adequate water pressures at customer taps throughout the bi-county area.\n\nThe Team uses traditional approaches to the treatment of drinking water. Engineering staff is tasked to research and continue to place particular emphasis on addressing low level contaminants. WSSC staff work closely with local and national professional organizations as well as with state and county agencies and the EPA to ensure that, within fiscal constraints, our treatment methods are effective and consistent with current research findings. \n\nVI. WATER"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54657,
      "SummaryText": "FILTRATION PLANTS\n\nWSSC has two water filtration plants. One is located on River Road in Potomac MD and the other is located in Laurel MD. The two plants combine to provide over 120 million gallons a day to the distribution system. Both plants operate 24 hours a day, 7 days a week with a minimum of two operators on every shift. Trained and qualified operators monitor systems and processes to ensure compliance with current EPA water quality standards.\n\nThe Potomac and Patuxent plants have consistently processed water well below the maximum contaminate level (MCL) limits as established by the EPA, Safe Drinking Water Act (SDWA). Based on our records, WSSC¿s water filtration plants have qualified for continued participation in the partnership for safe drinking water, a partnership between EPA, water associations, and individual utilities to improve water quality in advance of promulgation of regulations.\n\nPerformance and safety are the hallmarks of our water filtration plants. Both plants have an active and aggressive safety training program. WSSC¿s Safety Unit, the plants group leader and chief plant operators provide oversight of staff training. Training is provided in plant operations, accident investigation, accident prevention, and emergency response. Annual training includes CPR, lockout/tagout, Right-To-Know, personal protective equipment, emergency chlorine cylinder repair, confined space entry/rescue retrieval, etc¿ As a WSSC requisite for long term employment, water plants operators must pass an examination to become certified by the state of Maryland¿s Department of the Environment. This ensures that plant operators are fully capable of effectively operating the plant. Both plants have successfully operated over the past decade with a minimum number of lost time accidents.\n\nThe plants are designed to provide reliable operations year round. Power to the plant originates from two different electrical sources, minimizing the probability of a total power outage"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 54657,
      "SummaryText": ". \n\nVII. PREVENTION PROGRAM\n\nThe Commission¿s accidental release prevention program is part of the agencies overall Safety and Health Program and involves a unified approach that integrates technologies, procedures and management practices to ensure our workers and the public a safe environment. The RMP requirements are essentially an expansion of the OSHA Process Safety requirement and the Employee and Community Right-To-Know Programs that have been in existence for a number of years.\n\nHazardous material has always been recognized as a unique hazard for our employees and the public. Therefore, we have made every possible effort to ensure the proper and safe use of all hazardous materials. WSSC¿s Hazardous Material Safety Program includes: \n- The availability of personal protective equipment; \n- Obtaining and use of Material Safety Data Sheets (MSDS); \n- Designing facilities for safety and accident prevention; \n- Training and educating employees on chemical systems and processes; \n- Planning and practicing for emergency situations; \n- Requiring consultants and contractors to abide by established safety practices; \n- Sharing of information with employees, contractor and consultants; \n- Conducting periodic inspections and audits reviews of chemical process systems; \n- Formulating policies and procedures for an effective chemical handling process.\n\nAdditionally, all Commission facilities are designed and built in conformance with the industries recognized codes, such as:\n- National Electrical Code;\n- American Society of Mechanical Engineers;\n- American National Standards Institute;\n- ASME Boiler and Pressure Vessel Codes;\n- BOCA Codes;\n- American Society of Heating, Refrigeration and Air Conditioning Engineers;\n- American Water Works Association\n\nA review of the hazards associated with the chlorine facility process and procedure is performed annually.\n\nThe water plant managers have developed written procedures that provide clear instructions and steps for safely conduc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 54657,
      "SummaryText": "ting activities associated with the chlorination process. These procedures include initial startup, normal operations, temporary operations, emergency shutdown and operation, equipment inspections and emergency planning and response. \n\nEmployees currently operating and maintaining the chlorination process have been trained and tested competent to perform their work duties. Newly assigned employees will also receive the appropriate training to perform their delegated duties.\n\nVIII. EMERGENCY RESPONSE AND PLANNING\n\nBoth water plants have a written emergency response and planning program. A written emergency plan is maintained by on-site plant personnel with the support of the WSSC Safety Unit. The plan is consistent with EPA 40 CFR, Emergency Planning and Community Right-To-Know Act of 1986 of Title III of the Superfund Amendments and Reauthorization Act. These plans includes:\n- Delegation of authority\n- Notification of officials\n- Emergency procedures\n- Procedures for working with local officials should an emergency create the need for an evacuation of the plant and/or surrounding community.\n\nPlant personnel are regularly trained on plan requirements and conduct periodic emergency response drills for a variety of plant emergencies. The plant personnel and the Safety Unit document training. Emergency response training courses are frequently utilized by plant operators to maintain their operator certifications with the Maryland Department of the Environment. The Safety Manager is a member of the Montgomery County Local Emergency Planning Committee (LEPC) and another Commission employee is a member of the Prince George¿s County LEPC. They both assist the fire department in coordinating emergency response planning and training. Montgomery County Fire and Rescue officials visit the Potomac Filtration Plant and their counterparts in Prince George¿s County also take an active roll in visiting the Patuxent Plant. They tour the plants at least twice a year conducting walk aro"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 54657,
      "SummaryText": "und inspections of the chemical storage areas and the plant in general. WSSC and the fire department have an excellent working relationship and are both prepared for an on-site emergency.\n\nWSSC will share with the Montgomery and Prince George¿s County LEPC and the local fire departments our risk management plan and future amendments. Our goal is to provide amendments or updates to the LEPC within 30 days of the final action.\n\nAdditionally, if any future off-site analysis identifies potential exposure to residents outside the Montgomery/Prince George¿s County jurisdiction, the WSSC Safety Manager shall ensure that all jurisdictions affected are advised of the potential off-site consequence. \n\nWSSC Safety Manager\n14501 Sweitzer Lane\nLaurel Maryland 20707"
    }
  ]
}