{
  "FacilityID": 54711,
  "FacilityName": "Toa Vaca, Villalba Filtration Plant",
  "FacilityStr1": "PR-150 km. 5.6",
  "FacilityStr2": null,
  "FacilityCity": "Villalba",
  "FacilityState": "PR",
  "FacilityZipCode": "00766",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72149",
  "LEPC": "PONCE LEPC",
  "FacilityLatDecDegs": "18.097970",
  "FacilityLongDecDegs": "-066.486033",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": "www.acueductospr.com",
  "FacilityEmailAddress": "ciecentral@acueductospr.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Puerto Rico Aqueduct and Sewer Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "PR Aqueduct and Sewer Authority",
  "OperatorStr1": "PO Box 7066",
  "OperatorStr2": "Ave. Barbosa 604",
  "OperatorCity": "San Juan",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00916",
  "OperatorZipCodeExt": "7066",
  "RMPContact": "Jose Capeles",
  "RMPTitle": "Compliance and QC Director",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000208241",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79833,
      "AltID": "Chlorination",
      "FacilityID": 54711,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 81783,
          "ProcessID": 79833,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 106452,
          "ProcessID": 79833,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 606452,
          "ProcessID": 79833,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54711,
      "SummaryText": "Toa Vaca Filtration Plant is located at the State Road 150 kilometer 5.6, Villalba, Puerto Rico, 00766.  This water treatment plant is owned by Puerto Rico Aqueduct and Sewer Authority (PRASA) which is a Government Agency.  PRASA has developed the RMP following the Program #3 for the Management and Prevention of Risks associated with the storage and handling of the toxic substance chlorine used  for water disinfection.  The RMP was prepared in compliance with EPA 40 CFR Part 68.  The Prevention Program was prepared in accordance with OSHA Process Safety Management (PSM) regulation, as established in 29 CFR Part 1910.119.\n\nAccidental Release:\nIt is PRASA policy to comply with EPA and OSHA Federal and State applicable requirements. Chlorine is a toxic substance regulated by EPA, for that reason Toa Vaca Filtration Plant has undergone some engineering controls.  Changes have been put in place to improve safety and as a part of the Prevention Plan implanted to protect the wellness of workers, employees, contractors, visitors and immediately surrounding areas and inhabitants.\n\nThe Stationary Source and Regulated Substance handled.\nToa Vaca Filtration Plant is located close to the area where the plants supply the potable water.  The chlorine is used as a disinfectant to destroy the microorganism that could cause illness in humans.\n\nThe chlorine is delivered from the PRASA Chlorine Warehouse and Distribution Center at Puerto Nuevo to the plant in one (1) ton containers.  Toa Vaca Filtration Plant could have a storage maximum volume of 18,000 pounds distributed in nine (9) containers.  The containers are connected to chlorinators from which the chlorine flows to the ejectors and then the chlorine solution is sent to one (1) disinfection point along the process of the plant. \n\nWorst Case Scenario:\nThe Worst Case Scenario was determined as indicated in the EPA Wastewater Treatment Plant, as per Appendix F Supplemental Risk Management Program Guidance for Wastewater Treatment "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54711,
      "SummaryText": "Plants.  This guidance considers the release of the Chlorine Gas of the entire container (2,000 pounds) during 10 minutes and other specifications related to the weather conditions and a radio of 1.3 miles, for a chlorine concentration equal or higher than 3 ppm, which is the American Industrial Hygiene Association exposure limit above which it is determined human health will be affected.  Using the Landview 6 Simulator and the US Census 2000, it was identified that 4,699 public receptors are inside the 1.3 miles radio.  Toa Vaca and Guayabal Lakes are with the 1.3 miles radio, no other known environmental receptors (state parks, or official designated wildlife preserves) were identified within this radio area.  The ALOHA Modeling Dispersion Program was used to simulate the gas dispersion.\n\nAlternative Case Scenario:\nThe more realistic scenario was also simulated as per EPA Wastewater Treatment Plants parameters, as a release of the total content of a 2,000 pounds container, but throughout a pipe leak.  In the case the end point distance is calculated at 0.1 miles, no public receptors were identified using the Landview 6 Simulator and the US Census 2000.  On recent aerial photographs, several houses and a church are observed adjacent to the Toa Vaca Filtration Plant.  Approximately 25 public receptors are within this 0.1 mile radio.  Part of the Toa Vaca Lake were located within this radio area.\n\nGeneral Accident Release Prevention Program \nPRASA is actually in a very aggressive operation to implement a Prevention Plan to ensure the maintenance and mechanical integrity of the facility which will improve significantly the safety scope of the current prevention plans.  Standard Operational Procedures (SOP?s) are already in place to comply the OSHA and PROSHO requirements in order to keep all the involved parties aware of the hazardous and risk related to the chlorine.  List of all SOP?s are indicated in the PSM document and are located in the plant.\n\nEmergency Respons"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54711,
      "SummaryText": "e Program:\nPRASA has various SOP?s to manage emergency programs associated to a release of the chemical and also related to the emergency actions to be taken before and after hurricanes and other atmospherics events.\n\nFive years Accident History:\nNo mayor release of chlorine in excess of ten (10) pounds has been reported during the last five years. \n\nPlanned Changes to Improve Safety:\nPRASA has already implemented in Toa Vaca Filtration Plant, a vacuum operated system to improve the control of the process and the safety of the chlorine handling and storage.  It is still needed to reinforced administrative activities related to containers handling and transportation, emergency personal protective equipment, preventive maintenance and audits. Recommendations were given on that regard on last PHA dated May 12, 2009."
    }
  ]
}