{
  "FacilityID": 54768,
  "FacilityName": "City of Idaho Falla Water Pollution Control Plant",
  "FacilityStr1": "4055 Koester Road",
  "FacilityStr2": null,
  "FacilityCity": "Idaho Falls",
  "FacilityState": "ID",
  "FacilityZipCode": "83402",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16019",
  "LEPC": "Bonneville County LEPC",
  "FacilityLatDecDegs": "43.462778",
  "FacilityLongDecDegs": "-112.068889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Idaho Falls",
  "OperatorStr1": "4055 Koester Road",
  "OperatorStr2": null,
  "OperatorCity": "Idaho Falls",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83402",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Smith",
  "RMPTitle": "Sewer Superintendent",
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000102435",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-07-24 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 43.46278,
  "FRS_Long": -112.06889,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 79905,
      "AltID": "Chlorine Process",
      "FacilityID": 54768,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 81856,
          "ProcessID": 79905,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 106625,
          "ProcessID": 79905,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 606625,
          "ProcessID": 79905,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54768,
      "SummaryText": "Executive Summary\nIntroduction\nChemicals are widely used in industry, in the home, and in the environment. They are transported on roads, water, and railways. The Idaho Falls Water Pollution Control Plant (WPCP) uses chemicals, too, such as chlorine to disinfect wastewater to provide safe water discharges to the environment and for landscaping or irrigation uses. The WPCP chlorination system uses chlorine gas fed from liquid chlorine containers. Because storing large quantities of chlorine can be hazardous, the WPCP takes its safety obligations in storing and using chlorine as seriously as providing safe, disinfected water to the environment. The following document describes what could happen in the event of an accident, the steps the WPCP takes everyday to ensure safe operation, and what to do in event of an emergency. Please feel free to contact David Smith at 208-612-8108 if you have any questions.\n\nAccidental Release Prevention and Emergency Response Policies\nThe Idaho Falls WCPC and Idaho Falls Fire Department accidental release prevention policy involves a unified approach that integrates proven technology, trains staff on operation and maintenance practices, and uses tested management system practices. All applicable procedures of the State of Idaho and U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures. \nThis document complies with the EPA's Risk Management Program (RMP), under Section 112 (r) of the Clean Air Act (CAA), Amendments of 1990 40 Code of Federal Regulations (CFR) Part 68. This document summarizes the WPCP?s existing health and safety programs, internal management response team, policies, procedures, and on-going actions that are designed to prevent or minimize impacts of accidental releases of chlorine to the environment. The WPCP has prepared a detailed and comprehensive emergency response plan to handle any potential accide"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54768,
      "SummaryText": "ntal releases and which is designed to safeguard both on- and offsite people. To date, the WPCP has an excellent record in accident prevention.\n\nGeneral Facility and Regulated Substances Information\nThe Idaho Falls WPCP, operating since 1973, is located at 4055 Glen Koester Road, City of Idaho Falls, Bonneville County, Idaho. The WPCP is on a 15 acre property about 3 miles south of the center of town and adjacent to Snake River. Wastewater from the Bonneville service area is treated at the WPCP, and the disinfected water is either discharged into the Snake River or reclaimed for landscaping and irrigation uses. The WPCP is designed for 17 million gallons per day (MGD), 35,000 lbs. BOD, and 38,000 lbs TSS.  It currently receives 11 MGD, 21,000 lbs BOD, and 29,000 lbs TSS.\nUpon entering the plant, the wastewater passes through a pair of one-quarter inch diameter escalator punch plate screens.  The raw sewage is as screened using fine screening technology with an opening of approximately 6 millimeters.  The solids removed from the screens are washed to remove organic material, dewatered and compacted to remove the free water, and loaded into a storage dumpster.  All of the equipment and facilities are located indoors in the new Headworks Building to facilitate equipment operation and maintenance.  The screened material is landfilled.\nThe wastewater flows to an aerated grit chamber and then to the primary clarifier.  Floatables from the top of the clarifier as well as the settled sludge from the bottom are pumped into the primary digesters.  These digesters are of the anaerobic type and utilize the mesophillic temperature range for digestion and stabilization of sludge.\nAfter leaving the primary clarifier, the sewage flows to the secondary pump station where it is pumped over an activated biological filter tower.  This tower utilizes redwood media and the wastewater is passed over it at a super rate in excess of 27 million gallons per day.  The purpose of the tower is t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54768,
      "SummaryText": "o remove nutrients and act as a buffer to prevent ?shock loads? from affecting the activated sludge system.\nUpon discharging from the tower, the wastewater enters the aeration basins.  The basins are of a complete mix type and utilize floating aerators with propellers to provide aeration and mixing.  These basins, together with the ?tower?, provide an environment for higher bacterial life forms to develop.  These bacteria multiply utilizing additional wastewater as a food source.  Normal detention time for the basins is about 5 hours under present flow conditions.\nFollowing aeration, the flow passes to the secondary clarifiers providing a resting stage where the microbial solids ?clump? together and settle.  The settled solids return (underflow) to the secondary pumps station and remix with the primary effluent thus creating activated sludge.  A portion of this recirculated settled sludge is wasted daily to the solids handling building where centrifuges thicken the sludge and pump it into the primary digesters.  It is wasted to keep the microbial population in balance.\nAfter clarification, the wastewater (overflow) enters the chlorine contact chambers where it is disinfected with chlorine.  Following disinfection, the residual chlorine is neutralized with sodium bisulfite and discharged to the Snake River.\nFollowing anaerobic digestion, the sludge is further stabilized in a storage lagoon and easily meets all the ?Class B? requirement set forth in 40CFR503 regulations.  It is used as a fertilizer and soil conditioner on farmland in the area.\nThe WPCP currently stores chlorine; a regulated toxic substances under the RMP regulations. Chlorine is stored in twelve, 1-ton steel containers containing a maximum of 12 tons of chlorine. This chlorine storage exceeds the listed threshold quantities in both the RMP Rules and in the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Rules (29 CFR 1910.119). However, because Idaho is not an OSHA"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54768,
      "SummaryText": "-regulated State, the Idaho Falls WPCP is not subject to the PSM Rules.\nChlorine is delivered to the WPCP in 1-ton containers. Current processes only allow gaseous chlorine to be withdrawn from the 1-ton containers. In both the Tank Room and the Chlorinator Room, chlorine leak detectors monitor continuously for chlorine leaks. In the event of a leak, the detectors sound an alarm at the plant control panel; additionally, the tank area has both an audible alarm and a flashing warning light inside and outside of the building. \nBoth the Tank and the Chlorinator Rooms are enclosed in the Chlorine Building. The Tank Room is equipped with an automatic chlorine scrubber ventilation system that automatically operates when parts per million (ppm) of chlorine are detected in the room. An emergency shower and eye wash station are provided on the outside of the building. Self Contained Breathing Apparatus (SCBA) packs are available onsite in the Administration Building. The Chlorine Building has a fire sprinkler and fire alarm system in the event of a fire.\nThe WPCP entrance is controlled by a gate at Glen Koester Road. Visitors and contractors must enter the administration building and be approved by WPCP staff prior to entry into the WPCP. The WPCP is staffed year-round, 24 hours a day. \nElectrical power is available to the chlorination and dechlorination facilities in the event of an emergency. The back-up generator starts within seconds of electrical power supply loss and supplies power to critical processes within the WPCP, including the chlorine leak detectors, lighting, and ventilation systems.\n\nSummary of the Accidental Release Prevention Program and Chlorine-Specific Prevention Steps \nThe WPCP has a thorough Safety Management Program. Chemical-specific prevention steps include availability of SCBA, worn by the operators during connection and disconnection of the chlorine supplies; awareness of the hazardous and toxic properties of chlorine; and the presence of chlorine "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 54768,
      "SummaryText": "detectors and alarms.\nThe WPCP Accidental Release Prevention Program is based on the following key elements:\n?    A detailed management system and clear levels of responsibilities and team member roles\n?    Comprehensive process safety information that is readily available to staff and emergency responders\n?    A comprehensive preventive maintenance program\n?    A completed process hazard analysis of equipment and procedures with operation and maintenance staff participation and review\n?    Use of state-of-the-art process and safety equipment\n?    Use of accurate and effective operating procedures, written with operations and maintenance staff participation\n?    A high level of operator and maintenance staff training\n?    Implementation of an incident investigation, inspection, and auditing program using qualified staff\n\nProcess and Chemical Safety Information\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of each regulated substance (chlorine). This information was compiled from numerous sources and is intended to be a one-stop source for the reader seeking data about these substances. This information includes chlorine background information, MSDS sheets, and chlorine reaction chemistry.\nEquipment safety information was meticulously compiled on the chlorine process, and specifications for each process are contained in one place for easy reference. On file at the WPCP are details that include maximum intended inventory; safe upper and lower temperatures; safe upper and lower pressures; and codes and standards used to design, build, and operate the processes.\nThe WPCP also maintains procedures that are triggered to update safety information when existing information becomes obsolete.\n\nProcess Hazard Analysis \nIn 2009, the process hazard analysis (PHA) was updated with WPCP staff and administrative staff for the regulated process. The team consist"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 54768,
      "SummaryText": "ed of process operating and maintenance experts and process design engineers. The PHA technique used was the ?What-If? study, as per acceptable approach guidance from the EPA. The PHA was lead by a knowledgeable person on the type of process being reviewed. This review will be updated again within a five-year period or whenever there is major change in the process. A list of actions to resolve any found significant hazard review findings was prepared, and staff is currently working to resolve this action item list. Staff will document completion of any action item.\n\nOperating Procedures\nThe Idaho Falls WPCP maintains up-to-date, accurate, written operating procedures that give clear instructions for the chlorine process. The WPCP ensures effective operating practices by combining them with operating and maintenance training programs. Standard operating procedures (SOPs) provide system descriptions, specifications, equipment inspection requirements, and operating procedures for the chlorine system. Procedures include startup, shutdown, and normal, alternate, and emergency operation. Also included are maintenance and troubleshooting procedures, consequences of deviation, and steps to correct deviations. Procedures are updated whenever a change occurs that alters the steps for safe operation. Operating procedures will be developed and in place before starting-up a changed process or before any new process equipment goes on-line.\n\nOperations and Maintenance Training Program\nEach WPCP employee presently involved in operating or maintaining the chlorine process is trained in a process overview and in detailed, applicable, operation and maintenance procedures. The WPCP helps its employees understand, through training, the nature and cause of problems arising from operations involving chlorine on site, and increases its employees' awareness with respect to these hazards. The WPCP?s training program includes both initial and refresher training that covers 1) a general overvi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 54768,
      "SummaryText": "ew of the processes, 2) the properties and hazards of the substances in the processes, and 3) a detailed review of the processes? operating procedures and safe work practices. Oral reviews and written self-evaluations are used to verify that an employee understands the training material before the process work can be resumed. \nTraining documentation includes the date of the most recent review or revision to the training program, the type of training required, and the type of competency testing used to ensure staff understands the training. \nPre-Startup Safety Review and Mechanical Integrity Program\nThe WPCP ensures that a pre-startup safety review is completed for any new, chlorine process at the WPCP, or for significant modifications to an existing chlorine process that requires a change in the process safety information. The WPCP maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. The WPCP believes that this program is the primary line of defense against a release, and addresses equipment testing and inspection, preventative maintenance schedules, and personnel training. The mechanical integrity program includes the following:\n?    Use of written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience\n?    Implementing written procedures by performing inspections and tests on process equipment at specified intervals\n?    Training maintenance personnel in procedures for safe work practices, such as tagout, line or equipment opening, and avoidance and correction of unsafe conditions\n\nInternal Compliance Audits\nInternal compliance audits will be conducted every 3 years to verify compliance with the programs and procedures contained in the RMP. The WPCP will assemble an audit team that includes personnel knowledgeable in the RMP rule and process"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 54768,
      "SummaryText": ". This team will evaluate whether the prevention program satisfies the requirements of the RMP rule, and whether the prevention program is sufficient to help ensure safe operation of the process. The results of the audit will be documented, recommendations will be resolved, and appropriate enhancements to the prevention program will be implemented.\n\nIncident Investigation\nThe WPCP investigates all incidents that could reasonably result in a serious injury to personnel, the public, or the environment, so that similar accidents can be prevented. The WPCP trains employees to identify and report any incident that requires investigation. An investigation team will be assembled and the investigation initiated within 48 hours of the incident. The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented. Information found during the investigation is reviewed with affected staff, added or used to revise operating and maintenance procedures, and passed onto the training unit for their inclusion in existing training programs?if warranted?to prevent a future event.\n\nFive-Year Accident History Summary\nDuring the last 5 years, there were no reportable accidents at the WPCP that caused onsite injuries, deaths, offsite injuries, property or environmental damage, evacuations, or sheltering in place. Some minor, incidental releases also may have occurred over this period, but they were quickly handled by staff, were neutralized, or posed no safety or health hazards.\nAppropriate investigation and documentation will occur in the event of a reportable accident. \n\nEmergency Response Program Summary\nThe WPCP has established a written Emergency Response Program (ERP) that employees follow to help them safely respond to accidental releases of hazardous substances. This program will be coordinated and reviewed by the City of Idaho Falls Fire Department, which is a member of the Local Emergency Response Planning Committee."
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 54768,
      "SummaryText": " This program includes an Emergency Response Notification Plan. Emergency response drills and drill evaluations are conducted every 12 months; emergency operation and response procedures also are reviewed at that time.\n\nPlanned Changes to Improve Safety\nThe 2009 PHA for the chlorine process identified some procedures that may improve the safety of the chlorination system. It is expected that the recommended actions be evaluated and, if found reasonable, implemented by December 31, 2009. Implementation of these recommendations may further improve the safety of the covered processes."
    }
  ]
}