{
  "FacilityID": 5482,
  "FacilityName": "Northport Wastewater Treatment Plant",
  "FacilityStr1": "3950 3rd Street South",
  "FacilityStr2": null,
  "FacilityCity": "Northport",
  "FacilityState": "AL",
  "FacilityZipCode": "35476",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01125",
  "LEPC": "Tuscaloosa County LEPC",
  "FacilityLatDecDegs": "33.213611",
  "FacilityLongDecDegs": "-87.589722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "The City of Northport, Alabama",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "The City of Northport, Alabama",
  "OperatorStr1": "3950 3rd Street South",
  "OperatorStr2": null,
  "OperatorCity": "Northport",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35476",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000069711",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-04-28 00:00:00",
  "DeRegistrationEffectiveDate": "2014-04-19 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 33.2144,
  "FRS_Long": -87.5883,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6473,
      "AltID": "Disinfection",
      "FacilityID": 5482,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7076,
          "ProcessID": 6473,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 7077,
          "ProcessID": 6473,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6629,
          "ProcessID": 6473,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3396,
              "Process_NAICS_ID": 6629,
              "SafetyReviewDate": "1999-05-21 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-01 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-11-01 00:00:00",
              "TrainingReviewDate": "1998-11-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-11-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-01 00:00:00",
              "EquipmentTested": "Chlorine scales, chlorine and sulfur dioxide detectors, self contained breathing apparatus (SCBA)",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3485,
                  "PreventionProgram2ID": 3396,
                  "ProcessChemicalID": 7076
                },
                {
                  "PrimaryKey": 3486,
                  "PreventionProgram2ID": 3396,
                  "ProcessChemicalID": 7077
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5482,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Tuscaloosa LEPC",
    "CoordinatingAgencyPhone": "2053490150",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5482,
      "SummaryText": "The City of Northport, Alabama Wastewater Treatment Plant is committed to the safety of its employees and the community at large by the use of current safety procedures and prevention programs in both day-to-day operations and in the event of a chemical release.  The emergency action plan developed for the Northport facility applies to the use of chlorine and sulfur dioxide in the waste treatment process.  The intent of the plan is to assist the City of Northport, Alabama in its efforts to preclude or mitigate episodic releases of chlorine or sulfur dioxide that could result in the catastrophic loss of personnel and property within the facility and possible the surrounding community.\n     The Wastewater Treatment Plant for the City of Northport, Alabama located at 3950 3rd Street, South, is the primary source of waste treatment for the City of Northport.  In the treatment of wastewater, hazardous chemicals may be employed.  At the Northport facility, chlorine and sulfur dioxide, delivered in 1-ton cylinders, are used as the primary chlorinating/dechlorinating agents.  The chemicals are stored in a building, approximately 100 feet from the main administration and operations building for the facility.  The same properties that make chlorine and sulfur dioxide valuable as a commodities also make it necessary to observe certain safety precautions in handling these chemicals to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as that of our co-workers, and to reduce the threat to nearby members of the community.  It is the Northport facility's policy to adhere to all applicable Federal and state rules and regulations.  Safety depends upon the manner in which we handle chlorine and sulfur dioxide, the safety devices inherent in the design of this facility, the safe handling procedures that we use, and the training of our personnel.\nChlorine has the following general properties:\n1.    Chlorine is a gas at room temperature.\n2."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5482,
      "SummaryText": "Chlorine becomes an amber liquid at -29.3 degrees F.  It is usually shipped as a liquid to conserve space.\n3.    Upon the release of chlorine from a cylinder, it boils and becomes a greenish-yellow gas.\n4.    Chlorine has an irritating odor (bleach).\n5.    Chlorine is 2 = times heavier than air, therefore, it usually gathers low to the ground.\n6.    Chlorine is soluble in water.  It combines to form hydrochloric acid which is highly corrosive.\n7.    NFPA hazard rating: Health - 3; Flammability - 0; Reactivity - 0; Special Hazard - Oxidizer.\n\nChlorine Health Hazards:\n1.    Minimum detection level for most individuals = 0.3 ppm.\n2.    At 3 - 6 ppm, chlorine causes irritation of the upper respiratory tract and mucous membranes.\n3.    The OSHA permissible exposure limit has a ceiling value of 1 ppm.\n4.    NIOSH has assigned 10 ppm as the IDLH value for acute chlorine exposure.\n5.    Exposure of skin and eyes can cause severe frostbite burns.\n6.    Acute health problems associated with chlorine gas include respiratory irritation, violent coughing, choking, nausea, dizziness, headaches, vomiting, chest pains, shortness of breath and pulmonary edema.\n\nSulfur Dioxide has the following general properties:\n1.    Sulfur dioxide is a colorless gas at room temperature.\n2.    Sulfur dioxide becomes a colorless liquid at 14 degrees F.  It is usually shipped as a liquid to conserve space.\n3.    Sulfur dioxide has an extremely pungent odor.\n4.    Sulfur dioxide is approximately 2 1/4 times heavier than air, therefore it usually gathers low to the ground.\n5.    Sulfur dioxide is soluble in water.  It combines to form sulfuric acid which is extremely corrosive.\n6.    NFPA hazard rating: Health - 3; Flammability - 0; Reactivity - 0\n\nSulfur Dioxide Health Hazards:\n1.    The lowest concentration detectable by odor for most individuals = 1.1 ppm\n2.    At 10 ppm, sulfur dioxide causes irritation of the upper respiratory tract and mucous membranes.\n3.    The IDLH assigned to sulfur diox"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5482,
      "SummaryText": "this facility, scenarios information was as follows:\n\n1.    Worst-case Scenario (Chlorine & Sulfur Dioxide)\n      A.    Models.\n            i.    A chemical cylinder (chlorine or sulfur dioxide) is dropped during the loading/unloading process.\n           ii.    A fire in or near the chemical feed room, melting a fusible plug or a faulty plug.\n      B.    Parameters.\n            i.    Total amount released = 2,000 pounds.\n           ii.    Released in the form of a gas, which is heavier than air.\n          iii.    Release rate = 200 lbs./min.\n         iv.    Release duration = 10 minutes\n      C.    Worst-case Area of Concern.\n            i.    For both chemicals, the radius of concern was 1.3 miles from the facility.\n      D.    Offsite Impacts.\n            i.    Population.\n                  (1)    Estimated residential population = 12,300 persons (using the most recently available data)\n                  (2)    Cresmont Elementary School, Tuscaloosa County High School, Northport Junior High\n                           School, Stillman College, Central Elementary School, Tuscaloosa County Training School, \n                           Riverside Junior High School, West End School, U. S. Army Corps of Engineers, Alabama \n                           State Docks Department and the Riverbluff Office Park.\n           ii.    Environmental.\n                  (1)    Kentuck Park and the Oliver Lock & Dam.\n\n2.    Alternative Release Scenario - Chlorine\n      A.    Models.\n            i.    The yoke on the chlorine cylinder is defective, malfunctions or is improperly installed onto a \n                  chlorine cylinder, resulting in an uncontrolled leak.\n           ii.    The valve packing leaks, or the yoke is not properly seated or tightened on the cylinder valve,\n                  resulting in an uncontrolled release from the cylinder.\n      B.    Parameters.\n            i.    Total amount released = 2,000 pounds.\n           ii.    Released in the form of a gas, which is he"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5482,
      "SummaryText": "ng used to prevent the hazards that are associated with a chlorine gas release.  These control measures originated and were applied in an effort to improve emergency response actions and to protect the emergency response personnel and the public at large.\n\nExisting Controls\n1.    Fixed Chlorine Monitor - Located in the storage room.  Detects chlorine present in the air from 0-5 ppm.  Upon detection, the monitor sounds both an audible and visual alarm.\n2.    Personal Chlorine Monitor - Portable, personal monitors are available for use during gas release episodes.  These monitors provide a way to quantitate the contamination levels.  This allows for the determination of the proper type of personal protective equipment deemed necessary and zones for evacuation purposes.\n3.    Leak Testing - Leaks within the chlorine system are determined using ammonia solution.  Chlorine will react with discharged ammonia vapor to produce a white cloud.\n4.    Emergency B Kit - This kit contains the required equipment to stop leaks at the valves, fusible plugs and in the wall of the cylinder (one-ton).\n5.    Buddy System - Activities involving the disinfection system, other than general maintenance, require a minimum of two workers to be present at all times.\n6.    Chemical Handling Schedule - Chemical cylinders are only manipulated during the day-shift.  This allow for the proper number of persons to be present.  Also, this relieves some of the difficulties that can be involved with the proper entities responding to a release during other times of the day.\n7.    Respiratory Protection Equipment - Respiratory equipment for the Northport facility consists of two Self-Contained Breathing Apparatus (SCBA) backpack units.  These units are to be used in atmospheres containing concentrations in excess of 5 ppm of chlorine, or 10 ppm of sulfur dioxide.\n     Under the RMP regulations the Northport facility developed two worst-case release scenarios and two alternative release scenarios.   For"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 5482,
      "SummaryText": "with all applicable state codes \n      and regulations.\n\u0015    This facility is also operated in accordance with recommendations from the Chlorine Institute.\n\u0015    The facility employs detectors and alarms to notify employees of problems for the purpose of causing a \n      more rapid response time.\n\u0015    The chemical feed systems are a vacuum type employing valves that close automatically in the event of \n      a loss of vacuum.\n\u0015    The alarms are equipped with a battery backup to ensure protection even in the event of a power \n      outage.\n\u0015    The Northport Wastewater Treatment Plant has not had an incident involving chlorine or sulfur dioxide \n      since the process was begun in 1994.\n\n     In the unlikely event of a major release, the operator(s) at the Northport Wastewater Treatment Plant are notified with audible alarms both inside and outside the facility.  Upon hearing this alarm, the operator(s) will dial 911 and leave the building.  Following the initial call, the notified first responders will arrive from the Northport Fire Department.  The responders will notify the Local Emergency Planning Commission, who will then notify the public as deemed necessary.  Employees are trained to quickly determine the level of emergency and thus the appropriate response.  They are also instructed and drilled in the emergency evacuation plans for the facility.  \n     The Northport Wastewater Treatment Plant has not had an incident involving chlorine or sulfur dioxide since the process was begun in 1994.  The Northport Wastewater Treatment Plant has made a commitment to continue to improve safety and plant operations in accordance with appropriate guidelines."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5482,
      "SummaryText": "ide = 100 ppm.\n4.    Exposure of skin and eyes can cause severe burns.\n5.    Acute health problems associated with sulfur dioxide include severe irritation of the nose, mouth, throat and the upper respiratory tract, shortness of breath, wheezing, choking, chest pain, impairment of lung function, pneumonia, headaches, dizziness, blurred vision, mental confusion, nausea, vomiting, severe diarrhea and death.\n\n     The Northport Wastewater Treatment Plant has a maximum intended inventory of 6,000 pounds of chlorine and sulfur dioxide (3 - 1 ton cylinders).  At any given time, however, the inventory on hand is 4,000 pounds or less of both chlorine and sulfur dioxide.  All procedures involving the disinfection system, other than general inspections, involve at least two employees.  Steps are taken to reduce the risk to employees and the local community alike, through the implementation of administrative controls and appropriate regulations.  In the event of a major chlorine or sulfur dioxide release, the operators of the Northport Wastewater Treatment Plant do not respond to stop the release directly.  The facility's policy is very simple.  In the event of an accidental release, the operator(s) are to:\n1.    Call 911.\n2.    Leave the building immediately.\n\n     According to the appropriate regulations, this allows the Northport Wastewater Treatment Plant to develop an emergency action plan instead of an emergency response plan.  The emergency action and evacuation plan for the Northport Wastewater Treatment Plant was developed in order to meet OSHA requirements under 29 CFR 1910.38(a).  The formal emergency evacuation plan is kept in readily available location within the main administration and operations building.  The plan has been discussed and coordinated with the Local Emergency Planning Committee and the City of Northport Fire Department.  The appropriate hazard control measures, engineering controls, administrative controls and personal protective equipment are bei"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5482,
      "SummaryText": "avier than air.\n          iii.    Release rate = 83.53 lbs./min.\n         iv.    Release duration = 24 minutes\n      C.    Alternative Release Area of Concern.\n            i.    For chlorine,  the radius of concern was 0.2 miles from the facility.\n      D.    Offsite Impacts.\n            i.    Population.\n                  (1)    Estimated residential population = 70 persons (using the most recently available data)\n                  (2)    No institutions affected within a 0.2 mile radius.\n           ii.    Environmental.\n                  (1)    Kentuck Park is the only possible environmental receptor.\n\n3.    Alternative Release Scenario - Sulfur Dioxide\n      A.    Models.\n            i.    The yoke on the sulfur dioxide cylinder is defective, malfunctions or is improperly installed onto a \n                  sulfur dioxide cylinder, resulting in an uncontrolled leak.\n           ii.    The valve packing leaks, or the yoke is not properly seated or tightened on the cylinder valve,\n                  resulting in an uncontrolled release from the cylinder.\n      B.    Parameters.\n            i.    Total amount released = 2,000 pounds.\n           ii.    Released in the form of a gas, which is heavier than air.\n          iii.    Release rate = 40.08 lbs./min.\n         iv.    Release duration = 50 minutes\n      C.    Alternative Release Area of Concern.\n            i.    For sulfur dioxide,  the radius of concern was 0.1 miles from the facility.\n      D.    Offsite Impacts.\n            i.    Population.\n                  (1)    Estimated residential population = 20 persons (using the most recently available data)\n                  (2)    No institutions affected within a 0.1 mile radius.\n           ii.    Environmental.\n                  (1)    Kentuck Park is the only possible environmental receptor.\n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\u0015    This facility complies with EPA's Accidental Release Prevention Rule and"
    }
  ]
}