{
  "FacilityID": 5484,
  "FacilityName": "Brick Township Municipal Utilities Authority",
  "FacilityStr1": "1551 Highway 88 West",
  "FacilityStr2": null,
  "FacilityCity": "Brick",
  "FacilityState": "NJ",
  "FacilityZipCode": "08724",
  "Facility4DigitZipExt": "2399",
  "FacilityCountyFIPS": "34029",
  "LEPC": "Ocean County OEM",
  "FacilityLatDecDegs": "40.076667",
  "FacilityLongDecDegs": "-74.142222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Brick Township Mun. Util. Auth.",
  "OperatorStr1": "1551 Highway 88 West",
  "OperatorStr2": null,
  "OperatorCity": "Brick",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08724",
  "OperatorZipCodeExt": "2399",
  "FTE": 130,
  "OtherEPAFacilityID": "NJD982720179",
  "EPAFacilityID": "100000069748",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-02 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 40.076785,
  "FRS_Long": -74.141692,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6475,
      "AltID": "Chlorination System",
      "FacilityID": 5484,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7079,
          "ProcessID": 6475,
          "ChemicalID": 62,
          "Quantity": 12100.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6631,
          "ProcessID": 6475,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2795,
              "Process_NAICS_ID": 6631,
              "SafetyReviewDate": "1998-11-06 00:00:00",
              "PHA_Date": "1997-08-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1997-08-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Portable Electrolytic Chlorine Detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-02 00:00:00",
              "TrainingReviewDate": "1998-11-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-11-06 00:00:00",
              "EquipmentInspectionDate": "1999-06-03 00:00:00",
              "EquipmentTested": "Chlorinating Vacuum Heads; Chlorine Ejector Vacuum Lines; Rotometers; Vacuum Gauges; Booster Pumps; Chlorine Scales",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1998-11-06 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-11-12 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-11-06 00:00:00",
              "HotWorkPermitReviewDate": "1998-11-06 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1998-11-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3187,
                  "PreventionProgram3ID": 2795,
                  "ProcessChemicalID": 7079
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5484,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-11-06 00:00:00",
    "ERTrainingDate": "1998-12-17 00:00:00",
    "CoordinatingAgencyName": "Brick Emergency Management Office",
    "CoordinatingAgencyPhone": "7322621100",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "New Jersey Department of Environmental Protection - Toxic Catastrophe Prevention Act"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5484,
      "SummaryText": "Brick Township Municipal Utilities Authority (BTMUA) has developed and implemented an accidental release prevention program for the hazardous substance identified below.\nLOCATION: Main Facility - Chlorination Process Hazardous Substance: Chlorine\n                   12,100 pounds is the maximum allowable inventory stored.\nCHLORINE STORAGE AND SUPPLY: The Chlorine supply system consists of five - one ton containers.  Four containers are connected to vacuum regulators, rotometers and water vacuum ejectors.  The system is completely under vacuum.  If the vacuum is lost for any reason, a spring loaded valve on each of the regulators immediately closes to stop the flow of chlorine gas.\nThe chlorine storage system is constructed of standard concrete block with red brick facing approximately 14 thick.  The building has a total volume of 5,081 cubic feet with two permanently sealed windows, two delivery bi-fold steel doors which are insulated and gasketed and one steel entrance door which is insulated and gasketed.  The chlorine storage system is monitored by two independent leak detection systems.\nListed below is a brief description of  B.T.M.U.A.'s risk management program as it pertains to the location detailed above.\nMANAGEMENT SYSTEM\n1. The goal of BTMUA's Risk Management Program  (RMP) is to reduce the risk to employees and the public of injury or death from accidental release of chlorine.  BTMUA's delineation of this RMP element details responsibilities which involves Directors, Supervisors, Regulatory Compliance Officer and Health and Safety Officer.\nPROCESS SAFETY INFORMATION\n2. BTMUA's RMP includes chlorine information on its toxicity, physical data, permissible exposure limits, reactivity data, corrosivity data, thermal and chemical stability data.  Information concerning the chlorination process chemistry, maximum inventory, safe upper and lower limits for temperature, pressures and flows or compositions, evaluation of consequences of deviations, piping and instr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5484,
      "SummaryText": "umentation diagram, materials of construction, electrical classification, ventilation system design, design codes and standards, safety systems, electrical one-line diagram, site plan, fire and sewer water system piping diagrams and external forces and events data are included in this element.  The Director of Technical Operations has overall responsibility for maintaining and implementing this RMP element in conjunction with the Process Control Supervisor and Health and Safety Officer.\nPROCESS HAZARD ANALYSIS (PHA)\n3. BTMUA has conducted Chlorination Process Hazard Analysis to identify, evaluate and control the risk associated with the hazards of the chlorination process.  Process Hazard Analysis Documentation includes analysis reports, dispersion modeling reports, action timetables and a record of meetings held in which process hazard analysis results are communicated. The Director of Technical Operations implements the PHA planning in coordination with the Technical Maintenance Supervisor and Health and Safety Officer.  These PHA's are conducted and throughly reviewed and re-validated at least every five (5) years following the completion of the initial report by an in house hazard analysis team.\nSTANDARD OPERATING PROCEDURES (SOP'S)\n4.  The purpose of this RMP element is to ensure that BTMUA maintains up-to-date accurate, \twritten SOP's that provide clear instructions for our chlorination system.  All procedures \twill contain simplified operating instructions as well as any attachments.  These procedures are reviewed annually to certify that they accurately reflect current operating practice.  Any revisions to SOP's that include changes in our process chemical, technology and equipment and facility changes will be addressed in our management of change.  The Technical Maintenance Supervisor has overall responsibility for implementing this element in coordination with the Health and Safety Officer.\nEXTRAORDINARILY HAZARDOUS SUBSTANCE (EHS) OPERATOR TRAINING\n5. The"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5484,
      "SummaryText": "es.  Hot work is defined an any work that many generate a source of ignition and includes but is not limited to welding, torch cutting, and use of spark-producing equipment.  The Technical Maintenance Supervisor is responsibility for hot work permit procedures.\nCONTRACTOR SAFETY\n13. The purpose of this element is to ensure that only contractors with good health and safety programs are selected to perform work on and around the main facility chlorination process,  and that the contractors and the process are properly prepared to safely complete the work.  The Supervisor in charge of employing the contractor and the Director of Technical Operations share jointly in the implementation of this RMP element. \nEMERGENCY PLANNING AND RESPONSE\n14. The purpose of this element is to ensure that BTMUA maintains up-to-date and complete written emergency action plans (EAP's) and effective response capabilities for the main facility chlorination process.  Comprehensive emergency action plans, when combined with emergency response training and drills, can effectively minimize the impact of an accidental release by ensuring proper and quick facility response.  BTMUA has coordinated with the Brick Township Emergency Management Division and the Ocean County Division of Emergency Management in the administration of it's Emergency Response Program.  The Director of Technical Operations and Health and Safety Officer will be responsible for implementing and maintaining the procedures in this RMP element.  The worst case toxic release of Chlorine is calculated at 2.5 miles (offsite impact) using ALOHA software.  The cement block storage building is used as passive mitigation and reduces the release rate by 45%.  The alternative case toxic release of Chlorine is calculate at .4 miles (offsite impact) using ALOHA software.  The cement block storage building is used as passive mitigation and reduce the release rate by 45%.  Release prevention methods and procedures have been researched and en"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5484,
      "SummaryText": "that this Authority is ready to safely operate these new procedures or to assure that everyone can successfully and safely carry out any modification to the main facility chlorination process.  The Director of Engineering is responsible for administering this RMP element in coordination with the Director of Operations, Technical Maintenance Supervisor, Regulator Compliance Officer, Process Control Supervisor, and Health and Safety Officer. \nCOMPLIANCE AUDITS\n9. The purpose of this RMP element is to ensure audits are performed to evaluate that BTMUA's chlorination process safety and risk management programs, and their implementation for compliance with the OSHA Process Safety Management and EPA/TCPA Risk Management Program Regulations.  This audit is completed annually under the direction of the Director of Technical Operations in coordination with the Technical Maintenance Supervisor, Process Control Supervisor, and Health and Safety Officer.\nACCIDENT INVESTIGATION\n10. All chlorine leak accidents or potentially catastrophic events at the Authority, will be promptly investigated.  The purpose of the accident investigation element is to identify the underlying causes of an accident and to implement corrective actions to prevent the accident from reoccurring.  The Technical Maintenance Supervisor is responsible for initiating this RMP element and ensures that any resulting corrective actions are addressed and documented. \nEMPLOYEE PARTICIPATION PLAN\n11. BTMUA recognizes that it is essential to involve its employees in the development and implementation of an OSHA PSM and EPA/TCPA RMP.  The purpose of this plan is to define how employees will be involved.  In each element of the RMP the Director of Technical Operations has overall responsibility for maintaining and implementing this plan.\nHOT WORK PERMIT \n12. The purpose of this element is to ensure that a hot work permit is issued for all hot work operations conducted near the main facility chlorination system process"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5484,
      "SummaryText": "purpose of this RMP element is to ensure that BTMUA employees who work on or near the chlorination system process are adequately trained and understand the inherent process hazards and what appropriate response actions to take in case of an accidental chlorine release.  This training consists of classroom and hands-on formats.  Refresher training is given periodically throughout the year based on regulatory requirements and operational need basis.  Training is monitored in a computer database, Training Tracker.  The Director of Technical Operations, Health and Safety Officer and Technical Maintenance Supervisor share overall responsibility for developing and maintaining this RMP Element.\nMECHANICAL INTEGRITY/PREVENTATIVE MAINTENANCE (P/M)\n6. The purpose of this RMP element is to ensure the continued integrity of all the chlorination process equipment.  The BTMUA PM Program identifies the direct and indirect EHS equipment as well as establishing, following and maintaining maintenance, inspection and testing schedules for this equipment.  The Technical Maintenance Supervisor has the overall responsibility for implementing this RMP Element.\nMANAGEMENT OF CHANGE\n7.  The purpose of this RMP is to ensure that BTMUA's chlorination process system changes are properly reviewed against original system design specifications.  This is to determine that these changes can be accomplished safely and the chlorination system is ready to operate safely in accordance with original system design intent following the implementation of the change.  Included in this element is document review, PHA development, employee training and record keeping.  The Technical Maintenance Supervisor has the overall responsibility for this element is coordination with the Health and Safety Officer.\nPRE-STARTUP SAFETY REVIEW (PSSR)\n8. Should any new processes regulated under OSHA Process Safety Management and EPA/TCPA RMP regulations be introduced into BTMUA operations, a PSSR will be performed to ensure"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5484,
      "SummaryText": "gineered into BTMUA's main facility chlorination system.  These include chlorine container construction and vendor historical information and the chlorine vacuum feed distribution system.  Mitigation system used is the construction of the storage building itself.  The storage building is monitored by two (2) leak detection systems, independent of each other, that control the ventilation system and activates the emergency response communication network.  Operator refresher and system update training are conducted in compliance with our operator training program.  The preventive maintenance program conducts schedule system inspections and maintenance to assure the proper operation of process and leak detection devices.  Management of change is monitored by the Director of Technical Operations to assure that this program stays current and implemented according to industry accepted standards for design and operation.  All incidents are investigated to determine root cause and system deficiency correction.  BTMUA has experienced no accidents in the past five years (1993 - 1998).\nBTMUA's Emergency Response Program was designed and updated according to the EPA's Integrated Contingency Plan Guidance.  This ER Plan defines the response organization, coordination with Brick Township and Ocean County Emergency Response Offices, equipment, response procedures, training, notification procedures and drills.  The ER Plan is updated according to recommendations resulting from system deficiencies uncovered by the periodic drills.\nBTMUA plans no safety improvements at this time because all current state of the art for design and operation is implemented."
    }
  ]
}