{
  "FacilityID": 54927,
  "FacilityName": "Cando Farmers Grain & Oil Coop - Egeland Location",
  "FacilityStr1": "7151 84th Street NE",
  "FacilityStr2": null,
  "FacilityCity": "Egeland",
  "FacilityState": "ND",
  "FacilityZipCode": "58331",
  "Facility4DigitZipExt": "0000",
  "FacilityCountyFIPS": "38095",
  "LEPC": "Towner County LEPC",
  "FacilityLatDecDegs": "48.637056",
  "FacilityLongDecDegs": "-099.122167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.candofarmersgrainandoilcoop.com",
  "FacilityEmailAddress": "Candofarmers@stellarnet.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cando Farmers Grain & Oil Coop",
  "OperatorStr1": "204 9th Street",
  "OperatorStr2": null,
  "OperatorCity": "Cando",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58324",
  "OperatorZipCodeExt": "9501",
  "RMPContact": "Vic Risovi",
  "RMPTitle": "RMP Implementation",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000034535",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-10-24 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "to epa dup amm ch",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 48.66026,
  "FRS_Long": -99.11166,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 80124,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 54927,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 82085,
          "ProcessID": 80124,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 106892,
          "ProcessID": 80124,
          "ChemicalID": 56,
          "Quantity": 263758.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 606892,
          "ProcessID": 80124,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54927,
      "SummaryText": "              Risk Management Plan (RMP) - Ammonia\n                       Executive Summary\n       Cando Farmers Grain & Oil Coop - Egeland Division\n                     Egeland, North Dakota         \n                                \n                                \n  1. Accidental Release Prevention and Emergency Response Policies\nWe at Cando Farmers Grain & Oil Coop - Egeland Division in Egeland, North Dakota are strongly\ncommitted to employee, public, and environmental safety.  This commitment is an inherent part of\nour comprehensive accidental release prevention program that covers areas such as design,\ninstallation, operating procedures, maintenance, and employee training associated with the processes\nat our facility.  It is our policy to implement appropriate controls to prevent possible releases of\nregulated substances.  We coordinate our response efforts with the Egeland Fire Department, which\nprovides additional emergency response expertise.\n\n  2. Stationary Source and Regulated Substances Handled\nOur facility's primary activities include support services for crop production.  We have anhydrous\nammonia stored in one 30,000-gallon tank, and a maximum of six twin 1,000-1,000 gallon nurse\ntanks, eleven 1,450-gallon nurse tanks, one 2,000-gallon nurse tank, one 1,850-gallon nurse tank and\nfifteen 1,000-gallon nurse tanks at our facility in Egeland, North Dakota.  The maximum\namount stored at 85% standard maximum storage capacity is 51,255 gallons (263,758.2 pounds)\nincluding the capacity of the maximum number of on-site nurse tanks at any given time.   The largest\nsingle storage vessel at our facility contains 131,223 pounds at  85% standard maximum storage\ncapacity.\n\n  3. Worst Case Release and Alternative Release Scenarios\n\n  4. General Accidental Release Prevention Program\nOur facility has taken all the necessary steps to comply with the EPA's accidental release prevention\nrequirements as set forth in 40 CFR part 68.  The following sections briefly describe "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54927,
      "SummaryText": "the elements\nof the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nCando Farmers Grain & Oil Coop - Egeland Division maintains a detailed record of safety\ninformation that describes the chemical hazards, operating parameters, and equipment designs\nassociated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are\nidentified and controlled effectively.  Any findings from the hazard analysis are addressed in a timely\nmanner.\n\nOperating Procedures\nCando Farmers Grain & Oil Coop - Egeland Division maintains written operating procedures to\nensure that activities within our covered processes are conducted safely.  These procedures address\nvarious modes of operation; the information is regularly reviewed and is readily accessible to\noperators involved in the processes.\n\nTraining\nCando Farmers Grain & Oil Coop - Egeland Division has a comprehensive training program in place\nto ensure that employees who are operating processes are competent in the operating procedures\nassociated with these processes. Training is done yearly prior to startup.\n\nMechanical Integrity\nCando Farmers Grain & Oil Coop - Egeland Division conducts documented maintenance checks on\nprocess equipment to ensure proper operation.  Maintenance checks are conducted by qualified\npersonnel with previous training in maintenance practices.  Examples of process equipment that\nwould receive maintenance checks include:  pressure vessels, storage tanks, piping systems, relief\nand vent systems, emergency shutdown systems, controls, and pumps.  Any equipment deficiencies\nidentified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Cando Farmers Grain & Oil Coop - Egeland Division to manage\nchanges in process chemicals, technology, equipment, and procedures.  Process operators,\nmaintenance personnel or oth"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54927,
      "SummaryText": "er employees whose job tasks are affected by a modification in process\nconditions are promptly notified of the modification and offered training to deal with it.\n\nPre-startup Reviews\nCando Farmers Grain & Oil Coop - Egeland Division routinely conducts pre-startup safety reviews\nrelated to new processes and modifications in established processes.  These reviews are conducted\nto confirm that construction, equipment, and operating and maintenance procedures are suitable for\nsafe startup prior to placing equipment into operation.\n\nCompliance Audits\nCando Farmers Grain & Oil Coop - Egeland Division conducts compliance audits on a regular basis\nto determine whether the plan's provisions, set out under the 40 CFR part 68, are being implemented. \nAny non-compliance issue discovered during the audit is promptly corrected.\n\nEmployee Participation\nCando Farmers Grain & Oil Coop - Egeland Division truly believes that process safety management\nand accident prevention is a team effort.  Company employees are strongly encouraged to express\ntheir views concerning accident prevention issues and to recommend improvements.  In addition,\nour employees have access to all information created as part of the facility's implementation of the\nRMP, particularly information resulting from process hazard analyses.\n\n  5. Five-year Accident History\nCando Farmers Grain & Oil Coop - Egeland Division has had an excellent record of preventing\naccidental releases over the last 5 years.  Due to our stringent release prevention policies, no\naccidental release has occurred during this period.\n\n  6. Emergency Response Plan\nCando Farmers Grain & Oil Coop - Egeland Division maintains a written emergency response plan to\ndeal with accidental releases of hazardous materials.  The plan addresses all aspects of emergency\nresponse including first aid and medical treatment, evacuations, and in the event of an accidental\nrelease, Cando Farmers Grain & Oil Coop - Egeland Division will contact local emergency respon"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54927,
      "SummaryText": "se\nagencies and the public. \n\n  7.  Planned Changes to Improve Safety\nWe will continue to provide our employees with ongoing annual training to ensure that they are\ncurrent with all of the safe ammonia transfer and handling procedures, and provide regular inspection\nand maintenance on all of the ammonia equipment.  Authorized personnel will make changes to the\nfacility if any audits of the facility identify non-compliance with Section 112 (r)(7), Accidental\nRelease Prevention Requirements of the Clean Air Act."
    }
  ]
}