{
  "FacilityID": 54985,
  "FacilityName": "Dandy Cooling Company~Cross Dock Services",
  "FacilityStr1": "1252 Growers Street",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.648056",
  "FacilityLongDecDegs": "-121.633056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 81840753,
  "ParentCompanyName": "Dandy Cooling, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Dandy Cooling, LLC",
  "OperatorStr1": "1252 Growers Street",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "FTE": 39,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000122066",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-07-17 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "RMP Update 2009",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 36.648056,
  "FRS_Long": -121.633056,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 80216,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 54985,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 106995,
          "ProcessID": 80216,
          "ChemicalID": 56,
          "Quantity": 21849.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 82180,
          "ProcessID": 80216,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 47357,
              "Process_NAICS_ID": 82180,
              "SafetyReviewDate": "2007-06-19 00:00:00",
              "PHA_Date": "2009-05-20 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-03-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Operator or technician error",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Programmable Logic Controllers",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ammonia water diffusion system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Integrated NH3 detector and alarm system",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Programmable Logic Controllers",
              "OpProceduresReviewDate": "2009-06-08 00:00:00",
              "TrainingReviewDate": "2007-06-19 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-06-19 00:00:00",
              "EquipmentInspectionDate": "2009-05-20 00:00:00",
              "EquipmentTested": "Process: PHA walkthrough",
              "ChangeMgmtDate": "2007-01-17 00:00:00",
              "ChangeMgmtReviewDate": "2007-06-19 00:00:00",
              "PreStartupReviewDate": "2008-12-23 00:00:00",
              "ComplianceAuditDate": "2007-06-19 00:00:00",
              "AuditCompletionDate": "2007-07-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-06-19 00:00:00",
              "HotWorkPermitReviewDate": "2007-06-19 00:00:00",
              "ContractorSafetyReviewDate": "2008-03-10 00:00:00",
              "ContractorSafetyEvalDate": "2007-06-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 69063,
                  "PreventionProgram3ID": 47357,
                  "ProcessChemicalID": 106995
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 54985,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-12-16 00:00:00",
    "ERTrainingDate": "2008-07-02 00:00:00",
    "CoordinatingAgencyName": "City of Salinas Fire Department",
    "CoordinatingAgencyPhone": "8317587261",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29 CFR 1910.120(q)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 54985,
      "SummaryText": "DANDY COOLING COMPANY~CROSS DOCK SERVICES\nCAL/ARP RISK MANAGEMENT PLAN LEVEL III \n\n1\tEXECUTIVE SUMMARY\n\t1.1   Accidental Release Prevention and Emergency Response Policies.\n\t1.2   General Description of The Stationary Source And Regulated Substances.\n\t1.3   Summary of The General Accidental Release Prevention Program and Chemical-  Specific Prevention Steps\n\t1.4   Summary of the Five-Year Accident History.\n\t1.5   Summary of the Emergency Response Program.\n\t1.6   Planned Changes to Improve Safety.\n\n1.1  Accidental Release Prevention and Emergency Response Policies\n\nThe Dandy Cooling Company, LLC~Cross Dock Services (DCC~CDS) Accidental Release Prevention and Emergency Response Policies are simply to not have accidental releases or emergencies.  The Company endeavors to execute this policy through the daily implementation of its Safety Programs.  Company safety programs include, but are not limited to a comprehensive Process Safety Management Program (PSM).  The PSM Program is an integrated approach to the safe operation of processes using Regulated Substances, and forms the Program Level III Prevention Program component of the RMP.  The DCC~CDS PSM Program is specifically designed and intended to prevent accidental releases, and to deal safely with emergencies if and when they do happen.  It is the primary goal of DCC~CDS to protect its employees, visitors and neighbors from harm due to Company operations.  With this in mind, the priorities of protection of life, the environment, and then property have been established.  \n\nThe Company also recognizes the need to be prepared to respond safely to accidental releases that could occur should established prevention programs fail. The Company has adopted a ¿Non-responding facility¿ policy and has established an Emergency Action Plan within its California Hazardous Material Business Plan. Emergency response pre-planning is coordinated through the local Certified Unified Program Agency (Monterey County Health Department) and"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 54985,
      "SummaryText": "the Salinas City Fire Department.  The local CUPA inspects the facility on a regular basis.  \n\nThe facility is supported by a partner company, Western Precooling Systems (WPS), which has offices and staff about ten miles from the facility.  WPS employs ammonia technicians trained beyond 1910.120(q) Awareness level.  These technicians would be notified to provide technical support in the event of an emergency.    \n\n1.2  General Description of the Stationary Source and Regulated Substances\n\nThe facility is a refrigeration plant located in Salinas, CA. and was constructed in the early 1980¿s.  In February of 1999, DCC~CDS became the owner and tenant.  The facility provides refrigeration effect for the removal of field heat from freshly harvested vegetables and subsequent short-term refrigerated storage, and is operated seasonally.  Product harvest period pick up in the month of April and finish in November.  Scheduled maintenance is performed in the remaining winter months.  Other commercial neighbors are located on the same site.\n\nThe Regulated Substance in use is anhydrous ammonia (NH3).  Refrigeration equipment consists of Refrigeration Trailers (Compression Units), Evaporative Consdensers, Pressure Vessels, HydroVac¿ Vacuum Tubes, Pressure Cooling Equipment, Cold Storage Room Evaporators and associated valves, instrumentation and piping.  The vacuum tubes are used to pre-cool agricultural product; the refrigerated storage portion of the facility is used for pressure cooling and short-term product storage.  Evaporators in the storage section of the facility maintain temperature until product is sold and shipped.  The refrigeration system is configured in a closed-loop system with isolation and overpressure relief valves installed in key areas.  Some of the equipment is portable and is used in different areas during the off-season.  DCC~CDS owns the fixed facility, stationary ammonia-handling equipment and several of the portable units.  DCC~CDS leases or is a partn"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 54985,
      "SummaryText": "tinuous improvements to the facility and ammonia refrigeration equipment.  Improvements include, but are not limited to:  \n¿\tSpecial self-closing valves were installed as a permissive for oil drain flow\n¿\tSeismic improvements\n¿\tAmmonia/water diffusion system\n¿\tAutomatic dialing machine that generates text messages to WPS Technicians if the refrigeration system approaches out-of tolerance parameters\n¿\tAmmonia sensors and alarms\n¿\tEquipment upgrades\n\nOther release prevention steps taken at Dandy Cooling Company~Cross Dock Services:\n\n¿\tDCC~CDS has enclosed the facility with fencing and gates to limit access to the facility to increase the security of the facility from potential ¿wrong-do-ers¿.\n¿\tEmployees are trained for hazard communication (discovery and communicating) for releases, fires, vandals etc.  Training is documented.\n¿\tA strong relationship exists with the Monterey County Health Department (CUPA).  DCC~CDS has worked closely with the CUPA in the planning and execution of refrigeration system improvements\n¿\tDCC~CDS and WPS are long-term sponsors of the Salinas Area Ammonia Safety Day.  The Safety Day includes specialized classes and promotes ammonia safety.\n¿\tStaff is trained in the benefits of good housekeeping.  The general appearance of the facility is maintained on a day-to-day basis.\n\n1.4  Summary of the Five-Year Accident History\n\nThere have been no qualifying accidental releases at the site over the last five years.   There is no qualifying data to report.\n\n1.5  The Emergency Response Program\n\nDCC~CDS does not require its employees to participate in conducting emergency response activities under the HAZWOPER standard (non-responding facility). In the event of an ammonia emergency, the response is to evacuate and to notify the local response agencies.  Employees are trained on hazard communications procedures. \n\nAmmonia release emergency response would be done by the Salinas City Fire Department.  DCC~CDS has coordinated emergency response with the Fir"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 54985,
      "SummaryText": "e Department including the installation of a Knox Box.  WPS would also be notified in case of a release.  WPS is located about 10 miles from the facility and employs technicians trained beyond 29 CFR 1910.120(q) Awareness level.  The Technician¿s role would be to support the Fire Department if an ammonia emergency occurs.  Ammonia emergency equipment is maintained under the control of WPS.  WPS maintains written ammonia emergency procedures.\n\n1.6   Planned changes to improve safety\n\nThe primary mechanisms to identify and plan safety improvements include (but are not limited to):\n¿\tProcess Hazard Analysis revalidation/update;\n¿\tCal/ARP Seismic Assessment;\n¿\tCompliance Audits;\n¿\tRoutine maintenance (Mechanical Integrity Program);\n¿\tTriennial IIAR Bulletin 109 Inspections; and\n¿\tDCC~CDS & WPS Inspection Protocols\n\nEach of the Programs above may result in recommendations ranging from capital improvements to routine maintenance of the plant.  When appropriate Service Calls are established in parallel to identified needs.  Current planned changes to improve safety include recent PHA Revalidation and other recommendations:\n¿\tAddition of an HLL switch on an accumulator;\n¿\tSpecialized training for paint maintenance personnel;\n¿\tAdditional barriers to be added for traffic control and collision avoidance (inside and out)\n¿\tValidation of SOP¿s, PID¿s and Valve Tags\n¿\tImproved pipe labeling after paint maintenance \n¿\tManagement has heightened awareness of security and human error risks\n¿\tAdd signs as noted at PHA walk-through\n¿\tReplace Relief Valves as instructed by Engineer\n¿\tAdd relief valve carry-away piping\n¿\tAdd plug to R-13 PRV header (one side)\n¿\tOther minor repairs as shown at walk-through\n\nImplementation of these measures has commenced according to the schedule set by the management of DCC."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 54985,
      "SummaryText": "er with WPS in other portable refrigeration equipment. Portable refrigeration equipment is common in the industry.\n\n1.3  General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nAccidental Release Prevention Program\n\nA comprehensive Process Safety Management Program (PSM) has been established in accordance with CCR 8, 5189.  The PSM Program is specifically intended to promote the safe operation of ammonia-handling equipment and process, and to prevent accidental releases.  DCC~CDS strives to make the PSM Program an integral part of daily Plant operation.  Other safety programs are integrated with the PSM Program, to the extent practicable and appropriate.\n\nDCC~CDS has delegated maintenance of its ammonia refrigeration equipment to WPS.  WPS is a reputable state-wide provider of ammonia refrigeration equipment and services, and has developed comprehensive written procedures for the maintenance of ammonia-handling equipment, including the steps to be taken in the event of a release or threatened release.  Written procedures include necessary safety precautions, from installation and start-up to tear-down and removal of portable equipment.  As equipment inspection or maintenance needs are determined, the need is expressed at workload meetings conducted by the WPS Area Manager.  The specific repair task or upgrade for the expressed need is decided by the WPS Area Manager and entered into the Service Call system. Tasks are then tracked through the system.  Through this regular routine of inspect, discuss, assign and confirmation of completion, DCC~CDS and WPS have reduced equipment operational problems and also reduced release potential.\n\nWPS actively encourages its ammonia Technicians to seek Certification through the Refrigerating Engineers and Technicians Association (RETA).  Technicians only perform tasks for which they have been pre-qualified.\n\nChemical-Specific Prevention Steps\n\nSince occupying the facility in 1999, DCC~CDS has made con"
    }
  ]
}