{
  "FacilityID": 55652,
  "FacilityName": "Pitman Creek Wastewater Treatment Plant",
  "FacilityStr1": "475 Pitman Creek Road",
  "FacilityStr2": null,
  "FacilityCity": "Somerset",
  "FacilityState": "KY",
  "FacilityZipCode": "42502",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21199",
  "LEPC": "Pulaski County LEPC",
  "FacilityLatDecDegs": "37.045556",
  "FacilityLongDecDegs": "-084.596667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "cityofsomerset.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 74049016,
  "ParentCompanyName": "City of Somerset, KY",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Somerset",
  "OperatorStr1": "104 College",
  "OperatorStr2": "PO Box 989",
  "OperatorCity": "Somerset",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40502",
  "OperatorZipCodeExt": "0989",
  "RMPContact": "Charles Dick",
  "RMPTitle": "General Manager",
  "FTE": 5,
  "OtherEPAFacilityID": "KY985109362",
  "EPAFacilityID": "100000057387",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-06-01 00:00:00",
  "SafetyInspectionBy": "KY OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-01 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-08-12 00:00:00",
  "DeRegistrationEffectiveDate": "2011-07-07 00:00:00",
  "AnniversaryDate": "2014-06-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 37.0455,
  "FRS_Long": -84.59633,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "No other substances located on the treatment site are listed on 40 CFR Part 68.",
  "_processes": [
    {
      "ProcessID": 80978,
      "AltID": "Chlorination",
      "FacilityID": 55652,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 82951,
          "ProcessID": 80978,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 107793,
          "ProcessID": 80978,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 607793,
          "ProcessID": 80978,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55652,
      "SummaryText": "Pitman Creek Wastewater Treatment Plant, located at 475 Pitman Creek Road, Somerset, KY, has one independent chlorine and one independent sulfur dioxide injection system.  The facility normally has a maximum of two (2) one-ton chlorine containers and four (4) 150-pound cylinders at the site at any one time.  All containers/cylinders are stored in the chlorine feed room.  Also, the chlorination and sulfur dioxide injector processes are located inside the chlorine feed room.  The chlorine system has one (1) one-ton container of chlorine on line and one (1) one-ton container of chlorine on standby at any one time.  The system is operated under vacuum using gaseous chlorine.  The chlorine container feeds a Fisher & Porter Vacuum Regulator and Flow Controller which automatically shuts off the container if there is a break in the vacuum line.  The chlorine supply system can automatically switch between the on-line and standby chlorine containers when the on-line containeris depleted.  The sulfur dioxide system has one (1) 150-pound cylinder of sulfur dioxide on line and one (1) 150-pound cylinder of sulfur dioxide on standby at any one time.  The system is operated under vacuum using gaseous sulfur dioxide.  The sulfur dioxide cylinder feeds a Fisher & Porter Vacuum Regulator and Flow Controller which automatically shuts off the cylinder if there is a break in the vacuum line.  The sulfur dioxide supply system can automatically switch between the on-line and standby sulfur dioxide cylinders when the on-line cylinder is depleted.  Since the quantity of sulfur dioxide stored at the facility is below RMP thresholds, toxic release scenarios are not reported for this chemical.  However, the facility's RMP covers both chlorine and sulfur dioxide.  The facility has chlorine and sulfur dioxide detectors to monitor leakage in the chlorinator/injector room.  The sensors are located at about twelve inches above the floor level.  The detectors will automatically alarm at the facility"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55652,
      "SummaryText": " and at the main control room panel.  During chlorine deliveries, the delivery truck backs up to the unloading area and the containers are taken off the truck via the facility's hoist/crane and placed into the chlorine fed room.  Sulfur dioxide cylinders are rolled, on end, out of the truck into the chlorine feed room.  Normally, the chlorinator/injector room is secured with doors that remain closed except when the system is being inspected.  Inspection takes place daily.  If a chlorine/sulfur dioxide leak is detected, the respective alarm will sound and the operator will notify the plant supervisor and appoint a standby.  The operator and standby will don a self-contained breathing apparatus (SCBA) and the operator will then investigate the cause for the alarm.  The exhaust fans will be activated from the exterior of the building.  The air inside the building is evacuated and fresh air is drawn into the building through upper and lower vents respectively.  The standby will remain outdoors in contact with the operator ready to call for outside assistance if needed.  The operator and the standby are trained in safety and emergency procedures.  The operator will shut off the cylinder.  If leakage is not stopped, the Pulaski County LEPC will be contacted and the exhaust fans will be shut down to try and contain the leak within the building.  The facility has not had an accidental release of chlorine from this covered process in the five years prior to the submission of the Risk Management Plan (RMP)."
    }
  ]
}