{
  "FacilityID": 55765,
  "FacilityName": "GateFront, LLC - Corpus Christi, Texas",
  "FacilityStr1": "7002 Marvin L. Berry Road",
  "FacilityStr2": null,
  "FacilityCity": "Corpus Christi",
  "FacilityState": "TX",
  "FacilityZipCode": "78409",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48355",
  "LEPC": "Nueces County LEPC",
  "FacilityLatDecDegs": "27.828361",
  "FacilityLongDecDegs": "-097.499722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 830669920,
  "ParentCompanyName": "Helena Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 7036759,
  "Company2DUNS": 0,
  "OperatorName": "GateFront, LLC",
  "OperatorStr1": "P.O. Box 10739",
  "OperatorStr2": null,
  "OperatorCity": "Corpus Christi",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78460",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff Holley",
  "RMPTitle": "Terminal Manager",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000208839",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81161,
      "AltID": "Merchant Wholesale",
      "FacilityID": 55765,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83138,
          "ProcessID": 81161,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108029,
          "ProcessID": 81161,
          "ChemicalID": 56,
          "Quantity": 145680.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608029,
          "ProcessID": 81161,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55765,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe GateFront, LLC (GateFront) Corpus Christi Facility has submitted this electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68.  This electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Corpus Christi Bulk Terminal Facility located at 7002 Marvin L. Berry Road, Corpus Christi, Texas 78409.  The electronic RMP summarizes the policies and procedures implemented by the Corpus Christi Facility to minimize the likelihood of an accident. The electronic RMP also summarizes the actions that the Corpus Christi facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner. \n\nPURPOSE OF RMP\n\nGateFront has filed this RMP because it plans to store anhydrous ammonia in railcars.  An independent contractor will react the ammonia with phosphoric acid and water to make liquid fertilizer. \n\nFACILITY\n\nThe Corpus Christi Bulk Terminal Facility is an agricultural chemical blending and distribution facility.  This facility was recently constructed and is expected to begin operations by July 2009.  Anhydrous ammonia is unloaded from a railcar and batch processed through a reactor.  The process operations conducted at this facility are performed by an Independent Contractor.  The Independent Contractor performs the batch reactor operations using a mobile pipe reactor.  The batch operations consist of unloading the anhydrous ammonia from the railcar into the reactor and mixing it with water and phosphoric acid to produce ammonium phosphate fertilizer.  The contractor is responsible to OSHA for Process Safety Management compliance and to EPA for Risk Management Planning.  GateFront Chemical Company does not own or operate the reaction process.\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\nWorst case and alternative consequence"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55765,
      "SummaryText": " analysis were completed for the ammonia storage process.  The worst-case scenario release for the Corpus Christi Facility assumed that all the contents in a single railcar were released. The release modeled as if the railcar was punctured on the side at the ground level.  The resulting release of ammonia was modeled as a ground level horizontal jet.\n\nThe alternative (or more likely to occur) scenario assumes the rupture of a three inch line caused by an impact from a vehicle or some other source on the liquid ammonia transfer line during a major loading or unloading operation.  Although this event is classified as an alternative scenario, even an accident of this type is unlikely to occur due to the safety equipment and operating procedures that the contractor will use to safeguard ammonia transfer operations.\n\nACCIDENT PREVENTION PROGRAM\n\nThe Terminal Manager implements the risk management planning process at this GateFront facility. The Terminal Manager is assisted by other GateFront staff as directed.  The fertilizer reaction process is implemented by an Independent Contractor.\n\nTo ensure that its Contractor is responsible to GateFront for complying with relevant operation, maintenance, training procedures and documentation, the contractor must, at a minimum:\n\n?    Have in place and certify compliance with an OSHA Process Safety Management Plan (PSM);\n?    Make available to GateFront and EPA upon request, any documentation necessary to comply with the PSM;\n?    Have in place Emergency Shutdown Procedure and Review, certify and comply with GateFront?s emergency notification and evacuation procedures.\n\nAll of GateFront?s contractors subject to this standard will be required to acknowledge and sign an Independent Contractor Certification Statement. GateFront will provide a copy of its Contingency Plan and RMP to its contractors for review and implementation.  GateFront personnel are responsible for providing notification to the Local Emergency Committee (LEPC) and Fire Depa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55765,
      "SummaryText": "rtment when its contractor intends to operate the reactor.\n\nEMERGENCY RESPONSE PROGRAM\n\nGateFront, LLC?s Corpus Christi Facility is a non-responding facility.  GateFront has coordinated emergency response activities with its local emergency response agency and local fire department.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no on-site deaths, injuries or significant property damage; or of-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Corpus Christi Facility.\n\nCONCLUSION\n\nThe Risk Management Plan implemented by GateFront at the Corpus Christi Facility complies with the requirements of the Clean Air Act, Section 112(r).  The RMP will be updated as the Corpus Christi Facility adds, deletes or changes processes.  The Emergency Response Program has been coordinated with the Nueces County LEPC."
    }
  ]
}