{
  "FacilityID": 55778,
  "FacilityName": "Jeff Davis Reservoir Water Treatment Plant",
  "FacilityStr1": "1500 Ridge Road.",
  "FacilityStr2": null,
  "FacilityCity": "Glencoe",
  "FacilityState": "CA",
  "FacilityZipCode": "95232",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06009",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.344444",
  "FacilityLongDecDegs": "-120.579833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.goldrush.com/~cpud/index.html",
  "FacilityEmailAddress": "cpud@goldrush.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Calaveras Public Utiltity District",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Calavaras Public Utility District",
  "OperatorStr1": "P.O. Box 666",
  "OperatorStr2": null,
  "OperatorCity": "San Andreas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95249",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Ornellas",
  "RMPTitle": "District Manager",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000166018",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-06-05 00:00:00",
  "SafetyInspectionBy": "JPIA Insurance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-05-20 00:00:00",
  "DeRegistrationEffectiveDate": "2019-05-10 00:00:00",
  "AnniversaryDate": "2014-07-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 38.34444,
  "FRS_Long": -120.57983,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "1000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81180,
      "AltID": null,
      "FacilityID": 55778,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83159,
          "ProcessID": 81180,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108048,
          "ProcessID": 81180,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608048,
          "ProcessID": 81180,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55778,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1. Accidental Release Prevention and Emergency Response Policies \n\nThe Jeff Davis Reservoir Water Treatment Plant (WTP) of the Calaveras Public Utility District located at 1500 Ridge Road. In Glencoe, California. Uses chlorine which is considered a hazardous material, a regulated substance, and is considered in this Risk Management Plan (RMP). The properties of chlorine make it necessary to observe safety precautions in handling chlorine to prevent human exposure, and to reduce the threat to the facility's workers and nearby members of the community. It is the facility's policy to adhere to all applicable Federal and State rules and regulations. Safety depends upon the safe procedures used to handle chlorine; the safety devices and systems designed and constructed into the facility; and the training of the pertinent personnel.\n\n2. Stationary Source and Regulated Substances Handled\n\nThe WTP is designed to treat water.  The WTP uses chlorine in the pre-chlorination of raw water for disinfection  plus oxidation of any iron, manganese or organics in the water; and for disinfection of the finished water.  Chlorine is delivered by a commercial supplier in one-ton containers for use at the WTP.  Off-loading of the one-ton container from the commercial delivery vehicle is accomplished with a two ton hoist.  A one-ton container is placed in the chlorine storage area on a steel cradle that has a load-cell with a dial scale.  A one-ton containers is connected on-line, and another one-ton container is in storage.  There is manual transfer and changeover.\n\nThe WTP has administrative procedures in place to limit the amount of chlorine at the facility to no more than two of the one-ton containers for a total 4,000 pounds.  Delivery of chlorine in the one-ton containers is during normal working hours. The driveway provides adequate room for the delivery and parking of the delivery vehicles during the off-loading of the full one-ton container, and the loading of t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55778,
      "SummaryText": "he empty one-ton container.  The chlorine building is locked after normal working hours. No unauthorized personnel are allowed entry into the chlorine building. The container storage and handling is conducted pursuant to per Sections 2.6, 2.7, and 2.8 of the Chlorine Institute's Chlorine Manual.\n\nThis WTP operates twenty four hours per day, seven day a week.  The chlorine gas is withdrawn from the one-ton containers by vacuum. This vacuum is created by plant potable service water passing through an injector.  This vacuum withdraws gas from the one-ton container at a controlled feed rate set by the operators at the rotometer. The chlorine gas is injected into the feed water line, where it becomes a chlorine/water solution and is feed where it is needed in the treatment process. The container storage room has a exhaust system, chlorine leak detector, and alarm system.  The vacuum valve is vented to the outside if the diaphragm malfunctions.\n\n3a. Administrative Controls\n\nAdministrative controls to limit the distance for each report scenario exists to restrict to a minimum, the amount of chlorine lost from a one-ton container if accidental release were to occur. This administrative control is inherent in the operational procedures for the chlorine process system and the training provided to the operators of the process system.\n\n3b. Mitigation Measures\n\nMitigation measures to limit the distances for each reported scenario exist to restrict the amount of chlorine released to a minimum if released were to occur. The mitigation measures are based upon the design, inspection, testing, and maintenance of the chlorine process system, and their related equipment and components.\n\n4. General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nThe facility complies with all applicable federal and state codes and regulations. There are safety meetings and safety training.  The Process Safety Management (PSM.) program implemented at the facility for the chl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55778,
      "SummaryText": "orine process system and the related activities and equipment represents the facility's main active commitments to an accidental prevention program.\n\n5. Five Year Accident History\n\nThere has been no accidental release of chlorine in the last five years.\n\n6. Emergency Response Program\n\nThe Emergency Response Program is based upon alerting personnel at the facility to evacuate the facility and await the arrival of responders from the Fire Department at the evacuation assembly location if a release occurs that causes the evacuation to be initiated.  The Calaveras County Environmental Health can incorporate this response into the Area Plan for the Local Emergency Planning Committee.\n\n7. Planned Changes to Improve Safety\n\nThere are commitments made under the Process Hazard Analysis element of the Process Safety Management (PSM) that are planned to be implemented over the next year. Current applicable codes and regulations are reviewed as part of the PSM to determine if other commitments need to be made to achieve increased operational safety for the regulated chlorine process system. These commitments will be prevention and mitigation measures for the accidental releases of the regulated substance."
    }
  ]
}