{
  "FacilityID": 55800,
  "FacilityName": "Keller Water Treatment Plant",
  "FacilityStr1": "3655 Keller Circle",
  "FacilityStr2": null,
  "FacilityCity": "Tarpon Springs",
  "FacilityState": "FL",
  "FacilityZipCode": "34689",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12103",
  "LEPC": "Tampa Bay LEPC",
  "FacilityLatDecDegs": "28.146944",
  "FacilityLongDecDegs": "-082.673056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 780872297,
  "ParentCompanyName": "Pinellas County Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pinellas County Utilities",
  "OperatorStr1": "14 South Fort Harrison",
  "OperatorStr2": null,
  "OperatorCity": "Clearwater",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33756",
  "OperatorZipCodeExt": null,
  "RMPContact": "James R. Rolston",
  "RMPTitle": "Chief of Operations",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000041395",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-01 00:00:00",
  "SafetyInspectionBy": "LEPC, District 8",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "2009",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-04-09 00:00:00",
  "DeRegistrationEffectiveDate": "2015-01-01 00:00:00",
  "AnniversaryDate": "2014-07-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 28.15205,
  "FRS_Long": -82.67576,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Replaced chlorine gas with Bleach Feed",
  "_processes": [
    {
      "ProcessID": 81210,
      "AltID": "Chlorination",
      "FacilityID": 55800,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83189,
          "ProcessID": 81210,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108081,
          "ProcessID": 81210,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608081,
          "ProcessID": 81210,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 81211,
      "AltID": "Ammonium Hydroxide",
      "FacilityID": 55800,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83190,
          "ProcessID": 81211,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108082,
          "ProcessID": 81211,
          "ChemicalID": 57,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608082,
          "ProcessID": 81211,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55800,
      "SummaryText": "KELLER WATER TREATMENT FACILITY\n\nEXECUTIVE SUMMARY\n\nThe Keller Water Treatment Facility is a facility whose primary activity is the treatment of  potable\nwater.  The Facility uses one regulated substance, chlorine (CAS 7782-50-5) as a disinfectant to treat\npotable water during the chlorination process.  The chlorination process consists of chlorine storage\nand the chlorination system used to disinfect potable water.  The chlorination process begins with\nthe withdrawal of chlorine from the chlorine cylinders by a vacuum created by vacuum regulators\nmounted on the cylinders.  The chlorine gas travels through PVC pipes to chlorinators, where the\nchlorine supply is regulated and measured.  From the chlorinators, chlorine is mixed with effluent\nwater by chlorine injectors to produce a solution which is injected into the potable water for\ndisinfection.  \n\nThe hazard assessment was performed on the chlorination process using the United States\nEnvironmental Protection Agency (USEPA) RMP*CompTM. Model.  The worst-case release scenario\nwas assumed to be the release of a one ton cylinder for a duration of 10 minutes in an enclosed\nbuilding.  The alternative release scenario selected for the Facility was a failure scenario developed\nduring the process hazard review and analysis.  In this scenario, a 3/8-inch diameter whip connecting\na one-ton cylinder to the chlorination manifold is sheared off, creating a leak in the system.  The\nFacility has the capability of responding to and stopping the leak within one hour of detection.  For\nboth scenarios, the off-site consequence analysis indicated that off-site receptors could be potentially\nimpacted by the release of chlorine.  Although off-site areas would be impacted, we believe that\nsafety procedures and mitigation measures will reduce the potential for off-site consequences and\nsubsequent risks to the surrounding community.  Our safety devices include chlorine leak detectors,\nalarms, and an automatic system shut-off feature trigge"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55800,
      "SummaryText": "red by a loss in system vacuum.  In addition,\nthe chlorine cylinders are housed in a building with exhaust fans and vents which would dilute the\nchlorine gas concentration should a release occur.\n\nIn order to fulfill the requirements of the Risk Management Program (RMP), we have developed an\naccidental release prevention program and emergency action plan for our facility. The accidental\nrelease prevention program satisfies the requirements for the EPA RMP and the Occupational Safety\nand Health Administration's (OSHA) Process Safety Management (PSM) program.  The prevention\nprogram ensures that our facility is operated under safe conditions and that any risk of an accidental\nrelease of chlorine is minimized.  The program has been written to reduce the potential of an\naccidental release due to human error, or equipment failure at our facility.  In order to prevent the\nrelease of chlorine due to human error, our prevention program ensures that operating procedures\nare current and reviewed annually.  Training also plays a vital part in our program.  Employees and\ncontractors working near or on the chlorination process are required to be trained in the chlorination\nprocess and the hazards of chlorine.   \n\nTo prevent equipment failure that could result in an accidental release, our program ensures that\nequipment inspections, tests, and preventive maintenance in accordance with accepted engineering\npractices and includes manufacturer's recommendations.  All chlorine cylinders are examined upon\ndelivery and are rejected if there are any signs of damage.  In addition, equipment pertaining to the\nchlorine process is visually inspected daily.  The potential for a chlorine release is greatly reduced\nin the chlorination process due to the use of a vacuum system from the point of chlorine withdrawal\nto its point of application.  In the event that there is a failure in chlorination equipment, the system\nwill automatically shutoff (i.e. failsafe).  \n\nAll existing and proposed futur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55800,
      "SummaryText": "e chlorination equipment have been designed according to applicable\nstandards and codes.  The Facility maintains records and documentation on equipment inspection\nand tests.  Precautions are taken to ensure that new equipment and processes are inspected and tested,\nthat all changes on the process are authorized, and employees are informed of changes.\n\nThe Facility performed a Process Hazard Analysis (PHA) to address the hazards in the chlorination\nprocess and to evaluate and control where the potential for a chlorine release exists.  Employees were\ninvolved in determining hazards of the process and subsequent consequences.  The chlorination\nprocess was found to be operating safely and no changes were recommended. \n  \nActive employee participation will ensure the success of the RMP at our facility.  Employees have\nbeen assigned various tasks to ensure that all elements of the RMP are implemented.  We have\ndeveloped many different forms to assist employees in recording and documenting the various\nelements of the RMP. \n\nAt the time of the submittal of this Risk Management Plan, there have been no accidental releases\nof chlorine at our facility in the past five years.  However, in the event that there is an accidental\nrelease of chlorine, an Emergency Action Plan has been written in compliance with 29 CFR 1910.38. \nThe Facility is also included in the community emergency response plan.  Employees at our facility\ndo not respond to accidental releases of chlorine, but coordinate with outside responders.  Therefore,\nin accordance with 40 CFR 68.90, an Emergency Response Program is not required for our facility. \nIn the event that a chlorine release occurs, all employees are required to evacuate the process area\nand report the incident.  The emergency action plan consists of evacuation procedures, facility\nemergency numbers, and coordination with East Lake Fire and Rescue.  The plan also addresses\nnotification procedures to the public and the local emergency response agency"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55800,
      "SummaryText": ".   \n \nWe conducted a neighborhood open house under the Local Emergency Planning Committee's\n(LEPC) Safety Street program and are willing to conduct tours of our facility for members of the\npublic."
    }
  ]
}