{
  "FacilityID": 55818,
  "FacilityName": "Lost Pines 1 Power Plant",
  "FacilityStr1": "256 Power Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Bastrop",
  "FacilityState": "TX",
  "FacilityZipCode": "78602",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48021",
  "LEPC": "Bastrop County LEPC",
  "FacilityLatDecDegs": "30.147778",
  "FacilityLongDecDegs": "-097.271389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lcra.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 112045708,
  "ParentCompanyName": "Gentex Power Corp.",
  "Company2Name": "Lower Colorado River Authority",
  "CompanyDUNS": 71023449,
  "Company2DUNS": 0,
  "OperatorName": "GenTex Power Corporation",
  "OperatorStr1": "256 Power Plant Road",
  "OperatorStr2": null,
  "OperatorCity": "Bastrop",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78602",
  "OperatorZipCodeExt": null,
  "FTE": 59,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000175017",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00021",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Anhydrous Ammonia for SCR",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 30.14731,
  "FRS_Long": -97.27006,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81233,
      "AltID": "Ammonia Storage",
      "FacilityID": 55818,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 108106,
          "ProcessID": 81233,
          "ChemicalID": 56,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 83212,
          "ProcessID": 81233,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 47693,
              "Process_NAICS_ID": 83212,
              "SafetyReviewDate": "2009-10-08 00:00:00",
              "PHA_Date": "2009-10-08 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-10-02 00:00:00",
              "TrainingReviewDate": "2009-03-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-10-19 00:00:00",
              "EquipmentInspectionDate": "2007-04-06 00:00:00",
              "EquipmentTested": "Ammonia transfer piping",
              "ChangeMgmtDate": "2005-03-09 00:00:00",
              "ChangeMgmtReviewDate": "2007-10-19 00:00:00",
              "PreStartupReviewDate": "2001-03-30 00:00:00",
              "ComplianceAuditDate": "2010-03-22 00:00:00",
              "AuditCompletionDate": "2010-09-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-03-22 00:00:00",
              "HotWorkPermitReviewDate": "2009-10-08 00:00:00",
              "ContractorSafetyReviewDate": "2010-03-22 00:00:00",
              "ContractorSafetyEvalDate": "2007-10-19 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia Storage",
              "_chemicals": [
                {
                  "PrimaryKey": 69621,
                  "PreventionProgram3ID": 47693,
                  "ProcessChemicalID": 108106
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 55818,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-06-02 00:00:00",
    "ERTrainingDate": "2009-04-01 00:00:00",
    "CoordinatingAgencyName": "Bastrop Fire Department",
    "CoordinatingAgencyPhone": "5123215550",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "40 CFR 60, 40 CFR 70, 40 CFR 75"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55818,
      "SummaryText": "The Lower Colorado River Authority (LCRA) and GenTex Power Corp.  Has a long-standing commmitment to worker and public safety.  The commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  It is the policy of LCRA/GenTex to implement reasonable controls to prevent forseeable releases of regulated substances.\n\nDescription of the Stationary Source and Regulated Substances\nThe Lost Pines 1 Power Plant, located in Bastrop County, Texas, is a gas-fired combined cycle power plant that produces electricity.  As a means of reducing nitrogen oxide emissions from the two gas-fired combustion turbines, anhydrous ammonia is injected into the turbine exhaust streams.  The anhydrous ammonia is stored on-site in two storage tanks located on opposite sides of the plant.  The capacity of each tank exceeds the threshold quantity for RMP applicability.\n\nAccidental Release Prevention Program\nLost Pines 1 is subject to OSHA's PSM standard and Program 3 of EPA's RMP rule.  The accidental release prevention program at Lost Pines 1 includes:\n\nAll Lost Pines 1 employees are actively encouraged to participate in the accidental release prevention program.  Each employee is encouraged to participate in the continual upgrade and maintenance of all health and safety programs.  Employee involvement is achieved through direct participation on a voluntary basis, active consultation with affected employees, and representative participation in the process hazard analysis.  Employees have access to all information required under the PSM and RMP regulations.\n\nProcess Safety Information\nLost Pines 1 maintains a variety of technical documents to ensure that the process hazards are understood and that the plant is operated and maintained in a safe manner.  These documents include information concerning the hazards of ammonia, process technology, and process equip"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55818,
      "SummaryText": "ment.  This information is updated when changes are made to processes.\n\nInformation concerning the hazards of ammonia includes toxicity data, permissible exposure limits, physical, reactivity, corrosivity, thermal, and stability data, and the effects of inadvertent mixing.  Information concerning the process technology includes process flow information, process chemistry, maximum intended inventory, safe upper and lower process limits, and consequences of deviating from safe limits.  Information concerning the process equipment includes the materials of construction, piping specifications, piping and instrumentation diagrams, electrical area classificaiton, relief design calculations and design basis, design codes and standards employed, material and energy balances, and safety systems.\n\nProcess Hazard Analysis\nLost Pines 1 has a comprehensive program to ensure that the hazards associated with the regulated process are systematically identified and controlled.  The analysis is conducted in accordance with regulatory requirements, general industry standards, and guidance from safety organizations such as the Center for Chemical Process Safety.  The plant has a system in place to ensure that recommendations resulting from this anaylsis are resolved in a timely manner.\n\nOperating Procedures\nLost Pines 1 maintains written operating procedures that address the various modes of process operations, including; initial startup, routine startup and shutdown, emergency shutdown, emergency operation, routine operation, and temporary operation.  The procedures also detail safe upper and lower process limits, consequences of deviation from safe limits, and how to return the process to safe operation.  The procedures are readily available to all operations personnel, and are reviewed and certified annually.\n\nTraining\nAll operations personnel  at Lost Pines 1 are initially trained in an overview of the ammonia storage and injection process and the procedures to safely operate the p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55818,
      "SummaryText": "rocess.  Operations personnel, and other personnel who work on the system receive comprehensive training every three years, with a written test.  All plant personnel receive annual awareness training..\n\nContractors\nLost Pines 1 uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors may work on or near the ammonia process equipment, the plant has procedures in place to ensure that contractors are aware of the hazards of the process, understand what to do in the event of an emergency, understand site safety rules, and inform plant personnel of any hazards they encounter in the course of their work.  The plant also evaluates contractor safety programs and performance during the selection process.\n\nPre-Startup Safety Reviews (PSSR)\nLost Pines 1 conducts a pre-startup safety review for any new facility or significant facility modification.  The purpose of the PSSR is to ensure that safety systems, procedures, training, and equipment are prepared for startup prior to placing the equipment into service.  This review provides one additional check to verify that construction is in accordance with design specifications and that all supporting systems are operationally ready.  A PSSR involves field verification of the construction and serves a quailty assurance function by requiring verification that accidental release prevention programs are properly implemented.\n\nMechanical Integrity\nLost Pines 1 has implemented practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, and emergency shutdown systems in a safe operating condition.  The program includes: (1) the development of a maintenance schedule for equipment in the ammonia process  and critical safety equipment, (2) development of written maintenance procedures, (3) conducting maintenance training, (4) performing and documenting inspections, (5) correction of identified deficiencies, and (6) "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55818,
      "SummaryText": "application of quality assurance measures to ensure that replacement equipment meets applicable specifications.\n\nHot Work Permits\nLost Pines 1 has an active hot work program in place to ensure worker and process safety.  The hot work permit program is designed to control spark-producing activities and to ensure that adequate precautions are in place before work begins in the process area.  These procedures (and others) along with training of affected personnel, form a system to help ensure that maintenance activities are performed safely.\n\nManagement of Change\nLost Pines 1 has a system in place to ensure that safety concerns associated with changes to the ammonia process are reviewed and addressed prior to making any change.  The changes are reviewed to ensure that adequate controls are in place to manage any new hazards as well as to verify that existing controls will not be compromised by the change.  The system requires that process safety information and operating procedures are updated and that operations and maintenance personnel are trained before the change is implemented.\n\nIncident Investigation\nLost Pines 1 will promptly investigate all incidents that have resulted in, or could reasonably be expected to result in, the catastrophic release of ammonia.  The findings of the investigation, along with any corrective actions taken to prevent recurrence of the incident, will be reviewed with all affected personnel, including contractors as appropriate.\n\nCompliance Audits\nTo ensure that the accidental release prevention program is functioning properly, Lost Pines 1 will conduct a compliance audit every three years.  The plant will quickly resolve any deficiencies noted by the audit team and will review the audit report and corrective actions taken with all affected personnel.\n\nAdditional Safety Systems\nLost Pines 1 has additional systems in place to prevent accidental releases of ammonia, as well as systems to lessen the impact of accidental releases.  These syste"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 55818,
      "SummaryText": "ms include:\n\n* Redundant instrumentation to monitor critical process parameters\n* Redundant critical equipment\n* Automated shutdown systems\n* Pressure relief valves\n* Water deluge system to wash ammonia vapors from the air\n\nLCRA/GenTex continuously evaluates the safety systems and operating procedures associated with the covered process to determine if there are ways to improve safety.  If an improvement is found, LCRA/GenTex will take steps to evaluate and implement it in a timely manner.  Lost Pines 1 continuously evaluates the safety systems and operating procedures associated with the covered process to determine if there are ways to improve safety.  If an improvement is identified, LCRA/GenTex will take steps to evaluate and implement it in a timely manner.\n\nFive Year Accident History\nThe Lost Pines 1 Power Plant began commercial operations in May 2001.  There have been no RMP accidents at the plant.\n\nEmergency Response Program\nThe Lost Pines 1 Power Plant maintains a written emergency response program.  The program addresses all measures, evacuation plans and personnel accounting, notification of emergency response agencies, and emergency response procedures.  The emergency response program is coordinated with the Bastrop Local Emergency Planning Committee."
    }
  ]
}