{
  "FacilityID": 55836,
  "FacilityName": "Anton Caratan & Sons (Old Cold Storage)",
  "FacilityStr1": "13938 Avenue 16",
  "FacilityStr2": null,
  "FacilityCity": "Delano",
  "FacilityState": "CA",
  "FacilityZipCode": "93215",
  "Facility4DigitZipExt": "9436",
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.820142",
  "FacilityLongDecDegs": "-119.170171",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9698382,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Anton Caratan",
  "OperatorStr1": "1625 Road 160",
  "OperatorStr2": null,
  "OperatorCity": "Delano",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93215",
  "OperatorZipCodeExt": "9436",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000209133",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-06-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Cold Storage Facility",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-08-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-08-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-08-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81255,
      "AltID": "ammonia cold storage",
      "FacilityID": 55836,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 108128,
          "ProcessID": 81255,
          "ChemicalID": 56,
          "Quantity": 48500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 108129,
          "ProcessID": 81255,
          "ChemicalID": 98,
          "Quantity": 110880.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 83234,
          "ProcessID": 81255,
          "NAICSCode": "115114",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 29649,
              "Process_NAICS_ID": 83234,
              "SafetyReviewDate": "2008-12-04 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2009-06-25 00:00:00",
              "ChangeCompletionDate": "2009-09-25 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-12-04 00:00:00",
              "TrainingReviewDate": "2009-06-03 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-12-04 00:00:00",
              "EquipmentInspectionDate": "2008-12-04 00:00:00",
              "EquipmentTested": "entire system/annual inspection",
              "ComplianceAuditDate": "2009-06-25 00:00:00",
              "AuditCompletionDate": "2009-09-25 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2009-06-25 00:00:00",
              "CBI_Flag": 0,
              "Description": "All equipment is inspected on an annual basis by a licensed anhydrous ammonia refrigeration contractor.  In addition, all operators are certified by the Refrigerating Engineers & Technicians Association, as well as having been trained on the specifics of our system by our ammonia contractor.  This building is kept locked when not in use to prevent tampering.  We also conduct periodic safety inspections to assure the ongoing safety of our facilitles.",
              "_chemicals": [
                {
                  "PrimaryKey": 30984,
                  "PreventionProgram2ID": 29649,
                  "ProcessChemicalID": 108128
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 55836,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-06-03 00:00:00",
    "ERTrainingDate": "2009-06-03 00:00:00",
    "CoordinatingAgencyName": "Tulare County Environmental Health",
    "CoordinatingAgencyPhone": "5597336441",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55836,
      "SummaryText": "\n1.    Accidental Release Prevention and Emergency Response Policies:\nWe at Anton Caratan and Son are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.    The Stationary Source and the Regulated Substances Handled:\nOur facility's primary focus is on the cold storage of freshly-picked table grapes.  As such, the only regulated substance held at this facility is anhydrous ammonia.\n\n3.    The Worst Case Release Scenarios and the Alternative Release Scenarios: \nIn order to determine the potential impact our facility could have on the community should a release occur, we have created multiple release scenarios, including a Worst Case and two Alternative Release scenarios. Our fist Alternative Scenario is high pressure gas, the second Alternative Scenario is lower pressure liquid.\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information:\nAnton Caratan and Son maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis:\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What If/Checklist (combined).  "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55836,
      "SummaryText": "The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every two years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on May of 2007.\n\nOperating Procedures:\nFor the purposes of safely conducting activities within our covered processes, Anton Caratan and Son maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining:\nAnton Caratan and Son has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.\n\nMechanical Integrity:\nAnton Caratan and Son carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change:\nWritten procedures are in place at Anton Caratan and Son to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions ar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55836,
      "SummaryText": "e promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews:\nThese reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.  We have not made any triggering changes to our system that would require these reviews.\n\nCompliance Audits:\nAnton Caratan and Son conduct audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted in June of 2009.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation:\nAnton Caratan and Son promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation:\nAnton Caratan and Son truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors:\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Anton Caratan and Son has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55836,
      "SummaryText": ".  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.    Five-year Accident History:\nAnton Caratan and Son has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, we have not had an accidental release over the last five years.\n\n\n6.    Emergency Response Plan:\nAnton Caratan and Son carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.    Planned Changes to Improve Safety:\nWe intend to continue with our ongoing safety training programs and Mechanical Integrity inspections to ensure the continued safe operation of our facility."
    }
  ]
}