{
  "FacilityID": 55843,
  "FacilityName": "Water Reclamation Plant No. 7",
  "FacilityStr1": "80-609 Avenue 38",
  "FacilityStr2": null,
  "FacilityCity": "Indio",
  "FacilityState": "CA",
  "FacilityZipCode": "92201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.771806",
  "FacilityLongDecDegs": "-116.258278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "LC",
  "FacilityURL": "www.cvwd.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Coachella Valley Water District",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Coachella Valley Water District",
  "OperatorStr1": "80-609 Avenue 38",
  "OperatorStr2": null,
  "OperatorCity": "Indio",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92201",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": "CAD982446056",
  "EPAFacilityID": "100000167632",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-08-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 33.771806,
  "FRS_Long": -116.258278,
  "FRS_Description": "LOADING AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "C01",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81263,
      "AltID": "Chlorination",
      "FacilityID": 55843,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 108137,
          "ProcessID": 81263,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 83242,
          "ProcessID": 81263,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 47713,
              "Process_NAICS_ID": 83242,
              "SafetyReviewDate": "2009-05-01 00:00:00",
              "PHA_Date": "2009-06-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-06-17 00:00:00",
              "TrainingReviewDate": "2009-05-21 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-06-03 00:00:00",
              "EquipmentInspectionDate": "2009-06-03 00:00:00",
              "EquipmentTested": "vacuum regulator and lines",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-07-30 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2008-11-01 00:00:00",
              "AuditCompletionDate": "2009-11-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-06-01 00:00:00",
              "HotWorkPermitReviewDate": "2008-09-01 00:00:00",
              "ContractorSafetyReviewDate": "2008-06-01 00:00:00",
              "ContractorSafetyEvalDate": "2008-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 69641,
                  "PreventionProgram3ID": 47713,
                  "ProcessChemicalID": 108137
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 55843,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-05-21 00:00:00",
    "ERTrainingDate": "2009-05-21 00:00:00",
    "CoordinatingAgencyName": "Riverside County Fire Department",
    "CoordinatingAgencyPhone": "7608637075",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55843,
      "SummaryText": "EXECUTIVE SUMMARY\nThis document comprises the Five Year Update for the Federal Risk Management Plan (Federal RMP Plan)\nand the California Accidental Release Prevention Program Risk Management Plan (CalARP RMP) for Water\nReclamation Plant No. 7 located at 80-609 Avenue 38 in Indio, California 92201 (herein after referred to as\nWRP No. 7 or the Plant). The Plant is owned and operated by the Coachella Valley Water District (with a\nmailing address of P.O. Box 1058; Coachella, California 92236). The District's initial submittal for WRP No. 7\nwas made to USEPA and to the Riverside County Department of Environmental Health on June 21, 1999.\nThe purpose of this document is to comply with the risk management planning requirements as set forth in the\nCode of Federal Regulations, Title 40, Part 68 (also known as the Federal Risk Management Plan Regulations)\nand the California Code of Regulations, Title 19, Division 2, Chapter 4.5, Article 3, Section 2745.3 (also known\nas the California Accidental Release Prevention Program Risk Management Plan - CalARP RMP Regulations).\nThe scope of the Federal RMP and CalARP RMP includes all operations conducted at the subject facility that\ninvolve the storage, handling and/or use of chlorine (i.e., chlorine is the only regulated substance handled at the\nPlant).\nPolicy Statement\nIt is the Policy of the Coachella Valley Water District (District) to conduct ALL District activities safely to prevent\nJob related accidents, illnesses, and injuries to employees and others and damage to District and Others'\nproperty. A well organized safety program provides a safe working environment and promotes increased\nefficiency at ALL levels (IIPP).\nES 1.0 DESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\nThe primary operation conducted at WRP No. 7 is the treatment of wastewater (NAICS Code 22132 - Sewage\nTreatment Facilities).\nWater Reclamation Plant No. 7 is a wastewater treatment plant that treats domestic wastes. WRP No. 7 uses\nchlorine to"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55843,
      "SummaryText": "disinfect a tertiary effluent before the effluent is discharged to down stream customers. The Plant is\nmanned on the day shift and the process is monitored 24-hours per day, 7-days per week, 365-days per year at\nthe District Headquarters located in Coachella.\nMaximum Inventory of Regulated Substances\nThe District's Maximum Inventory of Chlorine is 16,000-pounds (i.e., eight one ton containers of chlorine of\nwhich four are online and four are in storage).\nSite Security\nIn order to ensure the security of the site, the District has erected a chain link fence around the entire site.\nAdditionally, the site is equipped with a perimeter security system. Lastly, ALL building entries are equipped\nwith intruder alarms to alert Control of unauthorized access. These site security provisions are intended to\nprevent unauthorized access to areas of the Plant where chlorine is stored, handled or used and seek to\nprovide an added level of safety for the storage of chlorine at the Plant.\nES 2.0 ACCIDENTAL RELEASE SCENARIOS\nThe Federal RMP regulations and the CalARP RMP regulations require that at least two types of release\nscenarios be evaluated for their potential to impact off-site populations:\nthe worst case release; and\nan alternative release (an accident scenario that is more credible than the worst-case release scenario).\nA number of hypothetical accidental release scenarios were postulated and evaluated for the Five Year Federal\nRMP/CalARP RMP Update. These scenarios were categorized into worst-case release scenarios and\nalternative release scenarios. Each of these categories of hypothetical accidental release scenarios is\ndiscussed below.\nCHLORINE\nWorst-Case Release Scenarios for Chlorine\nIn this scenario, one of the one-ton containers of chlorine on site experiences a catastrophic failure due to an\nunknown event. This scenario could be initiated by an external event (i.e., an airplane, missile or meteorite\nimpacting the chlorine storage enclosure or area where the one ton c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55843,
      "SummaryText": "ontainers are located). It is highly improbable that this scenario would be initiated by a seismic event. However, the possibility of this scenario being initiated by a seismic event cannot\nbe completely discarded. This scenario is considered to be extremely unlikely. In the extremely unlikely case\nthat this scenario occurs, up to 2,000-pounds of chlorine could be released (in the worst-case). The release of\nchlorine could occur either indoors or outdoors. Since the release can occur out-doors (i.e., outside of the\nchlorine storage room during a delivery for example) the enclosure provided by the chlorine storage room was\nnot taken into account in evaluating the off-site consequences. Rather, it was assumed that the chlorine\nreleased during the catastrophic accident was released outdoors forming a cloud of chlorine vapor. The\nresulting vapor cloud was assumed to freely migrate off-site. Utilizing the methodology specified by USEPA, the\nestimated vulnerable zone for this hypothetical accidental release scenario is approximately 3.0-miles.\nAlternative Release Scenarios for Chlorine\nAlternative release scenarios which are considered to be more likely to occur are those which may result in the\nrelease of anywhere from less than one-pound to up to 2000 pounds of chlorine. These scenarios include\nsituations such as delivery of a leaking one-ton container of chlorine to the Plant, a pinhole leak in the chlorine\ntransfer piping, a partial or complete failure of the chlorine transfer lines (100-percent vapor) at various points in\nthe system (in-doors), or the rupture or separation of the flexible connections from the online one-ton containers\nto the manifold system (in-doors). In order to be conservative in the estimation of the vulnerable zone, it was\nassumed that 1447-pounds of chlorine was released (over a 60-minute period) during an accident involving the\ncomplete rupture of the flexible connection from a one-ton container to\nthe manifold system. It was assumed that the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55843,
      "SummaryText": "resulting release activates the chlorine detectors which in turn\nactivate the building ventilation fans. As such the chlorine released indoors, is quickly vented to the atmosphere\nand the resulting cloud of chlorine vapor is free to migrate off-site. Utilizing the methodology specified by\nUSEPA, the estimated vulnerable zone for this hypothetical accidental release scenario is approximately 0.2-\nmiles.\nES 3.0 FIVE YEAR ACCIDENT HISTORY\nDuring the five years preceding the submittal of the Five Year Federal RMP/CalARP RMP Update, the Plant has\nNOT had any accidental releases of chlorine that have resulted in:\nOnsite deaths, injuries, or significant property damage; or\nKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\nES 4.0 ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION\nSTEPS/DEVICES\nThe Accidental Release Prevention Program at the Plant consists of a series of programs, procedures and\npolicies designed to minimize the risk of accidental releases involving chlorine. These programs include design\nand operating controls such as compliance with specified codes, the District's health and safety program,\nnumerous standard operating procedures, the equipment inspection and maintenance program (including a\nmechanical integrity and preventive maintenance program), the management of change program, pre-start-up\nreview, fire protection and hot work permit programs, management of- and safety of- contractors,\naccident/incident investigation procedures, emergency response plan, the Federal RMP/CalARP RMP/OSHA\nPSM Program compliance auditing program, the Federal RMP/CalARP RMP/OSHA PSM Program record\nkeeping program and a variety of personnel training programs. Details of each of these components of the\nPlant's Accidental Release Prevention Program are provided in the document entitled Federal Risk\nManagement Plan (Federal RMP), California Acci\ndental Release Prevention Program Risk Management Plan (C"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 55843,
      "SummaryText": "alARP RMP), OSHA Process Safety\nManagement (OSHA PSM) Program, Volume I - Prevention Program.\nIt is highly unlikely that the Worst Case Release Scenario or Alternative Release Scenarios will occur at the\nplant for the following reasons:\nThe chlorine process and process areas are inspected daily;\nThe chlorine containers and storage rooms are monitored 24-hours per day, 7-days per week, 365-days per\nyear for process leaks via automatic leak detectors;\nThe leak detectors are considered critical equipment and thus are incorporated into the Mechanical Integrity\nProgram. As such, each detector is well maintained and tested twice each month;\nALL chlorine storage, handling and use area entry doors are equipped with intruder alarms to guard against\nunauthorized entry and/or vandalism;\nALL one ton containers are inspected prior to acceptance and storage onsite;\nALL one-ton containers stored/managed onsite are secured in-place via two chain binders to prevent movement\nor dislodging due to seismic events; and ALL Plant Operators and Members of the Emergency Response Team are trained to respond to- and stopprocess\nleaks.\nThere are a number of detection and monitoring devices and alarms designed to ensure the continued safe\noperation of Water Reclamation Plant No. 7. These devices are located throughout the Plant and monitor\nvarious aspects of Plant Operations.\nAlarms\nWRP No. 7 is equipped with Leak Detectors that are designed to detect chlorine in the chlorine storage area at\nor above 1-ppm. When one of these detectors senses a gas leak at or above 1-ppm, an audible alarm is\nindicated locally and on the annunciator panel in the onsite control room AND an alarm is transmitted to District\nControl at Headquarters AND the ventilation fan is automatically switched on and starts to evacuate the room..\nAt 3-ppm the beacon lights on top of the chlorine building are activated. These alarms can only be re\nset and cleared after the leak detectors sense less than 1-ppm of chlorine gas. The"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 55843,
      "SummaryText": "alarms are tested by\nDistrict Operators twice each month. Additionally, the District's Communications Shop inspects, tests and\ncalibrates the chlorine alarm system on a monthly schedule.\nES 5.0 EMERGENCY RESPONSE\nThe Coachella Valley Water District recognizes that emergency planning and emergency response are an\nintegral component of risk management. As such, the District, as part of its hazardous materials business plan\n(HMBP) and Emergency Response Program for Water Reclamation Plant No. 7, has developed and\nimplemented an emergency response plan and an emergency evacuation plan.\nCall Outs\nWhen a gas leak alarm occurs during the hours that a Plant is staffed, the Plant Operators will respond to the\nleak with three operators. The Chlorine Response Team can be dispatched to the Plant during the staffed hours\nif the Plant Staff are unable to respond to the leak with a three person crew.\nWhen control receives a gas leak alarm after hours, the Control Operator will call out the Chlorine Response\nTeam and the Sanitation Standby Operator. Upon arrival at the scene, both will wait at the entrance gate for the\nother to arrive and will enter the Plant together.\nResponse Teams\nEmergency response and any work with chlorine connections requires a minimum of three employees to be\npresent. ALL Plant Operators are trained in Emergency Response. The crew of employees trained in response\nto chlorine leaks at the District's domestic well sites have been trained to respond to chlorine leaks at WRP No.\n7 as well. After hours this two-person crew responds with the standby operator to unmanned Plants or to other\nPlants that may need assistance. There are always three employees on call with pagers ready to respond to\nchlorine emergencies. The on call crew is rotated weekly.\nTraining\nChlorine response personnel are scheduled to be trained quarterly in the use of emergency repair kits,\nthe use of personal protective equipment (PPE), and District Emergency Response Procedures. Furthermore,"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 55843,
      "SummaryText": "chlorine emergency response personnel are trained annually in the safe storage and handling of chlorine and in\nCPR/First Aid. The District also has a cut-out one-ton container and a 150-pound cylinder that are used to\nsimulate emergency releases and to practice emergency response/repairs and supply isolation procedures.\nResponse to Minor Leaks\nTwo employees will respond with Self-Contained Breathing Apparatuses (SCBAs), Chlorine B Repair Kits,\ngloves and a bottle of 26 Baume Ammonia. The third crew member will also respond with an SCBA and stay\nnear the truck radio.\nThe first and second person will don their SCBAs, keeping each other in sight at all times. Using the ammonia,\nthey will locate the chlorine leak. Once the leak is located and confirmed to be a system leak and not a vessel\ntank, the gas supply valve on the container can be shut off by turning the valve clockwise one full turn. When\nthis has been done, the Third Crew Member will let Control know whether repairs have been made or if further\nassistance is needed.\nResponse to Major Leaks\nThe District's response to Major Leaks is similar to its response for Minor Leaks, except that the Response\nTeam will wear fully encapsulated suits if a severe gas leak has occurred or if the Response Team finds a\nvessel/tank leak. The Third Crew Member will notify Control to send Police and Fire Department Personnel to\nthe scene to secure and evacuate the surrounding area, as necessary. The District's standby personnel and\nTraining/Safety Specialist will be called as well.\nES 6.0 PLANNED CHANGES TO IMPROVE SAFETY\nA detailed hazard and operability study (i.e., hazards analysis) was performed in June 2009 and covered ALL\noperations involving chlorine. As a result of the process hazards analysis update performed a number of\nrecommendations were made to improve the safety of the operations conducted at the P\nlant. The District is currently evaluating the recommended actions and also evaluating implementation options.\nIt is"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 55843,
      "SummaryText": "expected that the majority of recommended actions will be completed by December 31, 2009.\nES 7.0 FOR MORE INFORMATION\nThe Coachella Valley Water District recognizes that some persons may be interested in obtaining more detailed\ninformation regarding the Five Year Federal RMP and CalARP RMP Update and various Prevention Program\ncomponents not discussed herein. Interested parties that have additional questions regarding the Risk\nManagement Plan for Water Reclamation Plant No. 7 and or the Prevention Program, are directed to contact:\nAnthony Zamudio\nSafety and Training Specialist\nc/o Coachella Valley Water District\nREF: Water Reclamation Plant No. 7\nP.O. Box 1058\nCoachella, California 92236"
    }
  ]
}