{
  "FacilityID": 55844,
  "FacilityName": "Water Reclamation Plant No. 4",
  "FacilityStr1": "63-002 Fillmore",
  "FacilityStr2": null,
  "FacilityCity": "Thermal",
  "FacilityState": "CA",
  "FacilityZipCode": "92254",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.591917",
  "FacilityLongDecDegs": "-116.121703",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "LC",
  "FacilityURL": "www.cvwd.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Coachella Valley Water District",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Coachella Valley Water District",
  "OperatorStr1": "63-002 Fillmore",
  "OperatorStr2": null,
  "OperatorCity": "Thermal",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92254",
  "OperatorZipCodeExt": null,
  "RMPContact": "Anthony Zamudio",
  "RMPTitle": "Safety and Training Manager",
  "FTE": 12,
  "OtherEPAFacilityID": "CAD982446056",
  "EPAFacilityID": "100000167641",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "C",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-08-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 33.59105,
  "FRS_Long": -116.12948,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81264,
      "AltID": "Chlorination",
      "FacilityID": 55844,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83243,
          "ProcessID": 81264,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108138,
          "ProcessID": 81264,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608138,
          "ProcessID": 81264,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 81265,
      "AltID": "Dechlorination",
      "FacilityID": 55844,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83244,
          "ProcessID": 81265,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108139,
          "ProcessID": 81265,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608139,
          "ProcessID": 81265,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55844,
      "SummaryText": "EXECUTIVE SUMMARY\nThis document comprises the Five Year Update for the Federal Risk Management Plan (Federal RMP Plan)\nand the California Accidental Release Prevention Program Risk Management Plan (CalARP RMP) for Water\nReclamation Plant No. 4 located at 63-002 Fillmore Road in Thermal, California 92254 (hereinafter referred to\nas WRP No. 4 or the Plant). The Plant is owned and operated by the Coachella Valley Water District (with a\nmailing address of P.O. Box 1058; Coachella, California 92236). The District's initial submittal for WRP No. 4\nwas made to USEPA and to the Riverside County Department of Environmental Health on June 21, 1999.\nThe purpose of this document is to comply with the risk management planning requirements as set forth in the\nCode of Federal Regulations, Title 40, Part 68 (also known as the Federal Risk Management Plan Regulations)\nand the California Code of Regulations, Title 19, Division 2, Chapter 4.5, Article 3, Section 2745.3 (also known\nas the California Accidental Release Prevention Program Risk Management Plan - CalARP RMP Regulations).\nThe scope of the Federal RMP and CalARP RMP includes all operations conducted at the subject facility that\ninvolve the storage, handling and/or use of chlorine and sulfur dioxide (i.e., chlorine and sulfur dioxide are the\nonly regulated substance handled at the Plant).\nPolicy Statement\nIt is the Policy of the Coachella Valley Water District (District) to conduct ALL District activities safely to prevent\nJob related accidents, illnesses, and injuries to employees and others and damage to District and Others'\nproperty. A well organized safety program provides a safe working environment and promotes increased\nefficiency at ALL levels (IIPP).\nES 1.0 DESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\nThe primary operation conducted at WRP No. 4 is the treatment of wastewater (NAICS Code 22132 - Sewage\nTreatment Facilities).\nWater Reclamation Plant No. 4 is a wastewater treatment plant that treats"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55844,
      "SummaryText": " domestic wastes. WRP No. 4 uses\nchlorine to disinfect secondary effluent and in turn uses sulfur dioxide to remove chlorine residue before the\ntreated effluent is discharged into receiving waters. The Plant is manned on the day shift and the process is\nmonitored 24-hours per day, 7-days per week, 365-days per year at the District Headquarters located in\nCoachella.\nMaximum Inventory of Regulated Substances\nThe District's Maximum Inventory of Chlorine and Sulfur Dioxide is 24,000-pounds of chlorine (twelve one ton\ncontainers, two 8 on line and four in storage) and 12,000 pounds of sulfur dioxide (six one-ton containers of\nsulfur dioxide, two online and four in storage).\nSite Security\nIn order to ensure the security of the site, the District has erected a chain link fence around the entire site.\nAdditionally, the entry doors to the chlorine and sulfur dioxide storage and use areas are equipped with an\nintrusion security system. These site security provisions are intended to prevent unauthorized access to areas\nof the Plant where chlorine and sulfur dioxide are stored, handled or used and seek to provide an added level of\nsafety for the storage of chlorine and sulfur dioxide at the Plant.\n2.0 ACCIDENTAL RELEASE SCENARIOS\nThe Federal RMP regulations and the CalARP RMP regulations require that at least two types of release\nscenarios be evaluated for their potential to impact off-site populations:\nthe Worst Case Release; and an Alternative Release (an accident scenario that is more credible than the worstcase\nrelease scenario).\nA number of hypothetical accidental release scenarios were postulated and evaluated for the Five Year Federal\nRMP/CalARP RMP Update. These scenarios were categorized into worst-case release scenarios and\nalternative release scenarios. Each of these categories of hypothetical accidental release scenarios is\ndiscussed below.\nCHLORINE AND SULFUR DIOXIDE\nThe storage, handling and use systems for chlorine and sulfur dioxide at the Plant are identical an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55844,
      "SummaryText": "d therefore\nthe worst-case accidental release scenarios and the alternative release scenarios for each of these regulated\nsubstances is identical. Each of these is discussed below:                                                                                                      Worst-Case Release Scenarios for Chlorine\nIn this scenario, one of the one-ton containers of chlorine on site experiences a catastrophic failure due to an\nunknown event. This scenario could be initiated by an external event (i.e., an airplane, missile or meteorite\nimpacting the chlorine storage room or building where the one ton containers are located). It is highly\nimprobable that this scenario would be initiated by a seismic event. However, the possibility of this scenario\nbeing initiated by a seismic event cannot be completely discarded. This scenario is considered to be extremely\nunlikely. In the extremely unlikely case that this scenario occurs, up to 2,000-pounds of chlorine could be\nreleased (in the worst-case). The release of chlorine could occur outdoors or indoors. Since the release can\noccur out-doors (i.e., outside of the chlorine storage room during a delivery for example) the enclosure provided\nby the chlorine storage room was not taken into account in evaluating the off-site consequences. Rather, it was\nassumed that the chlorine released during the catastrophic accident was released outdoors forming a cloud of\nchlorine vapor. The resulting vapor cloud was assumed to freely migrate off-site. Utilizing the methodology\nspecified by USEPA, the estimated vulnerable zone for this hypothetical accidental release scenario is\napproximately 3.0-miles.\nAlternative Release Scenarios for Chlorine\nAlternative release scenarios which are considered to be more likely to occur are those which may result in the\nrelease of anywhere from less than one-pound to up to 2000-pounds of chlorine. These scenarios include\nsituations such as delivery of a leaking one-ton container of chlorine to the Pla"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55844,
      "SummaryText": "nt, a pinhole leak in the chlorine\ntransfer piping or pigtails, a partial or complete failure of the chlorine transfer lines (100-percent vapor) at\nvarious points in the system (in-doors), or the rupture or separation of the flexible connections from the online\none-ton containers to the manifold system (in-doors). In order to be conservative in the estimation of the\nvulnerable zone, it was assumed that 1447-pounds of chlorine was released (over a 60-minute period) during an\naccident involving the complete rupture of the flexible connection from a one-ton container to the manifold\nsystem. It was assumed that the resulting release activates the chlorine detectors which in turn activate the\nbuilding ventilation fans. As such the chlorine released indoors, is quickly vented to the atmosphere and the\nresulting cloud of chlorine vapor is free to migrate off-site. The resulting cloud of chlorine vapor was assumed to\nfreely migrate off-site. Utilizing the methodology specified by USEPA, the estimated vulnerable zone for this\nhypothetical accidental release scenario is approximately 0.2-miles.\nWorst-Case Release Scenarios for Sulfur Dioxide\nIn this scenario, one of the one-ton containers of sulfur dioxide on site experiences a catastrophic failure due to\nan unknown event. This scenario could be initiated by an external event (i.e., an airplane, missile or meteorite\nimpacting the sulfur dioxide storage room or building where the one ton containers are located). It is highly\nimprobable that this scenario would be initiated by a seismic event. However, the possibility of this scenario\nbeing initiated by a seismic event cannot be completely discarded. This scenario is considered to be extremely\nunlikely. In the extremely unlikely case that this scenario occurs, up to 2,000-pounds of sulfur dioxide could be\nreleased (in the worst-case). The release of sulfur dioxide could occur outdoors or indoors. Since the release\ncan occur out-doors (i.e., outside of the sulfur dioxide storage"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 55844,
      "SummaryText": " room during a deli\nvery for example) the enclosure provided by the sulfur dioxide storage room was not taken into account in\nevaluating the off-site consequences. Rather, it was assumed that the sulfur dioxide released during the\ncatastrophic accident was released outdoors forming a cloud of sulfur dioxide vapor. The resulting vapor cloud\nwas assumed to freely migrate off-site. Utilizing the methodology specified by USEPA, the estimated vulnerable\nzone for this hypothetical accidental release scenario is approximately 3.1-miles.\nAlternative Release Scenarios for Sulfur Dioxide\nAlternative release scenarios which are considered to be more likely to occur are those which may result in the\nrelease of anywhere from less than one-pound to up to 2000-pounds of sulfur dioxide. These scenarios include\nsituations such as delivery of a leaking one-ton container of sulfur dioxide to the Plant, a pinhole leak in the\nsulfur dioxide transfer piping or pigtails, a partial or complete failure of the sulfur dioxide transfer lines (100-\npercent vapor) at various points in the system (in-doors), or the rupture or separation of the flexible connections\nfrom the online one-ton containers to the manifold system (in-doors). In order to be conservative in the\nestimation of the vulnerable zone, it was assumed that 1347-pounds of sulfur dioxide was released (over a 60-\nminute period) during an accident involving the complete rupture of the flexible connection from a one-ton\ncontainer to the manifold system (i.e., a release rate of 22.45-pounds of sulfur dioxide per minute). It was\nassumed that the resulting release activates the sulfur dioxide detectors which in turn activate the building\nventilation fans. As such the sulfur dioxide released indoors, is quickly vented to the atmosphere and the\nresulting cloud of sulfur dioxide vapor is free to migrate off-site. The resulting cloud of sulfur dioxide vapor was\nassumed to freely migrate off-site. Utilizing the methodology specified by USEPA, t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 55844,
      "SummaryText": "he estimated\nvulnerable zone for this hypothetical accidental release scenario is approximately 0.2-miles.\nES 3.0 FIVE YEAR ACCIDENT HISTORY\nDuring the five years preceding the submittal of the Five Year Federal RMP/CalARP RMP Update, the Plant has\nNOT had any accidental releases of either chlorine or sulfur dioxide that have resulted in:\nOnsite deaths, injuries, or significant property damage; or\nKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\nES 4.0 ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION\nSTEPS/DEVICES\nThe Accidental Release Prevention Program at the Plant consists of a series of programs, procedures and\npolicies designed to minimize the risk of accidental releases involving chlorine or sulfur dioxide. These\nprograms include design and operating controls such as compliance with specified codes, the District's health\nand safety program, numerous standard operating procedures, the equipment inspection and maintenance\nprogram (including a mechanical integrity and preventive maintenance program), the management of change\nprogram, pre-start-up review, fire protection and hot work permit programs, management of- and safety ofcontractors,\naccident/incident investigation procedures, emergency response plan, the Federal RMP/CalARP\nRMP/OSHA PSM Program compliance auditing program, the Federal RMP/CalARP RMP/OSHA PSM Program\nrecord keeping program and a variety of personnel training programs. Details of each of these components of\nthe Plant's Accidental Release Prevention Program are provided in the document entitled Federal Risk\nManagement Plan (Federal RMP), California Accidental Release Prevention Program Risk Management Plan\n(CalARP RMP), OSHA Process Safety Management (OSHA PSM) Program, Volume I - Prevention Program.\nIt is highly unlikely that the Worst Case Release Scenario or Alternative Release Scenarios will occur at the\nplant for the following reasons:\nBoth the chlorine and "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 55844,
      "SummaryText": "sulfur dioxide processes and process areas are inspected daily;\nThe chlorine and sulfur dioxide containers and storage rooms are monitored 24-hours per day, 7-days per\nweek, 365-days per year for process leaks via automatic leak detectors;\nThe leak detectors are considered critical equipment and thus are incorporated into the Mechanical Integrity\nProgram. As such, each detector is well maintained and tested twice each month;\nALL chlorine and sulfur dioxide storage, handling and use area entry doors are equipped with intruder alarms to\nguard against unauthorized entry and/or vandalism;\nThe flexible connections are replaced annually per manufacturer's specifications to minimize the possibility of\nleaks/releases due to corrosion;\nALL one-ton containers stored/managed onsite are secured in-place via two chain binders to prevent movement\nor dislodging due to seismic events; and\nALL Plant Operators and Members of the Emergency Response Team are trained to respond to- and stopprocess\nleaks.\nThere are a number of detection and monitoring devices and alarms designed to ensure the continued safe\noperation of Water Reclamation Plant No. 4. These devices are located throughout the Plant and monitor\nvarious aspects of Plant Operations.\nAlarms\nWRP No. 4 is equipped with Leak Detectors that are designed to detect chlorine in the chlorine storage and use\narea at or above 1-ppm and sulfur dioxide in the sulfur dioxide storage and use area at or above 2-ppm. When\none of the chlorine detectors senses a gas leak at or above 1-ppm, a visual and audible alarm on the\nannunciator panel will activate and an alarm is transmitted to District Control at Headquarters. At 3-ppm of\nchlorine the beacon lights on top of the affected building will come on and the ventilation fan in the affected\nroom will start to evacuate the room of excess gas. These alarms can only be reset and cleared after the leak\ndetectors sense less than 1-ppm of gas. The alarms are tested by District Operators twice each mon"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 55844,
      "SummaryText": "th.\nAdditionally, the District's Communications Shop inspects, tests and calibrates the chlorine alarm system on a\nmonthly schedule. The set-points for the sulfur dioxide leak detectors are 2-ppm and 5-ppm. ALL other aspects\nof the sulfur dioxide leak detector's and alarm system are identical to those of the chlorine leak detectors and\nalarm system.\nES 5.0 EMERGENCY RESPONSE\nThe Coachella Valley Water District recognizes that emergency planning and emergency response are an\nintegral component of risk management. As such, the District, as part of its hazardous materials business plan\n(HMBP) and Emergency Response Program for Water Reclamation Plant No. 4, has developed and\nimplemented an emergency response plan and an emergency evacuation plan.\nCall Outs\nWhen a gas leak alarm occurs during the hours that a Plant is staffed, the Plant Operators will respond to the\nleak with three operators. The Chlorine Response Team can be dispatched to the Plant during the staffed hours\nif the Plant Staff are unable to respond to the leak with a three person crew.\nWhen control receives a gas leak alarm after hours, the Control Operator will call out the Chlorine Response\nTeam and the Sanitation Standby Operator. Upon arrival at the scene, both will wait at the entrance gate for the\nother to arrive and will enter the Plant together.\nResponse Teams\nEmergency response and any work with chlorine or sulfur dioxide connections requires a minimum of three\nemployees to be present. ALL Plant Operators are trained in Emergency Response. The crew of employees\ntrained in response to chlorine leaks at the District's domestic well sites have been trained to respond to\nchlorine and/or sulfur dioxide leaks at WRP No. 4 as well. After hours this two-person crew responds with the\nstandby operator to unmanned Plants or to other Plants that may need assistance. There are always three\nemployees on call with pagers ready to respond to chlorine emergencies.\nThe on call crew is rotated weekly.\nTraining\nChl"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 55844,
      "SummaryText": "orine response personnel are scheduled to be trained quarterly in the use of emergency repair kits, the use\nof personal protective equipment (PPE), and District Emergency Response Procedures. Furthermore, chlorine\nemergency response personnel are trained annually in the safe storage and handling of chlorine and sulfur\ndioxide and in CPR/First Aid. The District also has a \"cut-out\" one-ton container and a 150-pound cylinder that\nare used to simulate emergency releases and to practice emergency response/repairs and supply isolation\nprocedures.\nResponse to Minor Leaks\nTwo employees will respond with Self-Contained Breathing Apparatuses (SCBAs), Chlorine \"B\" Repair Kits,\ngloves and a bottle of 26 Baume Ammonia. The third crew member will also respond with an SCBA and stay\nnear the truck radio.\nThe first and second person will don their SCBAs, keeping each other in sight at all times. Using the ammonia,\nthey will locate the chlorine leak. Once the leak is located and confirmed to be a system leak and not a vessel\ntank, the gas supply valve on the container can be shut off by turning the valve clockwise one full turn. When\nthis has been done, the Third Crew Member will let Control know whether repairs have been made or if further\nassistance is needed.\nResponse to Major Leaks\nThe District's response to Major Leaks is similar to its response for Minor Leaks, except that the Response\nTeam will wear fully encapsulated suits if a severe gas leak has occurred or if the Response Team finds a\nvessel/tank leak. The Third Crew Member will notify Control to send Police and Fire Department Personnel to\nthe scene to secure and evacuate the surrounding area, as necessary. The District's standby personnel and\nTraining/Safety Specialist will be called as well.\nES 6.0 PLANNED CHANGES TO IMPROVE SAFETY\nA detailed hazard and operability study (i.e., hazards analysis) was performed on ALL operations involving\nchlorine and sulfur\ndioxide in order to evaluate the potential for accidental relea"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 55844,
      "SummaryText": "ses in June 12, 2009. As a result of the process\nhazards analysis update performed a number of recommendations were made to improve the safety of the\noperations conducted at the Plant. The District is currently evaluating the recommended actions and also\nevaluating implementation options.\nES 7.0 FOR MORE INFORMATION\nThe Coachella Valley Water District recognizes that some persons may be interested in obtaining more detailed\ninformation regarding the Five Year Federal RMP and CalARP RMP Update and various Prevention Program\ncomponents not discussed herein. Interested parties that have additional questions regarding the Risk\nManagement Plan for Water Reclamation Plant No. 4 and or the Chlorine or Sulfur Dioxide Prevention\nPrograms, are directed to contact:\nAnthony Zamudio\nSafety and Training Manager\nc/o Coachella Valley Water District\nREF: Water Reclamation Plant No.4\nP.O. Box 1058\nCoachella, California 92236"
    }
  ]
}