{
  "FacilityID": 55888,
  "FacilityName": "DuPont - Spruance",
  "FacilityStr1": "5401 Jefferson Davis Highway",
  "FacilityStr2": null,
  "FacilityCity": "Richmond",
  "FacilityState": "VA",
  "FacilityZipCode": "23234",
  "Facility4DigitZipExt": "2257",
  "FacilityCountyFIPS": "51041",
  "LEPC": "Chesterfield County LEPC",
  "FacilityLatDecDegs": "37.451917",
  "FacilityLongDecDegs": "-077.433361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dupont.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "E.I. du Pont de Nemours & Company, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1315704,
  "Company2DUNS": 0,
  "OperatorName": "E.I. du Pont de Nemours & Co., Inc.",
  "OperatorStr1": "5401 Jefferson Davis Highway",
  "OperatorStr2": null,
  "OperatorCity": "Richmond",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23234",
  "OperatorZipCodeExt": "2257",
  "RMPContact": "Joseph G. Loschiavo",
  "RMPTitle": "Environmental Associate",
  "FTE": 2147,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000075937",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "PRO50397",
  "SafetyInspectionDate": "2009-03-31 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 1,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-08-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-08-25 00:00:00",
  "CBIFlag": 1,
  "CBIUnsanitizedVersionFlag": 1,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 37.45111,
  "FRS_Long": -77.43389,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81321,
      "AltID": "Plastics Material and Res",
      "FacilityID": 55888,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83303,
          "ProcessID": 81321,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108200,
          "ProcessID": 81321,
          "ChemicalID": 69,
          "Quantity": 2500000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 69,
            "ChemicalName": "Oleum (Fuming Sulfuric acid)  [Sulfuric acid, mixture with sulfur trioxide]",
            "CASNumber": "8014-95-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608200,
          "ProcessID": 81321,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 81322,
      "AltID": "Plastics Material and Res",
      "FacilityID": 55888,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 83304,
          "ProcessID": 81322,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108201,
          "ProcessID": 81322,
          "ChemicalID": 4,
          "Quantity": 1100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 4,
            "ChemicalName": "Chloroform  [Methane, trichloro-]",
            "CASNumber": "67-66-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608201,
          "ProcessID": 81322,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 81323,
      "AltID": "CBI Flammable Substance",
      "FacilityID": 55888,
      "ProgramLevel": 3,
      "CBI_Flag": 1,
      "_naics": [
        {
          "Process_NAICS_ID": 83305,
          "ProcessID": 81323,
          "NAICSCode": "31323",
          "_desc": {
            "NAICS_CODE": "31323",
            "NAICS_DESCRIPTION": "Nonwoven Fabric Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 108202,
          "ProcessID": 81323,
          "ChemicalID": 156,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 156,
            "ChemicalName": "CBI Flammable Substance",
            "CASNumber": "00-00-00",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 1,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 608202,
          "ProcessID": 81323,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55888,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies at the Spruance DuPont Site:\n\nThe Spruance site?s overall approach to chemical safety is through adhering to OSHA, EPA and corporate requirements that meet or exceed the Federal Regulations.  The site conducts audits that meet or exceed the required frequencies, and the Corporation conducts independent 2nd Party audits to confirm site compliance.  All of the RMP chemicals in this submit are covered either by OSHA?s 1910.119, or by the EPA?s RMP, or both and these require application or compliance to 1910.119.  Leadership for the corporation requires compliance to these programs or laws and also played a role in their development.  Through high ethics from the CEO down to the local site?s manager, adherence to the principles are required and as stated earlier, each is fully audited for compliance.  Where deviations are found, programs with tracking are developed to correct any deficiencies.\n\nFacility and the Regulated Substances Handled:\n\nThe Spruance Facility is located just south of Richmond, Virginia in Chesterfield County.  The site size is just under 500 acres.  There are 5 products made on the location, all considered chemical manufacturing and all falling under the generic item of Plastics and Resins in the NAICS codes.  The regulated substances used are Oleum (approximately 2,500,000 lbs), Chloroform (approximately 1,100,000 lbs), and CBI Flammable (approximately 180,000 lbs).\n\nThe General Accidental Release Prevention Program and Chemical Specific Prevention Steps:\n\nFor all of the EPA listed regulated Toxics and Flammables, OSHA?s PSM guidelines along with corporate guidelines are strictly followed.  The DuPont Corporation and its Corporate and local leadership, are highly committed to personal Safety, Process Safety and to the Environment.  The PSM process, which began in 1992, has been put in place and continuously improved.  Around a strong PSM and Environmental program is the philosophy of con"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55888,
      "SummaryText": "sistently maintaining containment.  Each hazards analysis not only looks at the process hazards, but at inherently Safer Processes, Loss of Containment potentials and how they are prevented, the role of human factors and constantly updating of the consequence analyses.  The site?s program follows the OSHA requirements and starts with a Process Technology package for MSDS information, technology information, and all equipment information.  Where determined critical, changes are only made through the Management of Change process.  PHA?s are conducted every 5 years or more frequent if required.  PHA?s are conducted at several phases of all new projects and are also conducted on all processes that are mothballed.  All guidelines set forth in 1910.119 are followed.  Operating Procedures and Safe Work Practices are considered a critical and key factor in operating safely all chemical operations.  These procedures are constantly being reviewed and revised and maintained current and up to date.  Metrics used by upper management ensures that they are maintained current.  Taking the procedures and using them in the training phase is the next key step.  Training is continuous in both the manufacturing and maintenance organizations and within all levels of management.  Management of Change, Personnel ensures that people at all levels are properly trained prior to taking over a new assignment and the chance of losing control of a process through turnover is minimized greatly by adherence to this MOC process.  A strict program around maintenance practices and training in the MI and QA phases has helped to ensure a continuous improvement process in the areas of training, procedures (both specific and general skills), and quality control of parts used.  Reliability engineering and procedures are used for checking all PSM Critical equipment that could lead to loss of containment.  A high degree of emphasis is placed at the Corporate level, Site level and Business level on Contractor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55888,
      "SummaryText": " Performance and Safety to ensure they are both knowledgeable and safe to work in any regulated area.  The corporation has established high standards and expectations on openness around reporting of incidents and near misses.  This philosophy has carried down to the sites.  Each incident requires a full investigation and a root cause analysis performed in order to accurately determine the cause and prevent it from reoccurring.  The site believes strongly in emergency planning.  The local LEPC and Community groups are kept informed of all chemicals and all changes and plant members serve on the LEPC.  Emergency Planning includes Site level preparation and drills to maintain readiness, along with area procedures.  These drills, both at site level and area level are exercised many times throughout the year in the area with table top exercises and with simulated exercises.  At the site level, they are exercised 4 times a year, with outside localities participating in one or more of the drills.  In addition, the site has a primary and backup Control Center for handling any situation and a Fire Brigade and fire systems that meet all of the NFPA requirements on checks and maintenance, a Hazmat Technician level team on all shifts, and a fully trained Rescue Team on all shifts.  The site has a medical department with doctors and nurses on Monday through Friday, and on off hours, each shift has fully trained EMT?s.  The process that ties all of this together is made up of many things, including metric reviews at all levels of the businesses, first and second party on going audits.  The DuPont sites comply with all major NFPA, OSHA and EPA programs and are subject to audit by each at any time.  They include, but are not limited to OSHA?s 29 CFR 1910.38, 119,120, and the Clean Water Act Regulations at 40 CFR 112, RCRA Regulations at 40 CFR 264,265, and 279.52, and OPA-90 Regulations at 40 CFR 112, 33, CFR 154, 49 CFR 194.  State and local rules and laws are also followed.\n\nThe "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55888,
      "SummaryText": "Five Year Accident History\n\nDuPont Spruance has not had any accidental releases over the past 5 year period, since the last submit, from any of our covered processes that have resulted in deaths, injuries, or significant property damage on site, and no known off site deaths, injuries, evacuations, sheltering in place, property damage, or environmental impact.\n\nThe Emergency Response Program:\n\nThe bulk of this information was included as an element of the site?s PSM program and is considered an integral part of it.  The site has 24 hour coverage of site fire brigades, Hazmat teams (Technician Level), Rescue teams and Medical personnel (EMT?s) on duty.  The areas have response programs to deal with any type of emergency and perform in area drills annually on each shift.  The site has an Emergency Plan to deal with any event once it is elevated to a certain level that works out of a site EOC.  Annual site drills are held 4 times a year, always followed by critiques looking for ways to improve.  Excellent relationships are maintained with localities, Richmond to the north and Chesterfield County to the south.  In the event of an off site release, County officials are notified and they place into effect, their pre-defined notification plans.  Site personnel are notified through a Site Alarm system that is battery supported in the event of a loss of power.  Training for Fire Brigade members, Hazmat team members, Rescue team members and EMT?s meets all NFPA, OSHA and State requirements.  In all of the above except for EMT?s, in many occasions, training is done with and lead by Chesterfield County instructors.  Drills in many cases involve both site and county/city personnel.\n\nGeneral Notes Supporting Information in this Submit:\n\nWorst Case Toxics ? In the 1999 Submit, 2 operations that use Chloroform in were used as a Worst Case and the other as the Alternate Worst Case.  Since these 2 operations are at the opposite ends of the site and affect different population centers,"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 55888,
      "SummaryText": " we concluded the best way to deal with this was to have 2 Worst Cases, and then the more realistic, Alternate Worst Case of an unload hose failure in the 2004 and 2009 Submit.\n\nConcerning Oleum, the site uses Sulfuric Acid at a concentration of 100.1 plus or minus 0.1%.  This is considered Oleum since it exceeds 100%.  In calculating the LFA for 0.9% Oleum, the 1999 RMP Submit used Monsanto data and published data (Brand and Rutherford).  In addition, the vapor pressure was calculated using the Schrage/Nilges thermodynamic model.  This was done as a confidence check on the Monsanto numbers.  In 1997, our RMP Submit preparer contacted the EPA concerning this weak Oleum or strong Sulfuric Acid question around vapor pressure and the EPA referred the question to ICF Incorporated in Fairfax, VA.  The same conclusions were used in this submit that were used in the 1999 submit since the toxic has not changed and there is supporting data available if needed for the LFA.\n\nThe site is claiming a CBI for its Worst and Alternate Worst Case Flammable for business confidential reasons.  DuPont claimed and was granted CBI protection from the EPA on May 6, 1993.  On June 23, 1997 our Corporate Attorney discussed with an EPA Attorney (Mr. Averbach) this question to confirm the May, 1993 grant.  Averbach?s opinion from that discussion was, since no rule had been made to cover it, was to submit a ?sanitized? version of the Submit to the EPA where the chemical could be identified only by class or chemical group designation.  A paper copy, ?non sanitized? would be submitted to the EPA at the time of the Submit contained the EPA listed Flammable.  The same premise is being used with this submit.  Again, the discussion and opinion between our attorney and your attorney is available if requested."
    }
  ]
}