{
  "FacilityID": 55900,
  "FacilityName": "Thornton Water Treatment Plant",
  "FacilityStr1": "9520 Ellen court",
  "FacilityStr2": null,
  "FacilityCity": "Thornton",
  "FacilityState": "CO",
  "FacilityZipCode": "80229",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08001",
  "LEPC": "Adams County",
  "FacilityLatDecDegs": "39.870833",
  "FacilityLongDecDegs": "-104.969444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.ci.thornton.co.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Thornton",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Mr. Mark Koleber",
  "OperatorStr1": "9500 Civic Center Drive",
  "OperatorStr2": null,
  "OperatorCity": "Thornton",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80229",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000074956",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-08-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-06-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-08-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-04-16 00:00:00",
  "DeRegistrationEffectiveDate": "2021-04-07 00:00:00",
  "AnniversaryDate": "2014-08-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.8697,
  "FRS_Long": -104.9731,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 81336,
      "AltID": "Chlorine",
      "FacilityID": 55900,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 108217,
          "ProcessID": 81336,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 83318,
          "ProcessID": 81336,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 29670,
              "Process_NAICS_ID": 83318,
              "SafetyReviewDate": "2012-07-30 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2009-08-12 00:00:00",
              "ChangeCompletionDate": "2009-12-10 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-07-30 00:00:00",
              "TrainingReviewDate": "2013-07-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-08-01 00:00:00",
              "EquipmentInspectionDate": "2009-08-19 00:00:00",
              "EquipmentTested": "Chlorine detector",
              "ComplianceAuditDate": "2012-08-12 00:00:00",
              "AuditCompletionDate": "2012-08-12 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 31005,
                  "PreventionProgram2ID": 29670,
                  "ProcessChemicalID": 108217
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 55900,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-08-01 00:00:00",
    "ERTrainingDate": "2008-08-01 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "3035387490",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 55900,
      "SummaryText": "According to EPA guidance, the executive summary must include a brief description of the facility¿s Risk Management Program.\n\n\nBackground\nThe Thornton Water Treatment Plant has used chlorine for disinfection without serious incident since its construction in 1954.  This successful operating record is due to the City of Thornton¿s commitment to training programs, operating procedures, operator expertise and maintenance activities.  \n\nThe Thornton Water Treatment Plant is a 20-MGD municipal water treatment plant serving communities of Thornton, Western Hills, Sherrelwood and Federal Heights.  The city of Thornton diverts water from Clear Creek near Golden and transports the water the Farmers Highline, Croke and Church Canals to Standley Lake which is the supply fo the Thornton Water Treatment Plant.  The plant treats water by clarification, filtration and disinfection.  Once the treatment process is complete the water is suitable for human consumption.\n\n68.155a.  Accidental Release and Emergency Response Policies\nChlorine gas is used for the disinfection process.  Although the primary purpose of adding chlorine gas to drinking water is disinfection, the chlorine also provides taste and odor control for drinking water.  Chlorine for the chlorination process is stored in eight one ton containers.  Usually two containers are manifolded delivering chorine gas ant the remaining containers are haled for stand-by.  Chlorine gas is pulled from an online chorine tank and fed to chlorinators that regulate the feed flow rate.  Injectors mix the chorine gas with a stream of plant water.  The chlorine storage building is secured to prevent unauthorized personnel from accessing the area.  The treatment plan maintains chlorine leak detection devices in the container storage area, chlorinator room and the injector area.  Each of the chlorine detection process is connected to the local remote alarm system.  The local system consists of a flashing red light and an audible horn.  The re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 55900,
      "SummaryText": "mote system is tied into the plane wide computerized alarm system and emits a visual and audible alarm.  \n\n68.155c.  Offsite Consequence Analysis\nOne worst-case release scenario and one alternative release scenario was assessed for the chlorine process.  To ensure a common basis for comparisons, the EPA defined the worst-case scenario as the release of the largest quantity of a regulated substance from a single vessel or process line that results in the greatest distance to an endpoint.  The alternate release rate is a release that is considered more reasonable or `more likely¿. Active mitigation measures can be used in determining the alternative release scenario while the worst-case scenario is only allowed consideration of passive mitigation measures.  The toxic endpoint for the chlorine has been defined by EPA to be 0.0087 mg/L.  This airborne concentration that is used as the toxic endpoint is the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour with experiencing or developing irreversible or other serious health effects.  The distance to the toxic endpoint becomes a radius for a circle around the covered process containing the regulated substance.  Residual population within the circle is required to be determined bas on available census information.  The population number is reported as part of the PA submittal.  This method greatly over estimates the population potentially exposed to a single chlorine release because the plume would see the lowest elevations in the direction of the wind during a release.  Since the downwind direction cannot be anticipated for an accidental release, EPA mandated the circle estimation method.  Released scenarios and distances to toxic endpoint are discussed I more detain in the subsequent paragraphs.  Worst-case release hall be greater than the following:\n\n1. The greatest amount held in a sing vessel or \n2.  The greatest amount in a pipe \n\nFor the chlorine"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 55900,
      "SummaryText": "process at the Thornton Water Treatment Plant, the worst-case scenario release is that of a 2,000 pound chlorine container (maximum held in a single vessel) ruptures and the contents escape to the atmosphere in 10 minutes.  The distance to the toxic end point worst-case release was taken from EPA¿s Appendix F:  Supplemental Risk Management Program Guidance for Wastewater Treatment Plans revised in 2004.  The development in the area of the Thornton Water Treatment Plant is a mix of residential, open areas and commercial buildings.  Based on 40 CFR 68.22(e) the Thornton Plant is in an area considered to be urban.  The residential population within the 1.3 mile radius of influence was determined to be approximately 19,000 based on 2004 census information. \n\nOne alternative release scenario considered is in accordance with the guidelines provided in CFR 68.22 and 68.28.  The scenario for the alternative releases follows:  the regulation dictates an alternative release scenario that results in an offsite impact.  To achieve this end a gas release from a one ton container was chosen for the alternative release scenario.  In this scenario the flexible hosing on a one ton container is dislodged while the valve is open.  The dislodgement could be caused by a heavy object ramming against the valve and/or flexible connection.  However, the impact would have to be at a specific angle to result in the damage theorized.  Due to the construction of the storage area and the containers, dislodged the connection is thought to be very unlikely.  The container valve opening is 9/32¿ according the ¿Handbook of Chlorination and Alternative Disinfectants¿.  Once dislodged, chlorine gas exits through the valve opening.  According to the EPA Guidance document for choked release of vapor (i.e., emerging at the speed of sound from the hole), the release for chorine is give by:  QR = 190 Ah, where : 190 = chemical specific factor chlorine at a take pressure of 113 psia and a temperature of 25"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 55900,
      "SummaryText": "degrees C.  Ah = hole area in square inches = 0.062 inches squared.  An opening of 9/32 inches equates to a release rate of approximately 12 pounds per minute.  Based Exhibit F-11this equates to a release rate of approximately 12 pounds per minute and a distance to the toxic endpoint of 0.1 miles.  Based on the 2004 census information the population within 0.1 miles of the Thornton facility is 81.  \n\n\n\n\n68.155(d) Accidental Release Prevention Program.\nThe Thornton Water Treatment Plant continuously evaluates and updates their safety and prevention procedures as needed.  The existing prevention program was reevaluated prior to the development of this revision to the Risk Management Plan.\n\n68.155(e) Five Year Accident History\nChlorine has been used at the facility since its construction in 1954.  No accidents as described under 40 CFR68.42 (a) have occurred at this facility since it began operation.\n\n68.155(f) Emergency Response Program\nThe emergency response program established by the City of Thornton does not require personnel to act as the site incident commander.  In the case of an incident, the City of Thornton Fire Department becomes the incident commander and assumes the role of directing response activities include any community emergency evacuation measures.  Fire Rescue staff train at the Thornton facility on an annual basis.\n\n68.155(g) Safety Improvements\nIn response to the process hazard review, the City will implement documentation procedures for safety training testing.  \n\nConclusion"
    }
  ]
}