{
  "FacilityID": 5613,
  "FacilityName": "Cheraw Water Treatment Plant",
  "FacilityStr1": "Service Street",
  "FacilityStr2": null,
  "FacilityCity": "Cheraw",
  "FacilityState": "SC",
  "FacilityZipCode": "29520",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45025",
  "LEPC": "Chesterfield Co. Emergency Pre",
  "FacilityLatDecDegs": "34.7025",
  "FacilityLongDecDegs": "-79.882222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": "cherawwater@shta.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Town of Cheraw",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Town of Cheraw",
  "OperatorStr1": "P.O. Box 111",
  "OperatorStr2": null,
  "OperatorCity": "Cheraw",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29520",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000070807",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-09 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Cheraw Water Treatment Plant Chlorine RMP",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-15 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 34.7025,
  "FRS_Long": -79.88222,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6707,
      "AltID": "Cheraw Water Plant",
      "FacilityID": 5613,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7317,
          "ProcessID": 6707,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6863,
          "ProcessID": 6707,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2812,
              "Process_NAICS_ID": 6863,
              "SafetyReviewDate": "1999-05-24 00:00:00",
              "PHA_Date": "1999-05-24 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": "Vandalism",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-24 00:00:00",
              "TrainingReviewDate": "1999-05-24 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-24 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Pipe, Chlorinator, Valves, Injectors",
              "ChangeMgmtDate": "1986-04-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-24 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-24 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-24 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-24 00:00:00",
              "ContractorSafetyEvalDate": "1986-04-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "This prevention program applies to the chlorination process at the Cheraw Water Plant",
              "_chemicals": [
                {
                  "PrimaryKey": 3206,
                  "PreventionProgram3ID": 2812,
                  "ProcessChemicalID": 7317
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5613,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Cheraw Fire Department",
    "CoordinatingAgencyPhone": "8435375941",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "Cheraw Employees do not respond to a release of a regulated substance"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5613,
      "SummaryText": "Executive Summary\n\nI.  The Town of Cheraw Department of Public Utilities owns and operates a Water Treatment Plant on Service Street within the Town of Cheraw limits.  The facility is committed to providing Town employees a safe working environment.  To ensure this standard, the Town has established safe working practices, standard operating procedures, and accident prevention programs.  Management is dedicated to training employees on proper operating procedures, emergency response, and equipment use.  To prevent accidental releases of chemicals, the Town follows all applicable sections of the United States Environmental Protection Agency (EPA) Prevention Program. The Town has enlisted the help of the Cheraw Fire Department for emergency response to comply with the EPA Emergency Response Program requirements.\n\nII. The Town of Cheraw Water Treatment Plant treats surface water from the Pee Dee River for distribution within the Town limits and the surrounding area.  The current plant capacity is 6.0 million gallons per day.  \n\nThe plant begins at the intake structure, which consists of two traveling screens and an eductor system, before pumping the raw water to the treatment plant.  The intake draws water from the river surface by three (3) raw water pumps.  The pumps convey the water to the treatment plant where it flows through a venturi flow meter and rate of flow controller.  The raw water is injected with chlorine, alum, and caustic soda before entering a rapid mixing chamber.  The water leaves the chamber and enters two single stage flocculation basins before it is routed through two conventional sedimentation basins to settle out the floc.  The resulting sludge is removed daily from the sedimentation basins with a Trac-Vac system.  The water is then injected with free chlorine and sent through two (2) dual bay filters rated at 4.0 g.p.m./ft2 or approximately 6.4 million gallons per day.  The filters contain a sand and anthracite media.  Each filter is equipped "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5613,
      "SummaryText": "with sixteen surface wash units.  The filtered water is routed to a post mix chamber in the pipe gallery where chlorine, caustic soda and fluoride are added in line to the mixing chamber.  The water is then stored in one of two (2) clearwells prior to entering the distribution system.\n\nThe chlorine is stored in one-ton cylinders liquefied under pressure outside the lab building at the plant. The maximum quantity of chlorine stored on site is contained in three cylinders totaling 6,000-pounds. \n\nIII.  For the Process Hazard Analysis, two release scenarios, a \"worst-case release\" and \"alternate release scenario\", were evaluated for impact on the plant and its surroundings.  The worst-case release, as defined by EPA, is the \"greater of the following: (1) For substances in a vessel, the greatest amount held in a single vessel, taking into account administrative controls that limit the maximum quantity; or (2) For substances in pipes, the greatest amount in a pipe, taking into account administrative controls that limit the maximum quantity as a liquid under pressure, the owner or operator shall assume that the quantity in the vessel or pipe  is released as a gas over 10 minutes.\"  The alternative scenario is one \"more likely to occur than the worst-case release scenario\".  \n\nThe worst-case scenario for the Cheraw Water Treatment Plant evaluated the release of 2,000 pounds of chlorine as a gas within a ten-minute time span.  The release was modeled using the EPA modeling tool, RMP*Comp, to determine the distance to toxic endpoint.   The distance to toxic endpoint is the distance the vapor cloud will travel before the maximum airborne concentration reaches a level that nearly all individuals can be exposed for up to one-hour without experiencing or developing irreversible or other serious health effects.  For the chlorine system at the water treatment plant, the release of one ton-cylinder (2,000 pounds) would travel 2.2 miles before reaching its toxic endpoint.  This di"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5613,
      "SummaryText": "stance accounts for the EPA-mandated meteorological conditions, namely Stability F, wind speed of 1.5 m/sec, highest maximum daily temperature of 116:F and average humidity of 65%.  This worst case release would affect approximately 8,750 people, several schools, hospitals, recreation areas, and a commercial/industrial area.  The Pee Dee River and Huckleberry Creek are potential environmental receptors.  \n\nThe alternative release scenario involves a vapor release from a 3/16-inch hole for a 60-minute duration.  The release was modeled in the EPA's RMP Guidance for Wastewater Treatment Plants Reference Tables or Equations.  The release accounted for a wind speeds of 3.0 m/sec, and Stability Class D in a rural environment.  The release resulted in a distance to toxic endpoint of 0.1 mile.  Approximately 400 people, a recreational area and the environmental receptors above would be affected.  No passive mitigation has been considered at the water treatment plant.  \n\nThe installation of chlorine detectors and alarms in conjunction with a trained emergency response team has prepared the Town of Cheraw for a chemical release.  In the event of a release, employees are instructed to assist the response team with evacuations while the response team attempts to contain the situation.  Emergency Repair Kits for the chlorine cylinders are on hand to control or stop a release. \n\nIV. The Department of Public Works follows the EPA guidelines for Risk Management and the guidelines established by OSHA for Process Safety Management.  The two codes require the Town to evaluate the on and off site risks associated with a highly hazardous chemical and ensure that proper precautions and plans are implemented to minimize the impact of such release.  The Town completed a Process Hazard Analysis to review the causes and effects of a chemical release.  \n\nThe Town of Cheraw developed a preventative maintenance program to keep the chlorine equipment in optimum condition. Any equipment not in p"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5613,
      "SummaryText": "roper working order is immediately evaluated for repair or replacement.\n\nIn addition to a preventative maintenance program, the Town has established standard operating procedures in conjunction with the Chlorine Institute and manufacturer's recommendations.  Employees are required to follow the standard procedures at the plant, especially near a highly hazardous chemical area.  All employees are trained prior to exposure to equipment and provided refresher training at least every three years.  Chemical awareness is discussed both in training and during monthly safety meetings where employees can discuss any hazards or potential hazards of the chlorine system.\n\nChemical specific prevention steps include the installation of the gas monitors and alarm system.  Self-contained breathing apparatus, gloves, goggles and aprons are available for employees for protection against a chlorine leak.\n\nV. No accidental releases of chlorine have occurred at this facility within the last five years.\n\nVI. The Water Treatment Plant is covered under the community emergency response program.  The Fire Department, which is a member of the Local Emergency Planning Committee (LEPC), is qualified to handle a chlorine leak or spill at the water treatment plant.  The Fire Department has also met with surrounding industries to coordinate training for and response to a chemical spill.  Water treatment plant employees are trained on proper emergency response during the employee training sessions.\n\nVII. The Town of Cheraw is evaluating the installation of secured entrances and exits to the water treatment plant and post \"No Hot Work\" signs around the chlorine area as a result of the Process Hazard Analysis (PHA).  These recommendations will be considered for future implementation at the water treatment plant."
    }
  ]
}