{
  "FacilityID": 5691,
  "FacilityName": "Cloverdale Foods Company",
  "FacilityStr1": "3015 34th Street NW",
  "FacilityStr2": null,
  "FacilityCity": "Mandan",
  "FacilityState": "ND",
  "FacilityZipCode": "58554",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38059",
  "LEPC": "Mandan Fire Department",
  "FacilityLatDecDegs": "46.856917",
  "FacilityLongDecDegs": "-100.930667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "cloverdalefoods.com",
  "FacilityEmailAddress": "cloverdalefoods.com",
  "FacilityDUNS": 61445813,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cloverdale Foods Company",
  "OperatorStr1": "3015 34th Street NW",
  "OperatorStr2": null,
  "OperatorCity": "Mandan",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58554",
  "OperatorZipCodeExt": null,
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000073074",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 46.857,
  "FRS_Long": -100.93047,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6795,
      "AltID": " Refrigeration System",
      "FacilityID": 5691,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7415,
          "ProcessID": 6795,
          "ChemicalID": 56,
          "Quantity": 15600.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6951,
          "ProcessID": 6795,
          "NAICSCode": "311613",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2849,
              "Process_NAICS_ID": 6951,
              "SafetyReviewDate": "1999-05-04 00:00:00",
              "PHA_Date": "1999-05-04 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-05-04 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-04 00:00:00",
              "TrainingReviewDate": "1999-05-04 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-04 00:00:00",
              "EquipmentInspectionDate": "1999-06-12 00:00:00",
              "EquipmentTested": "The whole ammonia system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-10 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-01 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3248,
                  "PreventionProgram3ID": 2849,
                  "ProcessChemicalID": 7415
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5691,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Mandan Fire department",
    "CoordinatingAgencyPhone": "7016673288",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5691,
      "SummaryText": "This document was developed for Cloverdale Foods Company (Cloverdale) - Mandan Facility in an effort to fulfill criteria of the Risk Management Program (RMP), as required by Section 112(r) of the Clean Air Act (CAA), and regulated by 40 CFR, Part 68.  Cloverdale is a food processing plant.  The quantity of ammonia in the refrigeration system/process is greater than the Threshold Quantities (TQ) of 10,000 pounds.  This is EPA's criteria for requiring the development and submittal of the information found in this RMP.  A hazard assessment was conducted on the process, and consideration was also given to the other hazardous chemicals at the plant as well.\n\nAmmonia is considered toxic by EPA standards.  The properties that make ammonia toxic make it necessary to observe certain safety precautions in handling this chemical to prevent unnecessary human exposure, and to reduce the potential impact or threat to nearby members of the community and/or environment.  Safety depends upon the manner in which we handle chemicals; combined with safety devices inherent in the design of this facility; and the training of our personnel.\n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is this facility's intent to uphold industry standards in the design, construction, and operation of the facility.  It is our policy to adhere to all applicable federal, state, and local laws.  If an emergency was to occur, it is our policy and/or procedure to notify the Mandan Fire Department (via the 911 system), and request that they respond to the emergency, as well as providing on-site response (if safe to do so) to the limits of our training and equipment.\n\nStationary Source and Regulated Substances Handled\n\nAmmonia is used at the plant as a refrigerant in the facilities refrigeration system.  Inventory of ammonia held within the facility's refrigeration system is a maximum of 15,630 pounds.  The ammonia continuously re-circulates through the refrigeration system in both a gaseous"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5691,
      "SummaryText": " and liquid state within the components and steel piping of the system.\n\nThe facility has 6-foot high chain link fencing on three sides and the entry points for access to the plant are controlled.\n\nWorst-Case Release Scenario and the Alternative Release Scenario\n\nRMP standards require that a Worst Case Scenario (WCS) representing all toxics be developed for covered processes, as well a WCS representing flammables.  Following is the WCS for ammonia representative of the hazard.  Similarly, RMP rules require an Alternative Release Scenario (ARS) for this same chemical.\n\nWCS for Ammonia - 866 lbs. is the maximum quantity of ammonia in a single storage vessel or piping configuration, after utilizing a .55 multiplier for passive mitigation, that can be released in a WCS.  The WCS, according to EPA's Guidance Document EPA 550-B-98-010 criteria, the distance to toxic endpoint for this WCS is 0.5 miles (rural).  The facility is located in an open industrial park near a populated, urban area with an estimated population of 66 persons living within the 0.5-mile radius.  No environmental receptors (as defined by 40 CFR Part 68) are located within this radius.\n\nARS for Ammonia - The release chosen is a 1/162 diameter hole that releases 7 lbs./min. of ammonia from the steel line going to the condenser.  The distance to toxic endpoint for this ARS is 0.1 miles, which reaches a public receptor (a commercial business to the east of the plant).\n\nGeneral Accidental Release Prevention Program and Specific Prevention Steps\n\nIt is this facility's intent to comply with EPA's accidental release prevention rule and with all applicable state codes and regulations.  Cloverdale takes a systematic, proactive approach to evaluating chemical processes.  Using this approach, the design, technology, operation and maintenance activities, emergency preparedness plans, training, process changes, and other elements that affect the covered processes are considered.  By conducting thorough evaluations, "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5691,
      "SummaryText": "the consequences of catastrophic releases can be minimized or prevented.\n\nBy fulfilling the required elements of the RMP standards, Cloverdale intends to prevent unwanted releases or minimize the impacts of accidental releases of hazardous chemicals, especially into locations that could expose employees, the community or the environment to serious hazards.  Our management systems address each of the key features of a successful release prevention program including:\n\n7 Maintaining Process Safety Information (PSI):  Technical information about safe operating limits of the process and the associated hazards of the chemical involved.\n7 Conducting Process Hazard Analyses (PHA):  Technical analysis of the plant's process in order to anticipate what might go wrong and recommend approaches to minimize the possibilities and affects of such occurrences.\n7 Standard Operating Procedures (SOP):  Technical and administrative procedures used to operate the plant safely.\n7 Training:  Provide employees with information necessary to ensure safe operation.\n7 Mechanical Integrity:  Ensures proper maintenance of the process on an ongoing basis.\n7 Management of Change (MOC):  Analyze and understand the impact of changes in equipment, procedures, and personnel.\n7 Pre-Startup Safety Review (PSSR):  Ensure all necessary elements for operating a safe process are in place prior to introducing the hazardous chemical into a \"new\" system.\n7 Compliance Audits:  Periodic evaluation and updating of the process operation to ensure all RMP elements are being applied properly.\n7 Incident Investigation:  Procedures for investigating the causes of near-miss or accidental releases and developing measures to prevent future similar occurrences.\n7 Employee Participation:  Philosophy and approach to incorporating the knowledge and experience of all facets of operation regarding the covered process.\n7 Hot Work Permit:  Documented program for controlling the hazards associated with ignition source activities t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5691,
      "SummaryText": "hereby minimizing potential catastrophic release.\n7 Contractors:  Policy for ensuring safe work practices of contractors on the facility and a systematic approach of communicating hazards inherent to the covered process which the contractor may be working on or near.\n\nOur company and our employees are committed to the standards set by the RMP regulations.  We do business, and have specific accountabilities and controls to ensure that we are meeting high standards for accident prevention.  Cloverdale has also developed a management system, which identifies specific job positions and responsibilities to ensure proper implementation of this RMP.\n\nFive-Year Accident History\n\nThere have been no releases of ammonia or any other toxic/extremely hazardous chemicals in the past 5 years, which have resulted in injury, death, or off-site consequences, response/restoration activities.\n\nEmergency Response Program\n\nWe have discussed the content and intent of this program with the Mandan Fire Department.  We rely on our in-house training and equipment for initial response (if safe to do so) and acquiring backup support from the local fire department.  The Mandan Fire department has a mutual aid agreement with the City of Bismark Fire Department and Ameco Oil Refinery, less then ten minutes away.\n\nPlanned Changes to Improve Safety\n\nThe PHA did not identify any required changes to improve safety.  Therefore, Cloverdale intends to continue the routine process operations."
    }
  ]
}