{
  "FacilityID": 5709,
  "FacilityName": "Sargent Canyon Cogeneration Company",
  "FacilityStr1": "San Ardo Oil Field",
  "FacilityStr2": null,
  "FacilityCity": "San Ardo",
  "FacilityState": "CA",
  "FacilityZipCode": "93450",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "35.935833",
  "FacilityLongDecDegs": "-120.840833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3229254,
  "ParentCompanyName": "Texaco San Ardo Cogeneration Company",
  "Company2Name": "Viejo Energy Company",
  "CompanyDUNS": 3229254,
  "Company2DUNS": 3229254,
  "OperatorName": "Sargent Canyon Cogeneration Company",
  "OperatorStr1": "P.O. Box 81018",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93380",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": "CA0814179",
  "EPAFacilityID": "100000074858",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-06-27 00:00:00",
  "DeRegistrationEffectiveDate": "2017-01-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 35.95459,
  "FRS_Long": -120.862144,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6815,
      "AltID": "SCR System",
      "FacilityID": 5709,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7440,
          "ProcessID": 6815,
          "ChemicalID": 56,
          "Quantity": 69960.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6971,
          "ProcessID": 6815,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2863,
              "Process_NAICS_ID": 6971,
              "SafetyReviewDate": "1998-07-27 00:00:00",
              "PHA_Date": "1996-11-13 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1996-03-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1996-11-22 00:00:00",
              "TrainingReviewDate": "1998-10-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-03-01 00:00:00",
              "EquipmentInspectionDate": "1998-07-01 00:00:00",
              "EquipmentTested": "Emergency shutoff valves",
              "ChangeMgmtDate": "1997-09-03 00:00:00",
              "ChangeMgmtReviewDate": "1995-06-06 00:00:00",
              "PreStartupReviewDate": "1998-07-27 00:00:00",
              "ComplianceAuditDate": "1998-08-20 00:00:00",
              "AuditCompletionDate": "1999-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1996-12-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-10-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-10-01 00:00:00",
              "ContractorSafetyEvalDate": "1995-06-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3264,
                  "PreventionProgram3ID": 2863,
                  "ProcessChemicalID": 7440
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5709,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Monterey Health Department",
    "CoordinatingAgencyPhone": "8317554511",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 5709,
      "SummaryText": "valent to the distance the \nrelease would travel with concentrations at or above the endpoint.  This circle \nalso defines the area in which potential environmental receptors must be \nidentified.\n\nThe worst case release is defined by the U.S. EPA as the total release of the \ncontents of the single largest vessel or pipe within 10 minutes.  For liquefied \ngases stored under pressure, the entire contents of the vessel or pipe are \nassumed to be released as a vapor.  A total vapor release is highly unlikely.  \nHowever, this standardized worst case scenario was developed for emergency \nresponse agencies to use for planning purposes.\n\nAn alternative release scenario is a release that is more likely to occur than the \nworst-case release scenario.  For Sargent Canyon Cogeneration Company, the \nalternative release scenario was selected based on the results of the Hazard and \nOperability Studies for the ammonia-based SCR and TES systems.  The worst \ncredible release event with the highest discharge rate would potentially have the \ngreatest offsite impact.  A failure of the ammonia delivery hose was identified in \nthe Hazard and Operability Studies as the worst credible release event having \nthe highest release rate, and therefore, was chosen as the alternative release \nscenario.    \n\nSargent Canyon Cogeneration Company has analyzed the offsite consequences \nof the worst-case and alternative release.  For the worst-case release scenario, \nthe release of 69,960 lbs. of ammonia within 10 minutes, the plume would travel \n3.1 miles at concentrations at or above the endpoint.  Using 1990 Census data, \nthe population potentially affected within the worst-case release scenario circle is \n120.  There were no sensitive or environmental receptors within the worst case \nrelease scenario circle.\n\nSargent Canyon Cogeneration Company has installed passive and active \nmitigation systems to aid in the control of ammonia, if a release were to occur.  A \nconcrete containment wall surrounds the"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 5709,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nSargent Canyon Cogeneration Company stores and utilizes anhydrous ammonia \nin a selective catalytic reduction (SCR) process and in a thermal energy storage \n(TES) system at their facility in the San Ardo oil fields near Paso Robles, \nCalifornia.  It is Sargent Canyon Cogeneration Company's policy to comply with \nall applicable governmental regulations.  Further, it is Sargent Canyon \nCogeneration Company's objective to be a responsible citizen of the community \nin all of its business activities.\n\nSargent Canyon Cogeneration Company emphasizes safe and environmentally \nsound operating practices and procedures through their employee training \nprograms.  In addition to job specific training, operators and maintenance \npersonnel receive training in fire prevention, fire control, accident prevention, \nsafety, and first aid.  Additionally, an emergency action plan has been prepared \nfor Sargent Canyon Cogeneration Company and a chain of command to respond \nto emergencies has been established.\n\nSargent Canyon Cogeneration Company has developed a detailed Compliance \nAudit Checklist which is used to evaluate compliance with the Process Safety \nManagement (PSM) standard and 40 CFR Part 68 (RMP regulations).  At least \nevery three years, Sargent Canyon Cogeneration Company audits these \nprograms and any findings of noncompliance are documented and responded to \nand the deficiencies are corrected.\n\nDescription of the Stationary Source and Regulated Substances \n\nTexaco San Ardo Energy Company, a wholly-owned subsidiary of Texaco \nProducing Inc., formed a general partnership with the Anacapa Energy \nCompany, a wholly-owned subsidiary of Edison Mission Energy Company, for \nthe development of the cogeneration plant.  The partnership, named Sargent \nCanyon Cogeneration Company, owns and operates the facility.  The plant \nbegan commercial operation in October, 1991.  \n\nThe Sargent Canyon Cogeneration"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5709,
      "SummaryText": "Company facility is located in Section 13, \nT32S/R10E, MDB&M in the sparsely populated San Ardo oil fields.\n\nCogeneration, in the case of the Sargent Canyon project, is the simultaneous \nproduction of thermal energy and electrical energy from the combustion of a \nsingle fuel source.  Combustion of the fuel takes place in a gas turbine that is \nphysically coupled to an electric generator.  Waste heat from the gas turbine's \nexhaust flows into a heat recovery steam generator (HRSG).  The HRSG \nextracts the heat from the exhaust gases and produces steam for thermally \nenhanced oil recovery.  Electricity is produced at the same time via the electric \ngenerator coupled to the combustion turbine.  \n\nAnhydrous ammonia is used at the Sargent Canyon Cogeneration Company \nfacility to create a reducing atmosphere in the SCR process.  This reducing \natmosphere in the flue gas helps convert nitrogen oxides to nitrogen and water \nas it passes through the catalytic reactor.  The operation of the SCR system \nsubstantially lowers the emissions of nitrogen oxides from the gas turbine.\n\nLiquid ammonia is stored in a 15,000 gallon (water capacity) storage tank.  The \nmaximum intended inventory of the anhydrous ammonia storage tank is based \non the American National Standard Institute's K61.1 safety requirements and the \nOccupational Safety and Health Administration (OSHA) regulations published in \nSection 1910.111 of 29 CFR (and Section 509 of Title 8, CCR).  These standards \nand regulations limit the maximum ammonia storage capacity of the tank to \napproximately 69,960 pounds.\n\nAnhydrous ammonia is also utilized as a refrigerant in the TES system to cool the \ninlet air for the gas turbine during warm weather.  The TES system includes an \nammonia  refrigeration system that generates ice during off-peak hours.  The ice \nis stockpiled in an ice storage tank.  During on-peak hours, chilled water is \ncirculated from the ice storage tank to the inlet to the gas turbine.  At the inlet of \nth"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5709,
      "SummaryText": "e gas turbine, the chilled water flows through a heat exchanger which cools the \ninlet air of the gas turbine.  Cooling the inlet combustion air of the gas turbine \nimproves the turbine's power output during warm on-peak hours.\n\nThe ammonia refrigeration system consists of a low pressure receiver, a high \npressure pilot receiver, an evaporator, a compressor, two condensers, and an oil \nseparator reservoir.  The largest vessel in the system is the low pressure receiver \nwhich contains approximately 3200 pounds of anhydrous ammonia.\n\nFor purposes of the offsite consequence analyses, the RMP regulations define \nthe toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 ppm).  This \nconcentration has been established by the American Industrial Hygiene \nAssociation as the Emergency Response Planning Guideline Level 2 (ERPG-2).  \n\nERPG-2 is the maximum airborne concentration below which it is believed that \nnearly all individuals could be exposed for up to one hour without experiencing or \ndeveloping irreversible or other serious health effects or symptoms which could \nimpair an individual's ability to take protective action.\n\n\nWorst-Case Release Scenario and Alternative Release Scenario\n\nOffsite consequence analyses are used as tools to assist in emergency response \nplanning.  The RMP regulations require the owner or operator of a stationary \nsource to analyze the offsite impacts due to an accidental release of a regulated \nsubstance.  The offsite consequence analysis for a Program 3 process must \nanalyze the worst-case release scenario and an alternative release scenario.  \nSince Sargent Canyon Cogeneration Company's SCR system and the TES \nsystem are considered Program 3 processes, both release scenarios were \nevaluated in the offsite consequence analysis.\n\nThe offsite consequence analysis must include an estimate of the residential \npopulation within an area potentially affected by the accidental release scenarios.  \nThis area is defined as a circle with a radius equi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5709,
      "SummaryText": "ammonia storage and vaporizer \nsystem.  A release of liquid ammonia could be contained within this area.  The \ncontainment would limit the ammonia surface area in contact with the ambient \nair, thereby decreasing the rate of volatilization.  \n\nThe ammonia storage system is also equipped with a water deluge system that \nwill spray water onto and around the storage tank.  In the event of a fire, this \ndeluge system can be used to cool the tank and help mitigate a temperature \ninduced overpressure release\n\nAlthough mitigation systems are installed, a specific mitigation factor cannot be \nassigned to the systems.  Therefore, no mitigation factors were included in the \nmodeling.  As such, the modeling results should be substantially overstated.\n\nIn the alternative release scenario, a failure of the delivery hose was modeled as \na release of liquefied ammonia stored under pressure.  For a release of 554 \nlb/min of anhydrous ammonia, the plume would travel 0.2 mile at concentrations \nat or above the endpoint.  No residences are located within the 0.2 mile area \naround the Sargent Canyon Cogeneration Company facility.  As such, there \nwould be no population impacts from the alternative release scenario.  There \nwere also no sensitive or environmental receptors within the alternative release \nscenario circle. \n\nThe modeling performed as part of this offsite consequence analysis does not \ntake into account the use of the remote operated shutoff valves that were \ninstalled at the ammonia tank.  These isolation valves take approximately 10 to \n15 seconds to fully close and could greatly reduce the impact of a hose failure \nrelease. \n\nGeneral Accidental Release Prevention Program and Chemical-Specific \nPrevention Steps\n\nA PSM program, which meets the requirements of the general accidental release \nprevention program, has been developed at Sargent Canyon Cogeneration \nCompany to address the anhydrous ammonia system.  The PSM program \nincludes the following chemical-specific preve"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5709,
      "SummaryText": "ntion steps:\n\n\u0007\tWritten process safety information, including information pertaining to the \nhazards of ammonia, the technology of the process, and the equipment in \nthe process has been compiled.\n\n\u0007\tAn initial Process Hazard Analysis (PHA) was performed and has been \nupdated and revalidated at least every five years.\n\n\u0007\tWritten operating procedures have been developed and implemented, and \nare reviewed at least annually.\n\n\u0007\tSafe work practices, such as lockout/tagout, confined space entry, \nopening process equipment or piping, and control over entrance into the \nfacility have been developed and implemented.\n\n\u0007\tEach employee involved in operating the ammonia system has received \ninitial training and refresher training at least every three years.\n\n\u0007\tWritten mechanical integrity procedures have been established and \nimplemented.\n\n\u0007\tA Management of Change (MOC) program has been developed and \nimplemented to address all proposed changes to the ammonia system.\n\n\u0007\tPre-startup safety reviews are performed when a modification is made to \nthe ammonia system that is significant enough to require a change in the \nprocess safety information.\n\n\u0007\tAudits are conducted at least every three years to evaluate compliance \nwith the RMP regulations.\n\n\u0007\tIncident investigation procedures have been established.\n\n\u0007\tA written plan of action regarding the implementation of employee \nparticipation has been developed and implemented.\n\n\u0007\tHot work permits are issued for all hot work operations conducted on or \nnear the ammonia system.\n\n\u0007\tA Contractor Safety Policy has been developed and implemented.\n\nTo ensure that the general accidental release prevention program and the \nchemical-specific prevention steps are implemented, Sargent Canyon \nCogeneration Company has assigned overall responsibility for the RMP elements \nto the Executive Director.  The Executive Director has the overall responsibility \nfor the development, implementation, and integration of the RMP elements.\n\n\n\nFive-Year Accident His"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 5709,
      "SummaryText": "tory\n\nSargent Canyon Cogeneration Company has not had any accidental releases \nfrom the ammonia-based SCR and TES systems that have resulted in deaths, \ninjuries, or significant property damage on site, or known offsite deaths, injuries, \nevacuations, sheltering in place, property damage, or environmental damage in \nthe last five years.\n\nEmergency Response Program\n\nSargent Canyon Cogeneration Company has established an emergency action \nplan and a chain of command to respond to emergencies and to notify \nemergency responders when there is a need for a response.  However, an \nemergency response program does not need to be developed for the facility \nsince Sargent Canyon Cogeneration Company employees will not respond to \naccidental releases of ammonia, the facility is included in the community \nemergency response plan, and appropriate mechanisms are in place to notify \nemergency responders.\n\nPlanned Changes To Improve Safety\n\nThe PHAs were most recently revalidated in March, 1996.  Several changes to \ninspection and offloading procedures were recommended based on the PHA \nrevalidation.  These changes were implemented by November, 1996.\n\nThrough the accidental release prevention program, Sargent Canyon \nCogeneration Company regularly evaluates the need for any changes to improve \nsafety.  Currently Sargent Canyon Cogeneration Company does not have any \nadditional changes planned to improve safety."
    }
  ]
}