{
  "FacilityID": 5727,
  "FacilityName": "Red River Treatment Plant",
  "FacilityStr1": "3512 Barksdale Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Bossier City",
  "FacilityState": "LA",
  "FacilityZipCode": "71112",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22015",
  "LEPC": "Bossier-Caddo Parish LEPC",
  "FacilityLatDecDegs": "32.483333",
  "FacilityLongDecDegs": "93.6875",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "P2",
  "LatLongDescription": "OT",
  "FacilityURL": "www.bossiercity.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Bossier City",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Bossier City",
  "OperatorStr1": "P.O. Box 5337",
  "OperatorStr2": null,
  "OperatorCity": "Bossier City",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "71111",
  "OperatorZipCodeExt": null,
  "RMPContact": "Harrison Lewis, Jr.",
  "RMPTitle": "Plant Superintendent",
  "FTE": 10,
  "OtherEPAFacilityID": "LA0053716",
  "EPAFacilityID": "100000075704",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-02-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-02-18 00:00:00",
  "DeRegistrationEffectiveDate": "2015-01-23 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 32.48451,
  "FRS_Long": -93.68129,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6836,
      "AltID": "Waste Water Treatment",
      "FacilityID": 5727,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 6992,
          "ProcessID": 6836,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7464,
          "ProcessID": 6836,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 7465,
          "ProcessID": 6836,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507464,
          "ProcessID": 6836,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507465,
          "ProcessID": 6836,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5727,
      "SummaryText": "8832 LDEQ Facility ID Number.  In this wastewater treatment plant facility (Bossier City Red River Treatment Plant), we handle chlorine and sulfur dioxide which is considered hazardous by EPA, OSHA, etc.  The same properties that makes chlorine valuable as a wastewater treatment chemical, also makes it necessary to observe certain safety precautions in handling chlorine ad sulfur dioxide.  Overall, the prevention of unnecessary human exposures, reducing the threat to our own personal helath, as well as our co-workers, and reducing the threat to nearby members of the community is the main goal of incorporating this risk management plan into our daily operations.  It is our policy to adhere to all applicable federal and state rules and regulations.  Safety depends upon the manner in which we handle chlorine combined with the safety devices inherent in the design of this facility, with the safe handling procedures that we utilize, along with the training of our personnel.\n\nOur emergency response (action) program was developed with the assistance of Environmenatl Data Services, Inc.  The emergency response plan includes the procedures for notification of the Caddo-Bossier Office of Emergency Preparedness, whcih helps to notify any potentially affected neighbors.  In the event of an emergency that cannot be mitigated solely by manual shutoff of the chlorine or sulfur dioxide system, notifiaction to the Caddo-Bossier Office of Emergency Preparedness will be made to aid in notification of the surrounding population (318-425-5351).\n\nThe primary purpose of this facility is to treat the wastewater system utililzing chemicals such as chlorine and sulfur dioxide.  Both chemicals are received in one ton cylinders and stored until needed.  Chlorine and sulfur dioxide are fed into the wastewater system by automatic feeders.  All cylinders operate on a vacuum system.  This vacuum system will prevent the continual operation of the system if there is an increase or decrease in operat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5727,
      "SummaryText": "ing pressure on the cylinders of feed lines.  Access to the site is restricted to authorized facility employees, authorized management personnel, and authorized contractors.\n\nThe regulated substances handled at this facility are chlorine and sulfur dioxide.  The maximum amount of chlorine that can be stored at this plant is 16,000 pounds.  The maximum amount of sulfur dioxide that can be stored at this site is 12,000 pounds.\n\nThe worst case scenariois failure of the largest storage tank when filled to the greatest amount allowed, which would be a release of 2,000 pounds of chlorine.  Active mitigation has been considered for this scneario consisting of maunaul shutoffs, as well as the vacuum feed system. n Passive mitigation has also been considered for this release scenario, which would be the released into an enclosed space with direct contact with outside air.  It is assumed that the entire contents of the cyllinder are released as vapor.  The distance to endpoint of 0.078 mg/l for the worst case sccenario is 3.5 miles.\n\nAn alternate release scneario was determined for this facility;  however, based on the type of prevention system in placec, the alternate release should be minimal.  The vacuum system has been determined to be effective in preventing small amounts of chlorine from escaping upon system failure.  An estimation based on the line capacity for the feeder lines would be approximately 10 pounds released into the atmosphere.  This amount of vapor chlorine would rsult in a distance to endpoint of approximately 0.08 miles.\n\nThis wastewater treatment facility complies with EPA's Accidental Release Prevention Rule, and with all applicable state codes and regulations.\n\nThere have been no accidental releases of chlorine or sulfur dioxide from this facility in the past five years.  The automatic vacuum system limits the amount (if any) of chlorine or sulfur dioxide that escapes during operational periods.  Operators of the chlorination and sulfur dioxide system"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5727,
      "SummaryText": "s are required to check instruments, cylinders, feed systems, etc. on a daily basis to aid in the prevention of accidental releases.\n\nOur emergency response (action) plan was develpoed with the assistance of Environamental Data Services, Inc.  We have discussed this program with the Caddo-Bossier Office of Emergency Preparedness and the Bossier City Fire Department."
    }
  ]
}