{
  "FacilityID": 5729,
  "FacilityName": "Robert E. Hurst Water Treatment Plant",
  "FacilityStr1": "944 Water Plant Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Mountain Home",
  "FacilityState": "AR",
  "FacilityZipCode": "72653",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05005",
  "LEPC": "Baxter County LEPC",
  "FacilityLatDecDegs": "36.391667",
  "FacilityLongDecDegs": "92.329167",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Mountain Home",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Mountain Home",
  "OperatorStr1": "720 South Hickory",
  "OperatorStr2": null,
  "OperatorCity": "Mountain Home",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72653",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": "ARG640094",
  "EPAFacilityID": "100000075795",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-01 00:00:00",
  "SafetyInspectionBy": "Ark. Municipal League",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.334,
  "FRS_Long": -92.3819,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6838,
      "AltID": "Water Treatment",
      "FacilityID": 5729,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7467,
          "ProcessID": 6838,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 6994,
          "ProcessID": 6838,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3589,
              "Process_NAICS_ID": 6994,
              "SafetyReviewDate": "1999-04-09 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-04-09 00:00:00",
              "ChangeCompletionDate": "1999-10-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-01 00:00:00",
              "TrainingReviewDate": "1999-03-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-01 00:00:00",
              "EquipmentInspectionDate": "1999-04-09 00:00:00",
              "EquipmentTested": "chlorine cylinders, regulators, pressure guages, feed system, etc. (all done daily, and before changing out cylinders)",
              "ComplianceAuditDate": "1998-03-01 00:00:00",
              "AuditCompletionDate": "1999-10-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-04-09 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Robert E. Hurst Water Treatment Plant is a municipal facility owned and operated by the City of Mountiain Home.  This facility falls under the NAICS Code 22131.  Our safety information was last reviewed and updated April 9, 1999.  We are subject tot he handling codes of the National Fire Prottection Associateion for Compressed Cylinder Storage, American National Standards Institute, and American Society of Mechanical Engineers.  These standards, along with applicable (though not required) OSHA Standards have been implemented through written manuals.  Even though this is a municipal facility, and is not governed by OSHA, Robert E. Hurst Water Treatment Plant has decided to use Process Safety Management as the prevention program.  To prevent/limit releases, this facility operates the chlorine system on anu automatic vacuum feed system, manual shutoff valves, and pressure regulators.  Employees at the water treatment plant conduct maintenance checks on all systems involved with the chlorine on a daily basis.  These checks involve reading pressure guages, inspecting cylinders, feed lines, etc.  Employees practice safe handling practices, and follow manufacturer's recommendations on cylinder change-out.  All employees are trained in the maintenance and operating procedures at this facility.  The operating and training procedures were last reviewed in March of 1999.  The employees at the Robert E. Hurst Water Treatment Plant are trained in the classroom, and by on-the-job training.  The last review of maintenancce procedures was in March of 1999.  There have been no incidents or accidents in the past five years.  The last hazard review was conducted on April 9, 1999 by use of a fault tree analysis.  The prevention program for this facility is required to be a Level 2, however, a Leval 3 PSM Prevention Program has been added for a more effective release prevention program.",
              "_chemicals": [
                {
                  "PrimaryKey": 3694,
                  "PreventionProgram2ID": 3589,
                  "ProcessChemicalID": 7467
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5729,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-09 00:00:00",
    "ERTrainingDate": "1999-10-01 00:00:00",
    "CoordinatingAgencyName": "Mountain Home Fire Department",
    "CoordinatingAgencyPhone": "8704252611",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5729,
      "SummaryText": "In this water treatment facility (Robert E. Hurst Water Treatment Plant),we handle chlorine which is considered hazardous by EPA, OSHA, etc.  The same properties that makes chlorine valuable as a water treatment chemical, also makes it necessary to observe certain precautions in handling chlorine.  Overall, the prevention of unnecessary human exposures, reducing the threat to our own personal health as well as our co-workers, and reducing the threat to nearby members of the community is the main goal of incorporating this risk management plan into our daily operations.  It is our policy to adhere to all applicable federal and state rules and regulations.  Safety depends upon the manner in which we handle and use chlorine combined with the safety devices inherent in the design of this facility, with the safe handling procedures that we utilize, along with the training of our personnel.\n\nThe primary purpose of this facility is to treat the raw water supply by utilizing chemicals such as chlorine.  Chlorine is received by individual one ton cylinders and stored until needed.  Chlorine is fed into the raw water system by automatic vacuum operated feeders.  The vacuum system will prevent the continual operation of the system if there is an increase or decrease in operating pressure on the cylinders or feed lines.  Manual shutoff valves are also a part of the prevention system.  Access to the site is restricted to authorized fcility employees, authorized management personnel, and authorized contractors.  The maximum amount of chlorine at this Robert E. Hurst Water Teatment Plant, Mountain Home, AR, is 8,000 pounds.\n\nOur employees conduct proper cylinder change-out procedures daily. They aqlso review operating procedures, and maintenance tasks daily.  The prevention program for this facility is a Level 2.  Lock-out/Tag-out Procedures are used to help prevent an accidental release of chlorine.  When maintenance is conducted on the chlorination system, the Plant Superintende"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5729,
      "SummaryText": "nt (Tom Hubbard), and the Plant Supervisor (Ed Rouse) approve the proper installation of materials, and complete installation.  Any change in maintenance procedure is reviewed and approved by Tom Hubbard and Ed Rouse.  All operators at this facility are knowledgeable in the proper start-up and shut-down procedures for the water treaatment operations.  All guages, valve, fittings, etc.are checked every hour.\n\nOur emergency response program was developed with the assistance of Environmental Data Services, Inc, the Mountain Home Fire Department, and the Baxter County LEPC.  If a chlorine release occurs at Water Plant Rd., the chlorine alarm will sound, and the ventilation system will startup.  Once the indentification of a release, and the severity are made by on duty personnel, notification to Tom Hubbard (Plant Superintendent) will be made so that further determination of the extent of the release can be made.  If the release cannot be controled by active mitigation (manual valve), then evacuation procedures will then be followed.  Tom Hubbard or the on-duty personnel will contact the Mountain Home Fire Department (911), and have them initiate the 911 call out service to the surrounding (affected) population.  The Mountain Home Policce Department will be made aware of the evacuation emergency due to the 911 system.  Tom Hubbard will initiate the HazMat response teaam and initiate mitigation, response activities, and evacuation measures.\n\nThe worst case scenario for this facility is a one ton cylinder failure, which would be a release of 2,000 pounds of chlorine into the atmosphere.  Active mitigation has been considered for this scenario consisting of manual shutoffs and automatic vacuum feed chlorine system.  Passive mitigation has also been considered for this release scenario, which would be a release into an enclosed space with contact with outside air.  It is assumed that the entire contents of the cylinder are released as a vapor.  The distance to endpoint of 0"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5729,
      "SummaryText": ".078 mg/l for the worst case scenarion is 3.5 miles.  The area surrounding the facililty is considered to be urban due to the thick trees and vegetation; as well as the steep, hilly terrain.  This worst case scenarion woul impact approximately 5250 persons.\n\nAn alternate release scenarion was determined for the Water Plant Rd. location.  The cylinders operate on a vacuum feed system, so the amount of chlorine released at the Water Plant Rd. site would be minimal (approximately 10 pounds).  This minimal amount of chlorine released would result in a distance to endpoint of approximately 0.08 miles.  this relatively short distance would only impact approximately 6 persons surrounding the location (populations were based upon Landview software).\n\nThere have been no accidental releases of chlorine from this facility in the past five years.  The automatic vacuum system limits the amount (if any) of chlorine that escapes during operational periods.  Operators of the chlorination system are required to check instruments, cylinders, feed systems, etc. on a daily basis to aid in the prevention of accidental releases.\n\nThis water treatment facilitycomplies with EPA's Accidental Release Prevention Rule, and with all applicable state/federal regulations."
    }
  ]
}