{
  "FacilityID": 5734,
  "FacilityName": "Tucker Creek Wastewater Treatment Plant",
  "FacilityStr1": "1001 Sherwood Lane",
  "FacilityStr2": null,
  "FacilityCity": "Conway",
  "FacilityState": "AR",
  "FacilityZipCode": "72032",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05045",
  "LEPC": "Faulkner County OES",
  "FacilityLatDecDegs": "35.04",
  "FacilityLongDecDegs": "92.295611",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Conway Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Conway Corporation",
  "OperatorStr1": "P.O. Box 99",
  "OperatorStr2": null,
  "OperatorCity": "Conway",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72032",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Fulmer",
  "RMPTitle": "Plant Supervisor",
  "FTE": 12,
  "OtherEPAFacilityID": "AR0047279",
  "EPAFacilityID": "100000076044",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-15 00:00:00",
  "SafetyInspectionBy": "Environmental Data Services",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 35.06556,
  "FRS_Long": -92.49889,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6844,
      "AltID": "Wastewater Treatment",
      "FacilityID": 5734,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7000,
          "ProcessID": 6844,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7473,
          "ProcessID": 6844,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507473,
          "ProcessID": 6844,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5734,
      "SummaryText": "The primary purpose of this facility is to treat the water supply by utilizing chemicals such as chlorine.  Chlorine is received by individual one ton cylinders and stored until needed.  Chlorine is fed into the water system by automatic vacuum operated feeders.  The vacuum system will help prevent the continual operation of the chlorine feed after it reaches the wall mounted regulator.  However, if therre is a leak between the cylinder and the wall mounted regulator (feed line) the only way to shut off the system is to manually shut off the chlorine valve  at the cylinder.  Acess to the site is restricted to authorized facility employees, authorized management personnel, and authorized contractors.  The maximum amount of chlorine at this Tucker Creek Wastewater Treatment Plant, Conway, AR is 8,000 pounds.\n\nOur employees conduct proper cylinder change-out procedures daily, or as needed.  They also review operating procedures and maintenance tasks dialy or as when needed.  The prevention program for this facility is a Level 2.  Lock-out/Tag-out Procedures are used to help prevent an accidental release of chlorine.  When maintenance is conducted on the chlorination system, the Plant Supervisor (Bill Fulmer), and the Water Manager (David Bradley) approve the proper installation of materials, and complete installation.  Any change in maintence procedure is reviewed and aprroved by Bill Fulmer and David Bradley.  All operators at his facility are knowledgeable in the proper start-up and shut-down procedures for the wastewater treatment operations.  All guages, valves, fitings, etc. are checked every hour.\n\nOur emergency response (action) program was developed with the assistance of Environmental Data Services, Inc., the Conway Fire Department, and the Faulkner County LEPC/OES.  If a chlorine release occurs at the Sherwood Lane location, the chlorine alarm will sound which will notify personnel at the facility of a release.  Plant Supervisor (Bill Fulmer) will get personn"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5734,
      "SummaryText": "el organized for an emergency action and possible evacuation.  On duty personel have SCBA equipment that they will use to enter the confined space (due to toxic atmosphere) and determine extent of release.  They can perform an emergency action by attempting to shut off the chlorine cylinder by using the manual valve.  If a release cannot be controlled by the manual valve shut-down, then evacuation procedures will then be followed.  A head count will be made of employees and David Bradley (Water Manager) will be contacted, then the 911 call will be made to notify the Conway Fire Department, Faulkner County LEPC/OES, and Conway Police Department of the release.  Conway Fire Department will organize the Emergency Response activities, and will start evacuation of the affected population.  The release could be alowed by not starting the vent system in the chlorine room until notification to 911 system is made, and evacuation activities can begin.  This will not prevent chlorine from releasing, but will allow for some time to respond.\n\nThe worst case scenario for this facility is a one ton cylinder failure, which would release 2,000 pounds of chlorine into the atmosphere.  Active mitigation has been considered for this scenario consisting of manual shut-offs and automatic vacuum feed chlorine system.  Passive mitigation has also been considered for this release scenario, which would release into an enclosed space with little contact with outside air.  It is assumed that the entire contents of the cylinder are released as vapor.  The distance to endpoint of 0.087 mg/l for the worst case scenario is 3.5 miles.  The area surrounding the facility is considered to be urban due to the thick trees and vegetation, as well as the hilly terrain.  This worst case scenario would impact approximately 19,000 persons.\n\nAn alternate release scenario was determine for the Sherwood Lane location.  The cylinders operate on a vacuum feed system, so the amount of chlorine released at the Sher"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5734,
      "SummaryText": "wood Lane location would be less (approximately 500 pounds).  This release of chlorine would result in a distance to endpoint of approximately 0.81 miles.  This relatively short distance would impact approximately 400 persons surrounding the location (all populations were based on Landview Software).\n\nThere have been no accidental releases of chlorine from this facility in the past five years.  The automatic vacuum system helps to reduce the amount of chlorine released that could escape during operational periods.  Operators of the chlorination system are requried to check instruments, cylinders, feed systems, etc., on a daily basis to aid in the prevention of accidental releases.  Even though this is a Level 2 Prevention Program, Conway Corporation has chosen to utilize a Level 3 Process Safety Management Prevention Program to furthur emphasize their efforts in preventing accidental releases.\n\nThis wastewater treatment facility complies with EPA's Accidental Release Prevention Rule, and with all applicable state/federal regulations."
    }
  ]
}