{
  "FacilityID": 5743,
  "FacilityName": "Hallsmith Sysco Food Services",
  "FacilityStr1": "380 South Worcester Street",
  "FacilityStr2": null,
  "FacilityCity": "Norton",
  "FacilityState": "MA",
  "FacilityZipCode": "02766",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25005",
  "LEPC": "Norton LEPC",
  "FacilityLatDecDegs": "41.9375",
  "FacilityLongDecDegs": "-71.183333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 51099661,
  "ParentCompanyName": "Sysco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hallsmith Sysco Food Services",
  "OperatorStr1": "380 South Worcester Street",
  "OperatorStr2": null,
  "OperatorCity": "Norton",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02766",
  "OperatorZipCodeExt": null,
  "FTE": 1258,
  "OtherEPAFacilityID": "MAD019587393",
  "EPAFacilityID": "100000076794",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1992-11-02 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Norton, MA",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-07-31 00:00:00",
  "DeRegistrationEffectiveDate": "2014-06-19 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.93804,
  "FRS_Long": -71.1801,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6867,
      "AltID": "Refrigeration System",
      "FacilityID": 5743,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7529,
          "ProcessID": 6867,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7023,
          "ProcessID": 6867,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 2876,
              "Process_NAICS_ID": 7023,
              "SafetyReviewDate": "1999-06-10 00:00:00",
              "PHA_Date": "1999-06-10 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-09-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-10 00:00:00",
              "TrainingReviewDate": "1999-06-10 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 0,
              "TR_OtherType": "State License",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": "State License",
              "MaintenanceReviewDate": "1999-06-10 00:00:00",
              "EquipmentInspectionDate": "1999-06-10 00:00:00",
              "EquipmentTested": "Compressors, Relief Valves",
              "ChangeMgmtDate": "1996-12-15 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-10 00:00:00",
              "PreStartupReviewDate": "1997-04-13 00:00:00",
              "ComplianceAuditDate": "1999-06-10 00:00:00",
              "AuditCompletionDate": "1999-09-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-10 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-10 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-10 00:00:00",
              "ContractorSafetyEvalDate": "1996-12-10 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia in Refrigeration System",
              "_chemicals": [
                {
                  "PrimaryKey": 3283,
                  "PreventionProgram3ID": 2876,
                  "ProcessChemicalID": 7529
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5743,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Norton Fire Department",
    "CoordinatingAgencyPhone": "5082850200",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5743,
      "SummaryText": "EXECUTIVE SUMMARY\n\nGENERAL\n\nSection 112(r) of the Clean Air Act establishes a Risk Management Program (RMP) to address the prevention of accidental chemical releases that can affect public health and the environment. The program covers industrial facilities having more than a threshold quantity of certain specified chemicals or flammable substances.\n\nThe program focuses on chemical release prevention, detection, and accident response, and requires each facility to develop and implement a site-specific risk management plan -- including a hazards assessment, an accident prevention program and an emergency response plan -- by June 21, 1999.\n\nThe Hallsmith Sysco , Inc. facility has a single process covered under this program. The facility is included in the 112(r) program due to on-site storage and use of anhydrous ammonia as the primary refrigerant for the storage of a wide range of food products in on-site warehouse coolers and freezers. \n\nCOMPANY SAFETY PHILOSOPHY\n\nHallsmith Sysco Food Services is a food service wholesale distribution and storage facility.  Hallsmith Sysco Food Services (Sysco) and its parent company, Sysco Corporation is engaged in the marketing and distribution of a wide range of food and related products to the foodservice or \"food-prepared-away-from-home\" industry. The foodservice industry consists of two major customer segments -- \"traditional\" and \"chain restaurant\". Traditional foodservice customers include restaurants, hospitals, schools, hotels and industrial caterers.  Sysco's chain restaurant customers include regional pizza and national hamburger, chicken and steak chain operations. Services to the Company's traditional foodservice and chain restaurant customers are supported by physical facilities, vehicles, materials handling equipment, and administrative and operating staff at its Norton, MA facility.\n\nProducts distributed by Sysco include a full line of frozen foods, such as meats, fully prepared entrees, fruits, vegetables and desser"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5743,
      "SummaryText": "ts, and a full line of canned and dry goods, fresh meats, imported specialties and fresh produce. Sysco also supplies a wide variety of nonfood items, including paper products such as disposable napkins, plates and cups; tableware such as china and silverware; restaurant and kitchen equipment and supplies; medical and surgical supplies; and cleaning supplies.\n\nHallsmith Sysco  is committed to minimizing the risk of adverse impacts from its operations, and our commitment to responsible operations is built directly into our business objectives. This commitment is further manifested in our use of sound operating and maintenance practices, use of safety-conscious designs, employee training, completion of routine safety audits and incident investigations in order to minimize risks to employees, the environment, and the community.\n\nHallsmith Sysco strives to continuously improve our practices in light of advances in technology and new understandings in safety, health and environmental science. We make consistent, measurable progress in implementing this commitment throughout our operations. \n\nFIVE YEAR ACCIDENTAL RELEASE HISTORY\n\nHallsmith Sysco  has worked hard to ensure that our products and warehousing operations meet or exceed industry standards of excellence for protecting both the community and the environment. As a socially responsible company, we have set goals to continue improving our EH&S performance into the next decade.  It is through these efforts that our initiatives have helped us protect and enhance health and safety -- for our employees, neighbors and the public. As a result, we are proud our record of accomplishment in not having had an accidental release of any of the 112(r) regulated substances within the last five years.\n\nREGULATED SUBSTANCES\n\nAs stated previously, the Hallsmith Sysco facility has one process covered under the 112(r) program. This process utilizes anhydrous ammonia as a refrigerant in maintaining food products in warehouse coolers an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5743,
      "SummaryText": "d freezers. \n\nAnhydrous ammonia is being used in the storage of perishable food products that require refrigeration. The anhydrous ammonia is stored under pressure in four pressure vessels, which are capable of holding 19,000 pounds of anhydrous ammonia. The anhydrous ammonia is connected directly from the pressure vessels to the refrigeration operations through closed loop piping manifolds located throughout the various cooler and freezer buildings. \n\nACCIDENT PREVENTION PROGRAM\n\nHallsmith Sysco has for some time now embraced the use of What If / Checklist analyses in support of our safety reviews of our refrigeration operations.  As part of our compliance effort with OSHA's Process Safety Management (29 CFR 1910.119) regulations, we have completed reviews of our critical refrigeration operations in order to assess their inherent safety readiness. Similar to 112(r), these programs are specifically aimed at eliminating and/or minimizing the consequences of catastrophic releases by stating our policies and procedures for the management of process hazards in design, construction, start-up, operation, inspection, maintenance, employee training, and emergency response.\n\nKey to the success of these programs is the active involvement and participation of our employees in the completion of the process hazard analyses.  Our commitment to the use of the What If / Checklist protocol, considered by the refrigeration industry to be their standard hazard analysis technique, ensures that each critical safety component of our refrigeration operations is reviewed in detail. \n\nEMERGENCY RESPONSE PROGRAM\n\nHallsmith Sysco is committed to conducting operations at the Hallsmith Sysco facility in a safe and environmentally responsible manner. This policy is implemented by active security and environmental, health and safety programs, well-designed and maintained facilities, trained employees and planning for emergency incidents.  Extensive precautionary measures have been taken to ensure"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5743,
      "SummaryText": " that no significant accidents or large-scale emergencies will occur at the facility.  If such an event occurs, these programs are designed to ensure that the incident will be contained on-site wherever possible and effectively dealt with by off-site support personnel from the Norton Fire Department with technical support provided by Hallsmith Sysco.\n\nThe Hallsmith Sysco ' emergency preparedness program consists of emergency response procedures have been developed to assist plant employees and managers in responding to an emergency to protect employees, the general public, and the environment.  These procedures ensure that notification off-site authorities is made in a timely manner when assistance is needed, or if there is a potential impact off-site, or if a regulatory notification is required.\n\nHallsmith Sysco  believes strongly that proper attention to these fundamental response concepts can mitigate any emergency that may develop at the facility.  In the unlikely event of an accidental release, Hallsmith Sysco  is well prepared to manage an incident and is confident that protecting employees, community residents, the environment, and plant facilities from personal injury or property damage will receive priority attention.  \n\nRELEASE SCENARIOS\n\nIn accordance with guidance provided by the USEPA for determining the worst case scenario for the one regulated substance, anhydrous ammonia, Hallsmith Sysco must assume that the entire contents of the largest storage vessel will be released. While this is considered as extremely unlikely, even by the USEPA, the rule does not allow facilities to take into account active mitigation systems and safe work practices that could prevent or limit the scope of a release. It is intended to ensure that no potential risks to public health are overlooked. \n\nAs a result, the mathematical models used to analyze the worst-case release scenario as defined in the rule will tend to overestimate the distance and area that would be impacted "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5743,
      "SummaryText": "by a release. It should be noted, however, that the distance to an endpoint estimated under worst-case conditions should not be considered a \"public danger zone.\" Hallsmith Sysco continues to utilize specific systems (e.g., monitoring, detection, control, pressure relief, alarms, and mitigation) in the design and operation of its processes that will likely limit a release or prevent the failure from occurring.\n\nHazard assessments and release scenarios for toxic materials, are described in USEPA guideline documents. Under the worst case release scenario that must be considered, the entire contents of the largest single vessel is released instantaneously. For toxic materials, such as anhydrous ammonia, this release will then result in evaporation of the material into a vapor that will then be dispersed. Toxic substances have endpoints established by USEPA. The distance to the endpoint must be calculated and compared to the plant layout to determine whether there are off-site impacts caused by the release. \n\nAnhydrous Ammonia\n\nFor toxic substances, such as anhydrous ammonia, the USEPA established endpoint for the consequence analysis is a concentration of 0.14 milligrams per liter. This endpoint is considered the threshold for potential serious injury to people as a result of a short-term exposure to the ammonia vapors. \n\nUsing the USEPA guidance, and including consideration of the use of passive mitigation measures (containment by enclosure within a building), the estimated distance to the toxic endpoint from a worst case release of anhydrous ammonia from a failure of one of the pressure vessels is .4 miles. \n\nRegarding review of potential alternative scenarios of anhydrous ammonia, a number of possible scenarios were reviewed and analyzed. The reported scenario is assumed to occur from the failure of a 1/4\" pressure gauge connection in a pressurized liquid ammonia line. The estimated endpoint distance from this more likely to occur scenario results in an impact area "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5743,
      "SummaryText": "of  176 yards. \n\nCONCLUSION\n\nHallsmith Sysco believes strongly that all safety and environmental incidents are preventable, and our goal for all of them is zero. We will continue to assess the environmental impact of our refrigeration operations and propose to design, build, operate and maintain all our operations so they remain safe and acceptable to local communities and protective of the environment. \n\nWe will be prepared for emergencies and will provide leadership to assist our local first responders to improve their emergency preparedness. We will promote open discussion with our neighbors about the products that we store, use and transport and the impacts of our activities on their safety, health and environments. \n\nWe will continue to adhere to the highest standards for the safe operation of our facility and the protection of our environment, our employees, our customers and our neighbors of Norton, Massachusetts."
    }
  ]
}