{
  "FacilityID": 5753,
  "FacilityName": "Waimea Water Treatment Plant",
  "FacilityStr1": "Spencer Road",
  "FacilityStr2": null,
  "FacilityCity": "Kamuela",
  "FacilityState": "HI",
  "FacilityZipCode": "96743",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "15001",
  "LEPC": "Hawaii LEPC",
  "FacilityLatDecDegs": "20.041667",
  "FacilityLongDecDegs": "155.666667",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Hawaii County Department of Water Supply",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Department of Water Supply",
  "OperatorStr1": "65-1306 Kawaihae Road",
  "OperatorStr2": null,
  "OperatorCity": "Kamuela",
  "OperatorStateFIPS": "HI",
  "OperatorZipCode": "96743",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000076302",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-09-24 00:00:00",
  "DeRegistrationEffectiveDate": "2004-09-28 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 19.9901,
  "FRS_Long": -155.734,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 6877,
      "AltID": "Water chlorination",
      "FacilityID": 5753,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 7539,
          "ProcessID": 6877,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7033,
          "ProcessID": 6877,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3606,
              "Process_NAICS_ID": 7033,
              "SafetyReviewDate": "1998-10-12 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "NEC, UBC, AISC, ASHRIE, UFC",
              "FR_Comments": null,
              "HazardReviewDate": "1998-10-12 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "scrubber",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-10-12 00:00:00",
              "TrainingReviewDate": "1998-10-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-10-12 00:00:00",
              "EquipmentInspectionDate": "1998-10-12 00:00:00",
              "EquipmentTested": "chlorinator",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The Department of Water Supply accidental chlorine release prevention policy invloves a unified approach that integrates technologies, procedures, and management practices, and is in compliance with all applicable EPA Prevention Program requirements.\n\nChemical-specific prtevention steps include availability of self-contained breathing apparatus (SCBA)  that is used by operators during connecting and disconnecting of the chlorine supply, awarenes of the hazardous properties of chlorine by all employees at the Waimea Water Treatment Plant, and the presence of chlorine detectors and an emergency chlorine scrubber system.",
              "_chemicals": [
                {
                  "PrimaryKey": 3711,
                  "PreventionProgram2ID": 3606,
                  "ProcessChemicalID": 7539
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5753,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-10-12 00:00:00",
    "ERTrainingDate": "1998-10-12 00:00:00",
    "CoordinatingAgencyName": "Hawaii County Fire Department",
    "CoordinatingAgencyPhone": "8089618675",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "Hawaii State EPCRA rules"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5753,
      "SummaryText": "The Hawaii County Department of Water Supply (DWS) accidental release prevention policy for the Waimea Water Treatment Plant integrates technologies, procedures, and management practices. This policy complies with all applicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention and Emergency Response Programs, the standards of the U.S. Occupational Safety and Health Administration (OSHA), and those of the Hawaii State Occuptaional Safety and Health Administration (HIOSH). The DWS emergency response poilicy includes preparation of a response plan tailored to the Waimea Water Treatment Plant and to the community's emergency response capabilities.\n\nThe Waimea Water Treatment Plant was installed to disinfect water flowing in the Ahualoa, Kalopa and Paauilo Mauka line, and in the Kawaihae line. This water serves the areas of Ahualoa, Kalopa, and Paauilo Mauka, and Kawaihae. The chlorination station is located on a private right-of-way off of Spenser Road in Kamuela. The station includes a chlorination room which contains two (2) one-ton containers of liquefied chlorine, a chlorinator, and various safety equipment (e.g., chlorine and ammonia detectors, chlorine and  ammonia alarms, scrubbers for each product, self-contained breathing apparatus (SCBA) for employee use, and eye wash station and shower, and fire extinguishers). The adjacent instrument room contains a flow recorder, various electrical panels, a fire extinguisher, an eye wash, and personal protective equipment. The facility is normally manned eight (8) hours per day during the work week, with 24-hour continuous monitoring by means of supervisory control and data acquisition (SCADA) system and computer alarm callout system routed through an answering service. The facility is visited by a standby operator on weekends and holidays. A standby operator also responds to all callouts generated from an activation of the SCADA alarm system when the facility is unmanned.\n\nThe offsite consequence an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5753,
      "SummaryText": "alysis includes consideration of two potential chlorine release scenarios, identified as a \"worst case release\" and an \"alternative release\". The \"worst case release\" is define dby the EPA as an uncontrolled release of the maximum quantity of chlorine in the largest vessel; i.e., 2000 lbs, within ten (10) minutes due to an unspeciified equipment failure. The \"alternative release scenario\" is a release of chlorine that is deemed more likely to occur than is the \"worst case release\".\n\nEPA Reference table 7 (RMP Offsite Consequence Analysis Guidance, May 24, 1996) was used to determine the distance traveled by the released chlorine before its concentration decreases to the \"toxic endpoint\" of three parts per million )3 ppm). This is the Emergency Response Planning Guideline Level 2 (ERPG-2) concentration for this product. This is established by the American Industrial Hygiene Association (AIHA) as \"the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one (1) hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action\". The residential population within a circle having a radius equal to the toxic endpoint distance is defined to estimate the population potentially affected.\n\nThe worst-case release scenario at the Waimea Water Treatment Plant would be a total failur eof a one-ton container of chlorine; i.e., a release of 2000 lbs of chlorine.The offsite consequence analysis for this scenario was performed for two sets of conditions. The first set followed conditions prescribed by EPA: release of the entire amount of chlorine as a gas within ten (10) minutes, us eof the one-hour average ERPG-2 as the toxic endpoint (0.0087 mg/L, or 3.0 ppm), and consideration of the population residing within a full circle with a radius equal to the toxic endpoint distance. A significant portion of this \"populated circle\" "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5753,
      "SummaryText": "(210 degrees of the circle) is actually unpopulated, however. Instead, teh affected populace is concentrated in an area equivalent to 150 degrees of the circle.\n\nEPA-mandated meteoroligical conditions, namely stability class F, wind speed of 1.5 meters/second (m/sec), highest daily maximum temperature (116 F), and average humidity (65 percent) were used. These parameters are not pertinent to the Waimea Water Treatment Plant, however.\n\nWhen atmospheric dispersion estimates were made for the worst-case scenario using the EPA assumptions, a distance to the toxic endpoint was determined to be 1.6 miles. The potentially affected population is 6,000 people, based upon 1990 census data.\n\nThe alternative release scenario involves the rupture of a flexible connection (\"pigtail\") connected to a one-ton container of chlorine, possibly due to an earthquake. The amount of chlorine released is 581 lbs, at an average rate over one hour (the duration of the release) of 9.7 lbs/min. Toxic endpoint disatnces to the ERPG-2 level were obtained. The typical meteorological conditions used were Stability E, wind speed 2.0 meters/second, average air temperature of 62 F, and 63 percent relative humidity. The estimated distances traveled to the topxic endpoint are 0.38 mile, or about 2000 feet.\n\nActuation of the chlorine detector is considered to be an active mitigation measure. An additional mitigation system installed is an emergency chlorine scrubber system\n\nThe general DWS accidental release prevention program is based on the following key elements:\n\n    High level of training of the operators.\n    Preventive maintenance program.\n    Use of state-of-the-art process and safety equipment.\n    Use of accurate and effective operating procvedures, written with the participation of the operators.\n    Performabce of a hazard review of equipment and procedures.\n    Implementation of an auditing and insepcting program.\n\nChemical-specific prevention steps include availability of self-contained bre"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5753,
      "SummaryText": "athing apparatus (SCBA), worn by the operators during connection/disconnectioin of chlorine supply and mitigation of incidental releases, awareness of hazardous and toxic properties of chlorine, and the presence of chlorine detectors.\n\nNo accidental releases of chlorine have occurred at this facility in the past five years.\n\nThe facility's emergency response program has been reviewed by CAPT Myron Yoshioka of the Hawaii County Fire Department hazardous materials response team. CAPY Yoshioka is also a vice chairperson of the Hawaii County Local Emergency Planning Committee (LEPC). The facility's emergency response program includes an emergency response decision tree and a notification plan. Emergency response drills and drill evaluations are conducted every six months. Emergency operation and response procedures are also reviewed at that time.\n\nNo changes to these plans and procedures have been recommended by any auditor or regulatory agency personnel."
    }
  ]
}