{
  "FacilityID": 5866,
  "FacilityName": "Chemtron Corporation",
  "FacilityStr1": "35850 Schneider Court",
  "FacilityStr2": null,
  "FacilityCity": "Avon",
  "FacilityState": "OH",
  "FacilityZipCode": "44011",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39093",
  "LEPC": "Lorain County LEPC",
  "FacilityLatDecDegs": "41.471194",
  "FacilityLongDecDegs": "-82.015917",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 66060609,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Chemtron Corporation",
  "OperatorStr1": "35850 Schneider Court",
  "OperatorStr2": null,
  "OperatorCity": "Avon",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44011",
  "OperatorZipCodeExt": null,
  "FTE": 70,
  "OtherEPAFacilityID": "OHD066060609",
  "EPAFacilityID": "100000075134",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-28 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-02-05 00:00:00",
  "DeRegistrationEffectiveDate": "2021-07-01 00:00:00",
  "AnniversaryDate": "2004-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 41.47154,
  "FRS_Long": -82.01677,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7027,
      "AltID": "Drum to Bulk Transfer",
      "FacilityID": 5866,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7698,
          "ProcessID": 7027,
          "ChemicalID": 53,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7187,
          "ProcessID": 7027,
          "NAICSCode": "56299",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 3664,
              "Process_NAICS_ID": 7187,
              "SafetyReviewDate": "1999-05-08 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Ohio Administrative Code",
              "FR_Comments": "Ohio EPA Part B Permit to operate a treatment and storage facility.",
              "HazardReviewDate": "1999-05-08 00:00:00",
              "ChangeCompletionDate": "1999-05-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "containment, complete emergency response equipment",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "absorbents, collection pumps, complete emergency response equipment",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-04-04 00:00:00",
              "TrainingReviewDate": "1999-04-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-08 00:00:00",
              "EquipmentInspectionDate": "1999-05-08 00:00:00",
              "EquipmentTested": "containment areas, storage tanks, process equipment, and containers, and complete emergency response equipment",
              "ComplianceAuditDate": "1999-05-08 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-05-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3771,
                  "PreventionProgram2ID": 3664,
                  "ProcessChemicalID": 7698
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "ProcessID": 7028,
      "AltID": "Drum to bulk Transfer",
      "FacilityID": 5866,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7699,
          "ProcessID": 7028,
          "ChemicalID": 92,
          "Quantity": 52000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7188,
          "ProcessID": 7028,
          "NAICSCode": "56299",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5866,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-04-01 00:00:00",
    "ERTrainingDate": "1999-04-01 00:00:00",
    "CoordinatingAgencyName": "LEPC-Lorain County",
    "CoordinatingAgencyPhone": "4403295117",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "Ohio EPA OAC Regulations; Part B Permit per Treatment, Storage , and Disposal facity Requirements",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 5866,
      "SummaryText": "Chemtron Corp. Executive Summary\n\nThe following is a brief description of Chemtron Corp.'s facility risk management program.  The description identifies applicable risks and the efforts which Chemtron Corp. has made to minimize the risks.  The Risk Management Plan requires the following elements;\n1. The accidental release prevention and emergency response policies at Chemtron.\n2. Description of Chemtron Corp. and the regulated substances handled.\n3. A description of the worst case scenario(s) and the alternate release scenario(s) of regulated substances at Chemtron Corp.\n4. The general accidental release prevention program and chemical-specific prevention steps at Chemtron Corp..\n5. The five year accident history relative to the listed substances at Chemtron Corp.\n6. The emergency response program utilized at Chemtron Corp.\n7. Planned changes to improve safety at Chemtron Corp.\n\nThe following is the description of each element.\n\n1.  The accidental release prevention and emergency response policies at Chemtron Corp.\n\nA commitment by the senior management has been made to chemical safety and has been proven over nearly 20 years of safe operation and implementation of safe procedures.  Their is no higher priority than the protection of human health and safety and the environment.  Chemtron Corp. has designed this facility to be the safest operation and prevent the accidental release of any substance.\n\nChemtron Corp. has an extensive chemical accidental release and prevention program along with an exceptional emergency response system.  These programs have been developed and implemented over the past nearly 20 years of operation.  Chemtron Corp.'s operations are also regulated under 40 CFR regulations as a Part B Permitted Treatment, Storage, and Disposal Facility.  Written emergency response plans have been in place for all substances received and processed on site which have been reviewed and approved by various governing agencies on an on-going basis. The 40 CFR regu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5866,
      "SummaryText": "lations which govern the operations at Chemtron Corp. far exceed the criteria of the Risk Management Program and are routinely inspected by various agency representatives to assure compliance.  Chemtron Corp. makes every effort to prevent the release of any substance to the environment and to protect the health and safety of everyone.  \n\nChemtron Corp. is required as part of the Part B operating permit to have an extensive emergency response plan which includes prevention and response.  All aspects of the operations at Chemtron Corp. have been previously reviewed and approved by government agencies with ongoing inspections.  Chemtron Corp. is capable of responding to its own releases and also offers this service to other businesses.  Chemtron Corp. has been and is an emergency responder to the Ohio Environmental Protection Agency (OEPA), the United States Coast Guard (USCG), and many private industrial businesses.\n\nThis document will only refer to those chemicals regulated by Section 112 (r) of the Clean Air Act.\n______________________________________________________________________________________\n2.  Description of Chemtron Corp. and the regulated substances handled.\n\nChemtron Corp. employees approximately 70 persons and has several facets of operation.  The services of Chemtron Corp. include:  laboratory, transportation, emergency response, off site remediation, environmental training, and consultation.  Chemtron Corp. has been in business under current management for nearly 20 years.\n\nChemtron Corp. is a Treatment, Storage, or Disposal (TSD) Facility which is fully permitted by the State of Ohio and the United States Government.  A Part B Permit has been issued to Chemtron Corp. by the State of Ohio to operate this facility as a storage and treatment site for RCRA Hazardous Wastes.  Chemtron Corp. also accepts and manages non-RCRA waste.  Chemtron Corp.\u0012s business is a service which receives specified wastes from off site generators.  Once the waste is on site,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 5866,
      "SummaryText": "designated processes are performed to the waste to ensure the waste is in the proper form for final off site disposal on a case by case basis.  Upon completion of the processing, the waste is transported off site to the disposal facility.  Chemtron Corp. selects the best disposal for each waste stream.  Reclamation of wastes are utilized whenever possible to return chemicals to stock as usable product.  A highly sophisticated computer system monitors the tracking of all wastes on site at all times.  A fully staffed laboratory with modern analytical instrumentation analyze the wastes to assure the waste and processing  is correct. Chemtron Corp. complies with all applicable governing regulations and takes a pro-active approach in achieving this goal.\n\nChemtron Corp. relies on the businesses to generate wastes for work and based upon the type and amount of wastes the businesses generate will control what chemicals and the amount of  chemicals Chemtron Corp. may receive.  Thus the specific chemicals and amounts submitted to Chemtron Corp. at any time is unpredictable and can not be controlled nor accurately identified including each chemical identified in the CAA 112 (r) List of Regulated Substances.  The OEPA Part B operating permit regulates the type of wastes/chemicals accepted, the amounts allowed on site, and the processes/treatments permitted to be performed on the wastes/chemicals.  All wastes are thoroughly reviewed prior to being received reviewed, approved, and scheduled in a orderly manor to assure proper management.  Chemtron Corp. is submitting this Plan in a good faith effort that several chemicals may be received and the RMP be required.  In the event that other chemicals listed are received a revised plan will be submitted.\n\n______________________________________________________________________________________\n3. A description of the worst case scenario(s) and the alternate release scenario(s) of regulated substances at Chemtron Corp.\n\nThis information"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5866,
      "SummaryText": "will only refer to those chemicals regulated by Section 112 (r) of the Clean Air Act.  The only chemical in the List of Regulated Substances which is potentially a waste which may be received at Chemtron Corp. that may exceed the threshold quantity is hydrochloric acid  (37% or greater).  In compliance with other regulatory requirements Chemtron Corp. has performed other scenario modeling of releases and fires but did not use this chemical.  Chemtron will use the OCA Guidance for this worst case release scenario(s) and the alternative release scenario(s).\n\nToxic Scenario\nThe worst case scenario is that containerized toxic chemical waste containing hydrochloric acid of more than 37% was received.  The containers would be in 55 gallon drums.  After performing in house analysis and processing assessments,  the chemical waste would be transferred onto an approved Department of Transportation (DOT) bulk tank truck holding up to 5,000 gallons or 40,000 pounds (estimate only due to matrix of waste).  The work is all performed in engineered designed areas for containment using Ohio EPA approved equipment.  The scenario release would occur when the chemical would be released from the tanker.  This chemical is not flammable but is highly corrosive.  The possibility of this scenario occurring is very low.  The alternative release scenario is one container holding 55 gallons releasing into the containment.  Each scenario is documented in the RMP release calculations.\n\nFlammable Scenario\nThe worst case scenario is that containerized flammable chemical waste containing ethyl ether was received.  The containers would be in 55 gallon drums.  After performing in house analysis and processing assessments, the chemical waste would be transferred onto an OEPA approved bulk storage tank holding up to 6500 gallons or 52,000 pounds (estimate only due to matrix of waste).  The work is all performed in engineered designed areas for containment using Ohio EPA approved equipment.  The scenari"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 5866,
      "SummaryText": "o release would occur when the chemical would be released from the storage tank. The possibility of this scenario occurring is very low.  The alternative release scenario is one container holding 55 gallons releasing into the containment.  Each scenario is documented in the RMP release calculations.\n\n\n______________________________________________________________________________________\n4.  The general accidental release prevention program and chemical-specific prevention steps at Chemtron Corp.\n\nChemtron Corp. has a Part B operating permit issued by the State of Ohio as originally issued by the USEPA for storing and treating RCRA hazardous waste.  Chemtron Corp. will also accept non-RCRA waste for processing.   Various regulatory agencies oversee our operation including the Ohio EPA, US EPA,  Department of Transportation (DOT), and OSHA due to Chemtron's work with chemicals, wastes, transportation, and overall safety .  Representatives from many agencies audit our operations and assure pro-active preventive release programs are in place complying with applicable standards.\n\nThe OEPA has strict requirements for operation and requires proof of functionality through a formal approval process.  OEPA requires submittal of pre-planned certified engineered designed drawings and procedures in order to evaluate operational and process design.  All equipment and assurances with backups are required to prevent any release to the environment or where it would effect human health.  Chemtron is required to perform daily inspections of the site and all processes, wastes/chemicals in storage, and readiness of emergency response equipment. By having plans made by professional certified engineers,  preliminary reviews prior to construction by regulatory agency personnel, and daily inspections of all the operations, a sound release prevention program is established.  A vigorous maintenance schedule is used to maintain the equipment and prevent loss of equipment or chemicals.  Chemtro"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 5866,
      "SummaryText": "n Corp. has a quality assurance program in place which adds a check to the system and assures safety to the best of our ability.\n\nOther preventive release measures are also in place.  Chemtron performs a  technical reviewof each clients (generators) waste prior to receiving them at the site.  Upon receipt of the waste, Chemtron's laboratory will perform analysis  to confirm the waste matches the written description that was approved to be sent to the site.  Any discrepancies will be resolved prior to processing or the waste will be returned to the client.  The chemical wastes are processed in the pre-approved processing equipment in compliance with local codes and OSHA standards.  A computer system tracks the chemicals from approval  to receipt, through processing , and out the door to the final disposal site.  A hard copy document is also maintained for records.  The staff of Chemtron chemists, and other experts (technical or other) with multitudes of  references and resources onsite combined with peer networking and their resources ensure a pro-active preventive approach to resolving any emergency response situation.  A team approach by all employees and assisted by peer networking with others brings the entire program together.\n\n______________________________________________________________________________________\n5.  The five year accident history relative to the listed substances at Chemtron Corp.\n\nChemtron Corp., in it's 20 year history  has not had an accidental release of any chemical on the RMP Chemical list or what is otherwise regulated by other governing agencies.\n\n______________________________________________________________________________________\n6.  The emergency response program utilized at Chemtron Corp.\n\nChemtron Corp. has a written emergency response program (ERP) in place and operational.  This program called a Contingency Plan is required by other regulations and is reviewed and exercised routinely to assure it will operate correctly.  This ER"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 5866,
      "SummaryText": "P involves communications with the local fire department, police department, hospital, Lorain County Emergency Response Commission, and applicable regulatory agencies.   Each of the agencies has a copy of this ERP.   The ERP involves direct contact from a  24 hour a day monitoring system to these emergency services as well as also having a trained staff for additional notification.  Chemtron Corp. is in contact with each of the parties involved in ERP in a continuous working and evolving relationship.  A representative of Chemtron is on the LEPC executive board.  \n\nChemtron Corp. is viewed as an expert in the field of emergency response.  Chemtron Corp. offers  off site emergency response to  hazardous material spills/releases.  Chemtron\u0012s clients include the OEPA, US EPA, US Coast Guard, local towns and counties, fire departments, and many industrial businesses.  Chemtron Corp. is fully equipped and has trained staff to respond to any spill or release at Chemtron Corp.  All employees of Chemtron Corp. are trained annually and continuously updated for changes in the ERP.  All emergency responders meet emergency response guidelines established by OSHA for training.  This emergency training is also offered to off site clients including fire departments, businesses, and government agencies.  Periodically emergency response drills are conducted to assure all parts of the ERP operate correctly.  Chemtron Corp. has never had to implement the ERP/Contingency Plan.\n\n______________________________________________________________________________________\n7.  Planned changes to improve safety at Chemtron Corp.\n\nChemtron Corp.'s  philosophy is that safety is a continuous effort made by every employee.  Chemtron Corp. will continue to improve safety on an ongoing basis.  The training and high quality of workmanship required  propagate this safe working ethic.  Chemtron Corp. has no planned changes to improve safety."
    }
  ]
}