{
  "FacilityID": 5949,
  "FacilityName": "American Crystal Sugar Company",
  "FacilityStr1": "Highway 75 South",
  "FacilityStr2": null,
  "FacilityCity": "Crookston",
  "FacilityState": "MN",
  "FacilityZipCode": "56716",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27119",
  "LEPC": null,
  "FacilityLatDecDegs": "47.764556",
  "FacilityLongDecDegs": "-96.63275",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G6",
  "LatLongDescription": "ST",
  "FacilityURL": "http://www.crystalsugar.com/",
  "FacilityEmailAddress": "baune@crystalsugar.com",
  "FacilityDUNS": 6174742,
  "ParentCompanyName": "American Crystal Sugar Company",
  "Company2Name": null,
  "CompanyDUNS": 64792773,
  "Company2DUNS": null,
  "OperatorName": "Bob Aune",
  "OperatorStr1": "Highway 75 South",
  "OperatorStr2": null,
  "OperatorCity": "Crookston",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56716",
  "OperatorZipCodeExt": null,
  "FTE": 267,
  "OtherEPAFacilityID": "56716MRCNCHIG",
  "EPAFacilityID": "100000076525",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "11900001-021",
  "SafetyInspectionDate": "1993-12-27 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "American Crystal Sugar Company-Crookston",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 47.764444,
  "FRS_Long": -96.6325,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7130,
      "AltID": "Program Level",
      "FacilityID": 5949,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 7809,
          "ProcessID": 7130,
          "ChemicalID": 49,
          "Quantity": 162720.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7293,
          "ProcessID": 7130,
          "NAICSCode": "311313",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3022,
              "Process_NAICS_ID": 7293,
              "SafetyReviewDate": "1999-04-14 00:00:00",
              "PHA_Date": "1999-03-15 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-03-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Process Instrumentation/hand-held monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-03-15 00:00:00",
              "TrainingReviewDate": "1999-03-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-15 00:00:00",
              "EquipmentInspectionDate": "1998-09-01 00:00:00",
              "EquipmentTested": "Sulfur Dioxide pipies and connections",
              "ChangeMgmtDate": "1999-03-15 00:00:00",
              "ChangeMgmtReviewDate": "1999-03-15 00:00:00",
              "PreStartupReviewDate": "1998-09-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-03-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-03-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-03-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3444,
                  "PreventionProgram3ID": 3022,
                  "ProcessChemicalID": 7809
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 5949,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-15 00:00:00",
    "ERTrainingDate": "1999-03-15 00:00:00",
    "CoordinatingAgencyName": "Crookston Fire Department",
    "CoordinatingAgencyPhone": "2182814584",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 5949,
      "SummaryText": "eparedness plans, training, process changes, and other elements that affect the covered processes are all considered.  By conducting thorough evaluations, accidental releases are prevented and the consequences of releases are minimized.\n\nBy fulfilling the required elements of the RMP standards, ACSC intends to prevent releases of hazardous substances and minimize the impacts of accidental releases, especially into locations that could expose employees, the community or the environment to serious hazards.  Our management systems address each of the key features of a successful release prevention program including:\n\n-Maintaining Process Safety Information (PSI):  ACSC maintains up-to-date technical information about safe operating limits of the processes and the associated hazards of the chemicals involved.\n-Conducting Process Hazard Analayses (PHA): ACSC performs technical analysis of the plant's processes in order to anticipate what might go wrong and recommend approaches to minimize the possibilities and affects of such occurrences.\n-Standard Operating Procedures (SOP): We have written technical and administrative procedures used to operate the plant safely.\n-Training: ACSC provides employees with information necessary to ensure safe operation.\n-Mechanical Integrity: We ensure proper maintenance of the process equipment on an ongoing basis.\n-Management of Change (MOC): ACSC analyzes changes in process equipment, procedures and personnel to understand the impact of those changes in the safe operation of our plant.\n-Pre-Startup Safety Review: We ensure all necessary elements for operating a safe process are in place prior to introducing the hazardous chemical into a new or modified system.\n-Compliance Audits: We conduct periodic evaluation and updating of the process operation to ensure all RMP elements are being applied properly.\n-Indicent Investigation: ACSC has procedures for investigating the cuases of near-miss or accidental releases and developing measures to"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 5949,
      "SummaryText": "prevent future similar occurrences.\n-Employee Participation: We maintain a philosophy and approach to incorporating the knowledge and experience of our employees from all facets of operation regarding the covered processes.\n-Hot Work Permit: We have a documented program for controlling the hazards associated with ignition source activities, thereby minimizing potential catastrophic release.\n-Contractors: ACSC upholds policies and procedures for ensuring safe work practices of contractors on the facility and a systematic approach of communicating hazards inherent to the processes which the contractor may be working on or near.\n\nOur Company and our comployees are committed to the standards that the RMP regulation sets.  We do business, and have specific accountabilities and controls to ensure that we are meeting high standards for accident prevention.  ACSC has also developed a rish management system which identifies specific job positions and responsibilities to ensure proper management and implementation of this RMP.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases of SO2 or other toxic/extremely hazardous chemicals in the past 5 years, which have resulted in off-site consequences such as personal injury, death or response/restoration activities.\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nWe have discussed the content and intent of the program with the Crookston Fire Department.  We rely on our trained, in-house staff and on-site equipment for initial response (if safe to do so) and acquire backup support from the local fire department as needed.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nACSC plans to install additional sensors, alarms and monitoring devices to our processes to improve our ability to detect and respond to accident releases from process equipment."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 5949,
      "SummaryText": "This document was developed for American Crystal Sugar Co. - Crookston Facility (ACSC) in an effort to\nfulfill criteria of the Risk Management Program (RMP), as required by Section 112(r) of the Clean Air Act (CAA), and regulated by 40 CFR, Part 68.  ACSC is a beet sugar manufacturing plant.  The quantity of Sulfur Dioxide (SO2) at the facility is greater than the Threshold Quantities (TQ) of 5,000 pounds.  This is EPA's criteria for requiring the development and submittal of the information found in this RMP.  A hzard assessment was conducted for the manufacturing process and consideration was also given to the other hazardous chemicals at the plant as well.\n\nSO2 is considered toxic by EPA standards.  The same properties that made SO2 valuable for beet sugar processing, also make it necessary to observe certain safety precautions in handling this chemical to prevent unnecessary human exposure and to reduce the potential impact or threat to nearby members of the community and/or environmenta.  Safety depends upon the manner which we handle chemicals; combined with safety devices inherent in the design of this facility; and the training of our personnel.\n\nTHE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is this facility's intent to uphold industry standards int he design, construction and operation of the facility.  It is our policy to adhere to all applicable federal, state, and local laws.  If an emergency was to occur, we have trained personnel and equipment ready for response in the event of a spill of hazardous materials.  It is also our policy to notify the Crookston Fire Department (via the 911 system), and request that they respond to the emergency if the emergency is behond our capabilities.\n\nTHE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLES\n\nSO2 is used at the plant for processing the sugar beets into some of the various products.  SO2 is received and stored in a 18,000 gallon pressurized tank.  Inventory of SO2 held at the faciity"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 5949,
      "SummaryText": "is a maximum of 162,720 pounds held in the tank along with residual in process piping.  Liquid SO2 passes out of the tank, through process piping, then branches into one of two process endpoints.  Prior to each end use, the SO2 passes througha vaporizer, which transitions it to a gaseous state.  It then flows into the process endpoint.  Approximately 75% of the SO2 is used in the diffuser water supply and other 25% is used in the sulfitation of thin juice.\n\nPhysical access to the plant is restricted by chain link fencing and manned security at all entry points.\n\nWORST-CASE RELEASE SCENARIO AND THE ALTERNATIVE RELEASE SCENARIOS\n\nRMP standards require that a Worst Case Scenario (WCS) representing all toxics be developed for covered processes.  Following, is the WCS for SO2, representative of its respective hazards.  Similarly, RMP rules require an Alternative Release Scenario (ARS) for these same chemicals.\n\nWCS for SO2 -- 162720 lb. is the maximum quantity of SO2 in a single storage vessel that can be released in a WCS.  For WCS, according to RMP*Comp Version 1.06, the distance to toxic endpoint for the WCS is 13 miles.  The facility is located in an urban area with an estimated population of 11,000 persons living within the 13 mile radius.  There is no environmental receptors within distance to endpont.\n\nARS for SO2 - the release chosen is a 1/4 diameter hole releases SO2 for 5 minutes from the process line at the SO2 storage tank.  For ARS, according to RMP*Comp Version 1.06, the distance to toxic endpoint for this ARS is 0.1 miles, which reaches public receptors within this distance.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS\n\nThis facility complies with EPA's Accidental Release Prevention Rule and will all applicable state codes and regulations,  ACSC takes a systematic, proactive approach to evaluating chemical processes.  Using this approach, the design, technology, operation and maintenance activities, emergency pr"
    }
  ]
}