{
  "FacilityID": 6000,
  "FacilityName": "J. D. Mackintosh, Jr. Water Treatment Plant",
  "FacilityStr1": "3400 Harris Road",
  "FacilityStr2": null,
  "FacilityCity": "Burlington",
  "FacilityState": "NC",
  "FacilityZipCode": "27215",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37001",
  "LEPC": "Alamance County LEPC",
  "FacilityLatDecDegs": "36.037",
  "FacilityLongDecDegs": "-79.5025",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.ci.burlington.nc.us",
  "FacilityEmailAddress": "tmurr@ci.burlington.nc.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Burlington",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Burlington, North Carolina",
  "OperatorStr1": "P.O. Box 1358",
  "OperatorStr2": null,
  "OperatorCity": "Burlington",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27216",
  "OperatorZipCodeExt": "1358",
  "RMPContact": "Stephen R. Shoaf",
  "RMPTitle": "Director of Utilities",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000074867",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-06-18 00:00:00",
  "DeRegistrationEffectiveDate": "2021-06-07 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.04503,
  "FRS_Long": -79.51783,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7194,
      "AltID": "Water Treatment",
      "FacilityID": 6000,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7359,
          "ProcessID": 7194,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7906,
          "ProcessID": 7194,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507906,
          "ProcessID": 7194,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6000,
      "SummaryText": "The City of Burlington has implemented a comprehensive program to safely manage chlorine and other chemicals at the J. D. Mackintosh, Jr. Water Treatment Plant.  There have been no chlorine related incidents at the plant in the last 5 years.  At this site chlorine is used for the disinfection of municipal drinking water.\n\nIn 1995 a Process Safety Management (PSM) program was initiated with the assistance of Operations Excellence Consulting, Inc.  A PSM implementation manual was developed for the J. D. Mackintosh, Jr. Water Treatment Plant.  Key items in this manual were:  (1) Written procedures for employee involvement, management of change, incident investigation, pre-startup reviews, and self audits; (2) Specific chlorine safety information as required by the regulations.\n\nThese additional steps were implemented to complete the PSM program:  (1) Training on PSM and its key components including management of change, mechanical integrity, and incident investigation; (2) Conducting Process Hazard Analyses for the chlorine handling process; (3) Developing standard operating procedures for handling chlorine; (4) Developing an initial Emergency Response Plan; and (5) Training in support of the certification of operators.\n\nThe Utilities Director, Chief Operator, and several plant operators will meet once per year to review and update procedures and to maintain compliance with all aspects of the PSM regulation.  In addition to PSM compliance, the J. D. Mackintosh, Jr. Water Treatment Plant has implemented a number of programs to improve the safe handling of chlorine: (1) The chlorine delivery system has been upgraded to a vacuum process.  This process has proven to greatly reduce the potential for leaks by reducing the amount of equipment that is exposed to pressurized chlorine. (2) Funds have been budgeted to either: (A) Purchase automatic valve actuators that would automatically close chlorine cylinder valves when a leak is detected; or (B) Move the vacuum regulators so"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6000,
      "SummaryText": " that they would be mounted directly to the chlorine cylinder valves.  This would eliminate all process piping that would be exposed to pressurized chlorine gas.\n\nThe J. D. Mackintosh, Jr. Water Treatment Plant Emergency Response Plan (ERP) has been significantly upgraded.  In 1998, the ERP was revised to include off-site response and communication.  Chlorine response drills have been routinely conducted with both small scale (in plant) excercises and large scale (fire department and HAZMAT team) participation.  The last drill was conducted on October 16, 1998.\n\nTo further understand the chlorine risks, Operation Excellence Consulting, Inc. was contracted to conduct \"Offsite Concequences\" modeling analysis, as required by EPA's Risk Management Program.  Both a \"worst case\" and an \"alternate case\" chlorine release scenario were studied.  The \"worst case\" scenario involving a rapid release of 2000 lbs. of chlorine would have an end point distance of 1.3 miles and potentially affect 996 residents.  The study results show that the most likely type of leak (alternate case) that could occur (although the possibility is extremely remote) would be a 3 pound per minute leak, and it would have an end point distance of 0.1 miles, possibly affecting 1 resident in  the surrounding community.\n\nIn addition to Process Safety Management, the J. D. Mackintosh, Jr. Water Treatment Plant participates in an active safety program.  The City of Burlington Utilities Department has had an active Safety Committee for six years.  The committee meets monthly with representatives from each of the 7 divisions.  The committee's duties include reviewing the new safety procedures, accident investigations, safety surveys and planning the safety training calendar.  Routine training is conducted on topics such as hazard communication, personal protective equipment, lockout/tagout, confined spaces, and fall protection.\n\nIn the 4th quarter of 1997, Operations Excellence Consulting, Inc. was contracted t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6000,
      "SummaryText": "o review the entire Utilities Department safety program.  The results showed that the organization has many strengths such as training and written procedures.  A number of recommendations were made to further improve compliance and performance.  Most of these recommendations have been addressed.\n\nAs a result of our programs, the J. D. Mackintosh, Jr. Water Treatment Plant has had a strong safety record with no lost time accident in the last 3 years.  We plan to continue our emphasis on safety and to maintain or improve our safety performance."
    }
  ]
}