{
  "FacilityID": 6001,
  "FacilityName": "Rich Products Corporation, Appleton Division",
  "FacilityStr1": "3300 West College Avenue",
  "FacilityStr2": "N/A",
  "FacilityCity": "Appleton",
  "FacilityState": "WI",
  "FacilityZipCode": "54913",
  "Facility4DigitZipExt": "2217",
  "FacilityCountyFIPS": "55087",
  "LEPC": "Outagamie County LEPC",
  "FacilityLatDecDegs": "44.266639",
  "FacilityLongDecDegs": "-88.460167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.richs.com",
  "FacilityEmailAddress": "rcyra@rich.com",
  "FacilityDUNS": 2108371,
  "ParentCompanyName": "Rich Products Corporation",
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Rich Products Corporation",
  "OperatorStr1": "1150 Niagra Street",
  "OperatorStr2": null,
  "OperatorCity": "Buffalo",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14240",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert F. Cyra",
  "RMPTitle": "Environmental and Safety Manager",
  "FTE": 395,
  "OtherEPAFacilityID": "54914RCHPR3300W",
  "EPAFacilityID": "100000074938",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-08-07 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-06-01 00:00:00",
  "DeRegistrationEffectiveDate": "2002-04-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.5",
  "FRS_Lat": 44.26664,
  "FRS_Long": -88.46017,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7195,
      "AltID": "NH3 Refrigeration System",
      "FacilityID": 6001,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7360,
          "ProcessID": 7195,
          "NAICSCode": "311412",
          "_desc": {
            "NAICS_CODE": "311412",
            "NAICS_DESCRIPTION": "Frozen Specialty Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 7907,
          "ProcessID": 7195,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 507907,
          "ProcessID": 7195,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6001,
      "SummaryText": "A.  Describe the Accidental Release Prevention and Emergency Policies\n\nIt is the policy of Rich Products to provide working conditions that do not endanger the safety and health of its associates or the environment.  All members of management are expected to actively participate in the safety program.  Our safety program is designed to establish and maintain safe and healthful working conditions.\n\nAmmonia safety is a key item in the plant's safety plan.  Rich Products takes many precautions to prevent or minimize accidental releases of ammonia.  These precautions include safety controls (alarms, automatic shutdown devices, etc.) which are designed to identify and prevent potentially unsafe conditions like pressure increases that could cause a system failure.  They also include a preventative maintenance program designed to maintain the ongoing integrity of the system, a training program designed to ensure that the system is operated by qualified personnel as well as emergency response procedures which enable trained personnel to respond quickly to system upsets. \n\nThe Environmental and Safety Manager is responsible for the management of the ammonia safety program.\n\n\nB.  Stationary Source and Regulated Substances Handled\n\nRich Products produces frozen food/bakery products for sale to the public.  The facility operates an ammonia refrigeration system to provide freezing and cooling of the products produced.  The maximum ammonia inventory at the facility is approximately 16,000 pounds.  Ammonia is the only regulated substance handled at the plant.\n\n\nC.  Summary of Worst-Case and Alternative Release Scenarios:\n\nThe worst-case scenario for toxic materials at the plant involves the release of 7200 pounds of anhydrous ammonia over a 10-minute period due to a failure of a pressure safety valve on our ammonia receiver located on the roof.  The maximum inventory reflects the vessels rated capacity.  Under worst-case conditions, the resulting ammonia cloud could have off-site "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6001,
      "SummaryText": "impacts.\n\nThe alternative release scenario for toxic materials at the plant involves the release of 1980 pounds of ammonia over a 60-minute period due to the failure of a pressure safety valve on a high-stage compressor.  Under alternative release conditions, the resulting ammonia cloud could have off-site impacts.\n\nThe worst-case and alternative release scenarios for toxic materials are unlikely for the following reasons:\n7 The weather conditions that were used for the worst-case release scenario do not occur, while those      used for the alternative case are uncommon;\n7 Industry standards are followed for the design and manufacture of the equipment in the ammonia refrigeration system;\n7 The engine room contains ammonia detectors and ventilation fans that should detect and mitigate the effects of ammonia releases;\n7 Ammonia is not corrosive in this service; \n7 The facility has a preventative maintenance program in place to maintain the ongoing integrity of the ammonia refrigeration equipment;\n7 The facility has a training program designed to ensure that the system is operated by qualified personnel; and,\n7 The facility has emergency response procedures that enable trained personnel to respond quickly to isolate any potential releases.\n                                                                                                                                                                              \nD.  Description of the Accidental Release Prevention Program\n\nThe facility has a program level 3 accident release prevention program for the ammonia system that complies with OSHA's Process Safety Management Standard and EPA's Risk Management Program Regulation.                                                                                                                                                                                                                                                                                                                  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6001,
      "SummaryText": "                       The ammonia prevention program consists of the following elements:                                                       \n                                                                                                                                                                            7 Associate Participation Plan\n7 Process Safety Information\n7 Process Hazard Analysis\n7 Operating Procedures\n7 Training Program\n7 Contractor Safety Program\n7 Pre-Startup Safety Review Procedures\n7 Mechanical Integrity Program\n7 Hot Work Permit Procedures\n7 Management of Change Procedures\n7 Incident Investigation Procedures\n7 Compliance Audit Procedures\n\n\nE.  Five-Year Accident History\n\nThere have not been any ammonia-related incidents at the plant during the previous five years that resulted in significant on-site or off-site consequences.\n\n\nF.  Description of the Emergency Response Program\n\nAn emergency response program has been implemented at the plant.  This program contains procedures describing how the facility will respond to fires and other emergencies, including evacuation procedures.\n\nThe emergency response plan includes the following elements:\n\n7 Designation of an Emergency Crisis Management System\n7 Evacuation Procedures\n7 Response Activities\n\nThe program has been coordinated with the LEPC and the fire department.\n\n\nG.  Planned Changes to Improve Safety\n\nWe are currently in the process of developing more user friendly Standard Operating Procedures with the help of our refrigeration contractor who has been hired to develop the procedures with us.  We also plan to continue the education of our Refrigeration Technicians through formal technical school training as well as on-the-job training programs to increase their level of knowledge and expertise."
    }
  ]
}