{
  "FacilityID": 6116,
  "FacilityName": "Hanford Site - 283W  Water Treatment Facility",
  "FacilityStr1": "200 West Area",
  "FacilityStr2": "USDOE Hanford Nuclear Reservation",
  "FacilityCity": "Richland",
  "FacilityState": "WA",
  "FacilityZipCode": "99352",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County LEPC",
  "FacilityLatDecDegs": "46.554278",
  "FacilityLongDecDegs": "-119.617611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.hanford.gov",
  "FacilityEmailAddress": "none",
  "FacilityDUNS": null,
  "ParentCompanyName": "U.S. Dept. of Energy, Richland Operations Office",
  "Company2Name": null,
  "CompanyDUNS": 34456186,
  "Company2DUNS": null,
  "OperatorName": "U.S. Department of Energy",
  "OperatorStr1": "825 Jadwin Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Richland",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99352",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": "99352SDPRTPOBOX",
  "EPAFacilityID": "100000077276",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "No record of safety inspection.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-06-22 00:00:00",
  "DeRegistrationEffectiveDate": "2009-04-23 00:00:00",
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 46.3703,
  "FRS_Long": -119.2752,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7338,
      "AltID": "283W Chlorination Process",
      "FacilityID": 6116,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8078,
          "ProcessID": 7338,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7504,
          "ProcessID": 7338,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6116,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-05-01 00:00:00",
    "ERTrainingDate": "1999-03-25 00:00:00",
    "CoordinatingAgencyName": "Benton County Emergency Management",
    "CoordinatingAgencyPhone": "5096282600",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6116,
      "SummaryText": "The 283W Facility receives raw water from the Columbia River, treats (filters and disinfects) the raw water, and exports the treated water for process, fire protection, potable and irrigation purposes in accordance with Washington State Administrative Code, Chapter 246-290, State of Washington Drinking Water Regulations.  One step of the treatment process is chlorination.  In the chlorination system, the 283W Facility uses gaseous chlorine, stored at the facility in one-ton chlorine containers, for injection into the raw, untreated facility influent and for disinfection of post filtration effluent.  Chlorine is used as an algaecide and disinfectant.  Evaluation of the 283W Facility and chlorine storage capacity indicated that the 283W Facility stores or has the potential to store a chlorine inventory in excess of the threshold quantity (2,500 pounds); therefore, it is subject to the RM Program regulations.\n\nThe 283W Facility is subject to additional regulations related to the management of chemicals.  It is subject to the reporting requirements under the Emergency Planning and Community Right to Know Act and the Occupational Safety and Health Administration's Process Safety Management Rule, which also contains provisions for the safe management of chemicals. Since the chlorine containers are periodically transported to the facility, the chlorine is stored in containers that are compliant with the Department of Transportation regulations.  These regulations require periodic retesting of the containers to ensure container integrity.\n\nThe 283W Facility is located on the U.S. Department of Energy's Hanford Site.  Each of the U.S. Department of Energy, Richland Operations Office's prime contractors have developed a common approach to the management of chemicals which is consistent with the principles of integrated safety management.  The Chemical Management System Requirements are used to evaluate the adequacy of chemical management programs, identify opportunities for i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6116,
      "SummaryText": "mprovement in the safe and efficient management of chemicals, implement changes to existing chemical management programs, develop Chemical Management Systems, as appropriate, and control day-to-day management of chemicals on the Hanford Site.\n\nProcesses subject to the RM Program requirements are divided into three eligibility levels referred to as Programs 1, 2, and 3.  Program 1 is available to any process that has not had an accidental release with offsite consequences in the past 5 years and has no public receptors within the distance to the toxic endpoint associated with a worst-case scenario (WCS).  Program 3 applies to processes in certain Standard Industrial Codes and/or processes subject to the Occupational Safety and Health Administration Process Safety Management regulations, unless the process is eligible for Program 1.  All other covered processes must satisfy Program 2 requirements.\n\nAn eligibility analysis for the 283W Facility indicated:\n\n1. 283W Facility has not had an accidental release in the past 5 years.\n\n2. The worst-case release scenario (WCS) from the offsite consequence analysis does not include public receptors within the distance to the toxic endpoint.\n\n3. Emergency response actions are coordinated with the local community response program.\n\nBased on this information, the 283W Facility is a Program 1 process.\n\nToxic endpoints have been established in the RM Program guidance for chlorine.  The toxic endpoint for chlorine is 0.0087 milligrams per liter.  Although, EPA has developed look-up tables in the RM Program regulation to simplify the Hazard Assessment, this analysis used the ALOHA\u0019 program (developed by EPA and National Oceanic and Atmospheric Administration to model the offsite impact for the worst-case and alternative release scenarios).\n\nThe WCS assumed a complete release from one cylinder (2,000 lbs.) of chlorine.  The ALOHA\u0019 program estimated the WCS distance to the toxic endpoint is 3 miles and the area affected by the release"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6116,
      "SummaryText": "is 28 square miles.  Therefore, the effected population was assumed to be the population of the 200 West Area.  It is estimated that a population of 1,739 is located within the effected area.  Since this portion of the Hanford Site is not accessible to the public, no public receptors are within the WCS release area.  Since it is a Program 1 process, no alternative release scenario was conducted as part of this RMP. However, alternative release scenarios were conducted during facility hazard assessments and analyses.\n\nBased on the 1994, 1995, and 1997 surveys conducted by the Nature Conservancy of Washington, there are no plants or mammals on the federal list of endangered and threatened wildlife and plants within the WCS release area.  However, three species of birds (Aleutian Canada Goose , Bald Eagle, and Peregrine Falcon1) are on the list.  Additionally, there are 18 state-level species of plants and animals listed as threatened and endangered occurring or potentially occurring on the Hanford Site.\n\nA review of the Hanford Occurrence reporting system printout and discussions with 283W Facility personnel revealed that there have been no known onsite or offsite deaths, injuries, significant property damage or offsite environmental damage, evacuations, or sheltering in place for the last 5 years from the 283W Facility.\n\nSince the eligibility analysis concluded that the 283W Facility is a Program 1 process, development of an accident prevention program is not required.\n\nThe chlorine system operations and maintenance are performed utilizing pre-approved procedures. Chlorine leak detectors installed at the chlorine containers and at two other locations in the facility provide immediate alarm notification to the plant operator and automatically initiates a 911 call to hazardous material emergency response personnel in the event a chlorine leak is experienced. Plant emergency operating procedures provide immediate emergency response and personnel protection actions for"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6116,
      "SummaryText": "plant personnel. Site wide emergency response procedures provide for notification to local, community emergency response agencies and organizations. The facility chlorine leak detector and plant alarm notification systems are tested weekly to ensure reliability.\n\nAn Emergency Plan for the 283W Facility has been developed in accordance with RM Program guidelines.  This plan includes procedures for, or references to, procedures for informing the public and emergency response agencies when an accidental release occurs.  Procedures also include requirements for documentation of proper first aid and emergency medical treatment necessary to treat human exposure, and procedures and measures necessary for emergency response after an accidental release.\n\nCurrently there is an analysis being performed that will recommend potential options to the present system, including a no change option.  Depending upon the results of this analysis, the existing process may be changed to eliminate the use of chlorine.  In addition to the potential system change, training drills are scheduled quarterly at the facility, and a chlorine release drill is conducted annually in an attempt to continually improve safety."
    }
  ]
}