{
  "FacilityID": 617,
  "FacilityName": "Taygold Cooperative",
  "FacilityStr1": "HWY 25 SOUTH",
  "FacilityStr2": null,
  "FacilityCity": "CLEARFIELD",
  "FacilityState": "IA",
  "FacilityZipCode": "50840",
  "Facility4DigitZipExt": "0069",
  "FacilityCountyFIPS": "19173",
  "LEPC": "Taylor County LEPC",
  "FacilityLatDecDegs": "40.793333",
  "FacilityLongDecDegs": "-94.473333",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "NA",
  "FacilityEmailAddress": "NA",
  "FacilityDUNS": 0,
  "ParentCompanyName": "NA",
  "Company2Name": "NA",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "TAYGOLD COOPERATIVE",
  "OperatorStr1": "208 BROADWAY",
  "OperatorStr2": "BOX 69",
  "OperatorCity": "CLEARFIELD",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50840",
  "OperatorZipCodeExt": "0069",
  "RMPContact": "JEFFERY WOOD",
  "RMPTitle": "ASST. MANAGER",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000005941",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-02-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-05-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-04-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-04-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 40.79333,
  "FRS_Long": -94.47333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 703,
      "AltID": "ANHYDROUS AMMONIA",
      "FacilityID": 617,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 709,
          "ProcessID": 703,
          "NAICSCode": "42291",
          "_desc": {
            "NAICS_CODE": "42291",
            "NAICS_DESCRIPTION": "Farm Supplies Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 784,
          "ProcessID": 703,
          "ChemicalID": 56,
          "Quantity": 79560.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 500784,
          "ProcessID": 703,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 617,
      "SummaryText": "THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE PLOICIES AT OUR FACITLITY. THIS FACILITY COMPLIES WITH THE 1989 ANSI K 61.1 \"SAFETY REQUIREMENTS FOR THE STORAGE ANAD HANDLING OF ANHYDROUS AMMONIA\". IN ADDITION, IT IS OUR POLICY TO  ADHERE TO ALL APPLICABLE FEDERAL, STATE AND LOCAL LAWS.\n\nTAYGOLD COOP HAS A 'SITE SAFETY COORDINATOR'. THE COORDINATOR IS GIVEN TRAINING TO MONITOR THE DAY TO DAY SAFE WORK AACTIVITIES, MAINTAIN THE REQUIRED REGULATORY RECORDKEEPING, CONDUCT MONTHLY SAFETY MEETINGS, AND CONDUCT EMPLOYEE TRAINING.\n\nA DESCRIPTION OF OUR FACILITY AND THE REGULATED SUBSTANCES HANDLED. THIS FACILITY IS A WHOLESALE FARM SUPPLY DISTRIBUTION CENTER AS SUCH WE STORE AND DISTRIBUTE A WIDE VARIETY OF PESTICIDES AND FERTILIZERS INCLUDING ANHYDROUS AMMONIA. ANHYDROUS AMMONIA IS RECEIVED BY TRUCK AND 1, IS HANDLED AND STORED ON-SITE. IT IS A REGULATED SUBSTANCE BY EPA REQUIRING US TO COMPLY WITH THE RISK MANAGEMENT PROGRAM. WE SELL ANHYDROUS AMMONIA TO GROWER CUSTOMERS IN 1,000 GALLON NURSE TANKS. THE CUSTOMER APPLIES THE AMMONIA INTO THE SOIL AS A SOURCE OF NITROGEN FERTILIZER FOR GROWING AGRICULTURAL CROPS.\n\nTHIS FACILITY MAINTAINS    43  1,000 - GALLON TANKS FOR CUSTOMER DELIVERY. OUR COMBINED CAPACITY IN NURSE TANKS IS 190,060 POUNDS. ANHYDROUS AMMONIA IS STORED 1 STATIONARY STORAGE TANK (18,000 GALLON) ON SITE. 79560 POUNDS OF ANHYDROUS AMMONIA IS THE MAXIMUM STORAGE CAPACITY OF STATIONARY STORAGE TANKS. THE LARGEST STORAGE VESSEL AT THIS FACILITY  IS 18,000 GALLON CAPACITY.\n\nTHE WORST CASE SCENARIO.\n\nOUR WORST CASE SCENARIO IS THE LOSS OF THE TOTAL CONTENTS OF THE 18,000 GALLON STORAGE TANK WHEN FILLED TO THE GREATEST AMOUNT ALLOWED (85% OF CAPACITY), RELEASED AS A GAS OVER 10 MINUTES, RESULTING TOTAL VAPOIZATION. THE MAXIMUM QUANTITY RELEASED WOULD BE 81549 POUNDS. ACCORDING TO RMP COMP MODELING, THE DISTANCE TO THE ENDPOINT (POINT OF DISPERSION TO) IS 3.3 MILES. IT SHOULD BE NOTED THAT TAYGOLD HAS NEVER HAD A RELEASE OF AN ENTIRE STATIONARY STORAGE TAN"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 617,
      "SummaryText": "K.\n\nALTERNATIVE RELEASE  SCENARIO\nTHE MOST COMMON ALTERNATIVE RELEASE SCENARIO(S) FROM OUR FACILITY WOULD NOT REACH AN END-POINT OFF-SITE. THE ALTERNATIVE RELEASE SCENARIO MODELED FOR THE PURPOSES OF THIS PLAN IS A 2-MINUTE RELEASE FROM A STATIONARY STORAGE TANK REPRESENTING A VALVE AND HOSE FAILURE REQUIRING A MANUAL SHUT DOWN. THE TOTAL AMOUNT OF ANHYDROUS AMMONIA RELEASED IN THIS SCENARIO WOULD BE 11,900. THE DISTANCE TO THE ENDPOINT IS 0.50 MILES.\n\nTHE MOST PROBABLE ALTERNATIVE RELEASE SCENARIO FOR ANHYDROUS AMMONIA BASSED ON THE FIVE-YEAR ACCIDENT HISTORY (THE MOST LIKELY POTENTIAL INCIDENT TO REACH AN END POINT OFF-SITE) IS THE RELEASE OF THE TOTAL CONTENTS OF A 1000 GALLON NURSE TANK, (FILLED TO 85% CAPAPCITY = 850 ACTUAL GALLONS OR 4,000 POUNDS) OF AMMONIA DUE TO A BREAK OR MALFUNCTION OF  A NURSE TANK VALVE OR HOSE. THE DISTANCE TO THE ENDPOINT FOR THIS SCENARIO IS EXPECTED TO BE LESS THAN 0.42 MILES.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS. THE AMMONIA SYSTEM IS DESIGNED, INSTALLED AND IS MAINTAINED IN ACCORDANCE WITH ASTM STANDARDS AND ASME CODES. THE FACILITY COMPLIES WITH THE SNSI K 61.1 STANDARDS (1989), OSHA (29 CFR 1910.11), EPA'S ACCIDENTAL RELEASE PREVENTION RULE AS WELL AS ALL APPLICABLE FEDERAL, STATE AND LOCAL CODES AND REGULATIONS.\n\nOUR AMMONIA SYSTEM IS PROTECTED FROM MAJOR RELEASES BY INTERNAL EXCESS FLOW VALVES, CHECK VALVES, RELIEF VALVES, MANUAL SHUTOFFS AND EMERGENCY SHUTOFF VALVES. THE LOAD-OUT RISERS USED FOR THE PURPOSE OF FILLING THE NURSE TANKS ARE PROTECTED BY EXCESS FLOW VALVES AND FILL LINE BREAKAWAYS TO IMMEDIATELY STOP THE FLOW OF AMMONIA IF A LINE OR A HOSE FAILS. aLL OF THE MAIN STORAGE TANK VALVES AND THE RISER LOAD VALVES ARE LOCKED WHEN NOT IN USE.\n\nOUR AMMONIA SYSTEM IS INSPECTED ON A REGULAR BASIS WITH MAINTENANCE AND PREVENTIVE MAINTENANCE SCHEDULED AND DOCUMENTED. LIQUID AND VAPOR VALVES, HOSES, EXCESS FLOW VALVES, GAUGES, AND RELIEF VALVES ARE REPLACED WHEN NECESSARY AN"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 617,
      "SummaryText": "D/OR ACCORDING TO THE GUIDELINES IN THE ANSI STANDARDS.\n\nTRAINNNING IS PROVIDED TO ALL EMPLOYEES AT LEAST ANUALLY, WHENEVER THERE IS A CHANGE IN THE PROCESS OR WHENEVER COMPETENCY WITH THE REGULATIONS IS QUESTIONED. THE TRAINING CONSISTS OF CLASSROOM LECTURE, CURRENT VIDEOS, TESTING AND CERTIFICATION AND ON THE JOB TRAINING.\n\nFIVE-YEAR ACCIDENT HISTORY.\nTHERE HAS BEEN NO ACCIDENTS INVOLVING ANHYDROUS AMMONIA THAT CAUSED DEATHS, INJURIES, PROPERTY OR ENVIRONMENTAL DAMAGE INCLUDING EVAUATIONS ON OR OFF-SITE."
    }
  ]
}