{
  "FacilityID": 6239,
  "FacilityName": "Town of South Windsor Wastewater Treatment Facilit",
  "FacilityStr1": "1 Vibert Road",
  "FacilityStr2": null,
  "FacilityCity": "South Windsor",
  "FacilityState": "CT",
  "FacilityZipCode": "06074",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09003",
  "LEPC": "South Windsor LEPC",
  "FacilityLatDecDegs": "41.829444",
  "FacilityLongDecDegs": "-72.636389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 81302234,
  "ParentCompanyName": "Town of South Windsor",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Town of South Windsor",
  "OperatorStr1": "1 Vibert Road",
  "OperatorStr2": null,
  "OperatorCity": "South Windsor",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06074",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": "CTD081302234",
  "EPAFacilityID": "100000083875",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-06-10 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": "1999-07-02 00:00:00",
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2002-03-20 00:00:00",
  "DeRegistrationEffectiveDate": "2001-09-30 00:00:00",
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.829512,
  "FRS_Long": -72.635461,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7484,
      "AltID": "Chlorine disinfection",
      "FacilityID": 6239,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8240,
          "ProcessID": 7484,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7652,
          "ProcessID": 7484,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3210,
              "Process_NAICS_ID": 7652,
              "SafetyReviewDate": "1999-06-10 00:00:00",
              "PHA_Date": "1999-06-10 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-07-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "wind direction indicator",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-10 00:00:00",
              "TrainingReviewDate": "1999-04-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-10 00:00:00",
              "EquipmentInspectionDate": "1999-04-19 00:00:00",
              "EquipmentTested": "chlorinator,chlorine dedtector,piping, unions and connectors, alarm system",
              "ChangeMgmtDate": "1999-06-10 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-10 00:00:00",
              "PreStartupReviewDate": "1999-04-19 00:00:00",
              "ComplianceAuditDate": "1999-04-19 00:00:00",
              "AuditCompletionDate": "1999-07-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-19 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-10 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-10 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3668,
                  "PreventionProgram3ID": 3210,
                  "ProcessChemicalID": 8240
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6239,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-10 00:00:00",
    "ERTrainingDate": "1999-04-19 00:00:00",
    "CoordinatingAgencyName": "South Windsor Police Services",
    "CoordinatingAgencyPhone": "8606442551",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 6239,
      "SummaryText": "or leaks.  If a leak is detected and cannot be stopped, replace shipping cap tag cylinder as defective, and notify chlorine vendor.  In changing a cylinder, two personnel are assigned to the task: an entrant and an attendent.  The attendent with an SCBA unit stands at the exterior entrance to the chlorine storage room, while the entrant using a SCBA unit attaches the chlorinator equipment to the new cylinder using a new lead gasket.  Entrant uses ammonia to check for leaks.  Tank valve is opened and ammonia is used to check again for leaks.  When the tank is placed into service, the Laboratory Technician is notified and a tank in service tag is attached to chlorine line, and the chlorine scale tare weight is adjusted and the scale set.\n\nNormal operation involves daily maintenance checks of system for pipe leaks, and chlorine usage readings and adjustments.  The chlorine detector is inspected and calibrated.  The alarm system is inspected monthly by staff, and will be inspected annually by a certified alarm specialist.  Inspections and testing will be in accordance with applicable coses and standards.  Inspections and tests shall be documented and shall include the date, the employee's name, description of equipment, and the results of the inspection or test.    Employees are trained on room entry (enter slowly and cautiously).  The exhaust system is checked before entering room.  The chlorine storage room is provided with an observation window.  A colorimetric badge on the window will be used as an indicator of chlorine.  \n\nAll proposed changes affecting the chlorination process are evaluated prior to implementation to assess the basis for the change, any impact on employee health and safety, modifications of existing procedures, period of time required for the proposed change, and authorization requirements.  Employees involved in the chlorination process will be informed of the proposed change, and retrained before the start-up of the process following implement"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6239,
      "SummaryText": "'s hazardous materials contractor ( who is located within Town) for emergency response, and shall call the Town's emergency services dispatcher for Fire and Police Department notification.  If incident occurs after normal working hours, the responding on-call employee shall contact the hazardous materials contractor and the emergency services dispatcher.  After placing these calls, personnel shall move to an area up wind of the incident site, and communicate with the first responded (Fire Department) as to whether all employees are accounted for.  Agency mission assignments are described in the Town's Emergency Response Plan For Hazardous Materials Accidents.  \n\nIn general, the incident commander (senior fire officer on scene) shall establish an incident command post outside of and upwind of the chlorine leak site, insuring command representation by appropriate response agencies.  Incident commander shall establish safety perimeters and inner perimeters as necessary.  The Fire Department shall take appropriate actions to contain, control or stop leaks or releases, and suppress fires.  The incident commander shall make his/her decision as to protective actin areas after his initial assessment of the situation.  His/her decisions concerning evacuation will involve both radial and downwind evacuations.  Flares and /or wind sock will be used to determine wind direction, and the use of the map  -  Emergency Planning - Chemical Spills, Areas of Vulnerability will also be used as appropriate.  In general, a simple rule of thumb determination will be made by the incident commander to identify the affected area - one mile downwind and 45 degrees to each side of plume center line, explosion - one mile radius, three times the visible plume, or some distance beyond detectable odor.\n\nThe Police Department will be responsible for receiving incident reports and recording information for required logs and reports, dispatching police, fire and ambulance, and notifying other depa"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6239,
      "SummaryText": "rtments as requested by incident commander.  The Police Department shall coordinate operations with the incident commander, and establish traffic detours and evacuation routes.  The Department shall man security perimeters, staff local shelters if activated, and assist with evacuation as necessary.  Notify and request emergency medical services from other communities as request by the incident commander.  Notify area hospitals of hazardous material casualties, and coordinating all ambulances to hospital communications.  The Facility is located near to the Connecticut River flood plain and farm lands, therefore, under both worst case and alternative release scenarios, a small population would be affected ( 800 in the worst case scenario).\n\nThe hazardous materials contractor, with appropriate equipment, shall enter the chlorine storage room to seal the leak and/or enclose cylinder.  In the event the leak cannot be contained, the Fire Department will apply water fog to chlorine plume so as to contain, knock-down and dilute the gas. \n\nThe Town is in the process of planning changes to improve safety.  In the short term, the Pollution Control Division is planning to install a selenoid activated valve on the chlorine system with a connection to the chlorine detector.  When a chlorine leak is detected, the valve will automatically close at the cylinder shutting off the supply of chlorine gas.  The Town is also currently involved in a project to eliminate the use of chlorine gas as a disinfectant.  An engineering consultant has been selected and a study will be completed by August 1999.  It is anticipated that the current chlorination system will be replaced by a UV Disinfection system within the next year."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6239,
      "SummaryText": "ation of the change.\n\nAny incidents involving a release of chlorine gas or incidents that could have lead to a release shall be investigated as soon as possible, but in no case shall said investigation be more than 48 hours after the incident.  The investigation team shall include employees knowledgeable in the process, and a representative of the Town's risk management consultant.  The team shall include a contract employee when appropriate.  The team shall prepare a report that shall include the date of the incident, date the investigation began, incident description, contributing factors, and any recommendations.  All recommendations shall be immediately implemented, and corrective actions documented.  Incident reports shall be reviewed with employees.  The chlorine process safety management system will be evaluated at least once every three year period by an outside contractor..  The evaluation shall measure system effectiveness, identify potential ares for improvement, verify that procedures are adequate, and verify that procedures are being followed.  The evaluation report findings shall be implemented and documented.\n\nWhen a leak has been detected, the following emergency response plan, in compliance with the provisions of OSHA standard 29 C.F.R. S. 1910.38(a), is put into action.  When the chlorine alarm if activated or the odor of chlorine gas is noticed, the leak is confirmed by inspection of the chlorine storage room through the observation windsor and/or the colorimetric badge on the window, and the Plant Supervisor or, in his/her absence, the Facility Mechanic is notified.  No employees are to enter the Chlorine storage room under such conditions.  All  employees upon hearing the alarm shall report to the Plant Supervisor,s Office for roll call.  Employees working at the Plant who are not at roll call, shall be located and notified.  Employees at remote work sites shall be notified by radio.  The Plant Supervisor or Facility Mechanic shall call the Town"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6239,
      "SummaryText": ").  It will be a condition of employment that the contractor provide assurance that each contract employee has received the appropriate training, that the training has been documented, and that each employee follows all of the Town's safety rules.  Contractors will be required to advise the Town of any hazards discovered in the course of performing the work.\n\nWhen new facilities or a modification of existing facilities requires a change in the chlorination safety process, prior to system startup, a review will be conducted to insure that safety, operating, maintenance, and emergency procedures are adequate, and training of each employee has been completed.  \n\nWritten procedures provide for system mechanical integrity. A pre-startup procedure  involves the inspection and calibration of the chlorine cylinder scale  each year by a qualified contractor.  All system pipe unions are inspected and tightened.  Plastic tubing and fittings are inspected and replaced as necessary.  The chlorine detector and the ventilation system are inspected and tested.  Self contained breathing apparatus (SCBA) is inspected and personnel are trained annually in use of the equipment.  All inspections and test procedures are in compliance with manufacturer's recommendations and applicable codes and standards.  The frequency of inspections and tests shall meet code and standard requires;  inspections and testing will be conducted more frequently if determined to be necessary based upon experience.\n\nStartup procedures involve the following accidental release prevention measures.  In unloading cylinders, check for cylinder leaks using an ammonia spray bottle before unloading from truck.  Chock delivery truck tires when unloading cylinders.  In moving new cylinder into chlorine storage room, minimize lift height, and use at least two personnel.  Visually inspect lift monorail to insure correct alignment.  In securing new cylinder into storage room, remove shipping cap and spray ammonia to check f"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 6239,
      "SummaryText": "A one (1) ton cyclinder of chlorine gas is stored in the Control Building of the Town of South Windsor's  Wastewater Treatment Facility.  The Facility is located adjacent to the Connecticut River flood plain and within one tenth of a mile from a residential area along Main Street.  Chlorine is used for the disinfection of treated wastewater effluent prior to discharge to the Connecticut River.  The chlorination process operates each year from May 1st to September 30th.  Todate, there has never been an accidental release of chlorine gas from this Facility.\n\nAccidental release prevention and emergency response policies will be outlined in both the Town's Emergency Response Plan For Hazardous Materials Accidents and the Chlorine Process Safety Management Plan that  include process safety information, process hazard analysis, operating procedures, training, outside contractor work, pre-startup safety review, mechanical integrity, management of change, incident investigation, emergency planning and response, and compliance audits.\n\nThe chlorine cylinder is stored within a segregated room with outside entrances only.  The room is ventilated, and monitored continuously with a chlorine leak detector.  The chlorine leak detector is connected to an external light and audio alarm system.  The alarm system is also connected to the alarm panel at the Town's Police Emergency Services dispatch office for 24 hour surveillance.\n\nThe Town has drafted a written process for safety which is intended to provide operating employees with an understanding of the hazards posed by the chlorine disinfection process.  This information covers the process hazards, technology and equipment.\n\nHazard information includes toxicity information, permissible exposure limits, physical data, reactivity data, corrosivity data, termal and chemical stability data.\n\nTechnology information includes a process flow diagram, process chemistry, and maximum inventory levels.\n\nEquipment information includes material"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6239,
      "SummaryText": "s of construction, ventilation system design, and detection equipment.\n\nTown employees with process operation experience and an understanding of process hazard analysis methods were assembled for the purposes of conducting a what-if process hazards analysis.  The analysis was directed toward identification of process hazards, identification of likely incidents with potential for community-wide impacts; also considered were engineering and administrative controls and the consequences of failure of such controls.  Team findings and recommendations will be incorporated within  the chlorine process safety manual.  Future recommendations will be documented and completed as soon as possible, and actions will be communicated to those employees involved in the operation and maintenance of the process.\n\nWritten operating procedures were prepared for operating personnel that provided  clear instruction for initial startup, normal operation, emergency operations, normal shutdown, safety systems, and safety and health considerations.  Operating procedures will be reviewed as necessary to insure that they are representative of current practices.  The Town will establish annual certification that  operating procedures are current and accurate.\n\nAnnual training of all employees is conducted each year prior to the start of the chlorination process.  Training emphasis is on health and safety hazards, procedures, and safe practices.  A means for training documentation is currently being reviewed, and will be soon adopted by the organization.\n\nContractors working on or adjacent to the chlorination process will be required to provide the Town with information pertaining to the contractor's safety program and performance.  Before work can begin, the contractor will be informed as to the release hazards, and will be provided with a copy of the Town's emergency action plan.  The contractor's work performance with be periodically evaluated for conformance with OSHA standard 1910.119(h)(3"
    }
  ]
}