{
  "FacilityID": 6273,
  "FacilityName": "Chambers Creek Wastewater Treatment Plant",
  "FacilityStr1": "10311 Chambers Creek Road",
  "FacilityStr2": null,
  "FacilityCity": "Tacoma",
  "FacilityState": "WA",
  "FacilityZipCode": "98467",
  "Facility4DigitZipExt": "1040",
  "FacilityCountyFIPS": "53053",
  "LEPC": "Tacoma/Pierce County LEPC",
  "FacilityLatDecDegs": "47.192361",
  "FacilityLongDecDegs": "-122.573639",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Pierce County - Public Works and Utilities",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Peirce County Public Works",
  "OperatorStr1": "10311 Chambers Creek Road",
  "OperatorStr2": null,
  "OperatorCity": "Tacoma",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98467",
  "OperatorZipCodeExt": "1040",
  "FTE": 67,
  "OtherEPAFacilityID": "WAD 988513347",
  "EPAFacilityID": "100000078612",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-01-24 00:00:00",
  "DeRegistrationEffectiveDate": "2005-01-12 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 47.194131,
  "FRS_Long": -122.574999,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7524,
      "AltID": null,
      "FacilityID": 6273,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8285,
          "ProcessID": 7524,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7692,
          "ProcessID": 7524,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3235,
              "Process_NAICS_ID": 7692,
              "SafetyReviewDate": "1999-06-12 00:00:00",
              "PHA_Date": "1999-02-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2001-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "change loading/unloading procedure",
              "OpProceduresReviewDate": "1999-06-04 00:00:00",
              "TrainingReviewDate": "1999-06-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-12 00:00:00",
              "EquipmentInspectionDate": "1999-05-18 00:00:00",
              "EquipmentTested": "Chlorine gas detector",
              "ChangeMgmtDate": "1999-02-22 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-12 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-10 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-10 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3696,
                  "PreventionProgram3ID": 3235,
                  "ProcessChemicalID": 8285
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6273,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-10 00:00:00",
    "ERTrainingDate": "1999-01-28 00:00:00",
    "CoordinatingAgencyName": "Pierce County Emergency Management",
    "CoordinatingAgencyPhone": "2537986595",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6273,
      "SummaryText": "Introduction and Background\nThe USEPA's Clean Air Act Amendments of 1990 included provisions that require facilities that use certain substances to develop a plan to reduce the likelihood of an accidental release of the substances to the atmosphere and reduce the likelihood of serious harm to the public and the environment. The plan must also include mitigation measures to reduce the potential impact on the public in the unlikely event of a release. The requirements of this plan, commonly referred to as a Risk Management Plan (RMP), are detailed and codified in 40 CFR Part 68.\nThe Pierce County Chambers Creek Basin Wastewater Treatment Plant (CCWWTP) stores chlorine in quantities above the regulatory thresholds at which a RMP/PSM is required. Chlorine is used at the CCWWTP to disinfect the domestic wastewater prior to discharge into Puget Sound.\nThe RMP/PSM consists of three compliance programs, each with progressively stricter compliance standards. The chlorination process at the CCWWTP is subject to Program 3, the most stringent of the three programs, since CCWWTP is subject to the Washington State Department of Labor and Industries Process Safety Management (PSM) regulations (which is equivalent to being subject to the OSHA PSM program) and a worst-case release of chlorine could affect offsite receptors.\nThe RMP/PSM consists of three major parts. The first part is the Hazard Assessment. The Hazard Assessment is done to determine the effects that a release of a regulated substance could have on the public. The second part is a Prevention Program that consists of 12 elements designed to improve the system safety and decrease the likelihood of a release. The third part is the Emergency Response Program, which develops a plan for dealing with a release in the unlikely event that one would occur. Because the regulations are very similar, the Prevention Program and the Emergency Response Program also serve as the OSHA PSM plan.\nHazard Assessment\nA hazard assessment wa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6273,
      "SummaryText": "s performed to determine the effects that a release would have on the public. The hazard assessment includes examining CCWWTP's 5-year accident history and hypothetical worst-case and alternative release scenario. An examination of the CCWWTP's accident history reveals that no accidents have occurred with respect to the chlorine process in the last 5 years. For the worst-case and alternative release scenarios, the distance from the point of release to the \"toxic endpoint,\" or the location at which individuals could be exposed for up to 1 hour without experiencing serious health effects, was determined. An estimate of the population affected by a release of chlorine was also determined, along with sensitive receptors such as hospitals. \nWorst-Case Scenario\nThe hazard assessment requires that the \"toxic endpoint\" or distance from the point of release to a location at which the chemical concentration equals a concentration of 3 ppm for chlorine must be determined. \nThe regulations require the development of a worst-case release scenario based on conservative assumptions. For a 1-ton chlorine container, which is the largest size CCWWTP handles, it is required to assume that 2,000 pounds of chlorine will be released over 10 minutes. In addition, the worst-case scenario requires that conservative atmospheric conditions be assumed that result in a large area of impact. It should be noted that this is unlikely to occur since the properties of chlorine would cause a freeze-and-thaw cycle to occur at the leak, which would slow the release. To model this scenario for both facilities, the EPA's computer program RMP*Comp was used. This program determines the impact radius at which the chlorine concentration is equal to or exceeds the \"toxic endpoint\". \n\nThe radius is a distance of 1.3 miles from the chlorine storage area at the CCWWTP.  It should be noted that for the CCWWTP, the urban setting was used which assumes that numerous obstacles, such as elevated terrain. In addition,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6273,
      "SummaryText": "the worst-case scenario requires that conservative atmospheric conditions be assumed that result in a large area of impact. \nBecause the cloud from a chlorine leak would disperse relatively quickly, an individual at a \"toxic endpoint\" would be exposed to the exposure limit concentration for much less than the 1 hour assumed by the limit. In addition, the exposure limit concentrations result in relatively minor health effects. Therefore, an individual at the toxic endpoint would be affected less than the results of the worst-case scenario may imply.\nAlternative Release Scenario\nThe RMP rule also requires that at least one alternative release scenario be evaluated for chlorine. The alternative release scenario reflects a type of release that is more likely to occur compared to the worst-case scenario. The alternative release scenario selected by the CCWWTP staff was a release of chlorine as the result of corrosion of the fusible plug in a chlorine container. Using RMP*Comp for this scenario, the radius of impact is 0.1 mile. This alternative release scenario is considered to be more representative of the effects likely in the event of a release.\n\nPrevention Program\nThe Prevention Program, together with the Emergency Response Program, make up the RMP/PSM. The Prevention Program consists of 12 elements designed to improve the system safety and decrease the likelihood of a release.\nEmployee Participation\nThe participation of the CCWWTP staff in preparing the RMP/PSM program was critical to the program's successful implementation. Employee participation is valuable because it increases the safety awareness of the staff and it allows the staff's experience in operating and maintaining the processes to be incorporated into the plan.\nCCWWTP staff participated in the Process Hazard Analysis that is described below. All CCWWTP staff received RMP/PSM awareness training that instructed staff on how the RMP/PSM requirements may impact their jobs. Staff who operate and maintain t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6273,
      "SummaryText": "he RMP/PSM processes are trained in how to safely maintain and operate the processes.\n\nProcess Safety Information\nThe RMP regulations require that information concerning process chemicals, technology, and equipment be compiled as part of a RMP program. Emergency response planners can use such information to develop training programs and procedures, or as a general resource. The information will be supplied to contractors who will work in the chlorine areas as part of the requirements outlined in the Contractors element. All the required process safety information was compiled as required by the RMP regulations. The information meets and in many cases exceeds the minimum required by the regulations.\nProcess Hazard Analysis\nA process hazard analysis (PHA) was conducted systematically to evaluate potential causes and consequences of accidental releases. This information was used by CCWWTP staff to improve safety and reduce the consequences of accidental releases. Equipment, instrumentation, utilities, human actions, and external factors that might affect the process were the focus of the PHAs that were performed for the chlorine process.\nThe chlorine PHA was conducted by an interdisciplinary team of CCWWTP staff familiar with the process operation and maintenance and plant management. The PHA was done using a combination of \"What-If\" and \"Checklist\" methods. Based on the results of the PHA, changes in operating, maintenance, and other process safety management procedures that would improve the overall safety of the CCWWTP were identified. These changes have been adopted by the CCWWTP and incorporated as part of the overall Process Safety Management Program. The other process modifications to reduce or eliminate potential hazards are scheduled to be implemented (see planned changes to improve safety in this executive summary).  \nOperating Procedures\nOperating procedures for the chlorination process have been developed as part of the RPM/PSM. Written operating procedures"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6273,
      "SummaryText": "assure continuous, efficient, and safe operation of the facility. The goal of the operating procedures is to provide clear instructions to safely operate the process. Operating procedures are also used to train new employees and to provide refresher training for existing staff.\nThe detailed operating procedures include startup, shutdown, manual operation, automatic operation and emergency operating procedures. The procedures describe how the system should be operated in order to minimize the chances of an accidental release. The procedures also emphasize safety considerations during operation and address hazardous situations that can occur and how to correct them.\nTraining\nAn effective RMP/PSM training program can significantly reduce the number and severity of accidental release incidences. Employees involved in operating or maintaining the chlorination process must receive training that includes applicable operating and maintenance procedures and an overview of the process. Training must emphasize safety and health hazards and safe work practices.\nCCWWTP staff have received initial training on the operations and maintenance of the regulated processes, an overview of each of the RMP/PSM plan elements, and the procedures that must be followed to comply with the requirements of the RMP/PSM plan. In addition to RMP/PSM plan training, select CCWWTP staff have been trained to respond to an accidental release. Refresher process operation training must be provided at least every 3 years. Refresher training for emergency response is conducted annually.\n\nContractors\nThe CCWWTP must make contractors aware of the known hazards of the chlorine process related to the contractors' work. In addition, the CCWWTP must make contractors aware of the applicable elements of its emergency response plan. CCWWTP screens contractors for one who can perform work on or adjacent to the chlorine process without compromising the safety and health of employees at the facility.\n Before allowing"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6273,
      "SummaryText": "a contractor to work on or adjacent to the chlorine process, CCWWTP must obtain and evaluate information regarding the contractor's safety performance and programs. When a contractor involving work on or adjacent to the chlorine process is to bid, the bidding procedures must ensure that contractor safety management requirements are met. If a contractor is to work in or adjacent to the chlorine process, a safety briefing is to be given to the contractor to make the contractor aware of CCWWTP's RMP/PSM plan requirements and will be presented to the contractor prior to the beginning of the work. Upon arriving at the facility for the first time to perform work, the contractor will be presented a Contractor Safety Management Briefing Form that must be read and signed.\nPre-startup Review\nA pre-startup safety review must be conducted for any new covered process or for significant modifications to the existing chlorine process that necessitate a change in the process safety information. No new or significantly modified process will start up and no acutely hazardous chemicals will be introduced into such a process prior to the pre-startup safety review. The purpose of the pre-startup safety review is to ensure that the facility is ready to operate new and modified regulated processes safely. \nTo initiate the pre-startup safety review, all updated elements of the RMP/PSM Plan are assembled for review. This includes all process safety information, process hazard analysis, operating procedures, employee training and mechanical integrity. A pre-startup safety review team completes a pre-startup checklist. The pre-startup safety review team should complete and sign a Pre-startup Safety Review Form. This form documents the process, and helps ensure that the review has been properly performed. The Pre-startup Safety Review Form must be authorized before startup.\nMechanical Integrity\nAn effective mechanical integrity program is one of the primary lines of defense against a release."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6273,
      "SummaryText": "The mechanical integrity program also addresses equipment testing and inspection, preventative maintenance schedules, and personnel training. The intent is to ensure that equipment used to process, store, or handle chlorine is maintained and installed to minimize the risk of releases.\nThe CCWWTP maintenance staff use a computerized maintenance management system, referred to as the Hansan work order system to store equipment information, generate  work orders,  and schedule preventative maintenance (PM).  Hansan work order system system is used to generate work orders for preventative maintenance. In addition to preventative maintenance, the CCWWTP staff performs corrective maintenance in the event of equipment malfunction or breakdown. Work orders indicate what safety precautions must be followed including whether lockout/tagout or confined space entry provisions are applicable. The staff that carryout maintenance are all trained as part of the RMP/PSM.\nHot Works Permits\nRMP/PSM regulations require employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the chlorine process. To ensure that hot work is done safely, a Hot Work Permit Program has been developed that requires a permit to be issued before hot work is performed. Hot work is defined as the use of oxyacetylene torches, welding equipment, grinders, cutting, brazing, or similar flame- or spark-producing operations.\nThe process of completing the hot work permit makes it necessary to identify the hazard, recognize what safeguards are appropriate, and then initiate the safeguards necessary to ensure a fire-safe workplace. Following the standards outline in this section aid in complying with the OSHA Hot Works Regulations (1910.252(a)).\nManagement of Change\nA system for the proper management of changes and modifications to equipment, procedures, chemicals, and processing conditions is required under the RMP/PSM. Modifications to the chlorine process will be reviewed be"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 6273,
      "SummaryText": "fore they are implemented to determine if the modification would compromise system safety. An effective change management system will help minimize the chance for an accidental release.\nIf a modification covered under RMP/PSM is made, its effects must be addressed, employees must be informed, and the written procedures must be updated. The intent is to require that all modifications to equipment, procedures, and processing conditions other than \"replacement in kind\" be managed by identifying and reviewing them before implementation. The Plant Superintendent will evaluate any modifications that are covered under the RMP/PSM. The person requesting a change will complete a Management of Change Form that the Plant Superintendent, Maintenance Supervisor, and Chief Operator will review and authorize prior to initiation of a covered change.\nIncident Investigation\nEach incident that resulted in or could reasonably have resulted in a catastrophic release of chlorine must be investigated. A process to identify the underlying causes of incidents and to implement procedures for preventing similar events has been developed. To investigate an incident, an investigation team will be established. As part of the investigation, an incident report will be prepared to recommend system changes.\nThe investigation team should ask questions such as what equipment failed, which behavior failed, and which material leaked, reacted, or exploded? As part of the incident review, staff actions that may have contributed to the incident will also be reviewed. A determination will be made as to whether it is necessary to institute additional training for the employees to prevent the incident from occurring in the future. On the incident report form, the Plant Superintendent identifies which of the recommended system changes are approved for implementation. The incident investigation report and any changes resulting from the report will be reviewed with all staff members who operate and maintain the"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 6273,
      "SummaryText": "applicable system. \nCompliance Audit\nCCWWTP is required to complete a compliance audit for the RMP/PSM program. The primary goals of conducting an internal compliance audit are to gather sufficient data to verify compliance with RMP/PSM requirements and good process safety practices, identify process safety deficiencies and develop corrective actions, and increase safety awareness among plant staff.\nThe compliance audit methodology is modeled after OSHA's guidelines for conducting regulatory PSM compliance audits: Compliance Guidelines and Enforcement Procedures, OSHA Instruction CPL 2-2.45A CH-1 (September 13,1994). An internal compliance audit must be conducted at the plant at least once every 3 years for the chlorine process. A team that includes at least one person knowledgeable in the covered processes and an audit leader knowledgeable in RMP/PSM requirements and audit techniques will conduct the audits. The Plant Superintendent and the audit team will promptly determine an appropriate corrective action for each deficiency identified during the audit and document the corrective actions and the dates by which they must be taken. The first RMP audit is not required until June 2002.\nEmergency Response Program\nThe Emergency Response Program details a plan for dealing with a release. OSHA Process Safety Management regulation 29 CFR 1910.119(n) and EPA RMP regulation 40 CFR 68 Subpart E require that an Accidental Release Emergency Response Plan be prepared. The plan must be prepared in accordance with the provisions of another overlapping OSHA regulation-Employee Emergency Plans (29 CFR 1910.38(a)). In addition, provisions of the OSHA hazardous waste and emergency response standard, 29 CFR 1910.120 (q) must also be considered. The Emergency Planning and Response Plan described in this section complies with the requirements of 40 CFR 68.90 and 29 CFR 1910.38(a). The facility is a non-responding facility in accordance to definitions for responding and non-responding fa"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 6273,
      "SummaryText": "cilities as defined in the RMP/PSM regulations. \nThe Pierce County Public Works and Utilities Department Standard Operating Guidelines and Procedures for Emergency Management manual provides specific emergency response procedures for accidental release of chlorine. The emergency response procedures cover a release from the initial alarm stage through Fire Department and/or chlorine supplier assistance, as appropriate, to evacuation of the facility. As part of the emergency response procedures there are plans for victim rescue, leak investigation, and communication with additional support agencies. In addition, critical plant operations are identified to insure that, if possible, the critical CCWWTP functions are kept operational. \nThe facility's emergency response activities has been coordinated with Pierce County Emergency Management.\n\nPlanned changes to improve safety\nThe facility has planned and is currently designing the following projects to improve safety for the chlorine process.  Currently the chlorine containers which are not in use, are in an open area.  The chlorine container area will be enclosed.  The facility will also install a chlorine scrubber for the new chlorine storage area, the exsiting chlorine container in use room  (ton room), and chlorination room.  The enclosure and chlorine scrubber project are targetted for June 2000 installation.  The facility will also install an emergency generator.  This generator will provide electical power to the chlorine process and to the chlorine scrubber for continued, safe operation in the event of an electrical power failure.  The emergency generator is targetted for a December 2001 installation."
    }
  ]
}