{
  "FacilityID": 6315,
  "FacilityName": "Coleman Dairy",
  "FacilityStr1": "5801 Asher",
  "FacilityStr2": null,
  "FacilityCity": "Little Rock",
  "FacilityState": "AR",
  "FacilityZipCode": "72204",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05119",
  "LEPC": "Pulaski County LEPC",
  "FacilityLatDecDegs": "34.716694",
  "FacilityLongDecDegs": "-92.338556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 806606760,
  "ParentCompanyName": "Turner Holdings, L.L.C",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Turner Holdings, L.L.C",
  "OperatorStr1": "653 Turner Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Covington",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38019",
  "OperatorZipCodeExt": null,
  "RMPContact": "Cherb Coleman",
  "RMPTitle": "Plant Manager",
  "FTE": 100,
  "OtherEPAFacilityID": "AR0048160",
  "EPAFacilityID": "100000084678",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Coleman Dairy, Little Rock, Arkansas",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-12-15 00:00:00",
  "DeRegistrationEffectiveDate": "2003-07-24 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.7176,
  "FRS_Long": -92.33894,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7580,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 6315,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7749,
          "ProcessID": 7580,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8345,
          "ProcessID": 7580,
          "ChemicalID": 56,
          "Quantity": 28404.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508345,
          "ProcessID": 7580,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6315,
      "SummaryText": "Accidental release prevention and emergency response policies at Coleman\nThe policy of Coleman Dairy, is to develop those programs necessary to protect the health of its employees against on-the-job hazards which may cause sickness or injury now or in the future.  Also, as the operator of a facility at which substances may be used that in uncontrolled situations could cause harm to the public and damage to the environment, we will strive for environmental excellence with a commitment to continual improvement, pollution prevention and compliance with legislative requirements.  The Risk Management Program (RMP) is one of these programs.\n     Each employee in areas where the RMP is applicable will be knowledgeable of the related policies and procedures and the supervisors or a designated person is required to insure that they understand them.  Employees and supervisors are required to comply with our policies and are subject to corrective action in those cases determined to indicate willful violation.\n    A written plan of action regarding the implementation of employee participation in the program has been developed as a part of our Release Prevention Program as specified by 29 CFR 1910.119.  A compilation of safety information to enable Coleman Dairy and the employees involved in the ammonia operations to operate safety has been accumulated.  This process safety information includes information pertaining to the toxicological and physical hazards of the chemical listed.  This plan of action includes information pertaining to the technology of the processes, and information pertaining to any equipment used in the processes.\nA complete hazard analysis and study of the ammonia system's mechanical integrity has been completed on the ammonia receipt, storage, and utilization operations have been completed.  This analysis was completed by safety and health staff, engineering and maintenance personnel, and certain operational personnel.  This analyses involved a review of each"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6315,
      "SummaryText": " operation of the processes to address steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions.  The assessment also included information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of personnel in the process areas; pre-startup safety; mechanical integrity of equipment; inspection and testing, correction of deficiencies in equipment, planned or unexpected changes to the process, equipment, and procedures to the processes.\nA system was developed and is maintained to promptly address the team's findings and recommendations.  The hazard analyses will be updated as needed and at least every five (5) years.\n    Coleman Dairy has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nJob Safety Analyses\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\n    Each employee involved in operations within the processes where the ammonia is received, processed, or used at the facility has been trained in an overview of the processes and in the operating procedures as outlined by OSHA regulations.  Refresher training is required every three years, and more often if necessary.  Training includes:\n    a.  Emphasis on the specific safety and health hazards;\n    b.  Emergency operations in the case of a release including shutdown; and\n    c.  Safe work practices applicable to the employee'"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6315,
      "SummaryText": "s job tasks.\n    Designated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Ammonia is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes, and provision of training to employees.  \n    Contractors performing work on or adjacent to equipment or processes in which Ammonia is present must have clearance from the Maintenance Supervisor prior to beginning operations.  Each contractor will also complete the Coleman Dairy Divisional Visitor and Contractor Safety Rules form prior to entry into the facility.\n    In those cases where contractors will perform work directly to or on the process equipment in which the Ammonia is present, the Safety Coordinator and Maintenance Supervisor will provide an orientation section to them prior to beginning operations.  This orientation will include an introduction to the Coleman Dairy Process Safety Management Program, information concerning the toxicological and physical hazards of Ammonia, and the emergency response plan in the case of an incident involving a release.  Upon completion, the contractor will be issued a permit by the Maintenance Supervisor to begin work.\nThe Coleman facility and the Ammonia Process\n    Coleman Dairy provides employment for 100 workers in Little Rock, Arkansas.  This facil"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6315,
      "SummaryText": "ity is a dairy processing plant owned by Turner Holdings, LLC.  As a processor of dairy products its products are sold nationally under its corporate company, Turner Dairies, LLC, 653 Turner Drive, Covington, Tennessee 38019.\nSite Description:\n    The facility is located in Little Rock, Arkansas at 5801 Asher Avenue, Little Rock, Arkansas 72204.\nGeography and Weather:\nLittle Rock is the Capital of Arkansas.  It's also the centrally-located city that sets at the hub of the Greater Little Rock area.  The city sets aside the Arkansas River.\nThe annual average temperature is 61.70 ; summer (July) temperature 81.40 ; winter (January) 39.5 ; average annual rainfall 48.52\"; average annual snowfall 5.2\"; prevailing winds, Southwest at 8.2 miles per hour.\nTransportation:\nAir:  Little Rock National Airport has jet aircraft service.The port is ranked 74 among 427 commercial service airports in the nation in terms of enplanements.\n    Railroads include service by Union Pacific Railroad, Burlington Northern and Santa Fe.\n    Interstates 30, 40, 430, 440 and 630; U.S. Highways 64, 65, 67, 70, and 167; Arkansas State Highways 4, 5, 10, 13, 15, 25, 31, 38, 60, 88, 89, 107, 161, 165, 176, 225, 256, 286, 294, 33, 8 , 365, and 367 intersect the metropolitan area providing highway transportation facilities in urban areas. \n    Population and Labor Force\nThis metropolitan area spreads out from the city of Little Rock with one million people within a 50-mile radius with 561,336 in the metropolitan area alone.\nThe State of Arkansas Employment Security Division Little Rock Ditrict Office serves a four-county area (Pulaski, Lonoke, Faulkner and Saline Counties).  The total labor force is 301,550.\nGovernment and Law Enforcement\n    The government type is a city manager.  The Board of Directors is composed of eleven people, sever elected from wardsand three at large as well as the mayor who is directly elected. \n    Little Rock employs more than 500 police offices, utilizing mobile equipment.  The department a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6315,
      "SummaryText": "lso has a crime prevention unit.\n    Fire Department\n    Little Rock has a Class 2 fire rating, with 379 paid firefighters.  The department operates 20 fire stationswith 21 engine pump companies, 8 ladder companies, 4 rescue squads, and 3 crash crews, all Class \"A\" equipped.\n    Schools\n    The population is serviced by 35 elementary schools, 8 junior high and 5 high schools, a vocational -technical center, and an alternative education program..\n    Medical Care\nMedical care support is provided by the Arkansas Children's Hospital, Arkansas Heart Hospital, Arkansas State Hospital, BHC Pinnacle Pointe Hospital, Baptist Memorial Medical Center, Baptist Medical Center, Baptist Rehabilitation Institute, The Bridgeway Hospital, Central Arkansas Radiation Therapy Institute, Inc., charter Behavioral Health System of Little Rock, Colubia Doctors Hospital, Conway Regional Medical Center, Rebsamen Regional Medical Center, Rivendell Psychiatric Center, St. Vincent Infirmary Medical Center, St. Vincent North Rehabilitation Hospital, Saline Memorial Hospital, southwest Hospital, USAM Medical Center, and Department of Veteran Affairs Medical Center.\nOperation Description\n    Previously the site was owned and operated by Associated Milk Producers.  The site was purchased by Turner Holdings, LLC in January 1998.\n    The site process involves the receipt of raw milk with the processing and production into various dairy products for distribution commercially to the public.  The raw milk is delivered to the processing site by tanker trunk directly from dairy farms.  Upon receipt the milk in unloaded in large storage tanks.\n    From the time of receipt and throughout the processing system, the milk is maintained at a cool temperature by three different refrigeration processes, 1) Air Cooling, 2) Water Chilling, and 3) Glycol Cooling.  The refrigeration of these media is by used of Anhydrous Ammonia.\n    The air cooling process involves the distribution of liquid ammonia through piping (coils) across which air is "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6315,
      "SummaryText": "blown with fans to cool the air.  The water chilling process involves the distribution of liquid ammonia through piping (coils) around which water flows for chilling.  \nTechnology of the Process\n    Refrigeration is the control of heat.  According to American Heritage Dictionary heat is defined as:\n\"The energy associated with the motion of atoms or molecules in\nsolids, which can be transmitted through solid and fluid media\nby conduction, through fluid media by convection and through empty\nspace by radiation.\"\n    Heat is energy.  The amount of energy or heat available is determined by the amount of motion or excitement of the atoms or molecules.  The more excited the molecules, the more energy or heat available.\n    This energy or heat can be moved or transferred.  This transfer occurs when there is a difference of temperature.  Heat flows from a source of grater energy (higher temperature) to a source of lower energy (lower temperature).  The greater the temperature difference, the more rapid the heat flow.\n    There are three types of heat transfer mechanisms:\nConduction\nConvection\nRadiation\n    The use of liquid ammonia as a refrigerant is the transferring of heat by conduction and convection.  In conduction heat is transferred by the molecules in a medium coming in contact with each other.  The warm molecules collide with colder molecules giving them some of the energy (heat).  The flow will occur if there is a difference of temperature from one side of the medium to the other.  Metals are very good at transferring heat by conduction.\n    By blowing air or moving a liquid such as water or glycol over a material such as metal that has been cooled heat is transferred by convection.  The heat load in a freezer is moved via convection to the coils where conduction takes place in transferring the heat to the refrigerant.  The refrigeration process does not produce cold.  It simply moves the heat from an area where it is not wanted to a place it can be discharged.\n    The refrigeration sy"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6315,
      "SummaryText": "stems at Coleman are accomplished by three methods using Anhydrous Ammonia.  These include:\nAir Cooling\nWater Chilling\nGlycol Cooling \nAmmonia Tank Cooling Jacket\n\n    Liquid ammonia has the ability to absorb very large amounts of heat as it vaporizes.  This ability is the basis for mechanical refrigeration systems.  These mechanical systems utilize both pressure and temperature in the refrigeration cycle.  There are five major components in a mechanical refrigeration system.  These include, 1) Receiver, 2) Metering device/expansion valves, 3) Evaporator, 4) Compressor, and 5) Condenser.\n    The Receiver collects the condensed vapors and stores the excess refrigerant charge that is not circulating through the system.  The receiver is located between the condenser and the expansion valve.  It is also used to store refrigerant when it is necessary to service the system.\n    The liquid ammonia is routed to a metering device (expansion valves).  This device regulates the amount of refrigerant going into the evaporator.\n    As the ammonia flows through the device, there is a pressure drop.  The amount of pressure drop determines the temperature of the refrigerant going to the evaporator.  The refrigerant leaves the metering device in both a liquid and a vapor phase.\n    The two phase refrigerant then enters the evaporator.  The evaporator removes heat from the area or substance being cooled.  The ammonia absorbs heat and vaporizes as it travels through the evaporator.  The ammonia then leaves the evaporator and travels to the compressor.\n    The compressor takes the vapor through the suction line and increases the pressure such that when the heat is removed in the condenser, the vapors change form and become liquid.  Work is required to compress these vapors.  This work is converted into energy and stored in the compressed vapors.  This increase in energy results in an increase in temperature.\n    The compressed vapors then go to a condenser.  The condenser removes a lot of the heat containe"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 6315,
      "SummaryText": "d in the compressed vapors.  When enough heat is removed, the vapor changes form and become liquid.  This condenser liquid then flows to the receiver.\n    Worst-case release scenario and alternative release scenario\n    As a part of the Coleman Dairy proactive program concerning the hazards of ammonia to its' workers and the surrounding public, its staff has conducted a thorough hazard assessment.\n    For the hazard assessment and the RMP, populations potentially affected are defined as those within a circle that has as its center the point of release and its radius the distance to the toxic or flammable endpoint.  Owners or operators may use Census data to define this population.  The presence of schools, hospitals, other institutions, public arenas, recreational areas, and large commercial and industrial developments that can be identified on street maps within this circle must be noted.  The presence of environmental receptors within this circle must also be listed.  The EPA has defined environmental receptors as natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and Federal wilderness areas, that can be exposed to an accidental release.\n    The worst case scenario for Anhydrous Ammonia was decided as the complete rapid loss of 1500 pounds of Anhydrous Ammonia during a one minute time frame. The following information was determined using the Automated Resource for Chemical Hazard Incident Evaluation (ARCHIE) model, based on the stability class F , 8.5 mph wind speed, and the level of 200ppm for Anhydrous Ammonia.  This resulted in a release rate of 1,500 lbs/min, and an end point of 2.75 miles from the spill point during summer season at 85 degrees F.  \n    The alternate case scenario for Anhydrous Ammonia was decided as the loss of Anhydrous Ammonia resulting from a release through a 1 inch line break. . The following information was determined using the Automated Resource for Chemical"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 6315,
      "SummaryText": " Hazard Incident Evaluation (ARCHIE) model, based on the stability class F, 8.5 wind speed, and the of 200ppm for Anhydrous Ammonia.  This resulted in a release rate of 2 lbs/min, for a duration of 15 minutes, and an end point of .05 miles from the spill point.  \nGeneral accidental release prevention program and chemical-specific prevention steps\n    Prevention of a release is a core component of the Coleman Dairy Risk Management Program.  This program is designed to insure proper work practices and an on-going mechanical integrity program.  This program also insures compliance with 29 CFR 1910.38, 1910.120, 1910.1200, 40 CFR, Part 68, Part 112, and Part 260.\n    Coleman Dairy has developed and implemented written operating procedures to provide clear instructions for safely conducting activities involved in the processes at each operation by our employees, consistent with the process safety information and to address steps for each handling phase, limitations, safety and health considerations, and safety systems and their functions.  Other written documentation of standard operating procedures as a part of this program is included in the following documents:\nMechanical Integrity Study of Process Equipment\nPreventive Maintenance Program\nWritten Emergency Response Plan\nEmployee Emergency Action and Evacuation Plan\nTraining\nEach employee involved in operations within the process where Ammonia is received, processed, or used at the facility has been trained in an overview of the process and in the operating procedures as outlined by 29 CFR 1910.119.  Refresher training is provided no less than every three years and more often if necessary. \nMechanical Integrity\nAlso, each maintenance person who has responsibilities to perform maintenance on the process components receives training on an as needed basis, but no less than every three years.\nEmergency Response\nOffensive level HAZMAT emergency response support is provided by the local fire station.  Their response time for emerg"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 6315,
      "SummaryText": "encies at the facility is approximately five minutes.\n    Contractors.\n    Designated personnel have specific responsibilities related to the use of contractors who perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to areas where the Ammonia is received, stored, or processed in the facility.  These responsibilities include specific requirements in selection of contractors regarding the contractor's safety performance and programs; the provision of information concerning the emergency action plans related to the process; development and implementation of safe work practices regarding the control of entrance and exit of contract employers and contract employees in the process areas, periodic evaluation of the contractor related to safety management at the process; maintenance of certain records related to contractor employee injury and illness; development of written procedures for any new processes, and provision of training to employees.  \nFive-year accident history\nNo incidences of ammonia release have occurred at the facility that resulted in deaths or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\nEmergency response program\n    Due to the receipt, usage, and storage of Ammonia in large quantities, Coleman Dairy takes a proactive approach to the protection of its employees, the public, and the environment.  In consideration of the hazardous effects that Ammonia may have on human health and the environment the following outlines the facilities prevention and emergency response plans:\n    Written Emergency Response Plan\n    Offensively Trained & Equipped Emergency Action Team in accordance with 29 CFR 1910.120\n    Development of a Written Implementation Plan of Action\n    Conduction of Hazard Analysis on routine and periodic basis\n    Development of and documentation of safe work practices\n    Initial and periodic training of employees\n    Conduction of"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 6315,
      "SummaryText": " pre-startup safety reviews\n    Conduction of Compliance Audits\n    Conduction of incident investigations\n    Contractor Program Safety Program\n    Hot Work Permit Program\n    Process Safety Management & Chemical Accidental Release Prevention Committee\n    Mechanical Integrity & Preventive Maintenance Program\n    Determination and planning for Worst-Case and Alternative Case Release Scenarios\n    Continual evaluation for methods to improve facility safety - Safety Committee\n    Meetings with the Local Emergency Planning Committee and Fire Department\n\nPlanned changes to improve safety\n    In an attempt to insure a continual improvement in the facility worker protection and release prevention programs, training concerning this safety and environmental program and others is conducted for eight hours each month.  This training requires the attendance by all personnel whose job may have any relationship to the ammonia operations."
    }
  ]
}