{
  "FacilityID": 6322,
  "FacilityName": "Kraft Foods, Inc.",
  "FacilityStr1": "10800 Avenue 184",
  "FacilityStr2": null,
  "FacilityCity": "Tulare",
  "FacilityState": "CA",
  "FacilityZipCode": "93274",
  "Facility4DigitZipExt": "9514",
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.129722",
  "FacilityLongDecDegs": "-119.326111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39010590,
  "ParentCompanyName": "Philip Morris Companies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 144628310,
  "Company2DUNS": 0,
  "OperatorName": "Kraft Foods, Inc.",
  "OperatorStr1": "10800 Avenue 184",
  "OperatorStr2": null,
  "OperatorCity": "Tulare",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93274",
  "OperatorZipCodeExt": "9514",
  "RMPContact": "Aaron Rouse",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 130,
  "OtherEPAFacilityID": "93275LSRCH10800",
  "EPAFacilityID": "100000079844",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-08-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": "Kraft Foods, Inc. RMP - Tulare, CA",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.12364,
  "FRS_Long": -119.33102,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7587,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 6322,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 7756,
          "ProcessID": 7587,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8352,
          "ProcessID": 7587,
          "ChemicalID": 56,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508352,
          "ProcessID": 7587,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6322,
      "SummaryText": "\nEXECUTIVE SUMMARY\n\n1.0 Release Prevention and Emergency Response Policies\n\nThe Kraft Foods facility in Tulare, California has a good record in preventing and minimizing releases of anhydrous ammonia (hereafter anhydrous ammonia will be referred to as ammonia).  This facility has implemented an electronic preventive maintenance system that uses a real time database to track preventive maintenance, training, inspection dates, and issue reminders to responsible groups.\n\nThe emergency response policies at this facility ensure that there is emergency response coverage 24 hours per day and 7 days per week by employees with Emergency Response Training.  There are also adequate provisions for coordination with outside agencies, such as with the Tulare City Fire Department, in the event of an emergency.\n\n2.0 Process Description and Regulated Substances\n\nAt this location Kraft Foods manufactures or processes dairy products and dairy byproducts.  The North American Industry Classification System (NAICS) code for the primary processes at this facility are 311512 and 311513 (SIC codes 2021 and 2022, respectively).  This facility is capable of producing and packaging various dairy products for consumer intake.  \n\nKraft Foods Tulare has one regulated substance under 40 CFR 68, ammonia, at the Tulare, CA plant.  The freshness of the dairy products is maintained through the use of a refrigeration system using ammonia as a refrigerant.  The ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds.  The quantity of ammonia stored on-site is 56,000 pounds.\n\nAmmonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989.  Its distinctive, pungent odor is very noticeable to most people, even in small quantities.  Ammonia is flammable in a very narrow and high range of concentration with a high ignition temperature.  It is not poisonous, but it can be corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concent"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6322,
      "SummaryText": "rations, can cause burns.  The potential risks to people exposed to an accidental ammonia release include irritation of the respiratory tract, burning of skin and other tissue when contacted by ammonia vapor, and freezing of skin and other body tissue when contacted by liquid ammonia.\n\n3.0 Worst-case and Alternative Release Scenarios\n\nAlthough there are quality and safety systems in place at Kraft's Tulare plant, a release from the ammonia refrigeration system could potentially affect employees on-site and the general public immediately surrounding the facility.  The USEPA requires companies to use models for \"worst-case\" and \"alternate\" release scenarios for each regulated chemical.  Given the safety precautions at the plant, both scenarios are unlikely to occur.  If a release occurred, however, the alternative scenario would be more likely.\n\nThe ammonia release scenario was modeled using the BREEZE HAZ DEGADIS+ air dispersion model at the Kraft facility in Tulare.  DEGADIS+, developed by the US Coast Guard, is an EPA approved model as identified in the RMP Offsite Consequence Analysis Document  (May 24, 1996).  It predicts contaminant movement for heavier-than-air gases for instantaneous and continuous ground level releases.  It was selected because of its applicability towards modeling of dense gases (such as ammonia) and use for emergency response planning.  \n \n 4.0 General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n \nThis facility has developed an OSHA PSM program for their ammonia refrigeration system.  There are several aspects of the prevention program that are key:\n \n1.  Utility personnel are present on-site and assigned to the ammonia system, 24 house a day, 7 days a week, all year round.\n2.  There is a plant ammonia detection system which alerts the facility personnel.\n3.  Most of the ammonia pipe work is located away from employee traffic patterns and machinery to minimize the chance of an ammonia release.\n4.  The plant "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6322,
      "SummaryText": "maintains good training, certification, and employee awareness of operating procedures.\n5.  The facility has an aggressive PSM meeting schedule.\n\n5.0 Five-year Accident History\n\nA review of this facility's accident history since June 22, 1994 was performed.  To date there have been no accidental spills or releases of ammonia or propane at the facility as defined by 40CFR Part 68.42(a).\n\n6.0 Emergency Response Program\n\nAs mentioned earlier, this facility has developed an emergency response program in which plant employees are divided into various management and response teams.  There are in-plant contacts for an emergency which can be found in the Plant Emergency Response Plan.  There are also back-up personnel in the event that the primary incident response personnel cannot be contacted.  The on-site emergency response plan includes information about the frequency of employee emergency response training as well as detailed description of the training content.  There are also specific procedures to follow in event of a fire or ammonia emergency.\n\nAt the discretion of the Incident Commander, the Tulare Fire Department will be called to provide back-up emergency responders and equipment.  The Tulare Fire Department responds to all emergencies where fire alarms are used for evacuation in addition to all fire related emergencies.  In all cases where the fire department is called, the Kraft Tulare and Tulare Fire Department HAZMAT Response Teams will be placed on standby and an ambulance will be called to the scene."
    }
  ]
}