{
  "FacilityID": 6336,
  "FacilityName": "Fred Meyer Puyallup Distribution Center",
  "FacilityStr1": "349 Valley Avenue NW",
  "FacilityStr2": null,
  "FacilityCity": "Puyallup",
  "FacilityState": "WA",
  "FacilityZipCode": "98371",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53053",
  "LEPC": "Puyallup (City Of) LEPC",
  "FacilityLatDecDegs": "47.208194",
  "FacilityLongDecDegs": "-122.295028",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 977598496,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Fred Meyer, Inc.",
  "OperatorStr1": "PO Box 42121",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97242",
  "OperatorZipCodeExt": null,
  "FTE": 350,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000080958",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 47.210109,
  "FRS_Long": -122.297777,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7601,
      "AltID": "Refrigeration System",
      "FacilityID": 6336,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8367,
          "ProcessID": 7601,
          "ChemicalID": 56,
          "Quantity": 38000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 7770,
          "ProcessID": 7601,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3266,
              "Process_NAICS_ID": 7770,
              "SafetyReviewDate": "1996-01-25 00:00:00",
              "PHA_Date": "1995-12-14 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1996-12-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Computer control system; isolation valves; Pressure vessels buildt to ASME code; pipes welded by certified welders",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "All relief valves vent to an emergency ammonia discharge tank filled with water to prevent discharge to the atmosphere",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Software update, additions to system",
              "OpProceduresReviewDate": "1999-05-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-09 00:00:00",
              "EquipmentTested": "Setpoints",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-02-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-02-08 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-02-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-02-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3729,
                  "PreventionProgram3ID": 3266,
                  "ProcessChemicalID": 8367
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6336,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-01 00:00:00",
    "ERTrainingDate": "1999-03-24 00:00:00",
    "CoordinatingAgencyName": "Puyallup Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 6336,
      "SummaryText": "pment of this plan has been to identify the ammonia emergencies most likely to occur at Fred Meyer, Puyallup Distribution Center and establish precautions and procedures to protect life safety and health during an emergency.  The refrigeration process has back-up prevention systems to keep processing malfunctions from becoming ammonia release emergencies.  If an emergency does occur, the following response personnel, facilities, and equipment are in place:\n\n7 Incident Command Center\n7 Emergency Alarm and Communication System\n7 Emergency Response Team\n7 Safe Rooms, Evacuation Plans, and Assembly Points\n7 Personal Protective Equipment\n\nThe role and procedures for obtaining external emergency assistance have been formally established with the Puyallup Fire Department, including the Puyallup HazMat Team stationed in Puyallup. \n\nAll Fred Meyer, Puyallup Distribution Center personnel will be trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify plan elements requiring improvement.\n\nThis plan will be reviewed annually and updated as necessary by the Fred Meyer, Puyallup Distribution Center Refrigeration Supervisor.\n\n1.70 Planned Changes To Improve Safety\n\nThis facility started production operations in 1995.  All system components meet design specifications in ANSI/IIAR 2-1992, equipment, design, and installation of ammonia mechanical refrigerating systems.  All pressure vessels are built according to American Society of Mechanical Engineers (ASME), Section VIII, Division 1, 1995 Edition (1996 Addenda), ASME Boiler and Pressure Vessel Code, pressure vessels.  Any upgrades or extensive maintenance work performed in the future will be in compliance with those standards applicable at that time.\n\nAll Fred Meyer, Puyallup Distribution Center personnel are trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be he"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6336,
      "SummaryText": "ld periodically to maintain familiarity with response actions and identify elements requiring improvement.\n\nProcess Hazard Analysis (PHA) Priority List of Recommendations were completed in December, 1996."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6336,
      "SummaryText": "mmonia refrigeration system maximum inventory is 30,000 pounds of anhydrous ammonia.  There is no standby make-up inventory kept on-site.\n\n1.30 The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nRelease scenarios were modeled using RMP*Comp (Version 1.06), a software program developed by the National Oceanic and Atmospheric Administration (NOAA) and EPA.  Offsite receptors were defined using the LandView III (Version 1.0) system.  This system estimates residential population within the circle defined by the endpoint of the worst-case and alternative release scenarios.  In addition, it lists whether certain types of public receptors and environmental receptors are within the circles.\n\n7 Worst-Case Scenario.  Catastrophic failure of the High Pressure Receiver located in the engine room when filled to the greatest amount would release 30,000 pounds of liquid ammonia.  This scenario presumes that the entire contents are released.  \n\nThe distance to the toxic endpoint for the worst-case scenario is 2.2 miles from the point of release.  This distance extends beyond the facility fence line, and would encompass a population of 36,862 with the closest residence approximately 1,000 feet from the site.  A school is about 1= miles away inside of this release zone, and a hospital is about three miles away, outside of this release zone.  No other public or environmental receptors are located within this zone. \n\n This worst-case scenario would not likely occur unless an act of nature (e.g., earthquake) physically compromised the tank.   The structural integrity of the tank is safeguarded by periodic inspection for mechanical integrity to prevent a rupture due to tank degradation.  The tank is also safeguarded from rupture from over-pressurization.  It is a rated pressure vessel hydro-tested to 375 psi and equipped with 250 psi pressure relief valves"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6336,
      "SummaryText": ". The design specification of the tank only allows a maximum capacity of 80% at 800F, limiting the total amount of ammonia in the system.  During high demand, the High Pressure Receiver may only be filled to a fraction (~30%) of capacity.  \n\nAlternative Scenario. Several alternative scenarios can generate the equivalent of a 1 opening in a high pressure liquid line.  Alternative scenarios could include an opening created by a valve sheared off, a large gasket leak, or a pressure relief valve release.  These scenarios presumes a release duration of 10 minutes resulting in a loss of 25,000 pounds of liquid ammonia.  This scenario was selected because a release of this type would occur outdoors resulting in the highest potential exposure to offsite receptors.\n\nThe distance to the toxic endpoint for the alternative scenario is 0.9 miles from the point of release.  This distance extends beyond the facility fence line, and would encompass a population of 6,169 with the closest residence approximately 1,000 feet from the site, inside of this release zone.  A school is about 1= miles away and a hospital is about three miles away, outside of this release zone.  No other public or environmental receptors are located within this zone. \n\nThe severity of release from this scenario would likely be less since safety system provisions are in place to limit the release duration to less than ten minutes through the use of appropriately placed isolation valves. \n\n 1.40 General Accidental Release Prevention Program And Chemical-Specific Prevention Steps\n\nFred Meyer, Puyallup Distribution Center complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  The design and construction of this facility was in accordance with published standards, tests or recommended methods of trade, industry or governmental organizations.  \n\nFred Meyer, Puyallup Distribution Center's written PSM plan incorporates many policies and procedures to ensure safe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6336,
      "SummaryText": "operation and maintenance of this facility.  Plan elements essential to safe operation of the refrigeration system include employee participation, process hazard information, process hazard analysis, operating procedures, training, contractor safety, pre-startup safety review, mechanical integrity, management of change, hot-work permits, incident investigation, emergency response and planning, and compliance audits.  This plan will be reviewed annually and updated as necessary by the Fred Meyer, Puyallup Distribution Center Refrigeration Supervisor. \n\nTraining is provided to ensure that each employee involved in operating a process has been trained in an overview of the process, the operating procedures, and safety considerations.  This training uses guidelines developed by the International Institute of Ammonia Refrigeration (IIAR) and Refrigeration Engineers Technology Association (RETA).  Only qualified maintenance personnel operate and interact with the refrigeration system.  This minimizes the chances of inadvertent error in operation that could lead to a release of ammonia.  Startup, shutdown, and any onstream adjustments are handled by these qualified persons.  \n\n1.50 Five-Year Accident History\n\nThere has been no significant release of ammonia at the Fred Meyer, Puyallup Distribution Center since the startup in 1995.\n\n 1.60 Emergency Response Program\n\nFred Meyer, Puyallup Distribution Center has a written Emergency Response Plan developed to ensure that precautions and procedures are in place to protect employee and public health and safety during a chemical emergency.  It complies with the provisions of WISHA Emergency Response regulations, WAC 296-62-3112.  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties. This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.  This plan has been reviewed with the Puyallup Fire Department.\n\nThe approach in the develo"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 6336,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\n1.10 Accidental Release Prevention And Emergency Response Policies\n\nThe Fred Meyer, Puyallup Distribution Center refrigeration system uses pure anhydrous ammonia (a commonly used refrigerant for industrial systems) as the refrigerant.  Given the quantity handled, anhydrous ammonia is considered a hazardous substance by EPA.  Many of the properties that make ammonia valuable as a refrigerant also requires that precautions and procedures be in place to protect employee and public health and safety during a chemical emergency.  It is the policy of Fred Meyer, Puyallup Distribution Center to be in compliance with all applicable federal and state rules and regulations.    \n\nSafety at our facility is inherent on the manner in which anhydrous ammonia is handled.  While the design of the facility incorporates a multitude of safety devices, safe handling procedures combined with appropriate training of our personnel are key aspects to maintaining safety at our facility.\n\nWe have a written Process Safety Management (PSM) plan that complies with the regulations stipulated by WAC 296-67-017.  A crucial component of this plan is the Emergency Response Plan, developed in compliance with the Emergency Response provisions of WAC 296-62-3112.  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.\n\n1.20 Facility Description And Substances Handled\n\n7 The Fred Meyer, Puyallup Distribution Center stores and distributes refrigerated and non-refrigerated foods.  Storage requires the use of a refrigeration system to preserve the integrity of refrigerated processed foods.  This refrigeration process uses ammonia as a refrigerant.  Access to the facility is restricted to authorized employees, management personnel, and contractors.\n7 The regulated substance handled at this facility is anhydrous ammonia.\n7 The a"
    }
  ]
}