{
  "FacilityID": 6539,
  "FacilityName": "Rogerson Wastewater Treatment Facility",
  "FacilityStr1": "450 Knobbs Creek Drive",
  "FacilityStr2": null,
  "FacilityCity": "Elizabeth City",
  "FacilityState": "NC",
  "FacilityZipCode": "27909",
  "Facility4DigitZipExt": "0347",
  "FacilityCountyFIPS": "37139",
  "LEPC": "Pasquotank/Camden City LEPC",
  "FacilityLatDecDegs": "36.308056",
  "FacilityLongDecDegs": "76.203889",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Elizabeth City",
  "Company2Name": null,
  "CompanyDUNS": 566000226,
  "Company2DUNS": 0,
  "OperatorName": "Steven Harrell",
  "OperatorStr1": "302 East Colonial Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Elizabeth City",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27909",
  "OperatorZipCodeExt": "0347",
  "RMPContact": "Bart S. Van Nieuwenhuise",
  "RMPTitle": "Public Works Director",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000082368",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-10-29 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.30806,
  "FRS_Long": -76.20389,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7841,
      "AltID": null,
      "FacilityID": 6539,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8022,
          "ProcessID": 7841,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8631,
          "ProcessID": 7841,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508631,
          "ProcessID": 7841,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6539,
      "SummaryText": "The Rogerson Wastewater Treatment Facility is a state of the art secondary treatment facility, incorporating biological nutrient removal within a conventional activated sludge process. The facility has a design capacity of 4.5 million gallons per day, which receives wastewater via two pipes; a 24 inch force main from the downtown area and a 8 inch force main from the northside of town. The make-up of the wastewater is primarily domestic with some light industry.\n\nThe first phase in the treatment train is the screening of large trash and debris by use of an automatic rake system. The wastewater then travels to the aerated grit chamber where heavy inorganic solids (grit, gravel, sand, etc.) are removed and the dissolved oxygen level is raised slightly. Next, the wastewater passes through a Parshall flume (where flow is measured) and on to the secondary system.\n\nThe secondary system or aeration basins are the heart of the process. Various microorganisms are utilized to reduce or remove contaminants, primarily biochemical oxygen demand, suspended solids, ammonia and phosphorus. Since this process uses microorganisms, it is called biological treatment. The primary microorganisms are aerobic (requiring dissolved oxygen) and are provided air by four 150 hp multi-stage centrifugal blowers. The flexibility of the system allows operators to configure the basins into several zones to meet specific requirements for removal of various contaminants. Some of these zones are anaerobic (do not require oxygen) for phosphorus removal and anoxic (no dissolved oxygen but combined oxygen) for de-nitrification or removal of nitrates.\n\nThe secondary clarifiers are the next phase in the process. The wastewater leaves the aeration basins, through a splitter box and passes into two clarifiers. Here the wastewater has ample time to allow solids to settle to the bottom and any floatables material to be removed. The settled solids are either returned to the aeration basins to provide microorgani"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6539,
      "SummaryText": "sms for the process or are sent to the solids handling facility to be dewatered by the gravity belt thickener, stabilized with lime and hauled off site for land application.\n\nThe wastewater then passes from the clarifiers to the chlorine contact basin for disinfection. Chlorine is added in sufficient amounts to destroy the majority of the pathogenic or disease-causing bateria left in the secondary treatment. The facility usually keeps 8,000 pounds of chlorine on site for this purpose. After passing through the contact tank, sulfur dioxide is added to remove the residual chlorine. The last phase of treatment is the re-aeration tank which raises the dissolved oxygen levels sufficient to be received by the Pasquotank River.\n\nThe Utility Treatment Division of Public Works has adopted a Process Safety Program in order to implement 29 CFR 1910.119, the OSHA Standard Regulating Process Safety Management of Highly Hazardous Chemicals and to enable all those who may be affected to be able to identify and understand the hazards posed by the processes that involve those chemicals. This program will help prevent the occurrence of, or minimize the consequences of catastrophic releases by stating our policies and procedures for the management of process hazards in design, construction, start-up, operation, inspection and maintenance. Our program calls for maximum employee participation and includes all elements of the employee participation provisions of the OSHA standard. This program will be regularly reviewed and updated and whenever necessary to reflect new or modified tasks and procedures.\n\nThe UtilityTreatment Division's emergency response program was developed to comply with OSHA standards 29 CFR 1910.38, 1910.120 and to ensure the safety of employees and the public. It shall be used in all emergency situations which may occur at the Rogerson Wastewater Treatment Facility. Generally this program shall cover emergencies such as fire, medical emergencies, accidents, catastro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6539,
      "SummaryText": "phe's, toxic releases like equipment malfunctions resulting in the real or potential release of chlorine and other emergency situations requiring the orderly evacuation of this facility and/or activation of our Division HAZMAT Team. In the event of public evacuation the division shall team with the Pasquotank/Camden/City LEPC for further assistance.\n\nTo fully understand the impact of releases at the facility, a worst-case release and alternative release scenarios were performed utilizing the EPA's RMP COMP (TM). The worst-case models the release of 2000 pounds of chlorine gas at 110 pounds per minute for a duration of 10 minutes. The release will occur in an enclosed space, in direct contact with the outside air. The distance to the endpoint for the worst-case scenario is 0.9 miles. Estimated residential population within distance to the endpoint is 200. This release would extend beyond the facility boundary. The alternative release models the release of 762 pounds of chlorine gas at 12.7 pounds per minute for a duration of 60 minutes. The distance to the endpoint for the alternative release scenario is less than 0.1 mile. Estimated population within distance to endpoint is 0. This release will occur in an enclosed space, in direct contact with outside air. This release will not extend beyond the facility boundary.\n\nThis facility has had no reportable accidental releases of chlorine in the last five years.\n\nThis facility was constructed in 1997, and designed by Arcadis, an engineering firm in Raleigh. The existing chlorine building which was orginally constructed in 1986 was modified during 1997 construction. This modification included, converting two existing chlorinators to compound loop control, installing new chlorine residual analyzer and new safety equipment. The chlorine leak detector is housed in the chlorine building and  outside the building is a wall-mounted audible alarm powered through dry contacts in the detector unit. The unit is also equipped with dr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6539,
      "SummaryText": "y contacts for the emergency exhaust fan and computer alarm in the main operations station."
    }
  ]
}