{
  "FacilityID": 6546,
  "FacilityName": "EAST CENTRAL REGIONAL WASTEWATER TREATMENT PLANT",
  "FacilityStr1": "4325 N. HAVERHILL ROAD",
  "FacilityStr2": null,
  "FacilityCity": "WEST PALM BEACH",
  "FacilityState": "FL",
  "FacilityZipCode": "33422",
  "Facility4DigitZipExt": "0507",
  "FacilityCountyFIPS": "12099",
  "LEPC": "BRUCE PISANI",
  "FacilityLatDecDegs": "26.741944",
  "FacilityLongDecDegs": "-80.129167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "mwaring@ci.west-palm-beach.fl.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ECRWWTP / CITY OF WEST PALM BEACH",
  "OperatorStr1": "P.O. BOX 220507",
  "OperatorStr2": null,
  "OperatorCity": "WEST PALM BEACH",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33422",
  "OperatorZipCodeExt": "0507",
  "RMPContact": "MR. MARK WARING",
  "RMPTitle": "ENVIRONMENTAL HEALTH & SAFETY OFFIC",
  "FTE": 33,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000083269",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-12-04 00:00:00",
  "DeRegistrationEffectiveDate": "2009-11-23 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 26.74194,
  "FRS_Long": -80.12917,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "PUBLIC LAND SURVEY-QUARTER SECTION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7856,
      "AltID": null,
      "FacilityID": 6546,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8037,
          "ProcessID": 7856,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8646,
          "ProcessID": 7856,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508646,
          "ProcessID": 7856,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6546,
      "SummaryText": "EXECUTIVE SUMMARY:  The East Central Regional Wastewater Treatment Plant\n(ECRWWTP) operated by the City of  West Palm Beach has developed this Risk Management Plan\n(RMP) in response to section 112(r) of the Clean Air Act (CAA). This guidance complies with the\nUnited States Environmental Protection Agency's (EPA) Risk Management Program (RMP)\nregulations, 40 CFR Part 68, and the Occupational Safety and Health Administration's (OSHA)\nProcess Safety Management (PSM) Standard 29 CFR 1910.119.\n\nSection 112(r) requires facilities which store certain toxic or flammable chemicals above threshold\nquantities to develop and implement an RMP.  The RMP evaluates the worst case and alternative case\nrelease of these chemicals into the environment and the impact on surrounding human populations\nand environmental receptors.  The worst case release scenario assumes that all of the toxic substance\nwithin a system or process is released at one time.  The alternate case release scenario assumes a\nsmaller, more realistic, release of perhaps one cylinder or container.  The RMP also evaluates the\nfacility's resources to cope with chemical releases and implemented procedures responding to\nchemical releases.  Although this RMP presents worst case and alternative case scenarios, it should\nbe noted that there has never been an incident at the ECRWWTP which resulted in any offsite\nconsequences or injury to human health or the environment.\n\nThe ECRWWTP has an average capacity of 55 million gallons per day, (mgd) with  an ultimate\ntreatment and disposal capacity of 98 mgd.    The plant site consists of 300 acres. The plant layout\nwas specifically designed to take advantage of the prevailing southeastern sea breeze.  In this manner\nany odors created would be dissipated over the plant site and sparsely populated surrounding areas. \nThe ECRWWTP provides wastewater treatment service to five government entities which\nparticipated in its development.  The following are the five entities:  City of West "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6546,
      "SummaryText": "Palm Beach, Town\nof Palm Beach, City of Riviera Beach, City of Lake Worth, and Palm Beach County. The East Central\nRegional (ECR) wastewater treatment plant currently serves 350,000 people in central Palm Beach \nCounty and nearby communities.  \n\nThe ECRWWTP represents a cumulative investment of more than 63 million dollars since its\ninception in 1970.  The plant has undergone several expansions in its nearly 30-year history.  The\noriginal extended aeration facility was constructed in two stages and completed in 1980.  The original\ndesign provided a minimum of  90% biochemical oxygen demand (BOD) and suspended solids\nremoval prior to disposal of the effluent by deep well injection.  Between 1980 and 1986,\nimprovements were made to the original facility.  In 1986, a major program was initiated to reduce\nannual operating costs and to expand plant capacity.   \n\nChlorine is the only chemical used at this facility at quantities above the EPA - List of Regulated\nToxic Substances and Threshold Quantities for Accidental Release Prevention, and thus chlorine is\nthe basis of this RMP.  The ECRWWTP uses chlorine for emergency operations only, it is not used\nduring normal operating conditions.  Chlorine is used in the disinfection phase of the wastewater\ntreatment operation in times of emergency only.  The liquid effluent which is discharged from the\nclarifier enters the contact chamber.  At this time the effluent is treated with chlorine gas.  The\nchlorine is stored in 2,000 pound capacity containers as a liquid under pressure, but is discharged into\nthe wastewater as a gas.   The contact chamber has a series of baffles which ensure that chlorine will\nhave a minimum reaction or contact time of 15 minutes in order to mix the liquid to kill the\npathogenic bacteria in the effluent and complete the disinfection phase. \n\nChlorine is one of the chemical elements and is one of the halogens.  Neither the gas nor the liquid\nis explosive or flammable, however, both react chemically with "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6546,
      "SummaryText": "many substances. Chlorine is a\nhazardous chemical that can cause severe injury or death if released to the atmosphere. Chlorine gas\nis primarily a respiratory irritant. In sufficient concentrations, the gas irritates the mucous membranes,\nthe respiratory system and skin. At higher levels there is vomiting associated with labored breathing. \nIn extreme cases difficulty in breathing may increase to the point where death can occur from\nsuffocation.\n\nChlorine is also hazardous to the environment.  Chlorine causes bleached spots on leafy plants due\nto an attack on chlorophyll in the leaf. Mammalian animals suffer many of the same effects as humans\nexposed to chlorine, and many forms of aquatic animal life are adversely affected by chlorine in\nconcentrations well below 0.1 ppm, but harmful concentrations are unlikely  unless chlorine is\ndischarged directly into water.\n\nWorst Case Scenario - The worst case scenario is based upon a complete release of the entire\nquantity of a toxic substance within the largest vessel. This worst case scenario is based on a release\nof  2,000 pounds of chlorine.  This scenario assumes that 2,000 pounds of chlorine is released in a\nduration of 10 minutes (EPA standard).  The predicted wind speed is 1.5 meters per second (EPA\nstandard). Passive mitigation is permitted for this scenario, but active mitigation is not allowed. \nBased on these assumptions, if a release of 2,000 pounds of chlorine occurred, the toxic endpoints\nwould extend 3.0 miles from the source of the release.  A toxic end point is the distance the released\ngas would travel, assuming all of the released gas moves in the same direction, and still cause\nnoticeable health effects. If  this release did occur, the contamination zone would depend upon wind\ndirection and speed. The prevailing winds for this facility are out of the southeast which would\ndissipate the gas over a sparsely populated area. The human population within the 3.0 mile radius\naround the facility is 27,680 individ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6546,
      "SummaryText": "uals (based on 1990 census data). The Environmental Protection\nAgency RMP Comp. version 1.06 computer software was used to calculate the toxic endpoint.\n\nAlternative Case Scenario - The alternative case scenario is based on a partial release of a toxic\nsubstance from a system or process.  This type of release may result from a ruptured container,\nruptured seal, or broken valve.  This alternate case scenario is based on a release of 2,000 lbs. (one\ncontainer) of chlorine under the following conditions: 1 inch rupture in the container (diameter of\nvalve opening); container  is under 35 psi (Chlorine Institute, Inc. standard); the container\ntemperature is 77x F (average ambient temperature);  release duration is 34 minutes (time to empty\ncontainer); and wind speed is 3 meters per second (EPA standard).  Under these conditions the\ndistance to the toxic end is 0.4 miles.  The human population within the 0.4 mile radius around the\nfacility is 67 individuals (based on 1990 census data). There are no public or environmental receptors\ninside the 0.4 mile radius. The Environmental Protection Agency RMP Comp version 1.06 computer\nsoftware was used to calculate the toxic endpoint.\n     \nPREVENTION:    The plant was awarded Best Operated Wastewater Treatment Facility in the\nSouth-East District by the State of Florida Department of Environmental Regulation (FDER) in 1983. \nNumerous precautions are taken at the ECRWWTP to prevent the accidental release of chlorine gas\ninto the atmosphere, and to minimize the consequences if a release does occur.  As mentioned earlier,\nthe plant is located in a sparsely populated area with prevailing southeastern winds which will\ndissipate the gas over the plant site and sparsely populated surrounding areas.   \n\nChlorine Containers -  The chlorine is stored and discharged from one ton capacity containers.  The\ncontainers are welded tanks with the heads convexed inward and forge welded to the barrel.  The\nsides are crimped inward at each end to form"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6546,
      "SummaryText": " chimes which provide a substantial grip for lifting\nbeams.  The container valves are protected by a removable steel valve protective housing.  All ton\ncontainers are equipped with fusible metal pressure relief devices.  The fusible metal is designed to\nyield or melt between 158x F and 165x F to relieve pressure and prevent rupture or the container in\ncase of a fire or other exposure to high temperature.\n\nChlorine System - The system has process controls, and a monitoring and detection system.  When\nin use the process between the evaporator and the basins is under a vacuum, therefore, any leaks\ncausing a change in vacuum shuts down the chlorinator.  In addition, all underground chlorine piping\nis within secondary containment.  Process controls in place between the one ton containers, flexible\nconnector, header valve, evaporator, and chlorinator is a Standard Operating Procedure (SOP) to\ncheck for leaks prior to placing the containers on line, routine replacement of any gaskets or valves,\nand chlorine leak detection device.\n\nActive mitigation - The chlorine system is an alarmed system.  If there is a release of chlorine an \naudible alarm sounds, an indicator light illuminates, and the computer system indicates the release in\nthe main office building. Budgeted for fiscal year 1999-2000 is the installation of a chlorine scrubber\nsystem.\n\nPassive mitigation - Currently there is no passive mitigation at the ECRWWTP. Budgeted for fiscal\nyear 1999-2000 is the enclosure of the chlorine storage area. \n\nMaintenance -    The alarm system is tested every two weeks.  Chlorine repairs kits are kept onsite\nfor emergency operations.   An annual safety inspection is performed at the ECRWWTP Plant by\nMark Waring, Environmental Health and Safety Officer, City of West Palm Beach.    \n\nPersonnel - The personnel involved in this process are licensed operators. One operator per shift\nattends an annual Trouble shooting of Chlorine- Safety and Response course.  Additionally, one\noperator at"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6546,
      "SummaryText": "tends an eight (8) week Hazmat/First Responder course at the South Technical Fire\nAcademy.  The Hazmat/First Responder course is refreshed annually with a one day course.\n\nGeneral Accidental Release Prevention Program - A test is run once per month on the chlorination\nsystem.   Approximately four to six one ton containers are in the chlorine building at any given time.\n\nEmergency Response Plan / Procedures - The wastewater treatment plant maintains a written\nEmergency Response Plan.  The basis of the plan is if a chlorine leak occurs the utility personnel can\ntake defensive measure to seal the leak.  Defensive measures are defined as closing valves, such as\ncylinder valves and header valves.  In the event that a leak cannot be stopped by simply closing a\nvalve or valves, the utility personnel evacuate the area of the cylinder leak to a safe distance to await\nFire/Rescue personnel.  Utility personnel notify West Palm Beach Fire Department by a designated\nred telephone or by calling 911.  The Fire/Rescue personnel then take charge of the situation with\nassistance from utility personnel.  If additional assistance is needed, the West Palm Beach Fire\nDepartment will call upon the Palm Beach County Fire/Rescue personnel.\n\nHazmat Response / Procedures - The West Palm Beach Fire Department has established a two tiered\napproach to incidents involving hazardous materials.  First, all emergency response personnel will be\ntrained as operational first responders.  The second level of response will be a Hazardous Materials\nResponse Team specially trained and equipped to conduct offensive operations at a Hazardous\nMaterials incident.  \n\nPrior to assignment of the West Palm Beach Fire Department Hazardous Materials Team, an\nindividual must conform to the following criteria:\n\n1.   Have successfully completed Hazardous Materials Technician Course and have demonstrated\n     the competencies outlined in the 1992 edition of the National Fire Protection's Pamphlet 472.\n\n2.   Have com ple"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6546,
      "SummaryText": "ted a baseline medical exam pursuant to 29 CFR 1910. 120 and have been    determined by the examining physician to be free of any medical conditions which would    place the employee at increased risk of impairment of the employee's health from work in hazardous materials emergency response.\n\n3.   Hold a current certification as a State of Florida Emergency Medical Technician, and / or      Paramedic.\n\n4.   Demonstrate a working knowledge of Special Operations 5's layout, equipment locations     and functions.\n\n5.   Have a working knowledge of the West Palm Beach Fire Department's Haz Mat Team  Standard Operations Procedures.\n\nHazardous Materials incidents are categorized into the four following levels based on the intensity\nand quantity of the release: Level I - A Level I incident is a minor situation.   A category I incident\nis defined as a release of less than 25 gallons liquid or less than 50 pounds solid of a known hazardous\nmaterial.  Level II - A Level II incident is one in which a more serious threat is posed by the release\nor potential release of hazardous materials.  Level II incidents require the definite assistance and\nintervention by a Hazardous Materials Team.  Level III - A Level III is a major incident requiring\nspecialized assistance and may require assistance from support agencies.  A formal command post,\nstaging area and medical and / or rehab group is established.  The establishment and control over\nisolation (hot) zones is included.  Level IV - A Level IV incident is a local disaster.  This type of\nincident will severely strain or exceed the capabilities of local response agencies.  A long-term\ncommand post may be required.  It may require the activation of an Emergency Operations Center. \n\n\nThe following procedures will be followed during an incident: The first fire / rescue unit arriving at\na Hazardous Materials incident shall establish command, utilizing a unit or geographic location to\nidentify command.  The Haz Mat Group shall report direct"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 6546,
      "SummaryText": "ly to the Incident Commander.  The Had\nMat Group is responsible for recommending evacuation distances, obtaining information concerning\nthe hazards and risks posed by the materials in question, recommending decontamination and safety\nmeasures, recommending possible mitigation efforts and provide other technical assistance.  The\nIncident Commander retains overall control and authority during the entire operation, and the Had\nMat Group shall perform mitigative actions.  See Appendix B  for complete West Palm Beach Fire\nDepartment Hazardous Materials Response Plan.\n\nIf additional Had Mat Teams are needed the Palm Beach County Regional Hazardous Materials\nResponse Teams (PBCRHMRT) assists the West Palm Beach Fire Department with hazardous\nmaterials incidents.  The PBCRHMRT has an Emergency Management Plan which supplements the\nplan of the West Palm Beach Fire Department.  See Appendix C for complete PBCRHMRT\nEmergency Response Plan.\n\n\nPlanned Changes to Improve Safety - Standard Operating Procedures (SOPs)are to be updated by\nJune 30, 1999 and will include procedures for calibration of the chlorine alarm system, for chlorine\nleak tests, for operator notification when chlorine is detected, and emergency response.  Budgeted\nfor fiscal year 1999-2000 is the enclosure of the chlorine storage area and installation of a chlorine\nscrubber system which would substantially reduce the likelihood of an offsite chemical incident.\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}