{
  "FacilityID": 6586,
  "FacilityName": "Bayer Corporation, Bushy Park Plant",
  "FacilityStr1": "1530 Bushy Park Road",
  "FacilityStr2": null,
  "FacilityCity": "Goose Creek",
  "FacilityState": "SC",
  "FacilityZipCode": "29445",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45015",
  "LEPC": "Berkeley County LEPC",
  "FacilityLatDecDegs": "32.983889",
  "FacilityLongDecDegs": "-79.93",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.bayerus.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 837980200,
  "ParentCompanyName": "Bayer Corporation",
  "Company2Name": null,
  "CompanyDUNS": 64960248,
  "Company2DUNS": 0,
  "OperatorName": "Bayer Corporation",
  "OperatorStr1": "PO Box 118088",
  "OperatorStr2": null,
  "OperatorCity": "Charleston",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29423",
  "OperatorZipCodeExt": "8088",
  "RMPContact": "Victor J. Weltz",
  "RMPTitle": "Director - Safety & Regulatory",
  "FTE": 800,
  "OtherEPAFacilityID": "29445MBYCRHIGHW",
  "EPAFacilityID": "100000081671",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "SC0420-0007",
  "SafetyInspectionDate": "1997-10-13 00:00:00",
  "SafetyInspectionBy": "S.C. Dep't of Labor, Licensing & Regulation",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.98361,
  "FRS_Long": -79.92472,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7902,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 6586,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8088,
          "ProcessID": 7902,
          "NAICSCode": "325132",
          "_desc": {
            "NAICS_CODE": "325132",
            "NAICS_DESCRIPTION": "Synthetic Organic Dye and Pigment Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8696,
          "ProcessID": 7902,
          "ChemicalID": 56,
          "Quantity": 66950.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508696,
          "ProcessID": 7902,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 7903,
      "AltID": "Vulkacit production",
      "FacilityID": 6586,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8089,
          "ProcessID": 7903,
          "NAICSCode": "32519",
          "_desc": {
            "NAICS_CODE": "32519",
            "NAICS_DESCRIPTION": "Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8697,
          "ProcessID": 7903,
          "ChemicalID": 31,
          "Quantity": 134000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 31,
            "ChemicalName": "Cyclohexylamine  [Cyclohexanamine]",
            "CASNumber": "108-91-8",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508697,
          "ProcessID": 7903,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 7904,
      "AltID": "Methylations",
      "FacilityID": 6586,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8090,
          "ProcessID": 7904,
          "NAICSCode": "325132",
          "_desc": {
            "NAICS_CODE": "325132",
            "NAICS_DESCRIPTION": "Synthetic Organic Dye and Pigment Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8698,
          "ProcessID": 7904,
          "ChemicalID": 5,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 5,
            "ChemicalName": "Methyl chloride  [Methane, chloro-]",
            "CASNumber": "74-87-3",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508698,
          "ProcessID": 7904,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6586,
      "SummaryText": "                                                            EXECUTIVE SUMMARY\n \n                                                           BAYER CORPORATION\n                                                               BUSHY PARK SITE\n                                                               GOOSE CREEK, SC\n                                                                  JUNE 18, 1999\n\nI. FACILITY INFORMATION\n\nBayer Corporation is a research-based company with major businesses in health care, life sciences, and chemicals.  The Bayer corporate headquarters is located in Pittsburgh, Pa.  Bayer's Bushy Park Site manufactures pigments for the paint and automotive industries, dyes and optical brighteners for the paper and detergent industries, chemical additives for the rubber industry, and spandex for the apparel industry.\n\nThe Bushy Park Site was established in 1970 and is located on 1650 acres on the Cooper River just a few miles east of Goose Creek, S C.  The facility has 800 employees.  Approximately $147,000,000 per year of economic benefit is realized by the local area, county, and state because of our business and operations.  \n\nDue to the many wildlife programs we have established on our property, the Bayer Bushy Park Site is certified as a \"Wildlife Habitat Site\" by the Wildlife Habitat Council, a national non-profit organization founded to promote wildlife enhancement.\n\nII. ACCIDENTAL RELEASE PREVENTION & EMERGENCY RESPONSE POLICIES\n\nBayer has a commitment to health, the environment and safety.  The corporate commitment is quoted as follows:\n\n\"Bayer Corporation considers its responsibility to protect the environment and the health and safety of its employees, customers and the communities of primary importance in the conduct of its business.  It is Bayer's policy to comply with all applicable laws and regulations and to establish and implement responsible practices where laws and regulations do not exist.  Further, Bayer will work with government and in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6586,
      "SummaryText": "dustry groups to foster the development of appropriate health, environment and safety programs, laws and regulations.  Bayer will communicate with its employees, customers, suppliers, communities and the public to recognize and respond to their concerns and to improve their understanding of the health, environment and safety considerations related to Bayer's operations and products.  Bayer is committed to continually improving health, environment and safety performance in support of the guiding principles of the Responsible Care. initiative.\"\n\nResponsible Care. Initiative\n\nBayer Corporation is proud to actively participant in the Chemical Manufacturer's Association Responsible Care. initiative.  As a member of the Chemical Manufacturers Association, Bayer is committed to support a continuing effort to improve the industry's responsible management of chemicals.  Bayer pledges to operate its business according to the guiding principles as stated below.\n\nOur industry creates products and services that make life better for many people around the world - both today and tomorrow.  The benefits of our industry are accompanied by enduring commitments to Responsible Care. in the management of chemicals worldwide.  We will make continuous progress toward the vision of no accidents, injuries or harm to the environment and will publicly report our global health, safety and environmental performance.  We will lead companies in ethical ways that increasingly benefit society, the economy and the environment while adhering to the following principals:\n+ To seek and incorporate public input regarding our products and operations.\n+ To provide chemicals that can be manufactured, transported, used and disposed of safely.\n+ To make health, safety, the environment and resource conservation critical considerations for all new   and existing products and processes.\n+ To provide information on health or environmental risks and pursue protective measures for employees, the public and other k"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6586,
      "SummaryText": "ey stakeholders.\n+ To work with customers, carriers, suppliers, distributors and contractors to foster the safe use, transport and disposal of chemicals.\n+ To operate our facilities in a manner that protects the environment and the health and safety of our employees and the public.\n+ To support education and research on the health, safety and environmental effects of our products and processes.\n+ To work with others to resolve problems created by past handling and disposal practices.\n+ To lead in the development of responsible laws, regulations and standards that safeguard the community, work place and environment.\n+ To practice Responsible Care. by encouraging and assisting others to adhere to these principles and practices.\n\nCommunity Advisory Panel (CAP)\n\nBayer has an active CAP consisting of local residential and business neighbors, educators, local officials, environmentalists, medical professionals, and a representative from the South Carolina Department of Health and Environmental Control.  The CAP meets regularly to discuss safety and environmental issues and serves as a voice for the community to provide feed back to Bayer in relation to community matters.\n\nChemCare - Partnership for Chemical Safety \n\nChemCare is a partnership of industry, government agencies, emergency response organizations and community advisors in Berkeley, Dorchester and Charleston counties.  These organizations work together to share information and resources to promote safe handling and management of chemicals.  In addition, they encourage providing information about chemical safety to the public in an effort to inform neighbors about the responsible management of chemicals used by industries in the community, prevention plans and layers of protection to ensure a release does not occur and plans in place to minimize the off-site consequences of a chemical release.\n\nLocal Emergency Planning Committee (LEPC)\n\nBayer is a charter member of the Berkeley County Local Emergency Planning Com"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6586,
      "SummaryText": "mittee and has actively worked with the county and local agencies and response groups to provide information about Bayer and the chemicals we use on our site.  In addition, Bayer's site emergency plans have been integrated with the emergency plans of the county and local fire departments.  Bayer has participated in every disaster drill held annually by the LEPC.\n\nCompliance and Commitment to Safety\n\nAt Bayer Corporation, we are committed to changing the world with great care.  As part of this commitment, we work with the citizens of our community to help protect and improve the quality of life we all enjoy. Protection of our employees and neighbors is our highest priority, and that is why we have installed multiple safeguards to ensure that all chemicals are handled safely.  We also work closely with our suppliers, other companies, local officials and the public to maintain stringent safety and environmental programs and to minimize risks.  \n\nIn keeping with our commitment, Bayer has developed a risk management plan in compliance with guidelines established by the U.S. Environmental Protection Agency (EPA).  Under EPA guidelines, facilities that handle certain quantities of regulated chemicals must submit plans that show the consequences of hypothetical chemical releases.  Facilities must also outline their measures to reduce the risk of releases and minimize their effects.\n\nSeveral processes at the site are regulated by the OSHA Process Safety Management (PSM) requirements listed in 29 CFR Part 1910.119.  PSM and RMP complement each other in that PSM is concerned about the employee and RMP is concerned about the public and the environment.  The Bayer Bushy Park site is in full compliance with the PSM requirements.  \n\nIII. RMP REGULATED SUBSTANCES\n\nThree process areas already in compliance with PSM requirements must meet the requirements for the Risk Management Program listed in 40 CFR Part 68.  This plan includes Bayer's ammonia refrigeration system, the cyclohexyl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6586,
      "SummaryText": "amine storage and handling system and the methyl chloride storage and handling system.  Ammonia and methyl chloride are liquefied gases under pressure and cyclohexylamine is a liquid.  Each is regulated as a toxic substance.  The Bayer site does not have any flammables that require inclusion in the Risk Management Plan.\n\nBayer uses anhydrous ammonia as a refrigerant in the plant-wide refrigeration system.  Ammonia is a colorless gas with a strong pungent odor.  Exposure to ammonia can irritate the eyes, nose and throat.  Exposure to extremely high levels can result in a buildup of fluid in the lungs and can be life threatening.\n\nBayer uses cyclohexylamine primarily to manufacture an additive used in the rubber industry.  A small amount is also used for water treatment in the plant boilers.  Cyclohexylamine is a colorless liquid with an ammonia-like odor.  Exposure to cyclohexylamine can cause irritation of the respiratory system.  Exposure to extremely high levels can result in a buildup of fluid in the lungs and can be life threatening.\n\nBayer uses methyl chloride to make an intermediate product in the manufacture of paint pigments.  Methyl chloride is a colorless gas with a faint sweet odor.  Exposure to methyl chloride can cause headache, giddiness, drowsiness, and muscular incoordination.  Exposure to extremely high levels can result in respiratory failure and can be life threatening.\n\nIV. RELEASE SCENARIOS\n\nA worst case scenario is included in the plan for ammonia and alternative case scenarios (or more likely scenarios) are included in the plan for each of the three regulated substances.  \n\nThe ammonia worst-case scenario is based on the complete failure of the largest process vessel containing 36,200 pound of liquid ammonia.  A written operating procedure, high level alarm, and visual level display in the control room prevent the vessel from being operated with more than 36,200 pounds of liquid ammonia even though the vessel could contain as much as 42,500 po"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6586,
      "SummaryText": "unds.  The maximum distance for the most impacting hypothetical worst case release with no mitigating measures is 2.3 miles to the level of concern (LOC) or toxic end-point.  Several industrial, commercial, residential, public and military facilities are in the potential impact area.\n\nToxic end-point or Level of Concern (LOC)\n\nThe Emergency Response Planning Guideline 2 - Level of Concern (ERPG2-LOC) is the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or serious health effects, or symptoms which impair their ability to take protective action.  The release impact distance is the distance down wind to the ERPG2-LOC concentration.  The ERPG2-LOC for ammonia is 200 parts per  million (ppm).  The ERPG2-LOC for methyl chloride is 400 parts per million (ppm).\n\nThe Extremely Hazardous Substance Level Of Concern (EHS-LOC) is the airborne concentration 10 times safer than the concentration (estimated from toxicity data) that is immediately dangerous to life and health.  The release impact distance is the distance down wind to the EHS-LOC concentration.  The EHS-LOC for cyclohexylamine is 39 parts per million (ppm).\n\nAll scenarios evaluated used EPA's published model, RMPComp, to provide toxic end-point determinations based on an EPA published level of concern (LOC).  Other models did not provide satisfactory estimates for use in evaluating the maximum end-point distance.  Public and environmental protection requires conservative results.  All three substances were evaluated for the alternate scenario and the information is included in the plan.  \n\nMore-Likely Scenarios\n\nAnhydrous ammonia, methyl chloride and cyclohexylamine process systems are similar in function.  Each has a storage container or containers and a transfer system which includes transfer pump(s) and piping to deliver the material to an end use function.  The more likely scenario for each in"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6586,
      "SummaryText": "volves a breach in the integrity of the piping system.  A flange leak would constitute the most likely potential for a release of the regulated substance.  Most of the piping systems are constructed with welded pipe where a leak could not occur.  Flanged connections are used for pumps and critical control valves so they can be taken out easily when repair or replacement is necessary.\n\nThe alternative scenario is a hypothetical release that is more realistic than the worst-case scenario.  In this scenario, safety and emergency systems operate as expected, and plant personnel respond to take action to control and stop the release\n\nAmmonia scenario assumptions:\n\n+ Partial failure of the piping system containing ammonia liquid under pressure. \n+ Detection of ammonia by instruments or personnel in the area, shutdown of the ammonia supply equipment by remote control, and closure of valves by site personnel to stop the leak.\n+ Release during typical weather conditions experienced at the site.\n\nThe alternative release scenario for ammonia is based on 0.25 inch diameter hole in a flange gasket the would release 683 pounds of ammonia gas per minute.  The time to discovery and system shut down is based on a 10-minute release.  The distance to the toxic end-point is estimated to be 0.2 miles using EPA's RMPComp model.  No mitigating factors were included.  The impact area is slightly off site with no residential housing impact.\n\nCyclohexylamine scenario assumptions:\n\n+ Partial failure of a pipe containing cyclohexylamine liquid at ambient temperature.\n+ Detection of the leak by personnel who monitor the area, shutdown of the cyclohexylamine supply equipment by remote control, and closure of valves by site personnel to stop the leak.\n+ Release during typical weather conditions experienced at the site.\n\nThe alternative release scenario for cyclohexylamine (CHA) is based on a 0.25 inch diameter hole in a flange gasket that would release 652 pounds per minute of liquid CHA to a dik"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 6586,
      "SummaryText": "ed area with 576 square feet of surface area that limits the evaporation rate of CHA to 7.26 pounds per minute.  The time to discovery and system shut down is based on a 20-minute release.  The distance to the toxic end-point is estimated to be 0.1 mile using EPA's RMPComp model.  The dike is the only mitigating factor considered.  The impact area is within the site fence-line.\n\nMethyl chloride scenario assumptions:\n\n+ Partial failure of a pipe containing methyl chloride under pressure.\n+ Detection of methyl chloride from instruments in the area, shutdown of the methyl chloride supply equipment by remote control, and closure of valves by site personnel to stop the leak.\n+ Release during typical weather conditions experienced at the site.\n\nThe alternative release scenario for methyl chloride (MeCl) is based on a 0.25 inch diameter hole in a flange gasket that would release 596 pounds of MeCl gas per minute.  The time to discovery and system shut down is based on a 10 minute release.  The distance to the toxic end-point is estimated to be 0.2 miles using EPA's RMPComp model.  No mitigating factors were included.  The impact area is slightly off site with no residential housing impact.\n\nV. FIVE YEAR ACCIDENT HISTORY\n\nDuring the past five years, Bayer has not experienced any release of ammonia, cyclohexylamine or methyl chloride that requires listing in the RMP information we are submitting.  \n\nVI. EMERGENCY RESPONSE\n\nIncident and Emergency Guidelines\n\nBayer has multiple safeguards in place to ensure safe handling of ammonia, cyclohexylamine and methyl chloride and to prevent releases of these substances.  Our facility is prepared to handle emergencies such as hurricanes and tornadoes as well as chemical releases.  In the unlikely event a release occurs, we work to contain the release quickly and to minimize its impact on plant personnel and neighbors.  If a release occurs:\n+ Equipment that supplies the regulated substance would be shut down quickly by remote control.\n+"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 6586,
      "SummaryText": " The plant alarm would be sounded and the emergency communicated to plant personnel over the emergency alert system.\n+ Trained on-site emergency response teams would be activated and take prompt action to control and stop the release. \n+ Emergency response personnel would evaluate the extent and impact of the release\n+ If the release would have potential off-site impact, or outside assistance needed, local and county emergency response personnel would be notified and activated.\n+ Neighbors in the immediate area that might be affected would be notified and advised to take appropriate action.\n+ If necessary, Bayer specialists would be activated to perform computer modeling to estimate the area affected by the release. \n+ If needed, the site has immediate access to emergency resources and assistance from its corporate headquarters in Pittsburgh, Pa.\n\nTraining and Preparation\n\nBayer trains employees on the safe handling of ammonia, cyclohexylamine and methyl chloride and how to respond appropriately, should a release occur.  Some examples of our preparation and training include:\n+ Written procedures to handle all types of emergencies.\n+ Regularly scheduled safety training for operators and maintenance personnel responsible for the regulated substance system.\n+ Trained and experienced on-site emergency response teams ( Fire & Rescue, EMT's, and Hazmat ).\n+ Emergency planning with the local fire department and county emergency preparedness personnel.\n+ Planning and training with the Local Emergency Planning Committee (LEPC) and participation in annual drills.\n+ Routine testing of plant emergency response, alerting, and communications systems.\n+ Fully equipped emergency response vehicles (fire truck, ambulance, and hazmat truck).\n+ Emergency response personnel trained annually at nationally recognized schools.\n+ Certified Hazmat Team to respond to off-site transportation and distribution incidents.\n\nVII. RELEASE PREVENTION AND CHEMICAL - SPECIFIC PREVENTION \n\nAssuring Safe"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 6586,
      "SummaryText": " Operations\n\nBayer has established programs and activities to ensure safe operation of its ammonia, cyclohexylamine and methyl chloride systems.  Some examples include:\n+ Production and maintenance personnel are trained in the safe operation and repair of the system.\n+ Written operating and maintenance procedures are in place and updated regularly.\n+ Full in-depth hazard and operability studies are conducted by qualified personnel at least every 5 years.\n+ Complete safety reviews are conducted prior to making any changes to the operation or equipment.\n+ Health, environmental, and safety audits are conducted at least every 3 years to ensure compliance with regulations.\n+ Maintenance work is planned ahead of time and work permits issued to assure work is performed safely.\n+ Regular inspections of equipment, instruments, and piping are conducted to assure integrity of the system.\n+ Scheduled preventive maintenance work is performed to assure equipment is safe, reliable, and efficient.\n+ All incidents are investigated and actions are taken to prevent recurrence.\n\nDesigning for Safety\n\nBayer has installed multiple safeguards and systems to reduce the likelihood of ammonia, cyclohexylamine and methyl chloride incidents, including:\n+ Equipment is designed and built to national standards for each regulated substance service.\n+ Piping systems are all welded construction outside of containment areas.\n+ The systems are equipped with instrumentation that controls each operation within safe limits.\n+ Emergency shutdown systems are installed to immediately isolate each system and minimize upsets.\n+ Ammonia storage tanks, pumps, and compressors are curbed and located in a partial shed to reduce the rate of a release to the outside air.\n+ Cyclohexylamine unloading and transfer systems are diked to collect any spills and reduce the rate of a release to the outside air.\n+ Methyl chloride unloading and transfer systems are diked and located in a partial shed to reduce the rate of a re"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 6586,
      "SummaryText": "lease to the outside air.\n+ Ammonia detectors are installed at key locations to provide early warning of potential problems.\n+ Methyl chloride detectors are installed at key locations to provide early warning of potential problems.\n+ Operating personnel monitor each system regularly to identify any potential problems.\n+ Relief devices prevent overpressure of the each system and will safely discharge the regulated substance should an upset occur. \n\nVIII. IMPROVING SAFETY PERFORMANCE\n\nBayer has a continuing commitment to improving safety performance in all areas of concern.  Several planned improvements include:\n+ Installation of a ten meter weather monitoring tower to be able to predict in real time off-site consequences if a release should occur.  Completion expected by the first quarter of 2000.\n+ A new streamlined safety training program to improve the overall quality of the site's training programs.  The new program will further assure that the right people get the right training with high comprehension when required.  Expected completion and implementation by the third quarter of 2000.\n+ A review is underway of the Methyl chloride storage and handling system to change the way it is handled and to possibly reduce the quantity on site.  Expect recommendations by the end of the third quarter of 1999, with a follow-on project to implement the changes completed by the third quarter of 2000."
    }
  ]
}