{
  "FacilityID": 6627,
  "FacilityName": "City Of Wyoming Clean Water Plant",
  "FacilityStr1": "2350 Ivanrest Ave. SW",
  "FacilityStr2": null,
  "FacilityCity": "Grandville",
  "FacilityState": "MI",
  "FacilityZipCode": "49418",
  "Facility4DigitZipExt": "3402",
  "FacilityCountyFIPS": "26081",
  "LEPC": "Kent County LEPC",
  "FacilityLatDecDegs": "42.919611",
  "FacilityLongDecDegs": "-85.743833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "csmith@ci.wyoming.mi.us",
  "FacilityDUNS": 79283982,
  "ParentCompanyName": "City of Wyoming",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Dan Wolz",
  "OperatorStr1": "2350 Ivanrest Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Grandville",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49418",
  "OperatorZipCodeExt": "3402",
  "FTE": 36,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000084687",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-05 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2023-12-19 00:00:00",
  "DeRegistrationEffectiveDate": "2022-10-31 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.922222,
  "FRS_Long": -85.741944,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7954,
      "AltID": "Wastewater Treatment",
      "FacilityID": 6627,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8749,
          "ProcessID": 7954,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 8750,
          "ProcessID": 7954,
          "ChemicalID": 49,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8142,
          "ProcessID": 7954,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3439,
              "Process_NAICS_ID": 8142,
              "SafetyReviewDate": "1999-05-13 00:00:00",
              "PHA_Date": "1999-04-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-05-18 00:00:00",
              "TrainingReviewDate": "1999-04-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Hazmat",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-03-01 00:00:00",
              "EquipmentInspectionDate": "1999-03-01 00:00:00",
              "EquipmentTested": "Vacuum Regulators",
              "ChangeMgmtDate": "1998-12-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-01 00:00:00",
              "PreStartupReviewDate": "1999-05-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-19 00:00:00",
              "HotWorkPermitReviewDate": "1999-05-19 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-07 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 3923,
                  "PreventionProgram3ID": 3439,
                  "ProcessChemicalID": 8749
                },
                {
                  "PrimaryKey": 3924,
                  "PreventionProgram3ID": 3439,
                  "ProcessChemicalID": 8750
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6627,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-09 00:00:00",
    "ERTrainingDate": "1999-09-01 00:00:00",
    "CoordinatingAgencyName": "City of Wyoming Fire Department",
    "CoordinatingAgencyPhone": "6165307260",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6627,
      "SummaryText": "A. FACILITY DESCRIPTION AND NATURE OF REGULATED SUBSTANCES HANDLED \nThe primary business of this facility is the treatment of wastewater for a connected population of approximately 130,000.  The activity requires the use of chlorine gas as a disinfection agent and the use of sulfur dioxide gas as a dechlorination agent.  Both gases, in the form of liquid under pressure, are delivered to the facility via truck.  The gases are stored in isolated halves of a gas storage building in one ton steel cylinders.   The maximum amount of chlorine tons stored on site at one time is 15.  The maximum amount of sulfur dioxide tons stored is 4.  Chlorine and sulfur dioxide gases are distributed from the ton cylinders by piping through vacuum regulator systems to separate chlorinator and sulfinator rooms.  Chlorine gas is water injected under vacuum to create a solution, which can be fed to various points in the treatment system.  Sulfur dioxide is fed in similar manner but only to a point following the chorine disinfection point.   \n\nB. ACCIDENTAL RELEASE AND EMERGENCY RESPONSE POLICIES \nIt is the general policy of the City of Wyoming Clean Water Plant to take all precautions and preventative measures necessary to ensure against unplanned releases of any hazardous substances that might prove harmful, either to plant employees, or to persons in the vicinity of the plant facility. There are numerous structural and administrative safeguards in place, which are intended to prevent hazardous material releases. Structural elements and mechanical systems are subject to a rigorous inspection and preventative maintenance program to insure proper operating capabilities. Plant personnel receive extensive training concerning safe handling procedures for the chemicals they utilize in their work. In addition to safety policies unique to the Clean Water Plant, this facility is also subject to numerous safety policies and guidelines applicable to departments of the City of Wyoming in general. Th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6627,
      "SummaryText": "e general safety program policy for the City states; \" Procedures shall be in accordance with the approved practices incorporated in the rules and regulations of the State of Michigan, Department of Labor, Bureau of Safety and Regulation and National Safety Council \". Compliance with this edict is enforced via implementation of an active City safety program, administered by staff of the Human Resources Department. \n\nC. MEASURES FOR PREVENTING ACCIDENTAL RELEASES OF HAZARDOUS MATERIALS \nThe City of Wyoming Clean Water Plant is subject to two major regulatory programs, which address the prevention of accidents and injures from hazardous chemical releases. The first of these is the Process Safety Management Program (PSM), conducted under authority of the MIOSHA General Industry Rule 91. The PSM \nProgram requires comprehensive assessment and analysis of all chlorine and sulfur dioxide related processes. With the objective of ensuring that all systems are capable of functioning in a safe manner at all times. The second of these programs, the Hazardous Waste Operations and Emergency Response Program (HAZVWOPER) is conducted under authority of the MIOHSA Occupational Health Rules 325.52101 - 52137. The HAZWOPER Program requires development of a detailed plan outlining all steps, which will be undertaken in the event of a hazardous materials release and, which personnel will be responsible for various actions. A formal HAZWOPER Plan is currently in effect at the facility, and is managed through the Wyoming Fire department and Kent County. \n\nThere are a variety of structural and mechanical safeguards at the facility, which are designed to prevent the release of hazardous materials, and to mitigate the effects of any release that might occur. Security of the facility is enhanced by perimeter fencing and installation of a security surveillance system of the exterior areas of the premises. A chlorine gas detection system is in place to provide instant warning of any unexpected"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6627,
      "SummaryText": "chlorine release. \n\nD. EMERGENCY RESPONSE PREPARATIONS \nBecause of the quantity of chlorine and sulfur dioxide handled by this facility, it is subject to regulation under authority of Title III of the Superfund Amendments Reauthorization Act, also referred to as the \"Emergency Preparedness-Community Right- To-Know Act'. This law requires that the facility, working in cooperation with local governmental agencies and officials, must establish a formal plan for responding to off-site chemical emergency incidents. The facility has established such an emergency plan, through Kent County which is updated annually. The plan outlines the nature and quantity of hazardous products stored and used at the facility, the projected areas around the facility which would be impacted in the event of a release and protective actions that should be taken by public safety officials to ensure the safety of persons within the affected areas. The plan also contains detailed information regarding emergency contacts that are to be made in the event of a chemical release from the facility. \n\nIn addition to the plan noted above, the facilities emergency plans in response to the HAZWOPER program requirements are also of significance. Although the emergency response measures outlined in the facility's HAZWOPER plan are focused on protecting employees of the facility, the same measures are effective in preventing chemical releases to the exterior environment as well. \n\nE. FIVE-YEAR ACCIDENT HISTORY \nIn the five-year period proceeding the date of this plan, there have been no releases of hazardous substances from the facility, which have produced any off-site effects to persons or properties in the plant vicinity. \n\nF. HAZARDOUS MATERIAL ACCIDENTAL RELEASE SCENARIOS \nTwo hypothetical chlorine and sulfur dioxide release scenarios were considered in conjunction with this risk management plan. The first of these, the \"worst case\" scenario, involved the release of the entire contents of one one-ton cy"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6627,
      "SummaryText": "linder of chlorine within the facility over a ten-minute period of time. This scenario also assumed no mitigation of the release through the institution of either administrative or mechanical controls. Other assumptions include an air temperature of 77 degrees F, wind speed of 1.5 m/sec, atmospheric stability class F and an urban topography. Given these defined criteria, the calculated distance from the plant to the limits of the \"toxic end-point\" (i.e., the point at which chlorine concentrations would be such that persons could typically be exposed for periods of up to one hour without experiencing irreversible effects or other serious health symptoms that might impair an individual's ability to take protective action) is 0.90 miles. \n\nThe second situation considered was for an \"alternative\" scenario, that is one having a somewhat greater potential for actual occurrence than the 'Worst case' scenario cited previously. The specifications selected for modeling the \n\"Alternative\" scenario included the release of the entire contents of one one-ton cylinder of chlorine within the plant, due to a leaking fusible plug on the cylinder. It was assumed that the total duration of the chemical release would be 38 minutes and mitigation measures would include the release of product in an inclosed space, in direct contact with outside air. Climatic conditions projected for this scenario include an air temperature of 77 degrees F, wind speed of 3 m/sec, atmospheric stability class D and urban topography. Given these specifications, the calculated distance to the limits of the \"toxic end-point' from the plant is 0.1 miles. \n\nParameters and projected effects for both scenarios noted above were based a chemical release modeling utilizing the RMP Comp software as the instrument for All calculation. \n\nG. PROJECTED SAFETY ENHANCEMENTS \nAs of the date of this plan, the only proposed safety-related enhancement involves changes by the City's chlorine supplier to the cylinder in which it d"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6627,
      "SummaryText": "istributes it's product. Future chlorine cylinders will be equipped with a new style of valve incorporating Teflon components. These components will reduce possibilities for sticking valves, thereby reducing the possibilities for valve damage or breakage caused by over-torqueing. Effective July 1st, 1999, all shipments of chlorine cylinders provided by the City's supplier will be equipped with the new-style valves."
    }
  ]
}