{
  "FacilityID": 6639,
  "FacilityName": "Ruetgers Organics Corporation",
  "FacilityStr1": "201 Struble Road",
  "FacilityStr2": null,
  "FacilityCity": "State College",
  "FacilityState": "PA",
  "FacilityZipCode": "16801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42027",
  "LEPC": "Centre County LEPC",
  "FacilityLatDecDegs": "40.824444",
  "FacilityLongDecDegs": "-77.808333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "ruetgers-organics-corp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3008539,
  "ParentCompanyName": "Rutgers AG",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ruetgers Organics Corporation",
  "OperatorStr1": "201 Struble Road",
  "OperatorStr2": null,
  "OperatorCity": "State College",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16801",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mary Jo Smith",
  "RMPTitle": "EHS Manager",
  "FTE": 100,
  "OtherEPAFacilityID": "16801RTGRS201ST",
  "EPAFacilityID": "100000084231",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1986-05-07 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2004-06-21 00:00:00",
  "DeRegistrationEffectiveDate": "2004-06-17 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.82361,
  "FRS_Long": -77.80833,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "N/A",
  "_processes": [
    {
      "ProcessID": 7966,
      "AltID": "518",
      "FacilityID": 6639,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8155,
          "ProcessID": 7966,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8762,
          "ProcessID": 7966,
          "ChemicalID": 1,
          "Quantity": 26640.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508762,
          "ProcessID": 7966,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 7967,
      "AltID": "514",
      "FacilityID": 6639,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8156,
          "ProcessID": 7967,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8763,
          "ProcessID": 7967,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508763,
          "ProcessID": 7967,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6639,
      "SummaryText": "The R\\TGERS Organics Corporation State College, PA plant custom manufactures organic chemicals for a variety of industries including the agricultural, coatings and plastics industries.  The State College facility is located on a 44 acre site in State College, Pennsylvania.  The original plant was built in 1958 and has expanded over the years.   The product mix at the facility changes frequently due to the nature of the custom manufacturing business.\n\nThere are two chemicals currently used by the State College plant that are listed on the toxic substance list contained in the RMP regulations.  Both of these chemicals are present at the State College facility in amounts above the Threshold Quantity.  The two chemicals are formaldehyde and chlorine.\n\nFormaldehyde is handled at the facility in a 37% aqueous solution.  It is used as a raw material in the production of an agricultural product.  The aqueous solution, called formalin, is received via tank truck and is stored in an 8,000 gallon storage tank.\n\nChlorine is handled at the facility in one ton containers.  It is used as a raw material in the production of an agricultural product.   The facility has set a voluntary limit of six one ton containers on the plant site at one time.\n\nAccident Prevention Program\n\nR\\TGERS Organics Corporation company policy on accidental release prevention is to use multiple safeguards or \"layers of protection\" to minimize the likelihood of an accidental chemical release at its manufacturing facilities.  These \"layers of protection\" consist of safely designing, building or modifying facilities or equipment, training workers extensively, safely starting and restarting production operations, safely operating facilities and managing change, regularly inspecting and maintaining equipment and regularly reviewing and auditing plant systems.  \n\nThe first layer of protection consists of safely designing, modifying and building facilities or equipment.  Equipment design and installation are comple"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6639,
      "SummaryText": "ted per established design and construction standards such as the American Society of Mechanical Engineers, the National Fire Protection Association and the Chlorine Institute.  An initial hazard review is completed on the equipment design to check for possible problems.   Safety systems are designed into the manufacturing process to minimize the possibility of a chemical release or hazard.\n\nThe second layer of protection is training operators and contractors extensively.  New chemical operators complete a week of safety training before working in the plant.  Before a new process is started at the facility, operators are trained in proper operating procedures and process safety information.  The process training is updated every three years.  Training is reinforced by on the job training including evaluation by observation and demonstration.  Monthly safety training meetings are held to cover OSHA and EPA mandated topics.   Contractors receive safety orientation training before working at the State College facility.\n\nThe third layer of protection is safely starting and restarting plant operations. A pre-startup safety review is completed before a new process is started and after a major modification is made to a process to ensure all necessary work has been completed prior to process startup.   \nThe fourth level of protection is safely operating the production facility.  Detailed operating procedures are written for operators to follow and record necessary data and to detail safe operating limits for process parameters.  Fitness for duty is well defined through alcohol and substance abuse policies.  A management of change procedure is in place to control and evaluate changes before they are made to the operating procedures.\n\nThe fifth level of protection is regularly inspecting and maintaining the process equipment.  A preventative maintenance program is in place for process equipment.  Equipment is checked against manufacturer's specifications or recognized industr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6639,
      "SummaryText": "y standards to ensure it operates as designed.\n\nThe sixth layer of protection is regularly reviewing and auditing plant systems.  Process hazard analyses are redone every five years for each production process.  Plant systems are audited internally or externally at least once a year and action items are identified and tracked to ensure they are addressed.  Any accidents, incidents or \"near misses\" are documented and investigated to determine if corrective action is needed.\n\nFive Year Accident History\n\nThere have been no reportable quantity accidental releases of the RMP regulated substances from the RMP covered production processes in the past five years. \n\nWorst Case Scenarios\n\nIn accordance with the EPA Risk Management regulations, the worst case scenario estimated to result in the greatest distance to a specified toxic endpoint has been identified.   The worst case scenario consists of a release of 337 pounds of gaseous formaldehyde at an elevated temperature  from a reactor.  Using worst case weather conditions as specified by EPA, the distance to the formaldehyde toxic endpoint of 10 ppm is 2.4 miles.  These results are based on the EPA's Risk Management Program Guidance for Offsite Consequence Analysis.\n\nThis worst case scenario is very unlikely to occur because several layers of protection would have to fail simultaneously.  The steam valve to the reactor jacket would have to fail open and not be detected by the computer control system or chemical operator for several hours.  A safety interlock programmed in to the computer control system would have to fail allowing continued operation.   The rupture disk would have to fail on the reactor, venting excess pressure.  Finally, the rupture disk line, which is piped to a knockout tank would have to break apart outside of the production building allowing the release to atmosphere.     \n\nA second worst case scenario was identified for chlorine.  The worst case scenario was a instantaneous failure of a ton cylinder o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6639,
      "SummaryText": "f chlorine releasing 2000 pounds of chlorine to the atmosphere in one minute.   Using worst case weather conditions as specified by EPA, the distance to the chlorine toxic endpoint of 0.00087 mg/L is 1.8 miles.  These results are based on the ALOHA version 5.2.1 air dispersion modeling program.\n\nThis worst case scenario is also unlikely to occur since the ton cylinders that chlorine is stored in do not rupture instantaneously under normal storage conditions.   The cylinders are required to be hydrostatically tested periodically and are cleaned and inspected before being filled by the suppliers.  The cylinders are also inspected before being accepted for delivery.  Finally, the cylinders are stored in such a manner that they could not be ruptured by truck traffic or other vehicles.\n\nAlternate Release Scenarios\n\nTwo alternate release scenarios have been identified for formaldehyde and chlorine that would be more likely to occur.  The alternate release scenario for formaldehyde would be a pipeline break of a two inch line carrying 37% formaldehyde solution.   The release would occur over 10 minutes releasing approximately 38 pounds of formaldehyde solution to a paved area.  The \ndistance to the formaldehyde toxic endpoint of 10 ppm would be 0.85 miles assuming worst case weather conditions.   These results are based upon the EPA's Risk Management Program Guidance for Offsite Consequence Analysis.\n\nThe alternate release scenario for chlorine would be a leak in a chlorine gas supply line to a reactor.  The release would be a ten minute release of chlorine gas during a charge to a reactor at a rate of 4 pounds/minute.  The release would not be more than 10 minutes in duration since there is a chlorine detection system in the process area that would detect the chlorine and automatically shut off the charge from the vaporizer and the cylinder.  The total amount of chlorine released would be 40 pounds.   The distance to the chlorine toxic endpoint of 0.00087 mg/L would be 28"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6639,
      "SummaryText": "1 yards assuming worst case weather conditions.  These results are based on the ALOHA version 5.2.1 air dispersion modeling program.\n\nEmergency Response Procedures\n\nThe R\\TGERS Organics State College plant has a comprehensive emergency response plan in the event that an accidental chemical release does occur.  The facility has a written emergency plan as required by various regulations.   The plant alarm system is designed to notify plant employees in the event of a release. The plant staff employees are trained to the 40 hour HAZWOPER training level defined by OSHA and are EPA certified.  The rest of the plant employees are trained to the 24 hour HAZWOPER training level as defined by OSHA.  This training allows employees to actively stop releases and to take defensive actions to prevent spread of the release.   The training is reinforced by monthly training on various emergency response topics such as SCBA operation, spill cleanup and decontamination procedures.  \n\nOnce every three years a county wide drill is conducted at the R\\TGERS Organics State College site with the local fire department, EMS, Emergency Management Agency, Penn State HAZMAT team, local police, local hospital and the Centre County LEPC participating.  The drill is critiqued afterward to improve response activities.\n\nPlanned Safety Improvements\n\nThe R\\TGERS Organics State College plant is committed to continually improving the safety of its operations in accordance with the Chemical Manufacturer's Association's Responsible Care codes.   The plant is in the process of installing a new community warning system to alert plant neighbors in the event of a chemical release.  In addition, the plant will be supplementing Centre County LEPC's education efforts on Shelter in Place, particularly for the immediate plant neighbors."
    }
  ]
}