{
  "FacilityID": 6650,
  "FacilityName": "Monroe County Water Authority - Shoremont Facility",
  "FacilityStr1": "4799 Dewey Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Rochester",
  "FacilityState": "NY",
  "FacilityZipCode": "14612",
  "Facility4DigitZipExt": "2423",
  "FacilityCountyFIPS": "36055",
  "LEPC": "Monroe County LEPC",
  "FacilityLatDecDegs": "43.269444",
  "FacilityLongDecDegs": "-77.647778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Monroe County Water Authority",
  "Company2Name": null,
  "CompanyDUNS": 41290925,
  "Company2DUNS": 0,
  "OperatorName": "Monroe County Water Authority",
  "OperatorStr1": "475 Norris Drive",
  "OperatorStr2": "P.O. Box 10999",
  "OperatorCity": "Rochester",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14610",
  "OperatorZipCodeExt": "0999",
  "RMPContact": "Steven G. Gould, P.E.",
  "RMPTitle": "Dir. of Production & Water Supply",
  "FTE": 34,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000082215",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-04-16 00:00:00",
  "DeRegistrationEffectiveDate": "2019-03-18 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.26833,
  "FRS_Long": -77.64783,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 7980,
      "AltID": "Chlorine System",
      "FacilityID": 6650,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8169,
          "ProcessID": 7980,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 8778,
          "ProcessID": 7980,
          "ChemicalID": 62,
          "Quantity": 46000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 508778,
          "ProcessID": 7980,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6650,
      "SummaryText": "The Monroe County Water Authority (MCWA) Shoremont Facility has prepared a Risk Management Plan (RMP) in accordance with the requirements of Title 40 of the Code of Federal Regulations Section 68 [40 CFR 68].  The Shoremont Facility uses chlorine to disinfect the water supply before it is distributed to customers throughout Monroe County and beyond.  The facility receives chlorine in one-ton cylinders and typically stores between 4 and 15 cylinders at any given time (up to 23 cylinders maximum).  The chlorine is stored in a secured room, in which the cylinders are connected to the disinfection system.  The area is equipped with a Chlor-alert system which is designed to detect chlorine at or above 1 part per million (ppm).  In the event of a release from the system, the Chlor-alert system would activate an emergency caustic scrubber.  The scrubber is designed to reduce the chlorine emissions from the instantaneous release from a full one-ton cylinder to a maximum of 15 ppm at the scrubber outlet.\n\nIn 1996, the facility developed a prevention program and an Emergency Response Program as part of the Process Safety Management Plan (PSM) created to meet the requirements of 29 CFR 1910.119, developed by the Occupational Safety and Health Administration (OSHA).  MCWA contracted with an outside consultant to review and update the prevention program and emergency response plan to meet the requirements of RMP.  The Shoremont Facility is also an active participant in the Monroe County Local Emergency Planning Committee (LEPC) county-wide RMP task force.\n\nTo satisfy the requirements of 40 CFR 68 Subpart B, the Shoremont Facility conducted a worst-case release scenario using the dense gas modeling program DEGADIS.  In accordance with 40 CFR 68.25, the worst-case release scenario was modeled as the release of the entire contents of a one-ton cylinder over a ten-minute period inside an enclosure.  Since active mitigation cannot be considered for a worst-case release scenario, the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6650,
      "SummaryText": "emergency scrubber was not factored into this scenario.\n\nTo satisfy the  requirements of 40 CFR 68 Subpart B, the Shoremont Facility conducted an alternative release scenario using the dense gas modeling program DEGADIS.  The alternative release scenario was modeled as the release of chlorine from a transfer hose (copper whipline) which activates the emergency scrubber system.  The emergency scrubber system is designed to reduce the release of a full one-ton cylinder (2,000 pounds) of chlorine to safe levels at the scrubber outlet.  The scenario resulted in a release with an offsite endpoint, however, it did not affect offsite receptors.  \n\nThe prevention program was developed from the facility's existing Process Safety Management Program which addresses the required elements of the RMP Rule.  The sections were updated as necessary to meet and/or exceed  the requirements of the RMP Rule.\n\nThe MCWA Shoremont Facility has not experienced an accidental release of chlorine which resulted in deaths, injuries, evacuations, or even a minor release which affected either onsite or offsite receptors in its entire 32-year operating history.\n\nThe Shoremont Facility Emergency Response Program includes procedures for an accidental release from the chlorine system including initial response, the evacuation of facility personnel, and notification of offsite responders.  The program also includes a training program for all facility personnel.  The Emergency Response Plan has been coordinated with the Monroe County LEPC.\n\nThe MCWA Shoremont Facility has gone to great lengths to improve safety and promote awareness of the risks associated with chlorine.  Prior to the existence of the RMP regulations, MCWA added a chlorine sensor and emergency scrubber system, mandated health and safety training for all facility personnel, conducted regular emergency response and evacuation exercises for facility personnel, and is currently looking at more prevention methods to protect the safety of fa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6650,
      "SummaryText": "cility personnel and the community from the hazards associated with chlorine."
    }
  ]
}