{
  "FacilityID": 6741,
  "FacilityName": "Heathrow WTP",
  "FacilityStr1": "350 International Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Lake Mary",
  "FacilityState": "FL",
  "FacilityZipCode": "32764",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12117",
  "LEPC": "District 6 LEPC",
  "FacilityLatDecDegs": "28.764167",
  "FacilityLongDecDegs": "-81.362222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.co.seminole.fl.us",
  "FacilityEmailAddress": "rlala@co.seminole.fl.us",
  "FacilityDUNS": null,
  "ParentCompanyName": "Seminole County BCC",
  "Company2Name": null,
  "CompanyDUNS": 67834358,
  "Company2DUNS": null,
  "OperatorName": "Seminole County BCC",
  "OperatorStr1": "500 W. Lake Mary Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Sanford",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32773",
  "OperatorZipCodeExt": "7499",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000089744",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-06-30 00:00:00",
  "SafetyInspectionBy": "Seminole County Risk Management Safety",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": "1999-07-06 00:00:00",
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": "2003-05-09 00:00:00",
  "DeRegistrationEffectiveDate": "2003-04-30 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 28.764143,
  "FRS_Long": -81.362388,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8115,
      "AltID": "water treatment",
      "FacilityID": 6741,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8923,
          "ProcessID": 8115,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8305,
          "ProcessID": 8115,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3548,
              "Process_NAICS_ID": 8305,
              "SafetyReviewDate": "1998-06-11 00:00:00",
              "PHA_Date": "1999-08-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-06-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "vacuum regulators",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-06-11 00:00:00",
              "TrainingReviewDate": "1998-06-11 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-06-11 00:00:00",
              "EquipmentInspectionDate": "1998-06-16 00:00:00",
              "EquipmentTested": "Wallace & Tiernan Acutec 35 Gas Dect.",
              "ChangeMgmtDate": "1998-06-11 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-17 00:00:00",
              "PreStartupReviewDate": "1998-06-11 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-06-11 00:00:00",
              "HotWorkPermitReviewDate": "1998-06-11 00:00:00",
              "ContractorSafetyReviewDate": "1998-06-11 00:00:00",
              "ContractorSafetyEvalDate": "1998-06-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4040,
                  "PreventionProgram3ID": 3548,
                  "ProcessChemicalID": 8923
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6741,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-23 00:00:00",
    "ERTrainingDate": "1998-06-11 00:00:00",
    "CoordinatingAgencyName": "Seminole Co. Dept. of Public Safety",
    "CoordinatingAgencyPhone": "4073224795",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6741,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAs per permitting requirements of flordia DEP, this facility is only manned for 3 hrs. daily.\n\nAccidental Release Prevention and Emergency Response\n\nAll Seminole County treatment and emergency response facilities adhere to the rules and regulations set forth by Federal, State and Local committees (RMP, PSM, District 6 LEPC and Seminole County Public Safety Emergency Management Plan in compliance with state statue chpt. 252 and EPA Emergency Response Plan requirements). This document provides guidelines to ensure the health and safety of our employees and the general public where potential releases of chlorine may occur when working with chlorine cylinders. Facility personnel during routine maintenance and when there is an unusual occurrence that could threaten human health, the environment and property will implement the provision of these guidelines and those set forth in Appendix 6 of the Process Safety Management Program. This document will be reviewed and updated as needed, and at least annually.\n\n\nRegulated Substances\n\nChlorine is the only RMP regulated substance on site at a Seminole County treatment facility. Chlorine is one of the most necessary and most dangerous chemicals used for water and wastewater treatment. In those cases where chlorine gas is supplied from one-ton chlorine containers or 150-lb. cylinders with an excess of 1,500 lbs. stored on-site; the chlorine supply system must comply with the requirements of 29 CFR 1910.119 - Process Safety Management, and 2,500 lbs. for Risk Management Program, of Highly Hazardous Chemicals.\n\n\nWorst-case Release Scenario and the Alternative Release Scenario\n\nFor the worst-case and alternative release scenario, please refer to sections 2 and 3 of this document. To establish the population counts within the endpoint, information from the Seminole County Master Plan was used, 2.5 persons per household and 3 houses per acre.\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prev"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6741,
      "SummaryText": "ention Steps\n\nSeminole County operates two (2) wastewater treatment facilities and ten (10) water treatment facilities. The County employs two types of systems for the injection of chlorine into water and wastewater -- vacuum feed and direct feed. Seminole County operates two (2) wastewater treatment facilities and ten (10) water treatment facilities. The process includes the Chlorine Supply and distribution system from the ton and 150-lb. cylinders up to the point the chlorine solution is dispersed into the Contact chamber where the chlorine is dissolved. At this point the potential for a release of highly hazardous material as defined by OSHA is no longer a concern. A vacuum feed system uses an automatic switchover connection so that up to four cylinders is 'on-line' at a time. When the chlorine is depleted from the cylinders on one side of the switchover connection the vacuum draw is automatically switched over to draw chlorine gas from the other side. At this time the empty cylinders can be replaced. In this way, chlorine is continuously available to the solution feed system. A vacuum feed system has added safety since the exposed piping from the cylinder to the flow proportional chlorinator is under a vacuum and will not allow the release of chlorine in the event of a leak in this piping.\n\nIn a vacuum system chlorine gas is drawn under vacuum from a pressurized cylinder containing a combination of pure chlorine liquid and chlorine gas through a solution feeder, which controls the rate of application. The injector in the chlorine feed system dissolves chlorine gas into water, which is then injected into the water being treated. Seminole County typically uses a flow-proportional chlorinator that adjusts the chlorine addition based on the flow exiting the chlorine contact chamber (for wastewater facilities) or the flow through the on-site water piping (for water facilities). Monitoring the residual prior to exiting the plant allows for minor adjustments to control"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6741,
      "SummaryText": "SCBA be worn but is not required to have face mask donned unless assisting in the actual disconnecting or reconnecting of chlorine cylinders.  Both operators will work together in the moving of empty cylinders and their replacement with full cylinders on the weight scales. A SCBA must be worn but masks do not have to be donned during these operations. The operators must ensure that cylinder covers are in place and secure during movement of chlorine cylinder.\n\n\nFive-Year Accident History\n\nThere have been no reportable accidents at a Seminole County facility in the past 5 years.\n\n\nEmergency Response Program\n\nThe chlorine feed and storage rooms are equipped with chorine gas detectors, which are connected to an alarm. The detectors are mounted low to the ground since chlorine gas is denser than the air and will sink when released to the atmosphere. The detector will sound the alarm even if low airborne concentrations of chlorine gas are detected.  A Central alarm company that immediately notifies the Fire Department and Hazmat teams when a leak occurs monitors the alarm systems. The Hazmat will refer to Seminole Counties EMP for public notification.  Chorine feed rooms and storage facilities should be kept cool and well ventilated. Chlorine cylinders should be protected from direct sunlight to prevent chlorine gas expansion in the tank, which can result in over pressurizing of the cylinder causing leaks or rupturing of the cylinder.\n\nPlanned Changes to Improve Safety\n\nAt Seminole County, we are currently researching new methods for insuring the safety of our employees and the public. At this time, a new water treatment plant is being built with a Sodium Hypochlorite generator that will produce a 0.8% solution (bleach). If this system proves to be efficient and cost effective, all future projects will implement this process, thus eliminating the presence of chlorine gas at the plant locations. Another item that will be installed is an automatic valve shut off system tha"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6741,
      "SummaryText": "t will be tied into the chlorine leak detector system. If there is a leak detected, this will automatically close all valves on any chlorine cylinder that is on-line or in the stand-by mode. The installation of this product should be completed countywide by September of 1999."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6741,
      "SummaryText": "chlorine addition through the flow-proportional chlorinator.  A direct feed system operates similarly to a vacuum system except it utilizes the pressure from the chlorine tank to feed the chlorine injectors. This system is more dangerous since exposed piping from the tank to the flow proportional chlorinator is at risk of a chlorine release in the event of a leak.\n\nChlorine storage and Handling:\nTo provide chlorine for disaffection of water and wastewater, Seminole County uses chlorine gas. Chlorine gas is stored in one-ton or 150 lb. cylinders. One-ton chlorine gas cylinder rest on trunnions, which are secured to the floor and allow easy rotation of the containers to correctly position the outlet valves. The 150 lb. cylinders are stored standing upright and secured to the wall. One ton gas/liquid chlorine containers are fabricated to DOT specifications as large steel welded tanks or cylinders. The average one-ton container is about 30 inches in outside diameter and about 82 inches in length. Average tare weight is 1500 pounds; average gross weight is about 3,500 pounds, leaving 2,000 pounds net weight. Each end of a ton container is concave, with one end equipped with two valves protected by removable bonnet housing.  The valves are connected to education pipes located inside the container. The valves must be aligned vertically so that the upper valve is used to withdraw gaseous chlorine from above the liquid level in the container. The lower valve is for liquid withdrawal and is not to be used.  There are six (6) fusible metal plugs in a one-ton container, three (3) on each end. These serve as an over-pressure relief device. The internal pressure of the container is equal to the vapor pressure of liquid chlorine, which varies with ambient temperature. A container exposed to ambient temperatures of 0'F to100'F will have an internal pressure ranging from 14 psig. to 143 psig. In the event of a fire or overheating, at a temperature of about 160'F and a resulting vap"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6741,
      "SummaryText": "or pressure of approximately 320 psig, the fusible plugs will melt and release the contents of the container to the atmosphere. The DOT hydrostatic pressure specification of the container is 500 psig.  One-ton cylinders are too large and heavy to be moved by hand. Therefore chlorine storage rooms for these cylinders are equipped with two-ton hoists. Moving full cylinders exposes the area to the potential for a large-scale chlorine leak. Consequently, prior to each use the hoist should be thoroughly inspected according to the manufacturer's recommendations. No County employee or other person shall operate the hoist without proper training.\n\n\nChlorine Cylinder Change-out:\nThe most dangerous situation with chlorine handling with the greatest potential for accidental release is during cylinder switchover. Three operators, who are at least C level certified by the Department of Environmental Protection in treatment plant operations, are required to be present at all times whenever connecting or disconnecting chlorine cylinders. Two operators are at the site where the work is to be conducted and the third is standing by via radio at a separate location with a telephone. The secondary operator will perform the task and the shift operator is the designated backup should an emergency arise. The shift operator will assist in the transporting of empty and full cylinders to their stations with the cylinder covers (bonnets) in place.  A shift operator will supervise the tasks of disconnecting and reconnecting of chlorine cylinders. This requires the operator actually performing the disconnecting and reconnecting tasks to be breathing with self-contained Breathing Apparatus (SCBA) and wearing protective chemical gloves and long-sleeved shirt or coveralls before beginning and during this work.  The additional operator will stand by upwind, observing work being performed from a safe distance within visual contact and ready to assist should an emergency arise. This requires that a"
    }
  ]
}