{
  "FacilityID": 6786,
  "FacilityName": "Harvey Wastewater Treatment Plant",
  "FacilityStr1": "2343 Pailet Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Harvey",
  "FacilityState": "LA",
  "FacilityZipCode": "70058",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22051",
  "LEPC": null,
  "FacilityLatDecDegs": "29.877778",
  "FacilityLongDecDegs": "-90.066667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Jefferson Parish Department of Sewerage",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "J.P. Department of Sewerage",
  "OperatorStr1": "1221 Elmwood Blvd",
  "OperatorStr2": "Suite 803",
  "OperatorCity": "Jefferson",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70123",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000086907",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-09-20 00:00:00",
  "DeRegistrationEffectiveDate": "2011-09-12 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.877778,
  "FRS_Long": -90.066667,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8164,
      "AltID": "Disinfection",
      "FacilityID": 6786,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 8972,
          "ProcessID": 8164,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8355,
          "ProcessID": 8164,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 4186,
              "Process_NAICS_ID": 8355,
              "SafetyReviewDate": "1999-02-02 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-02-02 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-02 00:00:00",
              "TrainingReviewDate": "1999-02-02 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-02 00:00:00",
              "EquipmentInspectionDate": "1999-02-02 00:00:00",
              "EquipmentTested": "chlorinators, injectors, detectors",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4331,
                  "PreventionProgram2ID": 4186,
                  "ProcessChemicalID": 8972
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6786,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-02 00:00:00",
    "ERTrainingDate": "1999-02-02 00:00:00",
    "CoordinatingAgencyName": "J. P. Emergency Management Dept.",
    "CoordinatingAgencyPhone": "5043495360",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 6786,
      "SummaryText": "submit the Risk Management Plan (RMP) to the appropriate agency by\n  June 21, 1999.  The RMP is a summary of the Program, and is located in Section 12. The RMP will\n  be submitted electronically using EPA's RMP Submit software.\n\n  Harvey Wastewater Treatment Plant: LAN# 30333"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 6786,
      "SummaryText": "Executive Summary\n\n  This document was developed to comply with the Environmental Protection Agency's (EPA's)\n  Risk Management Program II, under Section 112 (r) of the Clean Air Act (CAA) Amendments of\n  1990, 40 CFR Part 68. An outline of the Risk Management Program is provided in Figure ES-1. \n  The disinfection process (i.e., chlorine system) is covered under this regulation at the Jefferson\n  Parish Harvey Wastewater Treatment Plant (WWTP).\n\n  To meet the regulation requirements, this binder contains useful information on the chlorine\n  system. The technical information herein may be used as a training reference in initial and\n  recurring operator and maintenance training. Training on process fundamentals, operations, and\n  maintenance, coupled with the recommended process modifications discussed below, will reduce the potential  hazards to plant personnel and the surrounding community. An Emergency Response Program and an Incident Investigation Program are included. These two programs should be an integral part of both initial and recurring training.\n\n  A Risk Management Plan (RMP), in the format required by the EPA, is included at the end of the main body of this\n  document.  It consists of a summary of data elements as required by EPA for inclusion in a\n  public access database. The RMP is intended to inform the public of the Harvey WWTP's\n  proactive stance toward protection of the environment and the surrounding community. \n  \n  Hazard Assessment\n  The Hazard Assessment is comprised of a Worst Case and Alternative Release Scenario for the\n  chlorine system, as well as a 5-Year Accident History for the same. The Hazard Assessment was\n  conducted as an initial screening procedure as part of determining which Program Level (I, II, or\n  III) the Harvey WWTP falls.  Residences lie within the EPA-defined endpoint concentrations of\n  the plant's Worst-Case releases. Therefore, the plant is ineligible for Program I.  The Harvey\n  WWTP is operated by public perso"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6786,
      "SummaryText": "nnel and therefore excluded from Program III.  The Harvey\n  WWTP is included in Risk Management Program II.  The Hazard Assessment is provided in\n  Sections 1 through 3.\n\n  Worst Case Scenario\n  The Worst Case Scenario is defined as a ton container (2,000 pounds) of chlorine being released\n  by a catastrophic event within a 10 minute duration.  This scenario was developed and modeled\n  using the EPA approved RMP Comp model. The toxic endpoint for chlorine was determined to\n  be 1.3 miles by RMP Comp at the 3 ppm concentration specified by the EPA.  It should be noted\n  that at this concentration, a person may be exposed for up to one hour without suffering\n  permanent injuries (ERPG-2).\n\n  Alternative Release Scenario\n  The Alternative Release Scenario (ARS) of chlorine was also modeled using RMP Comp. An\n  estimation of approximately 348 pounds of chlorine gas released was derived from the scenario\n  of a flexible connection failure.  The toxic end point for the ARS was determined to be 0.30 miles\n  by RMP Comp.\n\n  5 Year Accident History\n  No accidents have been reported in the last five years.\n\n  Management Program\n  The Management Program consists of the Document Management System described below:\n\n  Document Management System\n  A Document Management System was established to attribute responsibility for the\n  development, implementation, and maintenance of the Risk Management Program. The\n  Program must be updated every three years, or any time a covered process undergoes a physical\n  or administrative modification.  The Document Management System is largely a function of the\n  Risk Management Program Team, described below in Table ES-1.\n\n  Risk Management Program Team\n  Table ES-1 lists the employees responsible for the Risk Management Program development,\n  implementation, and maintenance. The Plant Superintendent has the ultimate responsibility.\n\n  Prevention Program\n  The Prevention Program is more appropriately entitled the Accidental Release\n  Prevention"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6786,
      "SummaryText": "Program.  It is comprised of Safety Information, Hazard Review, Operating\n  Procedures, Training, Maintenance, Incident Investigation, and Compliance Audit\n  procedures.  Each has an entire chapter devoted to it in this RMP, and is described in\n  more detail below.\n\n  Safety Information\n  Safety Information is divided between Chemical Safety Information and Process\n  Safety Information.  Each is briefly described below.\n\n  Chemical Safety Information\n  Comprehensive chemical data is provided in this section to include;  regulatory reporting action\n  thresholds, health hazard and chemical exposure limitations, as well as physical properties of\n  chlorine. This information was compiled from numerous sources, and is intended to be a one-stop source for the reader seeking data on this compound. The physical data will provide useful\n  information in the inevitable event the plant process is modified, thereby requiring revisited\n  dense gas dispersion modeling.  It is also imperative that plant operators and managers are\n  appraised of the potential health hazards and exposure limits associated with this chemical.\n\n  Process Safety Information\n  Process Safety Information was meticulously compiled on each system studied. Basic\n  specifications on each process are included in this document for easy reference. Details such as\n  Maximum Intended Inventory, Safe Upper and Lower Temperatures, Safe Upper and Lower\n  Pressures, and Codes and Standards Used to Design, Build and Operate the Process are\n  provided in this section. Used as a training reference, together with the Process Schematics, the\n  reader will readily understand the function and operation of the plant chlorine system.\n\n  Hazard Review\n  A Hazard Review was also conducted for the chlorine system.  The Hazard Review technique\n  used was a hybrid Hazard and Operability Study (HAZOP), in the form of a \"What If\" analysis.\n  The \"What If\" was developed from HAZOP experience at similar chlorine systems. The Hazard"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6786,
      "SummaryText": "Review team consisted of plant management, process operating and maintenance experts,\n  outside process design engineers, and consultants knowledgeable in the Hazard Review process\n  itself.\n\n  Recommendations\n  The result of the Hazard Review is a set of recommendations for the plant to implement.  Rule\n  40 CFR 68.50 requires Jefferson Parish to ensure that problems identified are \"resolved in a\n  timely manner.\"  For those items that can not be promptly resolved, it is recommended that a\n  schedule be developed that addresses those issues, with responsibility for each assigned to the\n  appropriate personnel.  \n\n  Please note that these are not the recommendations of Camp Dresser & McKee, Inc.  Rather,\n  they are recommendations developed by the Hazard Review Team with a consensus from all\n  team members.  CDM's role was to facilitate the Hazard Review process. \n  Recommendations are summarized below:\n  ~ Examine scrubber as possible chlorine release mitigation, and/or use of alternative\n      disinfectants.\n  ~ Expand chlorine storage facility to contain an additional 4-8 cylinders.\n  ~ Place redundant chlorine detectors in both rooms.\n  ~ Consider installation of panic hardware on chlorine room doors.\n  ~ Place a chlorine exhaust fan switch outside of the chlorine room.\n  ~ Label piping with contents and flow arrows.\n  ~ Add gate in the southeast portion of the plant for emergency escape purposes.\n\n  Operating Procedures\n  Basic chlorine system operating procedures have been developed and documented for the\n  facility. They provide system descriptions, specifications, and operating procedures for the\n  chlorine gas system. Procedures include Start-up, Shutdown, Normal, Abnormal, and\n  Emergency Operation. Also included are Troubleshooting Procedures.\n\n  Training \n  Training is required by the EPA to be included in the Risk Management Program. A program\n  has been developed with guidelines on how to conduct regular and structured plant training.\n  Training Record"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6786,
      "SummaryText": "Forms are included with the Program for the required documentation.\n  Additionally, a Training Record has been compiled and included for all affected personnel\n  associated with the covered processes.\n\n  Maintenance\n  Basic chlorine system maintenance procedures have been developed with associated\n  documentation forms. Sound preventive maintenance will reduce potential hazards to personnel\n  onsite, as well as to the off-site public.  In the event of an inspection or compliance review, state\n  and federal regulators will request to see documentation and record keeping associated with the\n  Maintenance Program. \n\n  Incident Investigation\n  An Incident Investigation Program has also been developed. The EPA has established strict\n  guidelines to follow in the aftermath of any release involving the chlorine system. The Incident\n  Investigation Program outlines key milestones that must be accomplished within 24 hours of\n  any covered incident, and the actions that must occur subsequently. Ultimately, it is desired that\n  the plant learns from the incident and takes action to prevent similar incidents in the future.\n  Incident Investigation Report Forms are included, and must be maintained for a minimum of\n  five years after each incident.\n\n  Compliance Audits\n  Internal Compliance Audits must be conducted every three years to verify compliance with the\n  programs and procedures contained in this document. The Plant Manager must certify that the\n  Risk Management Program team has evaluated compliance with the provisions of the Program,\n  and verify that the procedures and practices are adequate and are being followed. Audit Report\n  Forms are provided, the two most recent of which must always be maintained. This means that\n  in the year 2006, the Compliance Audit Report for the year 2000 may be discarded.\n\n  Emergency Response Program\n  The Emergency Response Program is included as part of the Risk Management Program, in case\n  a significant release ever occurs. As in a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6786,
      "SummaryText": "ll the above programs, it is important to review this\n  program regularly. The Rule, 40 CFR 68.95 requires training for all employees \"in relevant\n  procedures\" of the Emergency Response Program.\n  It is recommended that training on the specific plant safety procedures take place upon initial\n  employment and every year thereafter, as with most of the other RMP training programs.  Other\n  training recommendations, i.e., OSHA 8, 24, and 40 hour training are discussed in the\n  Emergency Response Program as appropriate to the level of response.\n\n  Risk Management Plan\n  A copy of the Risk Management Plan (EPA Submittal) is provided in Section 12.  As stated\n  previously, this document is public information.  Following submission to the EPA, the\n  information will be uploaded on a public-access database.  Only the Executive Summary and the\n  Risk Management Plan - Section 12 of the Harvey WWTP Risk Management Program must be\n  made available to the public. \n\n  Summary of Action Items for the Harvey Wastewater Treatment Plant\n  The RMP Rule, 40 CFR 68.42 requires that details of all accidental releases be recorded from this\n  date forward.  The format details are provided in Sections 2 and 10.\n  The RMP Rule, 40 CFR 68.15 requires that the Document Management System (e.g., the RMP\n  Team) be updated anytime personnel changes or administrative changes are made that would\n  affect the lines of authority or responsibility for maintaining the RMP at the Harvey WWTP. The\n  format details are provided in Section 3.\n  The RMP Rule, 40 CFR 68.54 requires that each employee presently operating a process, and\n  each employee newly assigned to a covered process be trained or tested competent in the\n  operating procedures.  As an alternative, Jefferson Parish may certify in writing that the\n  employee has the required knowledge, skills, and abilities to safely carry out the duties and\n  responsibilities as provided in the operating procedures.  Training documentation forms are\n  pro"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6786,
      "SummaryText": "vided in Section 8.  CDM facilitated the development of operating procedures for the facility,\n  and they are provided in Section 6.  These operating procedures may be used as training guides\n  as well. \n  The RMP Rule, 40 CFR 68.56 also requires training on the plant maintenance procedures. \n  Maintenance guidance is provided in Section 7.  Jefferson Parish must train or cause to be\n  trained each employee involved in maintaining the on-going mechanical integrity of the process. \n  To ensure that the employee can perform the job tasks in a safe manner, each such employee\n  must be trained in the hazards of the process, in how to avoid or correct unsafe conditions, and\n  in the procedures applicable to the employee's job tasks.  Refresher training on operating and\n  maintenance procedures must be provided every three years. Training documentation forms are\n  provided in Section 8.\n  The RMP Rule, 40 CFR 68.60 requires incident investigations not later than 24 hours following\n  each incident. That guidance is provided in Section 9.\n  The RMP Rule, 40 CFR 68.58 requires Jefferson Parish to certify compliance with RMP Accident\n  Prevention Program provisions at least every three years to verify that the procedures and\n  practices developed under the rule are adequate and are being followed.  That guidance, along\n  with Compliance Audit forms, is provided in Section 8.\n  The Rule, 40 CFR 68.95 requires training for all employees \"in relevant procedures\" of the\n  Emergency Response Program.  It is recommended that training on the specific plant procedures\n  take place upon initial employment and every year thereafter, as with most of the other RMP\n  training programs.  Other training recommendations, i.e., OSHA 8, 24, and 40 hour training are\n  discussed in the Emergency Response Program as appropriate to the level of response. The\n  Emergency Response Program is discussed in Section 11.  Training documentation forms are\n  provided in Section 10.\n  Jefferson Parish must"
    }
  ]
}