{
  "FacilityID": 6846,
  "FacilityName": "Tamarack Farms Dairy Inc.",
  "FacilityStr1": "1710 Tamarack Drive",
  "FacilityStr2": null,
  "FacilityCity": "Newark",
  "FacilityState": "OH",
  "FacilityZipCode": "43055",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39089",
  "LEPC": null,
  "FacilityLatDecDegs": "40.038889",
  "FacilityLongDecDegs": "-82.461111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6999528,
  "ParentCompanyName": "The Kroger Company",
  "Company2Name": null,
  "CompanyDUNS": 6999528,
  "Company2DUNS": 0,
  "OperatorName": "The Kroger Company",
  "OperatorStr1": "1014 Vine Street",
  "OperatorStr2": null,
  "OperatorCity": "Cincinnati",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45202",
  "OperatorZipCodeExt": "1100",
  "RMPContact": "Paul Roberts",
  "RMPTitle": "H.R. Regulatory Compliance",
  "FTE": 205,
  "OtherEPAFacilityID": "43055HKRG1710T",
  "EPAFacilityID": "100000090126",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.04073,
  "FRS_Long": -82.46172,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8239,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 6846,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8430,
          "ProcessID": 8239,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9063,
          "ProcessID": 8239,
          "ChemicalID": 56,
          "Quantity": 12500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509063,
          "ProcessID": 8239,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6846,
      "SummaryText": "RM PLAN EXECUTIVE SUMMARY\n\nA.   Accidental Release Prevention and Emergency Response Policies\n\nTamarack Farms Dairy recognizes management's responsibility in protecting its employees, the public, the environment, equipment, and property.  The safety and health of all personnel are very important.  The control of accidents has been and will continue to be a basic responsibility of all personnel in the Newark facility.\n\nTo accomplish the company's goal in preventing accidents, the facility has established a Plant Safety Program.  The objectives of the Plant Safety Program are to: maximize safety performance, eliminate human suffering and the economic burden resulting from injuries and accidents, and reduce losses associated with damage of property.\n\nOne of the activities associated with the Plant Safety Program has been the development and implementation of accidental release prevention and emergency response programs which are designed to comply with OSHA's Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, 29 CFR 1910.119), and EPA's Risk Management Program (RM program) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR Part 68).  Mr. Frank Jaen, Plant Engineer, is responsible for implementation of the Risk Management Program.\n\nThe purpose of the accidental release prevention and emergency response programs is to prevent the occurrence, and minimize the consequences of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs help prevent accidental fatalities, injuries and illnesses, environmental impacts, and avoid physical property damage.\n\nThe accidental release prevention and emergency response programs help prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as nec"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6846,
      "SummaryText": "essary.  They are also communicated to and accepted by all employees at the facility.\n\nIn addition to the Plant Safety Program, Tamarack Farms Dairy follows these  corporate safety guidelines:\n     Employee Handbook Plant Safety Rules\n     Kroger Company, Contractor Safety Rules\n     Kroger Company, Safety Inspections and Abatement Plans\n     Safety Process Improvement Team (\"Preventers\")\n     Kroger Manufacturing Safety Key Element Assessment & Management\n     Behavioral Accident Prevention System Steering Committee (\"RAINBO\")\n\n\nB.   Stationary Source and Regulated Substances Handled\n\nTamarack Farms Dairy is part of the  Kroger Company. The facility processes fluid milk and culture products.  The facility operates an ammonia refrigeration system to provide cooling and capabilities.  The amount of anhydrous ammonia (CAS #7662-41-7) contained in the system is in excess of 10,000 pounds.  The maximum inventory in the system is approximately 12,500 pounds.  Since an ammonia release from the system could pose a risk of offsite public and environmental impact and the system is regulated under the OSHA PSM standard (29 CFR 1910.119), the system is subject to the Program 3 requirements of the EPA's RM program.\n\n\n\n\nC.   Summary of Worst-Case and Alternative Release Scenarios\n\nThe worst-case release scenario at the Tamarack Farms Dairy facility involves the release of 12,500 pounds of ammonia over a 10 minute period due to the failure of the high pressure receiver.  This quantity represents the maximum capacity of the tank.  Under worst-case weather conditions, ammonia could travel 1.5 miles before dispersing enough to no longer pose a hazard to the public. This distance has been calculated based on the method provided in EPA's Risk Management Program (40 CFR 68) Guidance for Ammonia Refrigeration.\n\nThe worst-case release scenario is unlikely for the following reasons:\n\n         The worst-case weather conditions which were used for this scenario are not typical;\n         Industry standards were followed "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6846,
      "SummaryText": "for the manufacture and quality control of the tank; \n         The tank is located in an enclosed area that could help to contain such a release;\n         The tank is located in a low traffic area within the engine room which minimizes the possibility of  loss of containment due to vehicular impact (e.g., from forklifts etc.);\n         Ammonia is not corrosive in this service;\n         An ammonia detector which is tied to emergency ventilation fans is located near the tank in the engine room;\n         Pressure safety valves limit operating pressure in the vessel;\n         The facility has a preventive maintenance program in place to maintain the on-going integrity of vessels; \n         The facility has a training program designed to ensure that the system is operated by qualified personnel; and,\n         The facility emergency response procedures enable trained personnel to respond quickly to isolate any potential releases.\n\nThe alternative release scenario at the Tamarack Farms Dairy facility involves the release of 1,668 pounds of ammonia over a 60 minute period through a defective pressure safety valve (PSV) which lifts to relieve high system pressure but fails to reseat properly.  Under alternative release weather conditions, ammonia could travel 0.1 miles before dispersing enough to no longer pose a hazard to the public.  This distance has been calculated based on the method provided in EPA's Risk Management Program (40 CFR 68) Guidance for Ammonia Refrigeration.\n\nThe alternative release scenario is unlikely for the following reasons:\n\n         Industry standards were followed for the manufacture and quality control of the pumps;\n         Ammonia is not corrosive in this service;\n         The facility has a preventive maintenance program in place to maintain the on-going integrity of the pumps;\n         The facility has a training program designed to ensure that the system is operated by qualified personnel; and,\n         The facility emergency response procedures enable trained personnel to respond quickly to isolate potential releases "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6846,
      "SummaryText": "from any leaking equipment.\n\nD.   Description of the Accidental Release Prevention Program\n\nThe prevention program consists of the following elements:\n\n         Employee Participation:  This program involves the employees in establishing and implementing the program.  Employees are also to be involved when a process hazard analysis is conducted.  The program also ensures that all employees have complete access to the program.\n\n         Process Safety Information: Written information has been collected which enables the employees to identify and understand the potential hazards in the system. The written information includes the ammonia MSDS and a description of the design of the ammonia refrigeration system.\n\n         Process Hazard Analysis: Formal studies using the What-If Technique have been conducted to examine the system and identify potential hazards.  Any recommendations are resolved to improve facility safety. \n\n         Operating Procedures:  Written, detailed procedures have been developed which describe the steps which should be followed to safely operate the ammonia refrigeration system.\n\n         Training: A training program has been developed which ensures that employees are trained on all aspects of the system and on the duties which they should perform to ensure the safe operation of the ammonia refrigeration system.\n\n         Contractors: All contractors are screened and evaluated before they perform work on or near the ammonia refrigeration system.  The contractors are also periodically evaluated to ensure that they perform work by following safe work practices.\n\n         Pre-Startup Safety Review: A pre-startup safety review is required for all new ammonia projects to verify that all safety programs are in place, training has been performed, and construction has been completed according to design standards before the project is put into use. They are also performed when there is a change in the process safety information. \n\n         Mechanical Integrity:  This program ensures that the ammonia r"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6846,
      "SummaryText": "efrigeration systems are built and maintained using preventive maintenance procedures to minimize unexpected breakdowns or failures.\n\n         Hot Work Permit: These procedures ensure that a signed permit is obtained prior to any cutting, welding, or burning.\n\n         Management of Change: Procedures are designed to ensure that all changes made to the ammonia refrigeration system are properly reviewed.\n\n         Incident Investigation: Procedures ensure that any incidents (and near misses) are investigated, reviewed, and documented using an investigation team.  Any recommendations are resolved to improve the safety of the facility.\n\n         Compliance Audits: There are procedures to conduct regular audits of the RM prevention program to ensure that the program is in place and working properly. Any recommendations are resolved to improve the RM program. \n\nE.   Five-Year Accident History\n\nThere have been no ammonia-related incidents at the Tamarack Farms Dairy within the last five years that have resulted in onsite or offsite impacts.\n\n\n\nF.   Description of the Emergency Response Program\n\nAn emergency response program has been implemented at the Tamarack Farms Dairy facility.  This program contains procedures describing how the facility will respond to ammonia spills and other emergencies, including evacuation procedures.  The program has been coordinated with the County Emergency Management Agency.\n\nThe emergency response program consists of the following elements:\n\n         Organization Plan and Responsibilities\n         Communications Procedures\n         Detailed Action Plans\n         First Aid Procedures\n         Emergency Medical Treatment Procedures\n         Evacuation Plans\n         Description of Outside Assistance Available\n         Site Re-Entry Procedures\n         Training Programs and Drills\n         Revision and Update Criteria\n\nG.   Planned Changes to Improve Safety\n\nThe following changes are planned to improve safety conditions and  further strengthen the ongoing safety efforts at the Tamarack Farms Dairy facility:\n\n     replacement of "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6846,
      "SummaryText": "older process equipment\n     continual support for the Behavioral Accident Prevention Process (BAPP) and the Safety Key Element Assessment (KEA) process."
    }
  ]
}