{
  "FacilityID": 686,
  "FacilityName": "Western Berks Water Authority",
  "FacilityStr1": "91 Water Road",
  "FacilityStr2": null,
  "FacilityCity": "Sinking Spring",
  "FacilityState": "PA",
  "FacilityZipCode": "19608",
  "Facility4DigitZipExt": "9633",
  "FacilityCountyFIPS": "42011",
  "LEPC": "Berks County LEPC",
  "FacilityLatDecDegs": "40.361111",
  "FacilityLongDecDegs": "-76.022778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.wbwa.org",
  "FacilityEmailAddress": "wbwa@talon.net",
  "FacilityDUNS": 69792349,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Robert L. Walborn",
  "OperatorStr1": "91 Water Road",
  "OperatorStr2": null,
  "OperatorCity": "Sinking Spring",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19608",
  "OperatorZipCodeExt": "9633",
  "FTE": 8,
  "OtherEPAFacilityID": "PAD987321932",
  "EPAFacilityID": "100000007048",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-11-25 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-05-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-05-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-05-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-05-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 40.36824,
  "FRS_Long": -76.02787,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 773,
      "AltID": "Water Disinfection",
      "FacilityID": 686,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 856,
          "ProcessID": 773,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 782,
          "ProcessID": 773,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 568,
              "Process_NAICS_ID": 782,
              "SafetyReviewDate": "1996-11-25 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "Pennsylvania Department of Environmental Protection (PaDEP)",
              "FR_Comments": "Adherence with PaDEP design and operation requirements in conjunction with best management practices",
              "HazardReviewDate": "1999-02-10 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Chlorine Emergency Kit \"B\" on premises",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1990-06-06 00:00:00",
              "TrainingReviewDate": "1990-05-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-12-22 00:00:00",
              "EquipmentInspectionDate": "1999-04-19 00:00:00",
              "EquipmentTested": "Chlorine leak detector: Monthly test.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The prevention program includes routine preventive maintenance being performed on chlorination equipment by manufacturer's representatives.  Monthly testing of the permanently installed chlorine leak detector by plant operators assures early detection of leaks which might occur.  Operators receive training in the proper installation, use and maintenance of the chlorination system.  Five of seven operators are presently licensed having demonstrated proficiency in various state mandated areas including safety and maintenance.  The remaining two operators are expected to receive certification shortly.",
              "_chemicals": [
                {
                  "PrimaryKey": 574,
                  "PreventionProgram2ID": 568,
                  "ProcessChemicalID": 856
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 686,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Berks County LEPC",
    "CoordinatingAgencyPhone": "6103745033",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 686,
      "SummaryText": "EXECUTIVE SUMMARY FOR 1999 RMP\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe Western Berks Water Authority's Board of Directors and management are committed to providing a safe and healthful workplace and facility for our employees, customers, and the general public.  One of the Authority's missions is to recruit, train and motivate personnel capable of carrying forward this policy in the years to come.\n\nThe Authority's Safety Code provides rules and guidelines for safe working conditions for all employees.  The sole purpose of the Authority's Safety Code is to eliminate unsafe acts and unsafe conditions that cause or could cause bodily injury and/or property damage.  No employee is required to work in conditions that are unsafe or unhealthy.  Each employee has the responsibility to detect unsafe situations, and to immediately advise their supervisor of an unsafe situation that is beyond their ability or authority to correct.\n\nBoth instructions and special safety equipment are provided specifically as it has to do with chlorine handling and delivery in addition to general chemical handling, storage and first aid.\n\nWestern Berks Water Authority and Chlorine\n\nChlorine is a very important part of our overall water treatment process and is necessary to insure that the water we produce is free of harmful organisms.  Chlorination of the water occurs at the beginning of the treatment process and again at the end to maintain a residual level in the finished water.  Between the two applications of chlorine, the water is treated with alum to coagulate small particles into larger more readily settled particles and filtered to further remove suspended particles.\n\nFor more information on our treatment process and other information about the Authority, visit our web site at: http://www.wbwa.org\n\nIn the course of one year's time, the authority operators deal with approximately sixty to seventy one-ton chlorine cylinders.  Chlorine is stored in thick-walled st"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 686,
      "SummaryText": "eel one-ton cylinders, which are kept in the plant's chlorine cylinder room.  Storage inside this locked and dedicated room serves to restrict access to the cylinders by only authorized personnel.  Additionally, by the tanks being located indoors, they are not subject to solar heating or possible vandalism by outside persons.  There are no sources of ignition or open flame located within the chlorine cylinder room; no materials other than chlorine are stored in the room; and, smoking is prohibited within the confines of the plant.  These conditions serve to virtually eliminate the exposure the cylinders would have to external sources of heat and therefore the likelihood of fusible plug failure, much less complete cylinder failure.  A vacuum regulator is attached to the gas discharge valve of a chlorine cylinder for the withdraw of chlorine gas.  The vacuum regulator is basically a spring-loaded diaphragm valve that requires a vacuum to be present for the valve to open.  The vacuum is created by the inductor where chlorine gas is metered into a water stream.  The vacuum regulator will close if there is insufficient vacuum as a result of a diminished water supply or a break in the chlorine gas line.  Chlorine gas is conducted through the lines under a vacuum and not under pressure; chlorine gas is under pressure only from the cylinder to the vacuum regulator mounted directly to the cylinder valve.  Maintenance of the vacuum regulators and chlorinators is performed bi-annually by certified representatives of the manufacturer.  Maintenance performed by the plant operators consists of annual replacement of the polyethylene lines connecting the vacuum regulator to the chlorine gas line.\n\nA Fischer & Porter Chloralert chlorine gas leak detector is located in an adjacent room with the detector located in the cylinder storage room.  The leak detector is operating 24 hours per day to sample air from the storage room and monitor for the presence of chlorine.  The leak detector"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 686,
      "SummaryText": " is tested monthly by plant personnel to verify proper operation and to provide alarm annunciation on the plant control panel in the event of a leak.\n\n\n\nWorst Case Scenario/Alternative Release Scenario\n\nThe worst-case release scenario utilized is the instantaneous release of the entire 2,000 pounds of chlorine from a single one-ton container and the evaporation of all contents at a constant rate in a ten-minute period with no mitigating devices utilized.  The results are those which were prepared using the Safer Systems, Inc. TRACE Version 8 dispersion model as obtained from the Chlorine Institute, Inc. Pamphlet 74, Edition 3, dated April 1998.  The scenario requires that the container be completely compromised, a situation which, as described above, is considered remote.  It is believed that a more likely source of a leak would be from a valve failure of some sort and that is considered as the alternative release scenario.  This scenario was chosen based on the history of the Authority's lack of a chlorine release from its start-up in 1974 through the present time.  The cylinder valve is recognized as the one single component which is operated during each cylinder change operation and which serves as the only control device for chlorine which is under pressure prior to the vacuum regulator.\n\nWhile the alternative release scenario does not take mitigation into account, the Authority conducts plant familiarization tours with the fire departments that would respond to the facility on the initial alarm.  The purpose of these tours is to provide an insight to the chemicals utilized in the water treatment process including locations, quantities, and hazards.  Through the Incident Command System, the resources and capabilities of the Berks County Level III Hazardous Materials Team would be called upon to provide mitigation of the situation.  A Chlorine Emergency Kit \"B\" is maintained on-site for use by responding agencies.\n\n\n\n\nAccidental Release Prevention Program\n\nAll pl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 686,
      "SummaryText": "ant operators are instructed in the proper manner for change-out of chlorine cylinders.  Operators are knowledgeable in the proper mounting of the vacuum regulator and the importance of sealing the valve face with a new lead washer.  Valves are opened and closed using appropriate wrenches that do not exceed eight inches in length.  It is standard operating procedure to open the valve no more than one turn and to leave the wrench in place on the valve stem.  Connections are tested after the cylinder valve is \"cracked\" open utilizing a container of 26-degree Baume aqua ammonia (ammonium hydroxide) solution.  Routine preventive maintenance is performed on the vacuum regulators and chlorinators to maintain these components in the proper working condition.\n\n\n\nFive-year Accident History\n\nThere have been no accidents involving the chlorination system at the Western Berks Water Authority from the time of start-up in August of 1974 through the present time.  This in itself is not an accident or an anomaly, but rather an indicator of the care, concern, and knowledge exhibited by the operators.\n\n\n\nEmergency Response Program\n\nThe emergency response program begins with the early recognition of a problem through the activation of the chlorine leak detector.  The on-duty plant operator performs notification of the various emergency response agencies from the local 911 system up through the National Response Center and the state regulatory agency.  The Berks County Local Emergency Planning Committee's Off-site Emergency Response Plan for the Western Berks Water Authority has established localities at risk, methods of public notification, and mass care centers.  A copy of this plan is provided to the township emergency management coordinator, the first due fire department, the local emergency medical service organization, and the township police department."
    }
  ]
}