{
  "FacilityID": 6936,
  "FacilityName": "Johnson Controls, Inc",
  "FacilityStr1": "2730 W. Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Jefferson City",
  "FacilityState": "MO",
  "FacilityZipCode": "65109",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29051",
  "LEPC": "Cole County LEPC",
  "FacilityLatDecDegs": "38.597222",
  "FacilityLongDecDegs": "-92.223611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 131588162,
  "ParentCompanyName": "Johnson Controls, Inc",
  "Company2Name": null,
  "CompanyDUNS": 199558404,
  "Company2DUNS": null,
  "OperatorName": "Johnson Controls, Inc",
  "OperatorStr1": "49200 Halyard Drive",
  "OperatorStr2": null,
  "OperatorCity": "Plymouth",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48170",
  "OperatorZipCodeExt": null,
  "FTE": 183,
  "OtherEPAFacilityID": "65109JHNSN2730W",
  "EPAFacilityID": "100000085187",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "OP1999-012",
  "SafetyInspectionDate": "1999-02-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Jefferson City",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-02-18 00:00:00",
  "DeRegistrationEffectiveDate": "2009-01-26 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.59671,
  "FRS_Long": -92.222832,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8345,
      "AltID": "TDI",
      "FacilityID": 6936,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9182,
          "ProcessID": 8345,
          "ChemicalID": 77,
          "Quantity": 420000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8538,
          "ProcessID": 8345,
          "NAICSCode": "33636",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 4281,
              "Process_NAICS_ID": 8538,
              "SafetyReviewDate": "1998-11-30 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "TDI Handeling Specific Standards",
              "FR_Comments": null,
              "HazardReviewDate": "1998-12-01 00:00:00",
              "ChangeCompletionDate": "2001-01-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "TDI Monitors",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Portable Monitoring Devices",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Procedural modifications to improve process",
              "OpProceduresReviewDate": "1999-04-01 00:00:00",
              "TrainingReviewDate": "1998-10-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "drills, mock spills",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-31 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "Preventative maintenance is performed weekly/monthly/yearly on process equipment dealing with TDI.  Frequency of inspection is equipment specific.",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4427,
                  "PreventionProgram2ID": 4281,
                  "ProcessChemicalID": 9182
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6936,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-01 00:00:00",
    "ERTrainingDate": "1998-07-01 00:00:00",
    "CoordinatingAgencyName": "Cole County LEPC",
    "CoordinatingAgencyPhone": "5736349146",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6936,
      "SummaryText": "JOHNSON CONTROLS INC.  JEFFERSON CITY, MISSOURI\n\n1.\tEXECUTIVE SUMMARY\nJohnson Controls, Inc. (JCI) owns and operates a foam seat manufacturing facility located in Jefferson City, Missouri (JCI-Jefferson City).  On site, JCI-Jefferson City has two 10,000 gallon and one 6,000 gallon storage tanks and three 60 gallon day tanks which store Toluene Diisocyanate (TDI), a regulated hazardous substance, for the manufacturing of polyurethane foam car seats.  In addition, JCI-Jefferson City may have a 20,000 gallon rail car on site also storing TDI.  The maximum intended inventory of TDI on site is above the threshold quantity of 10,000 pounds listed in 40 C.F.R. ' 68.130.\n\nSince the quantity of TDI exceeds the threshold quantity, JCI-Jefferson City is required to implement a Risk Management Program (RMP).  JCI-Jefferson City is subject to Program Level 2 requirements.  This submission of RMPSubmit presents the details of the RMP compliance measures conducted by JCI-Jefferson City.  The required RMP information was electronically submitted to the United States Environmental Protection Agency (U.S. EPA) in a timely manner before the deadline of June 21, 1999.\n\nRMP Submit defines minimum and maximum values that can be entered.  Specifically, limitations exist for the release rate (Section 2.6), release duration (Section 2.7), and toxic endpoint distance (Section 2.11).  Due to these limitations, JCI-Jefferson City was forced to use the default (inaccurate) value for the release duration for this submittal rather than the more accurate values utilized by the ISCST3 model.  The following table compares these values.\n\nTable 1.  Difference Between RMP Submit Values and Actual Modeled Parameters\n\n\t\t\tRMP Submit Default Value\tActual (Correct) Modeled Value\n\nRelease Duration\t\t9999.9 minutes\t\t\t5.46x10+5 minutes\n\n1.1\tAccidental Release Prevention and Emergency Response Policies\nAt JCI-Jefferson City, certain precautions, such as implementing engineering controls, and wearing appropriate"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6936,
      "SummaryText": "-Jefferson City's internal Spill Team will respond using appropriate actions, as described in JCI-Jefferson City's Spill Incident Response Plan and in JCI-Jefferson City's Contingency and Emergency Response Plan.\n\n\nJCI-Jefferson City's Spill Team has been trained to respond to in-house chemical releases.  The Spill Incident Response Plan establishes an Incident Command System, which describes the roles of the various Spill Team Members.  This plan describes internal reporting requirements, which includes a Chemical Release Report Form, and incident investigation to determine the root cause of the incident and to identify corrective actions to prevent a similar incident from occurring in the future.  The plan also describes external reporting requirements to appropriate agencies for releases exceeding the Reportable Quantity. \n\nJCI-Jefferson City's Spill Incident Response Plan also documents external experts that may be contacted for advice or assistance in the event of a TDI release.  These experts include Bayer Corporation, the supplier of TDI, and Haz-Mat Response, Inc., a contract hazardous materials response firm.  JCI-Jefferson City maintains a contract with Haz-Mat Response, Inc.\n\nJCI-Jefferson City actively participates in the Local Emergency Planning Committee (LEPC) for Cole County and has been included in the community emergency response plan.\n\n1.7\tPlanned Changes to Improve Safety\nJCI-Jefferson City is committed to continuous improvement in all aspects of its operation, including safety.  As such, JCI-Jefferson City strives to take a proactive approach to ensure employee safety, health and wellness and to protect the environment.\n\nJCI-Jefferson City conducts routine inspections and audits to ensure safe work conditions and compliance to applicable regulations.  These inspections and audits may be conducted by internal personnel from various levels of the organization (line employee to plant manager), by JCI personnel from other locations, or by outside"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6936,
      "SummaryText": "consultants.  Results of the inspections and audits are documented and communicated, and action plans are developed to correct noted deficiencies.  JCI-Jefferson City is in the process of strengthening its existing internal safety audit program through the development and implementation of a layered safety audit system, which is modeled after DuPont's benchmarked program.\n\nA Process Hazard Analysis (PHA) was recently performed at the Jefferson City facility.  Recommendations from that PHA are being implemented which will improve the safety of the TDI process, as well as reduce the likelihood and magnitude of any TDI spill."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6936,
      "SummaryText": "personal protective equipment, including respiratory protection if exposure limits may be exceeded, are taken when handling TDI itself or equipment that has been in contact with the chemical.  In order to prevent accidental release of the chemical from various sources, numerous safety procedures have been enacted to ensure the maximum safety of the employees working with TDI and the population surrounding the plant.  Employees of the plant have been trained in the proper handling of TDI and in the actions to be taken in case of an accidental release.\n\nThe JCI-Jefferson City facility has a maximum intended on-site inventory of 416,109 lbs. of TDI.  The largest spill would be a release from the 20,000 gallon rail car.  The rail car unloading area is located outside and is surrounded by a dike system.  In the event of a release, safety measures to take include informing the plant population of the hazards of the chemical, and making sure that proper procedures in the maintenance of the TDI equipment, such as pumps, filters, and valves, have been followed and adhered to.\n\nJCI-Jefferson City's emergency response policies have been designed to comply with all applicable state and federal regulations.  These policies also summarize the actions that need to be taken in response to a chemical release.\n\n1.2\tDescription of JCI-Jefferson City and the Regulated Substance Handled\nJCI-Jefferson City, a QS-9000 certified facility, produces molded polyurethane foam for automotive seating applications.  Foam production is a result of a specific blend of chemicals, including TDI, which are poured into specially designed molds.  The finished foam parts are removed from the molds and moved to the warehouse where they are packed and stored until distribution to trim facilities at other locations, where the foam parts are covered and track mechanisms are installed.\n\nThe regulated substance handled at this facility is Toluene Diisocyanate (unspecified isomers) [Benzene, 1,3-diisocyanato"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6936,
      "SummaryText": "methyl-].  The maximum amount of TDI that can be stored in the plant (i.e., not including the rail car) is 226,109 pounds.\n\n1.3\tWorst Case and Alternative Release Scenarios\nSection ' 68.25 of the RMP Regulation defines a worst-case scenario as a release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to a specified endpoint.  All releases are assumed to take place at ground level for the worst-case and alternative-case scenarios.\n\nAt JCI-Jefferson City, the worst-case scenario is identified to be the release of the largest tank of TDI.  The rail car is assumed to instantaneously release the entire contents in a worst-case accidental release scenario.  The TDI will then be captured in the diked area and volatilize into the atmosphere.  \nModeling of this release was performed using the EPA's dispersion modeling software ISCST3 and shows that the toxic endpoint will affect a small commercial/industrial area nearby.   It should be noted, however, that no residential population is affected by the worst case release.  Because the worst-case release of TDI has offsite impacts, JCI-Jefferson City qualifies for Program 2 of the Risk Management Program.\n\nThe alternative- release scenario is based on the rupture of the 2 inch rail car unloading line.  This failure will assume that TDI would be released from the line, forming a liquid pool. The characteristics of the release are the same as for the worst case release scenario (i.e., storage and chemical properties); however, the quantity of TDI released will be less due to operator intervention.  In the alternative-release scenario, the unload attendant would detect the release and take appropriate actions to shutdown the unload process, stopping the release.   Further, the same methods for determining evaporation rate and endpoint distance were used for the alternative case.  The alternative-release scenario does not result in any offsite impacts.  JC"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6936,
      "SummaryText": "I-Jefferson City routinely inspects and replaces the unloading line to prevent the alternative-release scenario from actually occurring.\n\n1.4\tThe General Accidental Release Prevention Program and Chemical Specific Prevention Steps\nJCI-Jefferson City has specific process controls in-place to minimize the risks of spills.  All chemical storage tanks are located indoors, above ground with secondary containment.  Tanks critical to the process have level sensors to prevent any tank from being overfilled.  Fill duration is also monitored during the transfer of TDI to the process lines and if not satisfied within a set time period, auto filling ceases and an alarm is activated.  Chemical wet systems are equipped with high and low-pressure switches to shut down in the event of a line rupture.  Critical valves are monitored electronically as to open/closed positioning.\n\nJCI-Jefferson City has a preventative maintenance software program in place to address maintenance of all vital parts of the plant's day to day operations.  Specific environmental issues are also addressed with this computer driven program.\n\nJCI-Jefferson City has established an Air Monitoring Program that monitors the airborne concentration of  TDI within the production facility.\n\nProperty Conservation and Risk Management audits are conducted annually by Factory Mutual Risk Appraisers as well as Environmental audits by the JCI corporate environmental department located  in Plymouth, Michigan.\n\n1.5\tFive-Year Accident History\nIn the past five years, there have been no accidental releases of TDI at JCI-Jefferson City as defined in 40 CFR Part 68.42.  Therefore, no on-site or off-site damage has occurred, as defined in 40 CFR Part 68.42.\n\n1.6\tThe Emergency Response Program\nJCI-Jefferson City's emergency response program  has been designed to comply with all applicable state and federal Regulations.  This program summarizes the actions to be taken in response to a chemical release.  In the event of a release, JCI"
    }
  ]
}