{
  "FacilityID": 6940,
  "FacilityName": "Synthron, Inc.",
  "FacilityStr1": "305 AMHERST ROAD",
  "FacilityStr2": null,
  "FacilityCity": "MORGANTON",
  "FacilityState": "NC",
  "FacilityZipCode": "28655",
  "Facility4DigitZipExt": "9342",
  "FacilityCountyFIPS": "37023",
  "LEPC": "Burke County LEPC",
  "FacilityLatDecDegs": "35.759167",
  "FacilityLongDecDegs": "-81.657028",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 63922801,
  "ParentCompanyName": "Protex, SA",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "SYNTHRON, INC.",
  "OperatorStr1": "305 AMHERST ROAD",
  "OperatorStr2": null,
  "OperatorCity": "MORGANTON",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28655",
  "OperatorZipCodeExt": "9342",
  "FTE": 15,
  "OtherEPAFacilityID": "28655SYNTHAMHER",
  "EPAFacilityID": "100000085347",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-15 00:00:00",
  "SafetyInspectionBy": "DOT",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-08-08 00:00:00",
  "DeRegistrationEffectiveDate": "2005-07-26 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.75918,
  "FRS_Long": -81.65709,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8349,
      "AltID": null,
      "FacilityID": 6940,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9186,
          "ProcessID": 8349,
          "ChemicalID": 1,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8542,
          "ProcessID": 8349,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3655,
              "Process_NAICS_ID": 8542,
              "SafetyReviewDate": "1998-11-02 00:00:00",
              "PHA_Date": "1998-11-02 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-12-03 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-01 00:00:00",
              "TrainingReviewDate": "1999-05-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "Pressure Guages - Reators (steam controller) steam valves",
              "ChangeMgmtDate": "1999-05-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-01 00:00:00",
              "PreStartupReviewDate": "1999-06-01 00:00:00",
              "ComplianceAuditDate": "1999-05-01 00:00:00",
              "AuditCompletionDate": "1999-05-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4171,
                  "PreventionProgram3ID": 3655,
                  "ProcessChemicalID": 9186
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6940,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-04 00:00:00",
    "ERTrainingDate": "1998-04-01 00:00:00",
    "CoordinatingAgencyName": "CITY OF MORGANTON PUBLIC SAFETY",
    "CoordinatingAgencyPhone": "8284371211",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6940,
      "SummaryText": "Synthron, Inc. has adopted rigorous safety, accidental release prevention and emergency response procedures into its overall policies. Senior management is committed to these policies.  For example, Synthron, Inc. is one of the few smaller specialty chemical manufacturers that has successfully qualified for ISO 9000 certification. A portion of that certification is the strong support of both safety and environmental protection programs. This commitment is further exemplified through accident, injury and lost time statistics. There has not been a lost time injury or accident in the previous five years.\n\nIn addition to the above comments and certification, Synthron, Inc. has prepared a Process Safety Management (PSM) plan in response to regulations promulgated by the Occupational Safety and Health Administration (OSHA), as part of 29 CFR 1910.119. A summary of this regulation states that if there are certain chemicals present at a facility in greater than specific inventory limits; then, the facility would be required to prepare a PSM. Synthron has one chemical, formaldehyde, on site in greater than planning quantities; consequently, a Process Safety Management (PSM) plan has been prepared. The PSM is incorporated into this document by reference.\n\nAs was mentioned above, Synthron, Inc. is a small specialty chemical manufacturer. Our primary products are non-hazardous intermediate chemicals used for textile processing. Formaldehyde is used primarily as a chemical reactant for the production of these chemicals. Synthron, Inc. is located on about seven acres of land, generally northeast of downtown Morganton. Our facility has a small tank farm containing a total of twenty-one (21) tanks which are used to contain both raw materials and finished products. The tank farm has a concrete \"floor\", and is surrounded by a dike. Therefore, we believe that secondary containment of any spills or leaks has been achieved.   Some of our raw materials are considered flammable, and are s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6940,
      "SummaryText": "tored either in a separate flammable shed, or in the tank farm. All of our products are considered non-hazardous and non-flammable. One tank in our tank farm, of four thousand gallon (4,000 gal.) capacity, is used to store formaldehyde. \n\nFormaldehyde is delivered to the facility in tanker trucks, and is off loaded into a storage tank. The concentration of the delivered formaldehyde is 50%, with the remainder being water. When the initial unloading is completed, a measured amount of water is added to the truck tank and then pumped from the tanker to the storage tank. This, in essence, washes the truck tank, and dilutes the formaldehyde to the usual use concentration of 37%. From the storage tank, the formaldehyde solution is transferred to either a tote bin or a bucket, and carried to the production area. The formaldehyde is then added to a chemical reaction vessel by gravity. The formaldehyde is generally transformed into another compound by chemical reaction, and no longer exists. \nProcess Safety Management (PSM) examined several of the safety practices and procedures already in place for the employees. One of the safety procedures recommended is to monitor the employee and general manufacturing area for formaldehyde exposure levels. A long term (four hour) exposure level test concluded that maximum employee exposure was well below the OSHA Permissible Exposure Level (PEL) of 0.75 ppm, when factored up to an eight hour exposure level.  The worse case scenario for the release of formaldehyde is the case where the storage tank would, for some reason, be breached when full of formaldehyde solution. This could occur during a fire situation, or an accident involving a truck or forklift. If this were to occur, the worse case scenario would be the release of all of the 37% formaldehyde (balance; water) into a diked area. These parameters, the release of all of the 37% formaldehyde solution, were used in conjunction with US EPA published Offsite Consequence Analysis Guida"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6940,
      "SummaryText": "nce  document to estimate the impact of a release. There would be an impact off the property. \n\nAn alternative scenario for the release of formaldehyde is the case where a hose would rupture during the off loading of the 50% formaldehyde solution. Again, the spillage would be impounded either within a drain area, or within the diked area. A release of 50% solution would have an impact off site. This release may occur with a hose rupture; however, the release would be stopped by check valves present in both the tanker truck and in the storage tank piping. \n\nA second alternative scenario would be the possible spill or puncture of a tote. This would allow the release of up to 225 gallons of 37% formaldehyde solution. This smaller release of the same material as was considered in the worse case scenario would result in a more limited impact upon the surroundings. \n\nEven with the relatively minimal impact of a formaldehyde release upon the surroundings, we are continually searching for alternative chemistries and production methods which will reduce the amount of formaldehyde on site. During the past three years, our consumption of formaldehyde has decreased about 30%. We look to continue this trend for the near future. In addition, we will maintain and enhance our training and knowledge programs so that our employees, and subsequently our neighbors are more safe and better prepared for an incident. \n\nThere are several programs, rules and regulations with which our facility complies. As has already been mentioned, Synthron, Inc. has prepared a Process Safety Management plan. In addition, our employees have had Hazard Communication training, Hazardous Materials Handling training, Hazard Analysis for both process operations and employee safety which has resulted in a rigorous safety program, including mandatory safety glasses, hearing protection when required, respirator protection (including respirator fit testing) when required, and continuing programs in lock out/tag ou"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6940,
      "SummaryText": "t, roll/pinch elimination, hot work permitting, and emergency response for small incidents. Our employees have also been trained for blood borne pathogens.  Due to these programs, both our safety and accidental release incidents are essentially zero. We have had no lost time accidents nor injuries in the past five years. We have had no reportable releases during the previous five years. \n\nOur emergency response programs are geared to cooperate fully with the local emergency responders, particularly the fire department. We have had regular inspections by the fire chief, and have maintained a regular dialogue with him including fire fighting training. Our employees have been trained to respond to small emergency spills, leaks, etc.; however, they have been additionally instructed to ask for assistance early in a response situation if they cannot handle it or it looks as though the situation may get out of hand.  We have not conducted any drills; however, we maintain an alarm which can warn our neighbors of an impending or occurring release."
    }
  ]
}