{
  "FacilityID": 6997,
  "FacilityName": "Rohm and Haas Company",
  "FacilityStr1": "14445 Alondra Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "La Mirada",
  "FacilityState": "CA",
  "FacilityZipCode": "90638",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.888028",
  "FacilityLongDecDegs": "-118.022472",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.rohmhaas.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 137358180,
  "ParentCompanyName": "Rohm and Haas Company",
  "Company2Name": null,
  "CompanyDUNS": 2292043,
  "Company2DUNS": null,
  "OperatorName": "Rohm and Haas Company",
  "OperatorStr1": "14445 Alondra Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "La Mirada",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90638",
  "OperatorZipCodeExt": null,
  "FTE": 68,
  "OtherEPAFacilityID": "90638RHMHS14445",
  "EPAFacilityID": "100000088086",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-06-26 00:00:00",
  "DeRegistrationEffectiveDate": "2009-06-16 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.88803,
  "FRS_Long": -118.02377,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8417,
      "AltID": "VA RC / UST / TRAIN II",
      "FacilityID": 6997,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9258,
          "ProcessID": 8417,
          "ChemicalID": 29,
          "Quantity": 700000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8610,
          "ProcessID": 8417,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3692,
              "Process_NAICS_ID": 8610,
              "SafetyReviewDate": "1997-07-01 00:00:00",
              "PHA_Date": "1999-06-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "trench system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-06 00:00:00",
              "TrainingReviewDate": "1999-01-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-06-08 00:00:00",
              "EquipmentInspectionDate": "1999-02-15 00:00:00",
              "EquipmentTested": "Monomer Emulsion Tank MET-102 (Process Vessel)",
              "ChangeMgmtDate": "1999-02-17 00:00:00",
              "ChangeMgmtReviewDate": "1999-01-25 00:00:00",
              "PreStartupReviewDate": "1999-05-10 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1999-04-21 00:00:00",
              "InvestigationChangeDate": "1999-04-30 00:00:00",
              "ParticipationPlansReviewDate": "1998-09-04 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-04 00:00:00",
              "ContractorSafetyReviewDate": "1997-07-31 00:00:00",
              "ContractorSafetyEvalDate": "1997-12-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4211,
                  "PreventionProgram3ID": 3692,
                  "ProcessChemicalID": 9258
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 6997,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-24 00:00:00",
    "ERTrainingDate": "1998-12-11 00:00:00",
    "CoordinatingAgencyName": "Los Angeles County Fire Department",
    "CoordinatingAgencyPhone": "5628680411",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 6997,
      "SummaryText": "1.1  Accidental release prevention and emergency response policies\n It is the policy of the Rohm and Haas Company La Mirada Facility to implement written procedures, personnel training programs and physical safeguards to minimize the potential for accidental releases of hazardous chemicals from this facility.  Up-to-date comprehensive emergency response and contingency programs are in place.  Facility personnel are trained on and familiar with these programs in order to allow the facility to safely and properly respond to accidental chemical releases. \n \n1.2  General description of the stationary source and regulated substances\n This facility manufactures a variety of non-hazardous water-based emulsions that are used by our customers to produce water-based paints and other household and industrial products.  The SIC and NAICS codes that describe this activity are 2821 and 325211, respectively.  The facility occupies an overall area of approximately ten acres between Alondra Boulevard on the south and Macaw Street on the north in the city of La Mirada.  The polymer manufacturing area is located in the northwest area of the facility.\n \n The regulated substance in use at this facility that is covered by RMP is vinyl acetate.  Vinyl acetate is a monomer that is a colorless liquid with a sweetish odor.  It is flammable and toxic.  Vinyl acetate is delivered to the facility in 25,000 gallon rail cars designed to contain up to 75 pounds of pressure per square inch.  The vinyl acetate is transferred from rail cars via dedicated transfer lines to one of two 50,000 gallon double-walled underground storage tanks designed to meet the recently upgraded federal and state UST requirements.  Vinyl acetate is used in the manufacture of water-based emulsions.  Process vessels that contain vinyl acetate for the manufacture of these emulsions are instrumented and alarmed to notify process personnel of potentially unusual pressures and temperatures.  Process feed rates are controlled au"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 6997,
      "SummaryText": "tomatically to manage the reaction, and procedures are in place to prevent the addition of chemicals to the process vessels that could cause an uncontrolled reaction.\n \n1.3  Offsite consequence analysis results\n A release of vinyl acetate from this facility has the potential to have off-site consequences.\n \n1.3.1  Worst-case release scenario for toxics\n \n 1.3.1.1 Release scenario description and release parameters\n The release scenario that was estimated to create the greatest distance in any direction to a toxic endpoint resulting from an accidental release of a regulated toxic substance from a covered process under worst-case conditions was of an unpressurized and unrefrigerated rail car containing 190,000 pounds of vinyl acetate.  The rail car was assumed to rupture catastrophically such that the entire contents were released instantaneously to the ground without mitigation, forming a liquid pool (vinyl acetate is a liquid at ambient temperatures) that spreads to one centimeter deep on a smooth surface in an urban setting.  The rail car contains the greatest amount of vinyl acetate held above ground in a single vessel on site.\n \n A release of the contents of the 50,000 gallon underground storage tanks were not considered, based on Volume 61, Number 120 of the Federal Register, dated Thursday, June 20, 1996.  Page 31683 of this Federal Register states that EPA agrees that vessels sufficiently buried underground are passively mitigated or prevented from failing catastrophically.\n \n 1.3.1.2  Description of OCA methodology, including description of air dispersion model\n The worst case release description is provided in 1.3.1.1 (above) and the required weather conditions at the time of release are described in 1.3.1.3 (below).  The air dispersion model used to estimate the toxic endpoint was PHAST - Process Hazards Analysis Software Tool.  PHAST is a publicly available software that was developed in 1987-1988 for use in performing MAPP (Major Accident Prevention Progr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 6997,
      "SummaryText": "am) studies.  The commercial version was released by DNV Technica in 1989.  This software is used by over 280 operating and consulting companies and governmental agencies to determine community impact resulting from releases, perform MAPP studies, assess locations of process buildings and reduce inherent risks associated with chemical processes. \n \n 1.3.1.3  Meteorological data\n The temperature at which the volatilization occurs was taken to be the highest daily maximum temperature that occurred in the past three years in this area, which is 98 F, and an average humidity for the site of 71%.  A wind speed of 1.5 meters per second (3.4 miles per hour) and F atmospheric stability class (moderately stable) were used.\n \n 1.3.1.4  Presentation of the OCA results including residential population data and public/environmental receptors list\n The toxic endpoint of 0.26 mg/L (or 75 ppm) was calculated to be 4640 feet.  The residential population that is estimated to be within a circle with its center at the point of the release and a radius of 4640 feet  is 6827 people.  This data was obtained from RiskMap, which utilizes the most recent census report.\n \n 1.3.2  Alternative release scenario for toxics\n \n 1.3.2.1  Release scenario description and release parameters\n Several alternate release scenarios were defined for this facility (including a runaway reaction in the underground storage tank) and modeled to estimate their potential affects on the community.  Although none of the scenarios involving vinyl acetate have actually occurred at this facility, the possibility of such events do exist and so were considered.  The alternate scenario having the farthest reaching effects was selected for presentation in this program.\n \n The alternative release scenario that was selected for this site as an event that is more likely to occur than the worst-case release scenario and that will reach an endpoint offsite is a runaway reaction involving vinyl acetate in the process vessel.  Th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 6997,
      "SummaryText": "e resulting pressure in the process vessel was determined to exceed the vessel rupture disk rating of 40 pounds per square inch at a reaction temperature of 244 F.  The materials escaping this vessel would be initially captured in the 12,000 gallon emergency blowdown tank.  The 7 pound per square inch rupture disk on the emergency blowdown tank was also calculated to be exceeded, resulting in the venting of approximately 800 pounds of vinyl acetate to the atmosphere through a stack 60 feet high.\n \n 1.3.2.2  Description of OCA methodology, including description of air dispersion model\n The alternative release description is provided in 1.3.2.1 (above) and the assumed weather conditions at the time of release are described in 1.3.2.3 (below).  The air dispersion model used to estimate the toxic endpoint was PHAST - Process Hazards Analysis Software Tool.  PHAST is a publicly available software that was developed in 1987-1988 for use in performing MAPP (Major Accident Prevention Program) studies.  The commercial version was released by DNV Technica in 1989.  This software is used by over 280 operating and consulting companies and governmental agencies to determine community impact resulting from releases, perform MAPP studies, assess locations of process buildings and reduce inherent risks associated with chemical processes.\n \n 1.3.2.3  Meteorological data\n The ambient temperature at which the release occurs was taken to be an average temperature for this area of 62.4  F and a typical humidity for the site of 71 %, based on meteorological data obtained from LAX airport.  A wind speed of 3.35 meters per second (7.5 miles per hour) and D atmospheric stability class (neutral stability) were used.\n \n 1.3.2.4  Presentation of the OCA results including map, residential population data and sensitive receptors  list\n The toxic endpoint of 0.26 mg/L (or 75 ppm) was calculated to be 1412 feet.  The residential population that is estimated to be within a circle with its center at"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 6997,
      "SummaryText": "the point of the release and a radius of 1412 feet  is 131 people.  This data was obtained from RiskMap, which utilizes the most recent census report.\n \n Located within the circle described above are no schools,  hospitals, child day-care facilities, long-term health care facilities, prisons, parks, or environmental receptors; however, several commercial, office and industrial buildings are located within the circle.  Therefore, no public receptors would be affected by such a release.\n\n1.4  Summary of the general accidental release prevention program and chemical-specific prevention steps\n In accordance with the policy of this facility to implement written procedures, personnel training programs and physical safeguards to minimize the potential for accidental releases of hazardous chemicals from this facility, the following activities are performed.  Safety and Operations Procedures have been written for activities at the facility that could impact human health or the environment.  All involved personnel are required to read and sign-off on these written procedures.  Operators and mechanics are required to pass written and hands-on tests in order to be certified for their particular positions and refresher certifications are required every three years thereafter.  Periodic safety meetings are held in order to provide training on specific safety topics.  Computer-based training programs are often established for annual refreshers on many safety topics.  Preventive maintenance programs are in place to ensure the continued mechanical integrity of equipment, piping and vessels.  Physical safeguards (such as the use of pressure-rated rail cars, double-walled underground storage tanks, instrumentation/alarms for detection and identification of potentially unusual process parameters, pressure-rated process vessels and thermal oxidation interlocked with the process) are utilized to minimize the chances for hazardous chemicals, and specifically vinyl acetate, to be accident"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 6997,
      "SummaryText": "ally released from the process.  In addition, gas sensors with alarm capability are located throughout the plant to detect accidental releases of monomers (including vinyl acetate).  This allows for more rapid response to releases than would otherwise be possible.\n \n Process safety information has been compiled pertaining to the hazards of regulated substances and the technology of the process.  A HAZOP study has been performed and findings and recommendations have been documented, along with a schedule for assigned actions.  Management of Change procedures have been established and implemented to assure that all changes to the process are thoroughly reviewed and made known before the change is actually implemented.  Pre-startup reviews are conducted for all new sources and significant modifications to existing sources.  Incidents that result in or have the potential to result in a catastrophic release of a regulated substance are investigated within 48 hours of the event.  Employee participation in programs is provided for.  A Safety Permit system has been developed to identify specific requirements for certain types of activities and a contractor safety program is in place.\n \n Rohm and Haas has implemented a rigorous program for the prevention of potential Y2K computer problems.  This program includes the identification of systems that are date sensitive, reprogramming or replacement of these systems as necessary, and follow-up testing to determine whether the implemented solutions were effective in eliminating date-sensitivity.  Focus is directed toward the process and related equipment, with a goal to eliminate the potential for accidents that could result in releases of chemicals or injury to personnel and the community.\n \n1.5  Summary of the five-year accident history\n There have been no accidental releases of vinyl acetate at the Rohm and Haas La Mirada Facility that resulted in deaths, injuries or significant property damage on site, or known offsite death,"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 6997,
      "SummaryText": "injuries, evacuations, sheltering in place, property damage or environmental damage in the past five years.\n \n1.6  Summary of the emergency response program\n In the unusual event that the written procedures, personnel training programs and physical safeguards in place at this facility are unsuccessful in preventing an accidental release of hazardous chemicals, the Rohm and Haas La Mirada Facility has established a comprehensive Emergency Response and Contingency Plan for responding to a release in a safe and organized manner.  This plan provides the requirements for evacuation of the facility; notification of emergency responders, agency contacts and industrial neighbors;  emergency first aid or medical treatment for human exposure; coordination of the in-house Incident Command System; use of personal protective equipment; response to specific events (including external events such as earthquakes); reporting; and Plan review and up-dating.  Facility personnel have received training on implementation of the Incident Command System, with practice drills being performed at least annually.  The Rohm and Haas La Mirada Facility participates in the annual La Mirada Disaster Exercise and makes the plant and its equipment available to local emergency responders for training exercises.  Plant personnel are actively involved in the local Community Awareness and Emergency Response group.  Rohm and Haas has been instrumental in training the community via neighborhood and business watch groups on the benefits of and techniques for sheltering-in-place.\n \n1.7  Planned changes to improve safety\n1.7.1 Y2K Projects\n A Physical System Checklist has been developed to provide a guideline to be followed for assessment of potential Y2K concerns.  The Distributed Control System (DCS), which is the computer used to control and monitor the process, has been up-graded, certified and tested successfully as a Y2K compliant system.  All other systems have been classified into one of three catego"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 6997,
      "SummaryText": "ries:  utility, environmental and monitoring systems; shipping and handling systems; and other systems.  Each system that has been identified as requiring Y2K compliance status has been assigned an owner and criticality level.  It is the responsibility of the assigned owner to test each system to verify Y2K compliance.  If a system is found to be non-Y2K compliant, any necessary remediation is to be identified and implemented on a timely basis. \n1.7.2 HAZOP\n The most recent process hazard analysis was completed for the vinyl acetate process (including rail car unloading, underground storage, emulsion preparation, reaction and finishing phase and associated equipment) during the week of June 7, 1999.  The PHA methodology selected to best determine and evaluate the hazards of the process was HAZOP - Hazard and Operability Study.  All HAZOP's are performed by a team having engineering, process operations and HAZOP methodology expertise.  The team's findings and recommendations are entered into the facility's Action Tracking database.  Owners for each item are assigend and target dates for completion are established.  The HAZOP is reviewed on a five year schedule.  Previous HAZOPs and resolutions to the related findings and recommendations are maintained by the Safety Manager for the life of the process.\n \n1.7.3 Seismic Walk-Down\n A thorough Seismic Assessment was performed in December of 1995.  This assessment was supported by performing a current walk-down of the piping and components in vinyl acetate service.  The walk-down was performed by a registered civil engineer and documented on forms.  The two items that were identified during this 1999 walk-down were related to supports for piping that is in vinyl acetate service.  Both deficiencies are scheduled for correction by October 1, 1999."
    }
  ]
}