{
  "FacilityID": 7057,
  "FacilityName": "United Dairy Farmers Production Facility",
  "FacilityStr1": "3955 Montgomery Road",
  "FacilityStr2": null,
  "FacilityCity": "Norwood",
  "FacilityState": "OH",
  "FacilityZipCode": "45212",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39061",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "39.151667",
  "FacilityLongDecDegs": "-84.4625",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "SE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 17653528,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "United Dairy Farmers, Inc.",
  "OperatorStr1": "3955 Montgomery Road",
  "OperatorStr2": null,
  "OperatorCity": "Norwood",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45212",
  "OperatorZipCodeExt": null,
  "FTE": 150,
  "OtherEPAFacilityID": "45212NTDDR3955M",
  "EPAFacilityID": "100000088727",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-28 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.15161,
  "FRS_Long": -84.46249,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8488,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 7057,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 9333,
          "ProcessID": 8488,
          "ChemicalID": 56,
          "Quantity": 38000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8683,
          "ProcessID": 8488,
          "NAICSCode": "311511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3729,
              "Process_NAICS_ID": 8683,
              "SafetyReviewDate": "1999-07-23 00:00:00",
              "PHA_Date": "1999-10-29 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-04-28 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-08-06 00:00:00",
              "TrainingReviewDate": "1999-09-03 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2000-01-28 00:00:00",
              "EquipmentInspectionDate": "1999-04-09 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-08-27 00:00:00",
              "PreStartupReviewDate": "1999-09-10 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-20 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-08 00:00:00",
              "ContractorSafetyReviewDate": "1999-05-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-05-27 00:00:00",
              "CBI_Flag": 0,
              "Description": "OSHA Process Safety Management (PSM) Program",
              "_chemicals": [
                {
                  "PrimaryKey": 4252,
                  "PreventionProgram3ID": 3729,
                  "ProcessChemicalID": 9333
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 8684,
          "ProcessID": 8488,
          "NAICSCode": "31152",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7057,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-08-13 00:00:00",
    "ERTrainingDate": "1998-07-01 00:00:00",
    "CoordinatingAgencyName": "City of Norwood Fire Department",
    "CoordinatingAgencyPhone": "5133968111",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7057,
      "SummaryText": "United Dairy Farmers\nNorwood, Ohio Production Facility\nRisk Management Plan for Ammonia\n\nExecutive Summary\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\n    United Dairy Farmers, Inc. is strongly committed to employee, public, and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with our regulated process.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our highly trained emergency response personnel are available to control and mitigate the effects of the release.  We are also coordinated with the City of Norwood Fire Department for emergency response support.\n\n2.    The Stationary Source and the Regulated Substances Handled\n\n    This facility is primarily used for production of fluid milk and ice cream products.  The only RMP regulated substance present at our facility is ammonia, utilized as the primary cooling media in our closed-loop refrigeration system.  Refrigeration is a critical part of our business, providing cold storage capabilities for products per Food and Drug Administration (FDA) regulations. The amount of ammonia currently present in the refrigeration system is approximately 38,000 pounds.  Due to the size and characteristics of our ammonia refrigeration system, as well as Process Safety Management (PSM) applicability, this facility is covered under Program 3 of the RMP regulations.\n\n3.      The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\n    To evaluate both the worst case and alternative release scenarios, the computer dispersion model ALOHA (Areal Locations of Hazardous Atmospheres) was utilized exclusively. ALOHA is referenced in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7057,
      "SummaryText": " the RMP Offsite Consequence Analysis Guidance as an acceptable model for this purpose. The following paragraphs provide details of the chosen scenarios.\n\n    The worst case scenario would typically involve the catastrophic failure of the largest vessel in the ammonia refrigeration system.  However, the largest vessel is located inside the facility and would constitute a mitigated release.   Subsequently, an additional worst case scenario was evaluated for an unmitigated release due to the rupture of high pressure liquid piping outside of the facility.   This scenario yielded a greater distance to toxic endpoint than the mitigated vessel release and was therefore chosen as the true worst case scenario.  The release rate was calculated to be 536 pounds per minute, using the modified bernoulli equation specified in the RMP Guidance Document for Ammonia Refrigeration.   As specified in the guidance document, the high pressure liquid ammonia is assumed to vaporize as it is released.   As required by the RMP rule, the release duration must be assumed to be 10 minutes, yielding a release quantity of 5,360 pounds.    Under worst case weather conditions (Class F atmospheric stability and 1.5 m/s windspeed) as required by the RMP rule, ALOHA yielded a distance of 0.87 miles to the toxic endpoint of 0.14 mg/L (200 ppm).  The majority of area within the zone of influence exhibits urban topography, based upon the prevalence of commercial, industrial, and residential buildings.  The estimated residential population for the zone of influence is approximately 17,000 people, based upon 1990 census data calculated by  LANDVIEW software.  Other public receptors identified include schools and at least one recreational area.  No environmental receptors are known to be located within the zone of influence.\n\n    Several alternative release scenarios were evaluated, however, the majority either would not exceed the toxic endpoint or would not result in offsite consequences.  The following alter"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7057,
      "SummaryText": "native release scenario was chosen primarily because it is one of the few that would result in offsite consequences as required by the RMP rule.  The scenario would involve an undetected release through a pressure relief valve on the facility roof.  Based upon the manufacturer's rating for this relief valve, it has the capacity to release 29 pounds per minute of ammonia gas.   The release duration is assumed to be 60 minutes, yielding a total release quantity of 1,740 pounds.  Under average weather conditions for the area, ALOHA yielded a distance to toxic endpoint of 0.04 miles.  The corresponding zone of influence only slightly extends beyond the facility property line, with one residence being the only offsite receptor.  The residential population within the zone of influence is assumed to be no greater than 10 people based upon the single residence identified.\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\n    Our facility has taken all necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68.  Our facility is also subject to the OSHA PSM standard under 29 CFR 1910.119, as well as the EPCRA Section 302 and 311/312 notification/reporting  requirements.  The following sections briefly describe the elements of the accidental release prevention program that is in place at our facility.\n\n    Process Safety Information\n\n    United Dairy Farmers, Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the ammonia refrigeration system.\n\n    Process Hazard Analysis\n\n    Our facility conducts comprehensive studies to ensure that hazards associated with our ammonia refrigeration system are identified and controlled efficiently. The methodology used to carry out these analyses are What If Scenarios.  The studies are undertaken by a team of qualified personnel with expertise in refrigeration engi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7057,
      "SummaryText": "neering and process operations, and are reevaluated at a minimum of every five (5) years. Any findings related to the process hazard analysis are addressed in a timely manner.\n\n    Operating Procedures\n\n    For the purposes of safely conducting activities related to our ammonia refrigeration system, United Dairy Farmers, Inc. maintains written operating procedures. These procedures address various modes of operation including startup, normal operations, emergency operations, normal shutdown, and emergency shutdown.  The information is regularly reviewed and is readily accessible to all operators who work with the ammonia refrigeration system.\n\n    Training\n\n    United Dairy Farmers, Inc.  has a comprehensive training program in place to ensure that employees who are working with the ammonia refrigeration system are competent in all relevant operating procedures. Refresher training is provided at least every three (3) years and more frequently as needed.\n\n    Mechanical Integrity\n\n    United Dairy Farmers, Inc. carries out highly documented maintenance checks on ammonia refrigeration system equipment to ensure proper operations. Process equipment examined by these checks includes among others; pressure vessels, piping systems, pressure relief valves, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in applicable maintenance practices. Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n    Management of Change\n\n    Written procedures are in place at United Dairy Farmers, Inc. to manage changes in ammonia refrigeration system technology, equipment, and procedures. Process operators, maintenance personnel, or any other employee whose job tasks are affected by an ammonia refrigeration system modification are promptly made aware of and offered training to deal with the modification.\n\n"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7057,
      "SummaryText": "    Pre-startup Reviews\n\n    Pre-start up safety reviews are conducted any time the ammonia refrigeration system, or any of its components, are opened for repairs, tie-ins, or modifications. These reviews are conducted to confirm that construction, equipment, operating procedures, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n    Compliance Audits\n\n    United Dairy Farmers, Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every three (3) years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n    Incident Investigation\n\n    United Dairy Farmers, Inc. promptly investigates any incident that has resulted in, or could reasonably result in, an uniintentional release of ammonia.  These investigations are undertaken to identify the situation leading to the incident, as well as any corrective actions implemented to prevent the release from reoccurring. All reports are retained for a minimum of five (5) years.\n\n    Employee Participation\n\n    United Dairy Farmers, Inc. truly believes that Process Safety Management (PSM) and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information related to PSM and RMP implementation, including Process Hazard Analyses (PHA) information.\n\n    Contractors\n\n    On occasion, our company hires contractors to conduct specialized maintenance and/or construction activities related to the ammonia refrigeration system. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. United Dairy Farmers, Inc. has a strict policy of informing the contractors of known potential hazards related to the contractor's work with the ammonia refrigera"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7057,
      "SummaryText": "tion system. Contractors are also informed of all the procedures for emergency response should an accidental release of ammonia occur.\n\n5.    Five-year Accident History\n\n    United Dairy Farmers, Inc. has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, no reportable off-site releases have occurred during this period. \n\n6.    Emergency Response Plan\n\n    United Dairy Farmers, Inc. utilizes a written Emergency Response Plan to document specific procedures to be implemented in the event of various emergencies, including an ammonia release.  The plan includes all aspects of emergency response, including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  To ensure proper functioning, emergency response equipment is regularly inspected and serviced.   The Emergency Response Plan is promptly updated to reflect any pertinent changes taking place within our process that would require modified procedures.\n\n    The Hamilton County LEPC is the Local Emergency Planning Committee (LEPC) with which our Emergency Response Plan has been coordinated and verified.  The City of Norwood Fire Department is the primary emergency response agency for all facility emergencies, including ammonia releases.\n\n7.    Planned Changes to Improve Safety\n\n    In order to improve process safety at our facility, existing process piping insulation will be removed to allow complete inspection of pipe/fitting integrity.  Upon completion of piping inspections, new insulation will be installed in all applicable areas.     This project is expected to be completed within the next year."
    }
  ]
}