{
  "FacilityID": 7138,
  "FacilityName": "Putnam Filter Plant",
  "FacilityStr1": "DeKraft Road",
  "FacilityStr2": null,
  "FacilityCity": "Greenwich",
  "FacilityState": "CT",
  "FacilityZipCode": "06831",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09001",
  "LEPC": "Fairfield LEPC",
  "FacilityLatDecDegs": "41.082389",
  "FacilityLongDecDegs": "-73.638917",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 56750664,
  "ParentCompanyName": "Connecticut American Water Company",
  "Company2Name": "American Water Works Company, Inc",
  "CompanyDUNS": 29984077,
  "Company2DUNS": 0,
  "OperatorName": "Connecticut-American Water Company",
  "OperatorStr1": "75 Holly Hill Road",
  "OperatorStr2": null,
  "OperatorCity": "Greenwich",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06830",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Medd",
  "RMPTitle": "Operations Manager",
  "FTE": 17,
  "OtherEPAFacilityID": "CT0570011",
  "EPAFacilityID": "100000091465",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-10-24 00:00:00",
  "DeRegistrationEffectiveDate": "2013-10-21 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.08239,
  "FRS_Long": -73.63892,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8592,
      "AltID": null,
      "FacilityID": 7138,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8798,
          "ProcessID": 8592,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9446,
          "ProcessID": 8592,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509446,
          "ProcessID": 8592,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7138,
      "SummaryText": "The Connecticut-American Water Company Putnam Filter Plant is a water treatment plant that provides drinking water to customers in the area of Greenwich, Connecticut. To ensure that our water remains safe throughout the distribution system to every tap, the plant adds a small amount of chlorine as a disinfection agent.\n\nThe concentrated form of chlorine is liquefied and stored in shipping containers. Before it is mixed with water, chlorine can be extremely hazardous if released to the air.  \n\nConnecticut-American Water Company is committed to protecting its employees, the public, and the environment from any releases of hazardous materials used at its facilities.  We have implemented safety, environmental protection, and risk management programs to prevent hazardous materials releases.  If there is an accidental release, we will immediately call for emergency response to minimize the effect of the release and notify the public of any actions necessary to ensure public protection, through emergency management agencies.\n\nWorst-Case Release Scenario\n\nConnecticut-American Water Company has completed an offsite consequence analysis including a worst-case release scenario.  As required by the EPA RMP regulations, the worst-case scenario is defined as the release of the entire contents of the largest vessel or container as a gas in ten-minutes.  The regulations require assuming worst-case wind speed and atmospheric conditions that result in the greatest projected impact distance. \n\nFor the offsite consequence analyses, the \"endpoint\" concentration is defined by the Emergency Response Planning Guideline (ERPG-2) values developed by the American Industrial Hygiene Association (AIHA).  AIHA defines the ERPG-2 value as, \"the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7138,
      "SummaryText": "to take protective action.\"  The endpoint (ERPG-2 value) established for chlorine is 0.0087 mg/L (3 ppm).\n\nFor the hilly/wooded/urban setting of the Greenwich region, the potential distance to the endpoint concentration for the worst-case release extends offsite into residential areas. RMP*COMP offsite consequence analysis software developed by the EPA was used to estimate the offsite impacts.\n\nA major release of the magnitude represented by this worst-case scenario is extremely unlikely because of the robust design of chlorine transport containers (they are designed to withstand transportation mishaps) and the rigorous maintenance and prevention programs in place at chlorine suppliers and the Putnam Plant.  In fact, release reporting databases and water industry experience suggest that the worst-case release scenario as defined in the RMP regulations is so unlikely that it should not be used as the basis for emergency planning.  A more reasonable potential release scenario for emergency planning is presented in \"The alternative release scenario(s)\" section below.\n\nAlternative Release Scenario\n\nA \"credible worst-case\" scenario was selected as the alternative release scenario. This scenario assumes that the unloading connection to a transport container is completely severed, resulting in a vapor release within the chlorine storage room. The mitigating affects of the building were considered by applying a factor of 0.55 to the release rate for an unmitigated release from this source. This means that the chemical release rate from the building is 55% of the release rate from the source. This factor is recommended for modeling the effects of building mitigation in the EPA's Offsite Consequence Analysis Guidance and is used by EPA's RMP*COMP software.\n\nThe results of the process hazard analysis (PHA) and the facility's operating history suggest that even this credible worst-case is extremely unlikely to occur, but it can serve as the basis for emergency planning. \n\nThe p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7138,
      "SummaryText": "otential distance to the endpoint concentration for this alternate release scenario extends offsite into the residential area immediately adjacent to the plant.  As with the worst-case scenario, actual distances and directions vary with terrain and weather conditions.\n\nAccidental Release Prevention Steps\n\nTo ensure a worst-case or alternative release scenario does not occur, the Putnam Plant maintains a release prevention program with the primary focus of protecting plant employees and the public from the hazards associated with an accident or release involving chlorine. The prevention program has twelve elements designed to meet both EPA and OSHA Process Safety Management requirements.\n\nConnecticut-American Water Company is committed to personnel safety, public safety, continued reliable operation and regulatory compliance.  Based on this commitment, the Operations Manager has assumed overall responsibility for the development and implementation of the Risk Management Program.  Other key plant supervisory staff also have clearly defined accountability and responsibility for each of the prevention program elements to meet both EPA and OSHA Process Safety Management requirements.\n\nOur prevention measures include the use of:\n\n- vacuum regulators mounted directly on the chlorine containers that automatically shut down the flow of chlorine if there is a leak on piping or equipment;\n- chlorine detectors and alarms to rapidly alert operators to any problems;\n- process safety information to document the safe process design;\n- process hazards analyses to evaluate the chemical and process hazards;\n- operating procedures to ensure that the system is operated safely;\n- maintenance, inspection and testing to ensure that the system is maintained according to applicable standards and manufacturer's recommendations;\n- training, hot work permits, contractor safety and employee participation programs to ensure that all employees and contractors working on and around the processes ar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7138,
      "SummaryText": "e aware of the hazards, can perform their job duties safely and know the actions to be taken in an emergency;\n- management of change and pre-startup safety reviews to ensure that changes are documented, analyzed and kept within the design basis;\n- incident investigation procedure to investigate each incident and \"near misses\" to determine root causes and make needed safety improvements;\n- and periodic compliance audits to ensure that our programs are working as they should to protect both employees and the public.\n\nFive-Year Accident History\n\nWithin the past five years, the Putnam Plant has not had any accidental releases that resulted in injuries or property damage. The plant has maintained an excellent safety record throughout its operating history and has never had a major chlorine release that had an adverse effect on the public.  \n\nEmergency Response\n \nIn the event that a chlorine release does occur, the Putnam Plant has an emergency response program that coordinates emergency response with the regional emergency management agency and the Local Emergency Planning Committee. If such a release did occur, plant personnel would contact the local emergency responders who would dispatch a trained HAZMAT team to the site to handle the chlorine release. \n\nPlanned Changes to Improve Safety\n \nWe continually work to safely manage the hazards of chlorine to protect our employees and the community we serve. The Risk Management Program will be maintained to reduce the risk of accidental releases and each year we will conduct training, review procedures, maintain the equipment and follow safe work practices. Periodically, we will audit our program, review our Process Hazard Analysis and coordinate with the community emergency response organization. We will also be assessing further safety enhancements to the facility over the next few years."
    }
  ]
}