{
  "FacilityID": 7208,
  "FacilityName": "Green Bay Water Utility Lake Water Pump Station",
  "FacilityStr1": "N4976 Lakeshore Drive",
  "FacilityStr2": null,
  "FacilityCity": "Town of Pierce",
  "FacilityState": "WI",
  "FacilityZipCode": "54216",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55061",
  "LEPC": "Kewaunee County LEPC",
  "FacilityLatDecDegs": "44.506667",
  "FacilityLongDecDegs": "-87.484722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 625934914,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Green Bay Water Utility",
  "OperatorStr1": "631 South Adams Street",
  "OperatorStr2": "PO Box 1210",
  "OperatorCity": "Green Bay",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54305",
  "OperatorZipCodeExt": "1210",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000091946",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 44.50667,
  "FRS_Long": -87.48472,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8680,
      "AltID": "Chlorination",
      "FacilityID": 7208,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 9538,
          "ProcessID": 8680,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8888,
          "ProcessID": 8680,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3825,
              "Process_NAICS_ID": 8888,
              "SafetyReviewDate": "1999-01-25 00:00:00",
              "PHA_Date": "1999-01-25 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-20 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "lowered chlorine detector",
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1999-06-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-15 00:00:00",
              "EquipmentInspectionDate": "1999-06-14 00:00:00",
              "EquipmentTested": "See PM schedule, equipment is inspected and tested as part of routine preventive maintenance",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "A detailed Prevention Program is available from the Green Bay Water Utility Kewaunee Pump Station",
              "_chemicals": [
                {
                  "PrimaryKey": 4357,
                  "PreventionProgram3ID": 3825,
                  "ProcessChemicalID": 9538
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7208,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Kewaunee County LEPC",
    "CoordinatingAgencyPhone": "9204872940",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7208,
      "SummaryText": "Executive Summary\nIntroduction \nChemicals are widely used in industry, in the home, and in the environment and are an integral part of everyone's daily lives.  They are transported on roads, water, and railways.  The Green Bay Water Utility (GBWU) Lake Water Pump Station uses chemicals, too.  The pump station uses chlorine to disinfect our water supply to provide safe drinking water.  The natural world contains more that 1,500 chlorine-containing compounds.  Human cells generate hypochlorite, a form of chlorine to fight infection.  Chlorine purifies our drinking water, disinfects our swimming pools and is truly life saving.  In fact the World Health Organization estimates that 25,000 children worldwide die every day from waterborne diseases resulting from the lack of a water disinfection agent such as chlorine.  \nStoring chemicals can be a hazard.  We take our safety obligations in storing and using chemicals as seriously as we take providing safe drinking water.  We at the GBWU Lake Water Pump Station have generated a Risk Management Plan that describes what could happen if there were to be an accident, the steps we take everyday to ensure that our pump station operates safely, and what we do in the event of an emergency.\nBackground\nThe USEPA's Clean Air Act Amendments of 1990 included provisions that require facilities that use certain substances to develop a formal plan to reduce the likelihood of an accidental release of the substances to the atmosphere and reduce the likelihood of serious harm to the public and the environment. Before these regulations were in place, the GBWU Lake Water Pump Station had already established many of the components of the plan. The requirements of this plan, commonly referred to as a Risk Management Plan (RMP), are detailed and codified in 40 CFR Part 68.  In addition to the RMP, OSHA requires that facilities develop plans to provide safe work environments.  The OSHA plan is known as Process Safety Management (PSM). Because the re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7208,
      "SummaryText": "gulations are very similar, the Prevention Program and the Emergency Response Program also serve as the OSHA PSM plan, and this document is therefore is referred to as the RMP/PSM plan.  The GBWU Lake Water Pump Station stores chlorine for disinfection in quantities above the regulatory thresholds at which a RMP/PSM is required. \nChlorine Process Safety Systems\nThe GBWU Lake Water Pump Station is an unmanned facility that stores chlorine in 1-ton containers.  Chlorine is mixed with the treated water prior to being pumped to homes and businesses. Chlorine is non-explosive and non-flammable, however, like oxygen it is capable of combustion under some circumstances.  In addition, it is an irritant to the respiratory system, eyes and skin.  Exposure through inhalation at high concentrations is toxic. To prevent accidental releases from occurring that may cause these injuries, the GBWU Lake Water Pump Station has several safety systems. These systems along with the Prevention Program described below greatly reduce the possibility of a significant release of chlorine from occurring. One safety system is the chlorine \"leak detectors\" that continuously monitor for leaks in the chlorine storage area.  Even the smallest of leaks activates alarms that immediately alert pump station personnel and allow them to prevent a potential release of chlorine to the atmosphere.  In addition, sensors monitor the system pressures and temperatures to detect abnormal conditions that may indicate that a chlorine leak is about to occur. These monitors allow corrective actions to be taken before a leak may occur.  To date, the safety systems in place have allowed the GBWU Lake Water Pump Station to achieve an excellent record in preventing accidents. \nSafety systems help reduce or eliminate the consequences of an accident, much like seat belts reduce injuries in car accidents and anti-lock brakes help avoid car accidents.  But, unfortunately accidents can occur.  By being prepared for an accide"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7208,
      "SummaryText": "nt, we can handle the situation in a way that protects those around us. At the GBWU Lake Water Pump Station they prepare for an accidental release by planning a course of action to address and handle the situation.  The Emergency Response Program details appropriate courses of action to be taken in the event of a release and is designed to protect people inside as well as outside of the pump station.  The combination of safety systems and the Emergency Response Program greatly reduces the risk due to a potential accidental release for people inside and nearby the pump station. \nComponents of the RMP\nThe RMP/PSM consists of three major parts. The first part is the Hazard Assessment. The Hazard Assessment is done to determine the effects that a release of a regulated substance could have on the public. The second part is a Prevention Program that consists of 12 elements designed to improve the system safety and decrease the likelihood of a release. The third part is the Emergency Response Program, which develops a plan for dealing with a release in the unlikely event that one would occur. \nHazard Assessment\nA Hazard Assessment was performed to determine the effects a release would have on the public. For chlorine, the distance a set endpoint concentration of the gas would travel must be determined. In addition, an estimate of the population that could be affected by a release of chlorine was determined, and sensitive receptors such as hospitals, schools, and nursing homes were identified. The Hazard Assessment considers two release scenarios-a \"worst case\" and an \"alternative case.\" \nIf a release were ever to occur, the gas would be migrate as the wind pushes it in the prevailing wind direction.  The wind would move the gas in primarily one direction.  But the regulations view the release as thought it would spread in all directions.  In other words, someone located upwind of the release at the distance determined in the Hazard Assessment would not be affected by the "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7208,
      "SummaryText": "release.   \nWorst-Case Scenario\nThe regulations require the development of a worst-case release scenario based on conservative assumptions. For example, it is required to assume that the entire contents of the largest single container of chlorine will be released over 10 minutes. This is unlikely to occur because the physical properties of chlorine would cause the chlorine to actually freeze over.  The frozen chlorine must then thaw to release further chlorine to the atmosphere.  This freeze-thaw cycle would slow the release.  Because of the freeze-thaw cycle the distance the chemical would travel is shorter than predicted.   In addition, the regulations require that active efforts to stop the release cannot be considered. In many scenarios active efforts to stop the release would reduce the amount released. The regulations also require that the worst-case scenario assume conservative atmospheric conditions that result in a larger area of impact. \nThe hazard assessment requires that the \"toxic endpoint\" or distance from the point of release to a location at which the chemical concentration equals or exceeds a certain concentration must be determined. That concentration is defined as the maximum airborne concentration below which individuals could be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects, or symptoms that could impair an individual's ability to take protective action. Because the cloud from a chlorine leak would disperse relatively quickly, an individual at a toxic endpoint would be exposed to the exposure limit concentration for much less than the 1 hour assumed by the limit. In addition, the exposure limit concentrations result in relatively minor health effects. Therefore, an individual at the toxic endpoint would be affected less than the results of the worst-case scenario may imply. Using these assumptions, computer modeling estimated that the distance to the toxic endpoint would be 1.6 miles.\nAl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7208,
      "SummaryText": "ternative Scenario\nThe RMP rule also requires that at least one alternative release scenario be evaluated. The alternative scenarios reflect a type of release that is more likely to occur compared to the worst-case scenario. Unlike the worst-case scenario, the alternative release scenario may consider active actions to stop or contain the release and a more realistic release quantity and release rate. Lastly, it assumes local, typical meteorology, which is more realistic than the conservative meteorological conditions that must be assumed for the worst-case scenario. The alternative release scenario for chlorine was a release of chemical through the pipe connecting the cylinder to the vacuum regulator. The alternative release scenarios are considered to be more representative of the effects likely in the event of a release. The distance that the alternative release of chlorine would travel was estimated to be 0.3 miles.\nPrevention Program\nThe Prevention Program consists of 12 elements designed to improve the system safety and decrease the likelihood of a release.\nEmployee Participation\nThe participation of the GBWU Pumping Section staff in preparing the RMP/PSM program was critical to the program's successful implementation. Employee participation is valuable because it increases the safety awareness of the staff and it allows the staff's experience in maintaining the processes to be incorporated into the plan.\nProcess Safety Information\nThe RMP regulations require that information concerning process chemicals, technology, and equipment be compiled as part of a RMP program. Emergency response planners can use such information to develop training programs and procedures, or as a general resource. The information will be supplied to contractors who will work in the chlorine process areas as part of the requirements outlined in the Contractors element. All the required process safety information was compiled as required by the RMP regulations. The information meets and"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7208,
      "SummaryText": " in many cases exceeds the minimum required by the regulations.\nProcess Hazard Analysis\nA process hazard analysis (PHA) was conducted systematically to evaluate potential causes and consequences of accidental releases. This information was used to improve safety and reduce the consequences of accidental releases. Equipment, instrumentation, utilities, human actions, and external factors that might affect the process were the focus of the PHAs that were performed for the chlorine process.\nThe PHA was conducted by a team of CH2M HILL design engineers with the assistance of GBWU Pumping Section staff familiar with the process maintenance and pump station management. The PHA was done using a \"Checklist\" method. Based on the results of the PHAs, changes in maintenance and other process safety management procedures that would improve the overall safety of the GBWU Lake Water Pump Station were identified. The changes that most affect the severity and likelihood of a release have been adopted by the GBWU Lake Water Pump Station and incorporated as part of the overall RMP/PSM Program. The other improvements and process modifications to reduce or eliminate potential hazards are scheduled to be implemented or incorporated.\nOperating Procedures\nOperating procedures previously developed by the GBWU Pumping Section for the chlorination process have been incorporated as part of the RPM/PSM. Written operating procedures assure continuous, efficient, and safe operation of the facility. The goal of the operating procedures is to provide clear instructions to safely operate the process. Operating procedures are also used to train new employees and to provide refresher training for existing staff.\nTraining\nAn effective RMP/PSM training program can significantly reduce the number and severity of accidental release incidences. Employees involved in operating or maintaining the chlorination process must receive training that includes applicable operating and maintenance procedures and an "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7208,
      "SummaryText": "overview of the process. Training must emphasize safety and health hazards and safe work practices.  Refresher process operation training must be provided at least every 3 years. \nContractors\nThe GBWU Pumping Section must make contractors aware of the known hazards of the chlorine process related to the contractors' work. In addition, the GBWU Pumping Section must make contractors aware of the applicable elements of its emergency response plan. The GBWU Pumping Section should screen contractors to identify ones who can perform work on or adjacent to the chlorine process without compromising the safety and health of employees at the facility. \nBefore allowing a contractor to work on or adjacent to the chlorine process, the GBWU Pumping Section must obtain and evaluate information regarding the contractor's safety performance and programs. When a contract involving work on or adjacent to the chlorine process is to be bid, the bidding procedures must ensure that contractor safety management requirements are met. If a contractor is to work in or adjacent to any covered processes, a safety briefing, to make the contractor aware of the GBWU Pumping Section's RMP/PSM plan requirements, must be conducted before work begins. Upon arriving at the pump station for the first time to perform work, the contractor will be presented a Contractor Safety Management Briefing Form that must be read and signed. \nPre-startup Review\nA pre-startup safety review must be conducted for any new covered process or for significant modifications to the existing chlorine process that necessitate a change in the process safety information. No new or significantly modified process will start up and no acutely hazardous chemicals will be introduced into such a process prior to the pre-startup safety review. The purpose of the pre-startup safety review is to ensure that the facility is ready to operate new and modified regulated processes safely. \nTo initiate the pre-startup safety review, all updated"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 7208,
      "SummaryText": " elements of the RMP/PSM Plan are assembled for review. This includes all process safety information, process hazard analysis, operating procedures, employee training and mechanical integrity. A pre-startup safety review team completes a pre-startup checklist. The pre-startup safety review team should complete and sign a Pre-startup Safety Review Form. This form documents the process, and helps ensure that the review has been properly performed. The Pre-startup Safety Review Form must be authorized before startup.\nMechanical Integrity\nAn effective mechanical integrity program is one of the primary lines of defense against a release. The mechanical integrity program also addresses equipment testing and inspection, preventative maintenance schedules, and personnel training. The intent is to ensure that equipment used to process, store, or handle chlorine is maintained and installed to minimize the risk of releases.\nThe GBWU Pumping Section maintenance staff use a computerized maintenance management system (Datastream) to generate and prioritize work orders and schedule preventative maintenance (PM). The Datastream system is used to generate work orders for preventative maintenance. In addition to preventative maintenance, the GBWU Pumping Section staff performs corrective maintenance in the event of equipment malfunction or breakdown. The staff that carryout maintenance are all trained as part of the RMP/PSM.\nHot Works Permits\nRMP/PSM regulations require employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the chlorine process. To ensure that hot work is done safely, a Hot Work Permit Program has been developed that requires a permit to be issued before hot work is performed. Hot work is defined as the use of oxyacetylene torches, welding equipment, grinders, cutting, brazing, or similar flame- or spark-producing operations.\nThe process of completing the hot work permit makes it necessary to identify the hazard, recogniz"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 7208,
      "SummaryText": "e what safeguards are appropriate, and then initiate the safeguards necessary to ensure a fire-safe workplace. Following the standards outlined in this section aid in complying with the OSHA Hot Works Regulations (1910.252(a)).\nManagement of Change\nA system for the proper management of changes and modifications to equipment, procedures, chemicals, and processing conditions is required under the RMP/PSM. Modifications to the chlorine system will be reviewed before they are implemented to determine if the modification would compromise system safety. An effective change management system will help minimize the chance for an accidental release.\nIf a modification covered under RMP/PSM is made, its effects must be addressed, employees must be informed, and the written procedures must be updated. The intent is to require that all modifications to equipment, procedures, and processing conditions other than \"replacement in kind\" be managed by identifying and reviewing them before implementation. The Supply Manager will evaluate any modifications that are covered under the RMP/PSM. The Supply Manager will complete a Management of Change Form and authorize the change prior to initiation of a covered change.\nIncident Investigation\nEach incident that resulted in or could reasonably have resulted in a catastrophic release of chlorine must be investigated. A process to identify the underlying causes of incidents and to implement procedures for preventing similar events has been developed. To investigate an incident, an investigation team will be established. As part of the investigation, an incident report will be prepared to recommend system changes.\nThe investigation team should ask questions such as what equipment failed, which behavior failed, and which material leaked, reacted, or exploded? As part of the incident review, staff actions that may have contributed to the incident will also be reviewed. A determination will be made as to whether it is necessary to institute addit"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 7208,
      "SummaryText": "ional training for the employees to prevent the incident from occurring in the future. On the incident report form, the Supply Manager identifies which of the recommended system changes are approved for implementation. The incident investigation report and any changes resulting from the report will be reviewed with all staff members who maintain the applicable system. \nCompliance Audit\nThe Green Bay GBWU Lake Water Pump Station is required to complete a compliance audit for the RMP/PSM program. The primary goals of conducting an internal compliance audit are to gather sufficient data to verify compliance with RMP/PSM requirements and good process safety practices, identify process safety deficiencies and develop corrective actions, and increase safety awareness among pump station staff.\nThe compliance audit methodology is modeled after OSHA's guidelines for conducting regulatory PSM compliance audits: Compliance Guidelines and Enforcement Procedures, OSHA Instruction CPL 2-2.45A (September 28, 1992). An internal compliance audit must be conducted at the pump station at least once every 3 years for the chlorine process. A team that includes at least one person knowledgeable in the covered processes and an audit leader knowledgeable in RMP/PSM requirements and audit techniques will conduct the audits. The Supply Manager and the audit team will promptly determine an appropriate corrective action for each deficiency identified during the audit and document the corrective actions and the dates by which they must be taken.\nEmergency Response Program\nThe Emergency Response Program develops a plan for dealing with a release. OSHA Process Safety Management regulation 29 CFR 1910.119(n) and EPA RMP regulation 40 CFR 68 Subpart E require that an Accidental Release Emergency Response Plan be prepared. The plan must be prepared in accordance with the provisions of another overlapping OSHA regulation-Employee Emergency Plans (29 CFR 1910.38(a)). The Emergency Planning and Respons"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 7208,
      "SummaryText": "e Plan described in this section complies with the requirements of 40 CFR 68.95 and 29 CFR 1910.38(a). \nThe Emergency Planning and Response plan provides specific emergency response procedures for accidental releases of chlorine. The emergency response procedures cover a release from the initial alarm stage through contacting responders and evacuation. As part of the emergency response procedures there are plans for victim rescue and communication with additional support agencies. It also addresses pump station site communication, emergency response equipment, first aid and medical treatment, and emergency response drills. In addition, critical pump station operations are identified to insure that, if possible, the critical GBWU Lake Water Pump Station functions are kept operational."
    }
  ]
}