{
  "FacilityID": 7222,
  "FacilityName": "Scott Candler Filter Plant",
  "FacilityStr1": "4380 Winters Chapel Road",
  "FacilityStr2": null,
  "FacilityCity": "Doraville",
  "FacilityState": "GA",
  "FacilityZipCode": "30360",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13089",
  "LEPC": "none",
  "FacilityLatDecDegs": "33.941944",
  "FacilityLongDecDegs": "-84.290833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "DeKalb County Public Works",
  "OperatorStr1": "4380 Winters Chapel Road",
  "OperatorStr2": null,
  "OperatorCity": "Doraville",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30360",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff Hudgins",
  "RMPTitle": "Plant Superintendent",
  "FTE": 67,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000089441",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-10-08 00:00:00",
  "DeRegistrationEffectiveDate": "2007-07-25 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.92339,
  "FRS_Long": -84.27036,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8710,
      "AltID": null,
      "FacilityID": 7222,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 8918,
          "ProcessID": 8710,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9576,
          "ProcessID": 8710,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509576,
          "ProcessID": 8710,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7222,
      "SummaryText": "The Scott Candler Filter Plant has prepared and implemented a Risk Management Program in accordance with the Chemical Accident Prevention Provisions of 40 Code of Federal Regulations (CFR) Part 68 to prevent the accidental release of chlorine and exposure to Scott Candler personnel and members of the community, as well as to the environment.  This Risk Management Plan (RMP) encompasses all the elements of the Risk Management Program.\n\nThe Scott Candler Filter Plant is located in the northern portion of DeKalb County, on Winters Chapel Road.  The plant uses chlorine stored in 1-ton containers to disinfect raw water prior to introduction to the DeKalb County water distribution system.  The Scott Candler Filter Plant will be changing form the use of chlorine to liquid sodium hypochlorite by 2003.  The plant treats approximately 80 million gallons per day of raw water that it pumps from the Chattahoochee River.  Chlorine at the facility is contained in 1-ton (2,000 lb) containers.  \n\nChlorine containers are stored on a standby/on-line basis so that the chlorination process is continuous.  The chlorination process is continuously monitored for chlorine gas leaks and is equipped with visible and audible alarms to alert personnel in the event of a release.  Scott Candler Filter Plant personnel are routinely trained to safely operate the chlorination system.  The Scott Candler Filter Plant preventive maintenance program ensures that equipment related to chlorine operations is maintained as fully operational.  Accidental release prevention and emergency response policies at the Scott Candler Filter Plant emphasize safety, training, and maintenance.\n\nA worst-case release scenario was estimated, based on the United States Environmental Protection Agency (EPA) guidance, to provide the greatest distance in any direction to the established toxic endpoint.  The worst-case release quantity, established by the regulations, is the greatest amount of chlorine held in a single vessel. "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7222,
      "SummaryText": "In accordance with 40 CFR ' 68.25, it is assumed that the gas is released over a 10 minute period. \n\nNo administrative controls or active mitigation measures were considered for the worst-case release scenario.  Tables from the EPA and Chemical Emergency Preparedness and Prevention Office (CEPPO) Risk Management Program Guidance for Wastewater Treatment Plants (EPA 550-B-98-010; October 1998) (EPA Guidance tables) were used to determine the distance to the toxic endpoint for the worst-case release scenario.  Public receptors were estimated within the radius.  No environmental receptors were identified.  \n\nThe five-year accident history was evaluated to determine a likely alternative release scenario.  Since no accidents have occurred in the last five years (since 1994), a review of common accidents that have occurred at other facilities involving 1-ton containers was considered.  It was determined that the most likely scenario for a chlorine release would be a ruptured flexible connector or \"pigtail.\"  Under the alternative release scenario, it is assumed that chlorine gas is released through the 0.25 inch diameter pigtail. Based on EPA Guidance tables, the release rate and the distance to the toxic endpoint were determined.  No public or environmental receptors were identified within the radius.  \n\nThe Scott Candler Filter Plant has developed an accidental release prevention program.  The primary safeguard is the chlorine leak detection system located at the chlorine storage area and chlorinator room.  The leak detection sensors are manually checked on a weekly basis to ensure they are functioning properly.  Operators inspect the chlorinator room every hour and the chlorine storage area every eight hours to ensure the chlorine feed system is also functioning properly.  Visible and audible alarms will sound at the operator control room located at the main building, and an audible alarm will sound at the chlorine storage room when the chlorine leak detection system d"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7222,
      "SummaryText": "etects an ambient air chlorine concentration of 1 part per million or greater. \n\nThe Scott Candler Filter Plant has established several programs to prevent accidental chlorine releases.  Specifically, the facility trains operators on the proper operation of the chlorination process, uses state-of-the-art safety equipment, and implements a preventive maintenance program to ensure the process equipment is operating properly.\n\nA review of the hazards associated with the Scott Candler Filter Plant chlorination process was conducted.  Results of the review and recommendations identified during the hazard review process that would improve safety at the facility are documented in the Hazard Review Checklist Analysis. \n\nThe Scott Candler Filter Plant personnel are trained to respond to an incidental release of chlorine.  Personnel have a mechanism in place to notify the DeKalb County Fire Services Hazardous Materials (Haz Mat) Team emergency responders in the event that a release is beyond the control of the operators.  Safety equipment available on-site includes Self-Contained Breathing Apparatus (SCBA) and ton container emergency repair kits ('B' Kits)."
    }
  ]
}