{
  "FacilityID": 7243,
  "FacilityName": "Mammoth Pacific LP",
  "FacilityStr1": "95 Casa 'Diablo Cutoff",
  "FacilityStr2": null,
  "FacilityCity": "Mammoth Lakes",
  "FacilityState": "CA",
  "FacilityZipCode": "93546",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06051",
  "LEPC": "Mono County Health Department",
  "FacilityLatDecDegs": "37.646389",
  "FacilityLongDecDegs": "-118.909389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "http://www.ogdencorp.com/",
  "FacilityEmailAddress": "mplp@qnet.com",
  "FacilityDUNS": 619719685,
  "ParentCompanyName": "Ogden Power Corp",
  "Company2Name": "Constellation Energy",
  "CompanyDUNS": 109094078,
  "Company2DUNS": 625133707,
  "OperatorName": "Bob Sullivan",
  "OperatorStr1": "P.O. Box 1584",
  "OperatorStr2": null,
  "OperatorCity": "Mammoth Lakes",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93546",
  "OperatorZipCodeExt": null,
  "FTE": 24,
  "OtherEPAFacilityID": "CAL000004488",
  "EPAFacilityID": "100000091713",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-03-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.644934,
  "FRS_Long": -118.914855,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8735,
      "AltID": "G1 100, 200",
      "FacilityID": 7243,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9601,
          "ProcessID": 8735,
          "ChemicalID": 107,
          "Quantity": 121500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8943,
          "ProcessID": 8735,
          "NAICSCode": "221119",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 8736,
      "AltID": "Unit G2 + G3",
      "FacilityID": 7243,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9602,
          "ProcessID": 8736,
          "ChemicalID": 107,
          "Quantity": 405000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8944,
          "ProcessID": 8736,
          "NAICSCode": "221119",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7243,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1996-10-01 00:00:00",
    "ERTrainingDate": "1999-06-04 00:00:00",
    "CoordinatingAgencyName": "Mono County OES",
    "CoordinatingAgencyPhone": "7609327549",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7243,
      "SummaryText": "Risk Management Plan Executive Summary\n\nDescription Of Corporate Prevention And Emergency Response Approach.\nThis facility complies with numerous standards for pressure vessel design and testing as well as all Federal and California process safety management requirements.  It is our policy to adhere to all applicable federal, state, and local laws.  Copies of emergency response, process hazard analyses and process safety management plans and all technical drawing (P&IDs) for process equipment are maintained onsite for reference.  Regular inspection and testing of systems in isobutane service are performed to ensure equipment integrity is maintained.  The facility is equipped with a network of leak detection equipment, automatic shutdown logic controls, deluge systems, fireproof insulation, safety relief valves, fire detection monitors.  Mammoth Pacific provides high levels of training in operating procedures, safety and emergency response.  If an emergency were to occur, it is our policy to implement the emergency response procedures to mitigate damages, and to notify the Long Valley Volunteer Fire Department and request that they respond to the emergency.  Long Valley determines if additional response is required by Mammoth Lakes Fire Department or Mono County OES.\n\nDescription of Stationary Source\n\nThe Mammoth Pacific Power Plants, are fueled by geothermal brine from the Casa Diablo Hot Springs. Mammoth Pacific G1 was built in 1984 and generates 10 megawatts. The G2 and G3 projects were built in 1990 and generate 22 megawatts of electrical power. The power from all three projects is sold to Southern California Edison. The project consists of 12 production wells and 8 injection wells. A total of eight single stage, radial flow gas expanders are used. \n\nThe plants utilize hot geothermal water as an energy source for binary Rankine cycle systems.  The basic Rankine cycle consists of four components:\n17 Pump - Work Input \n27 Boiler - Heat Input \n37 Turbine - Work Outp"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7243,
      "SummaryText": "ut \n47 Condenser - Heat Rejection\n\n \nThe Rankine cycle consists of pressurizing a liquid (isobutane), vaporizing the high pressure liquid, expanding the high pressure vapor and condensing the low pressure vapor for reuse.  The energy necessary for the vaporization is provided by geothermal brine at a maximum temperature of 3400F.  The geothermal energy is transferred to the Isobutane working fluid via tube and counter-current shell heat exchangers.  The MPLP facilities use commercial isobutane with a dry cooling heat rejection system.\n\nThe binary working fluid is Isobutane, a flammable vapor/liquid.  The Isobutane is present on-site at each facility is in various states including high pressure liquid, high pressure superheated vapor, low pressure liquid and low pressure superheated vapor as would be typical of a power generation process.  \n\nThe expansion of isobutane occurs in single stage radial turbo-expanders.  The condensing system utilizes ambient air to cool the Isobutane in fin-fan style induced draft heat exchangers.  A pressurized liquid accumulator vessel receives the cooled vapor and maintains the liquid inventory under pressure.\n\nPrimary Activities\n\nGeothermal energy is converted to electric power.  The facility is rated at 40MW.  The net power output to the electrical grid is 18 - 34 MW.  Power output is reduced in warm weather due to limitations of the air cooled heat exchangers.\nUse of regulated substance\nIsobutane, a flammable vapor/liquid is used as a binary working fluid. Liquid isobutane is pumped from a condenser to shell and tube heat exchangers.  Thermal energy provided by geothermal brine is transferred to the isobutane.  The geothermal heat input causes the isobutane state to change from liquid to high pressure superheated vapor that is passed through turbines to produce electric power.  The vapor is condensed and recycled back to a pressurized liquid accumulator vessel to complete the Rankine cycle.  Isobutane in storage tanks is available f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7243,
      "SummaryText": "or makeup.\n\nThe facility design is segregated into multiple sections, each having its own design specifications dictated by the Isobutane conditions in that section.  The sections include: the low pressure process equipment, the high pressure process equipment, Isobutane unloading system, vapor recovery system, evacuation system and non-condensable removal system.  Each section is protected by pressure relief systems that may include Pressure Safety Valves, Pressure Control Valves, control system shutdown and intervention logic and administrative practices.\n\nQuantities handled or stored\n\nThe design inventory of the system consists of Isobutane present both as a gas and as a liquid.  The nominal maximum liquid inventory exists when the facilities are not operating.  At that time the energy in the Isobutane is reduced and most of the inventory is present as a liquid in the liquid accumulator vessels.  The following chart indicates the normal maximum inventory at each plant at the facility:\n------------------------------------------------------------------\nPlant                   Liquid         Vapor          Total\n                        Inventory      Inventory      Inventory\n                        (pounds)       (pounds)       (pounds)\n------------------------------------------------------------------\nG1(U-100 & U-200)    120,000       1,500          121,500\nG2\t                            200,000        2,500          202,500\nG3\t                            200,000        2,500          202,500\n------------------------------------------------------------------\n\nWorst Case Scenario\n\nDescription\" Worst case scenario is based on a combined Plant G2 and G3 vapor cloud explosion.  Although safeguards are in place, that make a worst case scenario extremely unlikely, it was assumed the explosion originates at the G2 accumulator and propagates to the G3 accumulator and all equipment in vapor and liquid service.  The total isobutane material is 405,000 lbs.  \n---------------"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7243,
      "SummaryText": "----------------------------------------------------\nEnd point distance\nResults of Consequence Analysis RMP*Comp\nResults of Consequence Analysis\n\nChemical: Isobutane [Propane, 2-methyl]\nCAS #: 75-28-5\nCategory: Flammable Gas\nScenario: Worst-case\nLiquefied under pressure\nQuantity Released: 405000 pounds\nRelease Type: Vapor Cloud Explosion\nEstimated Distance to 1 psi overpressure: .6 miles (1.0 kilometers)\n\n--------Assumptions About This Scenario---------\nWind Speed: 1.5 meters/second (3.4 miles/hour)\nStability Class: F\nAir Temperature: 77 degrees F (25 degrees C)\n--------------------------------------------------------------------\n\nModeled distance to endpoint is not affected by the vapor state of the isobutane or by exclusion of the liquid and vapor components.  End point distance is reduced by 0.1 miles if explosion does not propagate to both units.  The impact zone for a worst case scenario of Unit G1 lies within the radius of the worst case scenario for G2 and G3. The RMP Comp model is a conservative screening tool and may overestimate distances to endpoint.  The model does not accommodate mitigative measures that may prevent propagation of any accident.\n\nExamination of topographic maps and visual observation of the potentially affected area in a worst case scenario did not identify any residential structures, parks or other public places.  The endpoint encompasses a portion or U.S. Route 395.  MPLP is located in a relatively isolated area surrounded by undeveloped land owned by the U.S. Forest Service and manged for mineral resources by Bureau of Land Management (BLM).  The facility is approximately 3-miles from the outskirts of Mammoth Lakes, CA (POP. 5000).\n\nPrevention Program Description\n\nSafety Information: \n\nThe facility is in compliance with OSHA's regulatory programs for Process Safety Management (29 CFR 1910.119), Emergency Action Planning (29 CFR 1910.120), and Hazardous Waste Operations and Emergency Response (HAZWOPER) Plan regulations (29 CFR 1910.38"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7243,
      "SummaryText": ").\n\nThe principal methods of accident prevention include equipment design safeguards, written procedures and operator/employee training.  Safety systems are present in the facilities and have various methods of operation.  \n\nPressure safety systems typically have three levels of degree.  The initial degree is an alarm that is presented audibly and visually to the Control Room Operator.  The next more severe degree is a shutdown of process equipment likely to be causing or exacerbating the condition and an alarm that is presented audibly and visually to the Control Room Operator.  The third and most severe degree of pressure safety system are Pressure Safety Valves which relieve to atmosphere or to larger low pressure systems.  Some of these PSV's also have Control Room Alarms.\n\nA combustible gas detection system is present in each of the plants.  Sensors are strategically located in each plant.  Control Room audio and visual alarms annunciate concentrations in excess of 40% of LEL.  A warning light is present at the entrance to the G2 and G3 facilities and it is lighted when combustible gas is determined to be a hazard at either facility.\n\nA fire suppression system is present in each of the plants.  Fusible links are utilized for activation of several systems.  Fusible links are capable of automatic activation of isolation valves in the Isobutane process system and high volume active deluge spray systems around major equipment which activates Control Room alarms.  A 250,000 gallon water storage tank provides an assured water supply for fire suppression equipment.\nA Distributed Control System Emergency Shut Down event (ESD), depending on the source alarm, will either automatically shutdown a process, or arm a shutdown procedure that needs to be confirmed before it is activated.  Several alarms can cause an ESD.  The ESD logic is explained in detail in Operation Manual Volume 3 Procedure OP E-203 Section 11.D.\nShutdown of Isobutane main pumps occurs when expander disc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7243,
      "SummaryText": "harge pressure exceeds predetermined values.  Values and shutdowns are staged at 10 psi increments below the set-points of the Pressure Safety Valves on the low pressure system.  Control type is hardwired logic.  Shutdown of Isobutane main pumps occur when expanders shutdown on a one for one basis.  Control Type is hardwired logic.\n\nProcess Hazard Analysis\n\nMPLP utilized a professional safety consultant experienced in binary geothermal power facilities to perform a hazard analysis appropriate to the complexity of the process for identifying, evaluating, and controlling hazards involved in the process and shall determine and document the priority order for conducting process hazard analyses based on the extent of process hazards, number of potentially affected employees, age of the process and process operating history.  A \"What-if\" analysis was selected and utilized.  \nOperation Procedures\nMPLP has developed and implemented written procedures that provide clear instructions for safely conducting activities involved in each process consistent with the process safety information.  The operations copy of the Operations Manuals consists of four Volumes located in the Control Room.\n\nMPLP maintains a library of documents that include engineering design specifications, manufacturers data sheets, Process and Instrument Diagrams(P&ID's), construction drawings and engineering calculations.  These are collected into bound volumes (Data Books) associated with each plant at the facility.  Copies are stored in the conference room at the office building, the General Facility Managers office, the instrument shop in the maintenance building and at the home office.  Additional copies of P&ID's are kept in the Operation Manuals in the control room.\n\nTraining\" Each employee presently involved in operating or maintaining a process, and each employee before working in a newly assigned process, is provided initial training including an overview of the process and in the operating procedur"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7243,
      "SummaryText": "es.  At least every three years, and more often if necessary, refresher and supplemental training are provided to each maintenance or operating employee and other workers necessary to ensure safe operation of the facility. Re-training was completed on 6/4/99.  Weekly safety meetings are used to identify maintenance priorities and to discuss improved procedures and training requirements.  Training certificates are maintained in employee records. Testing procedures are used to ensure competency in job skill levels and safe and healthy work practices.  \n\nMaintenance Procedures: MPLP has installed and operates a Computerized Maintenance Management Software (CMMS) program.  This CMMS contains information on all equipment in the facility requiring maintenance, inspections, testing, certification, calibration, etc..  NFPA, Cal-OSHA, manufacturer's recommendations and operations experience have been utilized to produce a comprehensive maintenance work order system that produces maintenance requests at appropriate frequencies.  Employees report any equipment deficiencies to the Control Room Operator who generates \"Work Orders\" for the repair or assessment of the problem.  Routine comprehensive inspections are performed using checklists.  \n\nIncident Investigation: MPLP has established a written form for prompt reporting and investigating every incident which results in or could reasonably have resulted in a major accident. The procedure is located in the Control Room in the Safety Manual Volume 1 Procedure SMP-17 \"Injury and Illness Prevention Program\" Subsection 1F.\n\nManagement Of Change: MPLP has established and implemented a written procedures to manage changes (except for \"replacement in kind\") to process chemicals, technology, and equipment, and changes to facilities. The procedure is located in the Control Room in Maintenance Manual Volume 1 Division 200 Section 201 \"Engineering Change Notice.\"\n\nContractors: Contractors that perform work in the process plant boundaries"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 7243,
      "SummaryText": "or at the well pads (not just at the general facilities) are required to participate in an orientation training session the first time that they are on site.  The training includes site rules, basic safety requirements, handling of emergencies, fire protection information and hazardous materials present at the site.  The safety brief is contained in the Plant Safety Manual Volume 1 Procedure SMP-1 Exhibit 6.  The hazardous materials information sheet utilized in the training is Exhibit 6 of the same procedure.  A copy of the Safety Manual Table of Contents is contained in Appendix H of this manual.\n\nHot Work Permits: MPLP has developed and implemented a written procedure for the issuance of \"hot work\" permits.  The procedure is located in the Control Room in Safety Manual Volume 1 Procedure SMP-14 \"Safety Permit for Work Requiring Special Precautions.\"\n\nManagement of Change: MPLP has established and implemented a written procedures to manage changes (except for \"replacement in kind\") to process chemicals, technology, and equipment, and changes to facilities. The procedure is located in the Control Room in Maintenance Manual Volume 1 Division 200 Section 201 \"Engineering Change Notice.\"\n\nAccident History: There have been no accidents related to the regulated equipment in the past five years, nor for the history of the facility.\nMPLP has established a written form for prompt reporting and investigating every incident which results in or could reasonably have resulted in a major accident. The procedure is located in the Control Room in the Safety Manual Volume 1 Procedure SMP-17 \"Injury and Illness Prevention Program\" Subsection 1F.\n\nEmergency Response Program: MPLP has developed and distributed a business plan for emergency response pursuant to subdivision (a) of Section 25503.5 and subdivision (b) of Section 25505 of the Health and Safety Code.  A copy of the Business Plan is available in the Control Room.\n\nEmergency response is based on recognition and observation o"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 7243,
      "SummaryText": "f potential emergency conditions, and immediate repair, or notification of the primary response agency.  The policy for emergency response at MPLP is to mitigate any accident by implementing emergency procedures that have been developed for all known contingencies.  Small fires will be contained and mitigated with water sprays, fire extinguishing equipment and automatic deluge and isolation controls.  Emergency notification is required for any release or threatened release of a hazardous material which poses a significant present or potential health, safety or environmental hazard.  The plant manager is designated incident command when present.  The senior operator is designated incident command when management is not present.  Incident command is transferred to emergency responders upon arrival."
    }
  ]
}