{
  "FacilityID": 7261,
  "FacilityName": "Richland Center",
  "FacilityStr1": "920 Sextonville Road",
  "FacilityStr2": null,
  "FacilityCity": "Richland Center",
  "FacilityState": "WI",
  "FacilityZipCode": "53581",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55103",
  "LEPC": "Richland LEPC",
  "FacilityLatDecDegs": "43.328222",
  "FacilityLongDecDegs": "-90.383444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "www.landolakes.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Land O'Lakes, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Land O'Lakes, Inc.",
  "OperatorStr1": "4001 Lexington Avenue North",
  "OperatorStr2": "PO Box 116",
  "OperatorCity": "Minneapolis",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55440",
  "OperatorZipCodeExt": "0116",
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000093864",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-06 00:00:00",
  "SafetyInspectionBy": "State of Wisconsin",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 43.32819,
  "FRS_Long": -90.38308,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8761,
      "AltID": "ammonia refrigeration",
      "FacilityID": 7261,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9642,
          "ProcessID": 8761,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 8969,
          "ProcessID": 8761,
          "NAICSCode": "31151",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3877,
              "Process_NAICS_ID": 8969,
              "SafetyReviewDate": "1999-05-15 00:00:00",
              "PHA_Date": "2001-05-15 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-05-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "PHA was in May 1999. Recommendations are being considered and documented for feasibility.",
              "OpProceduresReviewDate": "1999-06-08 00:00:00",
              "TrainingReviewDate": "1999-06-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-10 00:00:00",
              "EquipmentInspectionDate": "1999-04-06 00:00:00",
              "EquipmentTested": "System and vessels.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-10 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-10 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-10 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-17 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4431,
                  "PreventionProgram3ID": 3877,
                  "ProcessChemicalID": 9642
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7261,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-10 00:00:00",
    "ERTrainingDate": "1999-03-15 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "6086474556",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 7261,
      "SummaryText": "ccurrence of the worst-case and alternative-case release scenarios described in Section 2.0.  To help minimize the probability and severity of an ammonia release, a prevention program that satisfies the Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of Highly Hazardous Chemicals (29 CFR 1910.119) has been implemented.  The key components of the prevention program are summarized below:\n\n7 The development of an employee participation program, which includes Richland Center facility employees from all areas within the plant.\n7 The development, documentation, and operator availability of critical process safety information regarding the hazards of ammonia, the design basis of the system, and the equipment.  This information is used to fully understand and safely operate the ammonia refrigeration system.\n7 The performance of a formal process hazard analysis (PHA) on the ammonia refrigeration system using a What-If Protection Analysis.  A team with expertise in engineering, operations, maintenance, and safety evaluated the existing refrigeration system in depth and developed recommendations to improve the safety and operability of the system. The PHA is updated and revalidated every five years.\n7 Standard operating procedures (SOPs) are used to provide the basis for proper and safe operation of the ammonia refrigeration system.  The SOPs include procedures for normal operations, startup, shutdown, emergency operations, and emergency shutdown.  They also describe safe operating limits for temperature and pressure, the consequences of operating outside these safe operating limits, and a description of safety systems and how they operate.\n7 Refrigeration system operators receive refresher training at least every three years.  The training content is based on the process safety information and operating procedures.\n7 Contractors that are hired to work on, or adjacent to, the refrigeration system are pre-qualified based on their knowl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7261,
      "SummaryText": "edge of ammonia refrigeration, understanding of applicable codes and standards, and their demonstrated ability to work safely.  In addition, these contractors are periodically evaluated to ensure that they continue to work safely.\n7 A computerized preventative maintenance program is in place at the Richland Center facility.  This includes regular inspection of major powered equipment, including compressors, pumps and large fans, bearings, couplings, shaft seals, mountings, etc., for vibration or incipient mechanical failure, and regular inspection and calibration of liquid level sensors, temperature and pressure instruments, switches and shutdown devices that have safety implications.\n7 Formal authorization systems (i.e., management of change procedure, pre-startup safety review) are in place to ensure that system changes or expansions are as safe as the original design and that an independent recheck confirms that the changes are consistent with the engineering design and in a condition to be safely operated prior to startup.\n7 Events that might cause an accidental or unexpected release of ammonia are subjected to a formal investigation.  The objective of the investigation is to correct deficiencies in such a way as to prevent recurrence.\n7 Prior to the performance of any hot work (i.e., spark or flame producing operations such as welding, cutting, brazing, grinding), management must approve the work by executing a written hot work authorization permit to verify that precautions to prevent fire have been implemented.\n7 Planning with the local fire department to ensure a rapid response to potential incidents with the system or external events, such as floods or tornadoes.\n7 Adherence to fire codes and preparation for fires, storms, or events which could impact the ammonia system.\n7 Prevention program compliance audits are performed every three years to verify that the appropriate management systems are in place and are being properly implemented.  Any deficiency fou"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7261,
      "SummaryText": "nd in an audit is corrected.\n4.0\tACCIDENT HISTORY\nThere have been no accidental releases of ammonia at the Richland Center facility in the last five years that have resulted in death, injury, or significant property damage on site or off-site death, injury, evacuation, sheltering in place, property damage, or environmental damage.\n5.0\tEMERGENCY RESPONSE PROGRAM\nThe Richland Center facility has implemented a detailed written Emergency Incident Plan.  The Plan is intended to address all emergencies at the facility, in addition to incidents related to a release of ammonia.  In the case of an uncontrolled release of anhydrous ammonia, the facility will rely on local and remote response teams to respond to the release."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 7261,
      "SummaryText": "1.0\tSOURCE AND PROCESS DESCRIPTION\n1.1\tSource\nThe Elm Grove Dairy facility in Richland Center, Wisconsin (the Richland Center facility) is subject to the USEPA's Risk Management Program (RMP) for Accidental Chemical Release regulation (40 CFR 68) because it has a refrigeration system that contains more than the threshold quantity (10,000 pounds) of anhydrous ammonia (CAS Number 7664-41-7).  The facility actually has two separate systems.  The old system contains approximately 5,000 pounds of anhydrous ammonia, while the new system contains 15,000 pounds.  Therefore, the entire facility contains approximately 20,000 pounds of ammonia in various physical states (gas, liquid, and saturated vapor).  The largest vessel is the high pressure receiver on the new system that operates between 110 and 160 psig and can contain as much as 13,800 pounds of liquid ammonia, assuming a 90 percent fill volume.  However, during typical operation, the vessel holds only 4,600 pounds.  Most of the ammonia equipment is located indoors.  The condensing towers, small vessels called surge drums, refrigerated silos, and much of the system piping are located on or near the roof. \n\n1.2\tProcess Description\nThe ammonia refrigeration system at the Richland Center facility is a single-stage system that controls the temperature for milk, yogurt, and sour cream processing and packaging.  Equipment and piping carry the necessary gas, liquid, and saturated vapor throughout the system.  \n\nThe ammonia refrigeration system is protected by the existence of specific safety systems/hardware, including safety relief valves (SRVs), engine room ventilation, and system safety interlocks.  SRVs protect the compressor discharge, condensers, pumper drums, accumulators, and pump-out system from the hazards associated with over-pressure.  Safety interlocks include high pressure and high temperature alarms and cutouts for the compressors, as well as high level floats and sensors for the vessels.\n2.0\tPOTENTIAL RELEASE"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7261,
      "SummaryText": "SCENARIOS\nAs required by the RMP rule requirements, two specifically defined release scenarios (a worst-case release and an alternative-case release) were analyzed to determine the maximum distance to an endpoint where the ammonia concentration is 200 parts per million in air, or 0.02 percent.  The release scenarios analyzed are based upon the guidance contained in the USEPA's Model Risk Management Program and Plan for Ammonia Refrigeration (the Model Plan), dated May 1996.\n\n2.1\tWorst-case release\nThe worst-case release is defined by the catastrophic rupture and complete loss of the contents of the largest vessel and associated piping (approximately 13,800 pounds of ammonia) over a 10-minute period.  Using the specified worst-case meteorology contained in the Model Plan and assuming the facility is located in a rural area, the distance to the endpoint for a worst-case release extends beyond the facility's property boundary.  \n\nAlthough the worst-case consequence analysis is required by the RMP, it should be considered a highly unlikely event.  Design, construction, and operation of the high pressure receiver is such that catastrophic failure is extremely remote.  The receiver was designed and constructed in strict accordance with the American Society of Mechanical Engineers (ASME) Boiler and Pressure Vessel Code (Section VIII), and was certified and stamped by the National Board of Pressure Vessel Inspectors (National Board).  Third party and state mandated inspections of the vessel's condition occurs every year by a State of Wisconsin inspector.\n\nThe vessel is operated well below the design pressure (i.e., maximum allowable working pressure) and because of the safety factors built into the ASME Code, a fourfold pressure excursion would have to occur before catastrophic vessel failure.  If this were to occur, the vessel is equipped with dual safety relief valves (SRVs) set to relieve internal pressure at 250 psig.  A high pressure excursion would not occur as lo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7261,
      "SummaryText": "ng as the SRVs continued to function.  Actuation of the SRVs would result in an ammonia release similar to that described in Section 2.2 for the alternative release scenario.\n\nThe worst-case release scenario is unlikely for the following additional reasons:\n\n7 The facility has a preventive maintenance program in place to maintain the ongoing integrity of the vessels;\n7 The facility has a training program designed to ensure that the system is operated by qualified personnel;\n7 Main ammonia shut-offs have been labeled to allow personnel to stop the flow of ammonia quickly in an emergency.\n2.2\tAlternative-case release\nThe alternative scenario is defined by a release of ammonia that is more likely to occur than the worst-case scenario, and reaches an endpoint offsite.  \n\nThe Model Plan scenario was used for this analysis, which assumes a release of ammonia through a <-inch effective diameter hole in a high side (i.e., 150 psig) pipe or vessel, releasing 91.5 pounds of ammonia per minute.  Because the building can serve as a passive mitigator to this release, passive mitigation  was used to reduce the release rate and the distance to the endpoint.  Using the specified meteorology contained in the Model Plan, the distance to the endpoint for the more likely release scenario extends beyond the facility's property boundary.\n\nThe alternative release scenario is unlikely for the following reasons:\n\n7 Industrial standards were followed for the manufacture and quality control of these lines;\n7 The facility has a sprinkler system throughout the plant;\n7 Ammonia detectors exist in the engine room, which would detect a leak quickly; \n7 The facility has a preventive maintenance program in place to maintain the ongoing integrity of the system; and\n7 The facility has a training program designed to ensure that the system is operated by qualified personnel.\n3.0\tPREVENTION PROGRAM\nThe facility has carefully considered the potential for accidental releases of ammonia, such as the o"
    }
  ]
}