{
  "FacilityID": 7406,
  "FacilityName": "Palestine Water Treatment Plant",
  "FacilityStr1": "County Road 372",
  "FacilityStr2": null,
  "FacilityCity": "Palestine",
  "FacilityState": "TX",
  "FacilityZipCode": "75801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48001",
  "LEPC": "Anderson County LEPC",
  "FacilityLatDecDegs": "31.783611",
  "FacilityLongDecDegs": "-95.604167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Palestine",
  "OperatorStr1": "504 N. Queen St.",
  "OperatorStr2": null,
  "OperatorCity": "Palestine",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75801",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Socia",
  "RMPTitle": "Utilities Director",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000092204",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 31.78361,
  "FRS_Long": -95.60417,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8934,
      "AltID": null,
      "FacilityID": 7406,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 9152,
          "ProcessID": 8934,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9848,
          "ProcessID": 8934,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509848,
          "ProcessID": 8934,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7406,
      "SummaryText": "Chemical safety is a very important issue to both management and employees of the City of Palestine.  Generally, this is achieved through adequate training of employees, maintenance of facilities and process equipment, and provision of suitable safety equipment.  City administration continually seeks to improve the safety measures that protect its employees and citizens alike.\n\nThe Water Treatment Plant produces all of the water used by customers of the City of Palestine and seven nearby rural water supply companies. Once the water arrives at the plant from the river, it is treated with various chemicals including powdered activated carbon for taste and odor control, alum for flocculation and sedimentation, and lime for pH adjustment.  Finally, chlorine is added to the water as a disinfectant. \n\nChlorine is the only regulated chemical used in quantities great enough to cause the plant to be subject to 40 CFR Part 68.  Approximately twelve thousand (12,000) pounds of chlorine are generally stored at the plant.  Two containers are connected to the chlorine feeding equipment at a time.\n\nOFFSITE CONSEQUENCE ANALYSES\n\nAll of the offsite consequence analyses were conducted according to the methodologies and reference tables presented in EPA's Risk Management Program Guidance for Wastewater Treatment Plants (October, 1998).  Population density information was taken from 1990 census data obtained through the Bureau of the Census website.\n\nWorst Case Scenario:\n\nThe vessels used to store chlorine at the plant are one ton containers.  Therefore, the worst case scenario involves the release of two thousand (2000) pounds of chlorine in ten minutes.  The resulting release rate would be two hundred (200) pounds per minute.  \n\nBecause the plant is located in a forested area, the terrain is considered to be urban.  The resulting distance to the toxic endpoint would be one and three tenths (1.3) miles.  The area of concern covers approximately five and three tenths (5.3) square miles"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7406,
      "SummaryText": ".  The population density for approximately one and five tenths (1.5) square miles of the area averages six hundred forty-five (645) persons per square mile.  The remaining three and eight tenths (3.8) square miles contain approximately three hundred and ninety (390) persons per square mile.  The total number of people estimated to be affected by a worst case release is twenty-four hundred (2400).  Public receptors within the area include residences, schools, and a park.  \n\nAlternative Scenario:\n\nThe situation chosen as an alternative scenario is a release caused by a faulty gas valve.  This is believed to be one of the most likely events to be encountered at this facility.  \n\nUsing the data in the guidance, the distance to the toxic endpoint would be two tenths (0.2) miles.  The area of concern covers approximately thirteen hundredths (0.13) square mile.  The population density for approximately nine hundredths (0.09) square mile of the area averages six hundred forty-five (645) persons per square mile.  The remaining four hundredths (0.04) square miles contain approximately three hundred and ninety (390) persons per square mile.  The total number of people estimated to be affected by an alternative case release is seventy-four (74).  The only public receptors within the area are residences.\n\n\nPREVENTION PROGRAM\n\nThe most important element of prevention is training.  The topics covered in the City's chemical safety training program include information on the properties of chlorine and the risks associated with its use.  It will also cover safe operating practices.\n\nEquipment maintenance is another crucial aspect of preventing a chemical release.  Employees will be taught the importance of keeping all chlorine process equipment in good working order, and trained in carrying out maintenance, inspections, and repairs according to the maintenance program established for the process.\n\nAnother significant factor in preventing an accidental release of chlorine is the natu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7406,
      "SummaryText": "re of the feeding apparatus.  It is a vacuum system with the dripleg and regulator assembly connected directly to the container.  This arrangement minimizes the possibility of an equipment failure in a part of the system in which the chlorine is under pressure.  The regulator is designed to stop the flow of chlorine should a loss of vacuum occur.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nNo releases that met the criteria for reporting have occurred within the last five years.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nShould a release occur, the first priority will be to evacuate the site and surrounding area, as appropriate.  The City Fire Department and Police Department will aid plant employees in accomplishing this task.  Any schools in the affected area will be among the first to be alerted.  Door to door contacts will be made along with public announcements on local radio stations.\n\nThe City has contracted with Garner Environmental Services, Inc., Ft. Worth, Texas to respond to any significant chemical release that may occur in the City.  As soon as the notification and evacuation process is underway, Garner Environmental will be notified to respond.\n\n\nPLANNED IMPROVEMENTS\n\nThe most significant improvement planned in the area of chemical safety is more training for employees.  A training program has been developed and a designated safety trainer to coordinate the program has been appointed.  Operations and maintenance training will be also be increased.\n\nMoney is being budgeted to improve the leak detection and alarm equipment.  Other less expensive equipment such as labels and a windsock will be purchased shortly."
    }
  ]
}