{
  "FacilityID": 7438,
  "FacilityName": "Frontier Cooling, Inc.",
  "FacilityStr1": "2600 Bonita Lateral Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Santa Maria",
  "FacilityState": "CA",
  "FacilityZipCode": "93458",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06083",
  "LEPC": null,
  "FacilityLatDecDegs": "34.963",
  "FacilityLongDecDegs": "-120.506667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 62845292,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Norman Teixeira",
  "OperatorStr1": "2600 Bonita Lateral Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Santa Maria",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93458",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dan Piester",
  "RMPTitle": "Manager",
  "FTE": 28,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000093873",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-11-24 00:00:00",
  "DeRegistrationEffectiveDate": "2008-09-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.96324,
  "FRS_Long": -120.50358,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Quantities of stored Anhydrous Ammonia are below 10,000lb threshold",
  "_processes": [
    {
      "ProcessID": 8967,
      "AltID": "Refrigeration",
      "FacilityID": 7438,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 9187,
          "ProcessID": 8967,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9888,
          "ProcessID": 8967,
          "ChemicalID": 56,
          "Quantity": 14818.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509888,
          "ProcessID": 8967,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7438,
      "SummaryText": "     This is to inform all interested persons, including employees, that Frontier Cooling, Inc. is compying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals. In this way we promote overall plant, worker, and public safety. These programs enable our facility to prevent the occurance, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents. Overall, these programs prevent accidental fatalities, injuries, illnesses, and avoid physical property damage.\n     Our safety programs are applied to any activity involving hazardous chemicals including any use, storage, handling, on-site movement, or combination of these activities. Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release is considered a single process.\n     Our safety programs prevent accedents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment. These rules are detailed and improved as necessary. They are also communicated to and accepted by all employees at the facility.\n     Our facility uses, handles, stores, and moves a hazardous chemical, Anhydrous Ammonia, which fall under the PSM/RMP regulations. The facility uses Anhydrous Ammonia as the refrigerant in pre-cooling equipment, and refrigerated warehousing which handles cool season vegetables that are shipped 12 months per year. Anhydrous Ammonia is stored as a high pressure liquid in two receivers. The ammonia is piped to process equipment through the main plant liquid solenoid valve. The ammonia passes through expa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7438,
      "SummaryText": "nsion valves located on the process equipment which reduces the pressure and temperature of the liquid ammonia. Low temperature liquid ammonia is recirculated to the vacuum tube and cold room evaporators where heat is gained causing the liquid ammonia to boil or vaporize. Liquid and vapor are returned to the recirculator and separated. The hydrocooler is gravity fed. The vapor from the hydrocooler and ammonia liquid recirculators travels to one of seven reciprocating compressors in the main system where the vapor is compressed. The discharge vapor from the compressors is condensed back into a high pressure liquid in one of four evaporative condensers then returned to the high pressure receivers.\n     There are two ice plants on site. They are separately packaged from the main system, and from each other. High pressure liquid ammonia is stored in the receiver on each ice plant, it is piped to two ice makers which are gravity fed.The high pressure liquid ammonia passes through an expansion valve located on the ice makers which reduces the pressure and temperature of the liquid ammonia. Heat is transfered from water in the ice maker to the low temperature liquid ammonia causing the ammonia to boil or vaporize. The low pressure vapor travels to a screw compressor where it is compressed. The discharge vapor from the screw compressor is condensed back into a high pressure liqid in the evaporative condenser then returned to the receiver."
    }
  ]
}