{
  "FacilityID": 7444,
  "FacilityName": "CONDEA Vista Company Oklahoma City Plant",
  "FacilityStr1": "5200 S.E. 59th Street",
  "FacilityStr2": null,
  "FacilityCity": "Oklahoma City",
  "FacilityState": "OK",
  "FacilityZipCode": "73135",
  "Facility4DigitZipExt": "4536",
  "FacilityCountyFIPS": "40109",
  "LEPC": "Oklahoma County LEPC",
  "FacilityLatDecDegs": "35.400833",
  "FacilityLongDecDegs": "-97.432778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "P2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.condeavista.com",
  "FacilityEmailAddress": "jhuckabay@cvcnet.com",
  "FacilityDUNS": 115359416,
  "ParentCompanyName": "CONDEA Vista Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "CONDEA Vista Company",
  "OperatorStr1": "P.O. Box 15360",
  "OperatorStr2": null,
  "OperatorCity": "Oklahoma City",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "73155",
  "OperatorZipCodeExt": "5360",
  "FTE": 58,
  "OtherEPAFacilityID": "OKD071226344",
  "EPAFacilityID": "100000094284",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-01-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2012-06-27 00:00:00",
  "DeRegistrationEffectiveDate": "2009-01-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.40629,
  "FRS_Long": -97.42844,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 8973,
      "AltID": "PVC Resin Production",
      "FacilityID": 7444,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 9894,
          "ProcessID": 8973,
          "ChemicalID": 101,
          "Quantity": 6000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9193,
          "ProcessID": 8973,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 3991,
              "Process_NAICS_ID": 9193,
              "SafetyReviewDate": "1997-05-01 00:00:00",
              "PHA_Date": "1999-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "None",
              "PHACompletionDate": "1997-05-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "None",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "None",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "None",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "None",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "None",
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "None",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "None",
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-05-25 00:00:00",
              "EquipmentTested": "F-302 Receiver",
              "ChangeMgmtDate": "1999-06-15 00:00:00",
              "ChangeMgmtReviewDate": "1994-09-01 00:00:00",
              "PreStartupReviewDate": "1999-05-12 00:00:00",
              "ComplianceAuditDate": "1997-12-01 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": "1999-05-25 00:00:00",
              "InvestigationChangeDate": "1999-12-31 00:00:00",
              "ParticipationPlansReviewDate": "1992-06-01 00:00:00",
              "HotWorkPermitReviewDate": "1997-12-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-07 00:00:00",
              "ContractorSafetyEvalDate": "1999-01-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4561,
                  "PreventionProgram3ID": 3991,
                  "ProcessChemicalID": 9894
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7444,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1999-06-09 00:00:00",
    "CoordinatingAgencyName": "Oklahoma City Fire Department",
    "CoordinatingAgencyPhone": "4052972255",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "None"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7444,
      "SummaryText": "Executive Summary\n\nThe CONDEA Vista Oklahoma City Plant has a long history of safe operation in the community.  Our employees work hard every day to provide a safe work place and protect the environment both inside and outside of our fences.  \n\nPlant Information\n\nThe Oklahoma City Plant produces Polyvinyl Chloride (PVC) resin.  Although there are many different uses for PVC, the Oklahoma City Plant product is used primarily by the PVC pipe and vinyl siding markets.  \n\nThe Oklahoma City Plant produces PVC resin by polymerizing vinyl chloride monomer (VCM).  After the polymerization step is complete, the resin is dried and stored for shipping to our customers.  Most of the vinyl chloride monomer that we consume is shipped to us by rail from the CONDEA Vista Vinyl Chloride Plant in Lake Charles, Louisiana.  Vinyl chloride monomer is gas at normal conditions, but is kept under pressure and handled as a liquid much the same way that propane gas is handled.  At certain concentrations, VCM is flammable and we have many safety systems in place to deal with this hazard.\n\nWorst Case Scenario\n\nIn calculating the worst-case scenario for flammable gases, the Environmental Protection Agency (EPA) requires the following assumptions to be made:\n\n* A catastrophic (complete) failure of the largest storage vessel occurs.\n* There is a complete loss of the contents of the vessel and the liquid vaporizes in ten minutes.\n* Sufficient air and vapors mix to generate a vapor cloud explosion with 10 percent yield - the worst seen for mixtures of flammable vapors with air.\n* None of the plant procedures or emergency systems work.\n* The vapor cloud ignites as soon as the material vaporizes.\n\nThe EPA regulations also require the  company to define the impacted areas within which one could see a shock wave of greater than one pound per square inch (psi) overpressure in the unlikely event that a vapor cloud explosion were to occur.  A one psi overpressure could cause partial demolition of house"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7444,
      "SummaryText": "s and shattering of glass windows.\n\nThe possibility of a worst-case scenario happening is extremely remote due to the assumptions made in determining this scenario; however, the worst-case scenario is intended to be the worst-case and as such defines the largest possible impacted zone.\n\n\n\n\nAt the Oklahoma City Plant, the largest storage vessel is the vinyl chloride monomer (VCM) storage sphere. The maximum capacity of this tank is 4,900,000 pounds of vinyl chloride monomer.\n  \nIf the storage sphere is:\n1. Completely liquid full and\n2. It ruptures and\n3. None of our safety systems work and\n4. It is a hot day and\n5. All of the liquid VCM vaporizes in 10 minutes and\n6. The wind mixes in just enough air without dispersing the vapor cloud and \n7. At that precise moment, a spark sets off an explosion and the maximum explosive yield is generated.\n\nThen, and only then, would the impacted area include the area in a 1.0 mile circle around the storage sphere as calculated using the the Risk Management Program Guidance for Offsite Consequence Analysis. \n\nAlternate Release Scenario\n\nOther release scenarios are also required to be considered.  These alternate-case scenarios generally involve smaller releases and safety systems can be considered in determining the extent of the impact.  \n\nFor the Oklahoma City Plant's alternate-case, it was assumed that an 8-inch pipe was broken from the bottom of the liquid full vinyl chloride storage sphere releasing 500,000 pounds of vinyl chloride in 30 minutes.  It is assumed that the plant's gas detection system detects the release but due to a valve misfunction, the system is unable to close the automatically controlled isolation valve; however, the Emergency Response Team is able to stop the release within 30 minutes.  If this scenario were to actually happen, the plant's water deluge system would be activated immediately which would knock down many of the vinyl chloride vapors which would help to prevent a vapor cloud fire.  H"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7444,
      "SummaryText": "owever, for the alternate release scenario impact area calculation, no vapor knock down was taken into consideration.    \n\nFor this scenario, the potential impact area for a vapor cloud fire would be limited to a 0.1 mile circle around the sphere as calculated using the National Safety Council's Aloha Software.  Due to the location of the sphere, there is no off-site impact. \n\nThe CONDEA Vista Company Oklahoma City Plant is proud of the fact that we have never experienced a vinyl chloride release resulting in impact on our neighbors.  With our safety systems and employees working every day to prevent chemical accidents, we are confident that this record of safe operation will continue in the future.\n\n\nAccident Prevention\n\nAccident prevention is a large part of every job at the Oklahoma City Plant.  We work hard to make sure that our systems, procedures and people are all working together to prevent accidents from occurring.  To ensure safe operations of our plant, we have many systems in place including:\n\n* Two independent gas detection systems (air monitors)\n* Thermal oxidizer for combusting vinyl chloride vapors\n* Computer-based maintenance planning and tracking system\n* Routine program audits for improvement\n* Process-qualified personnel\n* Extensive Maintenance Procedures\n* Relief valves for relieving excess pressure\n* Extensive Operating and Emergency Shut Down Procedures\n* Preventative and Predictive Maintenance Programs\n* Tank containment systems\n* Computer process control systems\n* Equipment corrosion monitoring programs\n* Automatic (fail closed) isolation valve systems \n* Formal Equipment Inspection Programs\n* Automatic heat detector shut down system \n* Fireproofing around critical structural members\n* Formal incident reporting and investigation system\n* Vibration Monitoring to predict equipment life and plan maintenance\n* Infrared testing of electrical and heat-producing equipment\n* Quality Assurance and Control Processes\n* Emergency back-up power supply"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7444,
      "SummaryText": "* Automatic deluge (water spray) systems, sprinkler systems, and fire pumps\n* Behavior-Based Safety Improvement Process with peer-to-peer coaching\n* Detailed employee training courses with testing and skill examinations\n* Management of Change procedures with complete reviews, including hazard analysis and pre-startup safety reviews\n* Extensive safety, health, and environmental programs and procedures including the CMA Responsible   Care ( program.\n\n\n\nAccident History\n\nNo incidents have occurred at the Oklahoma City Plant requiring reporting under the EPA Risk Management Plan. \n\nEmergency Response\n\nAlthough we hope we never respond to an emergency, the Oklahoma City Plant actively prepares for the unexpected.  Our emergency preparedness efforts focus on four key areas:\n\nPersonnel - The Oklahoma City Plant is protected by a 17-member volunteer Emergency Response Team (ERT) comprised of employees from various plant departments.  The ERT provides fire suppression, confined space/industrial rescue, emergency medical, and hazardous materials response services.  Nationally Certified Fire/Rescue Instructors provide member training.  Outside courses are an integral part of team training, and members attend Fire/Rescue Training at Texas A&M University, Emergency Medical Training at Moore-Norman Technology Center, and Railroad Hazardous Materials Training in Colorado.  The ERT recently obtained certification as an Oklahoma State Department of Health First Responder Agency.\n \nResources - Fixed emergency equipment at the Oklahoma City Plant includes an emergency siren and pager system to alert responders, two emergency generators, an emergency air compressor, automatically-activated fire pumps, automatic deluge (water spray) systems, automatic sprinkler systems, smoke detector system, two gas detector systems, and an automatic heat detector shut down system.  Portable equipment includes fire monitors, hose lines, fire extinguishers, hand-held gas detectors, firefighter protectiv"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7444,
      "SummaryText": "e clothing and breathing apparatus, confined space/rope rescue equipment, emergency medical care supplies, and hazardous materials response equipment. \n\nPlanning/Drills - The Oklahoma City Plant has an extensive Emergency Response Plan for on-site incidents.  The plan was developed in coordination with the Oklahoma County Local Emergency Planning Committee and Oklahoma City Fire Department.  In addition, CONDEA Vista Company maintains a plan for off-site incidents and is a participating member under the Chemical Manufacturers Association VCNET Program.  Under VCNET, CONDEA Vista will respond to Vinyl Chloride Emergencies anywhere in the central U.S. region to offer advice and assistance.\n\nEmergency drills and exercises are a must to ensure member skills are maintained at peak efficiency and equipment and procedures function as expected.  The plant hosted the 1997 Oklahoma County Emergency Response Drill and conducts regular drills and exercises to ensure the emergency system undergoes continuous improvement.  A drill in early 1999 included participants from the Oklahoma City Fire Department, Oklahoma Department of Environmental Quality, Oklahoma County Emergency Management, and Oklahoma County Local Emergency Planning Committee.\n\nResponse Alliances - The plant works closely with the Oklahoma City Fire Department, Oklahoma County Local Emergency Planning Committee, and Oklahoma County Department of Emergency Management to ensure that sufficient resources will be available during an emergency.  Outside responders participate in annual plant pre-planning and familiarization sessions in the event that they are called on to provide assistance."
    }
  ]
}