{
  "FacilityID": 7475,
  "FacilityName": "Water Treatment Plant",
  "FacilityStr1": "440 Tayman Drive",
  "FacilityStr2": null,
  "FacilityCity": "Midlothian",
  "FacilityState": "TX",
  "FacilityZipCode": "76065",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48139",
  "LEPC": null,
  "FacilityLatDecDegs": "32.501361",
  "FacilityLongDecDegs": "97.016028",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "G4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Midlothian",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Midlothian",
  "OperatorStr1": "104 W. Avenue E",
  "OperatorStr2": null,
  "OperatorCity": "Midlothian",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76065",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Chutchian, PE",
  "RMPTitle": "Engineer",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000093463",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 32.53185,
  "FRS_Long": -96.99075,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9006,
      "AltID": "Disinfection",
      "FacilityID": 7475,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 9226,
          "ProcessID": 9006,
          "NAICSCode": "325181",
          "_desc": {
            "NAICS_CODE": "325181",
            "NAICS_DESCRIPTION": "Alkalies and Chlorine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 9951,
          "ProcessID": 9006,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 509951,
          "ProcessID": 9006,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7475,
      "SummaryText": "The City of Midlothian treatment facility mission is to prevent the release, in an uncontrolled manner, of any agents presenting a risk to public safety and welfare.  The City, as a part of the treatment process, has in inventory a quantity of chlorine in excess of the maximum EPA RMP Threshold.  As a result, the City has prepared a Risk Management Plan (RMP) involving a hazard assessment, prevention program, and emergency release response.  The key components of the plan include the following:\n\n     1. Registration of the Facility\n     2. Certification Statement\n     3. Worst-Case Scenario\n     4. Five-year Accident History\n     5. Emergency Response Program\n\nThe risk management is the identification and evaluation of the potential losses arising from future events such as toxic chemical releases from the site.  Elements of the RMP use this knowledge to create a safer and more disciplined plant operation.\n\nInvestigations were made of past plant operations for identification of procedures that may lead to incidents.  These investigations examined the following:\n\n     1. Operating and emergency procedures.\n     2. Training of operators in operations and emergency response.\n     3. Equipment fabrication, construction, and maintenance.\n     4. Contractor training, work practices, and evacuation procedures.\n     5. Prior incidents and potential for reoccurrence.\n\nControlling the potential for risks is a complex undertaking requiring a comprehensive approach.  The RMP addresses all phases of the facilities design and operation.  The RMP strives to create a better understanding of the process and its hazards by the operators, improved maintenance, increased emergency preparedness, and reduced costs related to accidents and resulting injuries.\n\nThe RMP focuses on the outcome of a chlorine release at the treatment facility.  The purpose is to reduce the impact or affect of an event on the operators and general public.\n\nThe RMP includes provisions for an update at least once"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7475,
      "SummaryText": " every five years.  Therefore, the plan is a living document evolving as the additional process hazards are identified.  The changes that can significantly increase process hazard and trigger the need for an update are as follows:\n\n     1. Increasing chemical storage or adding a regulated chemical.\n     2. Modifying piping and valve arrangements.\n     3. Changing materials of construction.\n     4. Modifying control logic or set points.\n\nThe key ingredient to the RMP is the communication between the City and the general public.  The general public will have access to the RMP and be involved in the communication program.  It is essential to differentiate between the difference in a hazard and risk.  Hazards are inherent properties that cannot be changed.  Chlorine gas is toxic when inhaled or ingested.  Nothing can be done to change these properties.  Risk is evaluated based on the likelihood of a release occurring.  The inherent hazards of chlorine combined with the quantity of chlorine released are evaluated as the risk involved in the process. The likelihood of a catastrophic release is very remote.  The RMP provides a systematic methodology to reduce the risk to the lowest possible level.\n\nThe plan includes procedures for informing the public and local emergency response agencies when a release occurs.  The RMP manager will be responsible for implementing the emergency response action plan.  Training will be scheduled and conducted by a qualified outside consultant or vendor.\n\nIf an incident occurs, an investigation team will be established within 48 hours of the incident to investigate the cause of the incident and make recommendations in actions needed to prevent similar incidents in the future.  Also, the team will evaluate the emergency response and make recommendations to any improvements needed to increase the effectiveness of the emergency response.\n\nThe RMP manager will maintain files of compliance audit reports for the facility for at lease two years.  Th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7475,
      "SummaryText": "e reports shall document the resolution of all corrective actions from the annual audits.  The audits will be made available to the public and all employees for review.  A brief notice will be provided in writing to each employee on any major findings or recommendations for corrective action.\n\nThe RMP is designed to provide the City with an guideline for the actions needed to safely handle chlorine gas at the treatment facility, notification in event of a release, training of operators and response personnel, and education of the public."
    }
  ]
}