{
  "FacilityID": 7480,
  "FacilityName": "City of West Haven Water Pollution Control Fac.",
  "FacilityStr1": "2 Beach Street",
  "FacilityStr2": null,
  "FacilityCity": "West Haven",
  "FacilityState": "CT",
  "FacilityZipCode": "06516",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09009",
  "LEPC": "West Haven LEPC",
  "FacilityLatDecDegs": "41.266944",
  "FacilityLongDecDegs": "-72.932778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "William C. Norton (Owner)",
  "OperatorStr1": "355 Main Street",
  "OperatorStr2": null,
  "OperatorCity": "West Haven",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06516",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000093962",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2001-07-16 00:00:00",
  "DeRegistrationEffectiveDate": "2001-06-28 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.26722,
  "FRS_Long": -72.9325,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9018,
      "AltID": null,
      "FacilityID": 7480,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 9964,
          "ProcessID": 9018,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9238,
          "ProcessID": 9018,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4028,
              "Process_NAICS_ID": 9238,
              "SafetyReviewDate": "1999-04-27 00:00:00",
              "PHA_Date": "1999-04-27 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-04-29 00:00:00",
              "TrainingReviewDate": "1999-04-29 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-04-29 00:00:00",
              "EquipmentInspectionDate": "1999-04-21 00:00:00",
              "EquipmentTested": "Hoist, Chlorine alarms, Chlorine room controls/panel, Chlorinator, Chlorine gas flow panel",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-04-30 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-04-30 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-30 00:00:00",
              "HotWorkPermitReviewDate": "1999-04-14 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-14 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4620,
                  "PreventionProgram3ID": 4028,
                  "ProcessChemicalID": 9964
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7480,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-30 00:00:00",
    "ERTrainingDate": "1999-04-30 00:00:00",
    "CoordinatingAgencyName": "American Environmental Technologies",
    "CoordinatingAgencyPhone": "8005627611",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7480,
      "SummaryText": "The City of West Haven, Connecticut owns and operates a Water Pollution Control Facility (WPCF) within the City limits.  The West Haven Water Pollution Control Commission (Commission) has developed a Risk Management (RM) Program for the control of catastrophic releases of extremely hazardous substances at the WPCF.  The RM Program continues the Commission's commitment to the protection of its neighbors and its employees and the control of the potential for such a release.\n\nThe U. S. Environmental Protection Agency (EPA) issued the Chemical Accident Prevention rule (40 CFR 68) in June 1996.  This rule requires any facility with a process that involves more than a threshold quantity (TQ) of some 140 hazardous compounds to prepare a risk management plan (RMP).  The Commission, through its consultant Camp Dresser & McKee Inc. (CDM), prepared this RMP which applies to the use of chlorine, which has a TQ of 2500 pounds, and is used for disinfection of wastewater at the WPCF, because the Commission intends to have up to 12,000 pounds of chlorine on site.  Because the chlorine system at the WPCF is an existing system, the Commission is submitting the RMP to EPA by June 21, 1999.\n\nAt the time of preparation of this RMP, the WPCF is operated for the Commission under a contract to Professional Services Group (PSG).  PSG uses chlorine stored in 2000-pound pressurized steel cylinders for disinfection of wastewater. At any given time, up to two such cylinders may be tied into the process, with an additional four cylinders in storage available to go on line.  Chlorine is delivered to the WPCF on an as-needed basis.  Although the chlorine exists as a liquid under pressure inside the cylinders, it is passed into the disinfection process as a gas through a series of pipes and valves at near ambient temperature and pressure, until it is injected into the liquid process stream and goes into solution to be applied at various points within the WPCF.  The WPCF has an active chlorine leak-"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7480,
      "SummaryText": "detection system linked to an alarm and ventilation system in place and operational in those indoor areas of the WPCF where gaseous chlorine could likely be present.   \n\nThe RMP summarizes the Process Safety Management (PSM) program documents prepared by PSG for the WPCF and supplements the procedures described in other City of West Haven documents such as general administrative guidelines and safety and health manuals.  The RMP addresses PSG's PSM Program management procedures, hazard assessment, prevention program, and emergency response program developed in response to OSHA's Process Safety Management standard and consistent with EPA's Chemical Accident Prevention rule.  Each major element of the Chemical Accident Prevention rule is addressed in the RMP in detail.  PSG's Project Manager is the primary person for the operator, PSG, responsible for implementing the provisions of the Chemical Accident Prevention rule for the WPCF. \n\nThe Commission conducted an analysis of chlorine release potential at the WPCF.  This analysis presents results of the worst-case release scenario as required by 40 CFR 68.25 and an alternative-case release scenario as required by 40 CFR 68.28, and public receptors are potentially affected by each scenario.  However, over the last five years, no release meeting the provisions of 40 CFR 68.42(a) has occurred at the WPCF.\n\nThe prevention program of the RMP includes process safety information, a process hazard analysis, operating procedures, training, maintenance procedures, and provisions for contractor safety, employee participation, hot work permits, pre-startup review, incident investigations, and internal compliance audits.\n\nPSG assembled a variety of safety information related to chlorine and the equipment used to store and transfer it within the WPCF.  Chlorine is an acute toxin that can cause respiratory distress at relatively low concentrations, and can even cause death at higher concentrations.  The chlorine-handling equipment at "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7480,
      "SummaryText": "the WPCF was designed to safely contain chlorine, but in the event of an accidental chlorine release, a chlorine detection and alarm system will alert personnel at the WPCF to the need for an emergency response. \n\nPSG conducted a process hazard analysis of the chlorine process.  The process hazard analysis team consisted of PSG personnel knowledgeable in process operation and maintenance and knowledgeable in the process hazard analysis process.  The hazard review team used a \"what-if / checklist\" technique, and recommendations were compiled and have been implemented.\n\nPSG has adopted standard operating procedures (SOPs) that provide system descriptions, specifications, and operating steps for the chlorine system.  The SOPs address start-up, shutdown, inspections, temporary operation, emergency procedures, and troubleshooting.  SOPs to provide for mechanical integrity of the chlorine process equipment rely on manufacturers' recommended approaches.\n\nPSG has implemented a training program with guidelines for conducting regular, structured plant training for Department employees.  Training record forms document the required training.  The training records for all personnel associated with the covered process appear in the training file kept at the WPCF.\n\nPSG has developed an approach for providing contractor safety, employee participation, hot work permits (where applicable), and pre-startup review for the chlorine process at the WPCF. \n\nPSG developed an approach to investigate and document actual releases of chlorine as well as \"near-miss\" release incidents.  The PSM Program contains the details of this approach.\n\nPSG developed an approach to perform audits of the compliance of its on-going PSM Program consistent with the requirements of the Chemical Accident Prevention rule.  PSG personnel will conduct such audits at least every three years. \n\nAn emergency response program procedure documents the measures PSG will take to respond to an accidental release of chlorine. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7480,
      "SummaryText": " For all but minor releases of chlorine, the PSG intends to rely on the American Environmental Technologies, Inc. (AET) for response to an accidental release of chlorine, while the West Haven Fire Department will provide coordination of other emergency response needs including providing incident command, local area evacuation and shelter-in-place notifications, and coordination with other appropriate agencies.  PSG personnel are responsible for initial notification to AET and the Fire Department of a release and for facility evacuation and accounting for WPCF employees in the event of a major chlorine release."
    }
  ]
}