{
  "FacilityID": 7598,
  "FacilityName": "Piney Point Phosphates, Inc.",
  "FacilityStr1": "13300 U.S. Highway 41 North",
  "FacilityStr2": null,
  "FacilityCity": "Palmetto",
  "FacilityState": "FL",
  "FacilityZipCode": "34221",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12081",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "27.631111",
  "FacilityLongDecDegs": "-82.535",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 836289066,
  "ParentCompanyName": "Mulberry Corporation",
  "Company2Name": "N/A",
  "CompanyDUNS": 938227634,
  "Company2DUNS": 0,
  "OperatorName": "Piney Point Phosphates, Inc.",
  "OperatorStr1": "13300 U.S. Highway 41 North",
  "OperatorStr2": null,
  "OperatorCity": "Palmetto",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34221",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ivan Nance",
  "RMPTitle": "Corporate Environmental Manager",
  "FTE": 154,
  "OtherEPAFacilityID": "34221RYSTUSHWY",
  "EPAFacilityID": "100000095826",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0810002-003-AV",
  "SafetyInspectionDate": "1992-03-31 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-08-03 00:00:00",
  "DeRegistrationEffectiveDate": "2010-08-02 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 27.62998,
  "FRS_Long": -82.53954,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility 'closed'.",
  "_processes": [
    {
      "ProcessID": 9160,
      "AltID": "Diammonium Phosphate Man.",
      "FacilityID": 7598,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 9381,
          "ProcessID": 9160,
          "NAICSCode": "325312",
          "_desc": {
            "NAICS_CODE": "325312",
            "NAICS_DESCRIPTION": "Phosphatic Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10123,
          "ProcessID": 9160,
          "ChemicalID": 56,
          "Quantity": 640000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510123,
          "ProcessID": 9160,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7598,
      "SummaryText": "\n\n\nPiney Point Phosphates, Inc. (PPPI) is a granular fertilizer manufacturing facility located at 13300 U.S. Highway 41 North, Palmetto, Florida. The facility is situated in  northern Manatee County approximately one mile south of the Hillsborough County line and just east of Port Manatee. Approximately one mile inland from the southeastern shoreline of Tampa Bay.\n\nManufacturing operations at the facility are conducted 24 hours per day on a year round basis.  Approximately 155 employees at the facility are spread over 3 eight hour shifts each day.  These employees operate, maintain and perform administrative functions for PPPI.  In addition to regular employees, contract employees are utilized for various functions.\n\nThe facility consists of a sulfuric acid plant (SAP), a phosphoric acid plant (PAP), a granular fertilizer plant (fertilizer plant), phosphogypsum stack system, warehouses, repair shops, offices, and ancillary structures.  Diammonium phosphate fertilizer (DAP), a granular fertilizer, is the facility's primary product.\n\nProduction of DAP utilizes anhydrous ammonia (ammonia), a chemical subject to the regulations found in 40 CFR part 68 (as promulgated in Section 112r of the Clean Air Act).\n\nGranular fertilizers are produced by neutralizing phosphoric acid with ammonia in a reactor located in the fertilizer plant.  Ammonia is received for storage at the facility by truck or rail and stored on-site as a liquid at ambient temperatures prior to usage.  Up to 320 tons of ammonia may be stored at the facility.\n\nTo minimize the potential to impact the public surrounding the facility, PPPI keeps less than a 24 hour supply of ammonia on hand.  However, due to the quantities consumed in the process and the fact that no transmission line is available, it is necessary to store ammonia in volumes exceeding the 10,000 pound threshold limit as defined in 40 CFR Part 68.130, Table 1 .\n\nIn June 1999, the facility will resume manufacturing DAP.  During the previous seven "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7598,
      "SummaryText": "years (since May 1992) no fertilizer manufacturing has occurred at the facility.  No accidental release of substances regulated as \"hazardous\" has occurred during this period.  The facility has been staffed to operate the water management systems and perform maintenance actions during this time.\n\nOffsite Consequence Analysis:\n\n40 CFR Part 68 at Subpart \"B\" requires facilities that store over 10,000 pounds of ammonia to prepare an \"Off-site Consequence Analysis\" (OCA).  This OCA includes both a \"Worst Case Scenario\" analysis and an \"Alternative Release Scenario\" analysis utilizing physical parameters determined by the USEPA along with information supplied by the facility.  These analyses are made by utilizing \"look-up tables\" provided by USEPA or by numeric modeling using commercially available models.\n\nUSEPA \"look-up tables\" and the models estimate a distance to a toxic endpoint of 0.14 mg/l (200 ppm) for ammonia. The toxic endpoint concentration of 200 ppm has been set by USEPA in regulations found at 40 CFR 68 Appendix \"A\".  No data to support the 200 ppm toxic endpoint is provided or referenced by USEPA. \n\nThe OCA for the PPPI facility was prepared using the HGSYSTEM model. The modeling was performed by an independent consulting firm. Ammonia quantities were determined by the facility, physical parameters were set by USEPA guidelines.\n\nThe worst case scenario, OCA was completed assuming 640,000 pounds of  ammonia were released in vaporous form from two interconnected tanks over a 10 minute period.  Using the parameters mandated by the EPA, the estimated distance to the toxic endpoint concentration of 200 ppm was 2.7 miles.  \n\nComparison of model results with USEPA's look-up tables or with other available models yields highly varying results.  Therefore, these endpoints and distances should only be utilized for planning purposes. Assumptions of physical parameters such as wind speed, ambient temperature, and surface roughness also effect look-up table and model re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7598,
      "SummaryText": "sults. \n\nIn the unlikely event that this volume of ammonia were ever released, according to an EPA document (EPA-454/R-93-002, Guidance on the Application of Refined Dispersion Models for Hazardous/Toxic Air Releases, Appendix B, pg 4), the time for the ammonia to change into vapor form would be on the order of 5 hours instead of 10 minutes.  This longer period of time for the ammonia to reach a vaporous phase would greatly reduce the distance to the endpoint concentration. It would however increase the overall time of the release event.\n\nThe alternative case scenario was performed assuming a pipe failure causing the release of 12,600 pounds of ammonia over a 10 minute period.  Under this scenario the release would be terminated by closing an emergency valve.  Using a wind speed of two meters per second, the distance to the endpoint concentration was estimated to be 0.43 miles.  Using this distance the endpoint would be contained onsite in all directions except west where it would reach just beyond U.S. Highway 41. \n\nPPPI has in place other mitigation systems which would reduce the distance to the endpoint.  These mitigation systems which were not incorporated in the modeling, include a water curtain system, excess flow valves, and  drain system directing discharged ammonia to a PPPI process water pond. \nThese mitigation systems do not however supplant continuous monitoring by personnel, effective maintenance practices, or good work and safety practices. \n\nThese in-place mitigation systems would decrease the quantity of an ammonia release by several ways.  Ammonia is highly soluble in water, therefore, methods to mix ammonia with water are very effective in reducing the release volume.  Both the water curtain (sprayed fresh water) and the drain to the process water ditch result in released ammonia being captured in water thereby reducing the quantity available for a gaseous release.\n\nThe ammonia storage and distribution system is equipped with self-closing excess fl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7598,
      "SummaryText": "ow valves at several locations within the system.  These excess flow valves are designed to limit or halt ammonia flow should a failure occur in the unloading or distribution systems.  Operator attention is not required for the devices to be effective.\n\nEmergency Response Program:\n\nPPPI has trained key employees to respond to chemical releases at the facility  under OSHA's Hazardous Waste Operator requirements to the technician level.  These employees have been trained to use emergency responder equipment, level A, B, & C protective equipment including encapsulated suits, and S.C.B.A. equipment in staged release drills.  All shift supervisors, day supervisors, superintendents and electrical employees have completed an 8 hour class on basic first aid & CPR.\n\nContractors working at the PPPI facility complete a 16 hour safety class for fertilizer industry facilities conducted by Polk Community College and attend a facility site specific safety class presented by the facility safety supervisor. Site specific safety training includes briefing on the facility emergency response program. This program is formulated to meet the requirements at 29 CFR 1910.119 for process safety management of highly hazardous chemicals.\n\nPPPI, has an Emergency Response Plan which contains those elements required under OSHA & EPA's Standards.  The emergency response plan acts as a guideline to direct internal response and reporting activities at the direction of specific on-site personnel, in the event of a release emergency. The plan includes federal, state and county agencies to be  contacted in an emergency in addition to company managers that must be notified in the event of a release.  In the  plan is specific information such as material safety data sheets (MSDS's) of certain hazardous chemicals, location of equipment, evacuation directions, and information pertaining to other available resources.\n     \nIn addition to training facility employees for emergency response,  PPPI is participa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7598,
      "SummaryText": "ting with local government emergency responders to improve their knowledge of the facility and chemicals utilized at the facility.  PPPI sponsored the attendance of local emergency response personnel to a 3-day training course that emphasized ammonia releases.  PPPI anticipates further sponsorship of this nature for other local responders.\n\nDue to the distance between the facility and the nearest emergency response personnel, other actions  are also underway.  PPPI recently enhanced communication between the facility and local responders by supplying the local fire department (NRFD District II) with a company radio.  This direct communication link will allow NRFD immediate information should a release occur.  \n\nAccidental Release Prevention Program: \n\nPPPI complies with all OSHA safety and health standards listed in CFR 29 Part 1910, as well as any other federal, state and county regulations that are applicable to the fertilizer industry.\n     \nBoth operations and maintenance departments have detailed written operational, maintenance, and inspection programs in keeping with OSHA requirements.  These programs provide employees with guidance to  help prevent unsafe practices or conditions from existing in the facility that could contribute to an accidental chemical release. These programs have guidelines or defined practices that identify how to safely operate the various plants in a manner that minimize accidental releases or unsafe conditions.  Maintenance procedures and inspection procedures are similarly defined, so that maintenance personnel can safely maintain equipment such as the ammonia storage and distribution systems.  Inspection programs provide criteria to be checked, frequency of needed maintenance, and key indicators of suitability for use.\n     \nCompany employees are trained and tested in their knowledge of safety procedures such as, but not limited to, lockout/tagout, confined space entry, line breaking,  hot work, respirator protection, fall protecti"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7598,
      "SummaryText": "on, permitting requirements, hazard communications, hazardous operator requirements, and MSDS usage and locations.  Facility emergency responders have been trained in the use of emergency equipment and have participated in staged exercises. \n\nPPPI has built-in layers of protection for the equipment used in the handling and processing of those chemicals that are regulated by OSHA, EPA, and other governmental agencies.  Those layers of protection include meeting design standards, continuous training of employees, inspections of equipment, automatic safety devices, redundant manual devices, and water spray systems.  Emergency responder team training in conjunction with outside agencies (local fire department, EMS, local law enforcement) is planned. PPPI will have hazardous material trained personnel onsite during each shift to respond to chemical releases. \n\nCorporate Commitment to Safety:\n\nThe following is the Corporation's policy statement on process safety management  as acknowledged by the corporate Senior Vice President of Operations and Administration.\n\nTo protect the employees at our facilities as well as the communities we live in, Piney Point Phosphates, Inc., has established many important safety and environmental programs.  However, because of the recently published OSHA regulations on process safety management (PSM), we will be reemphasizing and documenting many of our programs that help to reduce the likelihood of catastrophic incidents which could potentially threaten our employees, facilities and neighbors.  As part of that effort, I am requesting each department head to involve our employees, both hourly and salaried, in the development and implementation of process safety management systems and procedures at our facilities.\n\nThese PSM activities should address at least the following:\n\n1. Development of PSM information program; e.g., determine where information such as MSDS's should be kept.\n\n2. Development of a process hazard analysis (PHA) program (de"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7598,
      "SummaryText": "cide how to select employees to participate in PHA's).\n\n3. Conduct specific process hazard analyses (experienced operators should be included).\n\n4.  Develop and update operating and maintenance procedures.\n\n5. Develop training programs and appropriate refresher training.\n\n6. Monitor contractor's performance to ensure that contractor employees follow the safe work practices established for our facilities.\n\n7.  Identify pre-startup activities which need to be included in our pre-startup safety reviews before    startup of new or modified equipment and processes.\n\n8. Develop and implement a mechanical integrity program which satisfies OSHA's P.M. regulation.\n\n9. Develop and update safe work practices.\n\n10. Generate and implement a Management of Change program.\n\n11. Perform incident investigations.\n\n12. Prepare an emergency response plan and participate in emergency response training and drills.\n\n13. Participate in compliance audits and correct deficiencies identified by those audits.\n\nIn addition to addressing the items above, plans should be developed for communicating P.M. information to all employees involved with process systems and those who may be affected by their failure.\n\nThe following is the Corporation's Safety and Health Policy Statement as acknowledged by the General Manager of Chemical Operations on April 20, 1999.\n\nPiney Point Phosphates, Inc.,  recognizes the importance of safety and health in voluntary compliance with all Federal, State and Local regulations, including The Occupations Safety & Health Administration, (OSHA).\n\nWe will manage company operations to prevent injury to employees, the residents of our community and all visitors to our facility.  To that end, we pledge to provide each employee a place of employment free from recognized hazards that are likely to cause physical harm.\n\nWhile zero accidents/illnesses/injuries is our goal, this policy also establishes post-injury or disability management procedures to help injured or ill employees "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 7598,
      "SummaryText": "rapidly return to work.\n\nSafety and health are an integral part of our daily business functions.  Management and supervision are responsible for ensuring employees are trained to perform work safely, to abate safety hazards, and to report and investigate mishaps and potential hazards in the workplace.\n\nEmployees are expected to participate in all phases of our Safety & Health Plan and to conduct their daily tasks in a manner consistent with its objectives and regulations.\n\nSafety and health are a responsibility that must be shared equally and without exception by each individual within the organization.       \n                                                                                                                                                                 Planned Changes to Improve Safety:\n\nThe facility will be staffed with numerous former facility workers as well as experienced personnel from other phosphate facilities in the area as well as inexperienced new hires.  To ensure a certain level of knowledge, all employees will complete a new hire orientation training class. Safety training at the facility will include but is not limited to the following topics:\n\nLockout/tagout\nConfined space entry\nRespirator protection\nLine breaking\nHot work\nFall protection\nPersonal protective equipment\n\nHazard communication\nMobil equipment training:\n  Cranes - 32 hours\n  Highreaches - 2 to 4 hours\n  Forklifts - 2 hours\n  Payloaders - 2 hours\nHearing protection\nScaffolding\n\nIn addition to attending the required safety training, employees must demonstrate an acceptable level of understanding by satisfactorily completing written, oral, or observed testing.\n\nPPPI has an internal safety committee that meets to review all safety aspects of the facility.  Committee members are from both management and hourly staffs, and have been charged with identifying and suggesting safety improvements.  Committee meetings are documented along with suggestions, assignments, and resulting fo"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 7598,
      "SummaryText": "llow-up actions.  Procedural and physical improvements are considered as are new or emerging regulations or technologies.  These meetings are on-going and may result in improvements throughout the operating life of the facility."
    }
  ]
}