{
  "FacilityID": 7614,
  "FacilityName": "Coalinga Cogeneration Company",
  "FacilityStr1": "32812 W. Gale Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Coalinga",
  "FacilityState": "CA",
  "FacilityZipCode": "93210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.178333",
  "FacilityLongDecDegs": "-120.388333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 884578386,
  "ParentCompanyName": "Texaco Coalinga Energy Company",
  "Company2Name": "Silverado Energy Company",
  "CompanyDUNS": 884578386,
  "Company2DUNS": 884578386,
  "OperatorName": "Coalinga Cogeneration Company",
  "OperatorStr1": "P.O. Box 81078",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93380",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": "CA0818957",
  "EPAFacilityID": "100000098244",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "C-354-2-2",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-06-27 00:00:00",
  "DeRegistrationEffectiveDate": "2017-01-01 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.18069,
  "FRS_Long": -120.3885,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9177,
      "AltID": "SCR System",
      "FacilityID": 7614,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 10140,
          "ProcessID": 9177,
          "ChemicalID": 56,
          "Quantity": 69960.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9398,
          "ProcessID": 9177,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4111,
              "Process_NAICS_ID": 9398,
              "SafetyReviewDate": "1998-01-07 00:00:00",
              "PHA_Date": "1998-01-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1996-03-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-08-03 00:00:00",
              "TrainingReviewDate": "1998-03-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-06-25 00:00:00",
              "EquipmentInspectionDate": "1998-03-30 00:00:00",
              "EquipmentTested": "Emergency shutoff valves",
              "ChangeMgmtDate": "1996-11-13 00:00:00",
              "ChangeMgmtReviewDate": "1995-06-06 00:00:00",
              "PreStartupReviewDate": "1998-01-07 00:00:00",
              "ComplianceAuditDate": "1998-06-25 00:00:00",
              "AuditCompletionDate": "1999-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-06-25 00:00:00",
              "HotWorkPermitReviewDate": "1998-06-25 00:00:00",
              "ContractorSafetyReviewDate": "1998-10-27 00:00:00",
              "ContractorSafetyEvalDate": "1995-06-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4717,
                  "PreventionProgram3ID": 4111,
                  "ProcessChemicalID": 10140
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7614,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fresno County Fire Department",
    "CoordinatingAgencyPhone": "5594857500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 7614,
      "SummaryText": "ects or symptoms which could \nimpair an individual's ability to take protective action.\n\nWorst-Case Release Scenario and Alternative Release Scenario\n\nOffsite consequence analyses are used as tools to assist in emergency response \nplanning.  The RMP regulations require the owner or operator of a stationary \nsource to analyze the offsite impacts due to an accidental release of a regulated \nsubstance.  The offsite consequence analysis for a Program 3 process must \nanalyze the worst-case release scenario and an alternative release scenario.  \nSince Coalinga Cogeneration Company's SCR system is considered a Program \n3 process, both release scenarios were evaluated in the offsite consequence \nanalysis.\n\nThe offsite consequence analysis must include an estimate of the residential \npopulation within an area potentially affected by the accidental release scenarios.  \nThis area is defined as a circle with a radius equivalent to the distance the \nrelease would travel with concentrations at or above the endpoint.  This circle \nalso defines the area in which potential environmental receptors must be \nidentified.\n\nThe worst case release is defined by the U.S. EPA as the total release of the \ncontents of the single largest vessel or pipe within 10 minutes.  For liquefied \ngases stored under pressure, the entire contents of the vessel or pipe are \nassumed to be released as a vapor.  A total vapor release is highly unlikely.  \nHowever, this standardized worst case scenario was developed for emergency \nresponse agencies to use for planning purposes.\n\nAn alternative release scenario is a release that is more likely to occur than the \nworst-case release scenario.  For Coalinga Cogeneration Company, the \nalternative release scenario was selected based on the results of the Hazard and \nOperability Study for the ammonia-based SCR process.  The worst credible \nrelease event with the highest discharge rate would potentially have the greatest \noffsite impact.  A failure of the ammonia deliv"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7614,
      "SummaryText": "ery hose was identified in the \nHazard and Operability Study as the worst credible release event having the \nhighest release rate, and therefore, was chosen as the alternative release \nscenario.    \n\nCoalinga Cogeneration Company has analyzed the offsite consequences of the \nworst-case and alternative release.  For the worst-case release scenario, the \nrelease of 69,960 lbs. of ammonia within 10 minutes, the plume would travel 3.1 \nmiles at concentrations at or above the endpoint.  Using 1990 Census data, the \npopulation potentially affected within the worst-case release scenario circle is \n4900.  Sensitive receptors potentially affected by the worst-case release are \nlisted on the RMP*Submit forms.  There were no environmental receptors within \nthe worst case release scenario circle.\n\nCoalinga Cogeneration Company has installed passive and active mitigation \nsystems to aid in the control of ammonia, if a release were to occur.  A concrete \ncontainment wall surrounds the ammonia storage and vaporizer system.  A \nrelease of liquid ammonia could be contained within this area.  The containment \nwould limit the ammonia surface area in contact with the ambient air, thereby \ndecreasing the rate of volatilization.  \n\nThe ammonia storage system is also equipped with a water deluge system that \nwill spray water onto and around the storage tank.  In the event of a fire, this \ndeluge system can be used to cool the tank and help mitigate a temperature \ninduced overpressure release.  \n\nAlthough mitigation systems are installed, a specific mitigation factor cannot be \nassigned to the systems.  Therefore, no mitigation factors were included in the \nmodeling.  As such, the modeling results should be substantially overstated.\n\nIn the alternative release scenario, a failure of the delivery hose was modeled as \na release of liquefied ammonia stored under pressure.  For a release of 554 \nlb/min of anhydrous ammonia, the plume would travel 0.2 mile at concentrations \nat or above the end"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7614,
      "SummaryText": "point.  No residences are located within the 0.2 mile area \naround the Coalinga Cogeneration Company facility.  As such, there would be no \npopulation impacts from the alternative release scenario.  There were also no \nsensitive or environmental receptors within the alternative release scenario circle. \n\nThe modeling performed as part of this offsite consequence analysis does not \ntake into account the use of the remote operated shutoff valves that were \ninstalled at the ammonia tank.  These isolation valves take approximately 10 to \n15 seconds to fully close and could greatly reduce the impact of a hose failure \nrelease. \n\nGeneral Accidental Release Prevention Program and Chemical-Specific \nPrevention Steps\n\nA PSM program, which meets the requirements of the general accidental release \nprevention program, has been developed at Coalinga Cogeneration Company to \naddress the anhydrous ammonia system.  The PSM program includes the \nfollowing chemical-specific prevention steps:\n\n\u0007\tWritten process safety information, including information pertaining to the \nhazards of ammonia, the technology of the process, and the equipment in \nthe process has been compiled.\n\n\u0007\tAn initial Process Hazard Analysis (PHA) was performed and has been \nupdated and revalidated at least every five years.\n\n\u0007\tWritten operating procedures have been developed and implemented, and \nare reviewed at least annually.\n\n\u0007\tSafe work practices, such as lockout/tagout, confined space entry, \nopening process equipment or piping, and control over entrance into the \nfacility have been developed and implemented.\n\n\u0007\tEach employee involved in operating the ammonia system has received \ninitial training and refresher training at least every three years.\n\n\u0007\tWritten mechanical integrity procedures have been established and \nimplemented.\n\n\u0007\tA Management of Change (MOC) program has been developed and \nimplemented to address all proposed changes to the ammonia system.\n\n\u0007\tPre-startup safety reviews are performed when a mod"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 7614,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nCoalinga Cogeneration Company stores and utilizes anhydrous ammonia in a \nselective catalytic reduction (SCR) process at their facility in the Coalinga oil \nfields near Coalinga, California.  It is Coalinga Cogeneration Company's policy to \ncomply with all applicable governmental regulations.  Further, it is Coalinga \nCogeneration Company's objective to be a responsible citizen of the community \nin all of its business activities.\n\nCoalinga Cogeneration Company emphasizes safe and environmentally sound \noperating practices and procedures through their employee training programs.  In \naddition to job specific training, operators and maintenance personnel receive \ntraining in fire prevention, fire control, accident prevention, safety, and first aid.  \nAdditionally, an emergency action plan has been prepared for Coalinga \nCogeneration Company and a chain of command to respond to emergencies has \nbeen established.\n\nCoalinga Cogeneration Company has developed a detailed Compliance Audit \nChecklist which is used to evaluate compliance with the Process Safety \nManagement (PSM) standard and 40 CFR Part 68 (RMP regulations).  At least \nevery three years, Coalinga Cogeneration Company audits these programs and \nany findings of noncompliance are documented and responded to and the \ndeficiencies are corrected.\n\nDescription of the Stationary Source and Regulated Substances \n\nTexaco Coalinga Energy Company, a wholly-owned subsidiary of Texaco \nProducing Inc., formed a general partnership with the Silverado Energy \nCompany, a wholly-owned subsidiary of Edison Mission Energy Company, for \nthe development of the cogeneration plant.  The partnership, named Coalinga \nCogeneration Company, owns and operates the facility.  The plant began \ncommercial operation in November, 1991.  \n\nThe Coalinga Cogeneration Company facility is located in Section 18, \nT20S/R15E, MDB&M in the Coalinga oil fields.\n\nCogenerati"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7614,
      "SummaryText": "on, in the case of the Coalinga project, is the simultaneous production \nof thermal energy and electrical energy from the combustion of a single fuel \nsource.  Combustion of the fuel takes place in a gas turbine that is physically \ncoupled to an electric generator.  Waste heat from the gas turbine's exhaust \nflows into a heat recovery steam generator (HRSG).  The HRSG extracts the \nheat from the exhaust gases and produces steam for thermally enhanced oil \nrecovery.  Electricity is produced at the same time via the electric generator \ncoupled to the combustion turbine.  \n\nAnhydrous ammonia is used at the Coalinga Cogeneration Company facility to \ncreate a reducing atmosphere in the selective catalytic reduction (SCR) process.  \nThis reducing atmosphere in the flue gas helps convert nitrogen oxides to \nnitrogen and water as it passes through the catalytic reactor.  The operation of \nthe SCR system substantially lowers the emissions of nitrogen oxides from the \ngas turbine.\n\nLiquid ammonia is stored in a 15,000 gallon (water capacity) storage tank.  The \nmaximum intended inventory of the anhydrous ammonia storage tank is based \non the American National Standard Institute's K61.1 safety requirements and the \nOccupational Safety and Health Administration (OSHA) regulations published in \nSection 1910.111 of 29 CFR (and Section 509 of Title 8, CCR).  These standards \nand regulations limit the maximum ammonia storage capacity of the tank to \napproximately 69,960 pounds.\n\nFor purposes of the offsite consequence analyses, the RMP regulations define \nthe toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 ppm).  This \nconcentration has been established by the American Industrial Hygiene \nAssociation as the Emergency Response Planning Guideline Level 2 (ERPG-2).  \n\nERPG-2 is the maximum airborne concentration below which it is believed that \nnearly all individuals could be exposed for up to one hour without experiencing or \ndeveloping irreversible or other serious health eff"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 7614,
      "SummaryText": "ification is made to \nthe ammonia system that is significant enough to require a change in the \nprocess safety information.\n\n\u0007\tAudits are conducted at least every three years to evaluate compliance \nwith the RMP regulations.\n\n\u0007\tIncident investigation procedures have been established.\n\n\u0007\tA written plan of action regarding the implementation of employee \nparticipation has been developed and implemented.\n\n\u0007\tHot work permits are issued for all hot work operations conducted on or \nnear the ammonia system.\n\n\u0007\tA Contractor Safety Policy has been developed and implemented.\n\nTo ensure that the general accidental release prevention program and the \nchemical-specific prevention steps are implemented, Coalinga Cogeneration \nCompany has assigned overall responsibility for the RMP elements to the \nExecutive Director.  The Executive Director has the overall responsibility for the \ndevelopment, implementation, and integration of the RMP elements.\n\nFive-Year Accident History\n\nCoalinga Cogeneration Company has not had any accidental releases from the \nammonia-based SCR system that have resulted in deaths, injuries, or significant \nproperty damage on site, or known offsite deaths, injuries, evacuations, \nsheltering in place, property damage, or environmental damage in the last five \nyears.\n\nEmergency Response Program\n\nCoalinga Cogeneration Company has established an emergency action plan and \na chain of command to respond to emergencies and to notify emergency \nresponders when there is a need for a response.  However, an emergency \nresponse program does not need to be developed for the facility since Coalinga \nCogeneration Company employees will not respond to accidental releases of \nammonia, the facility is included in the community emergency response plan, and \nappropriate mechanisms are in place to notify emergency responders.\n\nPlanned Changes To Improve Safety\n\nThe PHAs were most recently revalidated in March, 1996.  Several changes to \ninspection and offloading procedures were re"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 7614,
      "SummaryText": "commended based on the PHA \nrevalidation.  These changes were implemented by January, 1998.\n\nThrough the accidental release prevention program, Coalinga Cogeneration \nCompany regularly evaluates the need for any changes to improve safety.  \nCurrently Coalinga Cogeneration Company does not have any additional \nchanges planned to improve safety."
    }
  ]
}