{
  "FacilityID": 7686,
  "FacilityName": "OMNIUM, LLC",
  "FacilityStr1": "1417",
  "FacilityStr2": "LOWER LAKE ROAD",
  "FacilityCity": "ST. JOSEPH",
  "FacilityState": "MO",
  "FacilityZipCode": "64504",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29021",
  "LEPC": "BUCHANAN CO./ST. JOSEPH LEPC",
  "FacilityLatDecDegs": "39.720889",
  "FacilityLongDecDegs": "-94.885194",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 179462197,
  "ParentCompanyName": "FARMLAND INDUSTRIES, INC.",
  "Company2Name": "TERRA INDUSTRIES, INC.",
  "CompanyDUNS": 7129547,
  "Company2DUNS": 101123578,
  "OperatorName": "OMNIUM, LLC",
  "OperatorStr1": "P.O. BOX 788",
  "OperatorStr2": null,
  "OperatorCity": "ST. JOSEPH",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64502",
  "OperatorZipCodeExt": null,
  "FTE": 120,
  "OtherEPAFacilityID": "64504FRMLN1417L",
  "EPAFacilityID": "100000095568",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "none",
  "SafetyInspectionDate": "1999-05-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.720556,
  "FRS_Long": -94.88222,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9253,
      "AltID": "USE NH3 IN AIBN PROCESS",
      "FacilityID": 7686,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 10223,
          "ProcessID": 9253,
          "ChemicalID": 56,
          "Quantity": 76500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9474,
          "ProcessID": 9253,
          "NAICSCode": "32532",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4129,
              "Process_NAICS_ID": 9474,
              "SafetyReviewDate": "1999-04-01 00:00:00",
              "PHA_Date": "1998-10-09 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-05-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "EMPLOYEE ERROR",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-02-26 00:00:00",
              "TrainingReviewDate": "1999-04-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-24 00:00:00",
              "EquipmentInspectionDate": "1998-07-07 00:00:00",
              "EquipmentTested": "RELIEF VALVES",
              "ChangeMgmtDate": "1999-04-12 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-12 00:00:00",
              "PreStartupReviewDate": "1998-07-01 00:00:00",
              "ComplianceAuditDate": "1998-10-21 00:00:00",
              "AuditCompletionDate": "1999-05-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-02-22 00:00:00",
              "HotWorkPermitReviewDate": "1997-08-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1998-09-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4740,
                  "PreventionProgram3ID": 4129,
                  "ProcessChemicalID": 10223
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 9254,
      "AltID": "USE ETHYLAMINE IN PROCESS",
      "FacilityID": 7686,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 10224,
          "ProcessID": 9254,
          "ChemicalID": 103,
          "Quantity": 88900.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9475,
          "ProcessID": 9254,
          "NAICSCode": "32532",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7686,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-12-08 00:00:00",
    "ERTrainingDate": "1998-09-17 00:00:00",
    "CoordinatingAgencyName": "Buchanan County LEPC",
    "CoordinatingAgencyPhone": "8162711574",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 7686,
      "SummaryText": "its processes in an effort to improve efficiencies, reduce personnel exposure potential, minimize the generation of waste materials, and improve safety.  Regarding risk management of the two substances included in this program, ammonia and ethylamine, the following improvements have already been made or are under consideration.\n\nThe process in which ammonia and ethylamine are used is active for a period of 3 to 4 months per year.  During this time, an operating inventory of both substances is constantly maintained.  At the end of the production campaign, our supply of ethylamine is either reduced to a small amount, i.e. less than the RMP threshold quantity, or entirely consumed in the process.  The objective behind this operating parameter is to reduce or eliminate the potential for both on site and off site consequences, should a release occur, by maintaining either a very minimal inventory or none at all when the process is completed.  As part of the RMP program, we intend to apply this same philosophy to our inventory of ammonia, again, either minimizing or eliminating the potential for on and off site impacts, should there be a release."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 7686,
      "SummaryText": "Omnium, LLC\nSt. Joseph, Missouri\n\n\nOmnium Agricultural Chemicals Plant, a joint venture between Farmland Industries and Terra Industries, is located on approximately 56 acres in the southern industrial area of St. Joseph, MO.  Nearly 20 acres are developed with the remaining area leased to a local farmer for the purpose of growing crops.  The facility formulates and packages crop protection products used by some of Farmland's 600,000 producer-members to grow crops that provide high-quality, low-cost food for families throughout the world.\n\nAccidental Release Prevention Policy\n\nThe management and employees of this facility are committed to the prevention of any accidental releases, especially hazardous materials.  Accidental release prevention is critical to the safe operation of this plant, the safety of its employees and the safety of the community.\n\nTo achieve its accident and accidental release prevention goals, Omnium is committed to the following:\n7 A knowledgeable, motivated and highly trained employee group\n7 A well-designed facility that is maintained and operated in a superior manner\n7 Improvements that enhance safety and accident prevention\n7 Excellence in safety programs and practices, and an outstanding safety and accident record\n7 Preparation and training for emergency response.\n\nEmergency Response Policy\n\nOmnium has a written Emergency Response Plan, as required by RMP and other EPA and OSHA rules, and is committed to respond to any accidental release to minimize the impact to employees, the community and the environment.  The response plan is coordinated with the LEPC and emergency response agencies.  Omnium personnel have interacted with these agencies for many years regarding the plan and activities at the facility.  In addition, employees are trained in the implementation of the plan and possible response activities that could be required in the event of an emergency.\n\nRegulated Substances Handled\n\nAmmonia is the only toxic substance, regulated by"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7686,
      "SummaryText": "scenario definition is a release that is more likely to occur than the worst-case release; however, as with the worst-case, the alternative release improbability is not taken into consideration.\n\nIn the facility\u0012s hypothetical alternative release scenario regarding a toxic substance, a 2,380 gallon release of ammonia occurs due to a transfer hose failure as ammonia is being transferred from a tank trailer to the storage tank.  In this scenario, it is assumed that the release occurs over a period of 2 minutes, at which time human intervention stops the release.  This alternative release scenario has off-site impacts.\n\nOmnium\u0012s hypothetical worst-case scenario regarding a flammable substance involves a release of 13,250 gallons of ethylamine from the facility\u0012s storage tank. The worst-case assumes, as required by RMP, that the entire contents of this tank are released over a period of 10 minutes due to a catastrophic failure and the resulting vapor cloud ignites.  This worst-case scenario does not have off-site impacts.\n\nIn the facility\u0012s hypothetical alternative release scenario regarding a flammable substance, a 1,500 gallon release of ethylamine occurs over a period of 6 minutes as a result of a transfer hose failure as ethylamine is being transferred from a tank trailer to the storage tank.  Human intervention stops the release after 6 minutes.  This alternative release scenario does not have off-site consequences.\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nOmnium is subject to the OSHA Process Safety Management (PSM) rule, 29 CFR 1910.119, which is equivalent to the Program 3 Prevention Program under EPA's RMP rule.\n\nThe OSHA PSM/EPA Prevention Program consists of a set of facility management policies and procedures that promote and recognize process safety and the prevention of accidents in plants that handle, use, store, or process hazardous chemicals.  The procedures provide accident prevention process controls to all aspect"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7686,
      "SummaryText": "s of facility operations.\n\nOmnium adheres to the requirements of PSM and has written policies and procedures addressing all aspects of PSM and EPA Prevention Program requirements.  The facility has addressed the elements of accident prevention included in these programs throughout its years of operation.\n\nDue to the variety of substances Omnium handles in the normal course of doing business, several separate spill prevention programs and operating procedures are in place as an effort to reduce the risk or consequence of an accidental release.  A  section in the plant's Emergency Response Manual is devoted to general chemical spill prevention while a separate program is in effect for preventing spills of petroleum products.\n\nThe system which is designed and built to safely handle ammonia is: constructed according the following specifications, equipped with the following appurtenances, and operated using the following procedures.  The purpose of these systems and procedures, as well as others not listed, is to greatly reduce or eliminate the potential for ammonia releases to occur.  For the purposes of this summary, some of the more prominent are listed below.\n\n7 Both the storage tank and vaporizer have been designed and tested for a pressure of greater than 250 psig.\n7 The unloading system is protected from damage by moving vehicles.\n7 Both the storage tank and vaporizer are installed on substantial concrete supports.\n7 Both the storage tank and vaporizer are equipped with vapor return lines and valves.\n7 The main storage tank is fitted with a liquid level gauge which indicates 85% of water capacity.\n7 The vaporizer is fitted with an electronic liquid level monitoring system as well as a sight glass.\n7 Both the storage tank and vaporizer are equipped with proper pressure gauges.\n7 Loading/unloading lines are equipped with back flow check valves and excess flow valves.\n7 All piping is suitable for ammonia service.\n7 Hoses used for unloading conform to TFI-RMA specific"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7686,
      "SummaryText": "ations for anhydrous ammonia.\n7 Appropriate safety relief valves are installed on the storage tank and vaporizer, vented upward in an unobstructed manner, and equipped with rain/dust caps.\n7 A safety shower and eye wash station is readily available.\n7 SCBA's with full face masks are readily available.\n7 Operators are trained in proper operation of the ammonia transfer system between the storage tank and vaporizer and of the ammonia vaporizer.\n\nFive Year Accident History\n\nThe RMP rule requires inclusion of the facility's five-year accident history for all accidental releases of regulated substances that resulted in deaths, injuries, or significant property or environmental damage on or off site.\n\nThere have been no RMP reportable releases or accidents during the more than three years Omnium personnel have been handling anhydrous ammonia.\n\nEmergency Response Program\n\nOmnium's emergency response plan is designed to prevent individual injuries, damage to the environment, and damage to property, both on site and off site.  The plan is also to be used as a guide in coordinating activities with police and fire departments, hospitals, contractors, and state and local response teams.  As part of this summary, a general overview of Omnium's Emergency Response Plan (the Plan) follows.\n\nThe plan consists of 12 sections:  table of contents, several lists of relevant telephone numbers, specific guidelines and procedures regarding fire, human rescue, spill or release, severe weather, evacuation, flood, and off-site assistance.  There are also separate sections covering emergency first aid, training requirements, facility maps, and management procedures.\n\nAll emergency response team members receive training in accordance with 29 CFR 1910.120.  There are also specific training requirements for the primary and alternate emergency coordinators.  Refresher training is provided for all ER team members on an annual basis.\n\nPlanned Changes to Improve Safety\n\nOmnium is constantly reviewing"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7686,
      "SummaryText": "EPA's RMP rule, that is stored and used at the Omnium facility.\n\nAmmonia is a colorless gas with a strong, pungent odor, and is one of the most widely used industrial chemicals.  It is prepared industrially from natural gas, steam, and air.  This gas is liquefied under pressure and stored in a tank designed for this purpose until ready for use.\n\nAmmonia vapors can be irritating to the nose, throat, eyes, and skin.  Direct liquid contact to the skin can cause severe burns.\n\nAn aqueous solution of ethylamine and water, a flammable liquid regulated by EPA's RMP rule, is also stored and used at the Omnium facility.  Ethylamine is a colorless liquid with an ammonia-like odor.  To a lesser degree than ammonia, vapors from ethylamine can also be irritating to the nose, throat, eyes and skin.  In the proper concentration with air, these vapors can be flammable.\n\nSynopsis of Worst-Case and Alternative Release Scenarios\n\nThe EPA has defined a worst-case scenario as the release of the largest quantity of a listed chemical from a vessel or process line failure without taking into account active mitigation controls.  The release distance is determined using EPA defined atmospheric conditions and is intended to provide an estimate of the maximum possible area that might be affected.  According to EPA, the worst-case scenario is intended to ensure that no potential risks to the public health are overlooked, but the distance to an endpoint estimated under worst-case should not be considered a public danger zone. Possible causes of the extreme improbability that such releases may occur are not considered.\n\nOmnium's hypothetical worst-case scenario regarding a toxic substance involves a 15,300 gallon ammonia release from the facility's storage tank.  The worst-case assumes, as required by RMP, that the entire contents of this tank are released over a period of 10 minutes as a result of a catastrophic failure.  This worst-case scenario has off-site impacts.\n\nThe alternative release"
    }
  ]
}