{
  "FacilityID": 7797,
  "FacilityName": "Tyndall  WWTP",
  "FacilityStr1": "325 CES/DJOW",
  "FacilityStr2": "1113 Mississippi Road",
  "FacilityCity": "Tyndall AFB",
  "FacilityState": "FL",
  "FacilityZipCode": "32403",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12005",
  "LEPC": "Bay Co. Emergency Management",
  "FacilityLatDecDegs": "30.058333",
  "FacilityLongDecDegs": "-85.581944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Tyndall AFB",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brig. Gen. Walter E. Buchanan III",
  "OperatorStr1": "325 FW/CC",
  "OperatorStr2": "445 Suwannee Road, Suite 101",
  "OperatorCity": "Tyndall AFB",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32403",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Phelps",
  "RMPTitle": "Environmental Engineer",
  "FTE": 10,
  "OtherEPAFacilityID": "FL1570024124",
  "EPAFacilityID": "100000098208",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "1999-11-29 00:00:00",
  "DeRegistrationEffectiveDate": "1999-07-14 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 30.0875,
  "FRS_Long": -85.58667,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9377,
      "AltID": "wastewater treatment",
      "FacilityID": 7797,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 9603,
          "ProcessID": 9377,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10351,
          "ProcessID": 9377,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510351,
          "ProcessID": 9377,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7797,
      "SummaryText": "The Tyndall Wastewater Treatment Plant (WWTP) has prepared and implemented a Risk Management Program in accordance with the Chemical Accident Prevention Provisions of 40 Code of Federal Regulations (CFR) Part 68 to prevent the accidental release of chlorine and exposure to Tyndall personnel and members of the community, as well as to the environment.  This Risk Management Plan (RMP) encompasses all the elements of the Risk Management Program.\n\nThe Tyndall WWTP is located at the southeast end of Mississippi Road on Tyndall Air Force Base (AFB), Florida.  Chlorine is used to disinfect wastewater prior to discharge to the Bay County WWTP.  A chlorinated water solution is pumped from the chlorinator room to the contact chamber, where it enters the wastewater system to provide disinfection.  Chlorine at the facility is stored in 1-ton (2,000 lb) containers.\nChlorine containers are stored on a standby/on-line basis so that the chlorination process is continuous.  \n\nThe chlorination process is continuously monitored for chlorine gas leaks and is equipped with an audible alarm to alert personnel in the event of a release.  Tyndall WWTP personnel are trained to operate the chlorination process.  The Tyndall WWTP preventive maintenance program ensures that equipment related to chlorine operations is maintained as fully operational.  Accidental release prevention and emergency response policies at the Tyndall WWTP emphasize safety, training, and maintenance.\n\nA worst-case release scenario was estimated, based on the United States Environmental Protection Agency (EPA) guidance, to provide the greatest distance in any direction to the established toxic endpoint.  The worst-case release quantity, established by the regulations, is the greatest amount of chlorine held in a single vessel. In accordance with 40 CFR ' 68.25, it is assumed that the gas is released over a 10 minute period. \n\nNo administrative controls or active mitigation measures were included for the worst-case relea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7797,
      "SummaryText": "se scenario.  Tables from the EPA and Chemical Emergency Preparedness and Prevention Office (CEPPO) Risk Management Program Guidance for Wastewater Treatment Plants (EPA 550-B-98-010; October 1998) (EPA Guidance tables) were used to determine the distance to the toxic endpoint for the worst-case release scenario.  Public receptors were estimated within the radius.  No environmental receptors were identified.  \n\nThe five-year accident history was evaluated to determine a likely alternative release scenario.  Since no accidents have occurred in the last five years (since 1994), a review of common accidents that have occurred at other facilities involving 1-ton containers was considered.  It was determined that the most likely scenario for a chlorine release is a ruptured flexible connector or \"pigtail.\"  Under the alternative release scenario, it is assumed that chlorine gas is released through the 0.25 inch diameter pigtail.  Using EPA Guidance tables, the release rate and the distance to the toxic endpoint were determined.  No public or environmental receptors were identified within the radius.  \n\nThe Tyndall WWTP has developed an accidental release prevention program that includes several key elements.  Tyndall WWTP is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard and uses many elements of the PSM in its RMP accidental release prevention program.  The primary safe-guard for the chlorine process is the chlorine leak detection system in place at the chlorine building.  The leak detection sensor is tested on a monthly basis to ensure it is functioning properly.  Operators tour the facility twice a day to ensure the chlorine feed system is functioning properly.  An audible alarm is located at the chlorine area, located in the Control and Sludge Disposal Building.\n\nThe Tyndall WWTP has several programs in place to prevent accidental chlorine releases.  Specifically, the facility trains operators on the prope"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7797,
      "SummaryText": "r operation of the chlorination process, uses state-of-the-art safety equipment, and implements a preventive maintenance program to ensure the process equipment is operating properly.\n\nA review of the hazards associated with the Tyndall WWTP chlorination process was conducted.  Results of the review and recommendations identified during the process hazards analysis (PHA) that would improve safety at the facility are documented in the PSM. \n\nThe Tyndall WWTP personnel are trained to respond to an incidental release of chlorine.  However, in the event that a release is beyond the control of the operators, personnel have a mechanism in place to notify the Tyndall AFB Hazardous Materials (Haz Mat) Team emergency responders.  Safety equipment available on-site includes Self-Contained Breathing Apparatus (SCBA) and ton container emergency repair kits ('B' Kits)."
    }
  ]
}