{
  "FacilityID": 7847,
  "FacilityName": "Diaz Intermediates Corporation",
  "FacilityStr1": "301 Wyanoke Road",
  "FacilityStr2": null,
  "FacilityCity": "West Memphis",
  "FacilityState": "AR",
  "FacilityZipCode": "72301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05035",
  "LEPC": "Crittenden County LEPC",
  "FacilityLatDecDegs": "35.107222",
  "FacilityLongDecDegs": "-90.1925",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "P1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.diazchem.com",
  "FacilityEmailAddress": "tom.belk@diazchem.com",
  "FacilityDUNS": 825081854,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Diaz Intermediates Corporation",
  "OperatorStr1": "301 Wyanoke Road",
  "OperatorStr2": null,
  "OperatorCity": "West Memphis",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72301",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000102328",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1743-A",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.107232,
  "FRS_Long": -90.192777,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9431,
      "AltID": "bromine unloading",
      "FacilityID": 7847,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 10408,
          "ProcessID": 9431,
          "ChemicalID": 60,
          "Quantity": 67000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9657,
          "ProcessID": 9431,
          "NAICSCode": "325192",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4196,
              "Process_NAICS_ID": 9657,
              "SafetyReviewDate": "1998-08-01 00:00:00",
              "PHA_Date": "1998-10-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-10-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "employee present during unloading",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-05-01 00:00:00",
              "TrainingReviewDate": "1998-10-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-10-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "transfer lines, valves",
              "ChangeMgmtDate": "1999-05-01 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-01 00:00:00",
              "PreStartupReviewDate": "1998-10-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "1999-05-26 00:00:00",
              "InvestigationChangeDate": "1999-05-26 00:00:00",
              "ParticipationPlansReviewDate": "1998-08-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-08-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1998-08-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 4813,
                  "PreventionProgram3ID": 4196,
                  "ProcessChemicalID": 10408
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 7847,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-08-01 00:00:00",
    "ERTrainingDate": "1998-08-01 00:00:00",
    "CoordinatingAgencyName": "Crittenden County LEPC",
    "CoordinatingAgencyPhone": "8705551212",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 7847,
      "SummaryText": "General Executive Summary for Diaz Intermediates Corporation\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nWe at Diaz Intermediates Corporation are strongly committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass organic chemical intermediates manufacturing. We have one regulated substance present at our facility. This substance is Bromine, which is reacted with aromatic raw materials, such as benzene.\n\nThe maximum inventory of Bromine at our facility is 67000 pounds.\n\n3.\tThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo evaluate the worst case and alternate release scenarios, we have used the EPA's RMP Comp program. The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 3 toxic substances as a class involves a catastrophic release from our bromine storage tank during tank truck unloading. In this scenario 67000 lb. of bromine is released. The toxic liquid released is assumed to form a 1 cm deep pool from which evaporation takes place. The entire pool is estimated to evaporate over 6000 minutes. The release rate has been limited to less than 1% of the maximum rate for the source by a system of administrative controls. Passive mitigation systems such as enclosure(s) are also taken into account to calculate the scenario. These mitigation systems have the effect of reducing the amount of bromine in cont"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 7847,
      "SummaryText": "act with the atmosphere, thereby reducing the rate of evaporation. At Class F atmospheric stability and 1.5 m/s wind speed, the maximum distance of 2.7 miles is obtained corresponding to a toxic endpoint of 0.0065 mg/L.\n\nThe alternative release scenario for Bromine involves a release from a bromine transfer hose. The scenario involves the release of 1170 lb. of bromine. Toxic liquid is assumed to be released to form a 1 cm deep pool from which evaporation takes place. The entire pool is estimated to have evaporated after 5950 minutes. Passive mitigation controls such as dike(s), drain(s), sumps(s) and enclosure(s) are taken into account to calculate the scenario, having the effect of reducing the amount of bromine available to evaporate (reducing liquid contact with the atmosphere). The release is also assumed to be controlled by a water spray system, foam generator, scrubber(s) and neutralization. These active mitigation systems have the effect of blanketing the liquid, forming a barrier, which prevents evaporation until the bromine can be neutralized. Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0065 mg/L of Bromine is 0.1 miles.\n\n\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. This facility was designed and constructed in accordance with NFPA-58 Standard, 1998 Edition. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nDiaz Intermediates Corporation maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 7847,
      "SummaryText": "are identified and controlled efficiently. The methodology used to carry out these analyses is What If/Checklist (combined). The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are scheduled to be revalidated at a regular interval of five years. Any findings related to the hazard analysis are addressed in a timely manner. The most recent PHA/update was performed in July, 1998.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Diaz Intermediates Corporation maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nDiaz Intermediates Corporation has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nDiaz Intermediates Corporation carries out documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes, among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Diaz Intermediates Corporation to manage changes in process chemicals, technology,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 7847,
      "SummaryText": "equipment and procedures.  Because the plant began operations in September, 1998, there has not yet been a review/revision of management of change procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Diaz Intermediates Corporation. The most recent review was performed in October, 1998. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nDiaz Intermediates Corporation conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. The first compliance audit is scheduled to be conducted in August, 2001. These audits will be carried out at least every three years and any corrective actions required as a result of the audits will be undertaken in a safe and prompt manner.\n\nIncident Investigation\nDiaz Intermediates Corporation promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of five years.\n\nEmployee Participation\nDiaz Intermediates Corporation truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 7847,
      "SummaryText": "of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Diaz Intermediates Corporation has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.\tFive-year Accident History\nDiaz Intermediates Corporation has had an excellent record of preventing accidental releases since it began operations in 1998.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.\tEmergency Response Plan\nDiaz Intermediates Corporation carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan will be promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nCrittenden County is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7.\tPlanned Changes to Improve Safety\nDue to the recent start up of the facility, there have not yet been any identified improvements or changes required or recommended to improve safety."
    }
  ]
}