{
  "FacilityID": 8014,
  "FacilityName": "Packerland Packing Company - Lime Kiln Rd Facility",
  "FacilityStr1": "1330 Lime Kiln Road",
  "FacilityStr2": null,
  "FacilityCity": "Green Bay",
  "FacilityState": "WI",
  "FacilityZipCode": "54311",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55009",
  "LEPC": "Brown County LEPC",
  "FacilityLatDecDegs": "44.48",
  "FacilityLongDecDegs": "-87.981639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 173617853,
  "ParentCompanyName": "Packerland Holdings Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mr. Richard Vesta",
  "OperatorStr1": "PO Box 23000",
  "OperatorStr2": null,
  "OperatorCity": "Green Bay",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54305",
  "OperatorZipCodeExt": "3000",
  "RMPContact": null,
  "RMPTitle": "Safety Director",
  "FTE": 1100,
  "OtherEPAFacilityID": "WID988566725",
  "EPAFacilityID": "100000099939",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-02-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 44.47981,
  "FRS_Long": -87.98148,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9634,
      "AltID": "Refrigeration System",
      "FacilityID": 8014,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 9862,
          "ProcessID": 9634,
          "NAICSCode": "31161",
          "_desc": {
            "NAICS_CODE": "31161",
            "NAICS_DESCRIPTION": "Animal Slaughtering and Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10622,
          "ProcessID": 9634,
          "ChemicalID": 56,
          "Quantity": 82000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510622,
          "ProcessID": 9634,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8014,
      "SummaryText": "RISK MANAGEMENT PLAN:\n\n\nExecutive Summary:\n\nPackerland Packing Company's Lime Kiln Road facility is a beef processing facility located at 1330 Lime Kiln Road, Green Bay, WI.   The plant is in operation five days per week, mon-fri, with some weekend work performed as necessary to meet production requirements.  There are two production workshifts and one clean-up/sanitation work shift.  \n\nCoverage under EPA's 40CFR Part 68, Risk Management Plan requirements is due to the use of Anhydrous Ammonia in the facility.  Anhydrous Ammonia is utilized as the refrigeration medium.  The refrigeration provides cooling to the carcass coolers and production rooms throughout the facility.  \n\nThere have been no reportable accidents/incidents/releases, etc. within the past five years related to the refrigeration system.\n\nThis facility complies with the requirements 29CFR 1910.119, Occupational Safety and Health Administration (OSHA) Process Safety Management.  The refrigeration system is monitored 24hrs per day, 7 days a week, 52 weeks per year by trained in-house refrigeration maintenance personnel.  The refrigeration maintenance personnel follow standard operating procedures which outline the safe and efficient operation of the refrigeration system.  Every two hours, critical refrigeration system operating parameters and equipment are checked and then recorded on a log sheet. Periodic (daily, weekly, monthly, annual) equipment maintenance is performed according to a set schedule and then recorded.\n\nAccording to the 40 CFR Part 68, Risk Management Plan requirements a \"worst case\" release scenario must be documented.  This facility utilized the instructions and guidance contained in EPA's \"Risk Management Program Guidance for Ammonia Refrigeration\" dated November 1998 for the development of the worst case release scenario.  The scenario chosen involves the largest anhydrous ammonia vessel at the facility.  The \"maximum intended\" volume of anhydrous ammonia (the largest volume of anhyd"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8014,
      "SummaryText": "rous ammonia that could ever be in the vessel) vs. The normal operating volume of anhydrous ammonia, was used in the calculations.  The vessel is located inside the main building, within an engine room.    The worst case scenario involves some type of facility upset or condition which would result in a catastrophic failure of the vessel at the time when it contains the previously described \"maximum intended\" inventory of anhydrous ammonia.  The EPA's Risk Management Program  Guidance for Ammonia Refrigeration dated November 1998, and the associated equations and charts contained in Chapter 4 of the document, was used to determine the distance to the potential toxic endpoints.\nAccording to the 40 CFR Part 68, Risk Management Plan requirements an \"Alternative Release\" scenario must be documented.  This scenario must be one that is more likely to occur than the worst case scenario and one that reaches an endpoint off-site.  This facility utilized the instructions and guidance contained in EPA's \"Risk Management Program Guidance for Ammonia Refrigeration\" dated November 1998 for the development of the \"Alternative Release\" scenario.  Past accident/incident history, working knowledge of the facility refrigeration system, and Process Hazard Analysis data results were all used as guidance tools for choosing the Alternative Release scenario.  The scenario chosen is a release from an opening in process piping/equipment caused by failure due to some type of mechanical failure in a pipe, at a flange, joint, weld, valve or valve seal.  The release in this scenario would occur on the facility roof where some of the process piping is located. The EPA's Risk Management Program Guidance for Ammonia Refrigeration dated November 1998, and the associated equations and charts contained in Chapter 4.2 of the document, was used to determine the distance to the toxic endpoint, for the \"Alternative Release\" scenario.\n\nThis facility's refrigeration maintenance personnel attend initial and a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8014,
      "SummaryText": "nnual refresher training in Ammonia Emergency Response procedures.  There are refrigeration maintenance department personnel on-site 24hrs a day, 7 days a week, 52 weeks per year. There are ammonia alarms in engine rooms which automatically active an independent ventilation system.  There is a guard force on-site 24hrs day, 7 days a week, 52 weeks per year.  They are trained to summon outside assistance should the need arise.  This facility has an Off-Site Emergency Response Plan coordinated with the Brown County Local Emergency Planning Committee.  This plan is periodically reviewed and updated by the facility management and a representative of the Brown County Local Emergency Planning Committee."
    }
  ]
}