{
  "FacilityID": 8079,
  "FacilityName": "Wastewater Treatment Facility",
  "FacilityStr1": "1300 South Queens Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Pueblo",
  "FacilityState": "CO",
  "FacilityZipCode": "81001",
  "Facility4DigitZipExt": "4528",
  "FacilityCountyFIPS": "08101",
  "LEPC": "Pueblo County LEPC",
  "FacilityLatDecDegs": "38.256944",
  "FacilityLongDecDegs": "-104.575",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Wastewater Department",
  "Company2Name": "City of Pueblo, Colorado",
  "CompanyDUNS": 0,
  "Company2DUNS": 182813782,
  "OperatorName": "City of Pueblo, Wastewater",
  "OperatorStr1": "211 East \"D\" Street",
  "OperatorStr2": null,
  "OperatorCity": "Pueblo",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81003",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000101864",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-04-21 00:00:00",
  "DeRegistrationEffectiveDate": "2014-04-02 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.25804,
  "FRS_Long": -104.57907,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9727,
      "AltID": "Disinfection of Effluent",
      "FacilityID": 8079,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 10740,
          "ProcessID": 9727,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 10741,
          "ProcessID": 9727,
          "ChemicalID": 49,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 9957,
          "ProcessID": 9727,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 4896,
              "Process_NAICS_ID": 9957,
              "SafetyReviewDate": "1998-03-30 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": "The Chlorine Institute, Inc. is the safety, health and environmental stewardship center",
              "HazardReviewDate": "1998-11-03 00:00:00",
              "ChangeCompletionDate": "1999-12-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Portable toxic gas sensors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-03-30 00:00:00",
              "TrainingReviewDate": "1999-04-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "State plant operator certification requirements",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "Plant Operator Certification testing by State Board",
              "MaintenanceReviewDate": "1999-04-15 00:00:00",
              "EquipmentInspectionDate": "1998-11-12 00:00:00",
              "EquipmentTested": "Toxic gas detection and alarm systems are checked monthly and calibrated twice each year",
              "ComplianceAuditDate": "1999-04-15 00:00:00",
              "AuditCompletionDate": "1999-12-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "This process uses Chlorine and Sulfur Dioxide which are delivered in 2,000 pound cylinders.  Four (4) cylinders of chlorine are attached to a manifold (bank) with two independent banks of chlorine delivering pressurized gas to nearby vacuum regulators.  Both chlorine banks are independent and have vacuum regulators.  The two banks are integrated into one vacuum system, which has a redundant system of meters, pipe and inductors.  Under vacuum, the gas is transported to the inductor and mixed with water andinjected into the wastewater.  Sulfur dioxide is connected in two separate banks of two cylinders to a bank.   Sulfur dioxide is transported in vacuum piping and mixed with water.  The sulfur is used to neutralize the chlorine residual in the wastewater.  All information, reviews, mitigation systems, detection equipment, training, maintenance, personal protection equipment, emergency response, emergency repair equipment and audits are the same for both gas processes and associated equipment.",
              "_chemicals": [
                {
                  "PrimaryKey": 5056,
                  "PreventionProgram2ID": 4896,
                  "ProcessChemicalID": 10740
                },
                {
                  "PrimaryKey": 5057,
                  "PreventionProgram2ID": 4896,
                  "ProcessChemicalID": 10741
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8079,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Pueblo Fire Department",
    "CoordinatingAgencyPhone": "7195421352",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8079,
      "SummaryText": "Facility Name:    City of Pueblo, Colorado\nWastewater Treatment Plant\n1300 South Queens Avenue\nPueblo, Colorado   81001\n\nThis plan summarizes the Risk Management Program (RMP) developed and implemented at the City of Pueblo, Colorado Wastewater Treatment Plant located at 1300 South Queens Avenue in Pueblo, Colorado.  In compliance with applicable Environmental Protection Agency (EPA) RMP requirements, the City of Pueblo RMP document describes the following components of a RMP:\n\n7 A hazard assessment program that identifies and analyzes the potential onsite and off-site impacts of worst-case and alternate accidental release scenarios of regulated substances, and includes documentation of five-year accident histories involving regulated substances.\n \n7 A prevention program that covers operating procedures, maintenance, training, management of change, process safety information, and other similar information involving regulated substances.\n \n7 An emergency action plan to mitigate any accidental releases that occur.\n \n7 An overall system to manage the development and implementation of a risk management program.\n\nThe plan is submitted in accordance with regulations cited at 40 CFR 68.155 through 68.185 for the on-site disinfection and de-chlorination processes covered by RMP regulations.  \n\nThe primary activity at the wastewater treatment plant is the treatment of wastewater for the City of Pueblo, Colorado.  Regulated chemicals used, stored, or handled on-site in amounts greater than the threshold quantities of the RMP rule are described below:\n\nCHEMICAL:  Chlorine\nPROCESS:   Disinfection\nLOCATION:  Chlorine-Sulfur Dioxide Building\nSTORAGE VESSEL(S) and QUANTITY (LBS):    \n -  Four 1-ton cylinders stored outside\n -  Four 1-ton cylinders stored inside in service; Four 1-ton cylinders stored inside on standby               RMP PROGRAM: 2\n \nCHEMICAL:  Sulfur Dioxide\nPROCESS:   De-Chlorination\nLOCATION:  Chlorine-Sulfur Dioxide Building\nSTORAGE VESSEL(S) and QUANTITY (LBS):\n -  F"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8079,
      "SummaryText": "our 1-ton cylinders stored outside \n - Two 1-ton cylinders stored inside in service; two 1-ton cylinders stored inside on standby\nRMP PROGRAM: 2\n\nAn evaluation of the appropriate worst case and alternate case release scenarios and the appropriate methods for modeling the potential release scenarios was performed as part of the hazard assessment for the City of Pueblo Wastewater Treatment Plant.\n\nThe worst case release scenario at the plant is, in accordance to EPAs requirements, a hypothetical catastrophic total release of chlorine or sulfur dioxide from a one-ton container within 10 minutes due to corrosion , impact , or construction defects.  The alternate case release scenario was determined to be from a tubing (pigtail) failure, bad connection, or valve failure resulting in a release.  Other potential alternate case release factors listed by EPA for consideration (transfer hose releases, process piping releases, process vessel releases due to cracks or failures, and releases during shipping) were not as likely to occur and/or did not result in an off-site release.  \n\nSite specific worst case and alternate case release scenarios were evaluated based upon the regulatory requirements using EPAs RMP*Comp program, National Oceanic and Atmospheric Administrations (NOAA) ALOHA modeling program, and Risk Management Program guidance documents.  These methods were evaluated since they are widely accepted by EPA, fire departments, and industry as methods for performing potential release analyses.  Other potential methods (propriety models), while having merit, were not as likely to be useful to plan for potential emergency incidents, coordinate those plans with fire departments and local emergency planning commissions, and communicate the plans to employees and the public.  \n\nNOAAs ALOHA model is generally used as an emergency response tool by fire departments and emergency responders to actual emergency situations whereas EPAs RMP*Comp is designed to be used as a plan"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8079,
      "SummaryText": "ning tool.  RMP*Comp modeling results showed good correlation with lookup tables in guidance documents available to industry, and accordingly are most representative of values most often used by other facilities.  Thus, RMP*Comp was determined to be the most appropriate method for performing off-site consequence analyses at the plant.  \n\nAn urban setting was used to reflect the topography (river bluffs, low lying areas, and trees) of the area resulting in obstructed air patterns at and surrounding the plant.  Rural conditions may be applicable east of the plant but since wind directions may be from any direction and are seasonal, the urban setting, representative of obstructed air patterns, was determined to be most applicable.\n\nThe calculated distances to the endpoints were plotted as a radius from the site (since wind direction may be from any direction) and a circular area of potential impact was determined.  It should be noted that a potential plume from the plant would likely be linear or \"tear drop\" in shape and impact only a small portion of the circular potential area of impact that is defined from the radius.  \n\nCensus data was determined for the area of potential impact using U.S. Commerce, Bureau of the Census  LANDVIEW  data and a United States Geological Survey topographic map for both the worst and alternate case release scenarios.  \n\nThe worst case scenario is based on a catastrophic failure of the chlorine or sulfur dioxide holding tank due to corrosion, impacts, or structural failure.  The entire 2,000 pound tank capacity is assumed to disperse at a rate of 200 pounds per minute for a period of 10 minutes from its outside storage area.\n\nThe modeled distance to the toxic endpoint for chlorine and sulfur dioxide under the worst case scenario are calculated as follows:\n\nChlorine - 1.3 miles\nSulfur dioxide - 1.3 miles\n\nThe alternate case scenario was calculated for a release of chlorine and of sulfur dioxide from a 1/2 inch diameter hole in a pigtail. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8079,
      "SummaryText": " The alternate case is modeled with chlorine or sulfur dioxide located inside a building with the door open such that the building is not considered to provide any mitigation for the release.  The release is allowed to take place for a period of 10 minutes before it can be stopped by human intervention.  Sensitivity analysis on the release time indicated that the radius to the toxic endpoint is the same if the release is allowed to proceed for up to 60 minutes.  This is related to the fact that the pressure drops quickly after the release occurs.\n\nThe modeled distance to the toxic endpoint for chlorine and sulfur dioxide under the alternate case scenario are calculated as follows:\n\nChlorine - 0.1 miles\nSulfur dioxide - 0.1 miles\n\nThe Wastewater Treatment Plant Superintendent, Donald Andrews, is a qualified individual with overall responsibility for overseeing the implementation of the RMP.  He has the authority to commit resources required to implement the Risk Management Program.\n\nThe City of Pueblo Wastewater Treatment Plant has developed a RMP accident prevention program (including HAZOP studies for chlorine and sulfur dioxide) from the existing maintenance program and is in compliance with the RMP requirements for Program 2. \n\nThe City of Pueblo Wastewater Treatment Plant is a \"non-responding facility\" and emergency responses permissible by City of Pueblo Waste Water Treatment Plant personnel are responses to incidental releases of hazardous substances where the substance can be absorbed, neutralized, or otherwise controlled at the time of release by employees in the immediate release area, or by maintenance personnel as well as responses to releases of hazardous substances where there is no potential safety or health hazard (i.e. fire, explosion, or chemical exposure).  This emergency action plan has been made available to and coordinated with the City of Pueblo and the Local Emergency Planning Commission.\n\nThere have been no reportable accidents involving chlo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8079,
      "SummaryText": "rine nor sulfur dioxide at the wastewater treatment plant within the past 5-years.  \n\nThe City of Pueblo Wastewater Treatment Plants Risk Management Program will be revised as necessary to ensure compliance with applicable RMP regulations and to improve safety."
    }
  ]
}