{
  "FacilityID": 8195,
  "FacilityName": "TAB Chemicals LLC",
  "FacilityStr1": "4801 South Austin",
  "FacilityStr2": null,
  "FacilityCity": "Stickney Township",
  "FacilityState": "IL",
  "FacilityZipCode": "60638",
  "Facility4DigitZipExt": "1409",
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.8035",
  "FacilityLongDecDegs": "-87.7725",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.hollandchemical.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5524434,
  "ParentCompanyName": "HCI USA Distribution Companies Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "HCI USA Distribution Companies Inc.",
  "OperatorStr1": "4801 South Austin",
  "OperatorStr2": null,
  "OperatorCity": "Stickney Township",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60638",
  "OperatorZipCodeExt": "1409",
  "FTE": 46,
  "OtherEPAFacilityID": "ILD005524434",
  "EPAFacilityID": "100000104273",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-28 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.80345,
  "FRS_Long": -87.77231,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9876,
      "AltID": "Chloroform",
      "FacilityID": 8195,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 10903,
          "ProcessID": 9876,
          "ChemicalID": 4,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10111,
          "ProcessID": 9876,
          "NAICSCode": "42269",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 9877,
      "AltID": "Cyclohexylamine",
      "FacilityID": 8195,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 10904,
          "ProcessID": 9877,
          "ChemicalID": 31,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10112,
          "ProcessID": 9877,
          "NAICSCode": "42269",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 9878,
      "AltID": "Ethylenediamine",
      "FacilityID": 8195,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 10905,
          "ProcessID": 9878,
          "ChemicalID": 26,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10113,
          "ProcessID": 9878,
          "NAICSCode": "42269",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 9879,
      "AltID": "Formaldehyde",
      "FacilityID": 8195,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 10906,
          "ProcessID": 9879,
          "ChemicalID": 1,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10114,
          "ProcessID": 9879,
          "NAICSCode": "42269",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8195,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-02-22 00:00:00",
    "ERTrainingDate": "1999-02-25 00:00:00",
    "CoordinatingAgencyName": "Central Stickney Fire Department",
    "CoordinatingAgencyPhone": "7084961268",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8195,
      "SummaryText": "The TAB Chemicals LLC facility is a chemical distribution plant located near Chicago Illinois. The facility is a part of the Chemical Distribution Business Unit of hci USA Distribution Companies Inc. headquartered in St. Louis, Missouri. hci USA Distribution Companies is an advanced distribution company serving customers worldwide products, chemicals, and advanced materials. The company ranks among the top 10 chemical distribution firms in North America. hci USA Distribution Companies has approximately 1,000 employees at more than 50 facilities in 21 states and Mexico. Additional information on hci USA Distribution Companies may be found at its Web Page: www.hollandchemical.com\n\nIt is a worldwide policy of hci USA Distribution Companies to design, blend and distribute its products and to handle materials throughout their life cycle in a manner that protects the environment and safeguards employees, customers and the public from unacceptable risk. This facility participates in the Responsible Distribution Process program of the National Association of Chemical Distributors. The Community Outreach and Emergency Response Plan of Responsible Distribution brings chemical distribution plants and local communities together through communications and cooperative emergency planning. It is also company policy to adhere to all applicable Federal, State and Local regulations.\n\nThe hci Safety Program is designed to prevent fires, explosions and accidental chemical releases. This program requires safety audits, inspection and maintenance programs, and safety training for employees and contract workers. Facilities are encouraged to listen to the concerns of the community and to consider these concerns when designing and implementing process safety systems.\n\nThe TAB Chemicals LLC facility is located at 4801 South Austin Ave. in an unincorporated area of Stickney Township near Chicago in Cook County Illinois. TAB Chemicals employs approximately 50 people at this location. The primar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8195,
      "SummaryText": "y purpose of this facility is the distribution (including repackaging and storage) of industrial and fine chemicals. The regulated processes at this location include repackaging and storage of Cyclohexylamine, Ethylenediamine, and Formaldehyde and the storage of \"factory-filled containers\" of Chloroform. These chemicals are considered hazardous by the Environmental Protection Agency (EPA) and are distributed to numerous customers who utilize these compounds for many applications ranging from water treatment, other chemical manufacturing, to pharmaceutical applications. The same properties that make these chemicals valuable also makes it necessary to observe certain safety precautions during handling and storage to reduce the threat to nearby members of our community as well as to that of the people in our and company. It is our policy to adhere to all applicable Federal, State and Local regulations. \n\nThe emergency programs in place at the facility include an Emergency Action Plan, a Fire Prevention Plan, and an Emergency Response Plan. \n \nThe EPA was mandated by law to define the Worst Case Scenario (WCS) as an unlikely event: the largest single storage vessel losing all of its contents in 10 minutes. For the regulated processes at the TAB Chemicals LLC facility, this scenario does not have off-site consequences to the public or to the environment.\n\nThe EPA terms a more likely incident an Alternate Release Scenario (ARS). An ARS could be a hose or small vessel leak. For this facility, the ARS also will not have off-site consequences. \n \nTAB Chemicals has a number of administrative controls in place to ensure the quality and safety of these products. These include regulating inventory levels; providing appropriate storage conditions; and verifications through audits and inspections of the processing equipment and conditions. All unusual operations and small leaks or spills are investigated to prevent recurrences. Routine process audits and training and testing of op"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8195,
      "SummaryText": "erators ensures that safe operating procedures are followed at all times.\n\nhci USA Distribution Company and TAB Chemicals maintains Health, Safety and Environmental manuals, which contain company policies for Risk Management, Training, Product Stewardship, Community Outreach and Hazard Communication among others. The manuals also include Emergency Action and Emergency Response Plans. This facility is also in compliance with the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard which requires careful reviews of the hazards and the safeguards that must be implemented to prevent releases of regulated chemicals. \n \nThere have been no accidental releases of Cyclohexylamine, Ethylenediamine, Formaldehyde or Chloroform in the past 5 years. No one on or off-site has ever been injured and no evacuation measures have ever been taken.\n\nThe TAB Chemicals LLC facility has emergency plans, which have been coordinated with local fire departments and the Local Emergency Response Committee (LEPC). All safety equipment is Y2K compatible. This location has conducted joint training and drills with the local fire department. All employees are trained annually on the Emergency Response Plan and several employees have received Hazardous Waste Operations and Emergency Response training.\n \nTAB Chemicals continues to improve its safety record by conducting incident investigations, safety compliance audits, continuous training of emergency procedures, and continuous community outreach actions which include: educating and training neighbors, customers, fire departments and emergency response teams. TAB Chemicals and hci USA Distribution Companies also practices continuous training of emergency procedures through regular safety meetings and all incidents are thoroughly investigated and reviewed."
    }
  ]
}