{
  "FacilityID": 8238,
  "FacilityName": "Celanese Acetate  - Celriver site",
  "FacilityStr1": "2850 Cherry Road",
  "FacilityStr2": null,
  "FacilityCity": "Rock Hill",
  "FacilityState": "SC",
  "FacilityZipCode": "29730",
  "Facility4DigitZipExt": "8998",
  "FacilityCountyFIPS": "45091",
  "LEPC": "York County LEPC",
  "FacilityLatDecDegs": "34.976944",
  "FacilityLongDecDegs": "-80.98",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 173554361,
  "ParentCompanyName": "Celanese Acetate LLC",
  "Company2Name": "HNA Holdings, Inc.",
  "CompanyDUNS": 44725419,
  "Company2DUNS": 1326073,
  "OperatorName": "Celanese Acetate LLC",
  "OperatorStr1": "2850 Cherry Road",
  "OperatorStr2": null,
  "OperatorCity": "Rock Hill",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29730",
  "OperatorZipCodeExt": "8998",
  "RMPContact": "Rebecca K. Humelsine",
  "RMPTitle": "Plant Manager",
  "FTE": 1139,
  "OtherEPAFacilityID": "SCD003159928",
  "EPAFacilityID": "100000104353",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2440-0010",
  "SafetyInspectionDate": "1998-05-12 00:00:00",
  "SafetyInspectionBy": "SC Dept of Labor, Licensing & Regulation",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-06-28 00:00:00",
  "DeRegistrationEffectiveDate": "2005-05-31 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.97752,
  "FRS_Long": -80.98206,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 9924,
      "AltID": "Chlorine",
      "FacilityID": 8238,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10160,
          "ProcessID": 9924,
          "NAICSCode": "325221",
          "_desc": {
            "NAICS_CODE": "325221",
            "NAICS_DESCRIPTION": "Cellulosic Organic Fiber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10960,
          "ProcessID": 9924,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510960,
          "ProcessID": 9924,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 9925,
      "AltID": "vinyl acetate",
      "FacilityID": 8238,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10161,
          "ProcessID": 9925,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10961,
          "ProcessID": 9925,
          "ChemicalID": 29,
          "Quantity": 1600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510961,
          "ProcessID": 9925,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 9926,
      "AltID": "formaldehyde",
      "FacilityID": 8238,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10162,
          "ProcessID": 9926,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 10962,
          "ProcessID": 9926,
          "ChemicalID": 1,
          "Quantity": 2800000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 510962,
          "ProcessID": 9926,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8238,
      "SummaryText": "RMP Executive Summary\n\nGeneral\n\nCelanese Acetate LLC (Celanese) owns and operates a cellulose acetate production facility and Celanese Chemical Inc. owns and operates a chemical distribution terminal and formaldehyde production unit at the Celanese Celriver site in Rock Hill, York County, South Carolina.  Both companies are owned by HNA Holdings, Inc.   The facility is committed to operating and maintaining all processes in a safe and responsible manner using a combination of prevention programs and emergency response planning programs.  \n\nCovered Chemicals\n\nThe facility is regulated under RMP due to the presence of chlorine, vinyl acetate, and formaldehyde, which are present in amounts greater than the threshold quantity as defined by the RMP rule. \n\nChlorine is used at the site to disinfect drinking water and process water.  Chlorine is stored on-site in 1-ton (2000 lb) cylinders.  \n\nVinyl acetate is one of the chemicals stored on-site at the chemical distribution terminal.  Vinyl acetate is received via rail tankcars, stored in an atmospheric storage tank, and is shipped via tank truck to the merchant market in the U.S. southeast regional area.\n\nFormaldehyde is produced for merchant market sales to customers in the U. S. southeast regional area, and is stored on-site as an aqueous solution in heated atmospheric tanks.  Shipments of aqueous formaldehyde solutions are made in both rail tankcar and tank truck quantities.  \n\nHazard Assessments\n\nWorst case and alternative release scenario assessments were conducted for the facility's three regulated substances: chlorine, vinyl acetate, and formaldehyde.  The chlorine Worst Case Scenario (WCS) was selected to represent the toxic chemicals' WCS at the facility since this scenario reaches the farthest beyond the plant property boundary and all the public receptors of the other cases are included in this case.  In the chlorine WCS, a sudden rupture and release of chlorine gas from a 1-ton cylinder would reach off-site end"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8238,
      "SummaryText": "points and nearby public receptors.  Reference tables from the EPA's RMP Guidance for Waste Water Treatment Plants were used for these calculations.  \n\nThe Alternative Release Scenario for chlorine is based on a leak of chlorine gas from a cylinder valve or regulator.  The toxic endpoint distance for this scenario remains within the property line of the Celanese facility, and does not go off-site.  Reference tables from the EPA's RMP Guidance for Waste Water Treatment Plants were  used for these calculations.  \n \nThe Alternative Release Scenario  for vinyl acetate is a rupture of a railcar unloading hose, resulting in a liquid release of the contents of the railcar into drains and sumps.  Due to the location of the rail car unloading area, the toxic endpoint distance for this scenario goes off-site and affects an adjoining industrial area and an unpopulated area.  EPA's OCA Guidance equations were used for these calculations.\n\nThe Alternative Release Scenario for formaldehyde was considered to be the rupture of a storage tank, releasing the liquid contents of the tank into a diked area.  The toxic endpoint distance for this scenario   remains within the property line of the Celanese facility, and does not go off-site.  Although this scenario was not considered to be more likely than the formaldehyde worst case scenario, it was chosen since other more likely scenarios would result in smaller contained spill areas, none of  which would go off-site.  A Formaldehyde Evaporating Pool Dispersion Model was used for these calculations.  This model, which has been experimentally validated, was used to account for the unique behavior of formaldehyde solutions.\n\nPrevention Program\n\nThe facility has implemented a Program Level 3 Prevention Program for all three covered chemicals, as required by the RMP rules, and in accordance with US EPA and OSHA requirements.  These prevention program provisions are specifically intended to minimize the probability and/or consequences of any "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8238,
      "SummaryText": "accidental releases from the facility and include  the following elements: employee participation, process safety information,   process hazard analyses, operating and maintenance procedures, training, mechanical integrity, management of change procedures, prestartup safety reviews, compliance auditing,  incident investigations, contractor procedures, and a hot work permit procedure.   Other specific prevention steps for covered chemicals include:\n\nChlorine:  \n-Use of a vacuum system to minimize leaks or releases \n-Area sensors and alarms to alert operators of a chlorine leak  \n-Material of construction for piping systems specifically selected to minimize corrosion and leaks\n-Requirement for  2 operators to be present for connection or disconnection of chlorine cylinders\n-Operators licensed by SCDHEC \n-Physical Barriers protecting the chlorine area   .                                                                                                                                                                    \nVinyl Acetate: \n-Administrative controls are used to limit the level to which the storage tank can be filled \n-The storage tank has level indicators and alarms alerting operators to an abnormal high level situation \n-The storage tank is equipped with a flame arrestor, relief device, and foam injection system\n-Areas around storage and transfer operations have containment dikes, drains, or sumps present to contain potential spills\n-An operator is  present during the entire unloading of rail tank cars and loading of tank trucks \n-The storage tank is electrically grounded and railcars and tank trucks are grounded during transfer operations\n\nFormaldehyde: \n- Administrative controls are used to limit the level to which the storage tanks can be filled  \n- Storage tank levels are monitored using level indicators and alarms to alert operators of a high tank level  \n- The formaldehyde production process is continuously monitored via operators and instrumentation, wit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8238,
      "SummaryText": "h multiple automatic shut downs in the event of abnormal situations  \n- Process equipment and storage vessels are equipped with pressure relief devices\n- Storage tanks, transfer operations, and a process building vent are equipped with scrubbers\n- An operator is  present during the entire loading of tank trucks and rail tankcars \n- Areas around storage, process and transfer operations have containment dikes, drains, or sumps present to contain potential spills \n\nFor all areas, operators conduct routine area visual inspections to check for leaks or equipment problems. Firewater monitor nozzles are located appropriately around each area.\n\nFive Year Accident History:  All incidents which result in or could reasonably have resulted in a catastrophic release are promptly investigated to identify and correct the root causes of the events.  The facility has not had any RMP reportable accidents of the regulated substances within the five years preceding the RMP submittal.    \n\nEmergency Response Program\n\n The facility has an integrated contingency plan, which consolidates the various federal, state, and local regulatory requirements for emergency response planning.  The facility  has an on-site emergency brigade and other emergency systems to respond to emergencies.  The facility has  coordinated its emergency response plans with the local fire departments and the York County Emergency Management Agency and LEPC to ensure appropriate response.\n\nSummary\n\nThe facility is committed to ensuring its operations are safe and in accordance with the RMP requirements, and has established a senior manager responsible for RMP development, implementation, and compliance.  This manager is committed to maintain the safety of the RMP covered processes through active adherence to the appropriate procedures and codes.  To ensure that the appropriate changes occur as necessary to maintain and improve safety, ongoing hazard reviews, training, audits, maintenance, incident investigations, and u"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8238,
      "SummaryText": "pdates of process safety systems will be conducted as required by RMP.  Updates to the RMP will be completed as necessary in response to these activities.\n\nAs documented in this submittal, the RMP for the facility has been completed in accordance with all 40 CFR 68 requirements and the facility has certified RMP compliance."
    }
  ]
}