{
  "FacilityID": 8356,
  "FacilityName": "FFNC",
  "FacilityStr1": "1300 Prospect Street",
  "FacilityStr2": null,
  "FacilityCity": "High Point",
  "FacilityState": "NC",
  "FacilityZipCode": "27260",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37081",
  "LEPC": null,
  "FacilityLatDecDegs": "35.926111",
  "FacilityLongDecDegs": "-80.023056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Future Foam, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7261415,
  "Company2DUNS": null,
  "OperatorName": "Future Foam, Inc.",
  "OperatorStr1": "1601 Avenue N",
  "OperatorStr2": null,
  "OperatorCity": "Council Bluffs",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51501",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000101338",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "Yes",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "Yes",
  "CBIUnsanitizedVersionFlag": "Yes",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.926111,
  "FRS_Long": -80.023056,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10057,
      "AltID": "polyurethane foam mfg.",
      "FacilityID": 8356,
      "ProgramLevel": 1,
      "CBI_Flag": "Yes",
      "_chemicals": [
        {
          "ProcessChemicalID": 11101,
          "ProcessID": 10057,
          "ChemicalID": 77,
          "Quantity": null,
          "CBI_Flag": "Yes",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10293,
          "ProcessID": 10057,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8356,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "High Point Fire Department",
    "CoordinatingAgencyPhone": "3368833374",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8356,
      "SummaryText": "It is the policy of FFNC to comply with all applicable federal, state and local regulations.  In the event of an emergency at the facility the local EMS system will be contacted for emergency response.\n\nFFNC manufactures flexible polyurethane foam bun stock at a plant located at 1300 Prospect Road in High Point, North Carolina.  The plant is located in an area zoned for heavy industrial use and is bordered by other industries.  The building is of masonary construction with the chemical storage and processing area separated from the rest of the building by a masonary wall.  Toluene diisocyanate (TDI) is stored in three (3) tanks, the largest having a capacity of 10,000 gallons and the other two 7500 gallons each, located in a diked tank farm with a surface area of 2430 square feet and a holding capacity of 24,000 gallons.  The tank farm is located inside the building.  Product is received by tank truck and unloaded from an outdoor diked area into the indoor storage tanks.  The motive force (truck tractor) remains attached to the trailer during the entire unloading process.  During foam manufacturing, TDI is pumped from the storage tank to the process mixer through a closed piping loop.  The mixer is an enclosed unit into which TDI and other processing chemicals are mixed and the reaction mixture is then transferred to the foam conveyor line.   All TDI pumps and tank valves are located inside the diked area.\n\nA review of the foam manufacturing process was conducted to determine applicability of Part 68 regulations to this operation.  It was determined that the facility contains one process with more than the threshold quantity of the regulated substance toluene diisocyanate (TDI) according to 68.115.  According to 68.10(b) the facility fulfills the requirements as a Program 1 facility.  The facility became operational in April 1999, therefore, does not have a five year history though since beginning operation there have not been any release incidents at the facility."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8356,
      "SummaryText": "The worst-case release (as noted below) distance to the toxic endpoint does not impact a public or environmental receptor.  Emergency response has been coordinated with the High Point Fire Department and information about chemicals onsite has been reviewed with the local emergency management coordinator.\n\nThe values reported in Sections 2.6 and 2.11 are overstated since RMP*Submit will not accept the values modeled by ALOHA, a publically availible and widely used by emergency response agencies modeling program.  ALOHA modeled a release rate of 0.00132 pounds/minute for 60 minutes with a total release of 0.079 pounds, both which are lower than reported in Sections 2.6 and 2.11.\n\nThe Worst case scenario for this facility as defined in 68.25 would be the release of the largest quantity of a regulated substance from a vessel or process line failure ...   which would be the release of the contents of the 10,000 gallon TDI tank into the tank farm containment.  This release was modeled using ALOHA and the following factors:\n              - puddle size = 2430 square feet\n              - liquid temperature = 100F\n              - atmospheric temperature = 100F\n              - the entire contents of the largest tank (10,000 gallons) instantaneously dumped into the concrete\n                  tank containment (2430 square feet)\n              - wind speed = 1.5 M/s\n              - relative humidty = 50%\n              - cloud cover = 50%\n              - stability class = F\n              - release duration = 60 minutes\n              - urban topography\n              - toxic endpoint = 0.007mg/L  (Appendix A to 40 CFR 68)\nSince the release occurred inside a building according to Section 3.2.3 Releases of Liquids with Passive Mitigation - Releases Into Buildings, the maximum rate of evaporated liquid exiting the building is taken to be 10 percent of the calculated worst case scenario evaporation rate.  Therefore, a release was first modeled as a vapor release from a 2430 square"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8356,
      "SummaryText": "foot puddle.  The worst-case scenario was then remodeled by using 10% of the puddle release rate and the direct emission option in ALOHA.  This provided a Level of Concern radius at an endpoint of 0.007 mg/L for TDI of 13 yards.  The model calculated a release rate of 0.00132 pounds/minute over a period of 60 minutes which resulted in a total release of 0.079 pounds of TDI.  The endpoint, plotted from the edge of the building, where the containment is located, would not leave the property boundries and not impact any public or environmental receptors.  The release rate for TDI is such that the release duration would exceed 60 minutes therefore ALOHA calculates the maximum release duration to be 60 minutes according to Section 2.7 of the RMP*Submit User's Manual.\n\nIn the event of a Worst Case Release FFNC would notify the High Point Fire Department and the current TDI supplier to the facility.  Since such a release would be contained in the tank farm containment inside the building emergency response would be concentrated on securing the building (closing all doors) and transferring the release into another tank and neurtalization of residue in the containment.\n\nRelease prevention is accomplished through a series of active and passive methodologies.  Passive mitigation is accomplished by the placement of the TDI tanks inside a concrete containment which limits the surface area of a pool to approximately 2400 square feet and has a capacity to hold the entire contents of all the TDI tanks.  The storage tanks and the tank containment are located inside a building which acts as passive mitigation to further reduce releases.  Active mitigation controls include pipeline valving (automatic & manual), tank outlet valves, tank high level and overflow alarms and pumping shutdown systems, pressure/vaccum relief valves, vapor balancing during product transfers, emergency backup power generation and pump operational monitoring systems.  Administrative controls include periodic"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8356,
      "SummaryText": "tank level inventories prior to receiving shipments, general inventory controls, physically monitoring tank valve operation and preventative mainatinence.  All personnel associated with the foam production operation have received training on the proper handling and use of TDI including loading and unloading operations."
    }
  ]
}