{
  "FacilityID": 8452,
  "FacilityName": "Lake Auburn Intake Facility",
  "FacilityStr1": "Pump Station Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Auburn",
  "FacilityState": "ME",
  "FacilityZipCode": "04210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "23001",
  "LEPC": "Androscoggin County LEPC",
  "FacilityLatDecDegs": "44.1385",
  "FacilityLongDecDegs": "-70.234583",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "r.burnham@ci.lewiston.me.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Lewiston Maine, Lewiston Water Division",
  "Company2Name": "Auburn Water District",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Auburn Wtr Dist & Lewiston Wtr Div",
  "OperatorStr1": "P.O Box 414",
  "OperatorStr2": null,
  "OperatorCity": "Auburn",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04212",
  "OperatorZipCodeExt": "0414",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000106404",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-27 00:00:00",
  "SafetyInspectionBy": "State of ME Dept of Labor",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2008-06-24 00:00:00",
  "DeRegistrationEffectiveDate": "2008-06-20 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 44.1385,
  "FRS_Long": -70.23458,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10196,
      "AltID": "Chlorine Disinfection Pro",
      "FacilityID": 8452,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 11267,
          "ProcessID": 10196,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10433,
          "ProcessID": 10196,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4626,
              "Process_NAICS_ID": 10433,
              "SafetyReviewDate": "1999-06-14 00:00:00",
              "PHA_Date": "1999-06-08 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-08 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-11 00:00:00",
              "TrainingReviewDate": "1999-06-11 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-11 00:00:00",
              "EquipmentInspectionDate": "1999-05-01 00:00:00",
              "EquipmentTested": "Monthly Contract with Fisher Porter -CL2 equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-11 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-11 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-11 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-11 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Chlorine disinfection process",
              "_chemicals": [
                {
                  "PrimaryKey": 5318,
                  "PreventionProgram3ID": 4626,
                  "ProcessChemicalID": 11267
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8452,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-12 00:00:00",
    "ERTrainingDate": "1999-04-21 00:00:00",
    "CoordinatingAgencyName": "Lewistion Auburn Wtr Pol Cntr Athor",
    "CoordinatingAgencyPhone": "2077820917",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8452,
      "SummaryText": "Risk Management Plan\nExecutive Summary \nLake Auburn Intake Facility\nAuburn, ME\n\n\nI.    Executive Summary\n\nA. Accidental Release Prevention and Emergency Response Policies \n\nLAIF personnel are committed to operating the intake station in Auburn, Maine in an environmentally responsible manner and to providing a safe workplace for its employees and the surrounding community.  As part of this commitment to environmental stewardship and worker safety, LAIF has developed and implemented numerous environmental and safety programs that are designed to eliminate and/or drastically reduce the potential for accidental releases.  LAIF has also developed and implemented programs designed to ensure that if an accidental release occurs it will be handled in a manner that minimizes adverse impact to personnel, the environment, the surrounding community, and the intake station.  \n\nLAIF views accident prevention, personnel protection, and environmental protection as neverending processes.  Consequently, LAIF continuously strives to improve its accident prevention, environmental protection and emergency response programs. LAIF's Risk Management Program complements this overall accident prevention and response program.  LAIF's Risk Management Program (RMP) complies with the U.S. Environmental Protection Agency's (\"EPA's\") Chemical Accident Prevention rule found at 40 C.F.R. Part 68.  This document provides the public with information about the intake station's RMP covered process, accident prevention programs, and emergency response planning efforts. LAIF's compliance with EPA's RMP rule includes:\n\n1. Completion of a hazard assessment in compliance with 40 C.F.R. Part 68, Subpart B, including the five-year accidental release history.  See Section 3.\n \n2. Implementation of a accident prevention program.  The intake station's RMP accident prevention program is coordinated with the Process Safety Management (PSM) program.  Under RMP, the intake station is classified as a Level 3 facility, th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8452,
      "SummaryText": "at must prepare accident prevention programs in compliance with RMP's Level 3 accident prevention program requirements.  LAIF has elected to prepare a plan compliant with RMP requirements and analogous Process Safety Management rules administered by the Occupational Safety and Health Administration \"OSHA\";\n \n3. Implementation of an emergency response program.  LAIF has developed an emergency response program that meets the requirements of the RMP rule.\n\nAdditional information regarding how LAIF addresses each of these requirements is provided below and in the attached RMP plan.\n\nWhile the RMP program at LAIF helps ensure that the facility is maintained and operated in a safe and environmentally responsible manner, it is just one component of LAIF's comprehensive safety and environmental programs.  Additional components beyond the scope of the RMP include, but are not limited to: regular employee/contractor safety training, periodic table-top safety and emergency response drills, acquisition and maintenance of emergency response and personnel protective equipment, development of safe work practices, implementation of safe work procedures, new project safety review procedures, preventive maintenance and regular inspections of all tanks and equipment that contain hazardous chemicals, chemical control and purchasing procedures, medical emergency response training, contractor certification, etc. \n\nThe intake station is designed and operated to minimize the possibility of an accidental release.  At a minimum, the intake station meets government and industry design and construction standards.\n\n\nB.  RMP Covered Stationary Source and Regulated Substance\n\nThe Auburn Water and Sewerage District and the City of Lewiston's Water and Sewer Division jointly own and operate the Lake Auburn Intake Facility (LAIF) in Auburn, Maine.  LAIF, located on Pumping Station Road in Auburn, chlorinates drinking water from Lake Auburn and serves as the public water supply system for the twin ci"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8452,
      "SummaryText": "ties of Auburn and Lewiston.  Lewiston Water Division and Auburn Water District operate identical chlorination systems at LAIF.  Chlorine solution is added to a common clear well for primary and secondary disinfection.  An end-of-pipe residual of 2-3 mg/L is maintained.  The average flows for Lewiston and Auburn are 4.5 million gallons per day (mgd) and 3.5 mgd, respectively.\n\nLiquid chlorine is delivered to the chlorine storage building in one-ton containers, which are unloaded using a monorail.  The maximum intended inventory is six containers (12,000 pounds) - four of which are manifolded in the system and two are stored as reserves.  Of the four manifolded containers, two are connected to the Lewiston system and two to the Auburn system.  Only one of the containers in each system is in operation mode, the second container is on stand-by.  The only chemical present at the plant in sufficient quantities to be regulated by the chemical accident prevention RMP rule (also known as the \"Risk Management Program\" or \"RMP\") is chlorine.  \n\nC. Off-site Consequence Analysis\n\nAs required by the RMP rule, LAIF's off-site consequence analysis included evaluation of a worst-case accidental release and an alternative release for each covered chemical (chlorine).\n\nA worst-case release is defined by EPA as \"a release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to an endpoint defined in ' 68.22.\"  40 C.F.R. ' 68.3.   EPA requires the worst-case accidental release to be modeled using highly conservative meteorological data designed to result in the maximum possible adverse impact.  For example, EPA requires worst-case models to be based on the hottest day of the year, with the release occurring at night with a very slow, steady wind, which would not disperse a release very effectively. Further, the model assumes that the entire contents of the largest vessel are released instantaneously.  According to "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8452,
      "SummaryText": "the Chlorine Institute, no 2,000 lb. chlorine tank has ever released its contents in ten minutes.  The probability of a 2,000 lb. cylinder of chlorine instantaneously releasing its contents in Maine on a 770F night when the wind is blowing at 3.4 miles per hour is extremely low.\n\nUsing the EPA mandated criteria described above, the worst-case release at the intake station (for purposes of RMP) would involve a complete failure of a 2,000 lb. chlorine tank, filled to maximum capacity.  If such a release occurred, the resulting vapor cloud could impact persons outside of the intake station's property line.\n\nLAIF developed an alternative release of chlorine that focuses on more realistic release scenarios occurring during more common meteorological conditions.  EPA requires modeling of a release which could impact off-site locations. After considering all criteria in the RMP rule, the Process Hazard Analysis performed on the chlorination process, and past releases, LAIF has chosen an alternative release scenario that involves a lead gasket failure at a chlorine cylinder valve in the chlorinator room. \n D. Accident Release Prevention Program\n\nLAIF has developed an accidental release prevention program designed to reduce the possibility of an accidental catastrophic release.   The program complies with the requirements of OSHA's Process Safety Management rule (found. at 29 C.F.R. Part 1910.119) and RMP accident prevention requirements found at 40 C.F.R. Part 68, Subpart D.  While certain elements of this plan have been in place for years, the plan as a whole was recently implemented.\n\nThe basic elements of LAIF's prevention program are described below: \n\n1.    Employee Participation.  LAIF has developed a written plan of action regarding employee participation in the safety and accident prevention process.  The plan describes how employees are:  (A)  consulted and what input they will have in the development of process hazard analysis (PHA) and other PSM and RMP safety eleme"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8452,
      "SummaryText": "nts; and (B) given access to PSM and RMP information.   \n\n2.    Process Safety Information.  LAIF has compiled written process safety information, which helped identify the hazards posed by chlorine, handling of materials, management, storage activities, and the chlorination process in general.  The compilation of process safety information provided the foundation for understanding the hazards involved in the chlorination  process and was crucial to the development of the PHA (discussed below).  The required process safety information includes information pertaining to the hazardous chemicals (e.g. chlorine), the technology of the process, and the process equipment.   29 C.F.R. ' 1910.119(d).\n \nThe information pertaining to the technology of the process includes: (1) block flow diagrams; (2) process chemistry; (3) maximum intended inventory; (4) safe upper and lower limits for temperature, pressure, flow and composition; and (5) an evaluation of the consequences of deviations, including those affecting the safety and health of employees and the nearby public.  \n\nThe equipment information includes: (1) materials of construction; (2) piping and instrumentation diagrams (P&IDs); (3) electrical classification; (4) relief system design and design basis; (5) ventilation system design; (6) design codes and standards employed; and (7) material and energy balances for processes built after May 26, 1992.\n\n3.    Process Hazard Analyses.  LAIF performed its most recent process hazard analysis (PHA) on the chlorination system in June 1999.  The PHA is a key component of the PSM and LAIF's RMP accident prevention program.  It provided a thorough, orderly, systematic approach for identifying, evaluating, and controlling hazards posed by the chlorination process.  The PHA utilized the what-if/checklist PHA methodology in accordance with 29 C.F.R. ' 1910.119(e) and 40 C.F.R. ' 68.67.\n\nThe PHA addressed: (1) hazards of the process; (2) engineering and administrative controls applicable to "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8452,
      "SummaryText": "the hazards and their interrelationships such as appropriate application of detection methodologies to provide early warning of releases (e.g., process monitoring and control instrumentation with alarms); (3) consequences of failure of engineering and administrative controls; (4) facility siting; (5) human factors (human error); and (6) a qualitative evaluation of a range of the possible safety and health effects of failure of controls on the employees in the work place.\n\n4.    Operating Procedures.  LAIF has developed and implements written operating procedures that provide clear instructions for safely conducting activities involved in the chlorination process.  These procedures are consistent with the process safety information described in subtask 2, above, and cover, where applicable:\n\nA.  Initial startup;\nB.  Normal operations;\nC.  Temporary operations;\nD.  Emergency shutdown including the conditions under which emergency shutdown is required, and the assignment of shutdown responsibility to qualified operators to ensure that emergency shutdown is executed in a safe and timely manner;\nE.  Emergency Operations;\nF.  Normal shutdown; \nG.  Startup following a turnaround, or after an emergency shutdown;\nH.  Consequences of deviation from operating limits;\nI.  Steps required to correct or avoid deviation;\nJ.  Precautions necessary to prevent exposure, including engineering controls, administrative controls, and personal protective equipment;\nK.  Control measures to be taken if physical contact or airborne exposure occurs;\nL.  Quality control for raw materials and control of hazardous chemical inventory levels; and\nM.    Safety systems and their functions.\n\nLAIF has also developed and implements safe work practices that provide for the control of hazards during operations.  For example, LAIF has programs that govern the following activities:  lockout/tagout; confined space entry; opening process equipment or piping; and control over entrance into PSM and RMP covered portio"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 8452,
      "SummaryText": "ns of the intake station by maintenance, contractor or other support personnel.\n\n5.  Training.  LAIF provides employees, contractors and visitors with training that focuses  on the special safety and health hazards posed by the plant operations, the RMP and PSM covered process, emergency operations, and safe work practices applicable to the employees job tasks.\n \n6.  Contractors.  As part of LAIF's contractor selection process it obtains and evaluates\ninformation regarding contract employer's safety performance and programs: (29 C.F.R. ' \n1910.119(h).  LAIF also: \n\nA.    Informs contract employers of the known potential fire, explosion, or toxic release hazards related to the contractor's work and covered process;\nB.  Explains to contract employers the applicable provisions of the facility's emergency response plan (discussed below); and\nC.  Develops and implements safe work practices to control the entrance, presence and exit of contract employers and contract employees in covered process areas.\n\n7.    Pre-startup Safety Review.  Prior to the introduction of highly hazardous chemicals to a new or existing RMP/PSM covered process, LAIF always confirms that the process is constructed and the equipment is designed in accordance with specifications, and that appropriate safety, operating, maintenance, and emergency procedures are in place to adequately protect the health and safety of employees and the nearby public.\n\n8.    Mechanical Integrity.  LAIF has developed and implements written procedures to maintain the ongoing integrity of the process equipment listed below.  LAIF also trains employees to maintain the following process equipment:\n\nA.    Pressure vessels and storage tanks;\nB.    Piping systems (including piping components such as valves);\nC.  Relief and vent systems and devices;\nD.  Emergency shutdown systems;\nE.  Controls (including monitoring devices and sensors, alarms, and interlocks); and\nF.  Pumps.\n\n9.    Hot Work Permit.  LAIF implements a hot work permit program for a"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 8452,
      "SummaryText": "ll hot work operations (e.g., welding, soldering) conducted on or near any of the components involved in the chlorination process.\n\n10.    Management of Change.  LAIF has established and implements written procedures to manage changes to process chemicals, technology, equipment, and procedures associated with the chlorination process; and changes to facilities that affect the chlorination process.  These procedures ensure that the following considerations are addressed prior to any change:\n\nA.    The technical basis for the proposed change;\nB.    Impact of change on safety and health;\nC.    Modifications to operating procedures;\nD.    Necessary time period for the change; and\nE.    Authorization requirements for the proposed change.\n\n11.    Incident Investigation.  LAIF investigates each incident which resulted in, or could reasonably have resulted in, a catastrophic release of a highly hazardous chemical in the workplace.  An incident investigation team is established and consists of at least one person knowledgeable in the process involved, including a contract employee if the incident involved work of the contractor, and other persons with appropriate knowledge and experience to thoroughly investigate and analyze the incident. \n\n12. Emergency Planning and Response.  LAIF has developed a plan that satisfies  applicable state and federal emergency response and prevention planning requirements (described under emergency response policies below). \n\n13.    Compliance Audits.  LAIF will perform a compliance audit to evaluate the water treatment plant's compliance with the PSM Standard and the RMP rule at least every three years to verify that the procedures and practices it has developed are adequate and being followed.  A report of the RMP and PSM audit findings will be developed. \n\n14.    Trade Secrets.  LAIF makes all necessary information available to those persons responsible for compiling process safety information and those assisting in the development of the process hazard analysis. \n\nE."
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 8452,
      "SummaryText": " Five Year Accident History\n\nLAIF has not experienced a RMP reportable chlorine release in the past five years.\n\nF. Emergency Response Procedures and Policies\n\nLAIF's trained emergency response team provides initial response to all leaks and spills, with assistance provided on an as-needed basis by the Auburn Fire Department and other emergency responders.  LAIF's emergency response team members have all been trained to OSHA's Incident Commander level.  Emergency response procedures are described in detail in LAIF's emergency response plan.  Employees have been trained on confined space entry procedures and the proper use of personal protection equipment (PPE).  In the event of small fires, all plant employees are trained in the use of fire extinguishers.  Personnel have also been trained to notify the facility emergency response coordinator in the event of more extensive accidental releases.  The Operations Superintendent is responsible for assessment of releases, internal notification of releases, and determinations of whether outside responders are needed.  \n\nIn the event that an accidental release, the Lewiston Water Division, Auburn Water District, and the Lewiston Auburn Water Pollution Control Authority provide response equipment and trained personnel.  The three agencies operate under mutual aid agreements to ensure that emergency response personnel and equipment are available to respond to an emergency release at LAIF.  \n\nG. Planned Changes\n\nThere are no planned changes to note. \n"
    }
  ]
}