{
  "FacilityID": 8527,
  "FacilityName": "City of Wilmington Water Pollution Control Fac.",
  "FacilityStr1": "East 12th Street and Hay Road",
  "FacilityStr2": null,
  "FacilityCity": "Wilmington",
  "FacilityState": "DE",
  "FacilityZipCode": "19809",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "10003",
  "LEPC": "New Castle LEPC",
  "FacilityLatDecDegs": "39.731278",
  "FacilityLongDecDegs": "-75.506417",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "LF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "USFilter Operating Services",
  "OperatorStr1": "East 12th Street and Hay Road",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19809",
  "OperatorZipCodeExt": null,
  "FTE": 43,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000105879",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-12-08 00:00:00",
  "DeRegistrationEffectiveDate": "2005-11-09 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 39.72954,
  "FRS_Long": -75.504334,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10320,
      "AltID": "Municipal Wastewater Trmt",
      "FacilityID": 8527,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11441,
          "ProcessID": 10320,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10558,
          "ProcessID": 10320,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4699,
              "Process_NAICS_ID": 10558,
              "SafetyReviewDate": "1999-06-19 00:00:00",
              "PHA_Date": "1999-06-19 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-16 00:00:00",
              "TrainingReviewDate": "1999-06-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Videos and interactive CD on chlorine hazards.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-19 00:00:00",
              "EquipmentInspectionDate": "1999-06-19 00:00:00",
              "EquipmentTested": "System wide test of new of new equipment will take place when installation and pre-startup safety review are completed.",
              "ChangeMgmtDate": "1999-06-19 00:00:00",
              "ChangeMgmtReviewDate": "1999-06-19 00:00:00",
              "PreStartupReviewDate": "1999-06-18 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-04-19 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-16 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-19 00:00:00",
              "ContractorSafetyEvalDate": "1997-12-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5433,
                  "PreventionProgram3ID": 4699,
                  "ProcessChemicalID": 11441
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8527,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-19 00:00:00",
    "ERTrainingDate": "1999-02-17 00:00:00",
    "CoordinatingAgencyName": "City of Wilmington LEPC",
    "CoordinatingAgencyPhone": "3025714430",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Clean Air Act, Title V Operating Permit program"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8527,
      "SummaryText": "EXECUTIVE SUMMARY\n\nWILMINGTON WATER POLLUTION CONTROL FACILITY\nRISK MANAGEMENT PROGRAM\n\n\n1. Introduction\n\nThe Wilmington Water Pollution Control Facility (WWPCF) has installed a new chlorine storage and handling facility; however, these new facilities are not yet operational.  Although all the major equipment has been installed, there are a few items that require completion prior to startup of these new facilities.  The applicable elements of the Risk Management Program for Program 3 processes have been completed; however, some minor changes to the program elements may be necessary after completion of the pre-startup safety review.  If necessary, the RMP*Submit application will be revised and re-submitted to the RMP Reporting Center after completion of the pre-startup safety review.\n\n2. Purpose\n\nChlorine is used as a disinfectant in wastewater treatment.  Wastewater contains microorganisms that are harmful to human health.  Several treatment processes are utilized at the plant to treat the raw wastewater and a chlorination system provides disinfection of the water prior to discharge. \n\n3. Storage\n\nThe maximum inventory of chlorine is two 36,000 lb cargo tanks and four one-ton containers of liquified chlorine gas for a total quantity of 80,000 lbs.  The cargo tanks and ton containers are stored outside on a concrete pad that is covered by a roofed storage structure.  The structure is open on all sides and the entire chlorine handling facility is fenced.\n\n3.\tOverview of the Wastewater Treatment Plant\n\nThe WWPCF treats approximately 90 million gallons per day (MGD) of raw domestic wastewater at its treatment plant.  The chlorine used for disinfection is supplied from cargo tanks and one-ton containers. \n\nChlorine gas is a respiratory irritant.  In sufficient concentrations, the gas irritates the mucous membranes, the respiratory tract, and the eyes.  In extreme cases, difficulty in breathing may increase to the point where death can occur from respiratory collapse or l"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8527,
      "SummaryText": "ung failure.  The characteristic, penetrating odor of chlorine gas usually gives warning of its presence in the air.  At high concentrations, it is visible as a greenish yellow gas.  Liquid chlorine in contact with the skin or eyes will cause chemical burns and/or frostbite.\n\nChlorine cargo tanks and containers are thoroughly inspected for mechanical integrity and leaking valves prior to leaving the supplier's premises.  The containers are off-loaded via a hoist on the vendor's truck.  The cargo tanks and off-loaded containers are also inspected by WWPCF personnel. \n\nThe chlorine leaves the cargo tank or ton-container as a liquid. The chlorine liquid is transferred by pipe to an adjacent structure where the liquid is vaporized in an evaporator.  The vapor is transferred by pipe to a chlorinator where it is mixed with process water. The resulting hypochlorous acid solution is then injected into the waste stream to be treated.  The chlorinators are equipped with vacuum regulators.   Wastewater passing through an injector creates a vacuum in the pipe from the chlorinator to the injector.  If the vacuum in this line is lost or interrupted, the vacuum regulator will automatically shut off the flow of chlorine gas from the chlorinator. \n\n4.\tAccidental Release Prevention\n\nAccidental releases of chlorine are prevented by routine training and adhering to the written operating procedures that cover the chlorine system from the cargo tank or ton-container unloading through the mixing of the chlorine gas with the process water.  These procedures cover both normal operations and emergency operations during which personnel may have to respond to an accidental release of chlorine.  \n\nThe chlorine system is inspected at least once per shift and leak testing is performed on the valves and fittings when the cargo tanks or ton-containers are changed-out, and at other times if a leak is suspected.  Employees who are responsible for disconnecting empty containers and connecting filled c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8527,
      "SummaryText": "ontainers to the chlorine system have been trained on the operating procedures; inspection of valves, fittings, and the connected piping; and leak testing with an aqueous ammonia solution.  Aqueous ammonia reacts with chlorine gas to form a very visible white cloud. \n\nThe treatment plant maintains six sets of Self-Contained Breathing Apparatus (SCBA) and The Chlorine Institute's Emergency Kit B for ton-containers and Kit C for cargo tanks.  WWPCF personnel receive annual training on the use of the breathing apparatus and the emergency kits.  The kits contain the necessary tools and other equipment to contain and repair most leaks in the ton-containers and cargo tanks.  Ton-containers are equipped with fusible metal pressure relief devices.  Most ton-containers have six fusible metal plugs, three in each end.  The fusible metal is designed to melt between 1580F and 1650F to relieve pressure and prevent rupture of the container in case of fire or other exposure to high temperature.  \n\nChlorine gase is heavier than air and will settle to the lowest elevation when released.  The chlorine feed room is equipped with an exhaust fan that is mounted at the outlet of a duct which has an intake near floor level and exhausts on the building roof.  There are also air intake vents located near the ceiling of the feed room.  The fan can be activated by a switch located outside the building and also by a switch inside the building.  The fan is also activated by the chlorine monitor.\n\n5.\tEmergency Response Plan\n\nThe WWPCF has coordinated emergency response with the New Castle County Local Emergency Planning Commission, City of Wilmington Police and the State Police, and fire rescue. This plan was developed in accordance with the provisions set forth in Title III of the Superfund Amendments and Reauthorization Act (SARA) of 1986.  The plan is updated as necessary, including the list of emergency telephone numbers. \n\nIf a chlorine leak develops in a cargo tank or ton-container or in t"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 8527,
      "SummaryText": "0\n\n\nOther Sensitive Areas            Brandywine Park and                --\n                                  Interstate 495   \n\n\n\n\n\n\n\n\n\nWilmingto WPCF\nK:\\RMP_Projects\\Wilmington\\WmtnEXEC.doc\t-6-"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8527,
      "SummaryText": "he connected piping, valves, or other equipment, the chlorine monitor will activate an audible alarm on the cargo tank platform and in the ton container storage area, in the chlorine feed room and the basement of the sample building.  The treatment plant is manned seven days per week and 24 hours per day. The treatment plant emergency operating procedures will be followed to determine the severity of a chlorine release and whether or not the gas may migrate off-site.  If the release may travel off site, then the Off-site Response Plan will be activated.  If the chlorine release does not pose a threat to the general public, WWPCF personnel will repair the leak.  The WWPCF have installed a windsock in the chlorine storage area so that the area to be affected by a chlorine release can be determined. \n\n6.\tWorst-Case and Alternate-Case Accidental Release Scenarios\n\nWorst-Case Release Scenario for Chlorine\nThe worst-case release scenario as postulated in the regulation (40 CFR 68.25) is the release of the greatest quantity of chlorine in a single vessel.  The entire contents of this vessel are assumed to be released as a gas over a 10-minute period.  The largest single vessel at the treatment plant is a cargo tank that contains 36,000 pounds of liquid chlorine that would be released as a gas over a 10-minute period.  A release of this magnitude would only be possible if the shell of the tank failed and the liquid formed a pool and vaporized over a 10-minute period.  The likelihood of this type of catastrophic release is very minimal.  The off-site consequence of this type of release was determined by using U. S. EPA's RMP*Comp software.  The toxic endpoint for chlorine is 3 parts per million (ppm).  The RMP*Comp results indicate that the chlorine concentration may exceed 3 ppm out to a radial distance of 13 miles from the chlorine storage area.  This is the distance to the toxic endpoint.  Beyond 13 miles, the chlorine concentration will be less than 3 ppm.  Short-term ex"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8527,
      "SummaryText": "posure to chlorine concentrations less than 3 ppm is not considered to be a health hazard.  \n\nBased on the guidance provided in the regulation and U. S. EPA's Risk Management Program Guidance for Wastewater Treatment Plants, the area surrounding the treatment plant was classified as rural due to the absence of nearby buildings and other structures, trees, and hilly terrain.  The meteorological conditions associated with the worst-case release scenario, as prescribed in the regulation, is a wind speed of 1.5 meters per second (3.36 miles per hour) and very stable atmospheric conditions.  These stable atmospheric conditions will limit the mixing of the chlorine gas with the ambient air as the gas travels downwind from the point of release.  The cloud formed by the chlorine release will grow in size and decrease in concentration as it travels downwind. \n\nAlternate-Release Scenario for Chlorine\nThe alternate release scenario is one that is more likely to occur than the worst-case release scenario.  For this scenario, it was assumed that the one-inch diameter transfer hose from the cargo tank to the manifold is sheared off and that mitigation occurs in one hour.  This assumption is based on the alternate release scenarios listed in Edition 3 of The Chlorine Institute Pamphlet No. 74 - Estimating the Area Affected by a Chlorine Release, April 1998.  The release rate for this scenario is 240 pounds per minute of liquid chlorine that will vaporize and be vented to the outside as a gas.  For this scenario, the meteorological conditions prescribed in the regulation are neutral atmospheric stability conditions and a wind speed of 3 meters per second (6.7 miles per hour).  RMP*Comp was also used to determine the radial distance at which the chlorine concentration drops to less than 3 ppm.  This distance to the toxic endpoint, as determined by RMP*Comp, is 0.70 miles (3,700 feet).   There are no residences, schools or hospitals within this radial distance. \n\nThe worst-case and a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8527,
      "SummaryText": "lternate release scenarios are summarized in Table 1, along with some additional information regarding population estimates, schools, hospitals, and other buildings or recreation areas within the radial distance to the toxic endpoint.  Census data and the location of schools, hospitals, etc., were obtained from the LandView III mapping system that includes database extracts from U. S. EPA, the Bureau of Census, the U. S. Geological Survey, the Nuclear Regulatory Commission, the Department of Transportation, and the Federal Emergency Management Agency.\n\n7.  Planned Changes to Increase Safety\n\n* Increase the frequency of practice drills to respond to an accidental release of chlorine to three times per year.\n\n\n\n\n\n\n\n\n\n\n\n\n                                  Table 1\n   Summary of the Worst-Case and Alternate Release Scenarios for Chlorine\n\n\n                               Worst-Case Release        Alternate Release\n\nType of Accidental Release   Rupture of ton-container     Shearing 1-inch \n                                                           transfer hose\n\nQuantity of Chlorine Released     36,000 pounds           14,400 pounds\n\n\nDuration of Chlorine Release       10 minutes               60 minutes\n\n\nRate of Release of Chlorine Gas  3,600 lbs per min        240 lbs per min\n\n\nWind Speed                       1.5 m/sec(3.36 mph)      3.0 m/sec(6.7 mph)\n\n\nAtmospheric Stability Class        F (very stable)           D (neutral)\n\nMethod used to determine               RMP*Comp                RMP*Comp\ntoxic endpoint\n\nChlorine concentration                 3 ppm                    3 ppm\nat the endpoint\n\nRadial distance to the               13 miles                  0.7 miles\ntoxic endpoint\n\nEstimated population within          486,651                       0\nradial distance\n\n\nNumber of residences                  178,856                      0\n\n\nNumber of hospitals                      8                          0\n\n\nNumber of schools                       249"
    }
  ]
}