{
  "FacilityID": 8568,
  "FacilityName": "Spectrulite Consortium Incorporated",
  "FacilityStr1": "1001 College Street",
  "FacilityStr2": null,
  "FacilityCity": "Madison",
  "FacilityState": "IL",
  "FacilityZipCode": "62060",
  "Facility4DigitZipExt": "0258",
  "FacilityCountyFIPS": "17119",
  "LEPC": "Madison County LEPC",
  "FacilityLatDecDegs": "38.6875",
  "FacilityLongDecDegs": "-90.166667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 152055844,
  "ParentCompanyName": "Spectrulite Consortium Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 152055844,
  "Company2DUNS": 0,
  "OperatorName": "Spectrulite Consortium Incorporated",
  "OperatorStr1": "1001 College",
  "OperatorStr2": null,
  "OperatorCity": "Madison",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62060",
  "OperatorZipCodeExt": "0258",
  "RMPContact": "Chris A. Barnes",
  "RMPTitle": "Chief Operating Officer",
  "FTE": 450,
  "OtherEPAFacilityID": "62060SPCTCOLLE",
  "EPAFacilityID": "100000106155",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-09-03 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-11-07 00:00:00",
  "DeRegistrationEffectiveDate": "2005-11-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.68415,
  "FRS_Long": -90.1678,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10382,
      "AltID": "Aluminum Holding Furnace",
      "FacilityID": 8568,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10621,
          "ProcessID": 10382,
          "NAICSCode": "331314",
          "_desc": {
            "NAICS_CODE": "331314",
            "NAICS_DESCRIPTION": "Secondary Smelting and Alloying of Aluminum"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 11548,
          "ProcessID": 10382,
          "ChemicalID": 62,
          "Quantity": 2880.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511548,
          "ProcessID": 10382,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 10383,
      "AltID": "Magnesium Cover Gas",
      "FacilityID": 8568,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10622,
          "ProcessID": 10383,
          "NAICSCode": "331419",
          "_desc": {
            "NAICS_CODE": "331419",
            "NAICS_DESCRIPTION": "Primary Smelting and Refining of Nonferrous Metal (except Copper and Aluminum)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 11549,
          "ProcessID": 10383,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511549,
          "ProcessID": 10383,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 10384,
      "AltID": "Propane dispensing",
      "FacilityID": 8568,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10623,
          "ProcessID": 10384,
          "NAICSCode": "331492",
          "_desc": {
            "NAICS_CODE": "331492",
            "NAICS_DESCRIPTION": "Secondary Smelting, Refining, and Alloying of Nonferrous Metal (except Copper and Aluminum)"
          }
        },
        {
          "Process_NAICS_ID": 10624,
          "ProcessID": 10384,
          "NAICSCode": "331314",
          "_desc": {
            "NAICS_CODE": "331314",
            "NAICS_DESCRIPTION": "Secondary Smelting and Alloying of Aluminum"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 11550,
          "ProcessID": 10384,
          "ChemicalID": 98,
          "Quantity": 13440.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511550,
          "ProcessID": 10384,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8568,
      "SummaryText": "Spectrulite Consortium Inc.\nExecutive Summary\nRisk Management Plan\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Spectrulite Consortium Incorporated are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.    Regulated Substances Handled at the SCI Madison Plant\nOur facility's primary activities encompass Secondary Aluminum Melting and Casting, Secondary Magnesium Melting and Casting, Aluminum and Magnesium Extrusion, Aluminum and Magnesium Rolling.  We have 4 regulated substances present at our facility.  These substances include Propane, Sulfur dioxide (anhydrous), Boron Trifluoride  [Borane, Trifluoro-] and Chlorine.  Propane is used as fuel for mobile service vehicles.  Sulfur dioxide (anhydrous) is used as a cover gas in a magnesium casting process.  Boron Trifluoride  [Borane, Trifluoro-] is used for corrosion prevention during various heat treating processes.  Chlorine is used for degassing of molten aluminum metal.\n\nThe maximum inventory of Propane at our facility is 13440.00 lb. while Sulfur dioxide (anhydrous), Boron Trifluoride  [Borane, Trifluoro-] and Chlorine are present at our facility in quantities of 12000.00 lb., 4060.00 lb. and 2880.00 lb. respectively.\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have used the EPA's OCA Guidance Reference Tables or Equations.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release sc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8568,
      "SummaryText": "enario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from Magnesium Cover Gas.  In this scenario 8000 lb. of Sulfur dioxide (anhydrous) is released.  The toxic liquid released is assumed to form a 1 cm deep pool from which evaporation takes place.  The entire pool is estimated to evaporate over 10 minutes.  At Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 9.3 miles is obtained corresponding to a toxic endpoint of 0.0078 mg/L.\n\nThe alternative release scenario for Sulfur dioxide (anhydrous) involves a release from Magnesium Cover Gas.  The scenario involves the release of 2000 lb. of Toxic liquid is assumed to be released to form a 1 cm deep pool from which evaporation takes place.  The entire pool is estimated to have evaporated after 10 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0078 mg/L of Sulfur dioxide (anhydrous) is 2.0 miles.\n\nOne alternative release scenario for Chlorine involves a release from Aluminum Holding Furnace.  The scenario involves the release of 160 lb. of .  Toxic liquid is assumed to be released to form a 1 cm deep pool from which evaporation takes place.  The entire pool is estimated to have evaporated after 10 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/L of Chlorine is 0.31 miles.\n\nAnother alternative release scenario for Chlorine involves a release from Aluminum Holding Furnace.  The scenario involves the release of 10 lb. of .  Toxic liquid is assumed to be released to form a 1 cm deep pool from which evaporation takes place.  The entire pool is estimated to have evaporated after 10 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.0087 mg/L of Chlorine is 0.08 miles.\n\nPropane dispensing qualifies as a program level 1 process.  In the worst case scenario for this process 6720 lb. of Propane is released.  It is assumed tha"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8568,
      "SummaryText": "t the entire quantity is released as a vapor, which finds an ignition source, with 10 percent of the released quantity participating in a vapor cloud explosion.  Under worst case weather conditions, the calculated distance of 0.15 miles is obtained corresponding to an endpoint of 1 psi overpressure.  This distance is less than the distance to the nearest public receptor.\n\n4.    The General Accidental Release Prevention Program \nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nSpectrulite Consortium Incorporated maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent update was performed on 06/15/1999.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Spectrulite Consortium Incorporated maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nSpectrulite Consor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8568,
      "SummaryText": "tium Incorporated has a training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided as needed.\n\nMechanical Integrity\nSpectrulite Consortium Incorporated carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Spectrulite Consortium Incorporated.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nSpectrulite Consortium Incorporated conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on 06/15/1999.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nSpectrulite Consortium Incorporated promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retain"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8568,
      "SummaryText": "ed for a minimum of 5 years.\n\nEmployee Participation\nSpectrulite Consortium Incorporated truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Spectrulite Consortium Incorporated has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.    Five-year Accident History\nSpectrulite Consortium Incorporated has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there have been no accidental releases during this period.\n\n6.    Emergency Response Plan\nSpectrulite Consortium Incorporated carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nMadison County LEPC is t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8568,
      "SummaryText": "he Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n7.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  A reduction in the amount of propane stored on site, replacement of 1ton Sulfur Dioxide cylinders with smaller 150 lb cylinders, and installation of improved Boron Trifluoride process storage racks are some of the major steps we are taking to improve safety at our facility with respect to these substances.  These changes are expected to be implemented by July 1, 2000.\n"
    }
  ]
}