{
  "FacilityID": 8577,
  "FacilityName": "Boeing/Rocketdyne AFRL Area 1-120 Test Stand 1A",
  "FacilityStr1": "Edwards Air Force Base",
  "FacilityStr2": "Air Force Research Laboratory",
  "FacilityCity": "Area 1-120",
  "FacilityState": "CA",
  "FacilityZipCode": "93524",
  "Facility4DigitZipExt": "5000",
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "34.944444",
  "FacilityLongDecDegs": "-117.688333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "http://www.boeing.com/defense-space/space/",
  "FacilityEmailAddress": "gary.r.moffat@boeing.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Boeing/Rocketdyne",
  "OperatorStr1": "6633 Canoga Ave - MS T487",
  "OperatorStr2": null,
  "OperatorCity": "Canoga Park",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91309",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": "CAR000041822",
  "EPAFacilityID": "100000106299",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "Not Available",
  "SafetyInspectionDate": "1998-11-05 00:00:00",
  "SafetyInspectionBy": "US Air Force",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Hydrogen System",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2001-08-22 00:00:00",
  "DeRegistrationEffectiveDate": "2001-08-08 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.944444,
  "FRS_Long": -117.688333,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10394,
      "AltID": "HYDROGEN SYSTEM",
      "FacilityID": 8577,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11564,
          "ProcessID": 10394,
          "ChemicalID": 149,
          "Quantity": 58400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10634,
          "ProcessID": 10394,
          "NAICSCode": "336415",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8577,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-09-15 00:00:00",
    "ERTrainingDate": "1998-09-15 00:00:00",
    "CoordinatingAgencyName": "Kern County Fire Department",
    "CoordinatingAgencyPhone": "6618244581",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "OSHA Regulations at 29 CFR 1910.119",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 8577,
      "SummaryText": "deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage (40 CFR 68.42) have occurred at Test Stand 1A in the past five years.\nEmergency Response Program\nTwo emergency response plans are in place: the Edwards AFB Master Emergency Plan and the Test Stand 1A Emergency Response Plan. The latter includes alert systems, notification procedures, and an evacuation plan. Edwards AFB participates in the activities of the Local Emergency Response Planning Committee. Emergency response drills and drill evaluations are conducted periodically. Emergency operation and response procedures are also reviewed at the start of a new test series.\nPlanned Changes to Improve Safety\nA Process Hazard Analysis of the hydrogen system was performed, using the Hazard and Operability (HAZOP) procedure, at the start of the last test series (October 1997). Action items requiring replacements or modifications, review, or further investigation, were identified and addressed. These included technical items, such as installation of new mitigation or control equipment, and procedural/managerial items, such as improved maintenance or training."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 8577,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies at Area 1-120 - Test Stand 1A\nA Risk Management Program has been implemented at Area 1-120 - Test Stand 1A (Test Stand 1A) to reduce the risk of accidental releases of hazardous materials. This Risk Management Plan (RMP) summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to the community of hazardous hydrogen releases.\nAs stated by Jim Albaugh, President of the Boeing Space and Communications Group, \"Considering the criticality and complexity of our products and systems, quality and safety are core values for every one of us in the Space & Communications Group. Emphasis is shifting from detection to the prevention of problems and hazards through a systematic approach to quality and safety. This emphasis, starting with design and development, continues through procurement, manufacturing, and operational/customer support.\"\nThis emphasis on safety is implemented by the Boeing/Rocketdyne Safety, Health, and Environmental Affairs (SHEA) organization, which develops and assembles EPA RMP and OSHA Process Safety Management (PSM) plans in coordination with the facility involved. The facility manager implements the RMP and PSM programs, fulfilling the Boeing/Rocketdyne commitment to protect workers and the community. The SHEA emergency response policy involves the preparation of response plans, which are tailored to each facility and to the emergency response services available at Edwards AFB and the surrounding community, and are in compliance with the EPA and OSHA Emergency Response Program requirements.\nTest Stand 1A and Regulated Substances Handled\nTest Stand 1A is owned by the US Air Force and operated by Rocketdyne Propulsion & Power, a unit of the Boeing Company. It is part of the Air Force Research Laboratory (AFRL), located within Edwards Air Force Base (AFB).  AFRL features continuously controlled access by guard station.\nAFRL is loca"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8577,
      "SummaryText": "ted on a mountain plateau in Kern County, at the eastern end of Mercury Blvd. It borders undeveloped desert areas, approximately 9.5 miles east of the Main Base, and 5.5 miles southwest of the village of Boron, which is the nearest residential area.  Test Stand 1A is located at the confluence of Jupiter Blvd. and Pluto Road; its closest distance to the Edwards AFB boundary, at Highway 58, is approximately 4.5 miles to the north. Access to AFRL from Highway 58 is restricted to official business.  \nOne regulated substance, hydrogen, a flammable material, is handled at Test Stand 1A in the maximum amount of 58,400 lb. The following units store this substance:\nVessel\tVolume\tPhysical Form\tDensity\tWeight\nV-363\t90,000 gal\tLiquid\t0.59 lb/gal\t53,100 lb\nV-366\t400 ft3 at 10,000 psig\tGas\t2.48 lb/ft3\t992 lb\nV-367\t400 ft3 at 10,000 psig\tGas\t2.48 lb/ft3\t992 lb\nV-368\t400 ft3 at 10,000 psig\tGas\t2.48 lb/ft3\t992 lb\nV-369\t400 ft3 at 10,000 psig\tGas\t2.48 lb/ft3\t992 lb\nTrailer\t788 ft3 at 2,600 psig\tGas\t0.847 lb/ft3\t666 lb\nTrailer\t788 ft3 at 2,600 psig\tGas\t0.847 lb/ft3\t666 lb\n\t\t\t\t\nThe first vessel is a vacuum-jacketed vertical tank, which stores cryogenic hydrogen at a temperature of  minus 4230F. The others are horizontal pressure vessels, which store compressed hydrogen gas at ambient temperature.\nTest Stand 1A tests rocket engines using a highly instrumented system, which feeds liquid hydrogen and liquid oxygen to the test article, where an ignition source initiates their combustion to form water (steam). Liquid hydrogen is transferred using compressed gaseous hydrogen. A computerized program controls test conditions, including stopping the test (the flow of chemicals) 2.5 seconds after levels fall outside preset ranges (an active mitigation measure).\nAll personnel monitor tests from inside a reinforced control room (block house). The equipment is used intermittently, when tests (commonly lasting a few minutes) are performed.\nWorst-Case Scenario \nAn offsite consequence analysis was per"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8577,
      "SummaryText": "formed for a worst-case scenario, using procedures recommended by EPA in their \"Risk Management Program Guidance for Offsite Consequence Analysis,\" April 1999 (OCA Guidance).\nThis worst-case scenario involves, in compliance with EPA regulations [40 CFR 68.25(e)], vaporization of the greatest amount of hydrogen held in a single vessel, namely 53,100 lb (Tank V-363), resulting in a vapor cloud explosion. It should be noted that, due to the unconfined equipment arrangement at Test Stand 1A, this occurrence can be considered highly unlikely. The distance to the EPA-specified endpoint (an overpressure of 1 psi) was determined using EPA-supplied equations (OCA Guidance, Equation C-1) based on TNT equivalency, with a 10% yield factor. At an overpressure of 1 psi, shattering of glass windows and failure of wood siding and corrugated steel or aluminum would be expected, with hazard to personnel limited to what may result from flying glass. The endpoint reached was 2,204 ft (0.42 mile).\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nA prevention program is in place to minimize the risk of hydrogen releases in accordance with the OSHA PSM rule. This program is based on the following key elements:\n 7 High level of training of the operators\n 7 Preventive maintenance program\n 7 Use of state-of-the-art process and safety equipment\n 7 Use of accurate and effective operating procedures, written with participation of the operators\n 7 Performance of a hazard review of equipment and procedures\n 7 Implementation of an auditing and inspection program.\nChemical-specific prevention steps include availability of self-contained breathing apparatus (SCBA), fire-resistant suits, face goggles and face shields, awareness of the hazardous properties of hydrogen, and presence of hydrogen detectors.\nFive-Year Accident History\nNo accidental releases from hydrogen processes that resulted in deaths, injuries, or significant property damage onsite, or known offsite"
    }
  ]
}