{
  "FacilityID": 8646,
  "FacilityName": "City of Galt Wastewater Treatment Plant",
  "FacilityStr1": "10059 Twin Cities Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Galt",
  "FacilityState": "CA",
  "FacilityZipCode": "95632",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06067",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.299694",
  "FacilityLongDecDegs": "-121.328611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Galt",
  "OperatorStr1": "495 Industrial Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Galt",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95632",
  "OperatorZipCodeExt": null,
  "RMPContact": "Douglas R. Gault",
  "RMPTitle": "Director of Public Works",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000106333",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-03-03 00:00:00",
  "DeRegistrationEffectiveDate": "2011-02-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.29095,
  "FRS_Long": -121.32212,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10475,
      "AltID": "disinfection",
      "FacilityID": 8646,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10720,
          "ProcessID": 10475,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 11661,
          "ProcessID": 10475,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 11662,
          "ProcessID": 10475,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511661,
          "ProcessID": 10475,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511662,
          "ProcessID": 10475,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8646,
      "SummaryText": "The City of Galt has instituted a Risk Management Program for their wastewater treatment facility, Galt Wastewater Treatment Plant, as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68.  The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substances (RS's) handled at this facility in excess of Federal threshold quantities; describes the structured assessment of hazards which was conducted to assess possible effects on employees and offsite public and environmental receptors; provides the results of an offsite consequences analysis; defines a prevention program, emergency response program, and mitigation measures to reduce the probability and magnitude of accidental releases of RS's; and establishes a schedule and responsibilities for implementation of mitigation measures and auditing of program elements.  This Risk Management Plan (RMP) is being filed as required by ARP regulations in order to report the elements of the current Risk Management Program and to describe further measures planned to mitigate or prevent accidental releases of RS's.  \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe City of Galt's Wastewater Treatment Plant is located at 10059 Twin Cities Rd., Galt, CA in Sacramento County, and uses chlorine for disinfection in quantities greater than the Federal threshold quantity for this RS.  This RMP contains predictive filing for sulfur dioxide which is not used at the plant at present but which can be used in the future if needed.  The wastewater treatment plant has storage, handling, and feeding systems already installed for sulfur dioxide.  The facility is located in a rural area north of the city.  There are 2 full-time employees at this site.  Chlorine and sulfur dioxide are received in ton containers by truck, handled with an electric hoist, and stored on ton container scales and storage trunnions inside the building."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8646,
      "SummaryText": "  The chlorine is used for odor control of the influent wastewater, to disinfect the wastewater effluent, and for other process uses.  The sulfur dioxide may be used in the future if necessasry to dechlorinate the disinfected effluent for aquatic toxicity control.  Pressurized chlorine gas within a ton container is withdrawn under pressure and piped to a vacuum regulator valve located in the storage room where the gas pressure is reduced to vacuum.  From there, the chlorine under vacuum is metered through rate valves and rotameters in chlorinators located in a separate room, and drawn into water solution by the passage of pressurized water through an injector.  Liquid sulfur dioxide, when used, is withdrawn from ton containers and evaporated to gas in an electrically-heated evaporator with a water bath surrounding a pressure vessel.  Pressurized sulfur dioxide gas from the evaporator is reduced to vacuum, metered, and fed to chlorinated effluent in a manner identical to the process for chlorination.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of City of Galt that the receipt, storage and handling of chlorine and sulfur dioxide at its facility be done in a manner which meets regulatory requirements and minimizes the probability and severity of accidental releases of chlorine or sulfur dioxide to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment.  In order to accomplish this goal, City of Galt has gathered safety information on chlorine and sulfur dioxide and on the process, equipment and procedures involving chlorine and sulfur dioxide; performed a structured assessment of hazards of the process and external events which might affect the process; performed an offsite consequences analysis of defined release scenarios; established a written program for prevention and mitigation of accidental releases; and established a written emergency response program coordinated with emerge"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8646,
      "SummaryText": "ncy response agencies.\n\nWORST CASE RELEASE SCENARIO\n\nA single \"worst case\" release scenario is required to be considered for each stationary source, resulting in the maximum distance to an endpoint for all toxic RS's contained on site above the threshold quantity.\nThe worst case release scenario for toxic chemicals is defined in the ARP regulations as the release of the contents of the largest single container of RS (in this case chlorine) over a period of 10 minutes. The scenario considered the release of the contents of the largest container of chlorine on site, in this case 2,000 lb.  This release scenario is not physically possible, due to the characteristics of chlorine.\n\nALTERNATIVE CASE RELEASE SCENARIO\n\nAn \"alternative case\" release scenario is required to be considered for each toxic RS handled in quantities greater than the threshold quantity at the site.\nThe \"alternative case\" scenario is described in the ARP regulations as a likely release resulting in offsite effects, considering administrative controls and mitigation measures in place, and is to be determined by the facility operators as part of the Process Hazard Analysis required to be performed during RMP development.  The \"alternative cases\" for chlorine and sulfur dioxide considered for this facility are identical, involving the release of gaseous chlorine or sulfur dioxide from a ton container due to an operator error during connection to the header piping, with the release secured by the operator after 1 minute.\n\nADMINISTRATIVE CONTROLS\n\nAdministrative controls in effect at the City of Galt which were considered to mitigate the severity of the Worst Case and Alternative Case release scenarios include the City of Galt's written policies and procedures for training of operators and maintenance personnel, written procedures for control of the inventory of chlorine and sulfur dioxide at the facility, and policies regarding quality level of replacement materials and components for the chlorine and su"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8646,
      "SummaryText": "lfur dioxide systems.\n\nMITIGATION MEASURES\n\nNo mitigation measures were considered to limit the severity of the Worst Case scenario.  No passive mitigation measures were considered to limit the severity of the Alternative Case scenario.  Active mitigation was considered for the Alternative Case, in the form of the response of a trained operator in a timely manner.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\nGeneral accidental release prevention programs instituted by the City of Galt are categorized as administrative (management) programs; procedures, training, and engineering controls; and emergency response programs.\n\nThe City of Galt has instituted a Process Safety Management (PSM) Program meeting OSHA requirements at 29 CFR 1910.119 covering its disinfection and dechlorination process.  This constitutes the general accidental release prevention program for the City of Galt's operations. The program and document management procedures included in the PSM Program will be used as the management system for the Risk Management Program.\n\nCHEMICAL-SPECIFIC RELEASE PREVENTION STEPS\n\nRelease prevention steps specific to chlorine have been identified and implemented.  These include, among other things, installing hold-down straps for ton container trunnions, and creation of numerous facility-specific operation procedures with check boxes for completion of critical steps.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidents involving chlorine or sulfur dioxide at this facility within the past five years resulting in injuries or offsite consequences.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe City of Galt's Emergency Response Program applicable to chlorine and sulfur dioxide has been coordinated with Sacramento County Environmental Management Department, Hazardous Materials Division, the local agency responsible for hazardous materials inventory reporting and release response coordination.  It consists of notification of the public agency assigned responsibility for First Re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8646,
      "SummaryText": "sponse to hazardous materials release emergencies.  First Responders have participated with City of Galt personnel in response drills.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAll of the improvements and mitigation measures identified in the process hazard analysis which the City of Galt committed to accomplish have been completed or are in progress.  Any other measures identified by employees during workplace hazard surveys, or as a result of audit activities, will be thoroughly reviewed and considered for implementation."
    }
  ]
}