{
  "FacilityID": 8700,
  "FacilityName": "Ag Partners Coop",
  "FacilityStr1": "512 South 8Th St",
  "FacilityStr2": null,
  "FacilityCity": "Lake City",
  "FacilityState": "MN",
  "FacilityZipCode": "55041",
  "Facility4DigitZipExt": "0467",
  "FacilityCountyFIPS": "27157",
  "LEPC": null,
  "FacilityLatDecDegs": "44.439389",
  "FacilityLongDecDegs": "-92.274444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "lcagp@rconnect.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "JAmes McNamara",
  "OperatorStr1": "Rural Route 1 Box 67a",
  "OperatorStr2": null,
  "OperatorCity": "Belchester",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55027",
  "OperatorZipCodeExt": null,
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000109447",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-10-22 00:00:00",
  "SafetyInspectionBy": "Minnesota Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2007-12-19 00:00:00",
  "DeRegistrationEffectiveDate": "2007-10-31 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 44.44134,
  "FRS_Long": -92.2688,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10542,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 8700,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 11737,
          "ProcessID": 10542,
          "ChemicalID": 56,
          "Quantity": 117130.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10789,
          "ProcessID": 10542,
          "NAICSCode": "115116",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 5175,
              "Process_NAICS_ID": 10789,
              "SafetyReviewDate": "1999-02-03 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1998-03-02 00:00:00",
              "ChangeCompletionDate": "1999-04-05 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-03 00:00:00",
              "TrainingReviewDate": "1999-02-03 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-03 00:00:00",
              "EquipmentInspectionDate": "1998-10-28 00:00:00",
              "EquipmentTested": "Minnesota Department of Agriculture inspection completed.  All equipment checked per Anhydrous Ammonnia Storage facility inspection checklist.",
              "ComplianceAuditDate": "1999-02-03 00:00:00",
              "AuditCompletionDate": "1999-02-03 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1998-09-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Anhydrous Ammonia Storage",
              "_chemicals": [
                {
                  "PrimaryKey": 5351,
                  "PreventionProgram2ID": 5175,
                  "ProcessChemicalID": 11737
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8700,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1998-03-02 00:00:00",
    "ERTrainingDate": "1999-02-03 00:00:00",
    "CoordinatingAgencyName": "Lake City Fire Department",
    "CoordinatingAgencyPhone": "6513455383",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8700,
      "SummaryText": "Executive Summary for Anhydrous Ammonia\nAg Partners Coop Lake City, MN\n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Ag Partners Coop are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are completely coordinated with Lake City Fire Department which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n2.    The Stationary Source and the Regulated Substances Handled\nWe have 1 regulated substance present at our facility.  This substance is Anhydrous Ammonia.  Anhydrous Ammonia is stored in a bulk storage tank and is used solely for retail distribution to local farmers for fertilizer during crop season. \n\nThe maximum inventory of Ammonia at this location is 117,130 lb. \n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo evaluate the worst case scenarios, we have used Information provided by The Fertilizer Institute (TFI), which has been developed specifically for Anhydrous Ammonia as it relates to crop production.  Modeling was completed for Anhydrous Ammonia using the DEGADIS modeling program.  Data inputted into the DEGADIS model program was based on EPA's RMP requirements.   The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 toxic substances as a class involves a catastrophic release of Anhydrous Ammonia from the bulk storage tank.  The scenario involves the release of 117,13"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8700,
      "SummaryText": "0 lb. of Ammonia in a gaseous form over 10 minutes.  At Class F atmospheric stability and 1.5 m/s windspeed.  The DEGADIS model results for Anhydrous Ammonia are a maximum distance to endpoint of 1.06 miles corresponding to a toxic endpoint of 0.14 mg/L.\n\nOne alternative release scenario will be submitted for each toxic substance present in Program 2 processes.\nThe alternative release scenario for Ammonia involves a release from the Anhydrous Ammonia bulk storage tank.  The scenario involves the release of 26,638 lbs of Ammonia in a gaseous form averaged over 10 minutes from a break in a pipe leading from or to the Anhydrous Ammonia storage tank.  It is assumed that the pipe leaks ammonia for 2 minutes before automatic or manual intervention stops the flow of ammonia.  Using a windspeed of 3 meters per second and stability class D the DEGAIS model concluded the maximum distance to endpoint of 0.78 miles corresponding to a toxic endpoint .of 0.14 mg/L.\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  Our facility is also subject to EPCRA Section 302 notification requirements.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nAg Partners Coop maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  Industry standard methodology is used to complete the hazard analysis.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8700,
      "SummaryText": " at least every five years or if any significant process changes occur.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Ag Partners Coop maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nAg Partners Coop has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least annually and more frequently as needed.\n\nMechanical Integrity\nAg Partners Coop carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\n\nCompliance Audits\nAg Partners Coop conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\nIncident Investigation\nAg Partners Coop promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8700,
      "SummaryText": "a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Ag Partners Coop has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.    Five-year Accident History\nAg Partners Coop has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.    Emergency Response Plan\nAg Partners Coop carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Annual tank inspections, Annual employee training, and Industry standard updates are some of the major steps we have taken to improve safety at our facility.\n\n8.    Certification Stat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8700,
      "SummaryText": "ement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName:\nSignature:\nTitle:\nDate signed:\n\n"
    }
  ]
}