{
  "FacilityID": 8707,
  "FacilityName": "Hercules Incorporated - Jefferson Plant",
  "FacilityStr1": "State Highway 837",
  "FacilityStr2": "( at Madison Ave.)",
  "FacilityCity": "West Elizabeth",
  "FacilityState": "PA",
  "FacilityZipCode": "15088",
  "Facility4DigitZipExt": "0567",
  "FacilityCountyFIPS": "42003",
  "LEPC": "Allegheny County LEPC",
  "FacilityLatDecDegs": "40.266167",
  "FacilityLongDecDegs": "-79.903528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39111067,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hercules Incorporated",
  "OperatorStr1": "P.O. Box 567",
  "OperatorStr2": "State Highway 837",
  "OperatorCity": "West Elizabeth",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15088",
  "OperatorZipCodeExt": "0567",
  "RMPContact": "Ronald D.Lerario",
  "RMPTitle": "Plant Manager",
  "FTE": 300,
  "OtherEPAFacilityID": "15088HRCLSSTATE",
  "EPAFacilityID": "100000109811",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "95-0058",
  "SafetyInspectionDate": "1997-11-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 40.26715,
  "FRS_Long": -79.9034,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10555,
      "AltID": "Resin Manufacturing",
      "FacilityID": 8707,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 10803,
          "ProcessID": 10555,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 11750,
          "ProcessID": 10555,
          "ChemicalID": 138,
          "Quantity": 11000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 138,
            "ChemicalName": "1,3-Pentadiene",
            "CASNumber": "504-60-9",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 11751,
          "ProcessID": 10555,
          "ChemicalID": 56,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 11752,
          "ProcessID": 10555,
          "ChemicalID": 52,
          "Quantity": 29000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 52,
            "ChemicalName": "Boron trifluoride  [Borane, trifluoro-]",
            "CASNumber": "7637-07-2",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 11753,
          "ProcessID": 10555,
          "ChemicalID": 149,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 11754,
          "ProcessID": 10555,
          "ChemicalID": 131,
          "Quantity": 1200000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 131,
            "ChemicalName": "2-Methylpropene  [1-Propene, 2-methyl-]",
            "CASNumber": "115-11-7",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511750,
          "ProcessID": 10555,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511751,
          "ProcessID": 10555,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511752,
          "ProcessID": 10555,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511753,
          "ProcessID": 10555,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 511754,
          "ProcessID": 10555,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8707,
      "SummaryText": "Policy:\n\nHercules Incorporated is a member of the Chemical Manufacturers Association and is committed to the principles of Responsible Care(R).  The Corporate Policy on Safety, health and Environment states:\n\nAt Hercules, we manufacture chemical specialty products.  We do so with full commitment to the chemical industry's Responsible Care(R) initiative.  In keeping with this commitment, we are dedicated to providing a safe and healthful environment for our employees, customers, and communities.  To do this, we are dedicated to and working toward continuous improvement in our operations to prevent pollution; to reduce risk; and to enhance safety, health, and environmental performance.  By incorporating these beliefs and attitudes into the way we do things at Hercules, we take a key step forward in minimizing the environmental impact of our operations, satisfying customers needs, and creating shareholder value.\n\nWe will adhere to the following basic principles in managing our business worldwide:\n7 We will comply with the letter and spirit of all applicable safety, health, and environmental laws, regulations, and corporate guidelines.\n7 We will define strategic objectives, develop tactical plans, identify clear accountability, provide necessary resources, and measure our progress on safety, health, and environmental matters on an ongoing basis.  Our planning will consider both business goals and significant safety, health, and environmental aspects of our products and operations.\n7 We will evaluate the safety, health, and environmental impacts of new and existing products and operations and will work to reduce the adverse impacts.\n7 We will provide for an open dialogue on safety, health, and environmental issues relating to our products and operations with our stakeholders, including shareholders, employees, customers, suppliers, government agencies, and communities.\n7 We will work to continually reduce workplace injuries; incidents with the potential for causing prope"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8707,
      "SummaryText": "rty damage, material loss, or interruption of our business; waste; and releases to the environment.\n7 We will emphasize product stewardship and advocate its importance to our suppliers, distributors, and customers.\nEvery Hercules employee, worldwide, has a role to play.  All of us are responsible and accountable for adhering to the letter and spirit of this policy.  All of us must incorporate safety, health, and environmental considerations into our daily business activities.  It takes a total team effort to truly be a Responsible Care(R) company\n\nThe Jefferson Plant has a strong commitment to continuous improvement in our safety and environmental performance.  The Jefferson Plant prevents accidents by:\n7 Designing for safety including redundant safety systems, automatic and manual shutoff valves, Hazard and Operability (HAZOP) studies on production areas, air pollution abatement equipment, and fire suppression systems;\n7 Maintaining our plant including equipment checks and shutdown preplanning, Preventative and Predictive maintenance programs (PSM - Mechanical Integrity), startup checks after maintenance, annual inspection of critical safety devices, highly skilled and trained maintenance people;\n7 Operating our plant safely including operators trained to understand the potential process hazards, written operating work instructions, and a job qualification program;\n7 Auditing our operations from self-auditing of procedures and operations, ISO 9002 certifications, PSM audits, pre-startup reviews, and incidents investigation follow-up.\n\nThe Plant is committed in all areas for improving the plant standards for safety and environmental performance and is proud of the efforts to date.\n\nFacility Description\n\nThe Hercules Incorporated - Jefferson Plant manufactures hydrocarbon resins from various petroleum streams and chemical monomers.  The products of the plant are utilized in the adhesives, graphic arts, rubber, and photocopy industries.  The plant is organized as a gr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8707,
      "SummaryText": "oup of operating units whose individual functions are relatively independent, although they share utilities, services, and storage facilities.  Raw materials, primarily hydrocarbon liquids, are polymerized in any of five units:  Thermal Poly, C-5 Process, MP-Poly, WW-Poly, Solution Poly, and Suspension Poly.  Most polymerizations result in an intermediate product or resin solution which consists of the product resin dissolved in a petroleum liquid.  The intermediates are distilled, emulsified, and hydrognated modified to produce the hydrocarbon resin packaged for consumption by various industries.  Final products are shipped as flakes, pastilles, or beads in bags, as solids in drums, and as liquids in drums, rail cars or tank trucks.\n\nBackground of the Risk Management Program\n\nThe US EPA (United States Environmental Protection Agency) under the Clean Air Act, section 112(r), developed a Risk Management Plan (RMP) rule which requires Corporations to assess risk within their plants and plant communities.  The Risk Management Plan rule requires that facilities that use certain chemicals develop and manage a Risk Management Plan.  This plan requires that we identify, assess, and document important information about chemical processes at our plant.  The regulation requires us to maintain safety and emergency response systems to prevent and prepare for chemical accidents.  The rule is also designed to inform the public (in an understandable language) about the regulated risks and the emergency prevention, safety and response programs implemented at our plant.\n\nThis law was passed in reaction to public concerns about plant accidents involving chemicals.  To minimize the consequences of such releases, the legislation wanted to focus on preventative measures on the chemicals that pose the greatest risk.  Again, managing the risk such as deciding to wear a seat belt.  The rule applies to manufacturing plants, as well as non-manufacturing sites, that produce, process, handle, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8707,
      "SummaryText": "or store more than a threshold quantity of one or more of RMP rule listed chemicals.\n\nIndustrial facilities are required to analyze all significant incidents that had consequences beyond the plant fence line over the last five years; identify \"worst case\" and alternative release scenarios for accidents at the site; and determine the possible effects of worst case and alternative case scenarios within the community.  Facilities must communicate the results of these analyses to the EPA, Allegheny County Health Department, and the local emergency planning committee (LEPC).\n\n\"Worst case\" scenario is the term used in the regulation to describe a hypothetical accidental release for emergency planning.  In the \"worst case\" model, emergency planners assume all of the safety systems fail on the facility's largest storage container or interconnected pipe system, containing an EPA listed chemical, and that the entire contents leak to the environment in 10 minutes.  Obviously, this scenario would have a great impact on the plant and the local community.  The definition of the worst case scenario severely limits the degree to which a realistic scenario can be selected.  The intention of the worst case scenario is not in fact to be realistic, but to define the upper bound impact of a release that is virtually impossible.  This exercise challenges the emergency planners to prepare for this kind of emergency.\n\nThe Jefferson Plant takes many steps to make sure that these \"worst case scenarios\" don't happen.  The EPA acknowledges that the likelihood of a worst case scenario ever occurring is extremely small.  For this reason, the EPA also allows for facilities to provide an alternative or more likely scenario.  The alternative scenario represents a potential release that is more probable than the worst case scenario and therefore more relevant to emergency planning efforts.  The Jefferson Plant will include an alternative scenario in our plan so that the emergency management agencies"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8707,
      "SummaryText": " and first responders can prepare and drill with this option.  We also have several layers of safety to prevent these incidents.  As the RMP program continues, we will learn more about these systems and the alternative scenario.\n\nWorst Case Release (Toxic)\n\nThe worst case scenario is defined as that scenario that is predicted to have the greatest distance to the applicable endpoint.  These chemical concentration endpoints are labeled toxic and flammable endpoints.  These endpoints are set by the regulations at a level considerably less than the Immediately Dangerous to Life and Health (IDLH) level as defined by the National Institute if Occupational Safety and Health.  The objective of the scenario modeling for each release scenario is to determine the downwind distance to the endpoint.  In the case of toxic substances, Ammonia and BF3, the endpoint is the concentration of the chemical in the air that is believed to be protective of the public for one-hour exposure periods.  This level of exposure would not cause any long-term health consequences.  The level would not impair the individual's ability to take protective action.\n\nThe Jefferson Plant program included dispersion modeling to analyze the scenarios.  Hercules utilized several dispersion models.  All of the seven (7) models are publicly available and referenced in the EPA guidance document.  Each model has different strengths so several models were applied to each scenario.  Certain input parameters were common to all models including meteorological data, chemical data, and release characteristics.\n\nThe Worst Case Scenario for the Jefferson Plant involves the chemical Anhydrous Ammonia.  Anhydrous Ammonia is received by the Plant in a tank truck that is unloaded into a 45,000-pound storage tank.   The ammonia is used in the resin process as a neutralizing agent.\n\nThe catastrophic release of ammonia would occur over 10 minutes due to a rupture in the storage tank.  The toxic endpoint is 200 PPM as specified b"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8707,
      "SummaryText": "y the regulation.  The IDLH is 300 PPM.  The material would be a dense cloud of a colorless gas with a pungent, suffocating odor.  The health hazards would be irritated eyes, nose and throats.  Most individuals could be exposed to the concentration level represented by the toxic endpoint for up to one hour without having irreversible or serious health effects or symptoms.  The DEGADIS model was most applicable for this release.  The model indicates that the distance to the toxic endpoint (concentration of the chemical in the air that is believed to be protective of the public for one hour exposure periods with no long term health concerns or impair the persons ability to take protective cover) is 1.35 miles.  The closest off-site receptor is 0.16 miles from the probable point of release.\n\nWorst Case Release Scenario (Flammable)\n\nThe flammable endpoint is based on pressure and not on chemical concentration.  This endpoint is 1 psi overpressure, which has the force that could break windows in a house.\n\nThe worst case flammable release would be the entire 7,300,000 pound contents of the Piperylene Storage Tank released to the containment dike.  The RMP regulations specify that 10% of the energy contained in the resulting vapor cloud participates in an explosion.  The dispersion model predicts that the regulatory endpoint overpressure of 1 psi may be felt up to 1.6 miles from the tank. The closest off-site receptors are within 0.3 miles.\n\nAlternative Release Scenarios (Toxic)\n\nAlternative scenarios are required for each RMP regulated toxic substance; Hercules has two: Anhydrous Ammonia and  Boron Trifluoride (BF3).\n\nThe Alternative or Most Likely Scenario for BF3 involves the connection of the delivery truck to the plant piping. The Jefferson Plant receives BF3 in truck tube trailer, which have seven tubes per truck.  Each tube has a capacity of 3,000 pounds.  The BF3 is used to catalyze polymerization  so it is piped from the tube trailer to several reactors at the Jef"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 8707,
      "SummaryText": "ferson Plant.\n    \nA credible scenario examines the rupture of a 3/8\" line from the trailer header of one BF3 tube.  The storage conditions are at 1600 psig and ambient temperature.  The entire contents will be released into the atmosphere.  The release of the BF3 would form a dense white cloud due to the reaction with water vapor.  The BF3 trailers are surrounded by a water deluge system.  This active mitigation system has a total of 27 water spray nozzles that deliver approximately 17 gpm (gallons per minute) per nozzle for a total flow rate of 450 gpm.  The water deluge system was designed to knock down any BF3 vapors that are accidentally releases from the tube trailers.  The toxic endpoint for BF3 is 10 PPM.  The IDLH value is 25 PPM.  The DEGADIS model indicates the distance to the toxic endpoint is 0.73 miles.  The closest off-site receptor is 0.10 miles from the site from the probable point of release.\n\nThe Alternative or Most Likely Scenario for Ammonia involves a small (= inch) hole in the 45000 pound storage tank or its local appurtenances which might result from corrosion and result in an uncontrollable release.  This release would occur over a period of 100 minutes; allowing time for a response.  Manual direction of a water stream from a fire monitor would be utilized to mitigate the actual release.  Without such mitigation, the DEGADIS model indicates the distance to the toxic endpoint is 0.34 miles.  The closest off-site receptor is 0.16 miles from the site from the probable point of release.\n\nAlternative Release Scenario (Flammable) \n\nThe Alternative or Most Likely Scenario is represented by a release of Isobutylene through a 2\" line reaching outside the dike.  The excess flow valve is assumed to have failed.  With a 1.5 m/sec wind and Class F atmospheric stability the LFL is not expected to be achieved beyond 64 meters assuming no source of ignition is first found.  If a source of ignition is found within this distance a flashback and jet fire would"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 8707,
      "SummaryText": " result.  The resulting radiation would be less than 5 kW/m2  27 meters from the source.  With the nearest off-site receptor 274 meters from the tank; no off-site impact is to be expected.\n\nGeneral Accidental Release Prevention Program\n\nHercules - Jefferson Plant has in place an effective OSHA-PSM program.  This primarily on-site program is discussed in detail in section 7 of this report.\n\nChemical-specific Prevention Steps\n\nThis report addresses 5 chemicals used in the resin manufacturing process, listed under RMP, and present in quantities exceeding the threshold for regulation.  Here we point out some of the specific considerations Hercules has made in developing a prevention program.\n\nBoth BF3 and Ammonia are stored under pressure.  The BF3 remains in the delivery cylinders while the Ammonia is transferred to a permanent supply tank upon delivery.  Both systems are equipped with excess flow check valves to prevent a major release outside the immediate area of the storage vessels.  The Anhydrous Ammonia is stored in an insulated standard design tank equipped with all standard safety devices.  The BF3 is a unique material stored at up to 2500 psi.  The extraordinary pressure combined with its corrosive nature requires extraordinary measures to prevent both minor and major releases.  Here we have utilized the vendors failsafe header cut-off to allow immediate remote shut-off should the transfer piping fail.  The trailer is located in a shed equipped with a deluge system to absorb released gas and/or prevent overheating of the cylinder in case of adjacent fire.  Automatic detectors will sound an alarm and activate the deluge system should a release occur.\n\nHydrogen is stored both as a cryogenic liquid and as a pressurized gas at the south end of the plant.  Nitrogen snuffers allow any hydrogen vent fires to be extinguished before overheating equipment.  Local sources of ignition have been minimized.\n\nPiperylene is a light petroleum product stored in a large tank equ"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 8707,
      "SummaryText": "ipped with an internal floating roof.  An installed foam system is prepared to extinguish an in tank fire before it might result in tank failure.  The tank is located within a suitable dike which will minimize the extent of the pool should tank failure occur.\n\nIsobutylene (2-Methylpropene on the RMP list) is stored in a steel sphere.  It has properties similar to butane lighter fluid and will vaporize when open to the atmosphere.  The rapid evaporation potentially results in a very cold pool of liquid.  Excess flow valves are installed on all of the bottom nozzles to prevent major releases outside the immediate tank area.  The tank is installed within a concrete dike which would minimize the spread of the cryogenic liquid which might result from tank failure. \n\nFive-Year Accident History\n\nHercules - Jefferson has reported no accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on-site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nEmergency Response Program\n\nThe Jefferson Plant has a very active Emergency Response program.  This response program involves many functions both inside and outside of the facility.    The Plant employees and Emergency Response Team (ERT) training includes:\n7 The Jefferson Plant Emergency Action Plan; including notification plans and lists (See Figure 2. Hercules Incorporated OPA Response Plan 1.3.1 Notification list);\n7 the Oil Pollution Act Plan for releases to the Monongahela River;\n7 ERT annual table top drill with the USCG, EMA, Fire Departments, response cleanup contractors, and local industries;\n7 Three Rivers Pollution Prevention Council table tops drills and meetings;\n7 Weekly plant fire drills;\n7 Joint training with the local Volunteer Fire Departments (open house with process hazards orientation and plant tour) ;\n7 Incident reviews with the Allegheny County EMA;\n7 Monthly mini-table drills for the ERT with cr"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 8707,
      "SummaryText": "itiques for improved efficiency;\n7 Plant nurse on site; and\n7 Community Shelter-in-Place program with the Community Advisory Panel. \n\nEmergency Response for Release\n\nIn the event that an accidental release the Jefferson Plant Plan would be enacted to take the following actions to protect the health and welfare of the Plant employees and residents of the community:\n\n1. Upon release, the fire alarm would have been sounded by the local operator:\n\n2. The Shift Supervisor/Incident Commander would request for the community alarm be activated;\n\n3. The Boiler House operator would be instructed to call \"List 4\" from the OPA Response Plan which contains this order:\n\n7 Jefferson Emergency/Police/Ambulance Dispatch\n7 Allegheny County Emergency Management (LEPC)\n7 Allegheny County Health Department - Air Bureau\n7 Pennsylvania Emergency Management Agency\n7 National Response Center\n\n4. The residents would take precautions to shelter-in-place and listen to the emergency broadcast system for information updates and news.\n\n5. The Plant evacuation siren would sound when appropriate management has made the decision for all clear.\n\nThe Plant information updates would include items such as:\n7 Phone numbers to answer health questions\n7 Phone numbers for property damage claims\n7 Descriptions of distinction odors\n7 Information to hospitals on chemical emergencies\n7 Continued input on what to do in the chemical emergency\n\nThis plan of action has been designed to get the release controlled as quickly as possible as well as providing a high level of safety for plant employees and community residents.\n\nPlanned changes to improve safety\n\nHercules plans to relocate and construct an enclosure for the BF3 trailer which will be equipped with the current detectors and deluge system.  It will be substantially upgraded to include a ventilation system which will draw air from the enclosure through a scrubber 24 hours per day.  The scrubber will be designed to absorb BF3 at the rate released in the worst"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 8707,
      "SummaryText": " case scenario above thus effectively preventing an atmospheric release and any off-site consequences.  This active system will have only a minor impact on the worst case; by the increased distance to the first neighbor.  It will substantially reduce the risk.\n\nSummary\n\nHercules Jefferson is committed to operating a safe and environmentally responsive chemical facility in West Elizabeth. Our Hercules-wide commitment to improving the environmental performance of our operations is most visible in our active participation in the chemical industry's Responsible Care initiative, which encompasses safety, health, and the environmental practices.  One of the areas that we continue to improve is the community awareness and emergency response.  The Jefferson Plant continues to look for opportunities to improve the safety of the production operations, employees, and the community.  In order achieve greater performance, we continue to focus on the major areas of process safety design, plant maintenance, operator training, and self-auditing."
    }
  ]
}