{
  "FacilityID": 8784,
  "FacilityName": "ENSCO, Inc.",
  "FacilityStr1": "309 American Circle",
  "FacilityStr2": null,
  "FacilityCity": "El Dorado",
  "FacilityState": "AR",
  "FacilityZipCode": "71730",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05139",
  "LEPC": "Union County LEPC",
  "FacilityLatDecDegs": "33.20875",
  "FacilityLongDecDegs": "-92.630889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "ENSCOInc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 40732943,
  "ParentCompanyName": "Brambles USA, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 65322817,
  "Company2DUNS": null,
  "OperatorName": "Brambles, USA, Inc.",
  "OperatorStr1": "The Wrigley Building",
  "OperatorStr2": "400 North Michigan Avenue, Ste 610",
  "OperatorCity": "Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60611",
  "OperatorZipCodeExt": null,
  "FTE": 340,
  "OtherEPAFacilityID": "7173ONSCNC310AM",
  "EPAFacilityID": "100000108901",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "applied for",
  "SafetyInspectionDate": "1999-04-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Ethyl Chloride and Trimethylamine Processes RMP",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.20586,
  "FRS_Long": -92.63103,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10677,
      "AltID": "Direct Burn Process",
      "FacilityID": 8784,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11890,
          "ProcessID": 10677,
          "ChemicalID": 100,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 11891,
          "ProcessID": 10677,
          "ChemicalID": 113,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10930,
          "ProcessID": 10677,
          "NAICSCode": "562211",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8784,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-04-01 00:00:00",
    "ERTrainingDate": "1999-01-05 00:00:00",
    "CoordinatingAgencyName": "Union County LEPC",
    "CoordinatingAgencyPhone": "8708628595",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8784,
      "SummaryText": "ENSCO, INC.,  309 AMERICAN CIRCLE, EL DORADO, ARKANSAS  71730\n\nFACILITY DESCRIPTION, REGULATED SUBSTANCE, ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\n\nENSCO, Inc. is a hazardous waste incineration facility that operates with three rotary kilns for solid incineration and a thermal oxidation unit for liquid incineration.  Two warehouses are permitted for storage of containerized hazardous waste, as well as several agitated tanks for the storage of liquids awaiting incineration. The products stored on site are waste because there is no longer any economical use for them.  Incineration has been determined to be the most cost effective and environmentally sound method of disposal for this waste.  The products are hazardous because they meet one or more of the standard hazard categories (flammable, reactive, toxic or corrosive).  ENSCO handles two chemicals in the incineration process that are regulated under the EPA Risk Management Plan standard (40 C.F.R. 68), ethyl chloride and trimethylamine.  Both flammable substances are present in mixtures (ethyl chloride in concentrations of 30% to 60% and trimethylamine in concentrations of 5% to 25%) and are liquids at ambient temperatures.\n\nThe products stored for incineration include a wide variety of petroleum based materials, and other organic and inorganic chemicals in varying degrees of purity.  The majority of the products are completely reacted, diluted, or mixed with dirt and debris.  All products brought into the facility are profiled and analyzed by technical chemists to determine the proper disposition.  The waste products are then subjected to extreme heat which breaks the chemicals down into its basic molecular structure, eliminating its hazardous components.  It should be noted that the NAICS code reported in the RMP data elements is 562211 which is Hazardous Waste Treatment and Disposal.  This is the only NAICS code available to choose from that best describes the facilities activities; however"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8784,
      "SummaryText": "to clarify the description, ENSCO is not involved in the disposal of the hazardous waste. \n \nENSCO's commitment to providing a safe, healthy work environment for employees as well as providing a safe, healthy environment for the surrounding community is supported by installation of  the latest technology in process controls, active mitigation, passive mitigation, monitoring detection systems and emergency response procedures.  ENSCO's policy in the event of an accidental release of ethyl chloride and or trimethylamine is to respond to the release with employees that have been specially trained to control and cleanup releases of hazardous chemicals.  ENSCO adheres to all applicable Federal, State and local safety and environmental regulations for the prevention of releases of these chemicals.\n\nWORST-CASE SCENARIO:\n\nEPA has defined a worst-case release as, a release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to a specified endpoint.  Administrative controls that limit the quantity of a substance in a vessel or pipe can be considered when determining the worst-case scenario as well as passive mitigation.  For the worst-case scenario, the possible causes of the release or the probability that such a release might occur is not considered; the release is simply assumed to take place.  \n\nThe EPA RMP Offsite Consequence Analysis Guidance uses the equation for a vapor cloud explosion analysis that is based on the TNT-equivalency method of the UK Health and Safety Executive, as presented in the publication of the Center for Chemical Process Safety of the American Institute of Chemical Engineers (AIChE), Guidelines for Evaluating the Characteristics of Vapor Cloud Explosions, Flash Fires, and Boiling liquid, expanding vapor explosion (BLEVEs) (1994).  The assumption was made for the worst case that the total quantity of the released substance is in the flammable part of the cloud.  The AIChE d"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8784,
      "SummaryText": "nting equipment, hydrocarbon detectors and alarms located throughout the facility, and spill containment provided on-site.  These elements of the prevention program help to ensure an uncontrolled release of ethyl chloride and trimethylamine is prevented.\n\nFIVE YEAR ACCIDENT HISTORY:\n\nNo accidental releases of ethyl chloride or trimethylamine have occurred at ENSCO in the past five years that has resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nEMERGENCY RESPONSE PROGRAM:\n\nENSCO has developed an emergency response plan (in accordance with 29 CFR 1910.38) that includes provisions to evacuate non-responding employees from the facility in the event of an uncontrolled accidental release of a hazardous chemical.  ENSCO is also subject to OSHA's Hazardous Waste Operations and Emergency Response (HAZWOPER) Plan regulations (29 CFR 1910.120).  ENSCO has developed and implemented a HAZWOPER program that includes on-site emergency responders, on-site fire brigade, fixed and mobile fire protection equipment, and fire and vapor suppression chemicals.  Training on the HAZWOPER program is conducted on a bimonthly basis to ensure employees are properly trained and ready to respond to a chemical emergency.    \n\nIn the event of an uncontrolled release of ethyl chloride and or trimethylamine, trained ENSCO personnel will respond to the emergency.  The Union County LEPC will be contacted as well as the local fire department to assist in the emergency response.  ENSCO has coordinated with the Union County LEPC and the local fire department on the hazard chemicals present at the facility and ENSCO's emergency response policies.\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nENSCO is committed to continuous efforts to improve the safe operation of the ethyl chloride and trimethylamine processes by implementing preventative maintenance programs, inspection programs, an"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 8784,
      "SummaryText": "d employee training in the safe operation of the equipment and the system.  Both the ethyl chloride and trimethylamine processes are designed in accordance with good engineering practices.  Regular review of the ethyl chloride and trimethylamine process ensures that any system changes or modifications are evaluated and necessary safety precautions and or safety improvements are made before the process is placed into operation."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8784,
      "SummaryText": "ocument lists this assumption as one of a number that has been used for vapor cloud explosion blast prediction; it was chosen as a conservative assumption for the worst-case analysis.  The yield factor of ten percent (10%) was a conservative worst-case assumption based on information presented in the AIChE document.  According to the AIChE document, reported values for TNT equivalency for vapor cloud explosions range from a fraction of one percent to tens of percent; for most major vapor cloud explosions, the range is one (1%) to ten(10%) percent.  \n\nEPA stated in 40 C.F.R. ' 68.25(2) that For regulated flammable substances that are normally liquids at ambient temperature, the owner or operator shall assume that the entire quantity in the vessel or pipe, as determined under ' 68.25(b), is spilled instantaneously to form a liquid pool.  For liquids at temperatures below their atmospheric boiling point, the volatilization rate shall be calculated at the conditions specified in ' 68.25(d).  The owner or operator shall assume that the quantity which becomes vapor in the first 10 minutes is reported as the quantity released.  The two regulated flammable substances, when pure, are normally gases at ambient temperature, but when the substances are contained in mixtures they are liquids at ambient temperatures, therefore the worst-case scenario is calculated according to ' 68.25(2).\n\nThe endpoint for the vapor cloud explosion analysis, 1 psi, is reported to cause damage such as shattering of glass windows and partial demolition of houses. This endpoint was chosen by EPA for the consequence analysis because of the potential for serious injuries to people from the property damage that might result from an explosion.\n\nThe TNT equivalent model was chosen by EPA as the basis for the consequence analysis because of its simplicity and wide use.  This model does not take into account site-specific factors and many chemical-specific factors that may affect the results of a vapor c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8784,
      "SummaryText": "loud explosion. \n\nMeteorological conditions for the worst-case scenario are defined by EPA Guidance as atmospheric stability class F (stable atmosphere), wind speed of 1.5 meters per second (3.4 miles per hour), and ambient air temperature of 25 degrees C.\n\nIt is only required to document on the actual RMP a worst-case scenario for one flammable chemical.  However, the worst-case scenario identified on the RMP must be for the regulated flammable chemical that has the greatest offsite consequence.  Therefore, in order to determine which regulated chemical had the largest area of off-site impact, a worst-case analysis for both chemicals was conducted.  \n\nThe estimated distance to the overpressure of 1 psi for each flammable chemical is 0.1 miles or 528 feet.  The prevention program required under the RMP rule is determined by the worst-case scenario.  The worst-case scenario for the regulated substances at ENSCO does not reach public receptors.   Public receptor means locations where members of the public may be exposed to radiant heat, or overpressure as a result of the release.  Public receptors include locations within the facilities property boundary to which the public has routine and unrestricted access during or outside business hours (e.g. recreational field).  Locations inhabited or occupied by the public at any time without restriction by the source are public receptors.\n\nWORST-CASE SCENARIO - ETHYL CHLORIDE\n\nThe worst-case scenario for the ethyl chloride process involves the rupture of the ethyl chloride tanker truck.  The entire contents of the tanker would release into the containment area that is located around the tanker.  The containment area is designed to contain the entire contents of the tanker.  The total quantity of ethyl chloride would be 20,167 pounds.  Changes to the RMP rule allows flammable liquid substances worst-case scenario calculations to be calculated in the same manner as toxic liquids.  The evaporation rate of the flammable liquid is"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8784,
      "SummaryText": "accounted for in the estimation of the distance to the one (1) psi overpressure when calculating the worst-case scenario.  The amount of vapor due to evaporation results in a vapor cloud explosion.  A yield factor of 10 percent (10%) of the available energy released in the explosion is used to determine the distance to the explosion endpoint.  The evaporation rate for the ethyl chloride mixture (387.57 pounds/min) was determined using the vapor pressure, molecular weight, temperature, surface area of the pool formed by the spill of ethyl chloride, and a wind speed of 1.4 meters per second.    \n\nEPA's changes to the worst-case scenario calculation methods states that the owner or operator shall assume that the quantity which becomes vapor in the first 10 minutes (3,875.70 pounds) is reported as the total quantity released.  \n\t\t\nUsing the look up tables in EPA Offsite Consequence Analysis Guidance document dated April 15, 1999, the distance to the 1 psi overpressure for a release of 3,875.70 pounds of ethyl chloride is 0.1 miles.\n\nACCIDENT RELEASE PREVENTION PROGRAM:\n\nThe distance to the 1 psi overpressure for ethyl chloride for the worst-case scenario does not reach public receptors, therefore ENSCO is subject to Program 1 requirements of the RMP rule.  Program 1 requires that a worst-case scenario is analyzed and that ENSCO coordinates emergency response actions with local emergency planning and response agencies.  However, to ensure the safe operation of the processes, ENSCO has developed and implemented accidental release prevention programs for the ethyl chloride and trimethylamine processes as well as for all chemical processes at the facility.  Operating procedures were developed for the safety operation of each process and employees are trained on proper implementation of these procedures.   The prevention program includes inspections and testing of equipment in the process to ensure the mechanical integrity of the system, high level alarms and emergency ve"
    }
  ]
}