{
  "FacilityID": 8786,
  "FacilityName": "THOMAS MACKEY WATER TREATMENT PLANT",
  "FacilityStr1": "4001 5TH AVE N",
  "FacilityStr2": null,
  "FacilityCity": "TEXAS CITY",
  "FacilityState": "TX",
  "FacilityZipCode": "77590",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48167",
  "LEPC": "Galveston County-Texas City LE",
  "FacilityLatDecDegs": "29.448222",
  "FacilityLongDecDegs": "95.018167",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "GULF COAST WATER AUTHORITY",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "GULF COAST WATER AUTHORITY",
  "OperatorStr1": "3630 HWY 1765",
  "OperatorStr2": null,
  "OperatorCity": "TEXAS CITY",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77591",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": "txp490208712",
  "EPAFacilityID": "100000108983",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": "1999-07-09 00:00:00",
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "No",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 29.3883,
  "FRS_Long": -94.95543,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10679,
      "AltID": null,
      "FacilityID": 8786,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11893,
          "ProcessID": 10679,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10932,
          "ProcessID": 10679,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 5205,
              "Process_NAICS_ID": 10932,
              "SafetyReviewDate": "1999-03-31 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "Yes",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-03-31 00:00:00",
              "ChangeCompletionDate": "2000-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-11 00:00:00",
              "TrainingReviewDate": "1999-06-15 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-07 00:00:00",
              "EquipmentInspectionDate": "1999-06-07 00:00:00",
              "EquipmentTested": "REGULATOR,PIGTAIL,ALARM,YOKE,HEADER,PRESSURE GUAGE,CHLORINATOR.",
              "ComplianceAuditDate": "1999-06-15 00:00:00",
              "AuditCompletionDate": "2000-06-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-03-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5383,
                  "PreventionProgram2ID": 5205,
                  "ProcessChemicalID": 11893
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8786,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "TEXAS CITY FIRE DEPT",
    "CoordinatingAgencyPhone": "4096435700",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8786,
      "SummaryText": "EPA RISK MANAGEMENT PROGRAM\n\nEXECUTIVE SUMMARY\n\nThe Thomas Mackey Water Treatment Plant produces drinking water for seven cities in Galveston County.   The amount of chlorine used at the plant is above the 2000-lb. EPA threshold hazardous level. \n\nThe owner and operator of the plant is Gulf Coast water Authority, a public water authority created by the State of Texas to provide water to municipalities, industry, and agriculture.  Safety is a mission of all employees at GCWA; also, it is GCWA policy to adhere to all applicable safety Federal and state rules and regulations. For these two reasons GCWA has taken precautions to ensure the safe storage and handling of chlorine to minimize employees and the surrounding community to chlorine.\n\nCHLORINE:  Quantities of chlorine gas above the 2000 lbs. EPA hazardous threshold level are kept at the plant at each of two chlorine processes:  Post Filter Chlorination and Chlorine Dioxide Production \n\n7 Post Filter Chlorination: Chlorine is feed to the filter effluent to sterilize the purified water before sending it to storage.  Chlorine feed at this process averages 550 lbs. per day.  Two cylinders are kept on-line to provide the 550 lbs. per day, an additional two cylinders are kept as standby on the header to insure continuous sterilization, and 8 cylinders are kept outside the chemical feed building in storage.  The total number of cylinders for this process is 12 cylinders (24,000 lbs.). \n\n7 Chlorine Dioxide Production: Chlorine is feed to a chlorine dioxide generator to produce chlorine dioxide.  The chlorine dioxide is fed after post chlorine feed to enhance sterilization.  Chlorine feed to the chlorine dioxide generator averages 185 lbs./day.  One cylinder is kept on line, an additional cylinder is kept hooked up as standby to switch over when the first empty, and a third cylinder is kept at the process for storage.  The total number of cylinders on site for this process is three (6,000 lbs. chlorine).\n\nOFF SITE CONSEQ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8786,
      "SummaryText": "UENCES\n\nWORST CASE RELEASE SCENARIO\n\nThe worst case release scenario is the release of the contents of a 2000 lbs. cylinder container over a 10 minute period (rate =200 lbs./min).   The toxic end point distance of the release is 1.3 miles.  This is the distance from the cylinders that the dissipated cloud must travel to drop to a concentration below a toxic level of 0.087 mg/liter (3 PPM) -  a level that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or serious health effects or symptoms which could impair an individual's ability to take protective action.  The toxic end point distance is based on the EPA's RMP \"Guidance for WasteWater Treatment Plants Reference Tables\" that is found at    http://www.epa.gov/swercepp/pubs/potw/pchap-04.pdf .   \n\nENDPOINT BASIS: The toxic end point dispersion distance is based on: \n7 chlorine cylinders located at ground level in an urban environment with trees and buildings       \n7 1.5 meters per second wind speed and a F atmosphere stability class\n7 25 C (77 f) ambient temperature and a 50% humidity level  \n7 chlorine gas density heavier than air  \n7 no building walls considered a release barrier (cylinder loading and storage is outdoors ) \n\nESTIMATED OFFSITE RECEPTORS: The offsite receptors in a circular area with the center of the circle defined as the point of release and the radius is the distance to the endpoint.  The types of receptors in the circle includes:\n\n7 Residential population:  1,100 Residential (apartments dwellers and homes) \n7 Other Public receptors :  Major Commercial Sites\n7 Environmental Receptors: No parks, monuments, wildlife sanctuaries\n \n\nALTERNATIVE RELEASE SCENARIO\nThe alternative case release scenario is a failure of the high pressure transfer header connection between two vessels and the release of chlorine as a result  through a 5/16 inch opening at a rate of 240 LB/min , mitigated by building walls down to a rate of 130 lbs./min.   The toxic en"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8786,
      "SummaryText": "d point distance of the release is 0.2 miles.  This is the distance from the cylinders to where the dissipated cloud concentration drops below the toxic level of 0.087 mg/liter (3 PPM) -  a level that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or serious health effects or symptoms which could impair an individual's ability to take protective action.  The toxic end point distance is based on the EPA's RMP \"Guidance  for Waste Water Treatment Plants Reference Tables\" that is found at    http://www.epa.gov/swercepp/pubs/potw/pchap-04.pdf .   \n\nENDPOINT BASIS: The toxic end point dispersion distance is based on: \n7 chlorine cylinders located at ground level in an urban environment with trees and buildings       \n7 1.5 meters per second wind speed and a F atmosphere stability class\n7 25 C (77 f) ambient temperature and a 50% humidity level  \n7 chlorine gas density heavier than air  \n7 building walls provide a release rate barrier factor of 55% \n\n\nESTIMATED OFFSITE RECEPTORS:  The offsite receptors in a circular area with the center of the circle defined as the point of release and the radius is the distance to the endpoint.  The types of receptors in the circle includes:\n\n7 Residential population:  20 Residential (apartments dwellers and homes) \n7 Other Pupil receptors :  Commercial Sites \n7 Environmental Receptors:  No parks, monuments, wildlife sanctuaries\n\n\nFIVE YEAR ACCIDENT HISTORY \n\nThere were no accidental chlorine releases the last five years. \n\nA blank copy of an incident release form and instructions for filling in the form are found in a file called Chlorine Incident  Investigation.\n\nAll completed Incident Investigation forms the last five years are found in the same file (Chlorine Incident Investigation.doc).  \n\nACCIDENT RELEASE PREVENTION PROGRAM  \n\nPREVENTION PROGRAM DESCRIPTION\n\nThe elements of the chlorine release prevention program described below applies to two chlorine processes:\n1) Post Fil"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8786,
      "SummaryText": "ter Chlorination to the treated water to disinfect the purified water leaving the filters and \n2) 2) Chlorine Dioxide Production to enhance disinfect after post chlorinating \nexcept:\n\n7 The Post Filter Chlorination Process utilizes two cylinders on-line together and the two cylinders are connected by a common high pressure header (used for the alternative case release scenario).  Chlorine Dioxide Production Process utilizes only one cylinder (a high pressure header with another cylinders does not exist).   Also the one cylinder is not in a building.\n7 The Post filter Chlorination Process maximum inventory is 24,000 (12 one ton cylinders).  The Chlorine Dioxide Production maximum inventory is 6,000 lbs.  \n\nSAFETY INFORMATION \nThe Thomas Mackey Water Treatment Plant was constructed in 1972; however, the Post Filter Chlorine Process facility was refurbished May 1,1999.  The Chlorine Dioxide Production Chlorine Process was refurbished in 1991.   Facilities and equipment were designed and constructed to comply with: Standards of National Electrical Manufacture Association, Recommendations of the Chlorine Institute, Joint Industrial Council, Instrument Society of America,  Texas City Fire Codes, and Texas City Building Codes.  \n\nChlorine process Safety Information includes safety information on a) chlorine (MSDS) and  b) chlorine process feed equipment (cylinders, headers, regulators, feeders,\u0005).  \n\nThe last reviews of the Process Safety Information along with recommendations and corrective action dates was conducted 3/31/99 and can be found with the process Safety Information.  The next safety review must be within the next five year Risk Management Program Review / Submit.\n\n\nHAZARD REVIEW\nThe major chlorine hazard is a toxic release.  Preventive measures taken to mitigate a leak include: gas detection analyzers connected to an alarm system,  automatic vacuum loss system shutoff,  manual shut off valves, emergency air supply along with employee personnel protective equip"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8786,
      "SummaryText": "ment to permit corrective actions, continuously operated chlorine room purge system, and annual operator & maintenance personnel training.   \n\nBoth the Post Chlorine and Chlorine Dioxide Generator Chlorine Process Hazard Reviews are updated each time the process is changed (revised operator procedures, new equipment,\u0005).\n \nThe last Hazard Review for the Post Chlorine Process was 3/31/99.  \n\nThe last Hazard Review for the Chlorine Dioxide Generator Process was 3/31/99.\n\n\n\nOPERATING PROCEDURES AND TRAINING\n\nOperator Procedures were last reviewed and Operator training was completed 6/11/99.\n\nMAINTENANCE PROCEDURES AND TRAINING\nMaintenance Procedures were last reviewed and Maintenance Personnel Training was last completed 6/7/99.   Manufacture recommended maintenance procedures are in a binder labeled \"Chlorine Systems\"  found in the maintenance shop office.  Maintenance PM procedures (see: Chlorine PM Checklists) are conduced every 6 months.  \n\nPREVENTION PROGRAM COMPLIANCE AUDIT\nAt least every three years, an audit of the prevention program is preformed for each covered process.  The last two audits with findings are kept on file (below).  An audit report (checklist is sufficient) is generated with audit finding / recommendations with responses to each finding / recommendation. At the bottom of the audit check lists, itemize all actions corrective actions recommended as a result of the audit were taken along with the date each action was completed. \n \nThe last compliance audit occurred June 15,1999.\nThe expected date of completing of all changes resulting from the compliance audit is June 15, 2000. \n\nEMMERGENCY RESPONSE PLAN\nThe Thomas Mackey Water Treatment Plant is under the community emergency response plan managed by the Texas City Fire department at 409 643-5700.   All accidental releases must be reported to the Texas City Fire Department.  The Fire Dept will coordinate with the Local Emergency Planning Committee (LEPC).\n\nThe emergency response plan was reviewed 5"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8786,
      "SummaryText": "-31-99.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nChanges planned to be completed by 6/1/2000 to improve safety are:\n7 Install Windsocks at both chlorine sites\n7 Install a enclosed weather and rodent proof storage cabinet within 30 feet of the chlorine process areas for personal protective equipment, breathing air, leak detection equipment (ammonia and rags) and cylinder Kit B repair kit.\n7 Purchase personnel protection equipment (gas tight suit with face shield, shoes and gloves)\n7 Install cylinder scales\n7 Install doors to enclose the chlorine room.\n7 Discontinue parking plant vehicles with in 15 feet of stored cylinders.\n7 Implement quarterly system maintenance PM schedule.\n7 Review signage and correct as appropriate.\n7 Wire Chlorine gas leek detector local alarm to plant computer in the control room and make the alarm a general plant broadcaster alarm.\n\n   \n\nRMP SUBMIT  & LETTER OF CERTIFICATION \n\nThe first RMP program was submitted on a disc June 21, 1999 (postmarked date) along with a letter of certification. \n\nFuture submittals must occur:\n7 no later than every five years on the anniversary date of the last program postmarked date\n7 no later than the date a new regulated substance is present at the facility\n7 within 6 months of a change that requires a revised PHA\n7 within 6 months of a change that requires a new offsite consequences analyses.\n\nFuture RMP program submittal postmark dates are:\n\n\nThe RMP submit software, instructions on how to fill in the submit program can be acquired at http://www.epa.gov/swercepp/rmp-dev.html or by calling 1(800) 424-9346. http://www.epa.gov/swercepp/pubs/srmp/manual.pdf"
    }
  ]
}