{
  "FacilityID": 8796,
  "FacilityName": "South County Regional Water Treatment Plant",
  "FacilityStr1": "3851 Utilities Drive",
  "FacilityStr2": null,
  "FacilityCity": "Naples",
  "FacilityState": "FL",
  "FacilityZipCode": "34117",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12021",
  "LEPC": "Collier County Emergency Mngt.",
  "FacilityLatDecDegs": "26.165833",
  "FacilityLongDecDegs": "-81.684444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PF",
  "FacilityURL": "colliergov.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 76997790,
  "ParentCompanyName": "Collier County Water - Sewer District",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Collier County Public Works",
  "OperatorStr1": "3301 East Tamiami Trail",
  "OperatorStr2": "Building H",
  "OperatorCity": "Naples",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34112",
  "OperatorZipCodeExt": null,
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000109571",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1994-05-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 26.166335,
  "FRS_Long": -81.683993,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10692,
      "AltID": "Chlorination-water",
      "FacilityID": 8796,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11907,
          "ProcessID": 10692,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 10945,
          "ProcessID": 10692,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 4964,
              "Process_NAICS_ID": 10945,
              "SafetyReviewDate": "1999-06-17 00:00:00",
              "PHA_Date": "2002-06-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-04-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-17 00:00:00",
              "TrainingReviewDate": "1999-06-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-17 00:00:00",
              "EquipmentInspectionDate": "1999-01-20 00:00:00",
              "EquipmentTested": "Chlorinators, regulators, injectors, leak detectors, and piping",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-17 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-17 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-17 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-06-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5778,
                  "PreventionProgram3ID": 4964,
                  "ProcessChemicalID": 11907
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8796,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-17 00:00:00",
    "ERTrainingDate": "1998-08-01 00:00:00",
    "CoordinatingAgencyName": "Golden Gate Fire Dept/Marco HAZMAT",
    "CoordinatingAgencyPhone": "9414551884",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 8796,
      "SummaryText": "active mitigation measures such as the emergency scrubber.\n\nA worst-case release is unlikely due to the materials of construction of the chlorine container.  In addition, a comprehensive risk management program has been developed to prevent accidental releases.\n\nAlternative Release Scenario\n\nThe alternative release scenario modeled is the worst-case scenario with the emergency scrubber in operation It is assumed that a one-ton container reputes and releases all of its contents within the Process/Chemical building.  When the release is detected, the emergency scrubber is activated. There is no off-site impact for the alternative release scenario.  This alternative release scenario is not likely to occur; however, it demonstates that off-site impacts do not occur even for the worst-case scenario when the active mitigation system is used.\n\nAccidental Release Prevention Program\n\nCollier County is in compliance with 40 CFR 68.  The County has conducted a comprehensive review of the chlorine system as well as administrative, technical, operating and maintenance procedures, in addition to the other required program elements of the regulations.\n\nThe County has both passive mitigation, an enclosed building, and active mitigation, an emergency scrubber, to minimize the consequences of an accidental release.  The Risk Management Program addresses actions to minimize the likelihood of an accidental release and to minimize the impact if one occurs.\n\nFive-Year Accident History\n\nThe SCRWTP has not had a significant release of a hazardous substance as defined by 40 CFR 68.\n\nEmergency Response Program\n\nThis facility has an emergency response program that is coordianted with the Collier County Comprehensive Emergency Response Plan (ERP) that has been prepared in accordance with all local, state and federal regulations.\n\nPlanned Changes to Improve Safety\n\nThe hazard review resulted in the development of a list of improvements and an implementation schedule.  This is included in the Ri"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8796,
      "SummaryText": "cy evacuation of employees during a chlorine release, the front gate should be \n  modified to allow it to be opened from the control room.\n\nTo Be Completed by May 2000\n\n  Expand the existing emergency evacuation plan for plant personnel.  The evacuation plan should include \n  two egress routes and a designated location for plant personnel to reassemble.\n\nTo Be Completed by October 2000\n\n  Purchase and install new pressure gauges for the solution line, after the injector.  Provide an isolation \n  valve on each gauge.\n\n  The PM program for the ventilation system should be evaluated.  Consider hiring a maintenance technician.\n\n  Implement a PM schedule for the emergency chlorine scrubber system.\n\n  There is potential risk of caustic gas releasing in an unsafe manner from the exhaust stack.  This is due \n  to an inadequate raincap.  The raincap should be modified or replaced.\n\nTo Be Completed by November 2000\n\n  An alarm should be provided for the pressure relief system. The alarm should initiate start of the scrubber \n  and notify plant personnel of the event.\n\nTo Be Completed by June 2002\n\n  The entrance doors should be lowered on both sides to ground level to restrict the lifting height of the \n  chlorine containers during off-loading and also provide better control of the containers while moving them \n  to the scale.\n\n  In case of a chlorine release to the chlorinator area, a line to the scrubber should be installed.\n\n  Replacement of the PVC pipes in the chlorine system should be scheduled.  Degradation of PVC occurs \n  over time and pipes should be replaced every five to seven years.\n\n  Enclose chlorine storage area and provide intake into scrubber."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8796,
      "SummaryText": "sk Management Plan (RMP).  Continued training and practices documented in the RMP will continue to improve safety at the facility.  Some of the more significant improvements are listed below:\n\nTo Be Completed by August 1999\n\n  Safeguards should be provided to prevent delivery trucks from colliding with the building.  A sign \n  indicating a 10 mph speed limit should be posted along the roadway.  Additionally, all    construction \n  contract documents should require the contractor to maintain the roadway in suitable condition for safe \n  use for chemical delivery.\n\n  The chlorine piping system should be modified to isolate the pressure gauge from the header to prevent a \n  potential leak at the header pressure gauge.\n\n  Request Standard Operating Procedures and certification that chlorine meets AWWA specifications from \n  the chlorine supplier.  Cherry Pickers cranes should be required for chlorine delivery by October 2000 \n  to minimize handling and rolling of the ton container.\n\n  Spare injectors and check valves should be purchased and kept on site for backup in case of a failure.\n  \n  The emergency evacuation plan should be revised to include a second egress route as well as a \n  reassembly area for personnel to meet. A site coordinator should be assigned on every shift.  Additional \n  revisions are to be addressed in May 2000.\n\n  Due to the chemical nature of chlorine, any work performed in the chlorine areas that involves heat or \n  sparks should be closely monitored.   Hot work permitting should be implemented.\n\n  A program for respirator maintenance and training that provides for purchase of spare parts and \n  cartridge replacement should be implemented.\n\n  The monorail used to move chlorine containers has a potential of sticking in place. The monorail should be \n  lubricated with  material that is compatible with chlorine use.\n\n  Chlorine containers must be rotated in the trunnions to properly align the valves prior to connection.  \n  Procurement of a speci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8796,
      "SummaryText": "alized f wrench for this use is recommended.\n\nTo Be Completed by September 1999\n\n  Emergency lights should be installed in the chlorine area in case of light and/or emergency generator \n  failure.\n\n  In case of vacuum regulator failure, both pressure headers should be manifolded together and a shut off  \n  valve installed.\n\nTo be Completed By October 1999\n\n  The alarm system in the chlorinator room is old and should be replaced.\n\n  Proper lock out equipment should be purchased and utilized.\n\n  Provide training for the operators on proper use of the emergency chlorine scrubber.\n\nTo Be Completed by November 1999\n\n  The pressure relief valve will currently release chlorine gas into the room.  The pressure relief valve \n  should be reconfigured so that released gas is directed to the chlorine scrubber.\n\n  Restrictions on activities and persons entering the chlorine storage area are necessary.  Signs should be \n  posted at the chlorine room entrance stating, No Smoking and Authorized Personnel Only.\n  \n  An annual preventive maintenance (PM) program for the entire chlorine system should be prepared and \n  implemented.  The PM program should include the following equipment: \n\n            Valves on the solution line\n            Injector check valve\n            Pressure gauges on water or chlorine solution line\n            Flexible tubing from chlorine container to header (should be replaced at least once annually)\n            PVC piping \n            Vacuum regulators\n            Chlorinator\n            Replace all gaskets and washers when servicing chlorinator\n            Ventilation system service\n\n  The valves and pipes on the chlorinator system should be clearly labeled to reduce potential operator \n  error.\n\nTo Be Completed by January 2000\n\n  Install cable securing system for all ton containers.  Securing the containers will provide additional \n  anchoring during a hurricane or other severe weather event.\n\nTo Be Completed by February 2000\n\n  To facilitate emergen"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 8796,
      "SummaryText": "It is the policy of Collier County to operate safe water treatment facilities, reducing to the greatest extent possible any hazards associated with our processes and reducing  any subsequent risk to the surrounding community, employees and the environment.  It is also our policy to work with the surrounding community and local emergency response agencies, and promote a spirit of cooperation and teamwork to provide an effective contingency plan in the unlikely event that a process incident occurs at one of our facilities.\n\nRegulated Substances\n\nThe primary activity at the South County Regional Water Treatment Plant (SCRWTP) is municipal water treatment.  Chlorine is the only 40 CFR 68 regulated substance at the facility.  Chlorine is used primarily as a disinfectant.  The maximum amount of chlorine at the facility is 20 tons.\n\nWorst-Case Release Scenario (WCS)\n\nThe Worst-Case release scenario according to EPA's Offsite Consequence Analysis Guidance document is the greatest amount held in a single vessel.  The worst-case scenario is the complete release of chlorine from a one-ton container.  The worst-case scenario may not consider the use of active mitigation such as emergency scrubbers.\n\nThe chlorine toxic endpoint defined by 40 CFR Part 68 is 0.0087 mg/l which is equivalent to 3 parts per million by volume (ppm).  According to the American Industrial Hygiene Association (AIHA) Emergency Response Planning Guideline (ERPG)-2, this toxic endpoint is specified as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\n\nThe SLAB computer model was used to simulate the worst-case scenario.  The maximum distance to toxic endpoint is 2.93 miles.  This distance considered the mitigation provided by the building but did not include the use of"
    }
  ]
}