{
  "FacilityID": 8850,
  "FacilityName": "Montgomery County Water Treatment Plant",
  "FacilityStr1": "724 Hydro Road",
  "FacilityStr2": null,
  "FacilityCity": "Mt. Gilead",
  "FacilityState": "NC",
  "FacilityZipCode": "27306",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37123",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "35.220278",
  "FacilityLongDecDegs": "-80.045",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "P1",
  "LatLongDescription": "CE",
  "FacilityURL": "aaet.com",
  "FacilityEmailAddress": "aaet@ac.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "Montgomery County, North Carolina",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "AmericanAnglian Environmental Techn",
  "OperatorStr1": "724 Hydro Road",
  "OperatorStr2": null,
  "OperatorCity": "Mt. Gilead",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27306",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000110168",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.21961,
  "FRS_Long": -80.04457,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10759,
      "AltID": "Chlorination",
      "FacilityID": 8850,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11976,
          "ProcessID": 10759,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11014,
          "ProcessID": 10759,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5014,
              "Process_NAICS_ID": 11014,
              "SafetyReviewDate": "1998-09-14 00:00:00",
              "PHA_Date": "1998-03-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Bacl flow preventer",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Upgrade Operations & Maintenance Procedures",
              "OpProceduresReviewDate": "1998-12-11 00:00:00",
              "TrainingReviewDate": "1998-09-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-12-02 00:00:00",
              "EquipmentInspectionDate": "1999-05-02 00:00:00",
              "EquipmentTested": "Cl2 Monitor & Hoist System",
              "ChangeMgmtDate": "1998-12-11 00:00:00",
              "ChangeMgmtReviewDate": "1998-12-11 00:00:00",
              "PreStartupReviewDate": "1999-05-12 00:00:00",
              "ComplianceAuditDate": "1999-05-12 00:00:00",
              "AuditCompletionDate": "1999-08-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-09-14 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-28 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-31 00:00:00",
              "ContractorSafetyEvalDate": "1998-09-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5829,
                  "PreventionProgram3ID": 5014,
                  "ProcessChemicalID": 11976
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8850,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-01-28 00:00:00",
    "ERTrainingDate": "1999-02-25 00:00:00",
    "CoordinatingAgencyName": "Mt. Gilead Fire of Montgomery Count",
    "CoordinatingAgencyPhone": "9104396322",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 8850,
      "SummaryText": "up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual\u0012s ability to take protective action.  The residential population within a circle with a radius corresponding to the toxic endpoint distance was defined, to estimate the population potentially affected.\n1.3.1. WORST CASE   (c)(1)\n Atmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions.  Results demonstrate a distance of 1.30 miles to the toxic endpoint.  The residential population that could potentially be affected by the release is estimated at 122 people.\n 1.3.2. ALTERNATIVE CASE   (c)(2)\n The alternative release scenario involves the failure of the yoke assembly regulator of the pressure system connected to one of the one ton-containers. This failure is equal to creating a 1/16 inch diameter hole in either the yoke assembly, the drip tube, a pipe, or even the container.  Modeling using the EPA waste water guidance demonstrated the rate of chlorine release is 20.0 lb./min.  The toxic endpoint distances determined is 0.20 miles.  The number of public receptor that would be impacted by this release is zero.\n1.4. ACCIDENTAL RELEASE PREVENTION PROGRAM  (d)\nThe AmericanAnglian accidental release prevention program is based on OSHA\u0012s PSM program and EPA\u0012s RMP Level 3 prevention program.  The PSM program has been in place and effectively used for several years.  It is part of the plants operating culture.  There are two parts to the program.  The first is the general overall site program.  The second is the chlorine-specific actions within the site program.  This is coordinated with the Mt. Gilead North Carolina fire department.\n1.4.1. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM   (d)(1)\n Facility-wide, many elements of the prevention program are used for all operations. The overviews of these generally written programs are listed below:\n7 AmericanAnglian has detailed process safety i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8850,
      "SummaryText": "nformation on each of its operations. \n7 The DMS document control system is integral to the management of change for all operations on site.  \n7 Training is the backbone of employee knowledge, job operations and is ongoing in each area.  Employee training in operations and maintenance emphasizes awareness of the hazardous and toxic properties of all chemicals used. \n7 Maintenance and preventive maintenance are used for all operations making mechanical integrity a part of each piece of equipment. \n7 Incident investigations of accidents and near-miss incidents ensure we learn from each event as well as correct the causes of the incident. \n7 Employees participate in all aspects of the plant as listed below under emergency response. \n 7 Safe work practices are used throughout the facility including:  1) Hot Work Permits, 2) Lock Out Tag Out Permits, 3) Vessel Entry Permits, 4) Site Security, and 5) Breaking Into Chemical lines. \n7 Contractors must meet AmericanAnglian\u0012s high safety and technical standards as part of selection and ongoing evaluations.  Plus, AmericanAnglian demands training of contractors to our standards. \n1.4.2. CHLORINE-SPECIFIC RESPONSE PROGRAM  (d)(2)\n1.4.2.1. Chlorine-Specific Policies and Procedures\nChemical-specific prevention features of the facility include: the policies and procedures listed above and those of the chlorine specific program.  These include:\n7 Specific procedures for the operation of the chlorine building. \n7 Completion of a Pre-startup Safety Review prior to start up of the modified chlorine system. \n7 Specific emergency response procedures for chlorine releases as outlined below under emergency response. \n7 Specific training in the properties, hazards, handling requirements, and leak repair for chlorine. \n7 Finally, the details of both facility and equipment design are key to the safe operations of the chlorine system. \n1.4.2.2. Facility Design\nThe facility and support equipment of the chlorine storage and control building mee"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8850,
      "SummaryText": "t and exceed design codes standards and good engineering practices.  The building is equipped with temperature control and vent make-up.  In the event of a chlorine leak the vent system automatically comes on.  All the vent air and any fumes are first diluted and then removed from the room by a vent system.\n1.4.2.3. Equipment Design\nThe chlorine piping system is made of chlorine compatible steel for high pressure systems or tubes.  These materials are all PVP pipe and like  both chlorine compatible (not corroded by chlorine) and rated to 500 psig for the high pressure system and 150 psig for the low pressure system. The maximum pressure of the chlorine in the high pressure system is only 150 psig giving a 3 to 1 safety factor.  There is a chlorine monitor which detects the presence of chlorine in the storage building rooms.  The alarms and lights in the plant alert employees of a potential chlorine leak.  Plus, the alarm automatically turns on the vent fan for each room the room lights.\n1.5. FIVE-YEAR ACCIDENT HISTORY  (e)\nAmericanAnglian has had no accidental releases of chlorine in the past five years per EPA 40 CFR 67.42 (a).\n1.6. EMERGENCY RESPONSE PROGRAM  (f)\nEmergency response procedures are contained in the AmericanAnglian Contingency Plan (Emergency Response Plan).  The plan includes an emergency response decision tree and a notification plan.  Emergency response drills and drill evaluations are conducted annually by the operating department.  Emergency operation and response procedures are also reviewed at that time.\nThe emergency response program (contingency plan) is coordinated (reviewed by) with the Mt. Gilead Fire Department, which coordinates with Local Montgomery County Emergency Response Planning Committee (LEPC) and HazMat Team #3, Fayetteville, North Carolina.  Copies of the program are given to key local agencies including:  fire, medical, rescue, waste management, and police departments in Montgomery County. Besides the specific emergency res"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8850,
      "SummaryText": "on system contained in a specially designed process building. The boundaries of the chlorine system subject to the RMP regulation include the Bulk Chlorine Storage and Control rooms and the associated vent make up and exhaust systems.\n1.2.2. REGULATED SUBSTANCE  (b)(2)\n Chlorine is the only regulated substance on site which exceeds the EPA 40 CFR-68 rule threshold quantity.  The AmericanAnglian chlorine process was installed as part of the process of purifying water for public consumption.  The chlorine is received, stored and distributed to two process control systems. \n Chlorine is an EPA-and OSHA-listed toxic chemical.  It is an irritant and it is corrosive.  Chlorine is a halogen with the formula Cl2.  It is a chlorinating or oxidizing agent that is not flammable.  It has a 1 ppm OSHA ceiling Permissible Exposure Limit (PEL) and a NFPA health rating of 4, severe; with immediate and delayed health hazards.  Chlorine is not a carcinogen.\n1.3. WORST AND ALTERNATIVE CASE RELEASE SCENARIOS  (c)\nTwo offsite consequence analyses were conducted which include two chlorine release scenarios.  The first is a worst case release.  The second is a more probable alternative release scenario.  The first scenario is defined by EPA, which states that the < shall assume that the < maximum quantity in the largest vessel < is released as a gas over 10 minutes  due to an unspecified failure.  The alternative scenario is defined as more likely to occur than the worst-case scenario.\nAtmospheric dispersion modeling was performed to determine the distance traveled by the chlorine released before its concentration decreases to the toxic endpoint.  The EPA  selected endpoint for chlorine is 0.0087 mg/l equals 3 ppm. The  3 ppm endpoint is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 8850,
      "SummaryText": "1. EXECUTIVE SUMMARY  68.155\nAmericanAnglian operates the Montgomery County Water Treatment Plant under contractual agreements with Montgomery Country, North Carolina, the owner.\n1.1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES     (a)\nThe AmericanAnglian Montgomery County, North Carolina Plant accidental release prevention policy involves a unified approach that integrates technologies, procedures and management practices.  Our prevention program complies with all applicable procedures of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) 40 CFR-68,  Prevention Program.\n1.1.1. MANAGEMENT SYSTEM  (A)(1)\n AmericanAnglian has a management system in place which oversees the implementation and on-going use of the RMP elements.  This program, along with other AmericanAnglian policies, eliminates and /or reduces the likelihood of a hazardous chemical release at the plant.\n1.1.2. PREVENTION PROGRAM LEVEL 3  (A)(2)\n AmericanAnglian maintains policies, procedures and systems as part of their prevention program.  The program addresses each of  the EPA Program Level 3-listed 12 elements, plus  RMP elements needed to implement the program, and the like elements in place in the plants\u0012 OSHA PSM program. These are maintained in AmericanAnglian\u0012s Process Information Document Management System (DMS) document control system.\n1.2. AMERICANANGLIAN STATIONARY SOURCE AND REGULATED SUBSTANCE HANDLED AT THE MONTGOMERY COUNTY, NC SITE  (b)\nThe AmericanAnglian Plant employs 10 full-time employees engaged in water treatment plant and field operations.  Chlorine is used as part of the potable water treatment process.\n1.2.1. SITE DESCRIPTION  (B)(1)\n The site is owned by Montgomery County and operated by AmericanAnglian.  The site is located at 724 Hyrdo Road,  Mt. Gilead, Montgomery County, North Carolina.  The 15 acre site is boarded by Lilly Bridge Road on the east, and Hydro Road on the south.\n The Plant includes a chlorine storage and distributi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 8850,
      "SummaryText": "ponse program, key elements of the prevention programs are incorporated in the operating culture of the AmericanAnglian plant.\nThe Contingency Plan procedures detail the actions and responses to chlorine spills (releases).  The plan includes training of all chlorine-area operators,  The primary response team include the Mt. Gilead fire and rescue, plus the Fayetteville Haz Mat Team.  All of these responds to severe chlorine leak situations.  Actions include catastrophic, severe, and moderate leaks.  A Chlorine B Kit is maintained on site to aide in stopping leaks.  Public notification is facilitated through the County Sheriff Department.\n1.6.1. PERSONNEL  (f)(1)\n Personnel are the key resource of AmericanAnglian\u0012s prevention program. Our employees make up the operators and emergency response teams.  AmericanAnglian fosters a high level of involvement in every aspect of the chlorine system operations including participation in :\n7 Chlorine PSM/RMP safety teams, \n7 Development of the operation procedures, \n7 Hazard evaluations, and \n7 On-going training of the operators and other involved staff.\n1.7. CHANGES TO IMPROVE SAFETY  (g)\nChanges to improve safety (recommended actions) were identified in the site of September 1997  internal audit of the PSM program to meet requirements of the Risk Management Prevention Program.  These recommended actions have now been evaluated and implemented as required.  An Audit was conducted May 13th 1999 to review the PSM program.  The key safety action items were completed by May 30th.  Other recommendations are to be completed by September 1999.  See the Update Section 6 of this report.\nAmericanAnglian continually reviews implemented and potential safety improvements for all of its operations.  Currently, the AmericanAnglian management team and chlorine safety team are reviewing potential upgrades to the existing design of the chlorine operations to make the system even safer in the event of a release of chlorine."
    }
  ]
}