{
  "FacilityID": 8853,
  "FacilityName": "Phoenix (Tolleson) Logistics Center",
  "FacilityStr1": "9704 West Roosevelt Street",
  "FacilityStr2": null,
  "FacilityCity": "Tolleson",
  "FacilityState": "AZ",
  "FacilityZipCode": "85353",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.458167",
  "FacilityLongDecDegs": "112.270528",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.reckitt.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Reckitt & Colman, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 94405024,
  "Company2DUNS": null,
  "OperatorName": "Reckitt & Colman, Inc.",
  "OperatorStr1": "9704 West Roosevelt Street",
  "OperatorStr2": null,
  "OperatorCity": "Tolleson",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85353",
  "OperatorZipCodeExt": null,
  "FTE": 46,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000110408",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-11-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": "Arizona Warehouse",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-12-22 00:00:00",
  "DeRegistrationEffectiveDate": "2004-07-20 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.458,
  "FRS_Long": -112.26891,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10764,
      "AltID": "Warehouse",
      "FacilityID": 8853,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 11981,
          "ProcessID": 10764,
          "ChemicalID": 118,
          "Quantity": 21138.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 11982,
          "ProcessID": 10764,
          "ChemicalID": 107,
          "Quantity": 238579.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 11983,
          "ProcessID": 10764,
          "ChemicalID": 98,
          "Quantity": 43668.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11019,
          "ProcessID": 10764,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8853,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-25 00:00:00",
    "ERTrainingDate": "1999-03-02 00:00:00",
    "CoordinatingAgencyName": "Tolleson Fire Department",
    "CoordinatingAgencyPhone": "6239368500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8853,
      "SummaryText": "Reckitt & Colman Inc. manufactures, markets and sells leading household cleaning and food products in North America. The Western Regional Logistics Center of Reckitt & Colman Inc. is located at 9704 West Roosevelt Street, Tolleson, AZ. This facility is an approximately 300,000 square foot structure utilized for the warehousing, distribution and custom packaging of retail, and professional brand household cleaning products.  Reckitt & Colman has occupied the facility since January, 1994 and employs approximately 46 full time employees at the site. The operations onsite have a service area of the Western states.\n\nThe warehouse facility is subject to requirements of the Chemical Accident Prevention Provisions in 40 CFR Part 68.  These regulations, also known as the Risk Management Program Rule (RMP Rule), were promulgated pursuant to Section 112(r)(7) of the US Environmental Protection Agency's (EPA) Clean Air Act Amendments. Warehouse facilities must comply with the RMP Rule if they handle, manufacture, or use certain toxic or flammable substances in a quantity greater than specified threshold quantities in a process.  A list of regulated toxic and flammable substances and their individual threshold quantities is located in Section 68.130 of the RMP Rule.  All regulated facilities are required to submit risk management program information summarizing their Risk Management Programs by June 21, 1999.\n\nSome aerosol products stored by Reckitt  & Colman contain blends of liquefied petroleum gas (LPG).  Liquefied petroleum gas is a flammable substance and is regulated under the RMP Rule if handled, manufactured or stored in a process at a facility in a quantity greater than its listed threshold quantity.  The specified threshold quantity for flammable substances under the RMP Rule is 10,000 pounds. The warehouse facility constitutes a single process.  The facility does warehouse greater than 10,000 pounds of butane, isobutane and propane in aerosol products. \n\nThe Worst Cas"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8853,
      "SummaryText": "e Release section utilized in this Risk Management Plan (RMP) was defined by the Environmental Protection Agency (EPA). The endpoint distance is defined in the RMP Rule as the distance from the point of detonation to a point of an overpressure of 1 pound per square inch (psi).  One psi is the amount of pressure generally required to break a typical glass window. The worst case scenario was further clarified in correspondence from Mr. Jim Makris, EPA Director Chemical Emergency Preparedness and Prevention Office to Mr. John E. DiFazio, Jr., Senior Counsel for the Chemical Specialties Manufacturers Association (CSMA). According to Mr. Makris, the worst case scenario would be characterized as the release of the largest quantity of a regulated substance from a single vessel or process line failure. \n\nBased upon this definition of Worst Case Release, the worst case scenario was calculated utilizing the single aerosol container onsite with the largest concentration of regulated substances, an individual retail sized 8 ounce aerosol container.  In addition, where there was a range in the percent of concentration of a regulated substance in the aerosol container, the upper percentage was utilized.  \n\nTherefore, the worst case scenario in this RMP is based upon one (1) 8 oz. aerosol container containing 20 to 30 percent isobutane and 1 to 10 percent propane.  The quantity released in a vapor cloud explosion (i.e., 0.15 pounds of isobutane and 0.05 pounds of propane) would not affect any public receptors or have any off site consequences.  In accordance with the RMP*Submit default requirements, a 1 pound release with an endpoint of 0.01 miles was reported in this submittal.\n\nThe facility emergency response plan provides guidance to include local emergency responders such as police, fire, and rescue as appropriate.\n\nFacilities subject to the RMP Rule are also required to report accidents and releases occurring in the last five years in which exposure to a regulated flammable s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8853,
      "SummaryText": "ubstance, overpressure generated by an explosion of the substance, or radiant heat generated by a fire involving the substance led to death, injury, or response or restoration activities at an environmental receptor on-site or off-site.  Reckitt & Colman certifies in the RMP submission to the EPA that during the past five years, no accidental releases have occurred involving regulated flammable substances from the warehousing of aerosol products.\n\nThe Reckitt & Colman Midwestern Logistic Center meets the National Fire Protection Association Code on the Manufacture and Storage of Aerosol Products (NFPA 30B). This facility has been designed with a state of the art early suppression fast response (ESFR) sprinkler system to minimize any fire incident.\n\nBased upon the above information, the Western Regional Logistics Center has been characterized as a Program 1, single process facility."
    }
  ]
}