{
  "FacilityID": 8879,
  "FacilityName": "DyStar L.P. - Coventry",
  "FacilityStr1": "502 Washington Street",
  "FacilityStr2": null,
  "FacilityCity": "Coventry",
  "FacilityState": "RI",
  "FacilityZipCode": "02816",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "44003",
  "LEPC": null,
  "FacilityLatDecDegs": "71.538889",
  "FacilityLongDecDegs": "-41.688889",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "DyStar L.P.",
  "Company2Name": null,
  "CompanyDUNS": 828676625,
  "Company2DUNS": 0,
  "OperatorName": "DyStar L.P.",
  "OperatorStr1": "502 Washington Street",
  "OperatorStr2": null,
  "OperatorCity": "Coventry",
  "OperatorStateFIPS": "RI",
  "OperatorZipCode": "02816",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michelle Park",
  "RMPTitle": "ESHA Coordinator",
  "FTE": 57,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000108929",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-12-16 00:00:00",
  "SafetyInspectionBy": "State EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMPlanner",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2002-09-26 00:00:00",
  "DeRegistrationEffectiveDate": "2002-08-23 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.6954,
  "FRS_Long": -71.53965,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10796,
      "AltID": "Chlorine, storage, delive",
      "FacilityID": 8879,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 11052,
          "ProcessID": 10796,
          "NAICSCode": "325132",
          "_desc": {
            "NAICS_CODE": "325132",
            "NAICS_DESCRIPTION": "Synthetic Organic Dye and Pigment Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 12020,
          "ProcessID": 10796,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 512020,
          "ProcessID": 10796,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8879,
      "SummaryText": "\n\nDYSTAR L.P. - COVENTRY SITE\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt DyStar L.P., we are committed to safety, employee health and protection of the environment.  We are dedicated to operating our and maintaining all of our processes in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n *  A description of our facility and use of substances regulated by EPA's RMP regulation\n *  A summary of results from our assessment of the potential off-site consequences from accidental chemical releases\n *  An overview of our accidental release prevention programs\n *  A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n *  An overview of our emergency response program\n *  An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe DyStar L.P. Coventry Site employs approximately 57 people. The Coventry Site produces water based organic dyes using a variety of chemicals and processing operations.  Dyes manufactured at Coventry create the colors that go into clothing, home furnishings, domestic wares, household fabrics and upholstery.  In our processes, we use the following chemicals that Environmental Protection Agency has identified as having the potential to cause significant off-site consequences in the event of a substantial accidental release:\n\nToxic Chemical    Maximum Inventory        Use\n\nChlorine        12,000 lbs            waste water decolorization\n\nOur accidental release prevention programs and our contingency planning efforts help us"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8879,
      "SummaryText": " effectively manage the hazards that are posed to our employees, the public, and the environment by our use of these chemicals.\n\nKEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\nEnvironmental Protection Agency Risk Management rule requires that we provide information about the worst-case release scenario and alternative release scenario for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\nWorst-case Release Scenario - Regulated Toxic Chemicals\n\nChlorine - Rupture of one ton storage cylinder.  Amount released is the total content of the cylinder.  No active mitigation is considered.  The release would have off-site consequences.  \nAlternative Release Scenario - Regulated Toxic Chemicals\n\nChlorine - Hole or puncture in the flex line attached to the one ton storage cylinder.  No active mitigation is considered.  The release would have off-site consequences.     \n\nWe are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Coventry Site is in compliance with all EPA and OSHA accident prevention requirements of 40 CFR Part 68 and 29 CFR 1910.  We take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address each of the key features of successful prevention programs including:\n\n *  Process safety information\n *  Process hazard analysis\n *  Operating procedures\n *  Training\n *  Mechanical integrity\n *  Management of change\n *  Pre-startup review\n *  Compliance audits\n *  Incident investigation\n *  Employee participation\n *  Hot work permit\n *  Contractors\n\nAs part of our prevention efforts, we have implemented the following chemical-specific prevention steps:\n\nAutomat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8879,
      "SummaryText": "ic emergency shutoffs are located remote to the chlorine cylinders.\n\nSensors are strategically located in the storage and delivery area to detect small leaks of chlorine.  The sensors are connected to audible and visual alarms that alert site personnel so that small leaks can be repaired before a release with off-site consequences occurs.\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  The Coventry Site has not had a release involving materials covered under EPA's RMP rule that resulted in on-site injury or off-site impact during the past five years.\n\nWe have a comprehensive incident investigation program.  For all incidents and near miss incidents, we conduct a formal incident investigations to identify and correct the root causes of the events.  The employee success sharing annual bonus is currently based in part on the identification and correction of root causes of incidents. \n\nEMERGENCY RESPONSE PROGRAM\n\nThe Coventry Site maintains an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  We coordinate our plan with the community emergency response plan.  Additionally, the Coventry Site hosts an annual community drill with local community responders.\n\nWe have a 24-hour Emergency Response Team (ERT) comprised of nearly 40 members trained in emergency response, incipient stage fire fighting and hazardous materials requirements.  Several of the site ERT members are certified Emergency Medical Technicians.  Training re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8879,
      "SummaryText": "quirements are rigorous and all members must pass a physical exam.  The site has an extensive fire fighting system with monitor nozzles, hoses, foam generating capability and sprinkler systems.  We also maintain an emergency response vehicle equipped with air monitoring equipment, radio and cellular phone systems, and emergency response and decontamination materials.  Additionally, the site has a chlorine repair kit and training cylinder that is used to train ERT members on chlorine release mitigation. \n\nThe Coventry Site has an established partnership with the Local Emergency Planning Committee and the local fire departments.  We also have an automated telephone Coummunity Alert Network and neighbor hotline to notify neighbors of a site emergency and actions to be taken.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAt DyStar L.P., we are committed to continuous improvement of Environment, Safety, and Health performance.  Through our Process Safety Management program, we review hazards associated with our processes and implement actions to reduce the hazards according to risk assessment/risk management principles.\n\n"
    }
  ]
}