{
  "FacilityID": 8924,
  "FacilityName": "Creamland Dairies, Inc.",
  "FacilityStr1": "500 Broadway SE",
  "FacilityStr2": null,
  "FacilityCity": "Albuquerque",
  "FacilityState": "NM",
  "FacilityZipCode": "87102",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35001",
  "LEPC": "Albuquerque/Bernalillo County",
  "FacilityLatDecDegs": "35.417222",
  "FacilityLongDecDegs": "106.669444",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6175296,
  "ParentCompanyName": "Dean Foods",
  "Company2Name": null,
  "CompanyDUNS": 5104815,
  "Company2DUNS": 0,
  "OperatorName": "Creamland Dairies, Inc.",
  "OperatorStr1": "500 Broadway SE",
  "OperatorStr2": null,
  "OperatorCity": "Albuquerque",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "87102",
  "OperatorZipCodeExt": null,
  "RMPContact": "Linda Ybarra",
  "RMPTitle": "Plant Manager",
  "FTE": 37,
  "OtherEPAFacilityID": "87102CRMLN500BR",
  "EPAFacilityID": "100000111005",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-03-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2005-11-28 00:00:00",
  "DeRegistrationEffectiveDate": "2005-11-11 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.07954,
  "FRS_Long": -106.64528,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10861,
      "AltID": "Anhydrous ammonia",
      "FacilityID": 8924,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 11119,
          "ProcessID": 10861,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 12093,
          "ProcessID": 10861,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 512093,
          "ProcessID": 10861,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8924,
      "SummaryText": "\nJune 15, 1999\n\n\nRMP Reporting Center\nP.O. Box 3346\nMerrifield, VA  22116-3346\nTo Whom It May Concern:\nRE:    U.S. EPA's \"Risk Management Program\" Rule\n    Creamland Dairies, Inc.\n    Anhydrous Ammonia-Refrigeration Process\n    Certification Letter\nEnclosed is a copy of the Risk Management Plan prepared electronically on disk. This has been prepared using EPA's RMP*SUBMIT.\nTo the best of the undersigned's knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\nSignature\nTitle\nPrinted Name\nDate\nIf you have any questions, please call at your convenience.\nSincerely,\nCreamland Dairies, Inc.\nLinda Ybarra\nPlant Manager\nEnclosure\n\ncc:         Albuquerque/Bernalillo County L.E.P.C.\n             Albuquerque Fire Department\n         File\n\nCertification Letter\n\n \nEXECUTIVE SUMMARY\nDescription of Facility and Regulated Substance Handled:\nCreamland Dairies, Inc., 500 Broadway SE, Albuquerque, New Mexico, 87102 processes ice cream products. The facility utilizes anhydrous ammonia as a refrigerant to maintain the proper temperature of ice cream products within the facility. Anhydrous ammonia is an effective refrigerant that has been used for many years by most food processing facilities. Ammonia is normally a gas at ambient temperatures but is handled as a gas liquefied under pressure. The refrigeration system consists of a receiver vessel, evaporators, compressors, piping, and valves.\nAccidental Release Prevention and Emergency Response Policies: Creamland Dairies, Inc. is committed to promoting safety for the plant, its employees and the surrounding area. The facility is complying with OSHA's Process Safety Management Standard (PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (RMP), Title 40 CFR Part 68. The purpose of these programs is to ensure that the refrigeration system is operated safely in order to prevent releases of ammonia from the system. In addition, these pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8924,
      "SummaryText": "ograms serve to develop procedures to minimize releases in the event that they do occur and to outline appropriate emergency response steps to take in the event of a release.\nWorst Case Release Scenario: EPA's \"Risk Management Program Guidance for Ammonia Refrigeration\" (November 1998) and the International Institute of Ammonia Refrigeration's (IIAR) Risk Management Guidelines (1998) were the primary documents used to develop the worst case release scenario. The worst case release is one that is unlikely to occur. The purpose of the worst case release analysis is to support a dialogue with the community on release prevention. It is a conservative analysis and is not to serve as a rational basis for actual emergency response planning.\nThe worst case release scenario (as defined by EPA) is the release of the largest quantity of ammonia from a vessel or process line failure that results in the greatest distance to a toxic endpoint. The worst case release scenario for the refrigeration process is assumed to be a case where the total quantity of ammonia in the largest vessel is released. The release scenario was performed assuming that the vessel was filled to 100% capacity (the greatest amount that would ever be placed in the vessel). The vessel, however, is normally filled to 60% capacity as normal operating capacity. There were no passive mitigation systems (dikes, berms, drains, sumps or enclosures) considered in the analysis since the largest vessel is located outdoors.\n\nI\n\n In addition, Dean Foods has installed a sophisticated system of ammonia sensors that can remotely close certain isolation valves in the event of a small release and thereby limit an accidental release of ammonia. These sensors are capable of detecting releases of ammonia at low levels, and are connected to a computer that will shut certain valves to the system if ammonia is detected. In this way, potential releases of ammonia are minimized.\n\nA possible release scenario is one in which a relief v"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8924,
      "SummaryText": "alve actuated due to overpressurization indoors on an Amario vault vessel.  Passive mitigation might be realized due to the unit being indoors.  Sensors on the Allen/Bradley system would set off active alarm systems and alerting mechanisms. \n\nThe toxic endpoint used for this scenario must be where the ambient concentration of ammonia is 0.14 mg/L or less. Based on ALOHA and MARPLOT modeling as guidance, the alternative release scenario would result in a situation where public receptors would be within the distance to the toxic endpoint.\n\nThe toxic endpoint used for this scenario must be where the ambient concentration of ammonia is 0.14 mg/L or less. This endpoint is a concentration below which nearly all individuals could be exposed to for one hour without serious health effects. Based on Exhibit 4-4 using ALOHA and MARPLOT modeling as guidance, a release from the largest vessel would result in a situation where public receptors would be within the distance to the toxic endpoint.\nAlternative Case Release Scenario: The alternative case release scenario selected is one in which a relief valve actuated indoors on a vault vessel, due to overpressurization. EPA's \"Risk Management Program Guidance for Ammonia Refrigeration\" (November 1998) and the International Institute of Ammonia Refrigeration's (IIAR) Risk Management Guidelines (1998) were the primary documents used to develop the alternative release scenario. The alternative release scenario is one that is more likely to occur than the worst case release scenario.\nThe alternative release scenario must meet two criteria:\n1)     Must be more likely to occur than the worst case scenario, and\n2)     Must reach an endpoint off site, unless no such criteria exist.\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps: As a part of its PSM Program, Creamland Dairies, Inc. has established numerous programs that serve to prevent accidental releases of ammonia. These programs include:\n\n\n7 \n\n2\n7 Process Safety "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8924,
      "SummaryText": "Information\n7 Process Hazard Analysis\n7 Operating Procedures\n7 Training\n7 Mechanical Integrity\n7 Management of Change\n7 Pre-Startup Review\n\n\n\n\n 7 Compliance Audits\n7 Incident Investigations\n7 Employee Participation\n7 Hot Work Permits\n7 Contractor Safety\nEmergency Response Information: As a part of the PSM Program, the facility maintains an Emergency Response Plan that was prepared in order to improve responsiveness to an emergency incident, and to increase the reliability of actions taken during an incident. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies as well as the public.\n\n\n\n\n                                                                                                                   \nIn the event of an emergency involving the ammonia system, it is the policy of the facility to request assistance as necessary by calling 911 which will notify the Albuquerque/Bernalillo County LEPC, and the Albuquerque Police and Fire Departments. In addition, the Albuquerque/Benalillo County LEPC has included Creamland Dairies, Inc. in its local emergency and community planning efforts.\nFive-Year Accident History: Creamland Dairies, Inc. has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, there has been no accidental release during this period.\nSteps to Improve Safety: Several developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. Emergency Response Plans, ammonia detection systems. local protective alarm systems and continued OSHA training and audits are some of the major steps taken to improve safety at our facility. \n\nIn addition, the facility will continue to operate and maintain the system in accordance with IIAR Guidance and will continue to implement its OSHA PSM Program in conjunction with"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8924,
      "SummaryText": " the Risk Management Program.\n\n DEANS EXECUTIVE SUMMARY\n"
    }
  ]
}