{
  "FacilityID": 8945,
  "FacilityName": "Hercules Incorporated Franklin Virginia",
  "FacilityStr1": "27123 Shady Brook Trail",
  "FacilityStr2": null,
  "FacilityCity": "Courtland",
  "FacilityState": "VA",
  "FacilityZipCode": "23837",
  "Facility4DigitZipExt": "2034",
  "FacilityCountyFIPS": "51175",
  "LEPC": "Southampton LEPC",
  "FacilityLatDecDegs": "36.666667",
  "FacilityLongDecDegs": "-77",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1315647,
  "ParentCompanyName": "Hercules Incorporated Wilmington Delaware",
  "Company2Name": "NA",
  "CompanyDUNS": 1315647,
  "Company2DUNS": 0,
  "OperatorName": "Hercules Incorporated",
  "OperatorStr1": "27123 Shady Brook Trail",
  "OperatorStr2": null,
  "OperatorCity": "Courtland",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23837",
  "OperatorZipCodeExt": "2034",
  "RMPContact": "James J Reyher",
  "RMPTitle": "Plant Manager",
  "FTE": 120,
  "OtherEPAFacilityID": "23851HRCLSROUTE",
  "EPAFacilityID": "100000113281",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "NA at this time",
  "SafetyInspectionDate": "1990-07-26 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.65972,
  "FRS_Long": -76.99833,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10887,
      "AltID": "Process 1",
      "FacilityID": 8945,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 11146,
          "ProcessID": 10887,
          "NAICSCode": "325191",
          "_desc": {
            "NAICS_CODE": "325191",
            "NAICS_DESCRIPTION": "Gum and Wood Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 12124,
          "ProcessID": 10887,
          "ChemicalID": 1,
          "Quantity": 76700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 512124,
          "ProcessID": 10887,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 10888,
      "AltID": "Process 2",
      "FacilityID": 8945,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 11147,
          "ProcessID": 10888,
          "NAICSCode": "325992",
          "_desc": {
            "NAICS_CODE": "325992",
            "NAICS_DESCRIPTION": "Photographic Film, Paper, Plate, and Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 12125,
          "ProcessID": 10888,
          "ChemicalID": 59,
          "Quantity": 210000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 59,
            "ChemicalName": "Phosphorus trichloride  [Phosphorous trichloride]",
            "CASNumber": "7719-12-2",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 512125,
          "ProcessID": 10888,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8945,
      "SummaryText": "\n\nHercules Incorporated - Franklin Virginia\nRisk Management Plan \nExecutive Summary\n\n    The Hercules Franklin Facility is located approximately three miles southwest of the City of Franklin in Southampton County. The Facility encompasses 120 acres of which approximately 30 acres are developed. The area surrounding the facility is classified as rural topography. The facility consists of four major process areas and two support operations . These generally operate on a 24- hour day, 365 days per year.  The facility stores two regulated substances in quantities above the Risk Management Plan (RMP) threshold. Both these materials are RMP Toxic substances. These chemicals are: Formaldehyde and Phosphorous Trichloride. There are no RMP Flammable substances onsite. \n\n    The Facility believes it is important to note that there have been no reportable accidents in either of these two processes during the last five years.\n\n    The Facility's worse case scenario involves the Formaldehyde Process.  This process receives formaldehyde in 45,000-pound tank trucks in a 50% solution. The truck is pumped into a 16,000-gallon storage tank where the solution is diluted to 37% concentration. This tank is located within a containment dike with an overall surface area of 2750 cubic feet. The tank is maintained at 122F; from the tank the 37% solution is pumped to reactors where it is consumed. The process boundaries include the tank truck unloading, formaldehyde piping, storage tank, transfer pumps and the reactors. The worse case scenario for this material is as follows: an instantaneous release of the maximum inventory of the storage tank into the containment dike at 122F and 50% concentration, before the delivery is diluted forming a pool of formaldehyde solution. For RMP worse case scenario this was treated as a Liquid Spill and Vaporization. In this scenario the Formaldehyde evaporates and forms a buoyant cloud with a toxic endpoint of .012 mg/l. The quantity released would be 76,700 pounds."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8945,
      "SummaryText": " The distance to the endpoint would be 0.64 miles. The estimated residential population in this area is 75.  Public Receptors within this area are: residences, nearby industry, a boat landing, and a church. The passive mitigation that is used to control the amount of the release is the tank dike.\n\nThe alternate release scenario for Formaldehyde involves a break in a 2-inch line from the truck of Formaldehyde to the storage tank. This material would flow into the truck containment dike. A liquid pool forms. The Formaldehyde evaporates from the pool an forms a buoyant gas cloud with a toxic endpoint of 0.012 mg/l. The spill is assumed to be  stopped in 10 minutes. This is a conservative estimate as both the driver and a Hercules operator man this unloading and as per procedure would immediately stop the pump. The quantity released by this scenario would be 11,700 pounds.  The distance to the endpoint in this scenario is 0.12 miles. There are two residences within this distance with an estimated population of 6. The only other public receptor is a church. The facility has recently begun work on completing the final recommendations of the most recent HAZOP for this process. This work is scheduled for completion by the end of the year.\n\n    The facility receives Phosphorous Trichloride (PCl3) in tank trucks. It is unloaded from the trucks into either a 12,000-gallon tank or one of two 6,000 gallon tanks. The tanks are located in an enclosed building. This is designed to contain all the material from a catastrophic tank failure. From the storage tanks, PCl3 is pumped to the reactors. The process boundaries includes truck unloading, PCl3 \nExecutive Summary\nRMP\nPg.2\n\npiping, storage tanks and reactors. The alternative case scenario for PCl3 is considered to be a line leak during transfer of PCl3 from the storage tank to the reactor. The transfer pump is automatically shutdown on a set time.  The amount estimated to be released is 1440 pounds.  The toxic endpoint 0.28\nmg/l.  Th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8945,
      "SummaryText": "e distance to the endpoint is 0.41 miles. There are 6 residences within this area with an estimated population of 20.  Public Receptors in this area are residences, nearby industry, a boat landing, and a church.  The facility is in the planning process to conduct a HAZOP in this area later this year.\n\n    Both these processes fit in the Category 3 Program. Many of the items of the required prevention program are similar, as the elements have been instituted as a facility wide approach. The similar programs would include Management of Change and its many elements. There are some individual differences in areas such as which process controls are used. Mitigation systems in use, and the use of monitoring systems. \n    \n    As required both these processes are covered under the facility's Emergency Response Plan, as well as other regulatory required Response Plans. The Facility is finalizing work on an Integrated Contingency Plan. The Franklin-Southampton-Isle of Wight (FSI) Local Emergency Planning Committee (LEPC) Hazardous Material Plan incorporates our plans into their plans. The Facility's Environmental Supervisor is an active member of the LEPC. \n\n    \n"
    }
  ]
}