{
  "FacilityID": 8962,
  "FacilityName": "Warren Water Filtration Plant",
  "FacilityStr1": "2710 State Route 5",
  "FacilityStr2": null,
  "FacilityCity": "Cortland",
  "FacilityState": "OH",
  "FacilityZipCode": "44410",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39155",
  "LEPC": "Trumbull County LEPC",
  "FacilityLatDecDegs": "41.290556",
  "FacilityLongDecDegs": "-80.757778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 10848216,
  "Company2DUNS": null,
  "OperatorName": "City of Warren",
  "OperatorStr1": "391 Mahoning Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Warren",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44483",
  "OperatorZipCodeExt": null,
  "FTE": 23,
  "OtherEPAFacilityID": "PWS. ID783811",
  "EPAFacilityID": "100000111407",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-31 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": "Warren, OH WTP Facility",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2009-02-05 00:00:00",
  "DeRegistrationEffectiveDate": "2007-10-30 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.290556,
  "FRS_Long": -80.757778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "gaseous chlorine was removed",
  "_processes": [
    {
      "ProcessID": 10905,
      "AltID": "Water Chlorination",
      "FacilityID": 8962,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 12142,
          "ProcessID": 10905,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11166,
          "ProcessID": 10905,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5094,
              "Process_NAICS_ID": 11166,
              "SafetyReviewDate": "1999-06-21 00:00:00",
              "PHA_Date": "1999-03-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "See Executive Summary",
              "OpProceduresReviewDate": "1997-01-01 00:00:00",
              "TrainingReviewDate": "1997-01-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-01-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-21 00:00:00",
              "EquipmentTested": "Entire chlorine system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-06-21 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-03-24 00:00:00",
              "AuditCompletionDate": "1999-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-21 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyReviewDate": "1999-06-21 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5921,
                  "PreventionProgram3ID": 5094,
                  "ProcessChemicalID": 12142
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8962,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-21 00:00:00",
    "ERTrainingDate": "1997-06-01 00:00:00",
    "CoordinatingAgencyName": "Trumbull Co. Emerg. Mgmt. Agency",
    "CoordinatingAgencyPhone": "3036752666",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 8962,
      "SummaryText": "s part of the overall filtration process.  Chlorine cylinders are received by truck and are placed inside the chlorine building where they are stored until needed.  The storage capacity of each cylinder is 2000 pounds. The plant storage area has a total capacity for 16 chlorine cylinders.  Therefore the maximum amount of chlorine that can be stored at the facility is approximately 32,000 pounds.  However, normal operating storage amounts are generally 16,000 to 24,000 pound range.  \n\nThe chlorine building is equipped with numerous safety features.  Chlorine sensors are located inside the the building and are connected to visual and audible alarms.  If the sensors detect too high a concentration of chlorine, the emergency system is activated.  Louvers close over ventilation openings and windows to isolate the building.  The scrubber system is activated in order to continuously recirculate the inside atmosphere through a caustic soda solution and neutralize the chlorine.\n\n3.  The worst-case scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nWorst-case Scenario - After careful review of potential worst-case scenarios, it was determined that a cylinder unloading accident that causes rupture of the vessel outside of the chlorine building (therefore the building enclosure and emergency vapor scrubber couldn't be taken into account) is the worst-case.  This could cause the contents of a chlorine cylinder (2000 pounds) to be released outside, in calm weather conditions over a 10 minute period.  The distance to the regulatory endpoint of 3 parts per million is 1.3 miles for this scenario utilizing the EPA guidance document referenced in the data elements section.\n\nAlternative Scenario - As part of the facilities process hazards analysis, a lot of effort went into defining a plausible alternative release scenario which would impact off site receptors as the RMP regu"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 8962,
      "SummaryText": "1.  Accidental release prevention and emergency response policies:\n\nAt the Warren Water Filtration Plant, chlorine, a chemical considered to hazardous by the United States Environmental Protection Agency (US EPA) is utilized.  The properties of chlorine make it valuable for disinfecting water for human consumption.  These same properties make it necessary to observe certain safety precautions in handling chlorine to prevent unnecessary human exposure, to reduce the threat to the personal health of the facility employees, and to reduce the threat to nearby members of the community.  It is the policy of the Warren Utilities Department to adhere to all applicable Federal and State rules and regulations concerning handling and storage of chlorine.  Safety depends upon the safety devices inherent in the design of the facility, combined with the proper handling procedures that are used, and the training of facility personnel.\n\nThe Facility's emergency response procedures are coordinated through the Trumbull County Emergency Management Agency and include notification of the local fire authorities who in turn notify any potentially affected neighbors.  In addition, access to the site is restricted to authorized facility employees, management personnel, and contractors.  The chlorine system is enclosed within a building with an emergency vapor scrubber (to help contain a release on-site) that will activate in the event of an emergency.\n\n2.  The stationary source and regulated substances handled:\n\nThe regulated substance handled at this facility is chlorine.  The chlorine system generally includes a series of manifolded cylinders from which gaseous chlorine is extracted by vacuum through a vacuum regulator.  From there, the chlorine enters a chlorinator which regulates feed to the drinking water system.  \n\nThe primary purpose of the Warren Water Filtration Plant is to provide safe drinking water for the communities the facility services.  Chlorine is used to disinfect water a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8962,
      "SummaryText": "lation states.  Since the facility has an emergency scrubber system and an emergency damper system that closes the building in place, almost all scenarios resulted in a release which would be contained inside the chlorine building.  One situation was developed, when during the switch over between an empty bank of cylinders (a bank consists of 4 cylinders) and a full one, if the switch over regulator vent were to become stuck, chlorine gas at a calculated rate of 37 pounds per minute could be released from the new bank through a 1/2  pipe vented to the outside.  This is conservatively assumed to last for an hour without detection and response.  The distance to the regulatory endpoint of 3 parts per million is 0.1 miles for this scenario utilizing the EPA guidance document referenced in the data elements section.\n\n4.  The general accidental release prevention program and the specific prevention steps:\n\nThe Warren Water Filtration Plant complies with EPA's RMP regulations as well as OSHA's Process Safety Management Standard, and with applicable state codes and regulations.  The facility was designed and constructed in accordance with good engineering practices to provide a safe system for employees as well as community members and the environment.  The plant operators and other employees are trained in safety practices and safety documents are available to employees.  The facility has written operating procedures that are followed in the day to day operation of the facility.  Adequate employee training is ensured by new employees working directly with personnel having extensive experience with the system.  This process generally continues for a six-month period.  As new equipment is added to the system, additional training will occur, as well as appropriate revisions to the written operating and maintenance procedures.  Furthermore, the facility has set up procedures for compliance audits and incident investigations that will be implemented in accordance with RMP requ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8962,
      "SummaryText": "irements.\n\n5.  Five-year accident history:\n\nDuring the last five years, ther have been no accidental releases which resulted in injuries or environmental damage resulting from the chlorine system.\n\n6.  The emergency response program:\n\nThe facility has just recently developed an updated Emergency Response Plan that details site specific discovery and notification procedures in case of an emergency.  In addition to this, the facility is included in the written community emergency response plan through the Trumbull County Emergency Management Agency.  A 911 call will activate response from either the Trumbull County Hazmat Team (primary) or the City of Warren Hazmat Team (secondary backup).  \n\n7.  Planned changes to improve safety:\n\nA process hazard analysis of the chlorine system was conducted March 23 and 24, 1999.  From this review, the recommendations were:\n\n- Add various requirements to chemical supplier's procurement/specification process\n\n- Require the use of wheel chocks for delivery trucks\n\n- Add chock requirement and height requirement to tank change operating procedure\n\n- Develop penalty system for defective cylinder delivery\n\n- Evaluate methods to reduce/eliminate height problem for unloading trucks\n\n- Update operating procedures to conform with PSM requirements\n\n- Further implement and document mechanical integrity program\n\n- Complete the perimeter fencing\n\n- Evaluate the need to install smoke/heat detectors in storage room\n\n- Add damper inspection and pump startup to O&M operating procedure\n\n- Develop hot work permit program\n\n- Implement contractor training program\n\n- Evaluate existing personal protective equipment available at the plant\n\n- Evaluate the need to upgrade to a 2-tiered emergency/alarm system\n\n- Evaluate the need to upgrade to a dry scrubber system with a minimum of 8,000 pound capacity\n\n- Tag valves and breakers as normally open or closed\n\n\nThe Warren Water Filtration Plant intends to have completed the planned changes by 12/31/99."
    }
  ]
}