{
  "FacilityID": 8968,
  "FacilityName": "The Stop & Shop Readville Distribution Center",
  "FacilityStr1": "100 Meadow Road",
  "FacilityStr2": null,
  "FacilityCity": "Readville",
  "FacilityState": "MA",
  "FacilityZipCode": "02137",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25025",
  "LEPC": "Boston LEPC",
  "FacilityLatDecDegs": "42.228056",
  "FacilityLongDecDegs": "-71.121389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "ahold.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 160434734,
  "ParentCompanyName": "Ahold U.S.A. Holdings, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "The Stop & Shop Supermarket Company",
  "OperatorStr1": "100 Meadow Road",
  "OperatorStr2": null,
  "OperatorCity": "Readville",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02137",
  "OperatorZipCodeExt": null,
  "FTE": 522,
  "OtherEPAFacilityID": "MAD091491134",
  "EPAFacilityID": "100000111737",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-04-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2005-05-09 00:00:00",
  "DeRegistrationEffectiveDate": "2004-12-31 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.230754,
  "FRS_Long": -71.132325,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 10915,
      "AltID": "Refrigeration System",
      "FacilityID": 8968,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 12160,
          "ProcessID": 10915,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11176,
          "ProcessID": 10915,
          "NAICSCode": "42241",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5103,
              "Process_NAICS_ID": 11176,
              "SafetyReviewDate": "1998-10-01 00:00:00",
              "PHA_Date": "1994-05-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-02-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1998-10-01 00:00:00",
              "TrainingReviewDate": "1998-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1998-10-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-17 00:00:00",
              "EquipmentTested": "Daily inspection of all system components",
              "ChangeMgmtDate": "1998-10-30 00:00:00",
              "ChangeMgmtReviewDate": "1998-10-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1998-05-01 00:00:00",
              "AuditCompletionDate": "1999-02-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1998-10-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-10-01 00:00:00",
              "ContractorSafetyReviewDate": "1998-10-14 00:00:00",
              "ContractorSafetyEvalDate": "1998-10-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5938,
                  "PreventionProgram3ID": 5103,
                  "ProcessChemicalID": 12160
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 8968,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-10-01 00:00:00",
    "ERTrainingDate": "1998-10-15 00:00:00",
    "CoordinatingAgencyName": "Boston Fire Department",
    "CoordinatingAgencyPhone": "6175361500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 8968,
      "SummaryText": "The Stop & Shop Supermarket Company has operated the Distribution Center in Readville, MA since 1958. \nCurrently the facility consists of a 400,000 square-foot grocery warehouse, a 200,000 square-foot produce warehouse and a 100,000 square-foot dairy commissary.  The Readville Distribution Center is one of two refrigerated facilities utilized by Stop & Shop for the storage and distribution of products to almost 200 stores.  Since many of these products must remain refrigerated,  Stop & Shop operates a single-stage refrigeration system using anhydrous ammonia as the refrigerant.  Anhydrous ammonia is identified as a toxic gas in the EPA regulation, \"Accidental Release Prevention Requirements: Risk Management Program\" or \"RMP\".   \n\n\nRefrigeration systems that use anhydrous ammonia are an established and recognized technology and have been in use for decades.  EPA recognizes that ammonia refrigeration plants are very different from complex chemical processing operations.  The complex level of operations involved in chemical processing plants are not found in refrigerated facilities where there are no chemical reactions.  While there are new developments leading to more efficient operations, the design principles are fully available.  A complete understanding of the safe design and operating guidelines has been available to design and operating practitioners in the industry for some time.  As is common for most commercial systems, the Stop & Shop refrigeration system operates in a sequential mode based on the heat load.  The heat load is determined by the material being moved into the warehouse and by the outside air temperature.  As such, the process control parameters of greatest consequence are the temperature and pressure readings throughout the system.\n\n\nAs part of the RMP, Stop & Shop has conducted analyses of two ammonia release scenarios, the \"worst-\ncase\" scenario and the \"alternative release\" scenario.  Following EPA guidance, the worst-case release \nwas def"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 8968,
      "SummaryText": "ined as the largest ammonia containing vessel within the refrigeration system; specifically the high \npressure receiver with a maximum inventory of 6,500 pounds.  The worst-case release scenario further \nassumed that all the mechanical controls and all active safety systems failed to operate.  The only passive \nmitigating factor considered was that the receiver vessel is located within an enclosed room, which would \nreduce the release rate of ammonia to the environment.  The area affected by the worst-case release \nwas determined using the EPA's own Offsite Consequence Analysis dispersion model RMP*Comp.  Under \nthis hypothetical scenario, ammonia vapor would travel past the boundary of the facility as it dispersed with air, reaching approximately one mile from the point of release.  Although the probability of such an event is extremely remote, an estimated population of 7,100 could potentially be impacted by such a release.\n\n\nThe alternative release scenario is defined to be a more plausible case then the worst case scenario, and \nis useful as a planning case for the Local Emergency Planning Committee (LEPC) and other emergency \nresponders.  The approach for selecting the alternative release involved an examination of 3 sources: 1) the Process Hazards Analysis conducted of the system, 2) past release events at the site and 3) the industry-specific Model Risk Management Program and Plan for Ammonia Refrigeration guidance document,\nsponsored by the EPA.  The scenario selected for analysis was a 1/4-inch diameter opening resulting from \nexternal corrosion in the process piping.  These process lines are located on the roof to limit employee \nexposure in confined areas.  This selected example is consistent with those suggested in the EPA guidance document.  For such a release, the computer controls would detect the associated pressure drop in the process piping and would automatically shut the appropriate valve to isolate the leaking section.  The leak would continue f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 8968,
      "SummaryText": "or approximately 10 minutes until that section of piping had emptied its contents.  Incorporating the same EPA dispersion model used with the worst-case release, the alternative release was determined to result in the ammonia vapor cloud reaching a distance of two tenths of a mile from the point of release and impacting an estimated population of 290.\n\n\nTo provide the most effective means of process control, Stop & Shop installed a programmable controller \nseveral years ago to monitor and reliably control all operating conditions within the refrigeration system.  In \nthe event of a system pressure increase,  the programmable controller automatically activates additional \ncondensers and air handling units.  Operators can activate an emergency shutdown of all system \ncomponents through one of two mechanisms.  The shutdown can either be achieved through the \ncontroller, or by manually operating a \"king\" valve located outside the building.\n\n\n\nWe take safety seriously.  As part of our ongoing commitment to ensure the overall safety of our facility, we have in place a number of protective measures to prevent the discharge of anhydrous ammonia into the atmosphere, and to provide our employees and neighbors with a safe environment.  These include\n\n* An extensive preventive maintenance program, following manufacturer's recommendations as well as recognized industry practices, to ensure the overall safety of our process equipment;\n\n* Daily documented inspections of refrigeration system on each shift;\n\n* Safety interlocks on all major process equipment that automatically activate, based on pre-determined temperature and pressure settings;  \n\n* Ammonia leak detectors tied into an alarm system that allow us to safely monitor refrigerated areas;\n\n* Training regarding the properties and hazards associated with ammonia for all Stop & Shop employees as part of the Hazard Communication Program, with additional training provided for all employees who work with the refrigeration system"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 8968,
      "SummaryText": "; \n\n* Daily dialogue between Operations and Maintenance employees regarding the operating status of the refrigeration system;\n\n* Maintain open dialogue with the Boston Fire Department/LEPC;\n\n* Participated in Emergency Response exercise; and\n\n* Voluntarily participate in EPA Hazmat Certification Program.\n\n\nThe Readville facility is covered by the OSHA Process Safety Management (PSM) standard.  In \naccordance with that standard, a comprehensive program has been implemented which addresses \nprocess hazards analysis, operating procedures, mechanical integrity,emergency preparedness and other \nprocess safety-related topics.  The RMP requires that we report a five-year history for accidental releases that resulted in deaths, injuries, significant property damage, evacuation or shelter-in-place of the community, or environmental damage.  There have been no such incidents at Stop & Shop Readville during the past five-years.   In fact, with 23 years of continuous operation, none of our employees have been seriously hurt due to ammonia exposure, nor has anyone been hurt outside our property due to ammonia exposure.  This safety record exemplifies the effectiveness of management practices and commitment to safety. \n\n\nMany efforts have been made to reduce the potential risks associated with the refrigeration system.  \nShould a significant ammonia release to occur, the facility's Emergency Response Plan would \nbe activated.  The Emergency Response Plan has been developed to define what actions Stop & Shop employees are to take in the event of an ammonia release, and to identify those actions to be performed by the Fire Department and emergency response contractors.  Stop & Shop maintenance department employees act as primary responders only for those releases of less than 50 parts per million (ppm).  For releases exceeding this level, the Boston Fire Department would be notified along with designated emergency response contractors.  The building would be evacuated and the maint"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 8968,
      "SummaryText": "enance department employees would provide secondary assistance to the responders, as needed.  The Boston Fire Department would act as the incident commanders and will initiate any public notification, if deemed necessary.\n\n\nTo promote community awareness and emergency preparedness, Stop & Shop has participated in \nthe LEPC meetings, and our Emergency Response Plan has been submitted to and reviewed by the LEPC, \nand is routinely updated.  A facility-wide drill has been conducted with the Fire Department and local \nresponders.  In the event of a real emergency, we are all prepared to respond as a coordinated team.\n\n\nThe Stop & Shop Readville Distribution Center is dedicated to maintaining a safe operation.  We support and \nwork closely with our employees and contractors, the LEPC and local response organizations to prevent \naccidental releases, and to be prepared if they ever should occur."
    }
  ]
}