{
  "FacilityID": 9066,
  "FacilityName": "Southern States Coop- Statesville, NC (5900)",
  "FacilityStr1": "2582 Salisbury Highway",
  "FacilityStr2": null,
  "FacilityCity": "Statesville",
  "FacilityState": "NC",
  "FacilityZipCode": "28677",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37097",
  "LEPC": null,
  "FacilityLatDecDegs": "35.7575",
  "FacilityLongDecDegs": "-80.796944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Southern States Cooperative, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 8964637,
  "Company2DUNS": null,
  "OperatorName": "Southern States Cooperative, Inc.",
  "OperatorStr1": "2582 Salisbury Highway",
  "OperatorStr2": null,
  "OperatorCity": "Statesville",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28677",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": "28677STHRNHWY70",
  "EPAFacilityID": "100000110765",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "2316R5",
  "SafetyInspectionDate": "1997-03-25 00:00:00",
  "SafetyInspectionBy": "Hartford Insurance",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP Pro 98",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-01-22 00:00:00",
  "DeRegistrationEffectiveDate": "2023-12-18 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.757032,
  "FRS_Long": -80.796343,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11063,
      "AltID": "Ammonia Storage",
      "FacilityID": 9066,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 12333,
          "ProcessID": 11063,
          "ChemicalID": 56,
          "Quantity": 260100.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11329,
          "ProcessID": 11063,
          "NAICSCode": "325314",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5186,
              "Process_NAICS_ID": 11329,
              "SafetyReviewDate": "1999-02-02 00:00:00",
              "PHA_Date": "1995-08-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1999-06-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "3 Water cannons",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "none",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "additional training and inspection procedures",
              "OpProceduresReviewDate": "1999-02-02 00:00:00",
              "TrainingReviewDate": "1999-01-25 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "HAZCOM, HAZWOP",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-02 00:00:00",
              "EquipmentInspectionDate": "1999-03-01 00:00:00",
              "EquipmentTested": "Ammonia Storage System",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-03-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-02-02 00:00:00",
              "AuditCompletionDate": "1999-06-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-03-01 00:00:00",
              "HotWorkPermitReviewDate": "1999-03-01 00:00:00",
              "ContractorSafetyReviewDate": "1999-03-01 00:00:00",
              "ContractorSafetyEvalDate": "1999-03-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 6041,
                  "PreventionProgram3ID": 5186,
                  "ProcessChemicalID": 12333
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9066,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-01-22 00:00:00",
    "ERTrainingDate": "1998-11-17 00:00:00",
    "CoordinatingAgencyName": "Wayside Fire Department",
    "CoordinatingAgencyPhone": "7048726820",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9066,
      "SummaryText": "EXECUTIVE SUMMARY\n(Site: 5900)\n\nThe accidental release prevention and emergency response policies at your facility:\n\nThis facility handles anhydrous ammonia, which is considered to be a regulated toxic substance by EPA.  We observe all necessary safety precautions in handling anhydrous ammonia to prevent unnecessary human exposure, to reduce the threat to our own personal health and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable federal, state and local rules and regulations.  Safety depends upon the manner in which we handle anhydrous ammonia, the safety devices inherent to the design of this facility, the safe handling procedures that we use and the training of our personnel.  This facility is subject to Program 3 of the Risk Management Program because it is also subject to OSHA's Process Safety Management regulations.\n\nThis facility complies with ANSI K-61.1 and OSHA 1910.111 requirements for anhydrous ammonia storage.  If an emergency were to occur, it is our policy to notify the local emergency response agency.\n\nA description of your facility and the regulated substances handled:\n\nThe primary purpose of this facility is fertilizer production.  We receive anhydrous ammonia by rail and transport truck and store it as a liquid in pressurized vessels. Access to the process is restricted to authorized employees and contractors.  The maximum amount of anhydrous ammonia that can be stored at this facility is 60,000 gallons (water capacity).\n\nThe worst case and alternative release scenarios:\n\nThe worst-case release scenario is failure of one 30,000 gallon tank when filled to its maximum allowable capacity (85% @ 60 F), resulting in a release of anhydrous ammonia.  The distance to the endpoint of 140 ppm is 2.41 miles, based on the dense gas dispersion model Degadis.  This distance extends beyond the facility boundary and there are estimated to be 2,657 residents, commercial/industrial areas, schools, and churches"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9066,
      "SummaryText": "within the distance to endpoint.\n\nThe alternative release scenario is failure of a 12 foot length of 3 inch hose due to a cracked hose or failed fitting.  The operator observes the leak and isolates the hose by closing the shut-off valves.  The contents of the hose are released over a period of ten minutes.  The distance to the endpoint of 140 ppm is 317 feet, based on the dense gas dispersion model Degadis.  This distance extends beyond the facility boundary and there are businesses within the distance to endpoint.\n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\nThis facility complies with EPA's accident prevention rule and all applicable state and local codes and regulations.  The anhydrous ammonia system is designed, installed, and maintained in accordance with ANSI K-61.1, OSHA 1910.111 and state law.\n\n\n Process Safety Information\nWe maintain safety information that describes the chemical hazards, operating parameters and equipment designs associated with our ammonia storage facilities.\n\nProcess Hazard Analysis\nOur Environmental, Health, Safety and Security (EHSS) team conducts comprehensive studies and reviews to ensure that hazards associated with our processes are identified and controlled efficiently. These activities are undertaken by a team of qualified personnel with expertise in process operations and are revalidated at a regular interval.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nWe maintain written operating procedures for operation of the ammonia storage facility.  These procedures address various modes of operation including initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is readily accessible to operators.\n\nTraining\nWe have a comprehensive training program in place to ensure that employees who are operating processes are competent in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9066,
      "SummaryText": "eports are retained for a minimum of 5 years.\n\nEmployee Participation\nWe have consulted with employees and their representatives regarding development of the Process Hazard Analysis and other elements of process safety management to ensure that they have access to all information to be developed under this rule.\n\nHot Work Permit\nWe have a Hot Work Permit program in place to meet the requirements of OSHA 29CFR1910.252(a).  This program minimizes the likelihood of an accidental fire by requiring planning and preparation for hot work conducted on or near a covered process.\n\nContractors\nIn order to ensure a safe facility, we check the safety performance of all contractors that work on our facility.  Contractors are trained in the hazards associated with the covered processes and are trained in safe working practices.\n\nFive-year accident history:\n\nDue to our comprehensive safety program, this facility has never had an accident involving anhydrous ammonia that caused deaths, injuries, property or environmental damage, evacuations, or shelterings in place.\n\nThe emergency response program:\n\nIt is company policy for each of our facilities to maintain an Emergency Action Plan & Emergency Response Plan.  This plan addresses chemical inventory, evacuation procedures and instructions for notifying emergency response agencies.  This plan is reviewed on an annual basis and is included in the employee training program.  In the event of an emergency, it is our policy to notify the local emergency response agency and request that they respond to the emergency.\n\nPlanned changes to improve safety:\n\nWe will continue to implement our safety program to guarantee that our facility is operated in a safe and reliable manner and to ensure the safety of our employees and the surrounding community."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9066,
      "SummaryText": "the operating procedures associated with these processes.  Refresher training is provided at least every three years.\n\nMechanical Integrity\nOur EHSS team performs thorough annual maintenance inspections on process equipment to ensure proper operations.  Basic visual inspections are performed by facility operators on a more frequent basis during loading and unloading of ammonia delivery vehicles.  Process equipment examined by these checks includes: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are performed by qualified personnel that have been trained in safe maintenance practices.  Any equipment deficiencies are corrected in a safe and timely manner.\n\nManagement of Change\nWhenever a change in process occurs, our management of change procedures ensure that we evaluate the impact on health and safety, modify the operating procedures and safety information as necessary, and inform and train our employees.\n\nPre-Startup Review\nWhenever a process change is significant enough to require a change in safety information under the management of change procedures, we will perform a pre-startup review prior to initiating the process.  The pre-startup review includes a confirmation of design specifications, operating procedures, process hazard analysis and employee training.\n\nCompliance Audits\nWe conduct compliance audits on a regular basis to confirm that the provisions set out under the RMP rule are being implemented.  These audits are performed at least every 3 years and any corrective actions required as a result of the audits are undertaken in a timely manner.\n\n Incident Investigation\nWe promptly investigate any incident that has resulted in, or could reasonably result in, a catastrophic release of ammonia.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the incident from reoccurring.  All r"
    }
  ]
}