{
  "FacilityID": 9097,
  "FacilityName": "DWSD - Northeast Water Treatment Plant",
  "FacilityStr1": "11000 East Eight Mile Road",
  "FacilityStr2": null,
  "FacilityCity": "Detroit",
  "FacilityState": "MI",
  "FacilityZipCode": "48205",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26163",
  "LEPC": "Detroit City LEPC",
  "FacilityLatDecDegs": "42.451",
  "FacilityLongDecDegs": "-83.006972",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://sparkle.dwsd.org",
  "FacilityEmailAddress": "dmann@dwsd.org",
  "FacilityDUNS": null,
  "ParentCompanyName": "Detroit Water & Sewerage Department",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Detroit Water & Sewerage Department",
  "OperatorStr1": "735 Randolph",
  "OperatorStr2": null,
  "OperatorCity": "Detroit",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48226",
  "OperatorZipCodeExt": null,
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000112923",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-09-16 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2004-04-27 00:00:00",
  "DeRegistrationEffectiveDate": "2004-02-06 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.448484,
  "FRS_Long": -83.013037,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11131,
      "AltID": "Water Disinfection",
      "FacilityID": 9097,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 12411,
          "ProcessID": 11131,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11397,
          "ProcessID": 11131,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5235,
              "Process_NAICS_ID": 11397,
              "SafetyReviewDate": "1999-06-11 00:00:00",
              "PHA_Date": "1999-06-15 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Modified HAZOP",
              "PHACompletionDate": "2001-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Fusible plug on chlorine cylinders",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-15 00:00:00",
              "TrainingReviewDate": "1999-05-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-05-17 00:00:00",
              "EquipmentInspectionDate": "1999-06-14 00:00:00",
              "EquipmentTested": "Valves, gas & liquid lines, connections (performed daily during chlorine tank replacement)",
              "ChangeMgmtDate": "1995-02-21 00:00:00",
              "ChangeMgmtReviewDate": "1999-05-17 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-05-17 00:00:00",
              "HotWorkPermitReviewDate": "1997-06-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "1999-05-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 6091,
                  "PreventionProgram3ID": 5235,
                  "ProcessChemicalID": 12411
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9097,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-02-01 00:00:00",
    "ERTrainingDate": "1998-06-01 00:00:00",
    "CoordinatingAgencyName": "Detroit City LEPC",
    "CoordinatingAgencyPhone": "3135965196",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9097,
      "SummaryText": "Clean Air Act Amendments Section 112(r)(7)\nAccidental Release Prevention Programs:\n40 CFR Part 68 - Subpart G\nRisk Management Plan\n\nEXECUTIVE SUMMARY\n\nThe Detroit Water and Sewerage Department's Northeast Water Treatment Plant is a stationary source that is subject to the Risk Management Programs under the Clean Air Act, Section 112 (r)(7) (as promulgated in 40 Code of Federal Regulations Part 68).  The Northeast Water Treatment Plant stores chlorine in quantities in excess of the 2,500 pound Risk Management Program threshold.\n\nPursuant to 40 CFR ' 68.150, the Northeast Water Treatment Plant is required to submit a single Risk Management Plan (RMP) that includes the information required by '' 68.155 through 68.185.  The Northeast Water Treatment Plant is also required to provide an executive summary in the RMP.  The following is a brief description of various elements of the facility's Risk Management Program, as required by 40 CFR ' 68.155:\n\n(a) THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE \n\nThe Detroit Water and Sewerage Department (DWSD) operates five water treatment plants in the Southeast Michigan area.  While the production of potable drinking water is vital to the welfare of the community, DWSD recognizes that the safe handling of the chlorine used in the water disinfection process is also critical to the welfare of the community.  DWSD recognizes that the U.S. Environmental Protection Agency lists chlorine as a regulated toxic substance pursuant to the Accidental Release Prevention and Risk Management Program regulations.\n\nDWSD is committed to the implementation of stringent safety precautions for chlorine handling at all of its water treatment facilities.  These safety precautions are necessary to prevent accidental releases of chlorine that could threaten the health of DWSD employees, DWSD contractors, and the members of the community DWSD serves.  To this end, DWSD implements routine equipment maintenance and"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9097,
      "SummaryText": "process improvements, operational procedures, employee training programs, and emergency response procedures, and is committed to compliance with all applicable state and federal regulations.\n\n(b) THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED \n\nThe Northeast Water Treatment Plant treats water from the Detroit River to produce potable drinking water.  Water from the Detroit River is initially treated at DWSD's Water Works Park Treatment Plant.  Water from the Water Works Park plant is pumped to the Northeast plant for additional treatment.  The Northeast Water Treatment Plant typically produces 125 million gallons per day (MGD) of treated water.  \n\nThe plant adds aluminum sulfate (alum) to the water to aid in the removal of particulate matter.  The alum produces a precipitate that binds to fine particles; the resulting larger particles settle out.  On an as-needed basis, the plant uses its carbon system to add activated carbon to the water.  Activated carbon can remove tastes and odors that may exist in the influent water.  The plant also adds phosphoric acid to the water to minimize the leaching of lead from water distribution piping.  The plant's alum, carbon, and phosphoric acid systems do not contain chemicals that are designated as regulated toxic or flammable substances pursuant to the Accidental Release Prevention and Risk Management Program regulations.  \n\nThe plant's chlorine system disinfects the water.  The water disinfection occurs at the beginning of the treatment process (pre-chlorination) and as a final treatment step (post-chlorination).  The primary components of the plant's chlorine system include a maximum of nine (9) 2,000 pound cylinders of chlorine, two (2) evaporators, eight (8) chlorinators, and the associated chlorinated water distribution components (e.g., polyvinylchloride piping). \n\nChlorine is designated as a \"regulated toxic substance\" pursuant to the Accidental Release Prevention and Risk Management Program regulations.  The Nor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9097,
      "SummaryText": "theast Water Treatment Plant has more than the threshold quantity (2,500 pounds) of chlorine in its water disinfection process; therefore, the attached Risk Management Plan addresses this single covered process. \n\n(c) THE WORST-CASE RELEASE SCENARIO AND THE ALTERNATIVE RELEASE SCENARIO, INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO \n\nThe U.S. Environmental Protection Agency's Risk Management Program guidance document for Wastewater Treatment Plants (Chapter 4: Offsite Consequence Analysis) was referenced in the development of the worst-case and alternative release scenarios for the Northeast Water Treatment Plant.\n\nThe Worst-Case Release Scenario involves the release of the entire contents of the greatest amount held in a single vessel (i.e., 2,000 pounds of chlorine gas) within an enclosure (building).  Assuming a wind speed 1.5 meters/second, atmospheric stability class F, relative humidity 50%, a maximum air temperature of 770F, a release duration of 10 minutes, and a ground level release in an urban area, the toxic endpoint for chlorine (0.0087 mg/L or 3 parts per million) would be located within 0.98 miles of the Northeast Water Treatment Plant.\n\nThe Alternative Release Scenario assumes that the outlet valve on one 2,000 pound chlorine cylinder leaks from a 1/8 inch diameter opening, and that the release occurs within an enclosure (building).  Assuming a wind speed of 1.5 meters/second, atmospheric stability class D, relative humidity 50%, a maximum air temperature of 770F, a release duration of 13 minutes, and a ground level release in an urban area, the toxic endpoint for chlorine (0.0087 mg/L or 3 parts per million) would be located within 0.17 miles of the Northeast Water Treatment Plant.\n\n(d) THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS \n\nThe Northeast Water Treatment Plant stores, handles, and uses chlorine in its water purification process.  The Nort"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9097,
      "SummaryText": "heast Water Treatment Plant has established a Process Safety Management Plan. The information contained within this PSM Plan establishes the protocols and procedures needed to safely handle and use chlorine. The plan is designed to prevent and minimize the effects of an unplanned, sudden or non-sudden incident involving chlorine.  This plan is designed to meet the regulatory requirements of MIOSHA, Rule #40819102 - Process Safety Management Program.\n\nSpecifically this plan protects the community using a combination of operating procedures and safe work practices, equipment design, emergency operations and shut-down procedures, building design, containment, and employee training and education.\n\nThe requirements of the Process Safety Management Plan will be implemented as an on-going compliance policy to ensure that chlorine is safely stored, handled, and used by the Northeast Water Treatment Plant.  This plan provides direction for the current and future use and handling of chlorine, and ensures that any release of chlorine can be safely contained so as to minimize its impact on the community.\n\n(e) THE FIVE-YEAR ACCIDENT HISTORY \n\nIn the last five years at the Northeast Water Treatment Plant, there have been no reportable releases of chlorine or chlorine releases that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n(f) THE EMERGENCY RESPONSE PROGRAM \n\nThe Northeast Water Treatment Plant has documented Chlorine Emergency Response procedures.  The Northeast Water Treatment Plant is also included in an Emergency Response Plan that was developed for all Detroit Water and Sewerage Department (DWSD) facilities.  The DWSD Emergency Response Plan has an appendix that specifically addresses accidental releases of chlorine.  The documents address the notification of local emergency response agencies and the public, emergency first aid and m"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9097,
      "SummaryText": "edical treatment, response strategies and incident command, evacuation procedures, and specific procedures for responding to chlorine releases.\n\nNortheast Water Treatment Plant personnel that have the potential for responding to accidental releases of chlorine have received formal emergency response training (i.e., 40-Hour Hazardous Waste Operations and Emergency Response (HAZWOPER) training).  In addition, the plant's chlorine supplier has routinely provided chlorine-specific emergency response training to plant employees.   \n\nThe Northeast Water Treatment Plant is equipped with one (1) chlorine detector that is located in the basement below the chlorine handling facility.  If the detector senses chlorine at a concentration of 1 part per million or greater, an audible alarm is activated in the plant's laboratory.  Three operators are on site at all times to respond to an alarm.  The external notification of local emergency response agencies and the public would be conducted on an as-needed basis, in accordance with the facility's Emergency Response Plan. \n \n(g) PLANNED CHANGES TO IMPROVE SAFETY \n\nThe Northeast Water Treatment Plant is planning a major renovation that is scheduled for completion within approximately five years.  The renovations will result in a new chlorine system for pre-chlorination and post-chlorination, additional chlorine detectors, and a chlorine abatement system.  During the construction phase of the project (in approximately 2001) the Northeast Water Treatment Plant will temporarily utilize a sodium hypochlorite system for water disinfection.  Sodium hypochlorite is not designated as a regulated toxic or flammable substance pursuant to the Accidental Release Prevention and Risk Management Program regulations.\n\nThe Northeast Water Treatment Plant is in the process of updating and revising its current Emergency Response Plan.\n\nThe City of Detroit is also initiating the use of a new computer program for purchasing, training, and preventive main"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 9097,
      "SummaryText": "tenance.  This computer program will be used by all City of Detroit operations, including the water treatment plants.  When the program is fully implemented it will issue work orders for preventive maintenance, record all preventive maintenance activities, and maintain training records.  The computer program is expected to be fully operational before the end of the 1999 calendar year."
    }
  ]
}