{
  "FacilityID": 9165,
  "FacilityName": "Anheuser-Busch, Inc. Los Angeles Brewery",
  "FacilityStr1": "15800 Roscoe Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Van Nuys",
  "FacilityState": "CA",
  "FacilityZipCode": "91406",
  "Facility4DigitZipExt": "1379",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.221111",
  "FacilityLongDecDegs": "-118.476944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.anheuser-busch.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6288799,
  "ParentCompanyName": "Anheuser-Busch Companies, Inc",
  "Company2Name": null,
  "CompanyDUNS": 98630254,
  "Company2DUNS": 0,
  "OperatorName": "Anheuser-Busch, Inc.",
  "OperatorStr1": "P.O. Box 2113",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90051",
  "OperatorZipCodeExt": "0113",
  "RMPContact": "Chris Harden",
  "RMPTitle": "Resident EHS Manager",
  "FTE": 1192,
  "OtherEPAFacilityID": "CAT080031081",
  "EPAFacilityID": "100000114333",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "App. under rev",
  "SafetyInspectionDate": "1998-01-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.2213,
  "FRS_Long": -118.47563,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11207,
      "AltID": "Ammonia Refrig. System",
      "FacilityID": 9165,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 11473,
          "ProcessID": 11207,
          "NAICSCode": "31212",
          "_desc": {
            "NAICS_CODE": "31212",
            "NAICS_DESCRIPTION": "Breweries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 12491,
          "ProcessID": 11207,
          "ChemicalID": 56,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 512491,
          "ProcessID": 11207,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9165,
      "SummaryText": "Risk Reduction Policies\n\nAnheuser-Busch, Inc.s Los Angeles, California brewery handles ammonia which is covered under OSHAs Process Safety Management standard (PSM) and EPAs Risk Management Program (RMP) regulations.  The brewery complies with these regulations, as well as others, to ensure that the risks involved in handling, use and storage of ammonia and other potentially hazardous chemicals are minimized. Our corporate environmental, health, and safety (EHS) policy and requirements promote overall facility, employee, and public safety.  In support of this policy, process risk reduction programs provide assurance for the safe management of process risks to prevent environmental, health  and safety  incidents and to protect the workplace, the community and the environment. These programs enable the brewery to prevent the occurrence, and minimize the consequences of significant releases of ammonia.\n\nIt is Anheuser-Buschs policy to conduct our business in accordance with all applicable EHS laws, regulations and permits and to promote a healthful, safe and protected environment.  Each employee is mandated to comply strictly with this policy; neither production goals nor financial objectives shall excuse noncompliance.  \n\nAlso, it is Anheuser-Buschs policy to assume a position of leadership in EHS management.  We are committed to the spirit as well as the letter of our EHS policy and promote, throughout the organization, responsibility and accountability for strict compliance with that policy.  Anheuser-Busch employees whose actions in the performance of their duties may affect the environment and/or public health are trained sufficiently to permit them to comply strictly with our EHS policy. \n\nIn conducting our businesses, we continue to seek and implement cost effective methods to reduce the EHS impact of our operations.  We integrate EHS considerations into our business planning and decision-making processes, including product research and development, packagi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9165,
      "SummaryText": "ng, and new manufacturing methods.  Our continuous EHS improvement goals  include pollution prevention and resource conservation.  We ask our contractors to adopt EHS standards, ethics, and policies similar to our own and we will give preference to suppliers who do so.\n\nWe encourage our employees, our customers and the public to share with us their EHS concerns.  We maintain dialogue with relevant authorities and local communities concerning EHS incident prevention and preparedness.\n\nAmmonia System\n\nAmmonia is used in the refrigeration system of the brewery.  As part of the brewing process, the beer is cooled to ensure its consistency, flavor and overall quality.  To ensure our beers maintain the many positive qualities that cold brewing imparts, we refrigerate our beers as part of the production process.  The beer packaged in kegs also is stored in a refrigerated area in our facility until its shipped.   Due to the hazards of ammonia, it is necessary to observe certain safety precautions in order to prevent unnecessary human and environmental exposure, both within the brewery and the surrounding community.\n\nWorst-Case Release\n\nAs required by the EPAs Risk  Management regulation, we have identified an extremely unlikely worst-case scenario in which piping to a high pressure receiver fails and releases 16,053 pounds of ammonia.  Under worst-case weather conditions, ammonia could travel 1.5 miles before dispersing enough to no longer pose a threat to the public.\n\nThis scenario is unlikely to occur for the following reasons: industry standards for the manufacture and quality control of piping and vessels; worst-case weather conditions are uncommon; ammonia is not corrosive in this service; pressure relief safety valves limit operating pressure; the ability to shut the system down through automatic and manual valves: the accident prevention program in place at the brewery (see description below); equipment replacement, when necessary; ammonia sensors to warn of leak"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9165,
      "SummaryText": "s; process upset warning system; and the emergency response plan and equipment in place at the brewery (see description below).\n\nAlternative Release\n\nAn alternative release scenario would be the opening of a pressure relief valve, itself a system safety device to relieve system pressure to avoid a more serious release.  The largest release from a pressure relief valve at any of our breweries in the past five years has been 400 pounds released in ten minutes.  Under common weather conditions, ammonia could travel 0.06 miles before dispersing enough to no longer pose a threat to the public.\n\nThis scenario is unlikely for the same reasons presented in the discussion above regarding the worst-case release.\n\nAccidental Release Prevention Program\n\nThe brewery has a comprehensive prevention program in place.  This program includes the following elements:\n    - process hazard analysis and review, including corrective action followup requirements;\n    - standard operating procedures for the system that all operators must follow;\n    - formal operator training;\n    - preventative maintenance to ensure mechanical integrity (inspection, testing, repair);\n    - procedures to ensure proper management of changes to the system;\n    - safety review prior to startup of new or modified equipment;\n    - audits of the PSM and RMP programs;\n    - incident investigations;\n    - employee involvement in risk reduction programs;\n    - contractor safety procedures;\n    - hot work permit requirements;\n    - process safety information; and\n    - emergency planning and response.\n\nThe brewery additionally complies with the requirements of the OSHA PSM standard (40 CFR 1910.119), the EPA RMP rules (40 CFR 68), and the ANSI/IIAR 2-1992 standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems.\n\nFive-Year Accident History\n \nThe brewery has had no releases that have caused offsite injuries, deaths, or property or environmental damage.  In fact, the brewery has never had releases with these impacts since "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9165,
      "SummaryText": "it began operation in 1954.\n\nEmergency Response Program\n\nThe brewerys emergency response program is based on OSHAs requirements for emergency action plans (29 CFR 1910.38) and HAZWOPER (29 CFR 1910.120).  We have trained employees for emergency response and maintain an Environmental/Safety Incident Plan (ESIP) which has been supplied to, and discussed with, the Los Angeles City Fire Department.  We conduct annual drills for implementation of the ESIP at the brewery. \n\nBrewery personnel notify local agencies when emergency response is needed.  Local agencies determine if the public needs to be notified.  If it is determined that the public needs to be notified, the local agencies perform the notification task.\n\nPlanned Changes to Improve Safety\n\nABIs Los Angeles Brewery ammonia refrigeration system is periodically modified to improve safety.  In 1998, the ammonia refrigeration pressure relief valves were all inspected and upgraded, when necessary."
    }
  ]
}