{
  "FacilityID": 9290,
  "FacilityName": "West Parish Filters",
  "FacilityStr1": "1515 Granville Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Westfield",
  "FacilityState": "MA",
  "FacilityZipCode": "01085",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25013",
  "LEPC": "Westfield LEPC",
  "FacilityLatDecDegs": "42.118056",
  "FacilityLongDecDegs": "-72.833333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "AM",
  "FacilityURL": "WWW.WATERANDSEWER.ORG",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Springfield Water & Sewer Commission",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Springfield Water&Sewer Commission",
  "OperatorStr1": "P. O. Box 995",
  "OperatorStr2": null,
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01101",
  "OperatorZipCodeExt": "0995",
  "FTE": 27,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000113209",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-09-02 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 42.11539,
  "FRS_Long": -72.83244,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11415,
      "AltID": "Disinfection",
      "FacilityID": 9290,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 12773,
          "ProcessID": 11415,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11688,
          "ProcessID": 11415,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 5461,
              "Process_NAICS_ID": 11688,
              "SafetyReviewDate": "1997-03-27 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute Standards",
              "FR_Comments": null,
              "HazardReviewDate": "1997-03-28 00:00:00",
              "ChangeCompletionDate": "1997-03-27 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": "ventilation system switched to manual",
              "OpProceduresReviewDate": "1999-06-01 00:00:00",
              "TrainingReviewDate": "1999-03-09 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-01 00:00:00",
              "EquipmentInspectionDate": "1999-06-01 00:00:00",
              "EquipmentTested": "O2 leak alarm system (monthly);  scott air packs(Annually);  O2 tank vacum regulators(bi-monthly);  chlorine detection systems (monthly)",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-06-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Chlorine",
              "_chemicals": [
                {
                  "PrimaryKey": 5659,
                  "PreventionProgram2ID": 5461,
                  "ProcessChemicalID": 12773
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9290,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-06-01 00:00:00",
    "ERTrainingDate": "1999-06-01 00:00:00",
    "CoordinatingAgencyName": "Westfield Fire Department",
    "CoordinatingAgencyPhone": "4135622329",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9290,
      "SummaryText": "A.  The Springfield Water and Sewer Commission has prepared this accident release prevention program in response to the Risk Management Plan Rule as promulgated by the U.S. Environmental Protection Agency (EPA).  The Commission has followed the procedures set forth in the rule and utilized guidance materials provided by EPA.  In addition, an emergency response plan relating to an accidental chlorine release at the West Parish Filters Drinking Water Treatment Plant outlines emergency response procedures at the plant and coordination with local emergency response services.\n\nB.  The stationary source this Risk Management Plan (RMP) applies to is the chlorination facility located at the West Parish Filters Drinking Water Treatment Plant in Westfield, Massachusetts.  The RMP regulated substance handled at this facility is chlorine which is used for primary disinfection of finished water, the sole source for all communities served by the Commission.  The chlorine building is comprised of two separate rooms:  (1)  a chlorine handling room containing one ton cylinders with vacuum regulators, scales electric hoist, chlorine gas sensor alarms, automatic switchover and manual ventilation system,  and  (2) a chlorination room housing three floor mounted gas regulators, ejectors, chlorine gas sensor alarms and feed water pipes.  A secure pad adjacent to the building provides space for additional inventory and empty cylinder storage.  During normal operations four cylinders are connected, two on line and two on stand-by.  Both rooms are equiped with alarmed chlorine gas sensors connected to the plant computer system in the main building.  The facility is staffed twenty-four (24) hours a day by a certified operator or night watchmen.\n\nC.  The offsite consequence analysis consists of two chlorine release scenarios, a \"worst case\" release and \"alternate case\" release scenario.  The worst case scenario is defined by EPA as that in which the maximum quantity of the largest vessel is r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9290,
      "SummaryText": "eleased as a gas in ten (10) minutes due to an unspecified failure.  The alternate case scenario is defined by EPA as more likely to occur than the worst case.  Calculations for both cases were taken from EPA's RMP Guidance for Waste Water Treatment Plants reference tables or equations.  In the worst case, it is assumed that a single one ton cylinder of liquid chlorine catastrophically fails releasing its entire 2,000 pounds of chlorine within a ten (10) minute time frame.  Using a wind speed of 1.5 meters per second (approximately 3 miles per hour) the distance to end point is 1.3 miles.  The estimated residential population affected by such a release would be approximately 1,403.  There are no public or environmental receptors within the given radius.  \n\nThe situation used for the alternate case scenario is a pipe leak (i.e., a hole or rupture of the 3/8\" transfer line from a one ton cylinder).  In this case, the contents of the cylinder would be released over a period of 133 minutes.  Using a wind speed of 3 meters per second (approximately 7 miles per hour), the distance to end point becomes 0.1 miles and affects an estimated population of two (2) persons.  Again, as in the worst case there are no public or environmental receptors within the given radius.  \n\nPassive mitigation relies on the building itself as enclosure to trap most of the escaping chlorine gas inside so that it does not reach the outside environment.  One active mitigation measure is the use of a water curtain which can be established by the local fire departments.  Both containment measures (entrapment and water curtain) are suitable for worst and alternate cases scenarios.  Another active mitigation measure is the use of the vacuum feed system itself.  Should any leak occur downstream of the vacuum regulator attached to the cylinder, the chlorine feed automatically shuts down preventing further leakage.\n\nD.  The general accident release program is comprised of several interrelated elements.  O"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9290,
      "SummaryText": "perators  receive a high level of training through on the job instruction, attendence of appropriate mandatory courses and seminars, and a mandatory certified on-site refresher course prsented by the facility's chlorine vendor each spring.  The chemical feed system was last updated in 1992 with the latest controls designed to simplify dosage control and to minimize accidental releases.  Operators follow a preventive maintenance program to avert sudden equipment breakdowns.  Written operating procedures are available to the operators.  The most recent hazard review of equipment was performed in March of 1997 and for safety procedures, the spring of 1999.  Chemical specific prevention steps is the availability of self contained breathing apparatus (SCBA) which are stored up wind of the prevailing wind direction at the main building.  A B-Kit is also available on site to patch and plug leaks.  Full face respirators are worn by facility personnel during cylinder change outs.  Training is conducted concerning the awareness of the hazardous properties of chlorine and for the chlorine sensor alarm systems which incorporate both audible and visual alarms at the storage site as well as the plant's main computer alarm system.\n\nE.  There have been no accidental releases of chlorine at the facility in the previous five years.\n\nF.  The treatment plant has an emergency response plan which provides both plant and community response personnel contact numbers.  The Westfield Fire Department provides annual site visits to review and update its emergency information.  The Westfield Local Planning Committee has been given a copy of this plan.  An exercise is planned to familarize facility and community personnel with emergency response issues.  Each spring the facility conducts annual refresher training in the use of SCBA and emergency response equipment and the emergency plan.\n\nG.  After the 1997 review only one change was recommended and implemented.  The ventilation system was switc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9290,
      "SummaryText": "hed from an automatic system to a manual system to ensure that a major leak would remain contained inside the building rather than be vented to the environment."
    }
  ]
}