{
  "FacilityID": 9347,
  "FacilityName": "Occidental Chemical Corp. Muscle Shoals Plant",
  "FacilityStr1": "1000 North Wilson Dam Road",
  "FacilityStr2": null,
  "FacilityCity": "Muscle Shoals",
  "FacilityState": "AL",
  "FacilityZipCode": "35661",
  "Facility4DigitZipExt": "1300",
  "FacilityCountyFIPS": "01033",
  "LEPC": "Colbert County LEPC",
  "FacilityLatDecDegs": "34.769861",
  "FacilityLongDecDegs": "-87.627278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I5",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4019642,
  "ParentCompanyName": "Occidental Petroleum Corp.",
  "Company2Name": null,
  "CompanyDUNS": 6908354,
  "Company2DUNS": 0,
  "OperatorName": "Occidental Chemical Corporation",
  "OperatorStr1": "1000 North Wilson Dam Road",
  "OperatorStr2": null,
  "OperatorCity": "Muscle Shoals",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35661",
  "OperatorZipCodeExt": "1300",
  "FTE": 161,
  "OtherEPAFacilityID": "ALD004019642",
  "EPAFacilityID": "100000115127",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Not Available",
  "SafetyInspectionDate": "1998-04-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2009-09-09 00:00:00",
  "DeRegistrationEffectiveDate": "2009-09-01 00:00:00",
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.77053,
  "FRS_Long": -87.63447,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11493,
      "AltID": null,
      "FacilityID": 9347,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 12857,
          "ProcessID": 11493,
          "ChemicalID": 62,
          "Quantity": 4770000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11767,
          "ProcessID": 11493,
          "NAICSCode": "325181",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5431,
              "Process_NAICS_ID": 11767,
              "SafetyReviewDate": "1999-04-01 00:00:00",
              "PHA_Date": "1998-11-16 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-01 00:00:00",
              "TrainingReviewDate": "1999-03-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Field Training, Electronic",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1997-12-22 00:00:00",
              "EquipmentInspectionDate": "1999-05-28 00:00:00",
              "EquipmentTested": "Chlorine Compressors and critical equipment",
              "ChangeMgmtDate": "1999-05-11 00:00:00",
              "ChangeMgmtReviewDate": "1999-04-01 00:00:00",
              "PreStartupReviewDate": "1999-05-11 00:00:00",
              "ComplianceAuditDate": "1999-04-19 00:00:00",
              "AuditCompletionDate": "1999-12-01 00:00:00",
              "IncidentInvestigationDate": "1998-11-03 00:00:00",
              "InvestigationChangeDate": "1998-11-03 00:00:00",
              "ParticipationPlansReviewDate": "1999-04-01 00:00:00",
              "HotWorkPermitReviewDate": "1998-12-28 00:00:00",
              "ContractorSafetyReviewDate": "1996-01-01 00:00:00",
              "ContractorSafetyEvalDate": "1998-01-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "We define the process as those portions of the plant that handle chlorine which includes the cells, Cl2 cooling and Drying, Liquefaction, Cl2 Storage and Loading, Third Stage refrigeration, EVS Scrubber, Cl2 Scrubbers, Brine Dechlorination, and waste water facility.  All the PHA information and prevention information herein applies to these defined plant areas.",
              "_chemicals": [
                {
                  "PrimaryKey": 6354,
                  "PreventionProgram3ID": 5431,
                  "ProcessChemicalID": 12857
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9347,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "1999-04-19 00:00:00",
    "ERTrainingDate": "1998-11-01 00:00:00",
    "CoordinatingAgencyName": "Colbert County EMA",
    "CoordinatingAgencyPhone": "2563899336",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "EPA 40 CFR Part 302.6, Part 355.30, OSHA 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9347,
      "SummaryText": "EXECUTIVE SUMMARY\nOccidental Chemical Corporation (OxyChem), a wholly owned subsidiary of Occidental Petroleum Corporation (OPC), owns and operates a chlor-alkali manufacturing facility in Muscle Shoals, AL. This facility is known as the Muscle Shoals Plant and is located at 1000 North Wilson Dam Road.  The chlor-alkali facility consists of a plant which manufactures chlorine, caustic potash and hydrogen and also facilities to store, load and ship chlorine.  The U.S. Army Corp. of Engineers built the facility in 1954 and it was purchased by Diamond Alkali Company in 1955.  The caustic potash plant, which is the largest in the world, began operation in 1958.  The potassium carbonate plant operation in 1965, expanded in 1972 and 1978, and is the largest of its kind in the world.  The facility became part of OxyChem through the acquisition of Diamond Shamrock Chemicals in 1986.  A potassium carbonate and potassium bicarbonate joint venture between Church & Dwight and Occidental Petroleum was established in 1986, creating Armand Products Co.  The facility employs 161 full time employees.\n\n1.  Accidental Release Prevention and Emergency Response Policies at the Stationary Source  (' 68.155(a)):\n\nOxyChem is committed to operating the Muscle Shoals plant in a manner that is safe for its workers, the public and the environment.  It is our policy to adhere to all applicable Federal, State and local rules and regulations, industry standards and best practices.  As part of this commitment, OxyChem has established a system to help ensure safe operation of the processes at this facility which includes the prevention of accidental releases of hazardous substances.  One component of this system is a risk management program (RMP) that helps manage the risks at the Muscle Shoals Plant and complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirement Risk Management Programs (the RMP rule) and OSHA"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9347,
      "SummaryText": " 1910.119.  This document is intended to satisfy the RMP plan requirement of the RMP rule and to provide the public with a description of the risk management program at the Muscle Shoals Plant.\n\nThe RMP at the Muscle Shoals Plant consists of the following three elements:\n \n7 A hazard assessment to help understand (a) the potential off-site consequences of hypothetical accidental releases and (b) accidents that have occurred during the last five years associated with the use of substances regulated by the RMP rule (regulated substances)\n \n7 A prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance (covered processes)\n\n7 An emergency response program to help respond to accidental releases of regulated substances from covered processes\n\nInformation further describing these elements is provided in this RMP Plan.\n\nAlthough the risk management program at the Muscle Shoals Plant helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety and environmental program at the Muscle Shoals Plant.  In fact, the Muscle Shoals Plant has a comprehensive safety and environmental program in place, establishing many levels of safeguards against release of a hazardous substance as well as injuries and damage from such a release.\n\nOxyChem's policy on the use of hazardous substances:  Before using a hazardous substance at the Muscle Shoals Plant, less hazardous alternatives are always considered.  When a hazardous substance is used at the Muscle Shoals Plant, OxyChem reviews the potential for an accidental release of this substance which could adversely affect plant workers, the public and the environment, and takes steps to prevent any such effects.  This is accomplished through the facility's Management of Change (MOC) and Process Hazard Review (PHR) procedures which are followed for all new installations or modifications of existing processes"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9347,
      "SummaryText": ".\n\nOxyChem strives to prevent accidental releases of the hazardous substances used at the facility:  OxyChem implements reasonable controls to prevent foreseeable releases of hazardous substances. When a hazardous substance is used at the Muscle Shoals Plant, the equipment is carefully designed, installed, operated and maintained to reduce the likelihood of an accidental release.  Industry and government standards are closely adhered to in the design, construction and operation of the equipment.  OxyChem also uses the Corporate Fire, Safety and Environmental (FS&E) Guidelines when designing new or modifying existing processes.  Each project is thoroughly reviewed before approval. In addition, OxyChem requires the documentation of standard operating procedures and training of affected employees with regard to these procedures as part of the MOC procedure. OxyChem's mechanical integrity program provides an ongoing process to verify the mechanical integrity of the equipment, piping and instruments to prevent the release of hazardous substances.\n\nOxyChem's goal is to minimize impacts from an accidental release:  In the event of an accidental release, the Muscle Shoals Plant controls and contains the release in a manner that will be safe for workers and will prevent impact to the public and the environment.  OxyChem utilizes emergency response plans as required by government regulation.  OxyChem trains its workers to respond to an accidental release, reducing the consequences of a release if it occurs.  The facility also maintains an active Chlorine Emergency Response Team which is on call 24 hours a day to respond to an accidental chlorine release.  OxyChem also has established a Special Situations Center in the Dallas corporate office to assist in all emergencies. In addition, OxyChem works with the local fire department and with the local emergency planning committee (LEPC) to help prevent injuries and/or environmental damage if a release does occur.  OxyChem has assi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9347,
      "SummaryText": "sted the LEPC in writing and implementing the Colbert County, Community Awareness and Emergency Response Plan (CAER).\n\nThe Muscle Shoals Plant's emergency response plan has been developed to meet the emergency planning, response and notification requirements of the Federal, OSHA, and EPA regulations.  This plan outlines the responsibilities and actions required to control an emergency that limits itself to within the Muscle Shoals Plant.  If the emergency extends beyond the plant boundaries and affects the surrounding communities, the Colbert County EMA is initiated by a call to 911 and a statement of the type of emergency.\n\nOxyChem is an active participant in the community:  OxyChem is an active participant in plant and community programs which promote education, safety and environmental awareness.  The facility has implemented a Voluntary Protection Program (VPP) in which employee participation at all levels is required in designing, implementing and maintaining safety programs.  Safety is a primary concern in our facility and is demonstrated by our selection by OSHA in September, 1996 as the first OSHA Star facility within North Alabama under OSHA's Voluntary Protection Program (VPP).\n\nOxyChem is an industry leader in the implementation of the Chemical Manufacturer's Association sponsored Responsible Care. Initiative. Through this outreach effort, as well as other community involvement, the plant stays abreast of community concerns and works to address them.\n\nIn order to effectively implement these policies, OxyChem established a management system headed by the Health, Environmental and Safety (HES) Departments to oversee safety and environmental-related activities. \n\n\n2.  The Stationary Source and Regulated Substances Handled (' 68.155(b) ):\n\nThe Muscle Shoals Plant handles only one regulated substance that is covered by the RMP rule, as shown in the following list of RMP-covered Program Level 3 processes at the plant.\n\n\nRegulated Substance-Chlorine, Process-Sto"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9347,
      "SummaryText": "rage Tanks, Largest Vessel Inventory*-180,000 lb., RMP Threshold-2,500 lb.\n\n\n\n* - Process and threshold quantity is the quantity of \"pure\" chemical, not of the solution\n\nChlorine is one of the major products made at this facility. The primary purpose of this facility is to manufacture, liquefy, store and ship chlorine, related alkaline co-products and hydrogen gas. The daily production of the liquid chlorine is collected in three (3) 90-ton chlorine storage tanks.  The chlorine from these tanks can be shipped to wholesale customers via 55-ton and 90-ton rail cars.  An additional 90-ton storage tank is maintained empty and under a vacuum condition at all times in the event that chlorine would need to be transferred from one of the three other tanks due to an emergency condition.  The facility complies with the Department of Transportation (DOT) regulations in the loading and shipment of the chlorine product.  \n\nOne ton containers of liquid chlorine are utilized within the facility's waste water treatment plant and chlorination of the facility's water influent from the Tennessee River.\n\n3.   The Worst-Case Release Scenario(s) and the Alternate Release Scenario(s), Including Administrative Controls and Mitigation Measures to Limit the Distances for Each Reported Scenario (' 68.155(c) ):\n\nThe Muscle Shoals Plant performed off-site consequence analysis to estimate the potential for accidental release of a regulated substance to affect the public or the environment.  The RMP rule requires the off-site consequence analysis to evaluate a \"worst-case release scenario \" and an \"alternative release scenario.\"  In reality, however, OxyChem does not expect a worst-case release scenario to ever occur.  The alternative release scenarios are developed to help the LEPC improve the community emergency response plan.  \n\nThe RMP*COMP (TM) system was used to calculate the distance to the toxic endpoint.  The meteorological data used for the modeling was the EPA default for the worst cas"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 9347,
      "SummaryText": "e and EPA suggested values for the alternative release scenario. The EPA recommended Landview program was utilized to estimate the number of people living within this distance from the location of the storage tank.  USGS maps were utilized to identify the public and environmental receptors located within this distance.\n\nThe following information summarizes the off-site consequence analysis performed by the Muscle Shoals Plant:\n\n3.1 Toxic Substances - Chlorine\n\nThe \"worst-case release scenario\" for chlorine is the failure of one of the 90-ton chlorine storage tanks which would release 180,000 pounds of liquid chlorine in a 10-minute period as mandated by EPA.  It is assumed that the liquid chlorine vaporizes within the 10-minute time period.  The worst case release scenario was evaluated using RMP*COMP (TM).  Under the EPA default worst weather conditions, the chlorine gas cloud would travel a distance of 14 miles before the concentration of chlorine was reduced to below 3 ppm (which is the 'endpoint' Emergency Response Planning Guideline value established in the RMP rule). The U.S. Census indicates that 85,249 people live within this distance from the car loading spot;  several public receptors are also located within this distance. Environmental receptors are located within this distance.\n\nThe \"alternative case release scenario\" is the failure of a 1-inch loading hose connected from the liquid chlorine tank car loading header to a rail car releasing 1,560 lbs of chlorine liquid in a 7.5-minute period.  The RMP*COMP (TM) , was used for alternative release scenarios to determine the off-site consequences.  Assuming a wind speed of 3 meters/sec, a D stability class and urban topography, the chlorine cloud would travel 0.3 miles before reaching a chlorine concentration of below 3 ppm (which is the endpoint Emergency Response Planning Guideline value established in the RMP rule).  The U.S. Census indicates that 53 people live within this distance from the car loading sp"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 9347,
      "SummaryText": "ot;  several public receptors are also located within this distance. Environmental receptors are not located within this distance.\n\n\n3.2 Program 3 Processes-Flammable Substances\n\nThere are no regulated flammable substances in quantities above the threshold quantities at the plant.  Propane and acetylene are stored on-site, however, the total quantity is less than the threshold quantity of 10,000 pounds.\n\n\n4.  The General Accidental Release Prevention Program and the Specific Prevention Steps (' 68.155(d) ):\n\nBeginning in 1994, the plant revised this prevention program for the chlorine manufacturing and storage processes to comply with the 14 elements of the OSHA Process Safety Management (PSM) prevention program.  In 1996, the EPA RMP rule established three levels of prevention requirements:\n\nProgram 3 is essentially the same as OSHA PSM, except that the program also focuses on protecting the public and the environment outside the plant's fenceline;\n\nThe following sections briefly describe the elements of the  Muscle Shoals Plant's Program 3 prevention program that address EPA's RMP rule prevention program requirements.\n\n4.1 Program 3 Prevention Program\n\nThe  Muscle Shoals Plant's Program 3 prevention program consists of the following 12 elements:\n\n4.1.1  Process Safety Information \nThe  Muscle Shoals Plant maintains technical documents which are used to help ensure safe operation of the plant processes. These documents address (1) physical properties of hazardous substances handled at the plant, (2) operating parameters of the equipment used at the plant and (3) design basis and configuration of the equipment at the plant.  OxyChem ensures that this process safety information is available to all employees. \n\nMaterial safety data sheets (MSDSs) document the physical properties of the hazardous materials handled at the plant, including regulated substances in covered processes. The information available for each hazardous substance typically includes:\n\n7 Toxicity inf"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 9347,
      "SummaryText": "ormation and permissible exposure limits \n7 Physical data (e.g., boiling point, melting point, flash point) \n7 Reactivity and corrosivity data \n7 Thermal and chemical stability data \n7 Hazards of mixing substances in the process\n\nMSDSs for hazardous substances handled in each process are available from the plant's Safety Department. Copies of the MSDSs for the hazardous substances within each operating area of the plant are maintained in that area's control room so that the technicians have ready reference to this information.  In addition, key MSDSs are provided to the LEPC upon request for use in helping formulate emergency response plans.\n\nThe engineering design documents include the operating parameters and the design basis and the  configuration of the equipment in each covered process.  The available information includes:\n\n7 Operating parameters\n7 Process flow diagrams\n7 Process chemistry\n7 Maximum intended inventories\n7 Safe upper and lower limits for parameters such as temperature, pressure, or flow\n7 Design basis and configuration of equipment\n7 Piping and instrumentation diagrams, including materials of construction\n7 Electrical classification\n7 Safety systems\n7 Applicable design codes and standards\n7 Design basis for relief and ventilation systems\n\n\nOperating manuals contain the process chemistry, overview of the process operations, process variables with consequences of deviations, equipment and instruments descriptions, troubleshooting guidelines, start-up and shut down procedures and equipment operating procedures. \n\nThese documents are used to (1) train employees, (2) perform process hazards analyses and (3) help maintain the equipment.\n\n4.1.2 Process Hazard Analysis\nThe  Muscle Shoals Plant performs and updates, within every 5 years as required by OSHA, process hazard analyses (PHAs) of the covered process to help identify process hazards and generate recommendations that might improve the safe operation of the process.  A team composed of personnel "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 9347,
      "SummaryText": "with engineering and process operating experience and a leader with process hazard analysis experience is assembled to analyze the hazards of the process.  The plant primarily uses the \"HAZOP\" technique to perform this analysis.  The PHA team prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility to resolve the recommendations is assigned to plant personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\n4.1.3 Operating Procedures\nMuscle Shoals Plant process engineers, technicians and team leaders work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and process upsets.  Operating procedures include:\n\n7 Steps for safely conducting activities \n7 Applicable process safety information, such as safe operating limits and consequences of process deviations\n7 Safety and health considerations, such as chemical hazards, personal protective equipment requirements and actions to take if exposure to a hazardous substance occurs\n\nPlant personnel develop and maintain operating procedures that cover all phases of operations, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown and temporary operations.  The operating procedures are used both to help in operating the plant's processes and as a training guide.\n\n4.1.4 Training\nThe Muscle Shoals Plant trains its workers to safely and effectively perform their assigned tasks.  The training program includes both initial and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substances in the process and (3) a detailed review of the process operating procedures and sa"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 9347,
      "SummaryText": "fe work practices.  Oral reviews and written tests are used to verify that an employee understands the training material before the employee can resume work in the process.  The employees are consulted annually at safety meetings to evaluate the effectiveness and frequency of the training.  Recommendations from the employees are reviewed and changes to the training program are implemented as appropriate.\n\n4.1.5 Mechanical Integrity\nThe Muscle Shoals Plant maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public or the environment.  The mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meets the design standards required for service in the plant's processes.  The mechanical integrity program includes:\n\n7 Specifications for inspection and testing of process equipment \n7 Specifications for replacement parts and equipment \n7 Procedures for inspecting, testing and maintaining process equipment \n7 Procedures for safe work practices such as Lock, Tag and Try; Hot Work; Confined Space Entry; and Line Breaking\n7 Training of maintenance personnel \n7 Documentation of maintenance activities\n\n4.1.6 Management of Change\nThe Muscle Shoals Plant Management of Change program evaluates and approves all proposed changes to chemicals, equipment and procedures for a covered process to help ensure that the change does not negatively affect safe operations.  Process changes that are determined to be a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a management of change.  All other changes must be confirmed through the management of change program to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 9347,
      "SummaryText": " safety information and procedures are updated, and affected employees are notified of the changes.\n\n4.1.7 Pre-startup Review\nThe Muscle Shoals Plant performs a safety review through our MOC procedures of a new or modified process before the process is placed into service to help ensure that the process has been prepared to operate safely.  This review confirms that:\n\n7 Construction and equipment are in accordance with design specifications\n7 Adequate safety, operating, maintenance and emergency procedures are in place\n7 Employee training has been completed \n7 For a covered process, a PHA has been performed if the process is new or management of change requirements have been completed if an existing process has been modified\n\nThe Management of Change Pre-start up Safety Review check list will be completed during the MOC walk through for new processes, major modifications and/or start up of existing processes that have been shut down for more than 6 months.\n\n4.1.8 Compliance Audit\nThe Muscle Shoals Plant audits covered processes every 3 years to be certain that the prevention program is effectively addressing the safety issues of operations at the plant.  The plant assembles an audit team that includes personnel knowledgeable in the RMP rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations are resolved and appropriate enhancements to the prevention program are implemented.\n\nBoth Occidental Petroleum Corporation and Occidental Chemical Corporation perform audits of the facility programs, process and documentation at regular intervals.  The facility is required to develop an action plan to resolve all action items within a timely manner.\n\n4.1.9 Incident Investigation\nThe Muscle Shoals Plant investigates incidents, including near misses, that could rea"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 9347,
      "SummaryText": "sonably have resulted in a serious injury to personnel, the public or the environment so that similar incidents can be prevented in the future.  The plant trains employees to identify and report any incident requiring investigation.  An investigation team is assembled, and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved and appropriate process enhancements are implemented.\n\nOxyChem has a formal program including training for incident investigations and the report generation.\n\n4.1.10 Employee Participation\nThe Muscle Shoals Plant developed a written employee participation program for all covered processes to help ensure that the safety concerns of the plant's workers are addressed.  The plant encourages active participation of personnel in the prevention program activities of all processes at the plant.  Employees are consulted on, and informed about, all aspects of the RMP rule prevention program, including PHAs, MOCs and operating procedures.\n\n4.1.11 Hot Work Permits\nThe Muscle Shoals Plant established a hot work permit program to control spark or flame- producing activities that could result in fires or explosions in covered processes at the plant.  The plant reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit Form to comply with these requirements.  Personnel who are to perform hot work are required to fill out the Hot Work Permit Form.  The Area Team Leader reviews the completed form before work can begin.  Training in the use of the Hot Work Permit Form is included in the plant's safe work practices orientation.\n\n4.1.12 Contractors\nThe Muscle Shoals Plant established a program to help ensure that contractor activities at the plant are performed in a safe manner.  The program reviews the safety record of all contractors to help ensure that the plant only hires contractors who can safely perform the desired job"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 9347,
      "SummaryText": " tasks.  The plant explains to the contract supervisors the hazards of the process on which they and their employees will work, the plant's safe work practices, and the plant's emergency response procedures.  The plant requires that the contractor supervisors train each of their employees who will work at the plant before that worker begins work at the plant site.  The plant periodically reviews contractors' training documents to help ensure that safe practices are followed.\n\n\n5   Five-year Accident History (' 68.155(e) ):\n\nThe Muscle Shoals Plant can proudly report zero for the five-year accident history.  The plant has not experienced any accidents that fall into the EPA's RMP requirements for a five-year accident history.\n\n6.  The emergency response program (' 68.155(f) ).\n\nThe Muscle Shoals Plant has established a written emergency response plan and maintains an emergency response team trained in these emergency response procedures.  All plant personnel are trained in evacuation procedures. The written emergency response plan complies with the following federal and state contingency plan regulations:\n\n7 OSHA 29 CFR 1910.38(a) - Employee Emergency Action Plans\n7 OSHA 29 CFR 1910.119 (n) - Process Safety Management of Highly Hazardous Chemicals\n7 OSHA 29 CFR 1910.120(p) and (q) -  Hazardous Waste Operations and Emergency Response (HazWOPER)\n7 OSHA 29 CFR 1910, Subpart L - Fire Protection\n7 EPA 40 CFR 302.6 - Notification Requirements\n7 EPA 40 CFR 355.30 - Facility Coordinator and Emergency Response Plan\n7 EPA 40 CFR 355.40 - Emergency Planning and Release Notifications\n7 EPA 40 CFR 112 - Spill Prevention, Control and Countermeasures Plan\n7 EPA 40 CFR 68 - Risk Management Programs for Chemical Accidental Release Prevention                                                                                                                                                          \n\nThe Muscle Shoals Plant has a Chemical Emergency Response Program Team (CERP) available 24 "
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 9347,
      "SummaryText": "hours per day to respond to in plant chemical emergencies. The plant's CERP team serves as the Region 20 CHLOREP Regional Response Team for the Tennessee Valley and responds to chlorine emergencies within this region. The team maintains a  mobile chemical emergency command center equipped with the necessary equipment to respond to chlorine emergencies.\n\nThe Muscle Shoals Plant uses a SAFER Real Time modeling program to assess release impacts if any and to aid in the determination of response activity.  The Muscle Shoals Plant has developed a Special Situations Plan which is a program designed for responding to emergencies that may have impacts beyond the immediate plant and is a supplement to the Emergency Response Plan.  The Special Situation Plan links the local response to the OxyChem Corporate Emergency Response Center located in Dallas, Texas which can then provide assistance as needed.\n\nThe facility is a member of the Colbert County LEPC committee, whose membership includes:\n7 City of Muscle Shoals\n7 Muscle Shoals City Fire Department\n7 Muscle Shoals City Police\n7 Colbert County Emergency Management Agency\n7 Alabama State Police\n7 State Division of Public Health\n7 Department of Natural Resources and Environmental Control\n7 Colbert County Emergency Medical Services Council\n7 Industrial Representatives from the Muscle Shoals City Industrial Complex\n\nThe LEPC committee meets every two months and conducts annual training exercises of the emergency response plan. The Muscle Shoals Plant's emergency response plan has been communicated to the Colbert County Local Emergency Planning Committee.\n\n7.  Planned Changes to Improve Safety (' 68.155(g) ).\n\nThe Muscle Shoals Plant constantly tries to improve the safety of the processes through annual reviews of our plant procedures, near miss and incident investigation programs, and a program soliciting safety and environmental suggestions from the plant employees.\n\n8.  Certification\n\nThe Risk Management Plan for the Occidenta"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 9347,
      "SummaryText": "l Chemical Corporation, Muscle Shoals Plant in Muscle Shoals, Alabama, is presented in this diskette.\n\nTo the best of my knowledge, information, and belief formed after reasonable inquiry, the information submitted in this RMP Plan is true, accurate, and complete.\n\nSignature:  Candace Jaunzemis* Date Signed: June 15, 1999\n\nTitle: Plant Manager\n\n* The Certification with orginal signature is presented in the attached cover letter."
    }
  ]
}