{
  "FacilityID": 9353,
  "FacilityName": "Ulysses Truck Station",
  "FacilityStr1": "5 miles W. of Ulysses on Hwy 160,",
  "FacilityStr2": "9/10 Mile S. on E. side of Road",
  "FacilityCity": "Ulysses",
  "FacilityState": "KS",
  "FacilityZipCode": "67880",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20067",
  "LEPC": "Grant County LEPC",
  "FacilityLatDecDegs": "37.563333",
  "FacilityLongDecDegs": "-101.488611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Koch Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": null,
  "OperatorName": "Koch Hydrocarbon Company",
  "OperatorStr1": "4111 E. 37th St. North",
  "OperatorStr2": null,
  "OperatorCity": "Wichita",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67220",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000115396",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-06-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2011-01-21 00:00:00",
  "DeRegistrationEffectiveDate": "2010-12-16 00:00:00",
  "AnniversaryDate": "2004-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.56348,
  "FRS_Long": -101.48996,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": null,
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11502,
      "AltID": "Gas Fractionation",
      "FacilityID": 9353,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 12866,
          "ProcessID": 11502,
          "ChemicalID": 155,
          "Quantity": 340000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1847,
              "ProcessChemicalID": 12866,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1848,
              "ProcessChemicalID": 12866,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1849,
              "ProcessChemicalID": 12866,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1850,
              "ProcessChemicalID": 12866,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1851,
              "ProcessChemicalID": 12866,
              "ChemicalID": 94
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11778,
          "ProcessID": 11502,
          "NAICSCode": "48699",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 5494,
              "Process_NAICS_ID": 11778,
              "SafetyReviewDate": "1999-05-20 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "40 CFR Part 195; API 1104",
              "FR_Comments": null,
              "HazardReviewDate": "1999-05-20 00:00:00",
              "ChangeCompletionDate": "1999-08-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-21 00:00:00",
              "TrainingReviewDate": "1999-06-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-21 00:00:00",
              "EquipmentInspectionDate": "1999-04-20 00:00:00",
              "EquipmentTested": "Instrumentation",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-04-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5693,
                  "PreventionProgram2ID": 5494,
                  "ProcessChemicalID": 12866
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9353,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-21 00:00:00",
    "ERTrainingDate": "1999-05-20 00:00:00",
    "CoordinatingAgencyName": "City of Ulysses Fire Dept.",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9353,
      "SummaryText": "KOCH HYDROCARBON COMPANY\n\nUlysses Truck Station\nUlysses, Kansas\n\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\n\n\nIntroduction and Policies\n\nUnder the Koch Environmental Excellence Program (KEEP) at Koch Industries, Inc., we are committed to being associated with unmatched environmental performance as measured by our employees, customers, regulators, and the public.  Our KEEP management philosophy goals are achieved by the personal commitments of our employees and contractors, and by open communication with our employees, customers, neighbors, and with regulators. The accidental release prevention and emergency response programs we have at our facilities are part of the high standards we strive for through KEEP.  Our high standards are achieved by operating in compliance with all required environmental permits and regulations, by operating and maintaining our assets in such a manner that any unpermitted release will be unintentional and acknowledged as unacceptable, by remedying any shortcomings found during regular audits of our facilities, and by reporting promptly to regulators any shortcomings found during the course of our audits as required by law.\n\nThe Ulysses Truck Station is one of many facilities operated Koch Hydrocarbon Company (Koch).  At the facility, we receive demethanized product via trucks and inject it into a pipeline to be sent out to our Gas Liquids Fractionators for further processing.  There are two 30,000 gallon storage bullets at the facility which contain the demethanized product.  This demethanized product is the only flammable substance at the facility that is regulated under the Risk Management Program (RMP).  There are no RMP-covered toxic substances present at the facility in amounts greater than threshold quantity.  The facility is classified as Program Level 3 under the regulation.    The purpose of this Risk Management Plan (RMPlan) is to provide information about our operations at the facility, our programs to prevent a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9353,
      "SummaryText": "ccidental chemical releases, our emergency response plans in case an accidental release should occur, our 5-year accident history, and our planned changes to improve safety at the facility.\n\n Worst Case and Alternative Release Scenarios\n\nAs specified by the U. S. Environmental Protection Agency (EPA) RMP Regulations, our worst case release scenario for flammables would be the loss of all of the flammable mixture in our largest vessel causing a vapor cloud explosion.  In the case of the Ulysses Truck Station, this would involve our 30,000-gallon storage bullet.  Such a scenario is highly unlikely, however, using the EPA Offsite Consequence Analysis (OCA) methods, the distance that the resulting vapor cloud explosion could cause an overpressure of 1 psi would be approximately 0.5 miles (approximately 2,600 feet).  An overpressure of 1 psi is EPA's threshold for measurable impacts.  Although we have numerous controls to prevent such releases (high level alarms, emergency shutdown, etc.) and to manage their consequences, no credit for any controls or mitigation measures was taken into account when evaluating this scenario.  \n\nThe alternative release scenario characterized as a more likely scenario that would involve offsite consequences is calculated to reach approximately 0.3 miles (approximately 1,600 feet) from the release point.  This distance calculation is also based on the EPA OCA methods, which are known to overpredict the impact of any potential release from such a scenario.  We have selected the alternative release scenario based on a release from our product storage bullet due to the relief valve on the vessel sticking open.  We have several mitigation measures in place to greatly reduce the chance that such an event could ever occur.  These measures include the following:  1) We installed interlocks that will close the inlet valve to the bullet if the level gets too high; 2) We conduct regular inspections of all equipment at our facility;  2) We keep the ope"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9353,
      "SummaryText": "t having resulting in onsite or offsite impacts from a hydrocarbon release has occurred at the Ulysses Truck Station within the last five years.  Although we take pride in that record, we also place daily emphasis on our prevention and safety programs to ensure this record continues.\n \n \n Emergency Response Program\n \n We will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the Ulysses Truck Station with the Ulysses Fire Department.  Also involved in emergency response for the facility would be the Grant County Sheriff and the Kansas Department of Public Safety.  The Ulysses Truck Station Facility Manager is responsible for coordinating all emergency actions.  A specific Emergency Response Plan for the facility is in place and that plan has been coordinated with local officials, along with evacuation procedures, regular drilling, and training.  Our Emergency Response Program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n \n \n Planned Changes to Improve Safety\n \n Diligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at the Ulysses Truck Station.  Some of the key components of the safety improvements we expect to achieve are as follows:\n \n7 The Management of Change provisions ensures that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.\n7 The Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\n7 The Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9353,
      "SummaryText": "program.\n7 Internal and third party compliance audits will ensure we maintain and increase our level of safety protection.\n7 An ongoing dialogue with the Grant County Emergency Management Director or his designate will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops.  In this way, we shall bolster our strong commitment to the safety of our workers and the community.\n\nWe encourage all interested citizens or community organizations to contact the Grant County Emergency Management Director for the latest information on emergency response for the county.  We plan to diligently integrate our response capabilities and personnel with those of the county on an ongoing basis."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9353,
      "SummaryText": "rating pressure of the vessel (less than 200 psig) at well below the set pressure of the relief valve (250 psig);  3) We continuously monitor the level in the bullets from our Wichita control room which is manned 24 hours per day; 4) We have a manual emergency shutdown system to shutdown all product movement in case of emergencies. The presence of these mitigation measures serves to either prevent this scenario from occurring or minimize its impact if it does occur.\n\nWe have discussed these potential hydrocarbon releases with our employees and with local emergency response officials in Grant County, thereby further reducing the possibility of any impact on the public.   \n\n\nPrevention Program\n\nThe Ulysses Truck Station has been operating under the strict guidelines of the Department of Transportation Regulations 49 CFR Part 195 since 1992.  Our ongoing analysis of the potential hazards of our process, detailed training of our employees, and constant emphasis on safety have helped us avoid any serious accidents over the last 5 years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the additional prevention features implemented at this facility include:\n\n7 Gas detectors have been installed at the facility, which will alarm in Wichita and shutdown pipeline delivery and truck unloading.\n \n7 Manual emergency shutdown (ESD) buttons have been installed at the facility in order to shutdown the entire facility during emergency situations.\n \n7 Fire eyes have been installed which will alarm Wichita of a fire at the facility.\n \n7 High pressure in the pipeline will automatically shut down the truck station\n \n7 Interlocks on the bullets will close the inlet valve to the bullet if the level in the bullet gets too high.\n \n These safeguards as well as the vigilance of our trained employees have helped us operate safely at this facility for many years.\n \n \n Five Year Accident History\n \n No inciden"
    }
  ]
}