{
  "FacilityID": 9469,
  "FacilityName": "East Plant/Pilgrim's Pride Corporation",
  "FacilityStr1": "1030 South Pilgrim's Street",
  "FacilityStr2": null,
  "FacilityCity": "Mt. Pleasant",
  "FacilityState": "TX",
  "FacilityZipCode": "75456",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48449",
  "LEPC": "Titus County LEPC",
  "FacilityLatDecDegs": "33.215889",
  "FacilityLongDecDegs": "-94.950306",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7334170,
  "ParentCompanyName": "Pilgrim's Pride Corporation",
  "Company2Name": null,
  "CompanyDUNS": 7334170,
  "Company2DUNS": null,
  "OperatorName": "Lonnie A. Pilgrim",
  "OperatorStr1": "110 S. Texas Street",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75686",
  "OperatorZipCodeExt": null,
  "FTE": 295,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000116073",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-10-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 33.148273,
  "FRS_Long": -94.982843,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11643,
      "AltID": "ammonia refrigeration",
      "FacilityID": 9469,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 13134,
          "ProcessID": 11643,
          "ChemicalID": 56,
          "Quantity": 16500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 11921,
          "ProcessID": 11643,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5490,
              "Process_NAICS_ID": 11921,
              "SafetyReviewDate": "1999-01-08 00:00:00",
              "PHA_Date": "1998-03-28 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "1998-03-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-01-08 00:00:00",
              "TrainingReviewDate": "1999-01-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-01-08 00:00:00",
              "EquipmentInspectionDate": "1999-05-24 00:00:00",
              "EquipmentTested": "evaporative units",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "1999-01-08 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "1999-06-04 00:00:00",
              "AuditCompletionDate": "1999-12-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-01-08 00:00:00",
              "HotWorkPermitReviewDate": "1999-01-08 00:00:00",
              "ContractorSafetyReviewDate": "1999-01-08 00:00:00",
              "ContractorSafetyEvalDate": "1999-01-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 6526,
                  "PreventionProgram3ID": 5490,
                  "ProcessChemicalID": 13134
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9469,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1998-06-01 00:00:00",
    "ERTrainingDate": "1998-06-01 00:00:00",
    "CoordinatingAgencyName": "Mt. Pleasant Fire Dept.",
    "CoordinatingAgencyPhone": "9035754167",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9469,
      "SummaryText": "General Executive Summary for Chemical, Manufacturing and Oil Refining Facilities\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nWe at East Plant/Pilgrim's Pride Corporation are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are completely coordinated with Mt. Pleasant Fire Department which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass POULTRY PROCESSING.  We have 1 regulated substance present at our facility.  This substance is Ammonia and is used for Poultry Processing.  \n\nThe maximum inventory of Ammonia at our facility is 16500.00 lbs..\n\n\n3.\tThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\nTo perform the required offsite consequence analysis for our facility, we have used the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from ammonia refrigeration.  The scenario involves the release of 16500 lb. of Ammonia in a gaseous form over 10 minutes.  Under worst case weather conditions, namely Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 1.63 miles is obtained corresponding"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9469,
      "SummaryText": "to a toxic endpoint of 0.14 mg/L.\n\nOne alternative release scenario has been submitted for each toxic substance present in Program 2 and Program 3 processes cumulatively.  \n\nThe alternative release scenario for Ammonia involves a release from ammonia refrigeration system in the ammonia refrigeration process.  The scenario involves the release of 100.00 lb. of Ammonia in a gaseous form over 10 minutes.  Passive mitigation controls such as enclosures are taken into account to calculate the scenario.  The release is also assumed to be controlled by active mitigation measures that include sprinkler system(s) and emergency shutdown systems.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.14 mg/L is 0.03 miles.\n\n\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition).  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.\n\nThe following sections briefly describe the elements of our release prevention program that are in place at our stationary source.\n\nProcess Safety Information\nEast Plant/Pilgrim's Pride Corporation maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is     (What If/Checklist)    .  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of (3 years).  Any findings related"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9469,
      "SummaryText": "to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, East Plant/Pilgrim's Pride Corporation maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\nTraining\nEast Plant/Pilgrim's Pride Corporation has a comprehensive training program in place to ensure that employees that are operating processes are completely competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every     (3)     years and more frequently as needed.\n\nMechanical Integrity\nEast Plant/Pilgrim's Pride Corporation carries out highly documented maintenance checks on process equipment to ensure proper functions.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at East Plant/Pilgrim's Pride Corporation to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9469,
      "SummaryText": "aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at East Plant/Pilgrim's Pride Corporation.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nEast Plant/Pilgrim's Pride Corporation conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nEast Plant/Pilgrim's Pride Corporation promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nEast Plant/Pilgrim's Pride Corporation truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation to the RMP rule in particular information resulting from process hazard analyses.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  East Plant/Pilgrim's Pride Corporation has a strict policy of informing the contractors of known po"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9469,
      "SummaryText": "tential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.\tFive-year Accident History\nEast Plant/Pilgrim's Pride Corporation has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n6.\tEmergency Response Plan\nEast Plant/Pilgrim's Pride Corporation carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.\tY2K COMPLIANCE\nOur Facility is Y2K Compliant."
    }
  ]
}