{
  "FacilityID": 9592,
  "FacilityName": "AGRIFROZEN FOODS - PLANT 2",
  "FacilityStr1": "1460 SUNNYVIEW RD. NE",
  "FacilityStr2": null,
  "FacilityCity": "SALEM",
  "FacilityState": "OR",
  "FacilityZipCode": "97303",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41047",
  "LEPC": "STATE OF OREGON",
  "FacilityLatDecDegs": "44.954639",
  "FacilityLongDecDegs": "-123.01575",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "PRO-FAC COOPERATIVE, INC.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "AGRIFROZEN FOODS",
  "OperatorStr1": "P.O. 7106",
  "OperatorStr2": null,
  "OperatorCity": "SALEM",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97303",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": "ORD135527539",
  "EPAFacilityID": "100000116199",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1996-09-10 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2000-05-15 00:00:00",
  "DeRegistrationEffectiveDate": "2000-05-10 00:00:00",
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 44.955684,
  "FRS_Long": -123.013683,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11863,
      "AltID": "REFRIGERATION",
      "FacilityID": 9592,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 13448,
          "ProcessID": 11863,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 12147,
          "ProcessID": 11863,
          "NAICSCode": "31141",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 5646,
              "Process_NAICS_ID": 12147,
              "SafetyReviewDate": "1999-02-15 00:00:00",
              "PHA_Date": "1998-11-09 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2000-01-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "HANDHELD DETECTORS",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-02-15 00:00:00",
              "TrainingReviewDate": "1999-05-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-02-15 00:00:00",
              "EquipmentInspectionDate": "1999-06-10 00:00:00",
              "EquipmentTested": "PRESSURE RELIEF VALVES",
              "ChangeMgmtDate": "1998-07-28 00:00:00",
              "ChangeMgmtReviewDate": "1998-07-28 00:00:00",
              "PreStartupReviewDate": "1999-05-27 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "1999-06-15 00:00:00",
              "HotWorkPermitReviewDate": "1999-06-15 00:00:00",
              "ContractorSafetyReviewDate": "1999-04-30 00:00:00",
              "ContractorSafetyEvalDate": "1999-06-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 6715,
                  "PreventionProgram3ID": 5646,
                  "ProcessChemicalID": 13448
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9592,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-03-23 00:00:00",
    "ERTrainingDate": "1997-06-01 00:00:00",
    "CoordinatingAgencyName": "SALEM FIRE DEPT.",
    "CoordinatingAgencyPhone": "5035886081",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9592,
      "SummaryText": "AGRIFROZEN FOODS, PLANT NO. 2\nRISK MANAGEMENT PLAN\nEXECUTIVE SUMMARY\nIntroduction\nAgriFrozen Foods is a cooperative owned, Willamette Valley based, vegetable processor with plants located in both Oregon and Washington.  AgriFrozen Foods, Plant No. 2, located in East Salem, Oregon, processes fresh vegetables from our growers into frozen vegetables for human consumption. Anhydrous ammonia, used as a refrigerant in the freezing process, is located at this facility and is an invaluable component in our vegetable processing.  AgriFrozen Foods is aware anhydrous ammonia requires certain safe handling precautions to prevent unnecessary human and environmental exposure reducing the threat to our employee's health as well as the health of our neighbors and the community. \nRegulatory Background\nOSHA's Process Safety Management (PSM) regulations are defined by OSHA 29 CFR 1910.119. EPA's Risk Management Program (RMP) is defined in Section 112R of the Clean Water Act (40 CFR 68). These regulations establish the requirements of both the PSM and RMP programs for facilities that are either specifically designated by the rules or for facilities that possess certain chemicals in excess of threshold quantities. Ammonia is the chemical used at this facility in quantities that trigger the RMP requirements. The RMProgram further assigns various program levels to facilities with specific Standard Industry Codes (SIC's). Frozen vegetable processors are designated as Program level 3 facilities because they are identified as SIC 2037 industries.\nUnder these regulations, facilities are required to develop a complex multi-element safety program for related systems and plant operations as well as, under the RMP rules, an analysis of the off-site consequences that could result from a catastrophic release.  \nMajor tasks defined in these regulations address the following areas:\n1. Employee Participation\t9. Process Hazard Analysis\n2. Process Safety Information\t10. Hot Work Permits\n3. Mechanical In"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9592,
      "SummaryText": "away from normal traffic areas and safeguards such as operating guidelines, maintenance, policies, and procedures. In accordance with the RMP rules, worst-case scenarios are based on a fixed set of weather factors that would accentuate the distance a chemical plume would travel. Based on historical weather data, actual weather conditions for this area would likely decrease the extent of the endpoint of this chemical from the reported table-top exercise.\nAlternate Scenario: The required release determined for the alternate, more likely to occur, scenario would involve a release of ammonia from one of the system's pressure relief valves, resulting in a significantly smaller release than the worst case. This release scenario, while not frequent, has occurred in the past and was felt more likely to occur in the future than the worst-case. It was assumed that the relief valves in question would also be located on one of the high pressure receivers. In reality, based on previous incidents, this release would most likely be contained on-site and/or not affect anything off-site. As part of the facility's maintenance guidelines, the plant has a valve maintenance program that would further decrease the likelihood of a significant release.\nAccident Prevention & Emergency Response Policies\nThe safety of our employees and our neighbors depends on the manner in which our employees handle our chemicals as well as our standard operating and maintenance guidelines and the safeguards we utilize at our facilities. AgriFrozen Foods practices and adheres to state and federal safety regulations including, confined space, lockout/tagout, hot work permits, safe chemical handling, and emergency response programs. Contractors are also required to adhere to these rules and regulations.\nAll employees are informed of the chemicals used at the facilities and any risks that may be associated with those chemicals. Material Safety Data Sheets are available to every employee if there is any questio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9592,
      "SummaryText": "tegrity\t11. Employee Training\n4. Contractor Safety\t12. Emergency Response Plans\n5. Operating Guidelines\t13. Compliance Audits\n6. Pre-start Up Safety Review\t14. Risk Management Plan\n7. Management of Change\t15. Off-Site Consequence Analysis\n8. Incident Investigation\t16. Trade Secrets\n\nFacility Background\nAgripac Inc, a vegetable processing cooperative, started business in 1971 with the consolidation of two grower cooperatives known as Blue Lake Packers and the Eugene Fruit Growers Association. Plant No. 2 began construction as a vegetable processing facility in the 1945, as part of the Kelly Farquhar Company, and became part of the Agripac Cooperative in 1980. The Agripac Cooperative was then sold and became AgriFrozen Foods in February 1999. Over the life of this plant, it has been continually improved, expanded, and key systems have been replaced or rebuilt. \nFacility Siting and Human Factors\nAgriFrozen Foods Plant No. 2, is located in an industrial zone in northeast Salem, Oregon about one mile east of the Willamette River. The single plant building covers about 106,000 square feet on 8.2 acres of property. The plant building has been expanded over the years and houses vegetable processing equipment, two compressor rooms, five freeze tunnels and a cold storage. The property, although within two blocks of residential areas, is bordered by industrial and commercial properties on all sides. Several factors, including facility siting and human factors, were considered during the preparation of the facility's Process Hazard Analyses and the Offsite Consequence reviews.\nChemicals and Processes\nAgriFrozen Foods Plant No. 2 uses anhydrous ammonia as the refrigerant to operate the refrigeration components and has approximately 18,995 total pounds of ammonia in the system. The system includes: two engine rooms that house compressors and controls, and condensers; high pressure receivers, located outside the building, evaporators, low pressure receivers, a cold storage room, f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9592,
      "SummaryText": "ive freeze tunnels, located in process areas, and necessary interconnecting piping within the system. Actual in stock quantities of ammonia may vary with process usage and restocking schedules.\nOff-Site Consequence Analysis\nQualified facilities must conduct multiple offsite consequence analyses (OCA's) and report, to the government and to the public, the potential consequences of the accidental release scenarios studied. A typical OCA consists of two elements; a worst-case release scenario and an alternate release scenario. The EPA has defined a worst-case release as the rapid release of the largest quantity of a regulated substance, from a single point, that could result in the greatest distance to an endpoint during weather conditions most apt to augment the plume distance. An alternate scenario is defined as a release that also reaches an endpoint offsite but is more likely to occur than the worst-case scenario. A chemical's endpoint is defined as the distance a chemical cloud could travel before dissipating to the point that serious injuries from short-term exposures should no longer occur. The distances to the various endpoints may be determined using sophisticated computer models or from the more conservative lookup tables provided by the EPA. Scenarios for this facility were determined using the EPA's lookup tables and are likely to reach further than those provided by a computer simulation.\nWorst-Case Scenario: While it is not believed that a release of the magnitude required by the RMProgram criteria would likely occur, AgriFrozen Foods Plant No. 2 has chosen to assume their worst case scenarios would be a rapid release of the entire contents of the Plant's refrigeration system. We have assumed this would result from the major breaching of one of the plant's interconnected high pressure receivers (HPR's) such as might occur from mechanical impact and damage. Factors limiting the potential for this magnitude of a release include the location of the receivers"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 9592,
      "SummaryText": "n as to the proper precautions that should be observed in the handling of the chemicals. Any AgriFrozen Foods employee that handles chemicals as part of their job function is further trained in the proper handling of those chemicals. Accesses to chemical storage areas are restricted to authorized facility employees, authorized management personnel, and authorized contractors. \nEmergency Response Program\nEach AgriFrozen Foods plant has written emergency response programs to provide guidelines for handling various types of emergencies including the release of a chemical such as anhydrous ammonia. In addition, certain fulltime employees are trained and equipped to respond to and mitigate chemical emergencies and releases. Each plant's emergency response plan prescribes the procedures to be followed by our employees during an emergency including evacuations and notifications of management, on-site response teams, and governmental agencies. In the case of a release of a toxic chemical that could reach off the facility's property, local emergency response agencies would be immediately notified of the release. Communications between the plant's Emergency Response Coordinator and the local emergency responders regarding such factors as the chemical released, extent of the release, and wind direction will determine the need for evacuation or shelter-in-place of our neighbors. Notifications and evacuations of neighbors will be conducted by the local emergency responders.\n5-Year Accident History\nThe RMProgram requires that all releases of a criteria chemical which occurred within the previous five years and caused any damages, injuries, or evacuation off-site, be reviewed. Although there have been small ammonia releases from the refrigeration system in past years, these have been very minor and did not put our neighbors or the surrounding area in jeopardy of injury or damage.  Every incident, regardless of how small, is reviewed and steps are taken to prevent the incident from"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 9592,
      "SummaryText": "reoccurring. \nSummary\nAt AgriFrozen Foods, protecting the community and the environment are high priorities. AgriFrozen Foods accepts responsibility for maintaining and operating facilities that are an asset to the communities in which they are located. This responsibility includes taking reasonable steps toward protection against injuries or environmental contamination and damage.\nEquipment and procedures at all facilities are inspected continuously and environmental protection programs reviewed periodically to assure operation within established guidelines. AgriFrozen Foods capital improvement projects often include safety and pollution control equipment and operational techniques that are needed to operate in compliance with local, state, and federal regulations.\nIn situations where regulations are lacking, AgriFrozen Foods plant managers are encouraged to set site objectives whenever there is a potential risk to safety or the environment. These objectives may include the actions necessary to help prevent, reduce, abate, or control noise, air, or water pollution and to accomplish the goal of being an asset rather than a nuisance to the community. \nAs future changes and improvements are made, the safety of our employees and neighbors will always be foremost on our minds."
    }
  ]
}