{
  "FacilityID": 9600,
  "FacilityName": "West Liberty Foods",
  "FacilityStr1": "207 W. 2nd Street",
  "FacilityStr2": "P.O. Box 318",
  "FacilityCity": "West Liberty",
  "FacilityState": "IA",
  "FacilityZipCode": "52776",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19139",
  "LEPC": "Muscatine County LEPC",
  "FacilityLatDecDegs": "41.569167",
  "FacilityLongDecDegs": "-91.265833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "dick_woodford@wlfoods.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Iowa Turkey Growers Cooperative",
  "Company2Name": null,
  "CompanyDUNS": 965099559,
  "Company2DUNS": 0,
  "OperatorName": "Kenneth Rutledge",
  "OperatorStr1": "207 W. 2nd Street",
  "OperatorStr2": "P.O. Box 318",
  "OperatorCity": "West Liberty",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52776",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard Woodford",
  "RMPTitle": "Plant Engineer",
  "FTE": 775,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000116769",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2004-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 41.56875,
  "FRS_Long": -91.26469,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11876,
      "AltID": "ammonia",
      "FacilityID": 9600,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12160,
          "ProcessID": 11876,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 13461,
          "ProcessID": 11876,
          "ChemicalID": 56,
          "Quantity": 70000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 513461,
          "ProcessID": 11876,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9600,
      "SummaryText": "  West Liberty Foods first opened for business in January of 1997 with four hunfred twenty five employees.  WLF is a two hundred forty five thousand square foot turkey processing plant owned by the Iowa Turkey Growers Cooperative with the mission \"to provide the safest food products to our customers at the best possible prices.\"  Our product list includes many varieties of luncheon meats, custom prepared deli products, as well as many bulk items prepared to order for our customers.  As our product lists have grown, so has our work force.  We now have 775 employees with production on all three shifts handling over two million pounds of turkey meat each week.  Production of this quantity requires a great deal of refrigeration to keep the products below 40 degrees to insure food safety.  This is accomplished with our ammonia refrigeration units.  WLF has on site 70,000 pounds of ammonia in the cooling and freezing systems.                                                                                              The prevention of accidental releases is a top priority of the management at WLF.  Management commitment to our PSM program including extensive training has led us to a very safe plant.  The facility has not had an ammonia release in the last five years.  Our management and utilities departments are very proud of this and they work hard daily to insure that the safety record stays that way.  However, if a release should occur, WLF has a trained Hazmat team ready to suit up at any time.  Our entire Hazmat team has been trained and certified to handle any chemical releases that might occur.  WLF Hazmat team has drills and meetings to talk about how we will handle releases if they should happen.  We have our practice sessions more often than the OSHA law requires.  The Plant Engineer and the Utilities Department Leader have both been to Incident Command School and are fully trained and ready to take the team into a release Hot Zone and do whatever is necessary t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9600,
      "SummaryText": "o protect WLF employees, West Liberty residents, and the environment.  In the event of a release we would evacuate WLF, call the LEPC, call the local First Responders medical team, West Liberty Police, and the members of the WLF Hazmat team.  With at least one of the Incident Commanders in charge, the incident will be evaluated and the team will respond in the best practical manner.  The Utilities department does not have a budget that must not be overspent, and we spend what it takes to insure safety and prevention rather that rely on our trained Hazmat team to clean up after a release.  Our facility complies with OSHA PSM to completely insure safety.  We have just rewritten our PSM program and have made several changes to make it a better plan.  The most important change is that the plan is clear and easy to follow.  There are no wordy passages designed for an inspector.  Rather, the whole program is for our technicians to follow and use as a tool to insure that we do not have releases. The PSM program was written with the help of our Utilities technicians.  We used their ideas on process safety and their concerns of our systems to write a program that covers our ammonia compressors and systems.  This allows us to take a compressor or condenser out of line to inspect and replace it with  a spare unit.  With this type of system we re able to do maintenance on our equipment before there is a problem, insuring system integrity and safety.\n     The Worst-Case release scenario used in our RMP was a manifold break in our receiver tanks.  We have two tanks coupled together by a manifold pipe.  Each tank has a capacity or 8000 pounds of ammonia.  Even though they never have more than 4000 pounds each I used full level to figure the worst-case so the maximum effect of this leak could be figured.  We used RMP*Comp to figure offsite consequence.  We have a mitigation drain that would make a real release not as bad as the one figured here.  I wanted this worst-case to be the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9600,
      "SummaryText": "worst possible and I believe this is it.  There would be offsite consequences.  If this were a real release we would call the Police Department of West Liberty and give them all details including the need to evacuate the entire town of 2935 people.  I feel that this maximum release for the facility could never happen because of the barriers in place to protect the tanks and piping from being hit by trucks or other objects.  We have a 15 MPH speed limit inside of our gates at the plant.  If a truck got out of control and was not going over 30 MPH the barriers around our recivers would stop the incident.  Our receivers have been located in a very safe location, making this worst-case scenario highly unlikely.  \n     The alternative scenario used is a possible scenario.  We figured the same receivers at the same ammonia levels.  this example figured a pressure relief valve failure releasing ammonia for 20 minutes at 800 pounds per minute.  Using RMP*Comp the toxic endpoint would be .2 mile.  There were no mitigation measures used in this example.  The offsite impact would be to evacuate approximately 50 people from homes within .2 mile of the plant.  This release could happen, however we have a preventative maintenance program for the relief valves and make sure they are in good working condition.\n     Constant safety improvements are being made at West Liberty Foods in all departments.  The Utilities department and the Plant Engineer are always looking for a way to make the ammonia systems safer.  At the present time a study is going on to figure effectiveness of water spray at relief valves discharge areas.  We hav already verified Y2K compliance of our computer controls and devices for the ammonia refrigeration systems.  At West Libery Foods we are not only concerned with safety of our products, but with the safety of our employees and the safety of the townspeople."
    }
  ]
}