{
  "FacilityID": 9647,
  "FacilityName": "Calpine Pittsburg",
  "FacilityStr1": "N. end Loveridge Rd @ Dow Chemical",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "94565",
  "Facility4DigitZipExt": "0055",
  "FacilityCountyFIPS": "06013",
  "LEPC": "Contra Costa Cty Health Dept",
  "FacilityLatDecDegs": "38.025278",
  "FacilityLongDecDegs": "-121.849444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "AB",
  "FacilityURL": "www.calpine.com",
  "FacilityEmailAddress": "duanen@calpine.com",
  "FacilityDUNS": 112710876,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Calpine",
  "OperatorStr1": "P.O. Box 551",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94565",
  "OperatorZipCodeExt": "0055",
  "RMPContact": "Duane Null",
  "RMPTitle": "Operations Supervisor",
  "FTE": 12,
  "OtherEPAFacilityID": "CAR-000043265",
  "EPAFacilityID": "100000117811",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "11928",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-03-31 00:00:00",
  "DeRegistrationEffectiveDate": "2010-03-13 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 38.02528,
  "FRS_Long": -121.84944,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Transfer Plant Ownership to DOW Chemical Company",
  "_processes": [
    {
      "ProcessID": 11952,
      "AltID": "Ammonia for SCR",
      "FacilityID": 9647,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12236,
          "ProcessID": 11952,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        },
        {
          "Process_NAICS_ID": 12237,
          "ProcessID": 11952,
          "NAICSCode": "221122",
          "_desc": {
            "NAICS_CODE": "221122",
            "NAICS_DESCRIPTION": "Electric Power Distribution"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 13573,
          "ProcessID": 11952,
          "ChemicalID": 56,
          "Quantity": 76500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 513573,
          "ProcessID": 11952,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9647,
      "SummaryText": "Corporate Policy:  Calpines Pittsburg plant is part of Calpine Corporation.  Calpine Corporation recognizes the responsibility to make our environment, community and our employee safety a primary part of our daily concerns.  Calpine Corporation is committed to being a responsible member of any community in which it has operations by giving top priority to operating in a safe and environmentally sound manner.  Calpine is dedicated to developing an environmentally responsible energy resource compatible with the community needs.  Calpine aims to protect and conserve California's valuable air and water resources, while providing a reliable source of low-cost electricity for residents and businesses.  Calpine is committed to working closely with community members, environmental groups and local governmental agencies to meet its obligation to the community and to the environment.\nIt is the policy of Calpine Corporation that every employee is entitled to a safe and healthful place in which to work and live.  Calpine Operations and Maintenance Department incorporates the concepts of Environmental Responsibility and Productivity with Safety resulting in Efficiency and Productivity.\nAs part of Calpines obligation to protect the integrity of human, environmental, physical, and financial resources, and to conserve and efficiently utilize those resources, Calpine will:\nComply fully with laws regulating Environmental Protection and Employee Health and Safety;\nFurnish work places free of recognized hazards likely to cause injury to employees, the public, or the environment;\nTrain employees in safe and environmentally conscious practices and require compliance with Environmental, Health and Safety regulations, policies, and procedures;\nProvide a professional staff to maintain and support Environmental, Health and Safety programs.\n\nStationary Source Overview:  Calpine acquired the Pittsburg Power Plant from The Dow Chemical Company in July 1998.  The plant is a 70 megawatt gas-fir"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9647,
      "SummaryText": "ed cogeneration facility, located at The Dow Chemical Company's (\"Dow\") Pittsburg, California chemical facility.  Calpine sells electricity to Dow and to PG&E.   In addition, the plant sells steam to Dow and to USS-POSCO Industries' nearby steel mill. \nThe facility is regulated under the Clean Air Act Amendments, also referred to as the federal Risk Management Program (RMP) and the California Accidental Release Prevention (CalARP) Program, due to onsite ammonia storage in excess of the 10,000-pound RMP applicability threshold in a process.  The legal authority for the federal RMP program is the Code of Federal regulations (CFR) Title 40 Part 68.  The legal authority for the CalARP Program is the California Health and Safety Code (H&SC), Division 20, Chapter 6.95, Article 2 (commencing with section 25531).  The California Office of Emergency Services has issued implementation regulations under the California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5.  The facility's CalARP covered process is the ammonia storage system that provides an ammonia source for the Selective Catalytic Reduction (SCR) system (stationary source).  The SCR unit is required to control air emissions.  The stationary source covered process consists of one 15,000-gallon tank storing a maximum of 12,975 gallons [United States Environmental Protection Agency (US EPA)/ANSI limit of filling tanks to 86.5% capacity at 600F].    \n\nChemical Safety Overview:  The facility's overall approach and commitment to chemical safety is demonstrated by 1) the existing management, training, operating procedures, and maintenance systems in place at the facility, and 2) the hazard assessment, prevention program, and emergency response provisions implemented specifically for ammonia in response to the RMP requirements.  The management structure and oversight to ensure safety is documented in the facility's RMP and includes compliance with applicable regulations, codes, and standards (US EPA 40 CFR 68; "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9647,
      "SummaryText": "US OSHA 29 CFR 1910.119; Californias Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5; and ANSI guidance for ammonia). \n\nRelease Scenarios:  Worst-case and alternative release scenario assessments were conducted for the facility's vessel based on US EPA's Offsite Consequences Analysis guidance.  The toxic vapor cloud scenario was considered for both releases and public receptors were determined to be located within the impact zone of both the worst-case and alternative releases.  The resulting worst-case and alternative release impact zones were 4.9 miles and 0.30 miles, respectively.  EPA, OSHA and ANSI guidance on restricting the maximum ammonia inventory stored within a vessel to 86.5% (at 600F) of a vessels rated capacity is followed at the facility to minimize the potential quantity released in an accident.  \n\nFive-year Accident History:  The facility has had no RMP-reportable accidents/releases of ammonia within the five years preceding RMP submittal.\nPrevention Program:  The facility has implemented a Program 3 level Prevention Program, as required by the RMP  and PSM rules, in accordance with US EPA, US OSHA 29 CFR 1910.119, respectively, and ANSI and vendor guidance for ammonia.  These prevention program provisions are specifically intended to minimize the probability and/or consequences of accidental ammonia releases from the facility and include such measures as a system hazard review, operating and maintenance procedures, training, compliance auditing, management system, and updates.  The facility prevention program is an ongoing system based on periodic training, incident investigations, audits, procedure revisions, and RMP/PSM updates as required to reflect facility change and RMP/PSM requirements.  \n\nEmergency Response Program:  The facility has coordinated response with the Pittsburg Fire Department and Dow Corporations Chemical Technicians to ensure that they will respond to any accidental release from the ammonia system.  The facility"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9647,
      "SummaryText": " has also established a notification mechanism to ensure the Fire Department and Dow Corporations Chemical Technicians will be properly notified when response is required for an ammonia release.  \n\nSafety Management and Changes:  The facility is committed to ensuring its operations are safe and in accordance with all RMP requirements, and has established a senior manager responsible for RMP development, implementation, and compliance.  This manager is committed to maintain the safety of the RMP-covered ammonia system through active adherence to the appropriate procedures and codes.  To ensure that the appropriate changes occur as necessary to maintain and improve safety, ongoing hazard reviews, training, audits, maintenance and investigations will be conducted as required by the RMP.  Updates to the RMP will be completed as necessary in response to these activities.  \n\nSummary:  As documented in this submittal, the RMP for the facility has been completed in accordance with all 40 CFR 68 requirements and the facility has certified RMP compliance."
    }
  ]
}