{
  "FacilityID": 9649,
  "FacilityName": "Quaker Chemical Company, Inc",
  "FacilityStr1": "1212 Elmore Street",
  "FacilityStr2": "1306 Elmore Street",
  "FacilityCity": "Columbia",
  "FacilityState": "SC",
  "FacilityZipCode": "29203",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45079",
  "LEPC": "Richland County LEPC",
  "FacilityLatDecDegs": "34.034444",
  "FacilityLongDecDegs": "-81.039444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "OT",
  "LatLongDescription": "PG",
  "FacilityURL": "www.quakerchemical.com",
  "FacilityEmailAddress": "quakerchemical@quakerchemical.com",
  "FacilityDUNS": 3365921,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Josie C. Hendrix",
  "OperatorStr1": "P.O. Box 554",
  "OperatorStr2": null,
  "OperatorCity": "Columbia",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29202",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000117937",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-01-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-06-22 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2016-11-29 00:00:00",
  "DeRegistrationEffectiveDate": "2015-09-30 00:00:00",
  "AnniversaryDate": "2004-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.7",
  "FRS_Lat": 34.03444,
  "FRS_Long": -81.03944,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 11954,
      "AltID": "Storge Tank",
      "FacilityID": 9649,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 13575,
          "ProcessID": 11954,
          "ChemicalID": 55,
          "Quantity": 65000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 12239,
          "ProcessID": 11954,
          "NAICSCode": "32561",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 5653,
              "Process_NAICS_ID": 12239,
              "SafetyReviewDate": "1999-06-11 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "1999-06-11 00:00:00",
              "ChangeCompletionDate": "1999-07-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Emergency pump to pump leaks to emergency tank.",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Liquid level switch to detect leak.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "1999-06-11 00:00:00",
              "TrainingReviewDate": "1999-01-25 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "1999-06-11 00:00:00",
              "EquipmentInspectionDate": "1999-06-11 00:00:00",
              "EquipmentTested": "This process has been completely reviewed and installing of new tanks and current tanks move to inside building, and within diked areas",
              "ComplianceAuditDate": "1999-06-11 00:00:00",
              "AuditCompletionDate": "1999-07-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "1999-06-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 5856,
                  "PreventionProgram2ID": 5653,
                  "ProcessChemicalID": 13575
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "ProcessID": 11955,
      "AltID": "Drum Storage",
      "FacilityID": 9649,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 13576,
          "ProcessID": 11955,
          "ChemicalID": 55,
          "Quantity": 42000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 12240,
          "ProcessID": 11955,
          "NAICSCode": "32561",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9649,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1999-06-11 00:00:00",
    "ERTrainingDate": "1999-06-21 00:00:00",
    "CoordinatingAgencyName": "Richland County (LEPC)",
    "CoordinatingAgencyPhone": "8032543061",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9649,
      "SummaryText": "Executive Summary\n\nCompany Overview:\nIt is Quaker Chemical Company, Inc. policy to work diligently to promote a safe work environment for our employees and to work with the local community to provide a safe area to live. Our chemical company has operated in the same location for over thirty years. Producing such products as All Purpose Cleaners, Hand Soaps, Floor Wax, Carpet Cleaning Chemical, Etc.  In 1978, twenty one years ago, Quaker began packaging Hydrofluoric Acid by request from one of our customers. Since then we have added some additional customers of this type. The majority of these customers purchase the HF packaged in small containers, such as one gallon and five gallon pails. As this business increased, and to remain competitive in the market, it became apparent that we would need to bring in this product by bulk tankers loads (about 38,000 lbs per load). This would require Quaker to install a large holding tank to hold the product before packaging in smaller containers. When purchasing the tank and equipment necessary and when making improvements in our process we requested the assistance of the HF manufacturers. Over the years we've had the assistance of the top three producers of Hydrofluoric Acid in the United States,  LCI Inc., Chemtech, and AlliedSignal. Each of these company's have heightened our commitment to the safe handling of HF. \n\nSafety and Accident Prevention:\nQuaker being a relative small company, fifteen employees, up until this year our safety has been primarily handled by management. Recently we formed a Safety Committee which is made up of management, and production department supervisors. Accidental release prevention and emergence response is reviewed and adjusted by the Safety Committee. This committee meets the first Tuesday of each month to discuss the process and safety issues. The group reviews any concerns that have occurred over the last thirty days, and/or have been raised in the weekly supervisors/employee meetings. On"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9649,
      "SummaryText": "ce the concerns have been identified then the committee devises a plan of action. The committee also reviews all new processes and/or changes in the process (equipment, tanks, valves, etc). For example after reviewing the RMP and worse case scenarios we decided to stop using our large tank installed in the summer of 1994. This tank is outdoors and we felt that we could greatly reduce the effect of an accident by placing this tank inside a building. As of May 31, 1999 we are no longer using this tank for the storage of 70% HF. We will continue to use it for HF less than 50 percent strength until we have moved into our new tank facility due to be completed about July 31, 1999. It also has been the practice of the company to work cooperatively with the local area emergency personnel. Each year the local fire department makes a complete walk through of our plant becoming acquainted with the type of hazards stored and where they are. The walk through usually includes most of the employees of the  local fire department that is just three blocks from our facility. Also, our company has requested several courtesy inspections conducted by DEHC (South Carolina Department of Health and Control) these inspections have included OSHA compliance, Industrial hygiene, air monitoring, and process review. \n\nFacility and Regulated Chemical:\nThe new tank holding area (enclosed building) for 70% Hydrofluoric Acid will have many additional safeguards. Some of these include, all tanks will be housed inside a building which will have a separate containment bay for each tank, our 70% HF tank will be setup as a tank inside a tank. If for some reason the first tank was to fail the second tank would contain the product. If in the unlikely event the second tank was to fail the double tanks will be sitting in an acid resistant lined concrete walled bay large enough to contain more than 140% of the first tanks maximum capacity. To control the possibility of tank rupture we have two separate pressu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9649,
      "SummaryText": "re relieve outlets each going to a separate fume scrubbing system. If for some reason one of the outlets were to fail the other would act as a backup. We have also installed a negative pressure relieve device to avoid the tank  imploding due to any negative pressure. \n\nWorst Case Scenario:\nThe 70% HF tank is what we have based our  worse case scenario. In the projected scenario we have considered that both the primary tank (max cap. 6,500 or 65,000 lbs. gallons) and the secondary tank have failed and 100 % of the product has spilled. As mentioned above the tanks sit inside a containment bay inside an enclosed building. The containment bay for this tank will limit the surface area of the spill to 300 square feet. Using the OCA Guidance method of modeling the offsite projected area includes less than 300 feet or one hundred yards from the spill sight. This is based on a 10% breakthrough that the RMP requires. Since the tank is totally enclosed in the containment building the actual offsite consequence may be less. \n\nAlternative Scenario:\nFor the alternative scenario we have considered the pumping of 70% HF from a 500 lb drum into  our 1,500 gallon dilution tank. Our pump moves product at a maximum rate of 100 lbs per minute. In our alternate scenario we have projected that the output line from the pump to the dilution tank has burst. We have estimated that it will take the pump operator no longer than 30 seconds to shut the suction valve off on the pump, this would cause 50 lbs of product to be spilled. Using the OCA Guidance method of modeling the offsite projected area includes less than 300 feet or one hundred yards from the spill sight. In this scenario the spill is not in an enclosed area. This alternate scenario was chosen because pumps hoses and connectors provide more opportunity for an accident. A hose or connection failure is something that you hope never happens but you never know when one may fail.\n\nAccident History:\nNo releases have occurred during the la"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9649,
      "SummaryText": "st five years at our facility.\n\nEmergency Response\nOur emergency response to worse case scenario is to secure and evacuate the spill area, notify the rest of the employees and the local area population. To immediately call The Richland County LEPC requesting them to implement the response plan that they have developed for our facility. Upon the arrival of the emergency response personal the response coordinator will be advised of the current situation and a plan of action will then implemented.\n\nAdditional Note:\nTo meet the requirements of notifying the public of the possible hazards in the case of an accident we have done the following. We have worked with the Richland/Lexington County LEPC and other area companies that fall under the RMP. The method chosen as a group to notify the public has several elements. First the LEPC and the local participating companies meet together to form a unified method of meeting the notification requirements of the RMP. We chose to set up a public meeting where all could be educated as to what the RMP means to them. After a discussion of the basic of the RMP the Attendees will be invited in to meet with the different participating company to review their RMP plan. This meeting has been advertized through printed brochures handed out by the participating companies to their local neighbors, radio announcements, television ads, newspaper announcements."
    }
  ]
}