{
  "FacilityID": 9815,
  "FacilityName": "Clark Community Oil Fertilizer Plant",
  "FacilityStr1": "North Kansas Street",
  "FacilityStr2": null,
  "FacilityCity": "Clark",
  "FacilityState": "SD",
  "FacilityZipCode": "57225",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46025",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "44.878889",
  "FacilityLongDecDegs": "-97.728333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 24312597,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Greg Overby",
  "OperatorStr1": "100 North Cloud Street",
  "OperatorStr2": null,
  "OperatorCity": "Clark",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57225",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ken Kruthoff",
  "RMPTitle": "Agronomy Manager",
  "FTE": 5,
  "OtherEPAFacilityID": "SD0000859033",
  "EPAFacilityID": "100000000349",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1998-08-24 00:00:00",
  "SafetyInspectionBy": "SD Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "1999-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-03-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "1999-02-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-08-12 00:00:00",
  "DeRegistrationEffectiveDate": "2014-06-15 00:00:00",
  "AnniversaryDate": "2004-02-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5",
  "FRS_Lat": 44.87889,
  "FRS_Long": -97.72833,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12229,
      "AltID": "Propane Retail Sales",
      "FacilityID": 9815,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12520,
          "ProcessID": 12229,
          "NAICSCode": "454312",
          "_desc": {
            "NAICS_CODE": "454312",
            "NAICS_DESCRIPTION": "Liquefied Petroleum Gas (Bottled Gas) Dealers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 13915,
          "ProcessID": 12229,
          "ChemicalID": 98,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 513915,
          "ProcessID": 12229,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 12230,
      "AltID": "Anhydrous Ammonia Sales",
      "FacilityID": 9815,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 12521,
          "ProcessID": 12230,
          "NAICSCode": "45439",
          "_desc": {
            "NAICS_CODE": "45439",
            "NAICS_DESCRIPTION": "Other Direct Selling Establishments"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 13916,
          "ProcessID": 12230,
          "ChemicalID": 56,
          "Quantity": 160000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 513916,
          "ProcessID": 12230,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9815,
      "SummaryText": "Clark Community Oil is an independent company serving the Clark County area.  The facilities owned and operated by the company include a fuel station (which includes an oil retailing operation and a convenience store) and the facilities known as the fertilizer plant.  The fertilizer plant and the fuel station are located separately, and only the fertilizer plant is concerned in the Risk Management Plan.  Two main buildings are present at this location which serve as shops, offices, garages, loading facilities, etc.  Several other small buildings used for storage are located around the perimeter of the site.  Located in the center of the site are two large tanks, which are used to store propane and anhydrous ammonia, respectively.  These two chemicals are the only substances on the property in large enough quantities to be subject to the Risk Management Planning process.  Both tanks are capable of holding 30,000 gallons.  However, the administrative policy at the site is too not exceed 89% of total capacity.  This equates to a maximum of 160,000 pounds of anhydrous ammonia and 120,000 pounds of propane on site at any time.  The tanks are located roughly in the center of the property, and are separated by approximately 65 feet.  The chemicals stored in these tanks are sold in retail fashion to independent consumers.  The propane is utilized by customers for heating, while the anhydrous ammonia is consumed largely by agricultural users.  The facility is located near the eastern edge of the city of Clark, which has a population of roughly 1,200 people.  The area northeast of the facility is largely farmland.  The Clark County fairgrounds are located roughly one half mile northeast.  Residential areas, the business district, and various schools and parks exist to the west of the facility.  To the immediate south of the facility is a railroad track, then there is a commercial area that borders on US Highway 212.  A food processing plant is roughly one half mile east of th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9815,
      "SummaryText": "e facility.  Affected population in the area was estimated under the release scenarios.  The worst-case and alternative release scenarios for both propane and anhydrous ammonia were modeled using RMP Comp.  In a worst-case release scenario for propane, 120,000 pounds would be released and a vapor cloud explosion would result.  Using an endpoint of 1 psi of overpressure, a distance of 0.4 miles was obtained.  No blast walls are present, and no passive mitigation was considered.  Reviewing the features described above, it is estimated that a residential population of 650 people is present within this distance.  Receptors within this distance include residences, commercial, office, and industrial areas, and city parks.  No environmental receptors are present within this distance.  A worst-case release of anhydrous ammonia would consist of a gas release of 160,000 pounds over a period of 10 minutes.  Using a wind speed of 1.5 m/sec and an F Atmospheric Stability Class, it was determined that the distance to the toxic endpoint would be 4.4 miles.  No passive mitigation was considered in this calculation.  This distance would encompass the entire city of Clark.  The area surrounding the city is largely farmland and is sparsely populated.  Using the USGS quadrangle maps for the area, it was estimated that a residential population of up to 1,500 may be located within this distance.  Receptors include residences, schools, commercial, office and industrial areas, recreational areas, and the city airport.  Environmental receptors within the area include several small lakes and many wetlands, along with National Waterfowl Production Areas and State Public Shooting Areas.  For the alternative release scenario for anhydrous ammonia, the rupture of a transfer hose was used.  It was estimated by employees that it would require no more than three minutes to halt the flow of ammonia if this were to happen.  Assuming a wind speed of 3 m/sec and an Atmospheric Stability Class of D, it "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 9815,
      "SummaryText": "was determined that the distance to the toxic endpoint would be 0.2 miles.  Receptors within this distance include residences, commercial, office, and industrial areas, and recreational areas.  It is estimated that a residential population of 150 is present within this distance.  No environmental receptors are present within this distance.  A similar event was used in the alternative release scenario for propane.  If a transfer hose ruptured, it was estimated that 1,000 pounds would be released over a three minute period.  The resulting vapor cloud explosion would require a distance of 0.1 miles to reach the endpoint under the assumptions of a wind speed of 3 m/sec and a D Stability Class.  No active or passive mitigation was considered.  Receptors within this distance include residences, commercial, office, and industrial areas, and recreation areas.  It is estimated the residential population within this distance is less than 50.  No environmental receptors are present within this distance.  The facility has an excellent safety record.  Over the past five years, no accidents or incidents referred to in the data elements have occurred.  Nothing of this kind has occurred at the facility in at least 15 years.  This safety record is the result of the priority that safety is given at the facility.  The small number of employees who handle propane and anhydrous ammonia makes it easier to ensure that proper training is provided and proper procedures are followed.  Any new employees, or employees who may be switching to new duties, are provided with a combination of classroom and on-the-job training.  They are then observed closely over the initial months of employment by the facility manager to ensure proper performance.  Any knowing violation of safe working procedures is not tolerated.  Safety meetings are conducted regularly.  Reviews of hazards and procedures are conducted before the \"busy season\" in the fall.  Safety meetings are also held at an increased frequency "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 9815,
      "SummaryText": "before this time to ensure all employees are focused on safety.  Inspections of equipment at the facility are periodic.  The major hazards at the facility are fire or explosion of the propane, and toxic release of the anhydrous ammonia.  Both scenarios would be most likely to occur as the result of the failure of a transfer mechanism.  However, this possibility is limited by the presence of various safety features on both tanks, including manual and automatic shutoffs, vents, and check valves.  Transfer mechanisms are also locked closed when not in use.    The emergency response program for the facility is coordinated with the Clark Fire Department and the Clark County LEPC.  It includes actions to be taken in case of a release, emergency health care information, and an extensive contact list for informing the public and local agencies.  It is reviewed annually.  Facility personnel receive training for emergency response in order to minimize any delays in dealing with an accidental release.  Personal protective equipment, including chemical suits, visors, and self contained breathing apparatus are maintained at the facility.  Employees are trained in their use and fit tested.  In summary, the Clark Community Oil fertilizer plant has an excellent safety record.  However, this record has not resulted in complacency.  Management and employees are dedicated to performing their duties safely, and have demonstrated that they are willing to comply with all applicable standards and guidelines.  Changes in record keeping and reporting required under the RMP rule will be implemented in the facility safety plan.  No additions or facility modifications are planned at this time."
    }
  ]
}