{
  "FacilityID": 9885,
  "FacilityName": "Martin Electronics, Inc.",
  "FacilityStr1": "10625 Puckett Road",
  "FacilityStr2": null,
  "FacilityCity": "Perry",
  "FacilityState": "FL",
  "FacilityZipCode": "32347",
  "Facility4DigitZipExt": "9751",
  "FacilityCountyFIPS": "12123",
  "LEPC": null,
  "FacilityLatDecDegs": "29.970278",
  "FacilityLongDecDegs": "83.660278",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "UN",
  "LatLongDescription": "SD",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 47966593,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Martin Electronics, Inc.",
  "OperatorStr1": "10625 Puckett Road",
  "OperatorStr2": null,
  "OperatorCity": "Perry",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32347",
  "OperatorZipCodeExt": "9751",
  "FTE": 350,
  "OtherEPAFacilityID": "FLD047966593",
  "EPAFacilityID": "100000001847",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1230047-001-AV",
  "SafetyInspectionDate": "1997-06-11 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "1999-04-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "1999-04-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*Submit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "1999-04-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2003-03-10 00:00:00",
  "DeRegistrationEffectiveDate": "2003-03-06 00:00:00",
  "AnniversaryDate": "2004-04-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0.5",
  "FRS_Lat": 29.971165,
  "FRS_Long": -83.655854,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": null,
  "HorizontalRefDatumCode": null,
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 12308,
      "AltID": null,
      "FacilityID": 9885,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 14013,
          "ProcessID": 12308,
          "ChemicalID": 98,
          "Quantity": 26400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 12600,
          "ProcessID": 12308,
          "NAICSCode": "331522",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 9885,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "1997-06-04 00:00:00",
    "ERTrainingDate": "1998-11-06 00:00:00",
    "CoordinatingAgencyName": "Taylor County Emergency Management",
    "CoordinatingAgencyPhone": "8508383575",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 9885,
      "SummaryText": "Martin Electronics, Inc. (MEI) manufactures small to medium size exlosives and pyrotechnic devices.  The exact product lines vary and are contract dependent.  The products produced are generally for use by the United States Armed Forces as well as various government agencies.\n\nMEI has extensive storage facilities for both raw materials and finished product.  Due to the potentially reactive nature of these materials, they are stored in segregated structures in accordance with NFPA requirements.  The NFPA requirements generally rely on distances between storage units to reduce hazard potential.  All blending and storage facilities are labelled with the maximum amount of explosives which may be managed at each unit.\n\nVarious production lines are located throughout the facility.  Each product is produced within a dedicated production line.  Production lines generally consist of blending, forming, packaging/encasing, and shipment preparation.  The exact number of steps and physical buildings involved in the production process vary by product.  \n\nThe facility operates a die cast operation and associated plating line.  Die cast burners are fueled by propane.  One 6000 gallon tank is used to supply this operation.  This tank is the only process involved at the facility regulated by the Risk Management Plan.  The tank is surrounded by a locked chain link fence, warning signs are posted on all four sides.  Products manufactured here include hand grenade fuze parts and 40 mm shell parts.  The manufacturing process includes captive zinc die casting, vibratory deburring, noncyanide alkaline zinc electroplating, and noncyanide chromate conversion coating operations.  Rinsewaters generated from plating operations are treated within an on-site Industrial Wastewater Treatment Plant.  Treated liquid effluent is discharged in accordance with a Florida Department of Environmental Proteciton operating permit.  Wastewater solids are treated in a sludge dryer, prior to containerization an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 9885,
      "SummaryText": "d subsequent off-site metal relclamation.  Propane for the sludge dryer is supplied by the same 6000 gallon propane tank which supplies die cast operations.  \n\nProduct testing is accomplished at various facilities within the complex.  Testing is used to verify that the products manufactured meet contract specifications.  Materials or units which do not meet product specification are reworked.  If they cannot be reworked then they are managed as hazardous wastes (i.e., reactivity, EPA HW No. D003) and are transferred to an on-site RCRA permitted TSD for thermal treatment.  In addition to the thermal treatment of non-conforming items the RCRA facility also treats all reactive wastes generated on-site.  During CY 97 the facility treated 61,000 pounds of reactive waste, the majority consisting of a magnesium/teflon pyrotechnic blend.  \n\nThe facility emergency response unit (i.e., Fire Brigade) is augmented and coordinated with local emergency responders.  Facility procedures outline personnel response to facility wide emergency's, while the facility Contingency Plan outlines coordination actions with the local emergency responders in the event of a RCRA related emergency.  Using the EPA RMPComp a worst case scenario was developed. Engineering/Administrative controls were not taken into account.  The result indicated that, with a vapor cloud explosion, the distance to 1 psi overpressure equaled 0.2 miles.  As identified within the facility RCRA permit the nearest public receptor is > 0.5 miles away.  Additionally, the nearest surface water body is the Okefenoke Slough located 0.9 miles from the facility."
    }
  ]
}