{
  "FacilityID": 1000035516,
  "FacilityName": "The L.S Starrett Company (Athol, MA)",
  "FacilityStr1": "121 Crescent Street",
  "FacilityStr2": null,
  "FacilityCity": "Athol",
  "FacilityState": "MA",
  "FacilityZipCode": "01331",
  "Facility4DigitZipExt": "1913",
  "FacilityCountyFIPS": "25027",
  "LEPC": "Athol LEPC",
  "FacilityLatDecDegs": "42.596512",
  "FacilityLongDecDegs": "-072.229927",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.starrett.com",
  "FacilityEmailAddress": "envirogroup@starrett.com",
  "FacilityDUNS": 1125681,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "The L.S. Starrett Company",
  "OperatorStr1": "121 Crescent Street",
  "OperatorStr2": null,
  "OperatorCity": "Athol",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01331",
  "OperatorZipCodeExt": "1913",
  "FTE": 650,
  "OtherEPAFacilityID": "01331LSSTR121C",
  "EPAFacilityID": "100000167829",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-06-13 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-07-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-07-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-07-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2023-11-01 00:00:00",
  "DeRegistrationEffectiveDate": "2023-10-23 00:00:00",
  "AnniversaryDate": "2018-07-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 42.595325,
  "FRS_Long": -72.226707,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "1200",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000043445,
      "AltID": null,
      "FacilityID": 1000035516,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000052233,
          "ProcessID": 1000043445,
          "ChemicalID": 98,
          "Quantity": 66528.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000043809,
          "ProcessID": 1000043445,
          "NAICSCode": "332212",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000043810,
          "ProcessID": 1000043445,
          "NAICSCode": "333515",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000037756,
              "Process_NAICS_ID": 1000043810,
              "SafetyReviewDate": "2013-05-17 00:00:00",
              "PHA_Date": "2013-05-17 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-05-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "PHA Recommendations Implemented",
              "OpProceduresReviewDate": "2013-06-14 00:00:00",
              "TrainingReviewDate": "2013-05-17 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-05-17 00:00:00",
              "EquipmentInspectionDate": "2013-01-10 00:00:00",
              "EquipmentTested": "Comprehensive inspection by propane service vendor",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2013-05-17 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2012-03-20 00:00:00",
              "AuditCompletionDate": "2013-03-20 00:00:00",
              "IncidentInvestigationDate": "1999-07-26 00:00:00",
              "InvestigationChangeDate": "2000-07-26 00:00:00",
              "ParticipationPlansReviewDate": "2013-05-01 00:00:00",
              "HotWorkPermitReviewDate": "2013-05-01 00:00:00",
              "ContractorSafetyReviewDate": "2013-06-14 00:00:00",
              "ContractorSafetyEvalDate": "2013-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000044720,
                  "PreventionProgram3ID": 1000037756,
                  "ProcessChemicalID": 1000052233
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000035516,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-06-14 00:00:00",
    "ERTrainingDate": "2013-05-23 00:00:00",
    "CoordinatingAgencyName": "Athol Fire Department",
    "CoordinatingAgencyPhone": "9782498275",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000035516,
      "SummaryText": "See  Section 11.0 or most recent audit for assigned responsibilities and updated information.  \r\n\r\nIf a facility handles, manufactures, uses in a process or stores propane in excess of 10,000 pounds, they are required to develop and implement a Risk Management Plan (RMP) as required by the Environmental Protection Agency (EPA) regulation 40 CFR 68.\r\n\r\nThe L.S. Starrett Company (Starrett) stores up to 66,528 pounds of propane at the 121 Crescent Street site in its 18,000 gallon propane storage tank for heat treating and general building heating.  Starrett is required to address the requirements of the Environmental Protection Agency (EPA) Chemical Accident Prevention (CAP) Regulation 40 CFR 68 and the Occupational Safety and Health Administration(OSHA) Process Safety Management (PSM) regulation 29 CFR 1910.119 because they exceed the 10,000 propane regulatory threshold and the propane is used as a feedstock in the heat treat process (special atmosphere furnace).\r\n\r\nA 5,500 gallon methanol storage tank and two, 250 pound ammonia storage containers, are also located at the facility.  Ammonia , methanol , and nitrogen are also used in the heat treat process.  These chemicals are not required to be reported according to the EPA CAP Regulation.  However, these chemicals are regulated under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulation 29 CFR 1910.119. The EPA RMP regulation requires that facilities subject to OSHA PSM regulations be categorized as Program 3 facilities. There are also a number of other chemicals used at the facility which are addressed in The L.S. Starrett Company Emergency Response Plan.\r\n\r\nThe Plan contains the Policies and Procedures used at The L.S. Starrett Company to assure continued compliance with the CAP regulations.  Most of the documents that are part of this plan follow a standard format that includes the purpose organization, responsibilities and authorities, as well as general step-by-step"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000035516,
      "SummaryText": "instructions.  \r\nMost procedures contain information on document control and filing.  Typically, documents are periodically revised through the procedures outlined in Section 9 - Management of Change.\r\n\r\nAll employees are strongly encouraged to review these Policies and Procedures.  The manual is available for review by any employee at any time.  Any recommendation to improve a document's accuracy or effectiveness in assuring employee, visitor and contractor safety can be directed to management.\r\nThe goal of the RMP is to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that do occur. The 1990 Amendments to the Clean Air Act (CAA) require EPA to issue a rule specifying the type of actions to be taken by facilities to prevent accidental releases of hazardous chemicals into the atmosphere and to reduce their potential impact on the public and the environment. \r\n\r\nThe phrase \"Risk Management Plan\" refers to this document as well as the registration information submitted to EPA.  In general, the RMP requires that:\r\n\r\n¿\tCovered facilities must develop and implement an RMP and maintain documentation of the program at the site.  The RMP will include an analysis of the potential offsite consequences of an accidental release, a five-year accident history, a release prevention program and an emergency response program.\r\n\r\n¿\tCovered facilities also must submit registration information (RMP Submit), to EPA no later than June 21, 1999 or the date on which the facility first has more than a threshold quantity in use or stored at the site, whichever is later. The RMP submission provides a summary of the larger RMP maintained on-site. The RMP will be available to Federal, state and local government agencies, the public and facility staff.\r\n\r\n¿\tCovered facilities also must continue to implement and update their RMPs periodically or when processes change, as requ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000035516,
      "SummaryText": "ired by the rule.\r\n\r\n\r\nSection 2 - Management System\r\n\r\nThe implementation and management responsibilities for the Plan have to be clearly defined.  This section discusses various duties that must be addressed in order to fulfill the intent of the Plan.  This section also describes the employee responsibilities associated with each duty.  The facility has a designated Risk Management Program Coordinator (RMPC) which is identified in the plan and in the RMP Submit.\r\n\r\n\r\nSection 3 - Hazard Assessment\r\n\r\nA major component of the Plan is the assessment of impact associated with the accidental release of the hazardous material(s) in question.  This section evaluates both the worst-case release as well as alternative releases that are specific to the site.\r\nThe analysis focuses on the impact to neighboring areas called receptors.  Receptors include residences, schools, parks, prisons, commercial buildings, etc.  Graphic as well as tabulated exhibits help to define the impact of accidental releases.\r\n\r\n\r\nSection 4 - Process Safety Information\r\n\r\nProcess Safety Information (PSI) is a repository for information related to the safety of a process.  Three major subjects addressed in this section are:\r\n\r\n¿\tThe hazards of the chemicals and the process (physical properties, toxicity and exposure limits, fire and explosion characteristics, reactivity data, thermal and chemical stability, corrosivity data).\r\n\r\n¿\tThe process technology (process chemistry, process flow diagrams, safe operating limits, maximum intended inventories, consequences of deviation).\r\n\r\n¿\tEquipment information (piping and instrumentation diagrams, material and energy balances, safety systems involved, materials of construction, electrical classification, relief system design and design basis, ventilation system design and design basis, design codes and standards employed).  This information is used as a reference during Process Hazards Analyses.\r\n\r\nDocumentation is found primarily in the Safety Data Sheets (S"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000035516,
      "SummaryText": "DS), the Risk Management Plan and the Process Safety Information files.  \r\n\r\n\r\nSection 5 - Process Hazard Analysis\r\n\r\nProcess Hazard Analysis (PHA) is a systematic approach toward evaluating the safety of a process,.  PHAs must address the hazards of a process, previous incidents having potential for serious consequences, engineering and administrative controls, facility siting, human factors and an evaluation of the range of exposures if controls fail.  If there is more than one process, a schedule for completing PHAs must be formulated and be based on the extent of process hazards, the number of potentially affected employees, the age of the process and the operating history of the process.  Employees must have input into the prioritization of PHAs and this schedule must be fully communicated to applicable employees.  PHAs must follow a standard methodology, such as a What If/Checklist Analysis and be performed by a cross-functional team with at least one person who is familiar with the process, at least once every five years.  A system for addressing, resolving, documenting and communicating all recommendations in a prompt manner must also be in place.\r\nTypical documentation should include information on how PHA studies were prioritized, employee briefings on the PHAs, a copy of each PHA file index and evidence of how PHA recommendations were completed.  These PHA files include the pertinent process safety information.\r\n\r\n\r\nSection 6 - Operating Procedures\r\n\r\nOperating procedures are instructions that outline how to safely operate a process consistent with Process Safety Information.  They must be appropriate, clear, consistent and well communicated.  Procedures must address steps for each operating phase (initial startup, normal operations, temporary operations, emergency shutdown, emergency operation, normal shutdown, startup after a turnaround), operating limits (consequences of deviation, steps to correct or avoid) and safety and health considerations (proper"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000035516,
      "SummaryText": "ties/hazards of chemicals, precautions to avoid exposure, control measures in the event contact occurs, quality control, inventory control, special or unique hazards, safety systems & their function).  Procedures must be accessible and certified to be correct at least annually.  Safe work procedures must exist for hot work, lock-out/tag-out, confined space entry, opening process equipment/piping and controlling entry to propane storage and distribution areas, for both employees and contractors.\r\nTypical documentation should include evidence that employees had input to the content and format of Operating Instructions, an index of all Operating Instructions, completed Confined Space Entry permits, completed Lock-out/Tag-out Program audit forms, etc.  Copies of the Operating Instructions are kept in the Operating Procedure File.\r\n\r\nOperating procedures are maintained in this RMP and in the heat treat process area.  Applicable employees conduct a review of these operating procedures on an annual basis.\r\n\r\n\r\nSection 7 Employee Training Program\r\n\r\nInitial training must be provided for employees involved with CAP regulated processes that covers an overview of the process, specific safety and health hazards, emergency operations including shutdown and other safe work procedures that may be applicable.  For existing employees, the employer must document that operators have the required knowledge and do not need initial training.  Refresher training must be provided every three years that covers understanding and adherence to current operating procedures.  Records must be kept that verify that an employee has received and understood the training; these records must include employee identification, date of training and method of verification.\r\n\r\nDocumentation is found primarily in the Training Files.  This file should contain evidence that employees had input into retraining frequency and other aspects of the training program.\r\n\r\n\r\nSection 8 - Mechanical Integrity Program\r\n\r\nW"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000035516,
      "SummaryText": "ritten procedures have been developed for maintaining the ongoing integrity of process equipment.  Mechanical Integrity (MI) applies to pressure vessels and storage tanks; piping systems and their components; relief and vent systems and associated devices; emergency shutdown systems; controls (sensors, alarms, interlocks); and pumps.  Employees involved with MI must be trained in an overview of the process and in specifics of the job task.  Inspection/testing must be performed using generally recognized and accepted good engineering practices, at a frequency consistent with manufacturer's recommendations or good engineering practices (or more frequently if warranted).  Inspections must be documented and include date, person performing test, equipment identifier, test description and results of test or inspection.  Deficiencies outside acceptable limits must be corrected before further use or corrected in a safe and timely manner, provided that the hazards of continued operation are properly addressed.  Employers must certify that new equipment is fabricated and installed in a suitable manner for the process and in accordance with manufacturer's instructions and design specifications.  Employers must certify that maintenance materials, spare parts and equipment are suitable for the process.\r\n\r\nDocumentation is found primarily in the Training and Maintenance files.  The Training File should contain all maintenance personnel training records; the Maintenance files should contain all inspection records, deficiency reports, etc.\r\n\r\nThe L.S. Starrett Company certifies that their propane system was designed in accordance with recognized engineering standards at the time of construction and following any subsequent renovations to the system.  The propane systems were also surveyed during the Process Hazard Analysis.  Inspection and maintenance of the tank is performed on an annual basis by Starrett's supply vendor.  Starrett leases the storage tank (and associated safety sy"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000035516,
      "SummaryText": "stems) from the propane vendor.\r\n\r\n\r\nSection 9 - Management of Change\r\n\r\nA system is used to properly manage changes to process chemicals, technology, equipment and procedures.  The Management of Change (MOC) form must include the technical basis for the change; impact of the change on employee safety & health; modifications to operating procedures; modifications to Process Safety Information; time period involved; and authorization requirements.  Employees and contractors must be informed of the change prior to implementation. Typical documentation should include MOC worksheets (including employee review sheets) and documentation from any training meetings required for a particular MOC.\r\n\r\n\r\nSection 10 Pre-Startup Safety Review\r\n\r\nPre-Startup Safety Review (PSSR) is a review of new or significantly modified facilities prior to introducing a highly hazardous chemical to the process.  The review includes confirmation that construction and equipment are in accordance with design specifications; that safety, operating, maintenance and emergency procedures are in place; that the action items have been addressed; and that training of employees is complete.\r\n\r\nTypical documentation should include any specific training performed for hazard review team members prior to their participation in a preliminary hazard review or pre-startup safety review.  The review documentation is filed in the PSSR File and should include evidence of how recommendations were implemented; these files also include any pertinent process safety information.\r\n\r\n\r\nSection 11 - Compliance Audits\r\n\r\nEmployers must certify that they have evaluated facility compliance with the CAP regulations at least every 3 years.  Certification involves verification that procedures and practices for Risk Management Plan elements are adequate and are being followed.  The audit must be performed by a team, with at least one person who is knowledgeable in the process.  A report must be generated that documents deficienci"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000035516,
      "SummaryText": "es and corrections.\r\nTypical documentation should include completed compliance audits, including evidence of how recommendations were implemented and attendance sheets from any meetings conducted to review the audit findings with employees.\r\n\r\n\r\nSection 12 - Incident Investigation\r\n\r\nA thorough investigation of any incident that could or did result in a catastrophic release of highly hazardous chemicals must take place within 48 hours of the incident.  This investigation must identify the chain of events and causes of the incident and include corrective measures that can be developed and implemented.  A team must perform the investigation with at least one person knowledgeable in the process and others who have appropriate knowledge and experience; a representative of the contractor or the chemical supplier must also be part of the team if either were involved in the incident.  A complete incident report must be developed and a system must be in place that addresses and communicates recommendations in a timely manner.\r\n\r\nTypical documentation should include completed Investigation Report Forms, including evidence of how action items were implemented and attendance sheets from any meetings conducted to review the incident with employees.\r\n\r\n\r\nSection 13 - Employee Participation\r\n\r\nThis Section outlines how employees participate in the development of the facility's RMP.  Employers must train their employees and inform them of findings from incident investigations and Process Hazards Analyses and of any relevant safety and health issues.  Employees must have access to all information developed in conformance with the RMP.\r\n\r\nAll affected employees at the facility have been involved in the training and operating procedure development.  Select employees have also been involved in performing the Process Hazard Analysis.\r\nSection 14 - Hot Work Permit\r\n\r\nThis is a permit system for all work involving flames, heat or sparks or any other activity which has the potential to ca"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000035516,
      "SummaryText": "use a fire.  It includes hot work operations (e.g., welding, cutting, etc.) conducted on or near a covered process as described in the operating procedures.  \r\nThe permit satisfies the requirements of OSHA 1910.252(a), fire prevention and protection.  The permit must indicate date(s) and the object involved with the hot work.  The permit must be kept on file while hot work proceeds.\r\n\r\n\r\nSection 15 - Contractor Safety\r\n\r\nEmployers must inform contractors of known potential fire, explosion or toxic release hazards; explain applicable provisions of the emergency action plan; develop/implement safe work practices that control the presence, entrance and exit of contract employees in covered propane storage and distribution areas; periodically evaluate contractor safety performance; and maintain a contractor injury and illness log.  This applies to contractors working in or around covered processes who perform maintenance or repairs, help with facility turnarounds or major renovations or do specialty work (e.g., chemical suppliers, instrumentation service contractors).  Employers must obtain and evaluate contractor safety performance and programs.\r\nTypical documentation should include criteria for evaluating contractor safety programs, how the criteria were applied, any on-site monitoring performed while contractors were working and actions taken when contractor deficiencies were found.\r\n\r\n\r\nSection 16 - Emergency Response Program\r\n\r\nAn emergency action plan for the entire facility is required that satisfies the requirements of 40 CFR 68.95.  The plan must include procedures for handling releases of hazardous chemicals.  Employees must be aware of the plan and trained in specific procedures.  The regulations require a written plan that addresses emergency escape procedures; procedures for employees who remain to operate critical equipment; procedures to account for all personnel; rescue and medical duties; means of reporting emergencies; and a list of persons or departme"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000035516,
      "SummaryText": "nts who can answer any questions.  Further, the regulations require an alarm system; an evacuation procedure; and training for new employees and for employees who are affected by any changes to the plan.\r\n\r\nTypical documentation should include critiques from any drills conducted, including evidence of how any recommendations were implemented and attendance sheets from any meetings conducted to review the response effort with employees.\r\nThe L.S. Starrett Company has a Comprehensive Emergency Response program for the facility.  This Emergency Response program has been coordinated with the Chairman of the Local Emergency Planning Commission (LEPC) and the Chief of the Athol Fire Department. \r\n\r\n\r\nSection 17 - Confidentiality Statement\r\n\r\nEmployers must disclose all information necessary to comply with the EPA CAP regulation and RMP to those persons completing PSIs, PHAs, operating procedures, incident investigations, emergency planning and response and compliance audits.  If confidential business information status must be maintained, the employer can enter into confidentiality agreements with the appropriate employees.\r\nTypical documentation should include copies of any confidentiality statements or correspondence with any employees.\r\nEPA has made provisions to prevent disclosure of proprietary process information or formulations.  In order to obtain Confidential Business Information (CBI) status for such proprietary information, the facility must submit justification to EPA as to why the information is proprietary.  At this time, the L.S. Starrett Company has not claimed CBI status for any of the information submitted to EPA."
    }
  ]
}