{
  "FacilityID": 1000024537,
  "FacilityName": "Univar USA Inc.",
  "FacilityStr1": "50 South 45th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Phoenix",
  "FacilityState": "AZ",
  "FacilityZipCode": "85043",
  "Facility4DigitZipExt": "3907",
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.446944",
  "FacilityLongDecDegs": "-112.158056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.univarusa.com",
  "FacilityEmailAddress": "michael.trapasso@univarusa.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Univar USA Inc.",
  "Company2Name": null,
  "CompanyDUNS": 102971785,
  "Company2DUNS": null,
  "OperatorName": "Pamela Russ",
  "OperatorStr1": "50 South 45th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Phoenix",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85043",
  "OperatorZipCodeExt": "3907",
  "FTE": 50,
  "OtherEPAFacilityID": "85043VNWTR50S45",
  "EPAFacilityID": "100000078275",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-10-18 00:00:00",
  "SafetyInspectionBy": "Phoenix Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Phoenix, AZ",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-11-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-11-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-11-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-12-17 00:00:00",
  "DeRegistrationEffectiveDate": "2017-03-09 00:00:00",
  "AnniversaryDate": "2016-11-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 33.446944,
  "FRS_Long": -112.158056,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000030005,
      "AltID": "Containerized Storage",
      "FacilityID": 1000024537,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000035989,
          "ProcessID": 1000030005,
          "ChemicalID": 55,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000030327,
          "ProcessID": 1000030005,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000020829,
              "Process_NAICS_ID": 1000030327,
              "SafetyReviewDate": "2008-05-12 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "UN specification containers (USDOT)",
              "FR_Comments": null,
              "HazardReviewDate": "2008-05-14 00:00:00",
              "ChangeCompletionDate": "2009-04-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Training and SOPs",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Hazard review recommendations fully implemented.",
              "OpProceduresReviewDate": "2009-05-19 00:00:00",
              "TrainingReviewDate": "2009-01-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-04-27 00:00:00",
              "EquipmentInspectionDate": "2009-03-11 00:00:00",
              "EquipmentTested": "Forklift, drum picker, dock leveler, trailer stand",
              "ComplianceAuditDate": "2011-10-13 00:00:00",
              "AuditCompletionDate": "2013-04-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2009-04-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000021135,
                  "PreventionProgram2ID": 1000020829,
                  "ProcessChemicalID": 1000035989
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000024537,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-04-06 00:00:00",
    "ERTrainingDate": "2011-04-18 00:00:00",
    "CoordinatingAgencyName": "Phoenix Fire department",
    "CoordinatingAgencyPhone": "6022626334",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024537,
      "SummaryText": "1.Accidental Release Prevention and Emergency Response Policies\r\n\r\nAt Univar USA Inc. (Univar) we are strongly committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\r\n\r\n2.The Stationary Source and the Regulated Substances Handled\r\n\r\nUnivar is a wholesale chemical distributor serving a number of U.S. industries. Founded in 1924, the company supplies the food industry, chemical compounders, pharmaceuticals, mining, forest products, oil and gas producers, electronics, coatings, public utilities and many other key industries with the chemical raw materials required to produce or refine products used in numerous end-use markets.\r\n\r\nUnivar is an active and long-term member of the National Association of Chemical Distributors (NACD) and complies with the Responsible Distribution Process (RDP), an environmental, health and safety improvement initiative.\r\n\r\nOur facility¿s primary activities encompass the blending, repackaging, bulk and warehouse storage of chemicals, and their distribution to local industries via Univar¿s fleet of delivery trucks or by one of our approved common carriers. One of the chemicals stored and handled at our facility, hydrofluoric acid >50%, is subject to EPA¿s Risk Management Program rule (40 CFR Part 68). This product is delivered to our facility by common carrier truck in sealed, factory packaged, UN Specification containers (55-gallon drums) and stored in our warehouse until distributed to end-use customers. We warehouse hydrofluoric acid in its original factory-packaged sealed containers, and do not open, use or repackage the material in any way prior to sale. We must maintain sufficient inventory of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024537,
      "SummaryText": "hydrofluoric acid to meet customer demand, but for safety and business reasons we also attempt to maintain those levels as low as possible. A key requirement of EPA¿s RMP rule is the preparation and submission of a Risk Management Plan, contained herein. The contents of the RMP Plan are prescribed by EPA, including this Executive Summary.\r\n\r\n3.The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\r\n\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set forth in 40 CFR Part 68. This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition. The following sections briefly describe the elements of the general release prevention program that is in place at our stationary source.\r\n\r\nProcess Safety Information\r\nUnivar maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\r\n\r\nProcess Hazard Analysis (PHA)\r\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is the ¿What If¿ method. The studies are undertaken by a team of qualified personnel with expertise in process safety management and process operations and are revalidated at a regular interval of five years. Any findings related to the hazard analysis are addressed in a timely manner. The most recent PHA was performed on 05/14/2008.\r\n\r\nOperating Procedures\r\nFor the purposes of safely conducting activities within our covered processes, Univar maintains written operating procedures. These procedures address various modes of operation such as startup, normal operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is reviewed and certified as being current at least annually and is readily accessibl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024537,
      "SummaryText": "e to operators involved in the processes. The most recent review/update of operating procedures was completed on 9/28/2011.\r\n\r\nTraining\r\nUnivar has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. All new employees receive their initial training within 90-days of hire. Refresher training is provided at various intervals, but typically between one and three years, depending on the subject matter.\r\n\r\nMechanical Integrity\r\nUnivar and our contractors conduct documented maintenance checks on process equipment to ensure safe operations. Process equipment examined by these checks includes among others, forklifts, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. The most recent review/revision of our maintenance procedures was performed on 04/27/2009.\r\n\r\nManagement of Change\r\nWritten procedures are in place at Univar to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and provided training to deal with the modification.\r\n\r\nPre-startup Reviews\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Univar. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\nUnivar conducts audits on a regular basis to determ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024537,
      "SummaryText": "ine whether the provisions set forth by the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner. The most recent compliance audit pertaining to process safety/RMP Plan was conducted on 10/13/2011.\r\n\r\nIncident Investigation\r\nUnivar promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.  \r\n\r\nEmployee Participation\r\nUnivar believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as apart of the facility¿s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\r\n\r\nContractors\r\nUnivar may hire contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Univar has a strict policy of informing the contractors of known potential hazards related the contractor¿s work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur. Following evaluation, selection and completion of the initial job, each contractor's performance is rated by a senior-level operations manager. Any contractor whose performance is rated as unsatisfactory is subject to disqualification from further work.\r\n\r\nChemical-specific prevention steps undertaken at our facility include the following:"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000024537,
      "SummaryText": "¦Maintaining minimal inventory\r\n¦Developing Standard Operating Procedures on safe handling of the material and reviewing\r\nannually to ensure they are maintained up-to-date\r\n¦Emergency response training and equipment to minimize the impact of a release\r\n¦Storage and handling of the material in appropriate and sealed UN Specification containers,\r\nand in designated locations based on compatibility and safety considerations\r\n¦Material remains in its original sealed factory packaging ¿ containers are not opened for any\r\nreason\r\n\r\n4.Five-year Accident History\r\n\r\nOur facility has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, comprehensive operating procedures and frequent training, there have been no accidental releases of hydrofluoric acid.\r\n\r\n5.Emergency Response Plan\r\n\r\nUnivar carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response. The most recent update/revision of the emergency response plan for our facility was on 04/06/2009.\r\n\r\nOur emergency plan has been coordinated and verified with the City of Phoenix Fire Department, which is the primary local emergency response agency, as well as with the Maricopa County Local Emergency Planning Committee (LEPC) and City of Phoenix Police Departmrnt. Updates to this plan are distributed to appropriate local emergency response organizations. Additionally, joint training and practice drills with the Phoenix"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000024537,
      "SummaryText": "Fire Department have been conducted, as well as annual site visits by the fire department to ensure they remain familiar with our facility and processes.\r\n\r\n6.Planned Changes to Improve Safety\r\n\r\nSeveral recommendations to prevent or further mitigate the potential for releases of hydrofluoric acid during storage or handling resulted from the hazard review (PHA) that was conducted as part of our prevention program.  As a result, some of the major steps taken recently to improve safety at our facility included:\r\n·Amending our operating procedures to require that a tractor be connected to trailer during the unloading and loading process\r\n.Increasing the level of security by installing redundant vehicle entrance/exit gates and additional upgraded surveillance equipment\r\n·Amending our operating procedure to require outbound deliveries of hydrofluoric acid ship on van trailers only\r\n.Amending the Inspection and P.M. Program to expand the scope of equipment covered\r\n.Developing and implementing a truck loading safety checklist and requiring its usa by loaders and drivers\r\n.Amending our operating procedures to prohibit Will Calls of hydrofluoric acid\r\n.Instituting a policy to provide material handlers with a Gatorade-type drink to reduce the potential for suffering heat exhaustion or heat stroke while working on the job\r\n\r\nThe above changes were implemented by April 27, 2009."
    }
  ]
}