{
  "FacilityID": 1000101555,
  "FacilityName": "Central Cold Storage",
  "FacilityStr1": "13526 Blackie Road",
  "FacilityStr2": null,
  "FacilityCity": "Castroville",
  "FacilityState": "CA",
  "FacilityZipCode": "95012",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.757756",
  "FacilityLongDecDegs": "-121.742950",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 76126317,
  "ParentCompanyName": "The VPS Companies",
  "Company2Name": null,
  "CompanyDUNS": 76126317,
  "Company2DUNS": null,
  "OperatorName": "Fred Haas",
  "OperatorStr1": "13526 Blackie Road",
  "OperatorStr2": null,
  "OperatorCity": "Castroville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95012",
  "OperatorZipCodeExt": null,
  "FTE": 41,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000140956",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-04-17 00:00:00",
  "SafetyInspectionBy": "CalOSHA PSM Division",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-07-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-07-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-07-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-07-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.75845,
  "FRS_Long": -121.742994,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000126067,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000101555,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000157713,
          "ProcessID": 1000126067,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000127460,
          "ProcessID": 1000126067,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000108612,
              "Process_NAICS_ID": 1000127460,
              "SafetyReviewDate": "2021-01-04 00:00:00",
              "PHA_Date": "2020-07-23 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-07-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "no flow, low-level, lack of maintenance, operator error, design deficiency, physical damage, vandalism/terrorism, power failure",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "diffusion tank",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "diffusion tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "personnel meters",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Instituted annual safety testing, developed SOPs to meet IIAR, labeled emergency isolation valves",
              "OpProceduresReviewDate": "2021-12-14 00:00:00",
              "TrainingReviewDate": "2022-06-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Tailgates",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-04-12 00:00:00",
              "EquipmentInspectionDate": "2022-04-26 00:00:00",
              "EquipmentTested": "Sensor calibration",
              "ChangeMgmtDate": "2019-03-31 00:00:00",
              "ChangeMgmtReviewDate": "2021-03-18 00:00:00",
              "PreStartupReviewDate": "2019-03-31 00:00:00",
              "ComplianceAuditDate": "2020-06-11 00:00:00",
              "AuditCompletionDate": "2021-12-11 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2020-12-17 00:00:00",
              "HotWorkPermitReviewDate": "2021-02-10 00:00:00",
              "ContractorSafetyReviewDate": "2022-05-09 00:00:00",
              "ContractorSafetyEvalDate": "2021-01-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000136193,
                  "PreventionProgram3ID": 1000108612,
                  "ProcessChemicalID": 1000157713
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000127461,
          "ProcessID": 1000126067,
          "NAICSCode": "115114",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000101555,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-02-15 00:00:00",
    "ERTrainingDate": "2021-05-14 00:00:00",
    "CoordinatingAgencyName": "Monterey County Public Health Dept.",
    "CoordinatingAgencyPhone": "8317554505",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "8 CCR 5189, 8 CCR 3220, CalARP Title 19, 8 CCR 6184"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000101555,
      "SummaryText": "s and dedication of risk minimization and safety improvement for their employees and surrounding community. Central Cold Storage will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the RMP/PSM, related attachments, and program elements will be incorporated consistent with Central Cold Storage's internal review practices, and Central Cold Storage will maintain the most current versions onsite. Thus, the most current version RMP/PSM and related documents and elements maintained onsite may vary slightly from the information in submittals made to EPA and other regulatory agencies.\r\n\r\nRefer to the master tracking log which will include scheduled improvements to reduce accidental releases either in process or planned for at this time."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000101555,
      "SummaryText": "until such time as an outside responding agency assumes that role. \r\n\r\nCentral Cold Storage management will oversee evacuation and remain in control until hazmat / fire department personnel arrive, then Incident Command will be assumed by the senior department official at the scene. The fire department Incident Commander will be responsible for issuing notices for public evacuation and/or sheltering in place, if necessary. Central Cold Storage management will be responsible for making initial contact with (not in particular order) Fire Department via 9-1-1; Monterey County Environmental Health; CalOES, NRC, and any other agencies that need to be contacted. Central Cold Storage will rely on community responders for medical assistance as necessary. Responsibility for cleanup after the release is spelled out in the ERP.\r\n\r\nB-6   PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nEmployees, community safety, the environment and product care are primary concerns at this facility.  Several PHA studies have been conducted at Central Cold Storage and each time the study team made recommendations for additional safety.  The date of the last PHA does not fall in line with the 5-year program update and the revalidation will begin in late July 2022.  \r\n\r\nCentral Cold Storage will respond to all suggested mitigation measures promptly. Central Cold Storage has established completion schedules for proposed actions either within the allotted timeframe given by regulation or based on the timetable agreed upon between the facility and Monterey County CUPA. Management responses and support will be consistent with Central Cold Storage's commitment to safe and environmentally responsible operations.\r\n\r\nCentral Cold Storage recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility. As such, this document and related attachments and program elements will evolve as Central Cold Storage continues their ongoing focu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000101555,
      "SummaryText": "l.  Central Cold Storage has established a Management System procedure to address any shortcomings, which the audit may find.  A priority list is developed by Central Cold Storage and National Custom Packing and target dates are set for any changes or corrections.   (Addressed under Compliance Audit Element)   \r\n\r\nProgram Consolidation\r\nThe documentation requirements of these programs have been consolidated in the documenting and record filing process. The documents and records are kept as identified in each element of the program.  The following identifies the practices and procedures for:\r\n\r\n\tProcess Safety Information\r\n\tProcess Hazard Analysis\r\n\tOperating Procedures\r\n\tTraining\r\n\tMechanical Integrity\r\n\tManagement of Change\r\n\tPre-Startup Review\r\n\tCompliance Audits\r\n\tIncident Investigations\r\n\tEmployee Participation\r\n\tHot Works\r\n\tContractors\r\n\r\nB-4   FIVE YEAR ACCIDENT HISTORY\r\n\r\nThe CalARP regulations require a review of the 5-year accident history at the regulated facility. The history must include all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. (19 CCR 2750.9) Central Cold Storage assured no reportable release of ammonia had occurred during the past 5 years (2017-2022).\r\n\r\nB-5   EMERGENCY RESPONSE PROGRAM\r\n\r\nCentral Cold Storage has written an Emergency Response Plan (ERP) that cover accidental hazardous materials release, fire, earthquake, and other emergencies. Central Cold Storage will rely on outside responders from the Monterey County HazMat Team and the current refrigeration contractor for mitigation of releases if there is a requirement to enter atmospheres greater than an IDLH condition (300 ppm for ammonia). The ERP details the steps for required notification of outside agencies and the public and states that the Central Cold Storage Emergency Coordinator will be in charge"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000101555,
      "SummaryText": "ents)\r\n\r\n4) Written procedures and forms are in place detailing how and when the facility must investigate accidental/incidental releases.  Central Cold Storage investigates releases and near misses for their facility as well as National Custom Packing that could have resulted in a release of anhydrous ammonia.  Recommendations are addressed and corrected by facility management.  Reports are kept for at least five years. (Addressed under Incident Investigation Elements) \r\n\r\n5) Certification of refrigeration operators to safely operate the refrigeration system.  Central Cold Storage and National Custom Packing certifies operators following completion of operator training and confirmation of the operator's ability to apply what they have learned.  (Addressed under Training Element)\r\n\r\n6) Employee involvement in the Prevention Program.  This is addressed on two levels.  First, refrigeration equipment operators participate in the planning and evaluation of the Prevention Programs (e.g., Hazard Review study team, writing and/or reviewing operating procedures, Incident Investigation team, etc.).  In addition, some of these elements are reviewed and trained on annually or every three years or if a change is made at minimum as required by the code and industry standards. This involvement encourages ownership of the Prevention Program and positively affects the operators' day-to-day activities.  \r\n\r\nSecond, all Central Cold Storage and National Custom Packing employees receive ammonia awareness training.  Additionally, they have access to the complete CalARP, the IIPP and more for review, comment and input.  These activities improve the overall safety of the employees.\r\n\r\n6) Compliance Audits: Verification of Central Cold Storage's compliance with the CalARP program.  The audit process is an important tool to confirm whether each of the elements in the Prevention Program has been implemented and properly documented by Central Cold Storage and National Custom Packing personne"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000101555,
      "SummaryText": "ocess Safety Information Element)\r\n\r\n2) Provide thorough team evaluation of the ammonia refrigeration system.  The types of natural and human caused external events considered in the hazard review include: \r\n\u0095\tearthquake, tornado, extreme severe weather, flood \r\n\u0095\tinadequate physical security devices (locks, lighting, fences) may lead to outside threats which may lead to an anhydrous ammonia leak \r\n\u0095\tlack of security awareness training for employees to help identify internal threats\r\n\u0095\tan airplane strike \r\n\u0095\tlack of workplace violence policy and/or procedures could lead to a potential anhydrous ammonia release \r\n\u0095\tanhydrous ammonia theft from equipment that is outside and not monitored \r\n\u0095\ta suspicious package is delivered with the intent to cause an anhydrous ammonia release \r\n\u0095\ta bomb threat that could cause an anhydrous ammonia release \r\n\r\n3) Written procedures and policies are in place that establish how the refrigeration system is operated and maintained.  Central Cold Storage shall develop standard operating procedures for the safe and normal operation and shut-down of the ammonia refrigeration system. The manufacturer's OEM manual may be used for reference.  The standard operating procedures are periodically reviewed to ensure they reflect the current operating practices.\r\n\r\nPrevention is the primary reason regular and scheduled maintenance is performed on the ammonia refrigeration system.  The system shall follow industry RAGAGEP, manufacturer recommendations, and/or industry practice to help maintain the system.  The facility utilizes outside contractors to perform routine and emergency maintenance on the system.  (Addressed under Operating Procedures and Maintenance Elements)\r\n\r\nAll safety recommendations developed by the team are reviewed and addressed by both (CCS & NCP) facility management.   A priority list is developed, and target dates are set for the recommendations to reduce or eliminate hazards.  (Addressed under Hazard Review and Maintenance Elem"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000101555,
      "SummaryText": "is study and procedures for operating, training, maintenance, emergency response, and others. The RMP sections pertain to management systems and include the Hazard Assessment (Offsite Consequence Analysis) Report.\r\n\r\nFederal regulations require reporting when there is a release of ammonia exceeding 100 pounds in 24 hours.  State regulations require reporting when there is a release or a threat of a release of ammonia or other hazardous material.  \r\n\r\nAll releases and near misses are to be recorded using the incident investigation forms and reported to the CUPA.  All releases are to be monitored and all readings recorded.  All releases and near misses are to be reviewed to develop procedures that may prevent future incidents.\r\n\r\nB-2   STATIONARY SOURCE ACTIVITIES AND REGULATED SUBSTANCES HANDLED\r\n\r\nThe refrigeration system/process is a direct, closed loop, mechanical refrigeration system. Anhydrous ammonia is used as the refrigerant in the Central Cold Storage refrigeration system and is the only regulated substance.  The ammonia system is used for freezer storage.  \r\n\r\nThe original freezer building was constructed in 1975 and the additions were built in 1981 and 1985.  Refrigeration coils for room cooling were added to National Custom Packing (NCP) processing rooms and were tied into the main refrigeration system.  The coils were added to NCP 2 in 1999 and to NCP 1 in 2002.   \r\n\r\nB-3\tACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nCentral Cold Storage Prevention Program is described in the CalARP program.  The Prevention Program implemented by Central Cold Storage is essential to help prevent or minimize the effects if a release occurs.\r\n\r\nKey objectives of Central Cold Storage Prevention Program are briefly described below:\r\n\r\n1) Maintain current and complete refrigeration system technical information.  The facility has retained the original manufacturer OEM manuals, equipment drawings, etc. for reference purposes and aid in maintenance activities. (Addressed under the Pr"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000101555,
      "SummaryText": "B.    EXECUTIVE SUMMARY\r\n\r\nThe EPA RMP regulation requires that an Executive Summary be provided as part of the registration submitted to the EPA. \r\n\r\nNote: This summary includes additional information not included in the RMP Submit to assist Central Cold Storage management, process operators, technicians, contractors plus all involved and affected employees towards safe operation. In addition, some of the detail provided within this summary was excluded from the submitted RMP as current public access to this detail could expose the facility and personnel to terrorist or criminal activity.\r\n\r\nThis process does not meet the requirements of Program 1. The process is subject to OSHA's PSM standard.  Therefore, this RMP is written to meet the EPA Program 3 level of compliance. \r\n\r\nThis program was updated to satisfy the required 5 yr update per section 2745.10(a) (1) and to make corrections as necessary. All elements have been reviewed and updated.\r\n\r\nThe following areas are addressed in this summary:\r\n1.\tAccidental release prevention and emergency response policies at the stationary source\r\n2.\tThe stationary source and regulated substances handled\r\n3.\tThe worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures \r\n4.\tThe accidental release prevention program and chemical-specific prevention steps\r\n5.\tThe five-year accident history\r\n6.\tThe emergency response program\r\n7.\tPlanned changes to improve safety\r\n\r\nB-1   ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \r\n\r\nCentral Cold Storage is committed to complying with all of the regulatory requirements of the EPA Risk Management Program.  Central Cold Storage has developed their Risk Management Plan / Process Safety Management (RMP/PSM) making up the CalARP program to document policies and address the implementation of these regulations. The PSM sections pertain to the prevention of accidental releases and include the Process Hazard Analys"
    }
  ]
}