{
  "FacilityID": 1000024577,
  "FacilityName": "City Brewing Company, LLC",
  "FacilityStr1": "925 South 3rd Street",
  "FacilityStr2": null,
  "FacilityCity": "La Crosse",
  "FacilityState": "WI",
  "FacilityZipCode": "54601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55063",
  "LEPC": "La Crosse County LEPC",
  "FacilityLatDecDegs": "43.803056",
  "FacilityLongDecDegs": "-091.253056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 196889963,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City Brewing Company, LLC",
  "OperatorStr1": "925 South 3rd Street",
  "OperatorStr2": null,
  "OperatorCity": "La Crosse",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54601",
  "OperatorZipCodeExt": null,
  "FTE": 525,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000054353",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "632028430-P10",
  "SafetyInspectionDate": "2011-10-31 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-02-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-02-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-02-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-02-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 43.803056,
  "FRS_Long": -91.253056,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000030086,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000024577,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000036189,
          "ProcessID": 1000030086,
          "ChemicalID": 56,
          "Quantity": 90000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000030407,
          "ProcessID": 1000030086,
          "NAICSCode": "31212",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000026037,
              "Process_NAICS_ID": 1000030407,
              "SafetyReviewDate": "2011-07-15 00:00:00",
              "PHA_Date": "2011-08-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-03-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-10-27 00:00:00",
              "TrainingReviewDate": "2011-06-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-07-15 00:00:00",
              "EquipmentInspectionDate": "2011-02-21 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": "2011-08-26 00:00:00",
              "ChangeMgmtReviewDate": "2011-10-26 00:00:00",
              "PreStartupReviewDate": "2011-10-02 00:00:00",
              "ComplianceAuditDate": "2011-09-14 00:00:00",
              "AuditCompletionDate": "2013-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2011-06-21 00:00:00",
              "HotWorkPermitReviewDate": "2011-06-21 00:00:00",
              "ContractorSafetyReviewDate": "2011-07-15 00:00:00",
              "ContractorSafetyEvalDate": "2011-06-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000031061,
                  "PreventionProgram3ID": 1000026037,
                  "ProcessChemicalID": 1000036189
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000024577,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-08-06 00:00:00",
    "ERTrainingDate": "2011-10-20 00:00:00",
    "CoordinatingAgencyName": "La Crosse Fire Department",
    "CoordinatingAgencyPhone": "6087897260",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024577,
      "SummaryText": "EXECUTIVE SUMMARY\r\nThe City Brewing Company, LLC stores ANHYDROUS AMMONIA at the City Brewery in an amount that \r\nexceeds the threshold established by EPA for Risk Management Planning.  The City Brewing Company, \r\nLLC believes that risks associated with ANHYDROUS AMMONIA storage at this facility are well managed.\r\n\r\nSOURCE AND PROCESS DESCRIPTION\r\nRefrigeration is a critical component of malt beverage production.  Refrigeration is required for chilling water \r\nand beer, and for controlling air temperature in storage cellars.  Refrigeration is provided through \r\nevaporation of liquid anhydrous ammonia by a heat source.  Evaporated ammonia gas is contained in \r\nclosed loop system where it is mechanically compressed back into a liquid state for re-use on demand.  \r\nLiquid ammonia is moved by system pressure from storage through piping to locations where refrigeration \r\nis needed.\r\n\r\nSUMMARY OF MAJOR HAZARDS\r\nAmmonia is a hazardous substance.  As a gas, it is severely irritating to the eyes and moist skin and \r\nmucous membranes.  As a liquid, contact can cause freezing and third degree burns.  Exposure to \r\nconcentrations of ammonia gas or vapor (approximately 2,500 to 6,500 ppm) for up to two hours induce \r\nchemical pneumonitis; burns to the eyes, face and mouth; severe local edema (fluid in lungs); and death \r\nafter 30 minutes.\r\n\r\nThe consequence of equipment failure or improper control of refrigeration system temperature and \r\npressure could be a sudden release of ammonia.  In the refrigeration system, ammonia is stored as a \r\nliquid under pressure, then evaporated into a low pressure gas-vapor state as it cools its intended heat \r\nsource (latent heat of vaporization), then compressed into a high pressure gas state, and then \r\ncondensed by by evaporative condensers once again into a liquified state and returned to storage.  \r\nAccidental release of ammonia could occur during any of these system processes.\r\n\r\nAn accidental release of liquid ammonia under elevated press"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024577,
      "SummaryText": "ure would created an airborne mixture of \r\nammonia vapor and very fine liquid droplets that would not fall to the ground.  The droplets would entrain \r\nair quickly as they try to evaporate.  Evaporation of the droplets would cool the air creating a cold \r\nmixture of air and ammonia vapor.  The mixture would be denser than air forming a cloud that would \r\ntend to stay at ground level until evaporation to a gas was complete.  A release of liquid ammonia inside \r\na building would cause an initial overpressure condition due to flash vapor expansion and underpressure \r\ncondition due to air cooling from droplet interaction.  Instantaneous over- or under-pressure greater than \r\none pound per square inch (psi) could cause explosion effects such as structural damage to windows \r\nand blowout panels; greater than 2 psi could cause explosion effects such as shattering of concrete or \r\ncinder block walls.  In addition, ammonia can be explosive at concentrations between 15% and 25% by \r\nvolume in air with ignition by a high intensity source.\r\n\r\nAn accidental release of gaseous ammonia vapor at various temperature and pressure would create a \r\nbuoyant ammonia jet less dense than air.  The rate of release would be much less than that of liquid \r\nammonia.\r\n\r\nCONSEQUENCES OF FAILURE TO CONTROL THE HAZARDS\r\nEPA has established a toxic endpoint value of 200 ppm as the maximum airborne concentration below \r\nwhich an individual could be exposed for up to one hour without experiencing serious health effects or \r\nsymptoms that would impair the ability of an individual to self rescue.\r\n\r\nA worst case release senario at the facility is defined as the release of 56,300 pounds of liquid \r\nanhydrous ammonia from a liquid storage receiver which represents the largest single container (vessel) \r\nat the facility.  According to a computer program (RMP Comp) an accidental release of 56,300 pounds \r\nof ammonia within a 10 minute period would reach a toxic endpoint at a distance of 2.8 miles.  Accordi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024577,
      "SummaryText": "ng \r\nto 1991 Bureau of Census computer database (Landview III), the worst case release would affect a \r\npopulation of 15,000 people, schools, residences, hospitals, public recreation areas, and commerical, \r\noffice, or industrial areas within the radius.\r\n\r\nA more likely alternative release senario at the facility is defined as a 1/2 inch diameter leak in ammonia \r\nmanifold piping within a 10 minute period.  Safety shutoff valves would activate in this instance as a \r\nrelease control.  Ammonia system operating pressure is 150 psi and at this pressure the release \r\nwould be 540 pounds per minute for a 1/2 inch diameter hole.  According to a computer program (RMP \r\nComp) a release of 540 pounds of ammonia for 10 minutes would reach a toxic endpoint at a distance of \r\n0.2 miles.  According to a 1991 Bureau of Census computer database (Landview III), the more likely \r\nalternative release would affect a population of 280 people, residences, and commercial, office, or \r\nindustrial areas within this radius.\r\n\r\nIn either release senario, release would not affect any environmental receptor such as a park, forest, \r\nmonument, wildlife sanctuary, preserve, refuge, or Federal wilderness area.\r\n\r\n5 YEAR ACCIDENT HISTORY\r\nThere has not been any accidental release of ammonia from the refrigeration system since 1994 that \r\ncaused any of the following:\r\n* On-site death, injury, or significant property damage.\r\n* Known offsite death, injury, property damage, environmental damage, evacuation, or sheltering in \r\nplace.\r\n\r\nEXPLANATION OF HOW RELEASES ARE PREVENTED\r\nOverall responsibility for coordination of the Ammonia Refrigeration System Risk Management Plan \r\nis assigned to the Director of Plant Engineering.  Operating Engineers and Refrigeration Mechanics \r\nperform operation and maintenance of the refrigeration system.  Each of these key personnel is aware \r\nof the provisions of the Ammonia Refrigeration system Risk Management System Risk Management \r\nPlan and has contributed to the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024577,
      "SummaryText": "construction of the plan, the components of which are as follows:\r\n\r\n* Maintenance\r\nGood engineering practices, equipment manufacturer's recommendations, and operating experience \r\ndetermine the means for system inspection, testing and preventive maintenance.  Routine maintenance \r\nfunctions include:\r\n- periodic walk-throughs to find unusual or increasing vibration, incipient leaks, or other indication of \r\npotential failure that could lead to a release;\r\n- inspection of pressure vessels by State certified ASME engineers and Hartford Insurance pressure \r\nvessel inspectors are performed at random several times per year and every 3 years on the entire \r\nsystem;\r\n- periodic inspection and maintenance of pressure relief valves;\r\n- periodic inspection and calibration of liquid level, temperature and pressure instruments, switches, \r\nand shut down devices that have safety implications; and\r\n- periodic inspection of major powered equipment such as compressors, pumps, large fans, bearings, \r\ncouplings, shaft seals, mountings, and such for vibration or other incipient mechanical failure.\r\n\r\nMaintenance employees are trained to perform their work.  Maintenance contractors are hired based \r\non their qualifications to perform work on ammonia refrigeration equipment.  Spare parts are purchased \r\nfrom refrigeration equipment vendors.\r\n\r\n* Process Safety Information\r\nInformation needed to safely operate the ammonia refrigeration system is available to personnel \r\ninvolved with the system, including:\r\n- material safety data sheets for anhydrous ammonia;\r\n- block flow diagram for the plant;\r\n- a list of safety relief valves;\r\n- a list of high- and low- level, high- and low- pressure, shutdown and alarm devices;\r\n- equipment manufacturers operating instructions;\r\n- equipment drawings & specifications.\r\n\r\n*Process Hazard Analysis\r\nPotential hazards associated with the ammonia refrigeration system have been evaluated by means \r\nof a general safety review of drawings and a What-If anal"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000024577,
      "SummaryText": "ysis and Failure Mode and Effects analysis \r\non a potential failure to each high risk critical system.  Plant conditions or operating procedures that \r\ncould lead to an accident have been identified and improved.\r\n\r\n* Operating Procedures\r\nWritten operating procedures are constructed to address the following issues for normal operations, \r\nnew equipment startup, equipment shutdown, emergency operation due to leaks or other foreseable \r\noperating problems, and emergency equipment shutdown procedures:\r\n- relevant process safety information and operating experience;\r\n- changes to ammonia refrigeration equipment;\r\n- safe operating limits for temperature & pressure;\r\n- consequences for operating outside the safe operating limits;\r\n- procedures to correct errant operating conditions to return to safe operating limits.\r\n\r\nOther safe working practices also are applied to ammonia refrigeration system work such as \r\nprocedures for lockout-tagout, confined space entry, opening process equipment and piping, \r\nand control of access to the facility.\r\n\r\n* Training\r\nEach employee who operates ammonia refrigeration equipment is trained to operate it safely.  \r\nTraining includes periodic review of operating procedures.  Improvements to operating procedures \r\nare implemented based on these periodic reviews.  Refresher training is every 3 years.\r\n\r\n* Management of Change\r\nA change in ammonia refrigeration equipment or change to system operating limits starts a process \r\nto review its affect on safety.  The change review process applies both to equipement that is removed \r\nand not replaced in kind, as well as re-routing of ammonia piping and inadvertant change resulting \r\nfrom maintenance activities.  Process hazard analysis is applied to the change.  System drawings, \r\noperating procedures, and equipment specifications are revised in the Risk Management Plan as \r\nnecessary.  Any need to improve on the design of system change for safety reasons is addressed \r\nbefore the startup of the m"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000024577,
      "SummaryText": "odified system.  A secondary pre-startup review provides an independent \r\nrecheck that changes are in a condition to be operated safely.  The design engineer, plant engineer, \r\nand refrigeration mechanic personnel make up this management of change review process.\r\n\r\n* Compliance Audits\r\nA compliance audit is planned every 3 years to make sure that employees are properly performing \r\ntheir duties regarding the ammonia refrigeration system.  Any deficiency found in an audit is corrected.\r\n\r\n* Accident Investigation\r\nA procedure is established to investigate any event that causes or comes close to causing an \r\naccidental release of ammonia.  In this case, a team will be assigned to document the causes \r\nof the accident and correct deficiencies in a timely mannner.\r\n\r\n* Hot Work Permits\r\nA procedure is established to issue permits for work to be performed on or near the ammonia \r\nrefrigeration system that produces a spark or flame, such as welding, braing, cutting, or grinding.  \r\nThe permits communicate the hazards of the work and precautions to prevent fires to those \r\nperforming the hot work.\r\n\r\n* Contractors\r\nIf mechanical and refrigeration contractors are used for construction, maintenance, or repair of the \r\nammonia refrigeration system, a procedure is established to evaluate the qualifications of the \r\ncontractor and inform the contractor of facility safety and worker training requirements.  Safety \r\ninformation for any addition or change to the refrigeration system is incorporated into the Risk \r\nManagement Plan.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\nA facility Emergency Action Plan is established to give direction to employhees for safe response \r\nactions to be taken during fire and other emergencies.  Potential ammonia release is addressed \r\nin the Emergency Action Plan including notification procedures, evacuation procedures, and \r\nmedical assistance procedures.\r\n\r\nOperating Engineers and Refrigeration Mechanics are knowledgeable about the ammonia \r\nrefrigeration sy"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000024577,
      "SummaryText": "stem and are trained in first responder awareness.  These personnel identify and \r\nrepair any minor ammonia gas leak.  In the event of a substantial ammonia gas leak, these \r\npersonnel are knowledgeable about the location of emergency isolation valves on the ammonia \r\nrefrigeration system.  If possible, the isolation valves would be secured from an unaffected area \r\nin response to a substantial release.  In the event of major ammonia gas release, only personnel \r\ntrained in first responder operations are allowed to enter the affected area with proper personal \r\nprotective equipment to secure isolation valves.\r\n\r\nArrangements are established with the local emergency response agency, the fire department, \r\nand local hospital."
    }
  ]
}