{
  "FacilityID": 1000099425,
  "FacilityName": "ThermaTru Corporation",
  "FacilityStr1": "601 RE Jones Rd",
  "FacilityStr2": null,
  "FacilityCity": "Butler",
  "FacilityState": "IN",
  "FacilityZipCode": "46721",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18033",
  "LEPC": "Dekalb County LEPC",
  "FacilityLatDecDegs": "41.42422",
  "FacilityLongDecDegs": "-84.86381",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 115300105,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ThermaTru Corporation",
  "OperatorStr1": "601 RE Jones Rd",
  "OperatorStr2": null,
  "OperatorCity": "Butler",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46721",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Anderson",
  "RMPTitle": "Safety Manager",
  "FTE": 1037,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000216287",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "033-30711-00019",
  "SafetyInspectionDate": "2022-01-24 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-02-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2022-02-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-02-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000122993,
      "AltID": "Cyclopentane/Isopentane",
      "FacilityID": 1000099425,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000124406,
          "ProcessID": 1000122993,
          "NAICSCode": "332321",
          "_desc": {
            "NAICS_CODE": "332321",
            "NAICS_DESCRIPTION": "Metal Window and Door Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000124407,
          "ProcessID": 1000122993,
          "NAICSCode": "326199",
          "_desc": {
            "NAICS_CODE": "326199",
            "NAICS_DESCRIPTION": "All Other Plastics Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000153795,
          "ProcessID": 1000122993,
          "ChemicalID": 115,
          "Quantity": 70165.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 115,
            "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
            "CASNumber": "78-78-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000653795,
          "ProcessID": 1000122993,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000099425,
      "SummaryText": "RMP Executive Summary \n\nTherma-Tru Corporation -Butler, Indiana \n\n\n\nA. Description of Stationary Source and Regulated Substances Handled\n\nTherma-Tru Corporation manufactures steel and fiberglass residential and commercial doors using four (4) on-site process lines.  One of the most important components of Therma-Tru's manufacturing process is the production of polyurethane foam insulation. Three (3) primary raw materials are used in foam production are in the production of foam insulation to fill the door cavities: Polymeric Diphenylmethane Diisocyanate (also referred to as PMDI or \"A-Side\"), Polyol (part of the \"B-Side\" mixture), and a mixture of Cyclopentane and Isopentane (known as the blowing agent and also part of the B-Side mixture).  The three (3) chemicals are eventually combined within a door cavity, producing a chemical reaction and generating insulative foam within the cavity.  In Therma-Tru's foaming process, Cyclopentane/Isopentane acts as the blowing agent. The blowing agent is the active ingredient in the process that will give the foam its cellular structure, reducing the foam's density and increasing its thermal and acoustic insulation.\n\n\n\nCyclopentane/Isopentane chemical is delivered to the facility via a tanker truck.  The liquid chemical is transferred from the delivery vehicle into an exterior aboveground storage tank (AST) using a transfer pump at the site.  A vapor recovery system is employed to prevent the release of potentially flammable vapor into the atmosphere during the transfer by directing vapor displaced from the bulk AST headspace back into the delivery truck (creating a closed system). Once stored in the bulk AST, Cyclopentane/Isopentane is transferred to an interior blending room, where it is mixed with Polyol to form the B-Side mixture. From there, the B-Side mixture is transferred to production equipment out at one of the manufacturing lines, and eventually to the foaming mixhead.  Meanwhile, the A-Side chemical is also transferr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000099425,
      "SummaryText": "ed from bulk storage out to the foaming mixhead.  There, the A-Side and B-Side chemicals are simultaneously injected into a door cavity.  The two components chemically react, rapidly expanding to fill the door cavity and producing insulative foam.  After several minutes, the foam will harden, permanently and irreversibly trapping the blowing agent within the cellular structure of the foam.\n\n\n\nThrough the polyurethane foam production process, Cyclopentane/Isopentane liquid blend is stored and used at the facility in a quantity that exceeds the 10,000-lb. threshold quantity specified by EPA regulation 40 CFR Part 68. Therma-Tru's covered process requires compliance with Program Level 3 of the EPA Risk Management Program (RMP) due to the fact that the process is also subject to the OSHA Process Safety Management (PSM) Standard (29 CFR 1910.119).  The facility operates under the North America Industrial Classification System (NAICS) Code of 332321 and the Standard Industrial Classification (SIC) Code of 3089 and 3442.\n\n\n\nB. Accidental Release Prevention & Emergency Response Policies of Therma-Tru\n\nTherma-Tru is committed to protecting facility personnel, the public and the environment from any workplace and accidental release hazards. Appropriate responses to releases of regulated chemicals are documented in the site Emergency Action Plan. In addition, Therma-Tru complies with the OSHA Process Safety Management regulation. Design criteria established include safety relief valves, fail safe automatic control valves,  nitrogen blanketing, hydrocarbon detection systems, lightning protection, electrical grounding protection, ventilation flow controls, extensive exhaust ventilation design and implementation.\n\n\n\nSafety, environmental protection and risk management programs are implemented and coordinated with community emergency responders for emergency planning and response efforts.\n\n\n\nC. Release Scenario Discussion\n\nIn accordance with the requirements of the EPA RMP regulat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000099425,
      "SummaryText": "ions, Therma-Tru performed the following offsite consequence analyses.\n\n- One worst-case release scenario for the cyclopentane/isopentane mixture.\n\n- One alternate-case release scenario for the cyclopentane/isopentane mixture. \n\n\n\nTherma-Tru used the EPA RMP Offsite Consequence Analysis Guidance to calculate the estimated release rates and to determine the distance to the appropriate flammable endpoints.\n\n\n\nD. Five-year Accident History\n\nUnder the EPA RMP regulations, an accidental release is defined as a release of a regulated substance that \"resulted in deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\"  There were no accidental releases that occurred during the past 5 years.\n\n\n\nE. Prevention Program Elements\n\nManagement System - Therma-Tru has a management program in place that assigns overall responsibility for the development and implementation of the RMP Program to a qualified individual or position of responsibility. It clearly delineates accountability and responsibilities for any elements where responsibilities are delegated.\n\n\n\nProcess Safety Information (PSI) - Up-to-date process safety information is maintained for use by employees operating the covered process in accordance with 40 CFR Part 68.65, including the following:\n\n- SDS's for the cyclopentane/isopentane mixture that contains toxicity information, permissible exposure limits, physical data, reactivity data, thermal and chemical stability data and synergistic effects from mixing process flows.\n\n- Block flow diagrams for the covered process.\n\n-Process chemistry and maximum intended inventory data for the covered process.\n\n- Safe operating limits and evaluation of consequences of deviations from these limits for the covered process.\n\n- Covered process equipment information consisting of materials of construction; piping and instrumentation diagrams (P&IDs); electric classification"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000099425,
      "SummaryText": "; relief system design and design basis;   ventilation system design; design codes and standards employed; and safety systems (interlocks, detection or suppression systems).\n\n\n\nProcess Hazard Analysis (PHA) - A PHA has been performed for the Program 3 covered process at Therma-Tru in accordance with 40 CFR Part 68.67. The PHA was performed using the HAZOP method. The PHA identified the hazards associated with the cyclopentane/isopentane mixture and the covered process; causes of potential accidental release scenarios; safeguards used to prevent accidental releases; and methods used to detect, monitor or control accidental releases. Any issues identified during the PHA were documented and resolved in a timely manner. The PHA will be revalidated and updated once every five years following completion of the initial PHA.\n\n\n\nOperating procedures - Detailed and up-to-date process operating procedures have been developed and are maintained for the cyclopentane/isopentane process in accordance with 40 CFR Part 68.69. Operating procedures provide clear instructions for safely conducting activities involving a covered process in a manner consistent with process safety information and are readily accessible to employees involved in a covered process. Operating procedures are reviewed annually to ensure that they remain current and accurate.\n\n\n\nOperating procedures cover each operating phase of the covered process including initial system startup, normal operation, temporary operations, emergency shutdown and conditions that require emergency operations, normal shutdown and startup following a turnaround or emergency shutdown. Operating procedures also incorporate or reference relevant process safety information including the following:\n\n- Process operating limits (including consequences of deviations and steps to correct or avoid such deviations)\n\n- Safety and health considerations (including properties and hazards of covered chemicals, precautions necessary to prevent exposur"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000099425,
      "SummaryText": "e, control measures to be taken upon physical contact or airborne exposure, quality control for raw materials, and control of regulated substance inventories).\n\n- Safety systems and their functions.\n\n\n\nTraining - New employees working with a covered process receive initial training in accordance with 40 CFR Part 68.71. The training includes an overview of the process and emphas process operating procedures, safe work practices, health and safety hazards, and emergency operations including shutdown. \n\n\n\nRefresher training is provided at a minimum of once every three years to all employees working with the covered process. Documentation is maintained for each employee to ensure that he/she received and understood the required training.\n\n\n\nMechanical Integrity - A mechanical integrity program has been developed in accordance with 40 CFR Part 68.73 for covered process equipment. Employees involved in the maintenance of the covered process receive additional training, which includes an overview of the process, its hazards, and applicable procedures to ensure that the employee can perform the job in a safe manner.\n\n\n\nWritten procedures have been developed to ensure that the covered process equipment is properly maintained, tested, and inspected at regular, scheduled intervals and that such activities are thoroughly documented. Maintenance, inspection and testing procedures and frequencies are consistent with applicable manufacturer's recommendations and follow accepted engineering practices. Any equipment deficiencies identified during maintenance, inspection or testing are corrected in a safe and timely manner.\n\n\n\nManagement of Change (MOC) - A written MOC procedure has been implemented to manage changes in process chemicals, technology, equipment and operating procedures for the covered process in accordance with 40 CFR 68.75. The MOC procedures do not apply to \"replacements in kind\" which are defined as replacements that satisfy the original design specifications (e.g."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000099425,
      "SummaryText": ", replace a pressure reducing valve with a new identical valve supplied by the original equipment manufacturer).\n\n\n\nPrior to introducing a change, the MOC procedure is implemented to ensure the following:\n\n- The technical basis for the change and its impact on health and safety has been fully evaluated;\n\n- Affected operating procedures and applicable process safety information have been updated accordingly; and\n\n- The schedule for implementing the change has been developed and required authorizations have been obtained.\n\n\n\nAll employees involved in operating or maintaining the modified process are informed of the change and trained accordingly prior to startup of the modified process.\n\n\n\nPre-Startup Safety Review (PSSR) - PSSRs are performed in accordance with 40 CFR 68.77 for new covered processes and for modified covered processes when the modification is significant enough to require a change in the process safety information. The PSSR confirms the following prior to introducing a regulated substance into a process:\n\n- Equipment and construction satisfy design specifications;\n\n- Safety, operation, maintenance and emergency procedure have been developed and are adequate;\n\n- A PHA has been performed for new covered processes, and all recommendations have been resolved or implemented prior to startup;\n\n- The MOC procedure has been completed for the process modifications; and \n\n- Training for all employees involved in operating or maintaining the new or modified process has been performed.\n\n\n\nCompliance Safety Audits - RMP Program compliance is confirmed through safety audits that are performed at least once every three years in accordance with 40 CFR Part 68.79. The audits are completed by at least one person knowledgeable in the process. A report of the findings is generated following the audit, and all deficiencies and/or recommendations are promptly addressed and the resolution is documented. The two most recent safety audit reports are maintained at the facility"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000099425,
      "SummaryText": ".\n\n\n\nIncident Investigation - Specific incident investigation, reporting, and documentation procedures have been implemented and are followed in accordance with 40 CFR 68.81 in response to any incident involving a covered process that did or could have reasonably resulted in a catastrophic release of a regulated substance. Under EPA RMP, a catastrophic release is defined as a major uncontrolled emission, fire, or explosions involving one or more regulated substances that present imminent and substantial endangerment to public health and the environment.\n\n\n\nThe incident investigation procedure is initiated as soon as possible and no later than 48 hours following an incident. A team is established to perform the incident investigation and always includes at least one person knowledgeable in the process, a contract employee if the incident involves work by a contractor, and other persons with appropriate qualifications to investigate an accident.\n\n\n\nFollowing the investigation, a written report is prepared summarizing the following information at a minimum: date of the incident; date the investigation began; description of the incident and any contributing factors; and any recommendations resulting from the investigation. When completed, all affected personnel including contract employees review the report. Incident investigation reports are maintained at the facility for a minimum of five years.\n\n\n\nEmployee Participation - A written employee participation plan has been implemented that provides employees with access to PHA and all other information developed under the RMP regulation in accordance with 40 CFR Part 68.83. The employee participation plan describes employee participation in conducting PHA and in implementing all other RMP elements.\n\n\n\nHot Work Permit - An authorization and permit program for hot-work operations has been prepared and implemented for hot-work conducted on or near a covered process in accordance with 40 CFR Part 68.85. The permit is used to "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000099425,
      "SummaryText": "document that fire prevention and protection standards in 29 CFR 1910.252(a) have been implemented prior to beginning the hot-work operations. Also, the permit lists the date(s) authorized for hot-work and identifies the equipment to be worked on or near.\n\n\n\nContractors - A contractor safety program in accordance with 40 CFR Part 68.87 covers all contractors performing maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to a covered process. The safety performance of each contractor is evaluated prior to selection. Each contractor employee is informed of the known potential fire, explosion hazard related to work on a covered process as well as the relevant provisions of the emergency response program. Procedures are in place to control the entrance, presence, and exit of contract employees in covered process areas. Periodically, the performance of the contract owner or operator is evaluated while working in or adjacent to a covered process.\n\n\n\nF. Emergency Response Program\n\nTherma-Tru will only respond to incidental releases of the cyclopentane/isopentane mixture, where the release can be absorbed, neutralized, or otherwise controlled at the time of release by employees in the immediate release area, or by maintenance personnel. For non-incidental releases, Therma-Tru will rely on outside responders. Therefore, Therma-Tru has coordinated response actions with the local fire department and ensured that appropriate mechanisms are in place to notify emergency responders when there is a need for response. Therma-Tru actively conducts emergency drills on an annual basis.\n\n\n\nG. Planned Changes to Improve Safety\n\nTherma-Tru has a PSM/RMP program designed for continuous improvement. If any changes occur in the future which affect the cyclopentane/isopentane mixture processes, these changes will be thoroughly reviewed to ensure that the safety of Therma-Tru employees and neighbors are not compromised.\n\n"
    }
  ]
}