{
  "FacilityID": 1000006115,
  "FacilityName": "Florence Water Treatment Plant",
  "FacilityStr1": "2710 Grebe Street",
  "FacilityStr2": null,
  "FacilityCity": "Omaha",
  "FacilityState": "NE",
  "FacilityZipCode": "68112",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31055",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "41.336667",
  "FacilityLongDecDegs": "-095.955833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.mudomaha.com",
  "FacilityEmailAddress": "Customer_Service@mudnebr.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Metropolitan Utilities District",
  "Company2Name": null,
  "CompanyDUNS": 6970321,
  "Company2DUNS": 6970321,
  "OperatorName": "Metropolitan Utilities District",
  "OperatorStr1": "1723 Harney Street",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68102",
  "OperatorZipCodeExt": "1960",
  "RMPContact": "Joel G. Christensen",
  "RMPTitle": "Vice President, Water Operations",
  "FTE": 36,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000115109",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.33498,
  "FRS_Long": -95.95607,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000007180,
      "AltID": "Chlorination",
      "FacilityID": 1000006115,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000007304,
          "ProcessID": 1000007180,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008100,
          "ProcessID": 1000007180,
          "ChemicalID": 62,
          "Quantity": 300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508100,
          "ProcessID": 1000007180,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000006115,
      "SummaryText": "The Metropolitan Utilities District has in place accidental release and emergency response policies and procedures at our facilities.  Our Safety Policy Statement states our management's commitment to \"the safety of the public, our customers and our employees.\"  This commitment to safety \"takes precedence over expedience in completing any work performed by District employees.\"  Our emergency response plan includes active response by properly equipped and trained employees working with the local Fire Department Hazmat team.  A full-time staff of safety and health professionals and a training staff support this strong commitment to safety and health.\n\nThe Florence Water Treatment Plant is the primary water treatment facility supplying drinking water to the City of Omaha, Nebraska and surrounding communities.  Liquid chlorine and aqueous ammonia are used to produce chloramines for disinfection.  Only chlorine at the Florence Plant falls under the RMP rule. \n\nThe responsibility for implementation and handling of the District's Risk Management Plan rests with the Vice President of Water Operations.  Alternate program responsibilities are assigned to the Director of Water Production and Pumping, the Water Supply Engineer, the Director of Safety and Security, the Director of Training, and members of their technical and supervisory staffs.\n\nAll facilities used to house chlorine, whether the chlorine is in-use or in storage, meet or exceed industry standards.  Equipment installed to facilitate the chloramination process and facilities to house chlorine are inspected periodically, and scheduled maintenance is performed to ensure system safety and reliability.\n\nSafety information necessary to ensure the facilities and processes meet or exceed codes, standards, and/or guidelines used in the development and installation of regulated requirements has been compiled and reviewed where appropriate.  The safety information includes Chlorine Institute Pamphlets, local building and fir"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000006115,
      "SummaryText": "e codes, National Electric Codes, American National Standards Institute pamphlets, manufacturer guides, and applicable state and federal safety codes.\n\nA hazard review of the chlorine storage and chloramination facilities was performed using the WTP Hazard Review Checklist for Chlorine Systems provided in the RMP plan for the Water Industry published by the American Water Works Association.  The review included siting, operation and maintenance, hazard recognition, human factors, container shipment and unloading, stationary tanks, piping and appurtenances, and general conditions.  Any areas identified as needing further research were annotated and followed up on to ensure proper measures were implemented to correct deficiencies and mitigate hazards.  Using hazard review and compliance audits; we will continue to use the deficiencies to improve safety.\n\nOperating procedures used within the Risk Management Plan are addressed in the District's Chlorine Manual.  This manual addresses normal operations, emergency shutdown, normal shutdown, startup following turnaround, consequences of deviation, steps required to correct or avoid deviation, safety and health considerations, and safety systems.  Since the Florence Water Treatment Plant is a surface water treatment facility and is by law required to maintain disinfection at all times, it is considered to be an ongoing process.  No situations fall within the initial startup category.  The District does not have any procedures for temporary operations, as disinfection is a permanent process.  The application point of the chlorine within the plant can be changed temporarily, but this is done with chlorine solution, not with gaseous or liquid chlorine.  Chlorine manuals are located at the Operator's desk in the Chemical Building and at the Filter Plant.\n\nTraining includes Hazmat training for all Chemical Equipment Mechanics, operating procedure training for operating employees, and safety and health training and awareness trai"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000006115,
      "SummaryText": "ning for all District employees involved directly with the disinfection process.  Employees are trained on any new or updated procedures prior to implementation of the change.  Since our last update, over 190 employees have undergone NIMS 100 and 700 training and 12 employees have taken the NIMS 200 training.  All training is certified, and documentation is kept in the training section of the Risk Management Plan.\n\nCompliance audits are conducted at least every three years using the checklist provided in the RMP plan for the Water Industry published by the American Water Works Association.  In addition to this audit, the District performs annual safety and health inspections on all facilities used in the chlorine disinfection process.  These inspections check for compliance with state and federal safety requirements, condition of facilities and equipment, availability of personal protective equipment, and safe work practices.  Copies of the inspection reports are forwarded to the appropriate Manager/Supervisor for review and corrective action.  The Director of Safety and Security conducts follow-up until all deficiencies are corrected.  All compliance audits and safety reports are filed in the Compliance Audits section of the Plan.\n\nWe have had no incidents in the last 5 years at Florence but in the event of an incident that results in, or could reasonably result in, a catastrophic release of chlorine, an incident investigation team will be formed.  The team investigates and reports the findings, causes, and recommendations to the President of the Metropolitan Utilities District.  All resolutions and corrective actions will be documented and retained for five years.\n\nThe Metropolitan Utilities District Risk Management Plan encompasses all elements of sound industry practice, combining regulatory and voluntary elements to ensure safe chlorine disinfection with minimal risk to its customers, employees, and the public.  The management and employees of the District take"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000006115,
      "SummaryText": " their responsibilities for this safety seriously and are dedicated to maintaining excellence in it processes and product.\n"
    }
  ]
}