{
  "FacilityID": 1000016237,
  "FacilityName": "Hexion Inc. - La Grande",
  "FacilityStr1": "62575 OREGON HWY 82",
  "FacilityStr2": null,
  "FacilityCity": "ISLAND CITY",
  "FacilityState": "OR",
  "FacilityZipCode": "97850",
  "Facility4DigitZipExt": "1028",
  "FacilityCountyFIPS": "41061",
  "LEPC": "FIRE DEPARTMENT",
  "FacilityLatDecDegs": "45.349167",
  "FacilityLongDecDegs": "-118.030556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3938628,
  "ParentCompanyName": "Hexion LLC",
  "Company2Name": null,
  "CompanyDUNS": 166495924,
  "Company2DUNS": 0,
  "OperatorName": "Hexion Inc.",
  "OperatorStr1": "62575 OREGON HWY 82",
  "OperatorStr2": null,
  "OperatorCity": "ISLAND CITY",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97850",
  "OperatorZipCodeExt": "1028",
  "RMPContact": "Dustin Miller",
  "RMPTitle": "Site Leader",
  "FTE": 7,
  "OtherEPAFacilityID": "ORD003938628",
  "EPAFacilityID": "100000049547",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-08-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-02-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-10-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-10-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-10-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 45.3593,
  "FRS_Long": -118.0095,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000020265,
      "AltID": "PHENOL FORMALDEHYDE RESIN",
      "FacilityID": 1000016237,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000020627,
          "ProcessID": 1000020265,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000024049,
          "ProcessID": 1000020265,
          "ChemicalID": 1,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000524049,
          "ProcessID": 1000020265,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000020266,
      "AltID": "FORMALDEHYDE MFG.",
      "FacilityID": 1000016237,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000020628,
          "ProcessID": 1000020266,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000024050,
          "ProcessID": 1000020266,
          "ChemicalID": 1,
          "Quantity": 510000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000524050,
          "ProcessID": 1000020266,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000020267,
      "AltID": "UREA FORMALDEHYDE RESIN",
      "FacilityID": 1000016237,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000020629,
          "ProcessID": 1000020267,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000024051,
          "ProcessID": 1000020267,
          "ChemicalID": 1,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000524051,
          "ProcessID": 1000020267,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000016237,
      "SummaryText": "1. Accidental release prevention and emergency response policies\n\nAs stated in our Health, Safety and Environmental Policy and Principles, the facility is committed to health, safety and environmental excellence.  To accomplish this we integrate health, safety and environmental planning into all business activities.  This includes complying with applicable laws, responsibly managing risk, and working collaboratively with others in addressing health, safety and environmental issues.\n\nIn the Corporate Safety Manual, the Safety Policy Statement clearly states that safety will not be compromised to achieve any other operation or buisiness objective.  This manual defines requirements and guidelines developed to prevent injuries and accidental releases.\n\nIncluded in the Safety Manual are Emergency Response Policies that state that safety is the top priority in all emergency response situations. This policy refers to the plant Emergency Response Plan for specific procedures for handling releases of hazardous materials.\n\n2. Stationary source and regulated substances handled\n\nThis plant makes formaldehyde solutions, phenol-formaldehyde resins, and urea-formaldehyde resins.  The site includes a formaldehyde manufacturing facility and two resin reactors.  Formaldehyde is primarily used on site as a raw material for both types of resins.\n\nThe regulated substance used in the plant and the maximum quantity stored are:\n\nFormaldehyde                   510,000 lbs\n\n3. Accidental release prevention program and chemical-specific prevention steps\n\nThis plant has a comprehensive process safety mangement program that is in compliance with the EPA Accidental Release Prevention Rule, the OSHA Process Safety Management Standard, and all applicable state codes and regulations.  A safety management system is in place to assure on-going compliance.  This management system includes the Safety Manual, a list of site safety responsibilities, a file system to maintain records of compliance, and a "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000016237,
      "SummaryText": "monthly Safety Committee meeting, where a management control chicksheet is used to verify that tasks were completed on schedule.  The Production Leader has overall responsibility for this program.\n\nDesignated personnel are assigned to maintain and improve the safety of their units. Their duties include keeping operating procedures up-to-date, training operators so they can safely carry out these procedures, assuring that the plant is run safely on a daily basis, and when necessary, investigating incidents in their unit. All employees participate in the safety program to improve safety and plant operation.\n\nDesignated personnel maintain the Operating Guide that includes process safety information, operating\nprocedures, and a training certification program. Operators use this Operating Guide as a training tool and\nfor reference. By applying the information it contains their actions will prevent accidental releases.\nProcess hazard analyses are conducted on an on-going basis to identify hazards and recommend safeguards\nthat will prevent an accidental release. Recommendations resulting from the process hazard analyses are\nentered into an action items database to track the items to completion.\n\nProcess hazard analyses are conducted on an on-going basis to identify hazards and recommend safeguards that will prevent an accidental release.  As a result of initial process hazard review, a significant investment was made in process control systems.  Recommendations resulting from the process hazard analyses are entered into an action items database to track the items to completion.\n\nA Management of Change (MOC) system is used to assure that changes to plant equipment, procedures, or\nprocessed do not cause accidents. For equipment, procedure, and process changes, a MOC initiates a safety\nreview. This review may include a process hazard analysis. Changes to product formulations initiate a review\nby technical and plant personnel.\n\nA preventive maintenance program maintains the me"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000016237,
      "SummaryText": "chanical integrity of process equipment.  A computer database is used to mangae the preventive maintenance schedule and other corrrective or improvement repairs necessary to maintain the ongoing integrity and reliability of the facility equipment.  Each month scheduled equipment inspections, tests, or servicing are performed.  The schedule is based on plant experience to redue the likelihood of an accidental release caused by equipment failure.\n\nThe requirements in the Safety Manual include safe work practices which prevent accidental releases.  One important section describes safety measures for welding or other \"hot\" work, which includes a permit system to reduce the risk of fire.  The Safety Manual also includes requirements for locking out equipment for maintenance.  These procedures reduce the likelihood that a valving error will lead to a release.\n\nContractors, who periodically perform work in the plant, are given safety orientations to brief them on plant hazards and safety practices.  Contractor safety programs and performance are evaluated prior to their selection for jobs thhat impact process safety.\n\nIncidents that cause or could have casued a release are investigated and recommendations are made to prevent recurrence.  These recommendations may lead to improvements in equipment, procedures, operating conditions, or training.\n\nInternal Corporate Health, Safety and Environmental Audits are conducted periodically to maintain compliance with local, state and federal regulations. Regional Safety and Environmental professionals periodically review the health,safety, and environmental programs. Addressing recommendations from these audits and reviews keeps the Facility's Safety and Environmental programs effective.\n\n4. Five-year accident history\n\nIn the past five year period, there were no deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage as a r"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000016237,
      "SummaryText": "esult of an accidental release of a regulated substance from our covered processes.\n\n5. Emergency response program\n\nThe plant Emergency Response Plan describes procedures for actual and threatened releases, including coordination with fire department responders. An emergency response drill is conducted annually to test the Emergency Response Plan and reinforce training that plant responders receive.\n\n6. Planned changes to improve safety\n\nNo significant changes are planned."
    }
  ]
}