{
  "FacilityID": 1000030976,
  "FacilityName": "House Creek 4-43",
  "FacilityStr1": "8.25 miles SE of WY",
  "FacilityStr2": "SH 50 & Savageton Rd. Intersection",
  "FacilityCity": "Wright",
  "FacilityState": "WY",
  "FacilityZipCode": "82732",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56005",
  "LEPC": "Campbell County LEPC",
  "FacilityLatDecDegs": "43.820087",
  "FacilityLongDecDegs": "-105.636854",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Thunder Creek Gas Services",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Thunder Creek Gas Services, LLC",
  "OperatorStr1": "717 17th Street",
  "OperatorStr2": "Suite 1500",
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000219603",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-10-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-10-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-10-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-04-29 00:00:00",
  "DeRegistrationEffectiveDate": "2014-10-02 00:00:00",
  "AnniversaryDate": "2017-10-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 43.820087,
  "FRS_Long": -105.636854,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000037804,
      "AltID": "Natural gas processing",
      "FacilityID": 1000030976,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000045570,
          "ProcessID": 1000037804,
          "ChemicalID": 118,
          "Quantity": 82973.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000045569,
          "ProcessID": 1000037804,
          "ChemicalID": 98,
          "Quantity": 434159.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000045571,
          "ProcessID": 1000037804,
          "ChemicalID": 94,
          "Quantity": 27600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000038166,
          "ProcessID": 1000037804,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000030976,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-09-20 00:00:00",
    "ERTrainingDate": "2012-08-06 00:00:00",
    "CoordinatingAgencyName": "Campbell County Fire Department",
    "CoordinatingAgencyPhone": "3076825319",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000030976,
      "SummaryText": "House Creek 4-43 is a remote, rural natural gas processing facility that extracts and stores natural gas liquids (NGL), comprised of mixed aliphatic hydrocarbons containing mostly propane and butane, for transportation off site to customers.\r\n  \r\nEmergency conditions that could develop as a function of the flammable nature of NGL include fire, explosion, and vapor cloud release resulting from a spill or vessel overfill condition.  These conditions may be detected by personnel occasionally on site or remotely through various process condition transmitters.  House Creek 4-43 is an unoccupied facility.  Thunder Creek Gas Services (TCGS) personnel are instructed and trained to respond to fires and spills in the incipient, or beginning, stage of emergency development only if it is safe to do so.  For other, larger potential emergencies or ones that are in a more mature stage, TCGS personnel are instructed to respond in a defensive manner activating remote equipment shutdowns or eliminating the source of the release from a safe distance.  Responses to all emergency conditions are governed by an Emergency Response Plan - the contents of which are used for personnel training and communicating response procedures to third party responders such as Campbell County Fire Department.  Emergency response provisions are practiced actively during regular drills.  \r\n\r\nNGL is extracted from a raw inlet natural gas stream via a cryogenic process.  The temperature of the gas is cooled to the extent that propanes and heavier hydrocarbons, as well as some ethane, are liquefied and transferred into one of three pressure vessels for transport off site via truck.  The three NGL storage vessels located at the facility along with volumetric capacities are listed below:\r\n¿\tV-4100 (33,000 U.S. gallons)\r\n¿\tV-4000 (18,000 U.S. gallons)\r\n¿\tV-4200 (18,000 U.S. gallons)\r\n\r\nEach may be filled to up to 85% capacity as safeguarded by level detection equipment.  Normal operating conditions are such that"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000030976,
      "SummaryText": "at least one vessel is nearly empty at any one time.  Piping and associated process equipment is located approximately one-hundred feet away from the storage vessels.  NGL volumes in process equipment and transfer piping are negligible by comparison to on-site storage capacities. \r\n \r\nThe facility worst case release scenario was determined to be a vapor cloud explosion from V-4100 at 100% capacity containing an NGL mixture comprised of 35% propane, 25% butane, and 10% ethane.  The most likely cause of such an explosion is a sudden release and subsequent vaporization of NGL due to an equipment failure or vessel(s) overfill.  This potential condition is safeguarded by break-away, fail closed valves on frequently used transfer piping used to load trucks, level detection equipment, and personnel training regarding the hazards and safe response to an NGL vapor release.  The overpressure endpoint of 1 psi specified for this release scenario was determined to be 0.4 miles from the source.\r\n\r\nThere were no receptors found to be potentially impacted from this release scenario.  \r\n\r\nThe unoccupied, remote nature of this facility exempts it from OSHA's Process Safety Management (PSM) standard.  There are aspects of the standard that are employed by TCGS which include management of change evaluations, process hazard analyses, regular preventative maintenance on various safeguards such as pressure relief valves, operator training, and an ongoing commitment to safe facility design according to various standards recognized by the industry such as those promulgated by American Petroleum Institute (API).\r\n\r\nThere have been no accidents at this facility within the last 5 years.\r\n\r\nThe emergency response plan for this facility has been coordinated with Campbell County Fire Department such that they are in the process of developing a pre-incident fire plan specific to the facility.  Plans for a drill at the facility in coordination with the entity are currently underway.   \r\n   \r\nThere"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000030976,
      "SummaryText": "are no current plans to improve safety at this facility beyond evaluating the impact of any equipment additions or changes through management of change."
    }
  ]
}