{
  "FacilityID": 1000029682,
  "FacilityName": "Nebraska Corn Processing, LLC",
  "FacilityStr1": "107 Potter Street",
  "FacilityStr2": null,
  "FacilityCity": "Cambridge",
  "FacilityState": "NE",
  "FacilityZipCode": "69022",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31065",
  "LEPC": "Furnas LEPC",
  "FacilityLatDecDegs": "40.281051",
  "FacilityLongDecDegs": "-100.159843",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.nebraskacornprocessing.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4951471,
  "ParentCompanyName": "Zeeland Farm Services, Inc",
  "Company2Name": null,
  "CompanyDUNS": 962342940,
  "Company2DUNS": 0,
  "OperatorName": "Nebraska Corn Processing, LLC",
  "OperatorStr1": "107 Potter Street",
  "OperatorStr2": null,
  "OperatorCity": "Cambridge",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "69022",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eric Meeuwsen",
  "RMPTitle": "General Manager",
  "FTE": 37,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000202121",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "CP11-012",
  "SafetyInspectionDate": "2012-01-04 00:00:00",
  "SafetyInspectionBy": "Nebraska State Patrol Carrier Enforcement Division",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-08-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-08-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-08-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036191,
      "AltID": "Denaturant",
      "FacilityID": 1000029682,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000036573,
          "ProcessID": 1000036191,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043798,
          "ProcessID": 1000036191,
          "ChemicalID": 155,
          "Quantity": 627469.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000036592,
              "ProcessChemicalID": 1000043798,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000543798,
          "ProcessID": 1000036191,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029682,
      "SummaryText": "FACILITY BACKGROUND\n\n\n\nThis RMP serves as a resubmission for the Nebraska Corn Processing, LLC facility located in Furnas County, Cambridge, Nebraska. An RMP submission was originally completed for this facility on March 28, 2008. The facility was originally owned by Standard Ethanol, LLC and was operated as Mid America Agri Products/Horizon, LLC. The facility was subsequently bought by Zeeland Farm Services and is now operated as Nebraska Corn Processing, LLC. \n\n\n\n\n\nREGULATED SUBSTANCES\n\n\n\nThe facility processes grain to produce fuel grade ethanol and high protein cattle feed. The facility is currently subject to RMP due to its use of flammable liquids in excess of threshold quantities. The facility uses natural gasoline (denaturant) as an additive to the ethanol prior to shipment to make the ethanol unfit for human consumption. The denaturant contains pentane in excess of the threshold quantity.  \n\n\n\nCHANGES SINCE PREVIOUS SUBMISSION\n\n\n\nThe RMP submitted for the previous operation of the facility reported three materials in addition to the denaturant. Those materials include denatured ethanol, corrosion inhibitor and aqueous ammonia. NCP has made changes in its operations which eliminate the reporting need for each of these materials. These changes are as follows:\n\n\n\n-    Previously, the facility blended denaturant with ethanol prior to finished product storage, due to the  of the tanks, the finished product storage tanks contained pentane in excess of the threshold quantity. The facility no longer blends denaturant with ethanol prior to finished product storage. Rather the denaturant is blended in line during the load out process. Denaturant is added at a maximum concentration of 2%; therefore the maximum volume of pentane in a rail car is below the threshold quantity. \n\n-    Previously the facility utilized aqueous ammonia at a concentration of 29.9%. At that concentration the quantity of ammonia in the process exceeded the threshold quantity for aqueous ammonia. NCP "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029682,
      "SummaryText": "currently uses aqueous ammonia at a concentration of 27% . With the lower concentration solution, the facility cannot possibly exceed the threshold quantity for ammonia.\n\n-    Previously the facility utilized a corrosion inhibitor which contained listed flammable materials and had a NFPA flammability rating of 4. NCP uses a different corrosion inhibitor which does not contain any RMP listed chemicals. \n\n\n\nDue to the above changes, denatured ethanol, corrosion inhibitor and aqueous ammonia are no longer being reported on the RMP. While NCP is not required to report these chemicals, NCP understands the hazards associated with the use of flammable materials and aqueous ammonia and continues to manage them in accordance with the facility release prevention program. \n\n\n\nPREVENTION PROGRAM STEPS\n\n\n\nNCP complies with all applicable OSHA and EPA regulations including OSHA's PSM standard, 29 CFR 1910.119. Compliance with the PSM standard is an integral portion of NCP's RMP prevention program. The following specific elements are incorporated into the prevention program for the NCP facility.\n\n\n\n-    Employee Participation - NCP encourages employees to participate in all facets of process safety management and accident prevention. Employee involvement examples include employees participating in compiling and updating technical documents, safety information and SOPs; employees participating in PHA's and employees being actively involved in the MOC process. In addition NCP employees are largely responsible for maintaining process equipment.\n\n-    Process Safety Information - NCP maintains all process safety information required by the PSM standard and ensures that this information is current and accurate. Information is maintained related to the hazards of the chemicals used in the process, the technology of the process and the process design.  Specifically, NCP maintains, among other things, MSDS, P&IDs, Block flow diagrams, information relating to materials of construction, safe operati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029682,
      "SummaryText": "ng limits and consequences of deviation from those limits, and information related to safety systems integrated into the process. \n\n-    Process Hazard Analysis -  A PHA was performed prior to the initial start up of the facility. NCP has reviewed that PHA and has ensured that all recommendations from that PHA were implemented and documented. Subsequent PHAs will be conducted no less frequently than every 5 years and will utilize a HAZOP methodology and checklists or some other acceptable form of analysis. NCP will compile a team of employees including operations personnel and maintenance personnel to participate in the PHAs. Recommendations from all PHAs will be assessed and prioritized and the action taken to address recommendations will be documented. \n\n-    Operating Procedures - NCP maintains standard operating procedures for their operations. NCP operators review these SOPs and certify them annually. SOPs are an essential tool utilized in facility operations training. \n\n-    Training - NCP has implemented a comprehensive training program for all employees involved in operating and maintaining the process. Training includes classroom training, hands on training and job shadowing. Refresher training is conducted routinely, and in no case will longer than three years lapse between training sessions. \n\n-    Contractors - NCP requests and reviews contractor safety information annually. Information is obtained pertaining to contractor safety performance and training of contractor employees. NCP ensures that all contractors and visitors are aware of the hazards associated with the process and the chemicals utilized on site. Contractors working on site are observed routinely to ensure compliance with all safety programs and policies. \n\n-    Pre-Start up Safety Review - NCP conducts a PSSR for any facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment prepared for "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029682,
      "SummaryText": "startup prior to the addition of hazardous chemicals. \n\n-    Mechanical Integrity - NCP utilizes a computerized maintenance management system called MAPCON to manage its mechanical integrity program.  MAPCON generates preventative maintenance work orders in accordance with manufacturer's recommendations and applicable codes and standards. The MAPCON system is used to maintain records of all maintenance activity including emergency repairs and non routine maintenance activity. The records contained in MAPCON include, among other things, the identification of the equipment, the details of the procedure or test being performed, the results of any inspections or tests, the name of the person performing the work and the date the work was performed. \n\n-    Management of Change - NCP has a comprehensive process to manage changes that are not replacement in kind. NCP employees are trained on when MOC is required and how to complete the documentation required to support the MOC process. The MOC process is completed prior to the implementation of the change. \n\n-    Incident Investigation - NCP investigates all incidents that occur at the facility including personal injury incidents, near misses and incidents which resulted in or could have resulted in a catastrophic release of a hazardous chemical. Incident investigations are led by a person trained in investigation techniques and all incident investigations are documented. Documentation includes the date and time of the incident, a description of the incident, contributing factors to the incident, any recommendations resulting from the investigation, the names of the parties involved in the investigation and the date and time the investigation began\n\n-    Compliance Audits - NCP performs compliance audits of their PSM process and RMP Program at least once every three years. The most recent compliance audit was conducted in May of 2010. Upon the completion of a compliance audit, NCP prioritizes the audit findings and commences corrective"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000029682,
      "SummaryText": " action to remediate any deficiencies noted during the audit. \n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nNCP has not experienced any reportable releases of regulated substances since the facility began operation in 2008.\n\n\n\nEMERGENCY RESPONSE INFORMATION\n\n\n\nNCP has developed an Emergency Action Plan. Emergency response activities are coordinated with local personnel and contractors. NCP routinely conducts training and drills to ensure the effectiveness of its emergency response program. \n\n"
    }
  ]
}