{
  "FacilityID": 1000047333,
  "FacilityName": "Illinois-American Water Company, Alton Plant1",
  "FacilityStr1": "1200 W. Broadway",
  "FacilityStr2": null,
  "FacilityCity": "Alton",
  "FacilityState": "IL",
  "FacilityZipCode": "62002",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17119",
  "LEPC": "Madison County LEPC",
  "FacilityLatDecDegs": "38.903333",
  "FacilityLongDecDegs": "-090.209167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.illinoisamerican.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6935407,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 6918726,
  "Company2DUNS": 6918726,
  "OperatorName": "Illinois American Water",
  "OperatorStr1": "1200 W. Broadway",
  "OperatorStr2": null,
  "OperatorCity": "Alton",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62002",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Quinonez",
  "RMPTitle": "Operations Supervisor",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177382",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-01-28 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-10-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-10-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-10-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.90333,
  "FRS_Long": -90.20917,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059065,
      "AltID": "Disinfection Process",
      "FacilityID": 1000047333,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000060125,
          "ProcessID": 1000059065,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000072190,
          "ProcessID": 1000059065,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000572190,
          "ProcessID": 1000059065,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047333,
      "SummaryText": "EXECUTIVE SUMMARY / RMP SUBMIT\n\nAt this facility, Illinois-American Water Company handles chlorine for the purpose of disinfecting and treating drinking water. OSHA and EPA consider chlorine a hazardous chemical. The hazards of chlorine make it necessary to observe certain safety precautions in the use and handling to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community. It is Illinois-American Water Company policy to adhere to all applicable Federal and State rules and regulations. Safety depends on the manner that covered process chemicals are handled and used, combined with the safety devices inherent in the design along with operating procedures and the training of our personnel.\n\nThe emergency action plan is based upon OSHA 1910.38 (Employee Emergency Plans) 1910.120 (Hazardous Waste Operations and Emergency Response) and experience obtained from community drills.\n\nTHE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe maximum amount of chlorine stored at the Alton facility is 32,000 pounds.\nAmmonia is used at the Alton facility but, is in a quantity below the threshold quantity limit. The maximum amount of ammonia stored at the Alton facility is 8840 pounds.\n\nThe chlorine is delivered by truck in one-ton cylinders. Chlorine is added to water as  gas, metering the gas through an injector, and then diffusing the gas into the flowstream of water at the point of application.\nAnhydrous Ammonia is delivered by truck in one-ton cylinders. Ammonia is added to water as gas, metering the gas through an injector, and then diffusing the gas into the flowstream of water at the point of application.\n\nSenior management is committed to the safe operation of our facilities and its impact on the surrounding communities.\n\nTHEORY OF OPERATION \nThe Alton plant chlorinators and accessories are designed to control and indicate the rate of flow of chlorine to provide a s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047333,
      "SummaryText": "imple means setting the feed rate at any value within the range of the machine, to mix the chlorine gas with water, and to deliver the resultant solution to the point of application.\n\nFrom the vacuum regulator-check unit, gas under a controlled vacuum passes through a rotameter (feed rate indicator) causing the float to indicate the rate of flow in pounds per 24 hours on a large, easily read scale. The rate of flow is controlled by the position of the variable orifice across which a constant differential at less than atmospheric pressure is maintained by the operation of the differential regulating valve.  From the differential regulating valve, gas passes to the injector where it is mixed with water.  The resultant solution is discharged to the point of application.\n\nThe function of the injector is to produce a vacuum to draw gas from the chlorinator and to mix this gas with the water flowing through the injector.  A ball check and diaphragm check are built into the injector to prevent a back flow of water into the chlorinator if the injector water supply is shut off with pressure on the injector discharge or if the injector discharge line is restricted.  Proper operation of the injector is dependent on the inlet pressure being sufficiently higher than the discharge pressure.  In the chlorinator, the differential regulating valve throttles the injector vacuum to maintain a constant drop across the variable orifice.  Thus the flow through the orifice is entirely a function of the size of the orifice as determined by the position of the rotameter as manually, or scada set by the operator.\nProper design, operation, and maintenance of the chlorine feed system should significantly decrease the likelihood of an accidental release of chlorine. \n\n3.1 THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS\nThis facility and process uses design codes and standards from the Chlorine Institute, Wallace Tiernan Manuals, American National Standards In"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047333,
      "SummaryText": "stitute, American Society for Testing and Materials, and applicable state codes and regulations. A chlorine scrubber is utilized at this facility to neutralize the contents of a one ton container and prevent a release to atmosphere.\n\n3.2 FIVE YEAR ACCIDENT HISTORY\nWe have had no accidental releases of chlorine in the past 5 years.\n\n3.3 THE EMERGENCY RESPONSE PROGRAM\nThe written emergency response program as mentioned in the opening paragraph is located at the facility with an on-going training program. Fire department inspections/tours are conducted annually, identifying on-site chemicals, storage locations, chemical hazards, special instructions and requirements. Drills at this facility are coordinated with the local fire department. Public notification will be handled through the local fire department per the emergency action plan.\n\n3.4 PLANNED CHANGES TO IMPROVE SAFETY\nAlthough there are no immediate plans for changes to improve safety at this facility, we constantly review advancement in safety and process technology for the continuing pursuit to provide a safer workplace and community."
    }
  ]
}