{
  "FacilityID": 1000046816,
  "FacilityName": "The Andersons Albion Ethanol, LLC",
  "FacilityStr1": "26250 B Drive North",
  "FacilityStr2": null,
  "FacilityCity": "Albion",
  "FacilityState": "MI",
  "FacilityZipCode": "49224",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26025",
  "LEPC": "Calhoun County LEPC",
  "FacilityLatDecDegs": "42.259646",
  "FacilityLongDecDegs": "-084.789726",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 604523204,
  "ParentCompanyName": "The Andersons, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7903628,
  "Company2DUNS": null,
  "OperatorName": "The Andersons Ethanol, LLC",
  "OperatorStr1": "PO Box 119",
  "OperatorStr2": "Attn:  Jim Suhan",
  "OperatorCity": "Maumee",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43537",
  "OperatorZipCodeExt": null,
  "FTE": 55,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000198582",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "120-05H",
  "SafetyInspectionDate": "2016-08-05 00:00:00",
  "SafetyInspectionBy": "AXA Matrix - loss prevention insurance",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-05-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-05-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-05-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-05-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 42.259646,
  "FRS_Long": -84.789726,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058347,
      "AltID": "Denaturant",
      "FacilityID": 1000046816,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000071277,
          "ProcessID": 1000058347,
          "ChemicalID": 155,
          "Quantity": 774180.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000086193,
              "ProcessChemicalID": 1000071277,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000086194,
              "ProcessChemicalID": 1000071277,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000059330,
          "ProcessID": 1000058347,
          "NAICSCode": "325193",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000048580,
              "Process_NAICS_ID": 1000059330,
              "SafetyReviewDate": "2016-05-12 00:00:00",
              "PHA_Date": "2016-05-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-11-12 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-11-01 00:00:00",
              "TrainingReviewDate": "2016-11-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-04-12 00:00:00",
              "EquipmentInspectionDate": "2017-03-22 00:00:00",
              "EquipmentTested": "Tank, piping, containment dike",
              "ChangeMgmtDate": "2017-02-22 00:00:00",
              "ChangeMgmtReviewDate": "2016-02-01 00:00:00",
              "PreStartupReviewDate": "2017-02-22 00:00:00",
              "ComplianceAuditDate": "2015-04-15 00:00:00",
              "AuditCompletionDate": "2017-12-31 00:00:00",
              "IncidentInvestigationDate": "2017-02-10 00:00:00",
              "InvestigationChangeDate": "2017-02-10 00:00:00",
              "ParticipationPlansReviewDate": "2017-02-02 00:00:00",
              "HotWorkPermitReviewDate": "2016-08-25 00:00:00",
              "ContractorSafetyReviewDate": "2017-04-06 00:00:00",
              "ContractorSafetyEvalDate": "2017-04-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000059104,
                  "PreventionProgram3ID": 1000048580,
                  "ProcessChemicalID": 1000071277
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000046816,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Calhoun County LEPC",
    "CoordinatingAgencyPhone": "2699696430",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046816,
      "SummaryText": "The Andersons Ethanol, LLC\r\nAlbion Ethanol RMP Executive Summary\r\n\r\n\r\nThe Andersons Albion Ethanol LLC is located at 26250 B Drive North in Albion, Michigan.  The facility is located near the intersection of Michigan Ave. and B-Drive North in Sheridan Township, which is in Calhoun County.\r\n\r\nThe Andersons Albion Ethanol LLC facility operates 24 hours a day, 7 days a week with a staff of approximately 55 people.  The following operations are performed at this facility:  grain receiving and storage; hammer milling;  fermentation;  distillation, dehydration and evaporation (DDE);  separation;  wet and dry distillers grain and solubles (WDGS / DDGS) drying, storage and shipping; corn oil separation; and ethanol storage and shipping.  A CO2 plant is co-located on the property on a parcel that is leased to a third-party business. \r\n\r\nThe plant receives corn by way of the pre-existing grain elevator or the secondary truck dump at the ethanol plant.  Corn is stored temporarily in the concrete silos, prior to being fed to eight hammer mills where the corn is dry-milled into a powder and then conveyed to the production area.\r\n\r\nAdditives are incorporated into the process and the product is fermented, creating a beer mash.  The product goes through a scrubbing process to removed residual volatile organics and then enters the distillation and condensation process.  The beer is approximately 14% ethanol and 86% non-fermentable corn solids.  The ethanol is separated from the beer at this stage and leaves as 190-proof ethanol, which is sent to a bulk storage tank.  The 190-proof contains residual water, so it is filtered one more time, which produces 200-proof ethanol.  Lastly, the 200-proof ethanol is mixed with a denaturant and stored in either of three tanks prior to transferring to the truck or rail load-out areas.  Emissions from the DDGS drying process are controlled through a recuperative thermal oxidizers.\r\n\r\nThe distillation process removes the ethanol from the beer, non-"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046816,
      "SummaryText": "fermentable corn solids and water.  The remaining water is then removed from the residual mash or whole stillage.  The resulting product is called wet distillers grain (WDG).  A small amount of WDGS will be maintained as \"wet cake\" - having a moisture content of 65 - 70% -- and sold directly to customers as high quality animal feed.  Storage of wet cake is very limited, on the south side of the Energy Center.  The majority of WDG will be dried to approximately 12% moisture.  The resulting product is called dried distillers grain (DDG), which can be stored for extended periods of time in the large barn at the southeast corner of the property.  After leaving the dryers, the DDG is cooled before going to storage.\r\n\r\nRecuperative thermal oxidizers serve as the primary emission control devices for the five dryers as well as various process vents.  The thermal oxidizers are very efficient at controlling particulates, carbon monoxide, VOC's, HAP's and nuisance odors.\r\n\r\nThe facility also has two water cooling towers for non-contact cooling water used in the fermentation process and two fire pumps for emergency use.\r\n\r\n\r\nRMP Applicability & Chemical Description\r\n\r\nThe presence of four constituents in the natural gasoline used to denature the ethanol requires participation in the Risk Management Plan.  Natural gasoline is a flammable mixture.  The four constituents of natural gasoline subject to the Risk Management Plan are butane, pentane, neo-pentane or 2,2-dimethylpropane, and iso-pentane or 2-methylbutane.  Butane makes up 0.806% of the natural gasoline, pentane makes up 24.518%, neo-pentane or 2,2-dimethylpropane makes up 0.237%, and iso-pentane or 2-methylbutane makes up 22.96%.\r\n\r\nNatural gasoline is stored in a 165,000 gallon steel tank in the facility's tank farm.  Secondary containment consisting of a diked structure containing an impermeable liner and gravel overlay surrounds the tank farm.  \r\n\r\n\r\nSummary of Release Scenarios\r\n\r\nWorst Case Release\r\n\r\nThe worst cas"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046816,
      "SummaryText": "e release scenario would be a total loss of a full tank of natural gasoline resulting in a vapor cloud explosion.  The storage tank capacity is 165,000 gallons or 910,800 pounds.  Of the 910,800 pounds, 441,989 pounds are made up of the materials subject to the Risk Management Plan.  \r\n\r\nAlternative Release\r\n\r\nThe most likely cause of a natural gasoline emergency is a release during a delivery due to a faulty hose or valve resulting in a vapor cloud explosion.  Deliveries are made by truck or railcar and pumped into the storage tank.  Deliveries by truck are typically 9,000 gallons or 49,680 pounds of which 24,105 pounds are RMP materials.  Deliveries by railcar are typically 30,000 gallons or 165,600 pounds of which 80,351 pounds are RMP materials.\r\n\r\nAll truck deliveries are made during business hours and are observed by the truck driver and facility personnel.  If a release were to occur the truck delivery, attendants could stop the flow within minutes.  The railcar unloading is attended by facility personnel at all times who would stop the flow from the pump and close the valve on the railcar in the event of a release.  The truck load-out area has a catchment basin with underground piping to secondary containment.  The railcar unloading area has a containment dike.\r\n\r\n\r\nFive-Year Accident History\r\nThere have been no denaturant-related accidents in the last five years.\r\n\r\n\r\nPrevention Program\r\nPreventive maintenance is an integral piece of this facility's hazard management program.  All equipment including hoses, tanks, and valves are inspected at least monthly.  A good PM program is our strongest defense against a release of denaturant.  All hose replacements are documented.  Records of all maintenance tasks performed on the tank or appendages are also on file.\r\n\r\n\r\nExplanation of How Natural Gasoline (Denaturant) Releases are Prevented\r\n\r\nPassive Mitigation\r\nThe natural gasoline storage and unloading areas are equipped with secondary containment.  Material rele"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000046816,
      "SummaryText": "ased will drain from the unloading concrete secondary containment pad into the southwest corner of the tank farm containment area.  Electrical equipment in the tank farm area is rated for Class 1 Division 1 to prevent any leakage from being ignited by electrical equipment. \r\n\r\nActive Mitigation\r\nHot work in the unloading area and tank farm is strictly controlled by hot work permits.  Unloading operations are attended at all times as described above.  Some of the fire hydrant(s) around the tank farm are equipped with water cannons to allow for fire suppression/control from a safe distance.  An emergency shutdown device is located at the truck load-out booth that will shutdown on pumps in the tank farm.  A Scully Signal System is used to prevent overfilling a truck.  The Scully System is programmed to automatically shut down loading when the amount designated by the truck driver is loaded into the truck.\r\n\r\n\r\nTraining\r\nAll employees receive annual training on flammable liquids, emergency action plan and spill procedures, and hazard communication.  Documentation and attendance rosters are on file at the facility.  \r\n\r\n\r\nContractors\r\nContractors that are hired by The Andersons, Inc. go through a documented Prequalification process.  Records of this evaluation are kept on file.\r\n\r\nAll contractors also receive a \"contractor safety review\" prior to performing work at the facility.  During this review, they are informed of any potential hazards at the facility, emergency procedures, site-specific safety rules and the ability to request a SDS for any product at any time.\r\n\r\n\r\nSteps Taken to Address Hazards\r\nThe Andersons Albion Ethanol LLC has many systems in place for hazard assessment and mitigation.  \r\n\r\nThe Safety Department performs annual hazard management audits at the facility.  The audits include a physical walk through of the entire facility and a review of all EPA, OSHA and DOT paperwork and training documentation.  Action items are noted and recommendations are m"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000046816,
      "SummaryText": "ade. The audits consist of five major topical areas:  Safety & Health, Environmental, Fire Protection & Security, Administrative and Housekeeping & Storage.  Issues are documented in a report and sent to the facility manager and upper management.  Updates on action item status must be made regularly.\r\n\r\nA Process Hazard Analysis (PHA) has been performed at this facility, as part of the Process Safety Management Program.  The analysis will be updated every five years, or as changes in the process are made.  PHA's are performed using the Haz Op protocol and analyze all aspects involved in the production of ethanol.  The evaluation team includes representatives from the corporate Safety Department, facility management and operations employees.\r\n\r\nStandard operating procedures have been established for all activities related to the natural gasoline storage and handling.  These procedures are reviewed annually by employees and management to ensure they are current.  The procedures are available to the employees at the facility in hard copy and in an electronic database. \r\n\r\nPre-startup safety reviews are conducted prior to start-up after major shutdowns and/or changes to the process.  These reviews ensure that the process has been restored to a safe operating condition prior to beginning operations.  The reviews are documented and those forms are kept on file at the facility.\r\n\r\nFormal investigations are performed for all environmental or safety incidents.  Documentation is kept on file at the facility and the corporate Safety Department.\r\n\r\nA formal Management of Change (MOC) system is in place at this facility.  A form is filled out whenever a change is made to any of the processes within the scope of the RMP program.  This ensures that appropriate documentation such as P&IDs, operating procedures, maintenance items, etc. are reviewed and updated as needed where affected by the change.  Forms are routed from the facility operator to the Ethanol Engineering and Safety D"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000046816,
      "SummaryText": "epartments for review and remarks.  Where changes affect operating procedures, revisions are made and employee training is completed prior to start-up of the changed process.  A copy of the completed is form kept on file at the facility.\r\n\r\nThe facility maintains compliance with environmental permits applicable to the operations.  These permits include various requirements for weekly, monthly, and quarterly activities to prevent leaks or uncontrolled emissions of flammable materials.\r\n\r\nMonthly Safety Committee meetings allow employees to discuss any concerns they may have with the operation of the facility.  Issues are documented and assigned to employees for follow-up. Records of all meetings are kept electronically.\r\n\r\n\r\nResponse Action in the Event of a Release\r\nIn the event of a small, controlled leak or defective valve, employees are instructed to shut down the transfer process and, if possible, don the appropriate PPE, approach the shutoff valve from upwind and attempt to turn it off.  Notification of site personnel would be made as soon as possible when the leak has been detected.\r\n\r\nFor an uncontainable release, employees will immediately call the police and fire department or other first responders, as appropriate.  All employees, customers and contractors are to be evacuated to an appropriate location.  Once the response team has arrived, we will work in concert with them to close the valves between the tank and the leak.  \r\n\r\nThe employees are instructed to make emergency phone calls in this order:  911, the facility Manager, the corporate Safety Department emergency phone number, the MDEQ emergency hotline and the National Spill Response Center phone number.  All applicable contact names and numbers are found in the facility spill and emergency action plan. \r\n\r\n\r\nCommunication procedures with responders \r\nThe local fire department is invited to tour the facility on an annual basis.  Facility management, employees and fire department personnel have joint"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000046816,
      "SummaryText": "ly discussed the location of the flammable liquids and response procedures on a regular basis.  They know the location of all emergency shutoff valves and on-site response equipment.  \r\n\r\nThe LEPC and state regulatory agencies receive a copy of our hazardous materials storage information, every February, in accordance with our community right to know obligations.  A representative of the site participates in the County LEPC.  A copy of the Emergency Action Plan is on file with the LEPC and the local fire department.\r\n\r\n\r\nSecurity Plans\r\nThe Department of Transportation (DOT), Research and Special Programs Administration (RSPA) 49 CFR Part 172, requires all facilities that offer or transport hazardous materials to document a security plan and perform employee awareness training.  \r\n\r\nA security assessment plan has been created to describe all security measures at this facility, identify any vulnerable areas and then document the measures taken to address those risks.  The plan is intended to work in conjunction with the Emergency Action, Spill Prevention, Control and Countermeasures (SPCC) Plan to meet all required criteria.\r\n\r\nTraining is performed with all employees annually and within 90 days of employment."
    }
  ]
}