{
  "FacilityID": 1000048665,
  "FacilityName": "Lamb Weston/ BSW",
  "FacilityStr1": "1203 Basin",
  "FacilityStr2": null,
  "FacilityCity": "Warden",
  "FacilityState": "WA",
  "FacilityZipCode": "98857",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53025",
  "LEPC": "Grant County LEPC",
  "FacilityLatDecDegs": "46.970278",
  "FacilityLongDecDegs": "-119.055000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Ochoa Ag Unlimited Foods, Inc",
  "Company2Name": "ConAgra Foods Lamb Weston, Inc.",
  "CompanyDUNS": 14384213,
  "Company2DUNS": 801242202,
  "OperatorName": "Lamb Weston/BSW LLC",
  "OperatorStr1": "1203 Basin",
  "OperatorStr2": null,
  "OperatorCity": "Warden",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98857",
  "OperatorZipCodeExt": null,
  "FTE": 340,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000158027",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-09-19 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-02-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-02-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-02-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-02-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 46.971109,
  "FRS_Long": -119.054756,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060997,
      "AltID": null,
      "FacilityID": 1000048665,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000074715,
          "ProcessID": 1000060997,
          "ChemicalID": 56,
          "Quantity": 67185.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000062162,
          "ProcessID": 1000060997,
          "NAICSCode": "311411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000050724,
              "Process_NAICS_ID": 1000062162,
              "SafetyReviewDate": "2012-11-27 00:00:00",
              "PHA_Date": "2013-09-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-08-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-02-05 00:00:00",
              "TrainingReviewDate": "2012-09-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-02-06 00:00:00",
              "EquipmentInspectionDate": "2015-01-13 00:00:00",
              "EquipmentTested": "compressors",
              "ChangeMgmtDate": "2014-11-03 00:00:00",
              "ChangeMgmtReviewDate": "2012-09-18 00:00:00",
              "PreStartupReviewDate": "2014-11-03 00:00:00",
              "ComplianceAuditDate": "2012-05-16 00:00:00",
              "AuditCompletionDate": "2016-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-09-18 00:00:00",
              "HotWorkPermitReviewDate": "2012-09-18 00:00:00",
              "ContractorSafetyReviewDate": "2015-01-22 00:00:00",
              "ContractorSafetyEvalDate": "2012-09-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000061870,
                  "PreventionProgram3ID": 1000050724,
                  "ProcessChemicalID": 1000074715
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000048665,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-09-19 00:00:00",
    "ERTrainingDate": "2014-06-22 00:00:00",
    "CoordinatingAgencyName": "Grant County Fire Department",
    "CoordinatingAgencyPhone": "5093492471",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048665,
      "SummaryText": "activities as part of ongoing operations.  The purpose of the plan is to establish policies and procedures for protecting the health and safety of employees, contractors, and visitors, and to comply with all applicable federal and state regulations.  Training of employees and contractors includes providing a copy of the plan upon initial employment at Lamb Weston/BSW and reviewing it for their specific assignment, annual refresher training for current employees, and review for all whenever the plan is changed.  In addition, plant evacuation drills are conducted on a regular basis. \r\n\r\nThe plan is comprehensive enough to deal with all types of emergencies specific to the Lamb Weston/BSW facility and defines the following:\r\n\r\n¿\tHow to conduct activities in a manner that protects the safety of employees, the public, and the environment\r\n\t\r\n¿\tPreferred means for reporting fires, hazardous materials incidents, medical, and any other emergencies\r\n\t\r\n¿\tEmergency escape procedures and emergency escape route assignments\r\n\t\r\n¿\tProcedures to account for all employees including contractors and visitors\r\n\t\r\n¿\tNames of agencies and persons to contact for further assistance, information, or explanation of the plan\r\n\t\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Lamb Weston/BSW facility takes seriously its responsibility for the safety of its employees, neighbors, and community.  Central to this responsibility are our programs to prevent the release of chemicals to the environment.  We will continue to implement these precautions and programs, to act as a responsible neighbor, and to maintain the goodwill of the community."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048665,
      "SummaryText": "SAFETY COMMITMENTS\r\n\r\nLamb Weston/BSW is committed to providing its employees and the surrounding community with a safe and healthy environment.  The Risk Management Program is an integral part of our strong commitment to sustainable development, which means development that meets the needs of the present without compromising the ability of future generations to meet their own needs.  Sustainable Development requires reductions in the generation of wastes and pollutants, protection of clean air and clean water, sustainable protection of the land, and the wise use of energy.  It requires employee commitment, strategic thinking, innovation, the involvement of our suppliers, new technology and enhanced production processes.  \r\n\r\nDESCRIPTION OF FACILITY AND REGULATED SUBSTANCES\r\n\r\nThe Lamb Weston/BSW processing facility in Warden, Washington produces various potato products such as french fries, hash browns, and formed potato products.  The plant site consists of a main processing plant, boiler/refrigeration facility, and primary water treatment facility.  Activities are conducted at this site during all months of the year.\r\n\r\nThe potato processing cycle includes a wide array of steps.  The plant purchases the majority of its potatoes from local growers.  Since potatoes have a single growing season, they must be held under controlled storage conditions.  Prior to processing, the potatoes are separated by size and processing specifications.  The inspected, washed, peeled, and hand-trimmed potatoes are cut, blanched and fried.  The final products are frozen, packaged and prepared for shipping.\r\n\r\nThe freezing process where finished products are conveyed through the freezer to be quickly cooled and frozen is made possible by refrigeration systems containing anhydrous ammonia, an EPA-regulated chemical. Virtually all major food processors, including ConAgra Foods Lamb Weston, utilize anhydrous ammonia in large refrigeration or freezing plants and the chemical has been use"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048665,
      "SummaryText": "d in this capacity since the 1850's.  \r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nLamb Weston/BSW's accident prevention/loss control systems and policies involve a unified approach that integrates technologies, procedures, and best-management practices.  The OSHA-PSM and the EPA-RMP plans work together to assure that potential on-site hazards and off-site consequences are identified and controlled to the best of our ability, and that the processes are meeting health and safety objectives.\r\n\r\nThe RMP Prevention Program is comprised of the 13 elements of OSHA's PSM program: Employee Participation, Process Safety Information, Process Hazard Analysis, Management of Change, Pre-Startup Safety Review, Operating Procedures, Hot Work Permits, Employee Training, Incident Investigation, Mechanical Integrity, Emergency Planning & Response, Contractor Safety, and Audits.  \r\n\r\nEmployee participation brought together people that knew and understood the system, from practical experience as well as their technical knowledge, to develop the Plan.  Process safety information is a collection of data that allows us to identify and understand the hazards posed by our inventory.  Representatives from our skilled work force and management, who understood the process being analyzed including the engineering behind the covered process, conducted the process hazard analysis.  This analysis identifies potential process failures that could result in an uncontrolled release of ammonia.   \r\n\r\nIn order to safely manage changes that need to be made to the processes containing ammonia, a system of checks and balances has been established.  This system will evaluate safety prior to the work being done, and provide a solid review of the system to assure that once started, it will run as designed.  Standard operating procedures are in place for each operating phase and are readily accessible to those workers who operate or maintain the process.  In addition, a policy and procedure are used to assure"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048665,
      "SummaryText": "that proper safety precautions are taken for all personnel performing Hot Work.  The integrity of the refrigeration system equipment is maintained according to recognized and generally accepted good engineering practices and according to a well-documented preventive maintenance program.\r\n\r\nAn extensive training program is in place for those employees and contractors involved in working on or around the process and covers operating procedures, health and safety hazards, emergency operations, and safe work practices.  The facility also has a training program for all employees and contractors regarding the hazards of the chemical and safe work practices to be used.  Part of this training includes monthly safety meetings as well as drills on spill response and plant evacuation.  \r\n\r\nAny incidents related to the ammonia refrigeration systems are promptly investigated even though the rule only requires investigation of those incidents, which resulted in, or could reasonably have resulted in, a catastrophic release.  All incidents are analyzed, resolved, and findings shared with affected employees.  In order to assure compliance with all elements of the prevention program, an audit is conducted every three years including a report of the findings and documentation of any deficiencies corrected.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nThere have been no accidental releases at the Lamb Weston/BSW Facility in the last five years from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\r\n\r\nEMERGENCY RESPONSE PROGRAM  \r\n\r\nThe Lamb Weston/BSW facility has an emergency action plan which has been coordinated (reviewed) with the Warden Fire Department.  Both are members of the Local Emergency Response Planning Committee.    \r\n\r\nThe plan applies to all Lamb Weston/BSW employees, visitors, and support service contractors performing tasks and"
    }
  ]
}