{
  "FacilityID": 1000050639,
  "FacilityName": "Cross Oil Refining and Marketing",
  "FacilityStr1": "484 E. 6th Street",
  "FacilityStr2": null,
  "FacilityCity": "Smackover",
  "FacilityState": "AR",
  "FacilityZipCode": "71762",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05139",
  "LEPC": "Union County LEPC",
  "FacilityLatDecDegs": "33.363611",
  "FacilityLongDecDegs": "-92.714167",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 10283828,
  "ParentCompanyName": "Martin Operating Partnership, LP",
  "Company2Name": null,
  "CompanyDUNS": 829943989,
  "Company2DUNS": 0,
  "OperatorName": "Martin Operating Partnership, LP",
  "OperatorStr1": "PO Box 191",
  "OperatorStr2": null,
  "OperatorCity": "Kilgore",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75663",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Ricker",
  "RMPTitle": "VP Refinery Operations",
  "FTE": 85,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000230038",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1227-AOP-R0",
  "SafetyInspectionDate": "2014-11-21 00:00:00",
  "SafetyInspectionBy": "ABS Consulting",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-01-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-07-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-07-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-06-05 00:00:00",
  "DeRegistrationEffectiveDate": "2020-05-28 00:00:00",
  "AnniversaryDate": "2020-07-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000063791,
      "AltID": "Naphtha storage/transfer",
      "FacilityID": 1000050639,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000064932,
          "ProcessID": 1000063791,
          "NAICSCode": "32411",
          "_desc": {
            "NAICS_CODE": "32411",
            "NAICS_DESCRIPTION": "Petroleum Refineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000078818,
          "ProcessID": 1000063791,
          "ChemicalID": 155,
          "Quantity": 1300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000067760,
              "ProcessChemicalID": 1000078818,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000067761,
              "ProcessChemicalID": 1000078818,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000578818,
          "ProcessID": 1000063791,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050639,
      "SummaryText": "Executive Summary\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nMartin Operating Partnership L.P. (MOP) operates the Cross Oil Refinery in Smackover, AR (herein after referred to as the Facility or Site).  The facility handles substances considered hazardous by the U.S. EPA and has implemented a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at the facility.\n\n\n\nIn addition to training and procedures, the facility has implemented a Mechanical Integrity Program, emergency shutdown systems and warning alarms.  If an accidental release should occur, the facility is prepared to work with the Smackover Fire Department, and other interested authorities, to mitigate any release, inform all affected parties and minimize the impact of the release to people and the environment.\n\n\n\nRegulated Substances Handled\n\n\n\nThe facility handles naphtha, which has an NFPA flammability rating of 4. Naphtha at the facility may contain Pentane and Isopentane in quantities greater than 1%, therefore the entire mixture is regulated under the RMP program. The total quantity, rounded to 2 significant figures, of Naphtha on-site is 1,300,000 lbs. The maximum quantity of Pentane on-site, rounded to 2 significant figures is 18,000 lbs and the maximum quantity of Isopentane on-site, rounded to 2 significant figures is 15,000 lbs. Naphtha is produced within the main Crude Unit of the facility and transferred by pipe to 1 of 4 storage vessels. Naphtha is then transferred from storage to trucks for shipment off-site.\n\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n\n\nNaphtha, containing the regulated compounds Pentante and Isopentane, are managed as required under RMP Program 3 (or Subpart D) and OSHA's PSM program.  Program 3 requires that the facility have the process safety information for the hazardou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050639,
      "SummaryText": "s chemical, conduct a process hazard analysis (PHA), create operating procedures, conduct training, implement a mechanical integrity program, implement a management of change program, conduct pre-startup reviews, conduct compliance audits, conduct incident investigations, ensure employee participation, issue hot work permits, and include contractors in the release prevention program.\n\n\n\nProcess Safety information\n\n\n\nSafety Data Sheets (SDS) are maintained on site and online and are readily available to any employee for review.  The SDS contains all of the information required by 40 CFR ?68.65(b)(1)-(7).\n\n\n\nInformation pertaining to the technology of the process at the facility is contained in process flow diagrams (PFD) and Piping and Instrumentation Diagrams (P&ID).  The chemistry of the substances stored, maximum inventory, safe upper and lower temperature, pressure, and flow limits, and the evaluation of the consequences of deviations are all maintained on site and are managed by the PSM Coordinator.\n\n\n\nProcess Hazard Analysis\n\n\n\nA PHA was conducted and has been re-evaluated every 5 years.  The PHA was and is conducted by qualified staff which consists of Environmental Health and Safety (EHS) staff and on site staff.  The methods utilized to complete the PHA have been checklist and Hazard and Operability Study (HAZOP).  Other methodologies as allowed by 40 CFR ?68.67b(1)-(7) may be used in future updates of the PHA if applicable.\n\n\n\nOperating Procedures\n\n\n\nOperating procedures are written by competent staff, such as facility managers or lead operators, which have experience with the tasks outlined in the procedure.  The procedures include all of the elements described in 40 CFR ?68.69(a)(1)-(3), are kept onsite and made available to any employee for review.  The operating procedures are reviewed as needed or when a management of change occurs and are certified annually.  Safe work practices have also been developed as required in 40 CFR ?68.69(d).\n\n\n\nTraining\n\n\n\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050639,
      "SummaryText": "Each new employee is trained according to his/her job role.  Those employees at the facility undergo initial awareness training as well as specific training on procedures they may use in operating a process.  The employees are refreshed at least once every three years and their training is documented and kept on site for review.\n\n\n\nMechanical Integrity\n\n\n\nThe facility utilizes trained professionals for inspection and testing of process equipment, and utilizes written procedures to aid in proper operation and maintenance of the equipment.  The process equipment described in 40 CFR ?68.73(a)(1)-(6) are inspected based on the written procedures developed by Martin or third party procedures (i.e. ASTM).  Any deficiencies found by the mechanical integrity group that are outside acceptable limits are corrected before further use or in a safe and timely manner, when necessary means are taken to assure safe operation.\n\n\n\nManagement of Change\n\n\n\nWritten procedures have been developed to track and manage changes to operating procedures, process equipment, chemicals, technology, process safety information, and, changes to stationary sources that affect a covered process.  The procedures assure that the considerations found in 40 CFR ?68.75(b)(1)-(5) are addressed prior to any change.\n\n\n\nThose employees affected by the change are notified and trained on the change prior to start-up of the process or affected part of the process.\n\n\n\nPre-Startup Review\n\n\n\nPre-startup safety reviews will be conducted prior to startup of affected new stationary sources or any modified stationary sources, when those modifications are significant enough to require a change in the process safety information.  The pre-startup safety review confirms that prior to the introduction of regulated substances to a process: construction and equipment is in accordance with design specifications; safety, operating, maintenance, and emergency procedures are in place and are adequate; for new sources, a PHA has be"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050639,
      "SummaryText": "en performed and recommendations have been resolved or implemented before startup; and modified sources meet the requirements contained in the management of change; training of each employee involved in operating the process has been completed.\n\n\n\nCompliance Audits\n\n\n\nCompliance audits are conducted once every three years to verify that procedures and practices developed under the RMP rules are adequate and are being followed.  The audits are conducted by a team that consists of Martin Corporate EH&S personnel or an outside third party who are knowledgeable in the process.  The compliance audits are available on site for review.\n\n\n\nIncident Investigations\n\n\n\nMartin investigates each incident which results in or could reasonably have resulted in a catastrophic release of a regulated substance.  Incident investigations are conducted by both on site and Corporate EH&S personnel.  Once the investigation has been completed, a report is prepared and includes those items required in 40 CFR ?68.81(d).\n\n\n\nEmployee Participation\n\n\n\nEmployees are included in PHAs and have access to PHAs that have been completed.  Employees are also included in the writing and updating of operating procedures as well as the management of change process and other covered elements of the RMP.\n\n\n\nHot Work Permit\n\n\n\nHot work permits are issued by shift manager, product shift manager or safety department permit writer for hot work conducted on or near processes covered by the RMP rule. The hot work permit is written to address the elements described in 40 CFR ?68.85(b).\n\n\n\nContractors\n\n\n\nMartin requires that contractors participate in the safety programs implemented by the facility.  Contractors are evaluated based on safety performance prior to being selected to perform work at the facility.  Contractors are trained and documentation of successful completion of the training is required to be kept by both Martin and the contractor.\n\n\n\nFive-year Accident History\n\n\n\nThere have been no accidents at the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050639,
      "SummaryText": " site during the past five years.\n\n\n\nEmergency Response Program\n\n\n\nMartin has an emergency action plan place, in accordance with OSHA's PSM rules.  The plan includes appropriate procedures for notifying emergency responders.  The facility is listed in the community emergency response plan.  The facility's emergency response plan is kept onsite and is available for review.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nSafety improvement is an on-going process at Martin.  As new safety measures are planned and implemented, the RMP will be updated accordingly.\n\n"
    }
  ]
}