{
  "FacilityID": 1000024684,
  "FacilityName": "Blanchard Terminal Company LLC - Charlotte East",
  "FacilityStr1": "7401 Old Mt. Holly Road",
  "FacilityStr2": null,
  "FacilityCity": "Charlotte",
  "FacilityState": "NC",
  "FacilityZipCode": "28214",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37119",
  "LEPC": "Mecklenburg County LEPC",
  "FacilityLatDecDegs": "35.277703",
  "FacilityLongDecDegs": "-80.929703",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78697868,
  "ParentCompanyName": "Marathon Petroleum Corporation",
  "Company2Name": null,
  "CompanyDUNS": 962993101,
  "Company2DUNS": 0,
  "OperatorName": "Blanchard Terminal Company LLC",
  "OperatorStr1": "539 South Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Findlay",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45840",
  "OperatorZipCodeExt": null,
  "RMPContact": "Timothy J. Aydt",
  "RMPTitle": "President, Blanchard Terminal Co",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000216241",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-11-15 00:00:00",
  "SafetyInspectionBy": "NC Dept. of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-11-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-11-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-11-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000030251,
      "AltID": null,
      "FacilityID": 1000024684,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000030573,
          "ProcessID": 1000030251,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000036354,
          "ProcessID": 1000030251,
          "ChemicalID": 118,
          "Quantity": 248935.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000536354,
          "ProcessID": 1000030251,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024684,
      "SummaryText": "Blanchard Terminal Company LLC (a subsidiary of Marathon Petroleum Corporation) - Charlotte East Terminal (Charlotte East) is a refined petroleum product distributor.  The Charlotte East Terminal is an on-shore, light products, bulk petroleum storage terminal used in the storage and distribution of petroleum products to retail and commercial end-users in the vicinity of Charlotte, NC.  The Terminal handles and stores various grades of unleaded gasoline, low-sulfur diesel, butane, ethanol, and various other petroleum-based additives.  This Risk Management Program (RMP) covers the Butane Blending Process (source) at the Terminal/Facility.  This document complies with the U.S. Environmental Protection Agency's (EPA) Accidental Release Prevention Provisions (40 CFR Part 68) and includes by reference the attached Process Safety Management Program elements (Part I) in 29 CFR Part 1910.119.  Enforcement of 40 CFR Part 68 is delegated to Mecklenburg County.\n\n\n\nAccidental release prevention and emergency response policies:\n\n\n\nThe primary function of the Facility is to act as a refined petroleum distribution facility.  By virtue of the flammable effects associated with butane, it is necessary to observe certain safety precautions in handling butane to prevent unnecessary human exposure, to reduce the threat to employee health, and to minimize the threat and impact to nearby members of the community.  Charlotte East is strongly committed to employee, public, and environmental safety and health.  Safety at the Facility depends upon the manner in which butane is handled as well as the various safety devices incorporated into the design of the process.  Furthermore, comprehensive training is provided to employees (and contractors, as appropriate), which reinforces the safety policies and procedures of the Facility.\n\n\n\nThe Charlotte East Terminal complies with the National Fire Protection Association's (NFPA's) Liquefied Petroleum Gas (LPG) Code (NFPA #58-2011) requirements for LP"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024684,
      "SummaryText": "-Gas Storage.  In addition to the presence of appropriate controls to prevent possible releases of butane, if a release does occur, an Emergency Response Action Plan (ERAP) is in place for the Facility and response activities are coordinated with Charlotte Fire Department (Station 21 is primary) and Mecklenburg County Emergency Management.\n\n\n\nThe regulated substances handled at the Facility:\n\n\n\nThe RMP regulated substance handled at the facility is n-butane.  The maximum amount of butane that can be stored at this facility is approximately 248,935 pounds inclusive or piping.  Butane is received by truck (transports) and stored in one (1) 60,000-gallon (W.C.) storage vessel.  Specifically, liquefied butane is off-loaded by truck for storage under pressure (pressure reliefs set at 250 psi on the storage vessel).  The butane is pumped to a blending/injection skid for direct injection into regular and premium unleaded gasoline lines feeding the injection points to the gasoline truck-loading rack.  Injection quantities are controlled via the injection blending skid based on sampling data obtained through the Bartec-Benke Analyzer and typically range from 2-8%.  Process safety controls include excess flow valves, low-melting point (<250?F) pneumatic valve line (or fusible links) feeds to pneumatic valves (fail closed [exception is pump bypass valve]), 85% fill shut-off (80% alarm and 90% ESD actuation) on the vessels, emergency shut-off devices on the system and video display terminal (also referred to as \"GUI\" or \"HMI\"), line thermal/hydrostatic reliefs (set points = 50 psi differential), and grounding interlock devices.  Access to the Facility is restricted to authorized employees, management personnel, and authorized contractors/visitors.  Additional vessel protection include the intumescent coating and unmanned fire monitors (x2)\n\n\n\nDescription of Off-Site Consequence Analysis Methodologies (Reference Appendix A and B of this RMP)\n\n\n\nThe \"Worst-Case\" and \"Alternate\" r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024684,
      "SummaryText": "elease scenario endpoints were determined based on regulatory requirements in 40 CFR Part 68 (i.e. Vapor Cloud Explosion for \"Worst Case\" Flammable Gas) and discussion with the system engineers (potential alternative scenarios such as \"Pull-away Incidents\", other container failures, Boiling Liquid Expanding Vapor Explosions [BLEVEs], etc.).  Release scenarios are less likely to occur during the May through August timeframe due to process inactivity (non-blending season); however, releases greater than \"de minimus\" quantities are extremely unlikely, regardless.  The \"Worst Case\" distance to endpoint is based on a 1 psi overpressure from the explosion of a butane vapor cloud (see Appendix A, Figure A1).  The selected \"Alternate Case\" endpoint criteria is an energy value of 5 kw/m2 for 40 seconds (expressed as a second degree burn) (see Appendix A, Figure A2).  All distances were modeled using the U.S. EPA's \"RMP Comp-Version 1.07.\"\n\n\n\nThe \"Worst-Case\" scenario assumes a catastrophic failure of the system single largest vessel (per EPA Guidance Document) resulting in a total release of the flammable substance (Butane) and the resulting vapor cloud explosion, both of which are highly unlikely.  In this case, one butane storage vessel was assumed to fail releasing approximately 246,697 pounds of butane.  A 10% yield (TNT equivalent) is assumed as a parameter of this model.  Incorporating a wind speed of 3.4 mph, an atmospheric stability class of \"F\", and an air temperature of 77?F, a 1 psi overpressure distance to endpoint was determined to be 0.5 miles.\n\n\n\nThe \"Alternate\" scenario was determined based on a combination of the likelihood of an event and its potential severity (The U.S. EPA requires that the \"Alternate\" scenario impacts off-site receptors unless no alternative is available).  In this case, the BLEVE scenario was chosen which identifies the unlikely potential that this situation would arise.  The most likely situation that would lead to a BLEVE of a vessel "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024684,
      "SummaryText": "is due to radiant heat flux resulting from a severe product tank farm release and fire, as well as presuming loss of cooling water supply/capability.  This scenario also presumes the failure of the vessel pressure reliefs.  This is estimated to release approximately 246,697 pounds of butane.  This scenario was selected based on the possibility of off-site impacts.  Other scenarios such as \"pull-away\" events, pump leaks, PRV leaks, etc. yielded impacts from 0.01 to 0.02 miles with minimal or no impacts off-site.\n\n\n\nIncorporating a wind speed of 6.7 mph, an air temperature of 77?F, and an Atmospheric Stability Class of \"D\", the explosion would result in a distance to endpoint (5 kw/m2 for 40 seconds) of 0.6 miles.\n\n\n\nFollowing a determination to endpoint, an assessment of critical off-site receptors was made.  Per 40CFR Part 68, this includes residential populations (see Appendix A, Table A1), other public (mass population) receptors (schools, hospitals, prisons, recreational structures, nursing homes, commercial areas, industrial areas, etc.), and  sensitive/higher-value environmental areas (natural areas, parks, preserves, national/state forests, wildlife sanctuaries, federal wilderness areas, etc.)\n\n\n\nThe residential and other public receptors were determined using \"LandView 6 - A viewer for the U.S. Environmental Protection Agency, U.S. Census Bureau, and U.S. Geological Survey Data and Maps\" (see attached description) (see Appendix A, Table A1) and associated \"CAMEO\" and \"MARPLOT\" emergency planning software.  The environmental receptors were assessed via U.S. Geological Survey mapping.  All information, including \"LandView 6\" data are confirmed to the extent reasonable by Facility personnel and visual review to the extent possible.\n\n\n\nThe following critical receptors were identified:\n\n\n\nA.  \"Worst Case\"\n\n1)  Residential = 53\n\n2)  Other public receptors =\n\n\n\n\"High-density critical populations\" buildings/areas (e.g. hospitals, schools, etc.): Yes - Churches, Publi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000024684,
      "SummaryText": "c Buildings\n\n-    Paw Creek Presbyterian Church (818 feet northeast)\n\n\n\nCommercial/Industrial:  Yes - Commercial and light industrial facilities contiguous to the SL Facility:\n\n-    Sellers Auto Machine (north 460 feet),\n\n-    US Post Office (north 380 feet),\n\n-    Public Transport Corporation (north 370 feet),\n\n-    Ed Wallace Rentals (north 1040 feet),\n\n-    Tank Town Truck Repair (north 1010 feet),\n\n-    Sealane Express (north 1340 feet),\n\n-    Colonial Pipeline (north 2240 feet),\n\n-    Cornett Ornamental Iron (northeast 1040 feet),\n\n-    Horizon Freight Systems (northeast 1480 feet),\n\n-    Petroleum Transport (northeast 1790 feet), \n\n-    Kinder Morgan Charlotte South (east 330 feet),\n\n-    Holcim Trading (east 590 feet),\n\n-    Coastal Warehouse (east 840 feet),\n\n-    Magellan Terminals (east 1370 feet),\n\n-    Wood Creek Warehouse/Office Complex (east 2040 feet),\n\n-    CSX Transportation (southeast 2420 feet),\n\n-    Duke Power (southwest 1910 feet),\n\n-    Northwest Family Physicians (southwest 2320 feet),\n\n-    National Terminal Corp (west 910 feet),\n\n-    Transmontaigne Operating (west 1120 feet),\n\n-    Ed Wallace Construction (west 1700 feet),\n\n-    Jordan Oil Company (west 1970 feet),\n\n-    Fleet Transport (west 1990 feet),\n\n-    Citgo Petroleum (northwest 1560 feet),\n\n-    Eco-Energy Distribution (northwest 2220 feet), \n\n-    Charlotte Terminals #1 (northwest 2310 feet), and\n\n-    Motiva Enterprises (northwest 2590 feet).\n\n3)  Recreation = None Identified\n\n4)  Environmental Receptors = None Identified\n\n5)  Other = CSX Transportation Rail line (south 930 feet and north 640 feet)\n\n\n\nB.  \"Alternate\"\n\n1)  Residential = 80\n\n2)  Other public receptors =\n\n\n\n\"High-density critical populations\" buildings/areas (e.g. hospitals, schools, etc.): Yes - Churches, Public Building\n\n-    Paw Creek Presbyterian Church (818 feet northeast)\n\n-    Pawtuckett Village Shopping Center (southwest 2725 feet)\n\n\n\nCommercial/Industrial:  Yes - Commercial and light industrial facilities contiguous to the SL Facility:\n\n-    Sellers Auto Machine (north 460 feet)\n\n-    US Post Office "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000024684,
      "SummaryText": "(north 380 feet),\n\n-    Public Transport Corporation (north 370 feet),\n\n-    Ed Wallace Rentals (north 1040 feet),\n\n-    Tank Town Truck Repair (north 1010 feet),\n\n-    Sealane Express (north 1340 feet),\n\n-    Colonial Pipeline (north 2240 feet),\n\n-    Cornett Ornamental Iron (northeast 1040 feet),\n\n-    Horizon Freight Systems (northeast 1480 feet),\n\n-    Petroleum Transport (northeast 1790 feet), \n\n-    Kinder Morgan Charlotte South (east 330 feet),\n\n-    Holcim Trading (east 590 feet),\n\n-    Coastal Warehouse (east 840 feet),\n\n-    Magellan Terminals (east 1370 feet),\n\n-    Wood Creek Warehouse/Office Complex (east 2040 feet),\n\n-    CSX Transportation (southeast 2420 feet),\n\n-    Fedex Ground (southeast 2720 feet),\n\n-    Duke Power (southwest 1910 feet),\n\n-    Northwest Family Physicians (southwest 2320 feet),\n\n-    Bi-Lo Grocery Store (southwest 2750 feet),\n\n-    National Terminal Corp (west 910 feet),\n\n-    Transmontaigne Operating (west 1120 feet),\n\n-    Ed Wallace Construction (west 1700 feet),\n\n-    Jordan Oil Company (west 1970 feet),\n\n-    Fleet Transport (west 1990 feet),\n\n-    Citgo Petroleum (northwest 1560 feet),\n\n-    Eco-Energy Distribution (northwest 2220 feet), \n\n-    Charlotte Terminals #1 (northwest 2310 feet), and\n\n-    Motiva Enterprises (northwest 2590 feet)\n\n3)  Recreation = None Identified\n\n4)  Environmental Receptors = None Identified\n\n5)  Other = CSX Transportation Rail line (south 930 feet and north 640 feet)\n\n\n\nThe general accidental release prevention program and the specific prevention steps:\n\n\n\nThe Facility complies with 40 CFR Part 68 of the EPA and with all applicable State Administrative Codes of North Carolina and its regulations.  The Facility Butane Blending Process is designed and constructed in accordance with NFPA-58, 2011 Edition, and additionally complies with 29 CFR Part 1910.119 (Process Safety Management for Highly Hazardous Chemicals).\n\n\n\nFive-year accident history:\n\n\n\nAs this is a new process/stationary system there have been no accidents within the past five (5) years.\n\n\n\nThe emergency response pr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000024684,
      "SummaryText": "ogram:\n\n\n\nResponse actions are coordinated with the Charlotte Fire Department (initial response by Station #21) and Charlotte/Mecklenburg County Emergency Management.  An (ERAP) is in place to inform employees what to do in case of a release, fire, medical emergency, etc., and to notify emergency responders when there is a need for a response.  The Charlotte Fire Department (Station #21 and Mecklenburg Hazmat) is aware of this system and has received training on the process and hazards of butane (Nov. 8, 2011).\n\n\n\n \n\nPlanned changes to improve safety:\n\n\n\nSafety improvements are planned in accordance with, and result primarily from, two RMP elements.  They are the (1) incident investigation element and (2) the audit element.   \n\n\n\nBlanchard will use the incident investigation process to capture improvement needs that are tracked to completion, including lessons learned from safety events.  These investigations can result in improvements that cover RMP elements as well as more traditional safety. \n\n\n\nBlanchard also conducts the following audits with varying degrees of formality and facility involvement, and these will also result in safety improvements:\n\n\n\nAudit\n\nTier        Focus                    Auditor            Schedule\n\n\n\nTier 1        Process Safety Management (PSM)/RMP    Facility    Annual\n\nTier 1        Safety (Comprehensive)            Facility    Annual\n\nTier 2         Safety (Comprehensive)             3rd Party     Annual\n\nTier 2         Management Systems - (PSM/RMP)         3rd Party     Triennial\n\n\n\nFindings from audits are used to help ensure process, personnel, and equipment performance improvements.  \n\n\n\n"
    }
  ]
}