{
  "FacilityID": 1000058481,
  "FacilityName": "Ergon Refining, Inc.",
  "FacilityStr1": "2611 Haining Road",
  "FacilityStr2": "PO Box 309",
  "FacilityCity": "Vicksburg",
  "FacilityState": "MS",
  "FacilityZipCode": "39183",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28149",
  "LEPC": "Warren County LEPC",
  "FacilityLatDecDegs": "32.387817",
  "FacilityLongDecDegs": "-90.909119",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": "www.ergon.com",
  "FacilityEmailAddress": "Jake.Neihaus@ergon.com",
  "FacilityDUNS": 98595317,
  "ParentCompanyName": "Ergon Inc",
  "Company2Name": null,
  "CompanyDUNS": 87023743,
  "Company2DUNS": 0,
  "OperatorName": "Jeremy Kyser",
  "OperatorStr1": "2125 Haining Road",
  "OperatorStr2": null,
  "OperatorCity": "Vicksburg",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39183",
  "OperatorZipCodeExt": "9069",
  "RMPContact": "Rakshana Rajarathinam",
  "RMPTitle": "Process Safety Engineer",
  "FTE": 205,
  "OtherEPAFacilityID": "110000376575",
  "EPAFacilityID": "100000208544",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2780-00003",
  "SafetyInspectionDate": "2008-04-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-08-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-08-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-08-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000073049,
      "AltID": "Propane Deasphalting Unit",
      "FacilityID": 1000058481,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000074231,
          "ProcessID": 1000073049,
          "NAICSCode": "32411",
          "_desc": {
            "NAICS_CODE": "32411",
            "NAICS_DESCRIPTION": "Petroleum Refineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000090177,
          "ProcessID": 1000073049,
          "ChemicalID": 98,
          "Quantity": 612000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000590177,
          "ProcessID": 1000073049,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000058481,
      "SummaryText": "Ergon Refining Incorporated  Vicksburg, MS Refinery:  RMP Executive Summary\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nErgon Refining Incorporated is committed to operate the Vicksburg Refinery in a manner that does not endanger our employees, the environment or the surrounding community.  This commitment is demonstrated by an accidental release prevention program that covers areas such as the design of new systems, installation of equipment, operating procedures, maintenance, and employee training associated with the processes at the refinery.  It is the company policy to implement reasonable controls to prevent the foreseeable releases of regulated chemicals.  However, in the event that an accidental release occurs, an emergency response plan that designates the roles of individuals has been established to mitigate the impact of the release within practical limits.  \n\n\n\nThe Stationary Source and Regulated Substances\n\n\n\nThe Ergon Refining Incorporated refinery in Vicksburg, MS processes heavy naphthenic crude oil at a production rate of approximately 22,000 barrels per day. The products produced include a small stream of naphtha, ultra-low sulfur diesel, various hydro-treated naphthenic lube oils, and asphalt. The Vicksburg refinery will handle one regulated chemical (propane) in quantities that will exceed the threshold for which Risk Management Planning (RMP) is required with the implementation of the Propane De-asphalting (PDA) Unit. The Vicksburg facility is subject to Program 3 requirements of the RMP standards due to (1) being subject to Process Safety Management (PSM) standard for propane, (2) having the potential of causing offsite consequences, and (3) the facility's standard industrial classification (SIC) code (2911).  \n\n\n\nWorst-Case Release Scenario(s) and the Alternative Release Scenario(s)\n\n\n\nFor program level 3 processes, one worst case flammable release scenario and one alternate case flammable release scenario was reported "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000058481,
      "SummaryText": "in the RMP. The United States Environmental Protection Agency's (EPA's) Offsite Consequence Analysis Guidance document and RMPComp were used to assess consequence distances for both the worst-case and alternate scenarios.  Both scenarios submitted are in the Propane De-asphalting (PDA) Unit at the Vicksburg facility. Details of these submitted release scenarios are included in the RMP submittal information and refinery files.\n\n\n\nGeneral Accidental Release Prevention Program Steps\n\n\n\nThe Ergon Refining Incorporated refinery is regulated by the EPA RMP regulations as well as, OSHA PSM regulations.  The following summary addresses the necessary steps taken to comply with these regulations.\n\n\n\n\n\n\n\nProcess Safety Information\n\n\n\nErgon Refining Incorporated (ERI) has managed a Process Safety Information (PSI) program to comply with OSHAA's PSM Standard, 29 CFR 1910.119 (d) (1-3).  ERI recognizes the value of the good engineering and management principles promoted by these regulations and has chosen to the elements of the PSI Program to units and areas of the refinery that are not covered by PSM. With the addition of the Propane Deasphalting Unit that will lead to the threshold quantity of propane on site, the PSI program will also comply with the EPA's RMP Standard, 40 CFR 68.65 (a-d).  \n\n\n\nComplete and accurate written information concerning process chemistry, process technology, and process equipment is essential to an effective PSM Program and to a process hazard analysis (PHA).  The information addressed by this program is an essential resource for conducting the PHA, employee training, contractor safety, mechanical integrity, procedures, pre-startup safety reviews, management of change, emergency preparedness, and insurance and compliance audits.  Access to PSI information is provided to all employees through ERI's computerized document control system.\n\n\n\nPSI information and documents are required for all regulatory covered process units.  It is important to recognize"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000058481,
      "SummaryText": " that information is generated throughout the life cycle of a process unit and as such, PSI information is often updated through the MOC or PHA revalidation procedures.  Chemical specific information, including exposure hazards, emergency response and exposure treatment is provided in safety data sheets (SDSs).  These documents are available to all employees via a computerized SDS Management System and in hardcopy at the Refinery and Terminal locations.\n\n\n\nProcess Hazard Analysis\n\n\n\nThe refinery processes that contain quantities of regulated substances above threshold quantities are evaluated for potential hazards using the hazop method supplemented by checklists and what-if lists as necessary.  The evaluations are conducted by a team consisting on personnel familiar with the evaluation methods, refinery operations, maintenance, safety, training, and environmental compliance.  PHA documentation is maintained for the life of the process unit. Each process is revalidated every 5 years or sooner if significant modifications to the process deem the PHA necessary.  Findings and recommendations resulting from a hazop evaluation are addressed in a timely manner.\n\n\n\nOperating Procedures\n\n\n\nWritten operating procedures were developed and are maintained for all processes at the Vicksburg facility.  These procedures address modes of operations such as initial startup, normal operation, temporary operation, emergency shutdown and operation, normal shutdown and startup after a turnaround.  The procedures are reviewed based on a predetermined cycle and certified as accurate and timely by knowledgeable and experienced operations staff members.\n\n\n\nTraining\n\n\n\nErgon Refining Incorporated implements a comprehensive training program for newly hired operation and maintenance employees.  After being hired, new employees under go classroom, hands-on and on-the-job training as defined by their position requirements to reach a qualified status.  Employees that are members of the emergency "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000058481,
      "SummaryText": "response team participate in annual training and drills.  Refresher training is required at least every three years and more frequently if necessary.  All other employees are trained in accordance with the requirements of their job position using various training methods.  All training is documented, including the means used to verify that the employee understood the training.\n\n\n\nMechanical Integrity\n\n\n\nErgon Refining, Inc. is committed to the safe operation of its facility.  In support of this commitment, Ergon Refining, Inc. has in place a Mechanical Integrity (MI) program.  The MI program is a management system that will sustain the long-term reliability of the Refinery's equipment.  Written procedures, training, programs for conducting equipment inspections and test, preventive maintenance program, plans for addressing equipment deficiencies, and quality assurance requirements combine to form the management system.  Process equipment included in the program includes; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, fired heaters, compressors, emergency response equipment, secondary containment devices, interlocks, fire protection systems, personal safety equipment, programmable logic controllers (PLC's), Distributed Control System (DCS), and pumps.\n\n\n\nManagement of Change\n\n\n\nErgon Refining Incorporated has a written procedure in place to manage changes in process chemicals, equipment, technology, procedures, and other facility changes to ensure that the proper review and evaluation is conducted before being implemented.  Changes are reviewed to ensure proper controls are in place to manage any new hazards and verify that existing controls are still adequate.  The process safety information associated with the change is updated as necessary.  \n\n\n\nPre-Startup Safety Reviews\n\n\n\nErgon Refining Incorporated has a written procedure in place to ensure that a review is conducted on any changes or modifications made to"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000058481,
      "SummaryText": " a process prior to initial startup.  The PSSR is designed to check safety controls, procedures, training, design specifications, and installation prior to startup.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR requires field verification of the construction and installation and serves a quality assurance function.\n\n\n\nCompliance Audits\n\n\n\nErgon Refining Incorporated conducts audits to determine the effectiveness of the procedures and practices of the accident prevention program.  Compliance audits are conducted every 3 years.  The audit team includes personnel and/or contractors familiar with the regulations and audit techniques.  The findings and recommendations developed from the audits are resolved in a timely manner.  The last two most recent audit reports are retained.\n\n\n\nIncident Investigation\n\n\n\nErgon Refining Incorporated promptly investigates any incident that resulted in or could have reasonably resulted in the catastrophic release of a regulated substance.  Investigations are conducted to identify the causes of the incident as well as corrective actions to prevent future reoccurrence of the incident.  Findings and recommendations are addressed in a timely manner.  All incident reports are retained for 5 years.\n\n\n\nEmployee Participation\n\n\n\nErgon Refining Incorporated recognizes the valuable knowledge base that experienced employees can contribute to the safe and efficient operation of the processing units.  Employee input is important to the management of the various elements covered in the process safety management system.  Operating and Maintenance employees with working knowledge of the process units and equipment are consulted for input into process hazard analysis, management of change review, mechanical integrity assurance, and pre-startup reviews.  Operating and Maintenance employees participate in the development and updating of procedures and training materials. Operating and Maintenance employees also participa"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000058481,
      "SummaryText": "te in the periodic review of procedures and training materials to maintain the accuracy of these documents.  Employees are kept current to the changes within their work area through training, management of changes, pre-startup safety reviews, process hazard analyses, changes in process technology, equipment, emergency procedures, safety procedures, and any other conditions, which could affect their work environment.  This is conducted through the use of training materials, employee meetings, face-to-face communication, and materials available in the facility's computer system.  \n\n\n\nContractors\n\n\n\nErgon Refining Incorporated uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  Prior to selecting a contractor, an evaluation is conducted on the past safety performance and current safety program of the contractor.  In addition, refinery safety personnel periodically monitor the onsite safety performance of contractors to ensure they are performing their safety obligations.    Contractors are required to complete a site-specific orientation for the refinery prior to starting work.  This orientation includes information regarding site specific hazards and refinery emergency response procedures.\n\n\n\nFive-Year Accident History\n\n\n\nThere have been no accidents since unit startup in 2009 to the current date.\n\n\n\nEmergency Response Plan\n\n\n\nErgon Refining Incorporated maintains a written comprehensive emergency response plan to respond to accidental releases of hazardous substances.  The plan includes the information necessary to respond to emergency situations including first aid, medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  To ensure readiness, emergency response equipment is regularly inspected and serviced.  The plan is reviewed at least annually and updated in a timely manner as necessary.  This plan is "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000058481,
      "SummaryText": "incorporated into the Warren County Emergency Operations Plan as part of the Warren County LEPC.\n\n\n\nSafe Work Practices\n\n\n\nErgon Refining Incorporated maintains critical safe work policies, programs and procedures.  These include but are not limited to the following: hazard communication, process safety management, control of entry and access, lockout/tagout, confined space, hot work, PPE and respiratory protection.   Safety policies, programs and procedures are evergreen documents and are subject to review and modifications as regulations and circumstances change.  Any changes to safety policies, programs or procedures are documented and distributed in accordance with Ergon Refining's quality management system.\n\n\n\nClosing\n\n\n\nThe RMP for the Ergon Refining, Incorporated Vicksburg facility has been completed in accordance with all 40 CFR 68 requirements. This resubmission for certification of RMP is the second 5-year resubmittal for the  Propane De-asphalting (PDA) Unit at the Vicksburg facility since it began operation in August 2009. \n\n"
    }
  ]
}