{
  "FacilityID": 1000008928,
  "FacilityName": "Exel Inc., Stockton Refrigerated (Kraft Foods)",
  "FacilityStr1": "3735 Imperial Way",
  "FacilityStr2": null,
  "FacilityCity": "Stockton",
  "FacilityState": "CA",
  "FacilityZipCode": "95215",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.545840",
  "FacilityLongDecDegs": "-121.130690",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.exel.com",
  "FacilityEmailAddress": "bchilcote@kraft.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Exel Inc.",
  "OperatorStr1": "3735 Imperial Way",
  "OperatorStr2": null,
  "OperatorCity": "Stockton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95215",
  "OperatorZipCodeExt": null,
  "FTE": 92,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000187291",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-01-31 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-07-12 00:00:00",
  "DeRegistrationEffectiveDate": "2017-07-07 00:00:00",
  "AnniversaryDate": "2014-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.90937,
  "FRS_Long": -121.2178,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "104",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010427,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000008928,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011904,
          "ProcessID": 1000010427,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000010789,
          "ProcessID": 1000010427,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000008550,
              "Process_NAICS_ID": 1000010789,
              "SafetyReviewDate": "2007-06-07 00:00:00",
              "PHA_Date": "2009-12-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-09-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-04-16 00:00:00",
              "TrainingReviewDate": "2007-08-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Online Refresher Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": "Online training",
              "MaintenanceReviewDate": "2009-04-06 00:00:00",
              "EquipmentInspectionDate": "2009-06-12 00:00:00",
              "EquipmentTested": "Ammonia Sensor Calibration",
              "ChangeMgmtDate": "2008-04-18 00:00:00",
              "ChangeMgmtReviewDate": "2007-08-17 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2007-08-01 00:00:00",
              "AuditCompletionDate": "2009-06-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-08-17 00:00:00",
              "HotWorkPermitReviewDate": "2007-08-21 00:00:00",
              "ContractorSafetyReviewDate": "2007-02-15 00:00:00",
              "ContractorSafetyEvalDate": "2007-08-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000009908,
                  "PreventionProgram3ID": 1000008550,
                  "ProcessChemicalID": 1000011904
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000008928,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Office of Emergency Services",
    "CoordinatingAgencyPhone": "2094683969",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000008928,
      "SummaryText": "that it can absorb heat.  The expansion valves also regulate refrigerant flow through the cycle.  Standard expansion valves act as the barrier between the high and low pressure parts of the refrigeration cycle. \n\nd) High Pressure Receivers\nThese receive and store ammonia in its liquid form.  These pressure rated vessels are designed, built, and inspected according to ASME (American Society of Mechanical Engineers) standards.  The receivers have the capacity to temporarily store a majority of the ammonia used in the system.  Periodically, the receivers are used to store ammonia to allow maintenance or inspection of other system components.  After passing through the ammonia receivers, ammonia liquid flows to the expansion control valves for each chiller.\n\nE) Recirculators\nThese vessels, with ammonia pumps, supply liquid ammonia to the air handlers and receive the return suction for passage to the screw compressors.\n\nF)Oil Pot Draining\nOil pots on the large recirculators are used to collect any oil accumulation.  This excess oil is drained as part of the routine periodic maintenance of the system.\n\nG) Ammonia Charging\nAmmonia is charged into the system through a charging valve located on the receiver vessel.\n\nH) Air Handlers\nThese fan units operate in the cool rooms and freezer.  They are mounted near the ceiling and provide cooling by blowing air across cold, low pressure ammonia lines from the recirculators.\n\nI) Auto-Purger\nThis device separates air and non-condensable gases from the ammonia, dilutes them with water, and disposes of them\n\n2.  Detection, Monitoring, Automatic Control Systems, and Procedures\nExel, Inc. ammonia refrigeration facility is a state-of-the-art design with highly sophisticated monitoring and control capabilities.  Every part of the design and operation of the facility is geared to prevent accidents and to safely contain ammonia within the system.  This is accomplished through the use of design features that provide automatic system shutdown"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000008928,
      "SummaryText": "ly detected. \n\nThe operator also conducts periodic inspections of the system to visually inspect primary system components, record critical process parameters, and note any abnormal conditions in the facility (leaks, excessive equipment vibration, etc.). These walkdowns are performed at least once every 24 hours.   \n\nBecause of the fully automatic nature of the system, the elaborate alarm system, and the limited need for operator involvement in the normal operation of an ammonia refrigeration system, there is no need for an operator to be present continuously in the ammonia refrigeration building.  For this reason, Exel, Inc.' standardized design for its ammonia refrigeration facilities includes a computer-based system that continuously monitors important system parameters and checks the status of the ammonia sensing system.  In the event that a critical process parameter deviates from normal range or a leak detector reaches an alarm setpoint, personnel at the remote monitoring location are alerted to take necessary corrective action.  The remote monitoring station for Stockton's refrigeration facility is installed in a central monitoring area in the Maintenance Department.  Security personnel can provide a secondary level of notification to contact appropriate Exel, Inc. individuals to respond to an incident.  \n \n\nExel, Inc. Preliminary Safety Review\n\nOnce the project scope has been defined, a Preliminary Safety Review is performed in order to obtain corporate approval.  The review may take several sessions.  The Preliminary Review examines the technical concept of the project, establishes the written process safety information that must be compiled, and assembles as much of this information as is available.  Information not available at the time of the Preliminary Review is identified and included as soon as it becomes available.  The results of the Preliminary Review address the following points: \n\n     1) Examination of the technical concept of the project:"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000008928,
      "SummaryText": "raction.  The system functions as a closed recirculating loop.  The operators perform system inspections, maintenance activities, and periodic testing of components.  The following controls have been incorporated into the standard operating procedures that apply to the Stockton site:\n\nOperating procedures for the system are available in writing, in an easily followed format. \nThe procedures include directions for system startup, shutdown, interruptions, and emergency situations.  There also is a written emergency evacuation procedure and equipment lockout/tagout procedure. \nMechanisms are in place to ensure operating procedures, Piping and Instrumentation Drawings (P&IDs), and equipment, instrumentation and piping inspection lists are kept up to date. \nOperating personnel have trained in system startup, shut down, troubleshooting and emergencies. \nA control room walkdown has been performed to verify operating procedures are accessible to operators for reference. \nProvisions are in place to have supervisory personnel check on operators on a regular basis. \nDelivery of ammonia will be required to initially charge the addition to the refrigeration system.  Also, in the future, it will be necessary to recharge (replacing only a portion of the charge) the refrigeration system with ammonia, similar to the recharging of an automobile air conditioner.  It is estimated from past experience that the system may need to be done every 2-3 years. \nFor the initial charge, or when a recharge is necessary, ammonia will be delivered to the facility by a certified vendor using a bulk storage tank truck.  These trucks are certified for safety by the Department of Transportation.  Some of their required key features include the following: \nFlexible charging line suitable for use with ammonia. \nA series of valves on the unloading pipe of the tank that will facilitate a controlled flow of ammonia and provide safety features to minimize the chance of a spill and mitigate a spill if one d"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000008928,
      "SummaryText": "connected devices.  This program was established to prevent injuries to employees and to prevent a release of hazardous chemicals to the environment.\n \nG.  Inspection Procedures and Schedules\n\nExel, Inc. utilizes inspection procedures and schedules that have been developed by the International Institute of Ammonia Refrigeration.   Representative copies of these are included in Table G - Other Technical Data.\n\nH.  Maintenance Procedures and Schedules\nDuring operation, inspections and monitoring of critical system parameters are performed routinely.  Preventive maintenance procedures are carried out by maintenance staff and supervisors on a regular schedule to ensure that all components are in their best possible condition.  Any deviations from normal operating parameters are observed and corrected. \n\nExel, Inc.' maintenance programs for ammonia refrigeration facilities in use at its other sites have been adopted for the Stockton ammonia refrigeration.  These maintenance programs ensure that ammonia equipment is maintained in optimum working condition and that the facility is operated in a safe manner. Table 4-3 (pages 34-35) presents an outline of some of the maintenance and inspection programs for some typical ammonia refrigeration facility equipment used by Exel, Inc., and notes responsibilities for activities.\n\nI.  Operational Inspections and Maintenance\n\nUninsulated Piping\n\nAnnually, all uninsulated piping and associated components such as flanges and supports should be inspected for any damage to or deterioration if the piping or its protective finish and remedial action taken where necessary.  Areas affected by slight corrosion should be cleaned off and appropriately treated before reinstating the protective finish.  Deeper pitting or loss of metal, where considered by subjective assessment to be greater than 10% of original wall thickness, should be checked accurately by using techniques such as ultrasonic measurements.  If such wall thinning is confirmed it"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000008928,
      "SummaryText": "is recommended that expert advice is sought, for example from an authorized inspection agency, to determine the need for and extent and timing of any replacements.\n\nInsulated Piping\n\nAny mechanical damage to insulation should be repaired immediately and the vapor seal reinstated to prevent access of water or water vapor which will lead to breakdown of insulation and corrosion of the pipework.\n\nAt least as part of the annual piping inspection, but preferably more frequently, the external condition of the insulation and supports should be inspected. \n\n\n5.  HAZARD AND OPERABILITY STUDY (HAZOP)\nA Hazard and Operability Study was completed in conjunction with the preparation of the Process Safety Management Manual for this facility.\nA.  Team\nThe study was performed by Kurt Liebendorfer and John Miller, consulting engineers from the Haskell Company, and Bob Chilcote, the Refrigeration Manager of this facility.\nB.  Methodology\nThe HAZOP was completed as part of the development of the Process Safety Management Manual for this facility.  \n\nAs required by the federal Occupational Health and Safety Administration (29 CFR Part 1910, February 24, 1992), a process safety management program has been established at this location to properly identify, evaluate and prevent chemical releases that could occur as a result of failure in process, procedures, or equipment.\n\nThe program is designed to provide reasonable assurance that operation hazards are identified, that significant operational safety incidents are avoided, that operational safety requirements are considered in evaluating business decisions and that unacceptable risks to persons, property, products, and the environment are avoided.\n\nThe process includes all phases of plant operations including conceptualization, design, construction, operation, maintenance, and decommissioning.\n\nREQUIREMENTS:\n\nEmployee Participation - Develop written plan of action on employee participation; consult with employees and their representative"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000008928,
      "SummaryText": "icable codes and good engineering practice, to provide reasonable assurance that the mechanical integrity of critical process equipment is maintained.  All equipment deficiencies are corrected before further use, or appropriate steps are taken in a timely manner to assure safe operation.\n\nContractors - Applies to contractors involved in maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to a covered process.  Consideration is given to a contractorÂ¿s safety programs and performance prior to being awarded work on or near covered processes.  Contractors are informed of potential hazards, facility Plant Emergency Organization (PEO) plan, safe work practices in process areas, and their responsibility to maintain an injury/illness log.  Contractors are responsible for training their employees in safe work practices, documenting that training, and assuring that their employees know about potential process hazards (i.e. facility PEO and safety rules).  Contractors must also advise the site employer of hazards the contract work poses or hazards identified by contract employees.\n\nManagement of Change - A written procedure to manage changes to process chemicals, technology equipment, and procedures or changes to facilities that affect highly hazardous chemicals must be in place prior to implementation of the change, the impact of the change on safety and health, the modification to current operating procedures, time period for the change, and the authorization requirements for the change.  All the employees affected by the change are informed of and trained in the chance prior to start-up.\n\nPre-Start Up Safety Review - New facilities and modified sites of covered process perform a safety review prior to start up to insure that construction and equipment is in accordance with design specifications, all operating procedures are in place, and necessary employee training is complete.\n\nProcess Safety Information - Written information has been com"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000008928,
      "SummaryText": "piled for process involving highly hazardous chemicals to allow for a thorough process hazard analysis and the completion of other loss prevention activity.  This includes information on chemical hazards, process technology and equipment, design and operation specs.\n\nProcess Hazard Analysis - Processes have been assessed to identify, evaluate, and control potential hazards.  PHAÂ¿s have addressed the hazards of the process, previous hazardous incidents engineering and administrative controls, consequences of failures of engineering and administrative controls, human factors and evaluation of efforts of failure of controls on employees.\n\nCompliance Audit - Audits are conducted at least every three years, and are conducted in appropriate intervals to ensure and asses the programs implementation and effectiveness.  A report of the findings of the audit should determine and document that the deficiencies have been resolved or corrected.  The two most recent audits must be retained.\n\nK.  \tRisk Ranking\nDue to the inherent safety design of the system, redundant controls, and sophisticated computer monitoring system, all risks are deemed to be extremely low.  However, since the RMP requires risk ranking, following is our analysis of the risks found during the Process Hazards Analysis.\n\nL.  Training for RMP\n\n1.  GOALS AND OBJECTIVES\nTraining of plant personnel is a key element in the overall safety of the facility because it ensures that personnel involved in system operation and maintenance are knowledgeable about job safety, hazardous material use, and necessary actions to take in the event of an accident or emergency.  Training programs focus on system operation, maintenance, and emergency response as they relate to material and worker safety.  Training programs ensure that workers are qualified to perform tasks responsibly, to diagnose routine and emergency situations, and to take necessary corrective actions including terminating or mitigating events to the extent possi"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000008928,
      "SummaryText": "ons, maintenance and safety departments.  The project engineer also is responsible for providing hands on system operator training for all new or revised systems. \n\nOperators are given refresher training on a variety of subjects including emergency response and plant safety.  In addition, they are encouraged to attend seminars and outside training sessions that can enhance their knowledge of system operations.\n\nb)  Maintenance Personnel Training\nOnly trained refrigeration mechanics, electricians, instrument technicians, and other maintenance personnel are allowed to work on the ammonia refrigeration system.  Like operators, they are given formal training per the applicable sections of the OSHA general industry training requirements.  Maintenance personnel are trained in all of the procedures that are necessary to safely perform their work.  Operators and maintenance personnel receive training in Standard Operating Procedures, including procedures for Emergency Shutdown, Building Sump Monitoring/Pumpout, Equipment Maintenance Procedures, including procedures for Ammonia Charging, and Pumpout System Operation; and procedures for Emergency Response, Lockout/Tagout, Line Breaking/Draining, Water Treatment Control, and Ammonia Sensing Safety Equipment Checkout. \n\nc)  Emergency Response Training\nExel, Inc.' Stockton site has a trained Emergency Response Team (ERT) which has received specific training in the management of chemical spills.  The capabilities of this Emergency Response Team were discussed during a meeting with the County of San Joaquin on May 11, 1995.  The Exel, Inc. ERT has demonstrated an ability to effectively evacuate buildings, to account for personnel, to treat medical casualties, to assist in spill containment, and to effectively utilize necessary communication procedures. \n\nExel, Inc. is committed to further improving emergency response coordination with the City of Stockton and will conduct annual exercises with the County of San Joaquin Response"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000008928,
      "SummaryText": "ive actions that should be taken.  Administrative controls will be in place to ensure that actions resulting from audits are implemented in a timely manner.  The audit reports, as well as all RMP documentation, will be available for Administering Agency review. \n\nExel, Inc. has assembled an RMP audit team under the lead of its Refrigeration Manager.  This team includes personnel from the operations, maintenance, and site safety departments.  As appropriate, Exel, Inc. uses corporate safety personnel, consultants, or individuals from other Exel, Inc. ammonia refrigeration facilities to participate in the audit and provide a level of independence to the reviews.  The team reports its findings to the Facility Manager, who reviews all findings and ensures that recommendations are implemented. \n\nIt is the responsibility of the Facility Manager to ensure compliance with federal, state and local safety requirements and to ensure that any problems identified through internal audits are corrected within a reasonable time frame.  The various elements of the audit are outlined below. \n\n1.  Elements of the Audit\n\nThe RMP audit is carried out using a series of checklists developed by the audit team prior to the audit.  The following provides examples of the types of information that will be included in the audits.\n\nFacility Inspection - Review of ammonia refrigeration facility layout to\nensure emergency access, proper component labeling, operation of\nalarms, proper set points for automatic controls, availability of safety\nequipment including fire extinguishers, SCBAs, etc. \n\nSystem Review - Review of system modifications, verification of\nMaterial Safety Data Sheets, P&ID review, etc. \n\nReview Preventive Maintenance Procedures - Audit of plant and\nmaintenance records for compliance with maintenance procedures.\nThis review covers all equipment from the ammonia vessels,\npipework and relief valves to fire extinguishers, safety showers and\neyewash stations. \n\nOperating Procedures Rev"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 1000008928,
      "SummaryText": "iew - Ensure that procedures are up to\ndate and are being properly used.  Selected procedures are\nreviewed for such items as technical correctness, ease with which\nthey can be followed, and overall completeness. \n\nPersonnel Interviews - Interviews with operations and maintenance personnel to determine any concerns about maintenance programs, quality control, safety, and training. \n\nIn addition to the Exel, Inc. internal audits, the facility may also be inspected by the Kraft Foods Safety and/or Quality Assurance personnel as well as the RMP Administering Agency (County of San Joaquin).  Typically, these audits would involve the same review items that are covered by the internal audit described above.\n\nG.   Hazardous Materials Business Plan\nExel, Inc.Â¿ Stockton Hazardous Materials Business Plan outlines the necessary actions to be taken in the event of an emergency.\n\nThe risks posed by the ammonia refrigeration facility are considered very low, since more than 90 percent of the ammonia in the refrigeration system has secondary containment in the building.  However, the use of any acutely hazardous material dictates a need and a responsibility to make both workers and the surrounding community aware of those risks, and to provide an understanding of the precautions that should be taken in the extremely unlikely situation the community were to be impacted. \n\nIn the development of the revised Site Hazardous Materials Business Plan, Exel, Inc. will work with the County of San Joaquin and the City of Stockton to coordinate the various elements of emergency response and to define protocols for communication, organization, emergency response actions, and responsibilities.  In addition, Exel, Inc. is developing a program for risk communication with members of the community in close proximity to the site. \n\nIt should be noted that the evaluation of potential hazards that was conducted as part of the Hazard and Operability (HAZOP) study and the Offsite Consequence Analysis (O"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008928,
      "SummaryText": "a refrigeration facilities.  In addition to not having any ammonia accidents as defined by the California Health and Safety Code, there were also no releases of ammonia in the past three years which exceeded the 100 pounds/24 hour release repeatability threshold required by federal reporting guidelines (SARA Title lll).\n\nSYSTEM DESCRIPTION (Anhydrous Ammonia System)\nAnhydrous Ammonia is the chemical used in the refrigeration system in this facility.  Refrigeration systems of this type are the most widely used in the world, primarily due to their reliability, safety and cost.  These systems are inherently safe and are designed and installed with automatic, computer-controlled monitoring systems to both indicate necessary maintenance procedures and sound the alarm in case of accident.  Ammonia is a lighter-than-air gas at atmospheric pressure and temperature and would rise quickly and disperse if released into the environment.  The primary hazard associated with ammonia is acute toxicity when inhaled or ingested. Ammonia also poses a hazard when coming into contact with the skin.\n\nPRINCIPLES OF AMMONIA REFRIGERATION\nRefrigeration is a general term used to describe the cooling of a space or substance to a temperature below the ambient temperature.  Mechanical refrigeration is an application of thermodynamics wherein a cooling medium, or refrigerant, goes through a sequence of phase changes, the net effect of which is to absorb heat from one location and transfer it to another.  This process occurs in a closed cycle so that the refrigerant is recycled.  In the Exel, Inc. facility at the Stockton site, ammonia is the refrigerant.  In the ammonia refrigeration cycle, liquid ammonia expands, absorbs heat from the surroundings, ammonia vapor is compressed, condensed to a liquid, and then expanded.  As it expands, ammonia liquid changes back to vapor and absorbs heat from its surroundings, thereby providing refrigeration.  After absorbing heat, the vapor is compressed ag"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000008928,
      "SummaryText": "ain, repeating the cycle. \n\nCHOICE OF REFRIGERANTS\nProvides a comparison of some of the most commonly used refrigerants.  Until the early 1980s, CFCs and HCFCs were the most commonly used refrigerants.  These substances, however, have been demonstrated to have ozone-depleting properties and high global warming potential, thus posing a long-term danger to the environment and possible health risks.  Substances such as propane, butane, ethane, and ethylene can also be used as refrigerants, but when mixed with air, these substances are highly flammable and explosive. Therefore, they pose a significant risk to workers and the community. \n\nAmmonia is one of several available refrigerants not in either of these problematic groups, and has been used in refrigeration applications for more than 100 years. \n\nMost larger industrial systems rely on ammonia as a refrigerant.  Ammonia was chosen as the at the Exel, Inc. Stockton site for many of the same reasons it has been selected by other manufacturers:\n\n     1. Ammonia is a highly efficient refrigerant.\n     2. Ammonia does not have any ozone depletion potential.\n     3. Ammonia does not have any global warming potential. \n     4. Although ammonia, like several other refrigerants, has toxic properties, it\n          has many advantages over other refrigerants in terms of worker and \n          community safety:\n \nAmmonia is easily detected by smell in concentrations well below levels that could be harmful. \nAmmonia gas is lighter than air and will rise and disperse into the atmosphere if released.  \nAmmonia has a high affinity for absorption in water.  This increases the effectiveness of emergency response actions.\n\nExel, Inc. has extensive operating experience with ammonia and a proven safety record.  The company's standardized ammonia refrigeration design includes selected equipment for use in the system (inside the refrigeration building), which provides the primary containment for the ammonia, including components such as ro"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000008928,
      "SummaryText": "tary screw compressors utilizing thermosyphon oil cooling.\n\n**Equipment and Operation\nThe ammonia refrigeration facility in Stockton is based on a standardized, risk-preventing design that is currently in operation at other Exel, Inc. facilities. \n\nThe ammonia refrigeration facility at the Stockton site is new or recent construction, built to meet, and in many instances exceed, industry standards such as IIAR-2 and ASHRAE-15 (see Glossary), and other documents including the most recent Stockton Uniform Building Code (UBC), Uniform Fire Code (UFC) Article 63, and the Uniform Physical Code (UMC) Chapter 15.  The systems also meet the proposed revisions to the UMC and UFC.  These revisions to codes are supported by all the Northern and Southern Fire Prevention Officers (FPO) Code Committees of the California Fire Chiefs Association (CFCA).  All equipment, including piping, vessels, valves, instrumentation, and controls  are state-of the-art engineering design and construction.  The equipment is subject to inspections during construction and installation to ensure compliance with design and construction standards. \n\n Wherever possible, ammonia piping connections are of welded construction. Welded construction provides the strongest, most leak-proof type of piping connection.  Flanged and possibly screwed connections are used for specialty equipment that cannot be welded, such as system relief valves.\n\nThe equipment for the refrigeration system is located in one of three areas; the Engine Room, the facility cool rooms and freezer room, or mounted on the building roof-top.\n\na)Screw Compressors\nThese transform cold, low pressure ammonia gas into hot, high pressure gas. This transformation is accomplished using single-stage screw compressors.\n\nb)Condensers\nThese transform hot, high pressure ammonia gas into hot, high pressure liquid\n. \nc) Expansion Valves\nThese allow liquid ammonia to expand from high pressure to low pressure.  This causes the ammonia temperature to drop so"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000008928,
      "SummaryText": "if critical parameters are beyond the normal operating conditions, local as well as remote monitoring of system operation, and numerous system controls and interlocks that alert the operator of any problems and enable the operator to shut the system down if necessary. \n\nFor example, one unique accident prevention feature inherent in the Exel, Inc. ammonia refrigeration facility is that very little human interaction is required.  The refrigeration process involves recirculation of ammonia and, other than periodic system monitoring, there is virtually no need for operator involvement in the normal operation of the system, thus reducing potential risk of human error. \n\nIn the unlikely event that a problem occurs that results in release of ammonia from the refrigeration system, a sophisticated ammonia detection system located throughout the ammonia refrigeration facility will sense the presence of ammonia, provide an audible alarm, and initiate safety systems and system shutdown if required.\n\nAMMONIA LEAK DETECTION SYSTEM AND REFRIGERATION SYSTEM AUTOMATIC CONTROLS \n\nOne of the single most important properties of ammonia from a safety perspective is its strong, pungent odor. Ammonia can be sensed by the human nose in concentrations as low 50 parts per million (ppm) in air. This odor threshold concentration of ammonia is well below the levels that pose a health hazard. Therefore, the odor of ammonia provides an early warning signal that allows people to evacuate contaminated areas and take protective actions long before significant hazards exist. \n\nAdditionally, Exel, Inc.' ammonia refrigeration facility includes a sophisticated ammonia leak detection system that automatically initiates safety systems as well as local and site alarms.  The sensing system will be capable of detecting ammonia at concentrations as low as 250 parts per million.  It is important, however, to assure that the alarms and the responses to them are commensurate with the severity of the problem."
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000008928,
      "SummaryText": "For example, it would not be appropriate to evacuate the site for a small ammonia leak that would not be harmful.  Likewise, large leaks would require a greater level of response and initiation of precautionary actions.  For this reason, the ammonia detection system will have different responses for varying levels of detected ammonia concentration.  These responses will initiate a local alarm at 250 ppm.\n\nIn addition to the automatic controls associated with the ammonia leak sensing system, there will also be automatic controls associated with operation of the refrigeration compressors.  Each of the compressor units is controlled by a microprocessor.  Among its other functions, the microprocessor operates a series of interlocks which, in the event that pre-established critical parameters are exceeded, shut down the compressor.  As an additional safeguard, auxiliary system controls also exist to shut off the compressors if certain critical parameters for auxiliary equipment are exceeded. \n\nAMMONIA REFRIGERATION FACILITY OPERATING PARAMETER MONITORING.\n\nAmmonia Leak Detection System Automatic Controls\nAMMONIA CONCENTRATION (Parts per million - ppm). EQUIPMENT RESPONSE\n250 ppm (in the building) Local flasher/horn alam in Refrigeratin Room is actuated.\n250 ppm (in the building) All of the above.  In addition, refrigeration compressors inside the facility are automatically shut down and their liquid lines isolated.  Additional audibidle building alamrs and flashers are iniated to indicate evacuation.\n\nAs discussed previously, the ammonia refrigeration system is a closed-loop, recirculating process, with little or no need for operator involvement.  Under normal conditions, the operator's primary role is to monitor process instrumentation, providing information regarding process parameters such as pressure and temperature.  Under normal operating conditions, these process parameters do not vary to any significant degree.  Deviations from normal operation are therefore easi"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000008928,
      "SummaryText": "Â¿ overall location and design of equipment and structures\n          Â¿ effects on infrastructure and utilities\n          Â¿ protective measures provided by process control systems\n          Â¿ potential process upsets and their consequences\n          Â¿ personnel exposure scenarios\n\n     2) Compilation of process safety information pertaining to:\n          Â¿ the hazards of the process chemicals\n          Â¿ the process technology\n          Â¿ the process equipment\n          Â¿ overall hazards\n          Â¿ environmental impact\n\n\nExel, Inc. Process Hazards Analysis\n\nDuring the Detailed Engineering Design Phase (development of specifications and system design), Exel, Inc. conducts a Process Hazards Analysis.  This analysis uses a systematic and comprehensive method to ensure that the finished design provides for safe and orderly construction, startup, operation, maintenance, and shutdown of the facility.  This review also includes a follow-up on the open issues identified in the Preliminary Safety Review.  The results of the Process Hazards Analysis address the following points:\n\n     1) Analysis of Process Hazards:\n          Â¿ installation (facility)\n          Â¿ routine operation (process)\n          Â¿ non-routine operation (startup, shutdown, maintenance)\n          Â¿ emergency operation\n\n     2) Follow-up on open issues from previous review(s)\n\nA technique most often used for the Process Hazards Analysis is a Hazard and Operability (HAZOP) Study.  The HAZOP study conducted for this facility is discussed in more detail in Section 5.\n\nExel, Inc. Layout Safety Review\n\nThe Layout Safety Review is also conducted during the Detailed Engineering Design Phase.  This review examines the overall layout of the facility, instrumentation, piping, valves, and equipment in regard to their impact on worker and plant safety, fire protection, ventilation, safe operations, and maintenance.  A checklist is usually used for the Layout Safety Review.  This review also includes"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000008928,
      "SummaryText": "a follow-up on the Preliminary Safety Review and the Process Hazards Analysis to ensure that any safety issues identified have been resolved and any required changes have been incorporated into the design. \n\nExel, Inc. Pre-Startup Review\n\nUpon completion of construction, immediately prior to startup and before the introduction of chemicals or raw materials into the process, we conduct a Pre-Startup Review.  The purpose of this final review is to ensure that all safety items from previous reviews have in fact been incorporated into the actual construction, and that the process and facility can be safely started and operated.  This review also follows up on the results of the Preliminary Safety Review, the Process Hazards Analysis and the Layout Safety Review.  The Pre-startup Safety Review is usually done using a checklist. \n\nAn actual walkthrough inspection of the process facility takes place after the team completes the checklist.  Any problems or exceptions are recorded and a judgment is made by the safety team as to whether a safe startup can take place.  Items identified as impacting a safe startup must be resolved before startup take place.  Startup cannot take place until the safety team concurs that a safe startup (and emergency shutdown, if necessary) can take place.  The project is not closed until all action items have been resolved.  The Pre-startup Safety Review addresses the following points: \n\n     1) Walkthrough inspection of facility\n     2) Establishment of ability to safely start the process\n     3) Establishment of ability to safely shut down the process\n     4) Verification that the process and facility can be safely operated and\n          occupied\n     5) Verification of completeness of training\n     6) Follow-up on open issues from previous reviews\n     7) Review of process safety information\nC. Administrative Operating Control\nOperation of the ammonia refrigeration facility is a straightforward process that requires very little operator inte"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000008928,
      "SummaryText": "oes occur. \nNormal hand valve for controlling flow during charge \nSafety valve which can be closed from a remote location (approximately 15 feet away) \nInternal excess flow check valves, located on the inside of the tank, will work even if pipe valves break or get damaged.  This valve will shut off tank flow in the extremely rare occurrence of a pipe/hose breakage. \nPressure relief valves are located at the top of the truck to relieve excess pressure.  These valves are of a reseating (resealing) type (spring-loaded to close when pressure is relieved), which minimizes any vapor escape.\nTruck drivers are certified and trained in ammonia safety and use, and will be required to remain at the unloading station at all times while unloading takes place. \nAt least two trained Exel, Inc. employees will be present at all times during the charge/recharge process.  Appropriate safety equipment and gear will be readily available and/or worn at all times during this process. The duties of the Exel, Inc. operators include: \n\nClose monitoring of all steps of the transfer process -- connections,pumping, disconnections.\nClose monitoring of critical system parameters -- pressure, temperature, etc. -- during the transfer process.\nEnsuring all procedures pertaining to the transfer process are followed.\n\nE.  Administrative Maintenance Control\nExel, Inc. has developed a computerized Preventive Maintenance tracking system to monitor maintenance activities.  A computer program prompts maintenance personnel to perform Preventive Maintenance procedures as required by equipment manufacturers and Exel, Inc. policies.  Maintenance records indicate a component that requires maintenance and the type of activity required.  Completed tasks are entered into the computer. Preventive Maintenance procedures are updated to reflect any changes required to improve maintenance activities or equipment changes. \n\nMaintenance personnel are trained through a combination of classroom lectures, vendor training,"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000008928,
      "SummaryText": "and on-the job training.  Outside contractors involved in maintenance activities on the refrigeration system are be trained in Exel, Inc. Safety Procedures. \n\nA key element to conducting maintenance activities in a safe manner is the Lockout/Tagout Program which controls potentially hazardous energy. Potentially hazardous energy is defined as any source of electrical, physical, hydraulic, pneumatic, chemical, thermal, or other energy that could cause injury or harm to an individual if unexpectedly released or not handled properly.  This program, originally established to prevent injuries to employees, created procedures to cover the servicing and maintenance of machines and equipment where the unexpected energization, or start-up of equipment, or the unexpected or sudden release of stored energy could cause injury to employees.  The program's objectives are: \n\nTo provide safe working conditions for personnel who will be engaged in repairing, making changes, or performing maintenance on equipment which uses or produces hazardous energy sources. \nTo assure a continued zero energy level during maintenance through the use of approved lockout and/or tagout devices and procedures. \nTo provide for an orderly and effective energy isolation of equipment with minimal disruption to other processes. \nTo ensure reliability and safety when returning equipment to operation. \nTo lock out or tag a system to prevent re-energization until lock or tag is removed.\n\nFor the ammonia system, the program includes the use of a pump-out system in which ammonia is evacuated from sections of the system requiring servicing and pumped to the system receiver. \n\nAnother key element to conducting maintenance activities in a safe manner is the Line Opening Procedure.  This procedure requires review and approvals prior to opening any line containing potentially hazardous materials.  This requirement applies to any part of a transfer system including not only piping but also such items as valves and"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000008928,
      "SummaryText": "s on the conduct and development of process hazard analysis; and provide access to other information pertaining to process safety.\n\nTraining - Appropriate training in applicable tasks and procedures is provided to affected employees to enable them to perform their jobs safely and effectively under a variety of operating conditions.  For new employees, initial training includes verification that employees involved with a covered process have the required knowledge, skill, and abilities to safely perform their duties and responsibilities.  Written documentation of all training is maintained.\n\nIncident Investigation - All process related incidents are reported in accordance with established policies governing actual or near-miss incidents.  The report is reviewed with all affected personnel including contract employees.\n\nHot Work Permit - A hot work and/or other applicable permits are issued for work performed on or near a process involving highly hazardous chemicals.  Documentation addresses fire prevention and that fire protection requirements have been implemented prior to beginning the work operations.  The documentation indicates date(s) and identification of the object to be worked on or near.\n\nEmergency Planning and Response - An Emergency Response Team (ERT) has been selected and trained as part of the Plant Emergency Organization (PEO).  The ERT will respond to releases of hazardous chemicals including small planned releases.\n\nOperating Procedures - Written operating procedures have been developed which provide clear instructions for operating the process safely and communicate to affected employees.  Procedures include steps for each operating phase, operating limits, safety and health considerations, and safety systems.  These procedures are readily accessible to employees and reviewed as often as necessary to assure they are current.\n\nMechanical Integrity - Testing and inspection procedures have been developed and implemented, which are consistent with appl"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000008928,
      "SummaryText": "ble.\n \n2.  TRAINING PROGRAMS\nAll site employees receive basic instructions on the site general emergency response procedures.  This information outlines actions to take in the event of a site emergency, including notifying management or supervisory personnel of an emergency situation, actuating fire and other alarms, and taking protective actions such as evacuating affected buildings or responding to other evacuations. \n\nAll employees who have the potential for exposure to hazardous materials in conjunction with their jobs receive additional training beyond the site General Response Procedure.  The level of additional training is dependent on the type of activities and responsibilities of the individual.  The following discussion outlines the various training programs for ammonia refrigeration facility operators, maintenance personnel, and emergency response team personnel.\n \na)  Ammonia Facility Operator Training\nThe Ammonia refrigeration facility Operator Training Program includes a comprehensive basic training module for new operators, refresher training for existing operators, and specific training programs for new systems and changes to existing systems.  Only persons experienced in refrigeration system operation are considered for open positions. \n\nNew ammonia refrigeration facility operators are given formal training in the applicable portions of the OSHA general industry training requirements.  New operators receive instruction in the applicable Exel, Inc. Standard Operating Procedures (SOPs) and emergency procedures.  Their progress is judged by experienced operators.  As part of on-the job training, new operators work with experienced operators on different shifts to learn, firsthand, system operating techniques. \n\nWhen a new system is introduced or an existing system is modified, the project engineer for the new or modified system is responsible for developing and modifying SOPs.  The new/revised procedures are developed with, and reviewed by, the operati"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000008928,
      "SummaryText": "Teams in order to meet this objective.  The Exel, Inc. Emergency Response Team has been thoroughly trained in the specific emergency procedures associated with the ammonia refrigeration facility.   All emergency response personnel have as a minimum the following training:\n\nHazard Communication Training\nRespirator Training\nHAZWOPER Training\nTraining on the General Operation of the Ammonia Refrigeration System\nFire Extinguisher Training\nEmergency Preparedness Plan Training\nCommunications Training\nOther Personal Protective Equipment Training\nTable-Top and Field Drills as part of Emergency Preparedness Training\n\nThe entire Emergency Response Team reviews the above training requirements during annual refresher training.  This three-day training is conducted by a California-licensed agency.  Training certificates are awarded and placed in each employeeÂ¿s personnel file.\nd) Other Relevant Training (CIT)\nExel, Inc. is committed to CIT (Continuous Improvement Teams).  CIT has been implemented corporate-wide in Exel, Inc. for several years.  The key concepts of CIT are:\n\nFocus on the customer\nWe often have external or internal customers - often both.  The ultimate measure of the success of the Continuous Improvement Process is our customerÂ¿s satisfaction with the products, services and information we supply.\n\nAgreements on requirements\nThe key is to reach a mutual agreement on requirements with your customers.  Then, you must meet those requirements the first time, every time.  The agreement means that both the customer and supplier do agree.\n\nContinuous improvement\nOur approach is a never-ending search for improvement.  We need to develop a healthy impatience with the accepted level of hassles, surprises, rework, and deviations.\n\nBroad-based employee involvement\nThe employeeÂ¿s role is vital to our success.  Individuals will participate through their suggestions for improvement, quality improvement teams, and others.  Most importantly, it is oneÂ¿s own actions which will c"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000008928,
      "SummaryText": "ause quality improvement to occur.\n\nView every task as a process\nEvery task includes some form of planning, doing and checking - that is, a process.  Our objective is to simplify and improve this process through better planning.  The result will be a more reliable and efficient Â¿doingÂ¿ step, and a need for much less checking and the elimination of redoing and rechecking.\n\nPrevention - not inspection\nExperience shows that inspection is not totally effective and usually very expensive.  With Continuous Improvement, our focus is on prevention through better planning.\n\nProject-by project approach\nUsually the biggest gains on quality are achieved through the pursuit of specific projects.  Every business, location, and department should develop their own improvement projects.\n\nWe intend to apply CIT to the RMP process by treating RMP as a customer or separate project.\nM.\tInspection Program for RMP\nThe primary purpose of inspections is to ensure that systems are maintained and operating properly.  Exel, Inc. has a multi-tiered inspection program to ensure that systems are operated and maintained properly, in a manner to minimize risk.  This program includes:\n\nRoutine inspections\nConducted by the facility staff.  \n\nPeriodic Safety inspections\nConducted by the corporate safety staff\nAnnual Kraft Inspections\nConducted by the Kraft Foods QA staff\n\nAll inspections are recorded and copies of the reports are filed in the facility administrative office.\n\nF.  Auditing Program for RMP Implementation\n\nThe primary focus of audits is to ensure plant safety through compliance with established procedures and programs.  In accordance with RMP requirements, Exel, Inc. will conduct a comprehensive audit of the programs, procedures and records associated with the generation and maintenance of the ammonia refrigeration system at least once every three years to ensure compliance with all applicable regulations.  Audit reports will highlight the items reviewed, deficiencies noted, and correct"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 1000008928,
      "SummaryText": "CA) (see Sections 5 & 6), determined that a release of ammonia from the refrigeration system, should it occur, would have minimal offsite impacts.\n\nIn the unlikely event that an accident requires actions to mitigate or eliminate a release, a refrigerant control box located outside the facility will allow the fire department or emergency response personnel to relieve the pressure in each ammonia-containing vessel, mix the gaseous NH3 with water, and direct the mixture to the sanitary sewer;\n\nBased on the safety features built into Exel, Inc.' ammonia refrigeration system (described above and throughout the RMP), it is considered highly unlikely that ammonia would be released from the refrigeration building.  In the unlikely event that a release does occur, automatic safety systems in combination with trained emergency response personnel will mitigate the event and protect workers, the community, and the environment.\n\nNotwithstanding the low likelihood of such releases and the significant safety features that would mitigate an event that does occur, Exel, Inc. will take the necessary steps to ensure that all elements of emergency response are developed to address potential releases of ammonia."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008928,
      "SummaryText": "Refrigeration plays an important role at many of Exel, Inc.' distribution facilities across the country as it is necessary for safeguarding the products we handle.  Exel, Inc. Corporate Engineering Department, in conjunction with our design and build partners, has drawn on its experience with our other ammonia refrigeration facilities throughout the United States to develop a standardized design.  At minimum, this design meets and often exceeds all applicable federal, state, and local codes and standards.  At both the corporate and local levels, Exel, Inc. has taken significant steps to ensure safety both for its workers at the site and for the community at large.\n\nIt should be noted that the choice and introduction of ammonia as a refrigerant responds to current federal, state, and local regulations, as well as corporate commitments of  both Kraft Foods and Exel, Inc. to reduce the use of chloro-fluoro-carbon (CFC) and hydro-chloro-fluoro-carbon (HCFC) refrigerants that have been shown to cause ozone depletion and to have a higher global warming potential than ammonia. The City of Stockton restricts the use of CFCs, and the EPA has recently cited ammonia as a recommended refrigerant (EPA Short List of Alternative Refrigerants, EPA-430-F-93 004, February 1993). \n\nConstruction of the addition to the ammonia refrigeration facility in Stockton is complete, with system operation that began in February, 1996.  Exel, Inc. has implemented strict standards in the development and design of the process and both the building itself and the addition, and has overlaid administrative controls for operating, testing, inspecting, and maintaining the facility.\n\nDESCRIPTION OF FACILITY\nThe facility is located at 3735 Imperial Way, Stockton CA.  It is within the Arch Road Industrial Park, just Northeast of the intersection of Arch Road and California Highway 99.\n\nThe Arch Road Industrial Park contains many other facilities of equal and larger size.\n\nIt is a modern, well-equipped, 160,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008928,
      "SummaryText": "000 square foot distribution center for the receipt, storage and shipping of Oscar Mayer and Kraft refrigerated products throughout northern California.\n\nThe overall facility site is an expanding industrial area, with no schools, hospitals or nursing homes within a one mile radius.  \n\nExel, Inc. refrigerated facility has been in operation since May of 1990. Since that time, the facility has not experienced an accident involving ammonia or any AHM outlined in the RMP. \n\nThis facility has not had an accident involving AHM chemicals since we began operation in May 1990.  \n\nAccident prevention is a high priority with Exel, Inc..  Exel, Inc. has corporate-wide goals, and procedures in place, to correct conditions that could lead to an accident.  The company takes numerous steps to prevent accidents and injuries, including the following: \n\nDevelops programs to provide and maintain safe work environments\n\nProvides employee training emphasizing safe work practices and potential on-the-job hazards\n\nPerforms periodic reviews of accident prevention programs and accident data to ensure that safe work practices are being followed\n\nProvides incentive programs to promote safety awareness and interest among employees\n\nAll of these programs and provisions foster employee safety and awareness of potential hazards at each site.  Provisions are also in place for employees to report accidents or conditions that could lead to an accident. Any personnel injury accidents that do occur are reported in accordance with Occupational Safety and Health Administration (OSHA) requirements. \n\nThe California Health and Safety Code requires that an RMP include a description of each accident involving the acutely hazardous material for which the RMP is being prepared that has occurred at the business or facility within the last three years of operation.  The description is to include identification of underlying causes of the accident and the measures taken, if any, to avoid a recurrence of a simila"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008928,
      "SummaryText": "r accident. \n\nDEFINITIONS OF ACCIDENT AND FIVE-YEAR ACCIDENT HISTORY \n\nThe term accident (as it relates to an RMP) is defined in Section 25532 (b) of the California Health and Safety Code.  The Health and Safety Code uses the term accident risk to broaden the definition of accidents to include potential accidents or near misses.  The definition for accident is as follows: \n\n... a potential for the release of an AHM into the environment which could produce a significant likelihood that persons exposed may suffer acute health effects resulting in significant injury or death.\n\nSince the ammonia refrigeration facility at the Stockton site was constructed in 1990, there have been no accidents involving AHM.  As a corporation, Exel, Inc. owns and operates other ammonia refrigeration facilities.  Although not required by the RMP, accident data at these other facilities was reviewed.  This review determined that there were no ammonia-related accidents at any of Exel, Inc. currently owned or operated ammonia refrigeration facilities. \n\nDepending on the specific type of industry or process being evaluated, the definition of accident can vary significantly.  For instance, while the Occupational Safety and Health Administration (OSHA) refers to accidents as incidents that involve worker injury, and does not specifically relate to release of hazardous material, Superfund Amendments and Reauthorization Act of 1986 (SARA) Title lll defines specific federal reporting requirements for releases of hazardous material.  The SARA standards establish chemical-specific criteria for reporting releases based on the quantity of material released over a specified duration.  For example, any release of ammonia that exceeds 100 pounds in 24 hours must be reported under SARA Title lll requirements.  Unlike the OSHA standard, the SARA reporting requirements are independent of worker injury. \n\nThere have been no such accidents at any of the Exel, Inc. currently owned or operated ammoni"
    }
  ]
}