{
  "FacilityID": 1000039037,
  "FacilityName": "The Andersons Denison Ethanol LLC",
  "FacilityStr1": "2404 West Highway 30",
  "FacilityStr2": "P.O. Box 309",
  "FacilityCity": "Denison",
  "FacilityState": "IA",
  "FacilityZipCode": "51442",
  "Facility4DigitZipExt": "0309",
  "FacilityCountyFIPS": "19047",
  "LEPC": "Crawford County LEPC",
  "FacilityLatDecDegs": "41.992100",
  "FacilityLongDecDegs": "-095.394200",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "The Andersons, Inc.",
  "OperatorStr1": "1947 Briarfield Blvd",
  "OperatorStr2": "PO Box 119 (Attn: Safety Dept)",
  "OperatorCity": "Maumee",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43537",
  "OperatorZipCodeExt": null,
  "FTE": 42,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000193024",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-10-29 00:00:00",
  "SafetyInspectionBy": "Ethanol Risk Insurance Solutions (Third Party)",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-10-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-02-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-02-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-02-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.98905,
  "FRS_Long": -95.39912,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000047927,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000039037,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000058256,
          "ProcessID": 1000047927,
          "ChemicalID": 56,
          "Quantity": 97200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000058258,
          "ProcessID": 1000047927,
          "ChemicalID": 155,
          "Quantity": 560000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000050398,
              "ProcessChemicalID": 1000058258,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000050400,
              "ProcessChemicalID": 1000058258,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000050399,
              "ProcessChemicalID": 1000058258,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000048348,
          "ProcessID": 1000047927,
          "NAICSCode": "325193",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000041648,
              "Process_NAICS_ID": 1000048348,
              "SafetyReviewDate": "2012-10-23 00:00:00",
              "PHA_Date": "2015-03-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-05-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-02-10 00:00:00",
              "TrainingReviewDate": "2013-12-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-12-03 00:00:00",
              "EquipmentInspectionDate": "2013-12-03 00:00:00",
              "EquipmentTested": "Visual ammonia pump inspection (completed weekly)",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2013-09-18 00:00:00",
              "PreStartupReviewDate": "2013-09-26 00:00:00",
              "ComplianceAuditDate": "2015-07-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-10-23 00:00:00",
              "HotWorkPermitReviewDate": "2013-10-29 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000049662,
                  "PreventionProgram3ID": 1000041648,
                  "ProcessChemicalID": 1000058258
                },
                {
                  "PrimaryKey": 1000049635,
                  "PreventionProgram3ID": 1000041648,
                  "ProcessChemicalID": 1000058256
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000039037,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-06-09 00:00:00",
    "ERTrainingDate": "2008-11-13 00:00:00",
    "CoordinatingAgencyName": "Crawford 24 - Gregory J. Miller",
    "CoordinatingAgencyPhone": "7122692422",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039037,
      "SummaryText": "Denison Ethanol RMP Executive Summary\r\n\r\nSite and Process Description\r\nThe Andersons Denison Ethanol LLC is located at 2404 West Highway 30 in Denison, Iowa.  The  facility is located in Crawford County. The site is on the north side of Highway 30, across from the intersection of Westcott Road and Highway 30. \r\n\r\nThe Andersons Denison Ethanol LLC facility operates 24 hours a day, 7 days a week with a staff of approximately 38 people.  The following operations are performed at this facility:  grain receiving and storage;  hammer milling;  fermentation;  distillation, dehydration and evaporation (DDE);  separation;  wet and dry distillers grain and solubles (WDGS / DDGS) drying, storage and shipping;  and ethanol storage and shipping.  \r\n\r\nThe plant receives corn by way of the on site grain elevator.  Grain is stored temporarily in the concrete silos, prior to being fed to four hammer mills where the corn is dry-milled into a powder and then conveyed to the production area.\r\n\r\nAdditives are incorporated into the process and the product is fermented, creating a beer mash.  The product goes through a scrubbing process to removed residual volatile organics and then enters the distillation and condensation process.  The beer is approximately 10% ethanol and 90% non-fermentable corn solids.  The ethanol is separated from the beer at this stage and leaves as 190-proof ethanol, which is sent to a bulk storage tank.  The 190-proof contains residual water, so it is filtered one more time, which produces 200-proof ethanol.  Lastly, the 200-proof ethanol is mixed with a denaturant and stored in either of two tanks prior to transferring to the truck or rail loadout areas.  Vapors from the process vessels and distillation are controlled through a recuperative thermal oxidizer.\r\n\r\nThe distillation process removes the ethanol from the beer, non-fermentable corn solids and water.  The remaining water is then removed from the residual mash or whole stillage.  The resulting product is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039037,
      "SummaryText": "called wet distillers grain (WDG's).  About half of the WDGS is dried to approximately 60% moisture content and is called Modified Distillers Grain.  The MDG's are sold directly to customers as high quality animal feed.  The other half of WDG's are dried to approximately 11% moisture content and is called Dried Distillers Grain.  The DDG's travel through the cooling tube before being stored in the DDG Building located on the south side of the facility.  They can be stored for extended periods of time and are shipped out by truck or rail.  \r\n\r\nThe recuperative thermal oxidizer serves as the primary emission control device for the two dryers as well as various process vents.  The thermal oxidizer is very efficient at controlling particulates, carbon monoxide, VOC's, HAP's and nuisance odors.\r\n\r\nThe facility also has a water cooling tower for non-contact cooling water used in the fermentation process and a fire pump for emergency use.\r\n\r\nRMP Applicability & Chemical Description\r\nThe facility stores and utilizes two chemicals that require participation in the Risk Management Plan.  Those are anhydrous ammonia (CAS # 7664-41-7) and natural gasoline, a flammable mixture, which is used as a denaturant.    \r\n\r\nAnhydrous ammonia is used to control pH in the fermentation process and it is stored outside in an 18,000 gallon storage tank near the center of the ethanol plant. When filled to the maximum 85% capacity, this tank can hold up to 15,300 gallons of anhydrous ammonia.  This material is a gas at ambient temperature and pressure.  It is a liquid when stored under pressure inside the tank.\r\n\r\nAnhydrous ammonia is not a poison, but it is an inhalation / respiratory hazard. Ammonia is a toxic material but it has no cumulative effects on the human body.  However, it is acutely corrosive when it comes into contact with mucous membranes, in particular.   Anhydrous ammonia is a non-flammable gas.\r\n\r\nThe natural gasoline is used to denature the ethanol produced at the facility an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039037,
      "SummaryText": "d is a flammable mixture.  There are multiple constituents of natural gasoline however based on analysis two of those constituents, butane and pentane, are subject to the Risk Management Plan.  Butane makes up 0.806% of the natural gasoline and pentane makes up 47.715% (neo-Pentane at 0.237%, iso Pentane at 22.96% and n-Pentane (1,2 Butadiene) at 24.518%).  \r\n\r\nNatural gasoline is stored in a 100,000 gallon steel tank in the facility's tank farm.  Secondary containment consisting of a diked structure containing an impermeable liner and gravel overlay, surrounds the tank farm.  \r\n\r\nSummary of Release Scenarios\r\n\r\nWorst Case Release - Anhydrous Ammonia\r\nAs mentioned above, the storage tank has an 18,000 gallon capacity, but when filled to 85%, it can only hold 15,300 gallons or 78,795 pounds of ammonia.   All deliveries are made by truck, which holds 20 tons (40,000 pounds) of ammonia.  The worst case release scenario would occur while the delivery truck is hooked up to the storage tank during the receiving process.   A truck is only ordered when the storage tank can receive the entire truckload.  So, 78,795 pounds of storage capacity - 40,000 pounds of empty space required to be able to order and receive a truckload of ammonia + 40,000 pound of ammonia on the delivery truck = 78,795 pounds of product that is capable of being released during the worst case scenario.\r\n\r\nA complete failure or burst of the ammonia storage tank, as represented by the worst case scenario, is highly unlikely.  The bulk storage tank was built in 2005 under strict guidelines established by the ASME pressure vessel code.  The National Board Certificate for the tank is on file.  The storage tank is protected by concrete traffic barriers and fencing.  All welding and structural work done on the tanks or appendages are performed by certified welders and stamped accordingly.\r\n\r\nWorst Case Release - Flammable Mixture, Natural Gasoline\r\nThe worst case release scenario would be a total loss of a full"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000039037,
      "SummaryText": "tank of natural gasoline resulting in a vapor cloud explosion.  The storage tank capacity is 100,000 gallons or 560,000 pounds of natural gasoline.  Of the 560,000 pounds 271,718 pounds are reportable.  \r\n\r\nRMP Comp was used to determine the distance to 1 psi overpressure and 2010 US Census Bureau Data was used to determine public receptor information.\r\n\r\n\r\nAlternative Release - Anhydrous Ammonia\r\nThe most likely causes of ammonia emergencies are ruptured hoses/lines and defective valves, as represented by the alternative release scenario.  The most probable time for an exposure to occur will be during a transfer from a delivery truck to the storage tank.  Flexible hoses must be connected properly.  Hoses are date-stamped and replaced by the transporter or The Andersons in advance of the expiration date or when defects are observed.  All transfers of ammonia are directly observed by the delivery truck driver.  Transfers of anhydrous ammonia from the storage tank to the processing building occur inside fixed steel pipes and area automated from the control room.  No hoses are utilized in this operation.\r\n\r\nUnder normal circumstances for the alternative scenario, the amount released would not be based on the total volume of both vessels.  Instead, it would be limited by the volume of the delivery truck.  The plumbing at the storage vessel receiving bulkhead has backflow preventers which would prevent the tank from emptying its contents if a transfer hose ruptured.  Therefore, the product that would be released would have to come from the delivery truck.  \r\n\r\nAnhydrous ammonia is supplied by a truck, which typically holds 20 tons (40,000 pounds) of product.  Product is transferred via rubber hoses to the storage tank at a rate of 1,000 pounds / minute.  The truck has an excess flow valve and the receiving system at the tank also has one.  Typically, a release would immediately trigger the excess flow valves to slam shut.  However, if the release was too slow to trigger"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000039037,
      "SummaryText": "the excess flow valve, it would continue to leak until the transfer system could be shut down.  Over the course of a ten minute period, approximately 10,000 pounds (10 minutes x 1,000 pounds) of ammonia would be released.\r\n\r\nAlternative Release - Flammable Mixture, Natural Gasoline\r\nThe most likely cause of a natural gasoline emergency is a release during a delivery due to a faulty hose or valve resulting in a vapor cloud explosion.  Deliveries are made by truck and pumped into the storage tank.  Deliveries are typically 9,000 gallons or 50,400 pounds of which 24,455 pounds are butane and pentane.  \r\n\r\nAll deliveries are made during business hours and are observed by the truck driver and facility personnel.  If a release were to occur the delivery attendants could stop the flow within minutes.  The loadout area where deliveries occur has a catchment basin with underground piping to secondary containment of the tank farm.     \r\n\r\nRMP Comp was used to determine the distance to 1 psi overpressure and 2010 US Census Bureau Data was used to determine public receptor information.\r\n\r\nExplanation of How Ammonia Releases are Prevented\r\nPassive mitigation refers to equipment, devices or technologies that function without human, mechanical or energy input.  The passive mitigation systems in place include:\r\n¿\tBulkhead breakaway units located on the connection point between the delivery truck and the storage tank plumbing.  If a truck driver were to drive off without disconnecting from the tank, the concrete structure would cause the hose to shear off from the plumbing.  At this point, active mitigation would take effect and an excess flow valve, just inside the breakaway barrier, would prevent the tank from emptying into the atmosphere.\r\n\r\nActive mitigation refers to equipment, devices or technologies that require human, mechanical or other energy input to function.  The active mitigation systems in place include:\r\n\r\n¿\tExcess flow valves are located on all outgoing liquid and"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000039037,
      "SummaryText": "vapor valves on the storage tank.  They close automatically if the volume of gas or liquid flowing through the line exceeds the normal flow rate.  They won't reopen until the downstream shutoff valve is closed and the pressure equalizes on both sides of the valve seat.  Two principal causes of the excess valve closing are a ruptured hose or a broken pipe or shutoff valve downstream that is opened too quickly.\r\n¿\tBack check valves are located on the unloading lines of delivery trucks and are designed to ensure that the flow goes in one direction only.  This prevents anhydrous ammonia from flowing back to the transport tank from the storage tank.\r\n¿\tPressure-relief valves are located on the top of the bulk storage tank and fixed steel piping to relieve pressure that is too great.  This can be caused by elevated temperatures in the summer or overfilling.  They open directly to the atmosphere at 250 psig and close when the pressure inside the tank drops below this pressure.\r\n¿\tA break away safety chain is located at the truck receiving hookups which activates in the event of the delivery truck driving away while still connected.  There are two locations to activate manual emergency shut off valves which are air actuated: next to the lab door and outside near the bulk storage tank.  There are two valves at each location, both valves at the same location must be closed to shut the system down.  \r\n¿\tA safety shower and eye wash station are located on the west side of the anhydrous ammonia tank in case of exposure.\r\n¿\tSpill control kits are located at the facility and include sorbent material, shovels, PPE and disposal containers.\r\n¿\tDeliver truck drivers supervise all anhydrous transfers to and from the bulk storage tank.\r\n\r\nPrevention Program\r\nPreventive maintenance is an integral piece of this facility's hazard management program.  All hoses, tanks, valves and storage units are inspected at least monthly.  A good PM program is our strongest defense against a release of a"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000039037,
      "SummaryText": "nhydrous ammonia.  All hose replacements are documented.  Records of all maintenance tasks performed on the tank or appendages are also on file.\r\n\r\nThis facility uses a certified third party contractor for all welding and construction performed on the anhydrous ammonia tank or transfer pipes.  Copies of all reports are on file. The ammonia system undergoes a thorough inspection by a third party at least every five years, previously it was at least every 15 years.\r\n\r\nSee \"Steps Taken to Address Hazards\" for more information on prevention measures and identification.\r\n\r\nOperations - log temp and pressure once per shift\r\nMaint - in house annual tank inspection; five year inservice (outsourced) inspection; 15 year out of service inspection (outsourced)\r\n\r\n\r\nManagement System\r\n(see \"Steps Taken to Address Hazards\")\r\n\r\nEquipment maintenance\r\nAll equipment maintenance is formally documented. See the \"Prevention Program\" section for further explanation.\r\n\r\nTraining\r\nAll employees receive annual training on anhydrous ammonia, emergency action plan and spill procedures, and hazard communication.  Documentation and attendance rosters are on file at the facility.  \r\n\r\nContractors\r\nContractors that are hired by The Andersons, Inc. go through a documented Prequalification Process.  Records of this evaluation are kept on file.\r\n\r\nAll contractors also receive a \"contractor safety review\" prior to performing work at the facility.  During this review, they are informed of any potential hazards at the facility, emergency procedures, site-specific safety rules and the ability to request an MSDS for any product at any time.\r\n\r\nSteps Taken to Address Hazards\r\nThe Andersons Denison Ethanol LLC has many systems in place for hazard assessment and mitigation.  \r\n\r\nThe Safety Department performs annual hazard management audits at the facility.  The audits include a physical walk through of the entire facility and a review of all EPA, OSHA and DOT paperwork and training documentation.  Action"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000039037,
      "SummaryText": "items are noted and recommendations are made. The audits consist of five major topical areas:  Safety & Health, Environmental, Fire Protection & Security, Administrative and Housekeeping & Storage.  Issues are documented in a report and sent to the facility manager and upper management.  Updates on action item status must be made regularly.\r\n\r\nA Process Hazard Analysis (PHA) has been performed at this facility, as part of the Process Safety Management Program.  The analysis will be updated every five years, or as changes in the process are made.  PHA's are performed using the Haz Op protocol and analyze all aspects involved in the production of ethanol.  The evaluation team includes representatives from the corporate Safety Department, facility Management and Operations employees.\r\n\r\nFormal investigations are performed for all environmental or safety incidents.  Documentation is kept on file at the facility and the corporate Safety Department.\r\n\r\nA formal Management of Change (MOC) system is in place at this facility.  An electronic form is submitted whenever a change is made to any of the processes within the scope of the PSM program.  Forms are routed from the facility operator to the Engineering and Safety Departments for review and remarks.  A copy of the completed form is kept on file at the facility.\r\n\r\nMonthly Safety Committee meetings allow employees to discuss any concerns they may have with the operation of the facility.  Issues are documented and assigned to employees for follow-up. Records of all meetings are kept at the facility.\r\n\r\nResponse Action in the Event of a Release\r\nIn the event of a small, controlled leak or defective valve, employees are instructed to shut down the transfer process and, if possible, don the appropriate PPE, approach the shutoff valve from upwind and attempt to turn it off. \r\n\r\nFor an uncontainable release, employees will immediately call the police and fire department or other first responders, as appropriate.  All employees,"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000039037,
      "SummaryText": "customers and contractors are to be evacuated to an upwind location. Once the response team has arrived, we will work in concert with them to close the valves between the tank and the leak.  In the meantime, a steady spray of water will deluge the ammonia gas plume and knock it to the ground, while chemically binding any free ammonia.\r\n\r\nThe employees are instructed to make emergency phone calls in this order:  911, the facility Manager, the corporate Safety Department emergency phone number, the state emergency hotline and the National Spill Response Center phone number.  All applicable contact names and numbers are found in the facility spill and emergency action plan. \r\n\r\nCommunication procedures with responders \r\nThe local fire department is invited to tour the facility on an annual basis.  Facility management, employees and fire department personnel have jointly discussed the location of the anhydrous ammonia and response procedures on a regular basis.  They know the location of all emergency shutoff valves and on-site response equipment.  We believe that a strong relationship with first responders is our best defense.\r\n\r\nThe LEPC and state regulatory agencies receive a copy of our hazardous materials storage information, every February, in accordance with our community right to know obligations.  A copy of the Emergency Action Plan is on file with the LEPC and the local fire department.\r\n\r\nSecurity Plans\r\nThe Department of Transportation (DOT), Research and Special Programs Administration (RSPA) 49 CFR Part 172, requires all facilities that offer or transport hazardous materials to document a security plan and perform employee awareness training.  \r\n\r\nA security assessment plan has been created to describe all security measures at this facility, identify any vulnerable areas and then document the measures taken to address those risks.  The plan is intended to work in conjunction with the Emergency Action and Spill Control Plan to meet all required criteria."
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000039037,
      "SummaryText": "Training is performed with all employees annually and within 90 days of employment."
    }
  ]
}