{
  "FacilityID": 1000105542,
  "FacilityName": "Thrive Freeze Dry",
  "FacilityStr1": "691 S Automall Dr",
  "FacilityStr2": null,
  "FacilityCity": "American Fork",
  "FacilityState": "UT",
  "FacilityZipCode": "84003",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49049",
  "LEPC": "Utah County LEPC",
  "FacilityLatDecDegs": "40.363372",
  "FacilityLongDecDegs": "-111.792586",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Thrive Freeze Dry",
  "OperatorStr1": "691 S Automall Dr.",
  "OperatorStr2": null,
  "OperatorCity": "American Fork",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84003",
  "OperatorZipCodeExt": null,
  "FTE": 285,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000251229",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2024-10-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-12-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-12-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-12-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-12-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000131790,
      "AltID": "Process 2",
      "FacilityID": 1000105542,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000165191,
          "ProcessID": 1000131790,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000133223,
          "ProcessID": 1000131790,
          "NAICSCode": "311423",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000113518,
              "Process_NAICS_ID": 1000133223,
              "SafetyReviewDate": "2024-10-24 00:00:00",
              "PHA_Date": "2023-04-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2025-10-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "criminal activity, terrorism",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Hand held meters",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-04-26 00:00:00",
              "TrainingReviewDate": "2024-04-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer (online)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-09-05 00:00:00",
              "EquipmentInspectionDate": "2024-12-17 00:00:00",
              "EquipmentTested": "Safety systems (Ammonia detection, e-stop, etc.)",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2024-04-22 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2024-04-12 00:00:00",
              "HotWorkPermitReviewDate": "2024-05-01 00:00:00",
              "ContractorSafetyReviewDate": "2024-09-13 00:00:00",
              "ContractorSafetyEvalDate": "2024-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000142477,
                  "PreventionProgram3ID": 1000113518,
                  "ProcessChemicalID": 1000165191
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000105542,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-11-15 00:00:00",
    "ERTrainingDate": "2024-09-10 00:00:00",
    "CoordinatingAgencyName": "American Fork Fire Dept.",
    "CoordinatingAgencyPhone": "8017633045",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000105542,
      "SummaryText": "The EPA RMP regulation requires that an Executive Summary be provided as part of the registration submitted to the EPA. Note: This summary includes additional information not included in the RMP Submit to assist Thrive Foods management, process operators, technicians, contractors plus all involved and affected employees towards safe operation. In addition, some of the detail provided within this summary was excluded from the submitted RMP as current public access to this detail could expose the facility and personnel to terrorist or criminal activity. \n\nThese processes do not meet the requirements of Program 1. One process is subject to OSHA's PSM standard. Therefore, this RMP is written to meet the EPA Program 3 level of compliance. \n\nThe following areas are addressed in this summary: \n\n1. Accidental release prevention and emergency response policies at the stationary source \n2. The stationary source and regulated substances handled \n3. The worst-case release scenario(s) and the alternative release scenario(s), including \n     administrative controls and mitigation measures \n4. The accidental release prevention program and chemical-specific prevention steps \n5. The five-year accident history \n6. The emergency response program \n7. Planned changes to improve safety \n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \n\nThrive Foods is committed to complying with all the regulatory requirements of the EPA Risk Management Program. Thrive Foods has developed their Risk Management Plan / Process Safety Management (RMP/PSM) to document policies and address the implementation of these regulations. The PSM sections pertain to the prevention of accidental releases and include the Process Hazard Analysis study and procedures for operating, training, maintenance, emergency response, and others. The RMP sections pertain to management systems and include the Hazard Assessment (Offsite Consequence Analysis) Report. \n\nFederal regulations require reporting when there is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000105542,
      "SummaryText": "a release of ammonia exceeding 100 pounds in 24 hours.  RMP / PSM regulations require Thrive Foods to investigate every incident that resulted in or could reasonably have resulted in a catastrophic release. All releases and near misses are to be recorded using the incident investigation forms. All releases are to be monitored and all readings recorded. All releases and near misses are to be reviewed to develop procedures that may prevent future incidents. \n\nSTATIONARY SOURCE ACTIVITIES AND REGULATED SUBSTANCES HANDLED \n\nThe refrigeration system / process is a direct, closed loop, mechanical refrigeration system. Anhydrous ammonia is used as the refrigerant in the Thrive Foods refrigeration system and is the only regulated substance. \n\nACCIDENTAL RELEASE PREVENTION PROGRAM \n\nThrive Foods Prevention Program is described in the RMP program. The Prevention Program implemented by Thrive Foods is essential to help prevent or minimize the effects if a release occurs. \n\nKey objectives of Thrive Foods Prevention Program are briefly described below: \n1) Maintain current and complete refrigeration system technical information. The facility has retained the original manufacturer OEM manuals, equipment drawings, etc. for reference purposes and aid in maintenance activities. (Addressed under the Process Safety Information Element) \n2) Provide thorough team evaluation of the ammonia refrigeration system. The types of natural and human caused external events considered in the hazard review include: \n\u0095\tearthquake, tornado, extreme severe weather, floods\n\u0095\tinadequate physical security devices (locks, lighting, fences) may lead to outside threats which may lead to an anhydrous ammonia leak - the facility does have fencing around the facility, lighting around the facility, locked and secured doors / fences, and multiple camera throughout the facility \n\u0095\tlack of security awareness training for employees to help identify internal threats - employees are trained on an annual basis on the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000105542,
      "SummaryText": "importance of reporting security incidents both potential and real \n\u0095\tan airplane strike \n\u0095\tlack of workplace violence policy and/or procedures could lead to a potential anhydrous ammonia release - employees are trained on company policy concerning workplace violence \n\u0095\tanhydrous ammonia theft from equipment that is outside and not monitored - facility has a fence around the facility, there are cameras throughout the facility to monitor activity, the engine room door is locked with a sign indicating authorized personnel only \n\u0095\ta suspicious package is delivered with the intent to cause an anhydrous ammonia release - package drop-off at the facility is located in one area which is away from the anhydrous ammonia system \n\u0095\ta bomb threat that could cause an anhydrous ammonia release \n3) Written procedures and policies are in place that establish how the refrigeration system is operated and maintained. The facility shall develop standard operating procedures for the safe and normal operation and shut-down of the ammonia refrigeration system. The manufacturer's OEM manual may be used for reference. The standard operating procedures are periodically reviewed to ensure they reflect the current operating practices. \n\nPrevention is the primary reason regular and scheduled maintenance is performed on the ammonia refrigeration system. The system shall follow industry RAGAGEP, manufacturer recommendations, and/or industry practice to help maintain the system The facility utilizes outside contractors to perform routine and emergency maintenance on the system. (Addressed under Operating Procedures and Mechanical Integrity Elements) \n\nAll safety recommendations developed by the team are reviewed and addressed by facility management. A priority list is developed, and target dates are set for the recommendations to reduce or eliminate hazards. (Addressed under Process Hazard Review and Maintenance Elements) \n\n4) Written procedures and forms are in place detailing how and when the fa"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000105542,
      "SummaryText": "cility must investigate accidental/incidental releases. The facility investigates releases and near misses that could have resulted in a catastrophic release of anhydrous ammonia. Recommendations are addressed and corrected by facility management. Reports are kept for at least five years. (Addressed under Incident Investigation Elements) \n\n5) Certification of refrigeration operators to safely operate the refrigeration system. Thrive Foods certifies operators following completion of operator training and confirmation of the operator's ability to apply what they have learned. (Addressed under Training Element) \n\n6) Employee involvement in the Prevention Program. This is addressed on two levels. First, refrigeration equipment operators participate in the planning and evaluation of the Prevention Programs (e.g., Process Hazard Review study team, writing and/or reviewing operating procedures, Incident Investigation team, etc.). In addition, some of these elements are reviewed and trained on annually or every three years or if a change is made at minimum as required by the code and industry standards. This involvement encourages ownership of the Prevention Program and positively affects the operators' day-to-day activities. \n\nSecond, all Thrive Foods employees at this facility receive ammonia awareness training. Additionally, they have access to the complete RMP, the IIPP and more for review, comment, and input. These activities improve the overall safety of the employees. \n\n7) The audit process is an important tool to confirm whether each of the elements in the Prevention Program has been implemented and properly documented by Thrive Foods personnel. Thrive Foods has established a Management System procedure to address any shortcomings, which the audit may find. A priority list is developed, and target dates are set for any changes or corrections. (Addressed under Compliance Audit Element) \n\nProgram Consolidation \nThe documentation requirements of these programs have bee"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000105542,
      "SummaryText": "n consolidated in the documenting and record filing process. The documents and records are kept as identified in each element of the program. The following identifies the practices and procedures for: \n     Process Safety Information \n     Process Hazard Analysis \n     Operating Procedures \n     Training \n     Mechanical Integrity \n     Management of Change \n     Pre-Startup Review \n     Compliance Audits \n     Incident Investigations \n     Employee Participation \n     Hot Works Contractors \n\nFIVE YEAR ACCIDENT HISTORY \n\nThis system is new and has not been in operation for 5 years.  Facility personnel are aware of the regulations for reporting the facility's 5-year accident history. \n\nEMERGENCY RESPONSE PROGRAM \n\nThis facility has trained personnel to implement the Emergency Action Plan developed for this facility for flammables, fire, earthquake, hazardous materials, and other emergencies. Facility personnel shall coordinate with responding outside agencies. The facilities emergency action plan has been coordinated with the community plan which includes these agencies. \n\nFacility personnel will exchange data with local environmental authorities, fire and contractors who might assist during an emergency. In addition, Fire Department personnel should tour the facility frequently to get a better understanding of the processes and the facilities during an emergency such as fire, earthquake and or a chemical release. \n\nThe emergency action plan for all releases is to gain access to the shutdown valves and controls for the system with the release. If the system shut down areas are within the ammonia release area the entire ammonia system may be shut down if appropriate. \n\nOn-site personnel do not enter an atmosphere above the IDLH, which is 300 ppm. Facility personnel will assist outside agencies in a plant advisory role during larger releases. All personnel not trained to respond will evacuate to the meeting areas and be accounted for. \n\nPLANNED CHANGES TO IMPROVE SAFET"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000105542,
      "SummaryText": "Y \n\nEmployees, community safety, the environment and product care are primary concerns at this facility. An initial PHA study was conducted at Thrive Foods and the study team made recommendations for additional safety. Reference the PHA's for specific plans to improve safety."
    }
  ]
}