{
  "FacilityID": 1000047116,
  "FacilityName": "Stellar Blending and Packaging Solutions LLC",
  "FacilityStr1": "1556 Decoma Drive",
  "FacilityStr2": null,
  "FacilityCity": "Dupo",
  "FacilityState": "IL",
  "FacilityZipCode": "62239",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17163",
  "LEPC": "St. Clair County LEPC",
  "FacilityLatDecDegs": "38.524581",
  "FacilityLongDecDegs": "-90.192010",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.stellarbps.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78710595,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dan Connelly",
  "OperatorStr1": "1556 Decoma Drive",
  "OperatorStr2": null,
  "OperatorCity": "Dupo",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62239",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tony DiStefano",
  "RMPTitle": "Director of Operations and EH&S",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000227088",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-01-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-10-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-10-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-06-14 00:00:00",
  "DeRegistrationEffectiveDate": "2016-06-02 00:00:00",
  "AnniversaryDate": "2019-10-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058805,
      "AltID": "LP-Flammable Propellant",
      "FacilityID": 1000047116,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000059857,
          "ProcessID": 1000058805,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000071790,
          "ProcessID": 1000058805,
          "ChemicalID": 98,
          "Quantity": 44000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000571790,
          "ProcessID": 1000058805,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047116,
      "SummaryText": "Executive Summary\n\n\n\nStellar Blending and Packaging Solutions, LLC\n\n\n\nSource \n\nStellar Blending and Packaging Solutions, LLC located in Dupo, Illinois provides aerosol packaging services utilizing threshold quantities of liquefied petroleum (LP) flammable gas (> 10,000 pounds) comprised of mixtures of propane (CAS No. 74-98-6), isobutane (CAS No. 75-28-5) and butane (CAS No. 106-97-8).  \n\n\n\nStellar Blending and Packaging Solutions, LLC has one 12,000 gallon storage tank enclosed and secured in accordance with NFPA 58: Liquefied Petroleum Gas Code. The mixture containing propane, isobutane and butane is used as a propellant in formulated cleaning, degreasing and air care products. \n\n\n\nRelease Scenarios \n\n\n\nStellar Blending and Packaging Solutions, LLC is required to develop and provided release scenarios in accordance with U.S. EPA's Risk Management Plan (RMP).  Release scenarios were performed using guidance and modeling contained in Risk Management Program Guidance for Offsite Consequence Analysis, U.S. Environmental Protection Agency, Office of Solid Waste and Emergency Response, EPA 550-B-99-2009, March 2009 and U.S. EPA's Risk Management Program Guidance for Propane Storage Facilities\n\n\n\nWorst - Case Release Offsite Consequence Analysis \n\n\n\nIn developing the worst - case release scenario, Stellar Blending and Packaging Solutions in accordance with RMP requirements, assumed the entire contents of the largest and only containment vessel (44,000 pounds) is released with the consequent formation of a vapor cloud and subsequent detonation (explosion).  The distance to the endpoint (EP) is defined as the distance the explosive force resulting from an accidental release will travel before dissipating to the point that serious injuries from short - term exposures will no longer occur.  For liquefied petroleum (LP) flammable gas comprised of mixtures of propane, isobutane and butane, the EP is defined as an overpressure of 1 pound per square inch (psi) which is sufficien"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047116,
      "SummaryText": "t energy to shatter windows, damage residential houses and possibly result in serious injuries. \n\n\n\nThe calculated distance to the endpoint for the worst - case release scenario of approximately 44,000 pounds of flammable gas comprised of mixtures of propane, isobutane and butane is 0.3 miles (approximately 1,580 feet). \n\n\n\nThe worst - case endpoint distance obtained using EPA's Risk Management Program Guidance for Offsite Consequence Analysis was derived from models which assume the combination of worst - case conditions which would be a rare and unlikely to occur under normal circumstances.  The design, construction and operation of the LP - flammable gas storage tanks is in accordance with National Fire Protection Association (NFPA) compliance codes, American Society of Mechanical Engineers (ASME) specifications and 6G Weld certification. \n\n\n\n\n\nIn addition to adherence to strict design and construction specifications, Stellar Blending and Packaging Solutions, LLC has a preventative maintenance program in place to ensure mechanical integrity of its storage tank and transfer (piping) systems.  An operational employee and contractor training program is in place and routinely exercised.  The tank storage area and transfer piping is firmly secured and fenced.\n\n\n\nAlternative - Case Scenario\n\n\n\nNumerous alternative release scenarios were considered and analyzed including \n\n\n\na). accidental transfer vehicle pull-away before decoupling the 4\" transfer hose twenty-five (25) feet in length wherein a vapor cloud explosion occurs from the release of 69 pounds of flammable gas. The distance to the endpoint in this scenario is 0.03 miles (175 feet).\n\n\n\nb). An additional alternative release scenario considered involved the failure of a pressure relief valve servicing the 12,000 gallon bulk storage tank whereby a flammable vapor cloud is created.  Employing the look-up tables found in U.S. EPA's Offsite Consequence Analysis Guidance document the distance to the LFL (endpoint) is "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047116,
      "SummaryText": "less than 0.06 miles (<317 feet).  \n\n\n\nc). The final and more probable alternative release scenario involves the dispensing (charging) of small aerosol containers with flammable gases which is performed in a specially-designed gas house equipped with multiple interconnected analyzers to detect the presence of flammable hydrocarbons.  If flammable gases are detected (below LFL) gas flow is automatically stopped and the room air exchange is increased.  The gas house is outfitted with a fire suppression system and deflagration panel that would vent the deflagration away from employees, the plant and storage tank in the event of an explosion. \n\n\n\nThe outlined list of alternative scenarios is not likely to occur as the facility has a robust preventive maintenance program to ensure system integrity and provides routine training to employees.  Additionally, there are currently no public or environmental receptors within the alternative release scenario endpoints.  \n\n\n\nAccident Prevention Program\n\n\n\nStellar Blending and Packaging Solutions, LLC is committed to employee and environmental safety through a host of written operational and training measures.  A summary of those measures follows. \n\n\n\nDetailed documented process safety information including hazards of the regulated substances (flammable gas), equipment specifications and requirements and thorough understanding and applicability of pertinent codes and standards regulating the design, construction and operation of the process involving threshold quantities of flammable gas and aerosol filling operations and production.   \n\n\n\nA detailed process hazard analysis as required by 40CFR68.50 employing the checklist/what if method for critical processes has been performed.   \n\n\n\nStellar Blending and Packaging Solutions, LLC has written and operational procedures for critical process equipment including LP - flammable gas storage tank filling and aerosol can-filling operations including redundant emergency shutoff systems.  "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000047116,
      "SummaryText": "\n\n\n\nThese written operational procedures are further supported by employee ownership-driven management of change, mechanical integrity, maintenance and hot-work procedures, permits and documentation with formal reviews and authorization requirements established to reduce the susceptibility for incidents and mitigate the severity should an incident occur.  \n\n\n\nStellar Blending and Packaging Solutions, LLC has a strong incident investigation procedure to serve as platform for addressing and correcting near miss and incident occurrences.  The operation has a formal employee and contractor training program and policy for operating procedures, safety polices, personnel protection equipment, maintenance, etc. \n\n\n\nA written emergency response plan is in place and updated routinely to address changes in management, employee responsibilities and certification changes.  \n\n\n\nAccident History\n\n\n\nThere have been no accidental releases of flammable gases at the Stellar Blending and Packaging Solutions Dupo, Illinois facility that have resulted in on-site or off-site deaths, injuries or property damage accidents since Stellar Blending and Packaging Solutions, LLC was incorporated on December 12, 2012. \n\n"
    }
  ]
}