{
  "FacilityID": 1000111225,
  "FacilityName": "Otter River Water Treatment Plant",
  "FacilityStr1": "9625 Leesville Road (SR 682)",
  "FacilityStr2": null,
  "FacilityCity": "Evington",
  "FacilityState": "VA",
  "FacilityZipCode": "24550",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51031",
  "LEPC": "Campbell County LEPC",
  "FacilityLatDecDegs": "37.210472",
  "FacilityLongDecDegs": "-079.299472",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Campbell County Utilities and Service Authority",
  "Company2Name": null,
  "CompanyDUNS": 74764390,
  "Company2DUNS": null,
  "OperatorName": "Campbell Co. Util. & Service Auth.",
  "OperatorStr1": "20644 Timberlake Road",
  "OperatorStr2": null,
  "OperatorCity": "Lynchburg",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "24502",
  "OperatorZipCodeExt": "5593",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000062497",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-21 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-04-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-04-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-04-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-04-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.210472,
  "FRS_Long": -79.299472,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000138592,
      "AltID": "Water chlorination",
      "FacilityID": 1000111225,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000173437,
          "ProcessID": 1000138592,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000140085,
          "ProcessID": 1000138592,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000119261,
              "Process_NAICS_ID": 1000140085,
              "SafetyReviewDate": "2024-03-07 00:00:00",
              "PHA_Date": "2024-03-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-03-07 00:00:00",
              "TrainingReviewDate": "2024-03-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Chlorine Safety Seminar provided by Siler Environmental Equipment Company",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-03-07 00:00:00",
              "EquipmentInspectionDate": "2023-10-10 00:00:00",
              "EquipmentTested": "vacuum regulator-check units.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2024-03-07 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2024-04-09 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2024-03-07 00:00:00",
              "HotWorkPermitReviewDate": "2024-03-07 00:00:00",
              "ContractorSafetyReviewDate": "2024-03-07 00:00:00",
              "ContractorSafetyEvalDate": "2024-03-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000149403,
                  "PreventionProgram3ID": 1000119261,
                  "ProcessChemicalID": 1000173437
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000111225,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Campbell County Public Safety Dept.",
    "CoordinatingAgencyPhone": "4345929574",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000111225,
      "SummaryText": "t and procedures, identifies potential system failure modes, and provides recommendations for system and operational improvements.\r\n\r\nEmergency Response Program\r\n\r\nA comprehensive emergency response program has been prepared which outlines the procedures and lines of communication that are necessary to effectively respond to and mitigate a potential chlorine gas release.\r\n\r\nIn the event of a chlorine gas release in the Chlorine Storage or Chlorinator Room, a detector will detect the presence of chlorine gas.  The detector will activate audible and visual alarms throughout the facility to give warning to plant staff.  The facility emergency response program includes procedures for notifying the local hazardous materials (hazmat) teams of the incident and procedures for evacuating the facility.  Currently, the Virginia Area 8 regional hazmat team in Roanoke will respond to mitigate a chlorine leak.  The City of Lynchburg Fire Department is also working to develop a hazmat team.  In the future, it is expected that the CCUSA will develop an agreement with the City of Lynchburg to provide hazmat response from the City Fire Department."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000111225,
      "SummaryText": "f the prevention program include:\r\n\r\nA§ Employee participation\r\nA§ Process safety information\r\nA§ Process hazard analysis\r\nA§ Incident investigation\r\nA§ Standard operating procedures\r\nA§ Mechanical integrity\r\nA§ Management of change\r\nA§ Pre-startup review\r\nA§ Training\r\nA§ Contractors\r\nA§ Compliance audits\r\nA§ Hot work permits\r\nA§ Trade Secrets\r\n\r\nThe following breifly describes the benefits of the following prevention program elements:  standard operating procedures, mechanical integrity program, employee training and process hazard analysis.\r\n\r\nThe facility staff has developed up-to-date and accurate written standard operating procedures (SOP's) to ensure that operators have clear instructions for safe operation of the chlorine system.  Furthermore, facility staff annually reviews SOP's to ensure that procedures are reflective of current operating practices.  Effective SOP's, when combined with operator training, are instrumental in ensuring safe operation of the system and in preventing accidental releases.\r\n\r\nKnowledgeable well-trained personnel are essential to preventing and mitigating the effects of accidental chemical releases.  Facility staff receive annual safety refresher courses utilizing both classroom and hands-on training.  The Otter River WTP training program ensures that personnel working on or near the chlorine system are adequately trained in operation and maintenance procedures and the appropriate response actions to an accidental chlorine release.\r\n\r\nThe purpose of the mechanical integrity program is to ensure the continued integrity of the process equipment.  An effective mechanical integrity program is needed to prevent accidental chlorine releases that may result from mechanical failure of improperly maintained equipment.  The Otter River WTP mechanical integrity program includes maintenance, inspection, and testing procedures and schedules.\r\n\r\nThe process hazard analysis is a valuable risk reduction tool that outlines deficiencies in equipmen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000111225,
      "SummaryText": "eyewashes, an emergency B kit, ten-minute air packs, and a winsock.\r\n\r\nRisk Management and Process Safety Management Program Overview\r\n\r\nChlorine is subject to the EPA's Risk Management Program (RMP) regulation, which can be found in 40 CFR 68, and the Occupational Safety and Health Administration's (OSHA's) Process Safety Management Program (PSMP) regulation, which can be found in 29 CFR 1910.119.\r\n\r\nThe primary components of the RMP are as follows:\r\n\r\nA§ A five-year accident history\r\nA§ An off-site consequence analysis for a worst-case and alternative release scenario\r\nA§ A comprehensive prevention program to minimize risks (ie., minimize the potential for a release)\r\nA§ An emergency response program to ensure that an accidental release is appropriately handled\r\nA§ An overall management program to supervise the implementation of the RMP\r\n\r\nThe Plan is a summary of the facility's Risk Management Program.  The RMP will continue to be updated every five years, or whenever a process changes or a new process is added.  The OSHA PSMP regulation has basically the same requirements as the prevention program element of the EPA RMP.  The Otter River WTP RMP meets the requirements of both regulations.  Additionally, in response to the Plan changes , updates to the Plan regarding any changes to emergency contact information will be submitted within 30 days from date of occurance.\r\n\r\nThe following sections briefly summarize the elements of the Otter River WTP RMP.\r\n\r\nFive Year Accident History\r\n\r\nThe Otter River WTP has used chlorine to disinfect water for approximately twenty-three(23)years.  In the years of operation, the facility has had no accidental releases.\r\n\r\nPrevention Program\r\n\r\nThere are always risks associated with handling and using chlorine.  These risks include the potential inhalation of chlorine gas if it is accidentally released.  The prevention program is a key component of reducing the risk associated with a potential chlorine gas release.  Key elements o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000111225,
      "SummaryText": "prehensive approach to maintain full compliance with the initial RMP regulation and the subsequent changes to the Chemical Accident Prevention Rule as of March, 2004.\r\n\r\nFacility Background\r\n\r\nThe CCUSA owns and operates the Otter River Water Treatment Plant (WTP).  The facility's mission is to protect public health by providing the county with safe drinking water, free of harmful pathogens.  Approximately 30 to 150 pounds per day of chlorine gas is used to disinfect the water and make it safe for human consumption.  A maximum of 8,000 pounds of chlorine are stored on-site.  The chlorine is stored as a gas that is liquefied under pressure in containers that contain 2,000 pounds each.\r\n\r\nChlorine Process and Safety Equipment\r\n\r\nThe chlorine system at the Otter River WTP is a vacuum system, with the vacuum regulators mounted on the chlorine ton containers.  The chlorine gas is under vacuum from the vacuum regulators to the chlorine injectors in the Chlorinator Room.  The chlorine ton containers are located in a separate chlorine storage room in the Chemical Storage Building.\r\n\r\nChlorine is withdrawn from the ton-containers as a gas and is conveyed under pressure to the vacuum regulators.  From the vacuum regulators, chlorine gas is conveyed under vacuum to two chlorinators, one for pre-chlorine and one for post-chlorine.  The chlorinators are located in the Chlorinator Room in the Filter Building.  An additional chlorinator is available for backup.  Water flowing through two chlorine injectors creates the vacuum that conveys the chlorine gas from the vacuum regulators to the chlorinators and the injectors.  At the injectors, the chlorine gas is mixed with water and the resulting chlorine solution is distributed to the pre-chlorine and post-chlorine application points.  Safety equipment for the chlorine system includes exhaust fans and motor-operated louvers for room ventilation, chlorine detectors with local and remote visual and audible alarms, emergency showers and"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000111225,
      "SummaryText": "Executive Summary\r\n\r\nIntroduction\r\n\r\nAt the turn of this century waterborne diseases were a leading cuase of death in the United States.  Epidemics of typhoid, cholera, dysentery and other waterborne diseases occurred.  After chlorine's introduction into public water supplies, deaths from typhoid in the U.S. dropped dramatically from 25,000 in 1900 to less than 20 in 1960.  Waterborne disease is even still a leading cause of infant mortality in many countries throughout Asia, Africa, and Latin America, where infant mortality rates are 10 to 20 times that of the U.S.  In the U.S., however, waterborne disease has been virtually eliminated due to an effective public health strategy utilizing chlorine for drinking water disinfection.  Effective disinfection is arguabley one of the greatest achievements for public health worldwide in the last hundred years and is credited with increasing the life expectancy of Americans by more than 50 percent.\r\n\r\nThe use of chlorine is not risk free, however.  Historically, it is clear that utilities have recognized the risks and have been successful in developing procedures to handle chlorine safely and to protect the off-site public and the environment from potential accidental releases.\r\n\r\nAs an added layer of protection, the United States Environmental Protection Agency (EPA) promulgated Hazardous Chemical Risk Management Program regulations to further ensure that facility owners understand the risks and take proactive efforts to reduce risk through comprehensive training programs, procedures, and risk mitigation measures.  Additionally, EPA wanted the public to be informed regarding these issues.\r\n\r\nThe Otter River Water Treatment Plant has always understood these risks and has maintained a well-trained staff and a safely operated and maintained facility.  The track record of the Campbell County Utilities and Service Authority (CCUSA) is exemplary with respect to handling hazardous chemicals.  Furthermore, the CCUSA has taken a com"
    }
  ]
}