{
  "FacilityID": 1000080264,
  "FacilityName": "Ventura Foods, LLC - Birmingham",
  "FacilityStr1": "3900 Vanderbilt Road",
  "FacilityStr2": null,
  "FacilityCity": "Birmingham",
  "FacilityState": "AL",
  "FacilityZipCode": "35217",
  "Facility4DigitZipExt": "4159",
  "FacilityCountyFIPS": "01073",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "33.560667",
  "FacilityLongDecDegs": "-086.783639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.venturafoods.com",
  "FacilityEmailAddress": "cconner@venturafoods.com",
  "FacilityDUNS": 956044879,
  "ParentCompanyName": "Ventura Foods, LLC",
  "Company2Name": null,
  "CompanyDUNS": 956044879,
  "Company2DUNS": 0,
  "OperatorName": "Ventura Foods LLC Birmingham",
  "OperatorStr1": "3900 Vanderbilt Road",
  "OperatorStr2": null,
  "OperatorCity": "Birmingham",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35217",
  "OperatorZipCodeExt": "4159",
  "RMPContact": "Solanda Prather",
  "RMPTitle": "Plant Manager",
  "FTE": 329,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169934",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-12-14 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-17 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.56041,
  "FRS_Long": -86.78319,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100201,
      "AltID": "Ammonia System",
      "FacilityID": 1000080264,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101445,
          "ProcessID": 1000100201,
          "NAICSCode": "311225",
          "_desc": {
            "NAICS_CODE": "311225",
            "NAICS_DESCRIPTION": "Fats and Oils Refining and Blending"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125507,
          "ProcessID": 1000100201,
          "ChemicalID": 56,
          "Quantity": 32700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625507,
          "ProcessID": 1000100201,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080264,
      "SummaryText": "Executive Summary\n\n\n\nOur Birmingham facility's primary activities involve the production, storage and shipping of margarines, spreads, and edible oil products. Anhydrous ammonia is the only regulated substance present at our facility. The entire ammonia inventory is attributed to its use as a refrigerant. The maximum inventory of ammonia at our facility is 43,994 pounds. However, the current operating charge is 30,684 lbs.\n\n\n\nThe Maximum Intended Inventory is the amount that will not be exceeded in our system as documented in our PSI. The maximum intended inventory takes into account engineering and administrative controls and is, therefore, less than the maximum our system can hold, but normally more than the actual charge. \n\n\n\nIn this case, administrative controls include our policies relating to the maximum amount we will maintain in the vessels, etc during normal operations.  Engineering controls are the float switches and level probes that designate the maximum amount that is maintained in each vessel.                                      \n\n                                    \n\n                                    \n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set forth in 40 CFR Part 68. In addition, our facility is subject to the OSHA PSM standard set forth in 29 CFR 1910.119 and EPCRA Section 302 notification requirements.  The following sections briefly describe the elements of the release prevention program  in place at our Birmingham facility.\n\n\n\nProcess Safety Information\n\nVentura Foods maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all the processes.\n\n\n\nProcess Hazard Analysis\n\nThe methodology used to carry out the analysis is the What If-Checklist. The analysis was undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years. Any findings related to the hazard analysis are addr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080264,
      "SummaryText": "essed in a timely manner.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered process, Ventura Foods maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is reviewed and is readily accessible to operators involved with the process.\n\n\n\nTraining\n\nVentura Foods has a training program in place to train employees who are operating the process or are associated with the process. Refresher training is provided at least every three (3) years and more frequently as needed.\n\n\n\n\n\nMechanical Integrity\n\nVentura Foods carries out documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and compressors. Maintenance procedures are carried out by qualified personnel with a background in maintenance practices. Training is provided to the personnel as needed. Any equipment deficiencies identified during maintenance checks are corrected in a safe and timely manner. \n\n\n\nManagement of Change\n\nWritten procedures are in place at Ventura Foods to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel and all other employees whose job tasks are affected by a change in a process are promptly made aware of and provided training regarding these changes.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in the established process are conducted as a regular practice at Ventura Foods. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment in service.\n\n\n\nC"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080264,
      "SummaryText": "ompliance Audits\n\nVentura Foods conducts audits on a regular basis to determine whether the provisions set out in our RMP are being properly implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nVentura Foods promptly investigates all releases of a regulated substance. These investigations are undertaken to identify the root cause of the incident, as well as, any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years and reviewed again during the revalidation of our PHA.\n\n\n\nEmployee Participation\n\n\n\nVentura Foods believes that ammonia safety and accident prevention is a team effort. Employees are encouraged to express their views concerning accident prevention and to recommend improvements. In addition, our employees have access to all information collected as part of the facility's compliance with the RMP requirements. For ready access,the drawings and manuals are kept in a common area near the engineering and production managers' office.\n\n\n\nThe PSM team is composed of both management and hourly employees. The understanding of the team concept is the foundation that supports our program.The team meets on a regular basis to address any issues or concerns, as well as, staying abreast in the ongoing development and improvements to our program. \n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance and ammonia experience of the contractor is carried out.  Ventura Foods has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all applicable procedures for emergency response to an accidental release of a regulated substance.\n\n\n\nFiv"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080264,
      "SummaryText": "e-year Accident History\n\nThere have been no accidents \n\n\n\nEmergency Response Plan\n\nVentura Foods has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. The last revision to the Emergency Response Plan was 1/5/18.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nJefferson County LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified with the State (SEPC) Co-chair. \n\n\n\nPlanned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of our accidental release prevention program.  Continued training, audits, and program reviews are some of the steps we will take to improve safety at our facility.  These changes are expected to be implemented in a timely manner.\n\n"
    }
  ]
}