{
  "FacilityID": 1000009263,
  "FacilityName": "Great Lakes Cheese Co., Inc.",
  "FacilityStr1": "17825 Great Lakes Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Hiram",
  "FacilityState": "OH",
  "FacilityZipCode": "44234",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39055",
  "LEPC": "Geauga County LEPC",
  "FacilityLatDecDegs": "41.386667",
  "FacilityLongDecDegs": "-081.182778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.greatlakescheese.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 18219808,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Great Lakes Cheese Co., Inc.",
  "OperatorStr1": "17825 Great Lakes Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Hiram",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44234",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Rodman",
  "RMPTitle": "Plant Manager",
  "FTE": 500,
  "OtherEPAFacilityID": "2866812",
  "EPAFacilityID": "100000145504",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-10-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.38575,
  "FRS_Long": -81.25419,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010847,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000009263,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011229,
          "ProcessID": 1000010847,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012352,
          "ProcessID": 1000010847,
          "ChemicalID": 56,
          "Quantity": 15200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512352,
          "ProcessID": 1000010847,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009263,
      "SummaryText": "\nBackground Data\n\nGreat Lakes Cheese Co., Inc. (Great Lakes Cheese) operates a facility in Hiram, Ohio which packages a variety of cheeses. Bulk cheese arrives from other Great Lakes Cheese locations, and is then processed (sliced, shredded, etc.) and packaged. After packaging, the product is stored in our refrigerated warehouse facility until shipped to the customer. Great Lakes Cheese has been in operation since 1958, and is recognized as one of the leading companies in Northeast Ohio.\n\n\nAccidental Release Prevention and Emergency Response Policy\n\nGreat Lakes Cheese is committed to maintaining a safe manufacturing operation for our employees and the surrounding community. This commitment includes the ammonia refrigeration system. To further safety in our facility, the refrigeration system has been constructed under permit from the local authorities, such as the building and fire departments. Great Lakes Cheese has also developed an accidental release prevention program to comply with the Environmental Protection Agency's (EPA) Risk Management Plan (RMP) rule, 40 CFR 68, and the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) regulation, 29 CFR 1910.119.  \n\n\nStationary Sources and Regulated Substances\n\nTo ensure the quality of our final products, refrigeration is necessary to maintain the low temperatures required for the food processing and storage areas of the plant. The refrigeration system is also utilized to operate coolers for product storage.  To achieve this, Great Lakes Cheese uses anhydrous ammonia, the 112A? regulated substance, as the refrigerant in the cooling system.\n\nAnhydrous ammonia is a standard refrigerant for the food industry and widely used throughout the country. It performs the same functions as Freon refrigerants used in home air conditioners, refrigerators, automobiles, etc, but is more environmentally-friendly, energy-efficient, and capital-efficient. And unlike Freon, ammonia is suitable for most in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009263,
      "SummaryText": "dustrial uses. Anhydrous ammonia is also used widely as a fertilizer, both for direct injection into the ground and for manufacture of other fertilizers. Because of its moderate toxicity and slight flammability, anhydrous ammonia is considered a highly hazardous material.\n\n\nAccidental Release Prevention Program\n\nTo prevent and mitigate accidental releases of anhydrous ammonia, Great Lakes Cheese has implemented several precautionary measures including process and equipment controls, operating procedures, preventive maintenance programs, employee training, and audit programs. Additionally, the refrigeration system is designed to industry-recognized codes and standards, including the ASHRAE Safety Code for Refrigeration and ANSI/IIAR 2-1992 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems. \n\nGreat Lakes Cheese has also developed and implemented a PSM program in accordance with OSHA regulations and as such, has evaluated the refrigeration system for the potential to release anhydrous ammonia. Some of the controls installed to prevent catastrophic releases of ammonia include process equipment (pressure relief valves, check valves, backup pumps, and manual shutoffs) and automated controls (automatic shutoff and ammonia leak detection system).\n\nGreat Lakes Cheese has developed and provides operating procedures for all employees and contractors that have contact with the ammonia refrigeration system. These procedures incorporate safety measures to prevent employee injury, equipment damage, and accidental releases. These operating procedures were developed by a team of operations, maintenance, and management personnel.\n\nA mechanical integrity program has also been developed and implemented.  The mechanical integrity program is scheduled, documented and managed to ensure that regular maintenance occurs on the equipment in the ammonia refrigeration system.  Also, to ensure the mechanical integrity of critical refrigeration system co"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009263,
      "SummaryText": "mponents, equipment inspections are performed.\n\nTo ensure that the prevention program at Great Lakes Cheese is effective in maintaining the safe operation of the plant, we conduct detailed compliance audits every three years.  Each audit incorporates review of process safety information, process hazard analyses, operating procedures, training programs, mechanical integrity programs, management of change, pre-start up safety review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\n \n \nFive-Year Accident History\n \nOver the last five years there have been no accidental releases of ammonia. \n \n\nEmergency Response Program\n \nGreat Lakes Cheese has developed and implemented an Emergency Response Plan for the Hiram facility.  We rely upon the efforts of community emergency response personnel and organizations to respond to any serious incidents at our facility, and support the efforts of the Troy Township Fire Department and other Geauga County emergency organizations by providing information and technical assistance. Some members of the responding organizations are full-time employees at Great Lakes Cheese.\n\n\nContinuing Efforts to Improve Safety\n\nThrough our Process Safety Management program we systematically look for possible system changes to improve the safety in our facility. As changes are made (or as process hazard analysis studies are updated) safety issues and improvements are identified and made as a matter of course. Our adherence to accepted codes and standards drastically reduces the number of safety issues in a change; safety is designed into the change rather than added later."
    }
  ]
}