{
  "FacilityID": 1000096751,
  "FacilityName": "Enterprise Princeton Terminal",
  "FacilityStr1": "3217 South 950 East",
  "FacilityStr2": "(1.2 mi South of Highway 64 West)",
  "FacilityCity": "Oakland City",
  "FacilityState": "IN",
  "FacilityZipCode": "47660",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18051",
  "LEPC": "Gibson County LEPC",
  "FacilityLatDecDegs": "38.308572",
  "FacilityLongDecDegs": "-087.390037",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enterprise Terminals and Storage, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Enterprise Products Operating LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "RMPContact": "Douglas J. D'Aquila",
  "RMPTitle": "Staff Engineer- Safety/PSM",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000178719",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-08-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-10-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-10-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-10-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-10-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.30889,
  "FRS_Long": -87.39117,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000119938,
      "AltID": "Storage/Loading of LPG",
      "FacilityID": 1000096751,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000121311,
          "ProcessID": 1000119938,
          "NAICSCode": "488999",
          "_desc": {
            "NAICS_CODE": "488999",
            "NAICS_DESCRIPTION": "All Other Support Activities for Transportation"
          }
        },
        {
          "Process_NAICS_ID": 1000121312,
          "ProcessID": 1000119938,
          "NAICSCode": "49319",
          "_desc": {
            "NAICS_CODE": "49319",
            "NAICS_DESCRIPTION": "Other Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000150200,
          "ProcessID": 1000119938,
          "ChemicalID": 98,
          "Quantity": 28000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000150201,
          "ProcessID": 1000119938,
          "ChemicalID": 105,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 105,
            "ChemicalName": "Ethyl mercaptan [Ethanethiol]",
            "CASNumber": "75-08-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000650200,
          "ProcessID": 1000119938,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000650201,
          "ProcessID": 1000119938,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000096751,
      "SummaryText": "Princeton Terminal\n\nEnterprise Terminals and Storage, LLC.\n\nExecutive Summary\n\nRisk Management Plan\n\nEPA Identifier:  1000 0017 8719\n\n\n\nAccidental Release Prevention and Response\n\n\n\nAt Enterprise, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n\n\n* A description of our facility and use of substances regulated by EPA's RMP regulation\n\n* An overview of our accidental release prevention programs\n\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n\n* An overview of our emergency response program\n\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\n\n\nThe Princeton Terminal located in Gibson County, Indiana is owned by Enterprise Terminals and Storage LLC and is operated by Enterprise.  The Princeton Terminal is a wholesale terminal facility for the storage and loading of propane.  The propane is received from an affiliated underground pipeline and is stored in two above ground storage tanks or in one underground storage cavern.  The stored propane is transferred from the storage bullet tanks into highway transport trucks for delivery of the propane to wholesale customers, or may be returned to the pipeline for bulk delivery elsewhere.  Ethyl mercaptan, stored in a small tank near the truck loading rack, is added to the propane during the truck filling operation as an odorant to aid in propane lea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000096751,
      "SummaryText": "k detection.\n\n\n\nThe process is regulated by Federal OSHA 29 CFR 1910.119 and 40 CFR Part 68.  We have entered the facility as an RMP Program Level 1 facility.\n\n\n\nToxics\n\n\n\nThere are no toxic materials contained on site above the threshold limits.\n\n\n\nFlammables\n\n\n\nThe Princeton Terminal was evaluated to determine if any regulated flammable or toxic substances exceeded the threshold quantity.  Enterprise identified the regulated substances and quantities kept on site based on facility knowledge.  Listed flammable substances which are stored above the threshold quantities at the Princeton Terminal are propane and ethyl mercaptan.  The Terminal is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulation and is classified as a Program Level 1 site under the EPA RMP program.  Normal butane and / or isobutane may be stored at the facility in four spherical tanks that are part of DOT pipeline operations.  These butanes are in storage incident to transportation and are exempt from the RMP rule.  Additionally, refined gasoline, natural gasoline and number 2 fuel oil are stored at Princeton and are redelivered either as return to the inlet pipeline or to transport trucks.  The vapor pressure of these stored products is above 14.7 psia at 100 degrees Fahrenheit, and they are also exempt from coverage by the RMP rule. \n\n\n\n\n\nOffsite Consequence Analysis Results\n\n\n\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.\n\n\n\nGeneral Accidental Release Prevention Program\n\n\n\nThe following is a summary of the accidental release prevention program in place at Princeton Terminal.  The process at the facility is regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation (Program 1).  Release prevention is provided through the use of wri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000096751,
      "SummaryText": "tten operating procedures, employee training in written procedures, including normal operation and emergency release procedures, and in the design of safety and release prevention equipment installed at the terminal site.  In addition, a written safety program designed to comply with all applicable OSHA safety performance regulations is strictly enforced at all Enterprise facilities, including the Princeton Terminal facility.  As part of the Enterprise safety program, the facility utilizes procedures that are included in the Enterprise program, but may not specifically be required at non-PSM and/or RMP Program 1 facilities (e.g. Safe work practice training; safe work permitting and hot work permitting).\n\n\n\nUniversal Prevention Activities\n\n\n\nThe accident prevention program summarized previously is applied to all RMP covered processes at Princeton Terminal.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\n\n\nSpecialized Safety Features\n\n\n\nThe Princeton Terminal has safety features on many units to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\n\n\n\nRelease Detection\n\n* Hydrocarbon (hazardous gas) detectors and alarms in the storage , loading and dehydration areas\n\n* Flame detectors in the storage, loading and dehydration areas\n\n\n\nRelease Containment and Control\n\n* Area relief valves and vents that discharge to a flare to capture and incinerate episodic releases.\n\n* Valves to permit isolation of the process (manual or automated).\n\n* Automatic shutdown systems for specific process parameters (e.g., high flow, low pressure).\n\n* Secondary containment to contain any release of liquid ethyl mercaptan.\n\n* Redundant equipment and instrumentation where advisable\n\n* Dual mechanical seals with seal failure alarms installed on hydrocarbon liquid pumps,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000096751,
      "SummaryText": " where feasible. \n\n* Storage tank emergency shut down valves\n\n* Loading line excess flow valves\n\n* Atmospheric relief devices.\n\n\n\nRelease Mitigation\n\n* Hand-held fire extinguishers \n\n* Personnel trained in emergency response and procedures.\n\n* Personnel protective equipment (e.g., chemical protective clothing, flame retardant coveralls, hard hats, safety glasses, etc.)\n\n\n\nFive Year Accident History\n\n\n\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\n\nThis facility has not had an accidental release in the last five years which meets the criteria set forth in 40 CFR 68.10, \n\n\n\nEmergency Procedures Information\n\n\n\nPrinceton Terminal maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the plant facilities.  \n\n\n\nThe overall emergency procedure program for the Princeton Terminal is coordinated with the Dakota County Emergency Services.  This coordination includes periodic meetings of the services group, which includes local emergency response officials, local government officials and industry representatives.  The Princeton Terminal has around-the-clock communications capability with appropriate Emergency officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic Emergency Services meetings, the Princeton Terminal "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000096751,
      "SummaryText": "provides periodic refresher training to local emergency responders regarding the hazards of the propane in the Terminal.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe Princeton Terminal resolves all findings from PHAs, some of which result in modifications to the process.  Other recommendations for possible changes to improve safety come from periodic accident prevention program audits, incident investigations, or employee suggestions and recommendations.  The following changes are planned for implementation at the Princeton Terminal.\n\n\n\n* No planned changes."
    }
  ]
}