{
  "FacilityID": 1000084586,
  "FacilityName": "J. N. Orr Water Treatment Plant",
  "FacilityStr1": "1123 Eshman Avenue",
  "FacilityStr2": null,
  "FacilityCity": "West Point",
  "FacilityState": "MS",
  "FacilityZipCode": "39773",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28025",
  "LEPC": "Clay County LEPC",
  "FacilityLatDecDegs": "33.623611",
  "FacilityLongDecDegs": "-088.637500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of West Point",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of West Point",
  "OperatorStr1": "PO Box 1117",
  "OperatorStr2": null,
  "OperatorCity": "West Point",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39773",
  "OperatorZipCodeExt": null,
  "RMPContact": "Paul Caskey",
  "RMPTitle": "Chief Operator",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000121708",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-02-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-01-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-01-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-01-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.62485,
  "FRS_Long": -88.63303,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105654,
      "AltID": "Chlorination of water",
      "FacilityID": 1000084586,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000106946,
          "ProcessID": 1000105654,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132296,
          "ProcessID": 1000105654,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632296,
          "ProcessID": 1000105654,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084586,
      "SummaryText": "Executive Summary\n\nfor \n\nJ. N. Orr Water Treatment Plant\n\nJune 19, 2004\n\n\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nWe at the J.N. Orr Water Treatment Plant are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n2.  The Stationary Source and the Regulated Substances Handled\n\nOur facilityA?s primary activity encompasses disinfection of drinking water.  We have one regulated substance present at our facility.  This substance is chlorine.  Chlorine is used to disinfect the drinking water.\n\n\n\nThe maximum inventory of chlorine at our facility is 8000.00 lb.\n\n\n\n3.  The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nNot required.\n\n\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nThe J.N. Orr Water Treatment Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, the J.N. Orr Water Treatment Pla"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084586,
      "SummaryText": "nt maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nThe J.N. Orr Water Treatment Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every two years and more frequently as needed.\n\n\n\nMechanical Integrity\n\nThe J.N. Orr Water Treatment Plant carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at the J.N. Orr Water Treatment Plant to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on December 29, 2019.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at the J.N. Orr Water Treatment Plant. These reviews"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084586,
      "SummaryText": " are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nThe J.N. Orr Water Treatment Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on December 29, 2019.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nThe J.N. Orr Water Treatment Plant promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nThe J.N. Orr Water Treatment Plant truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facilityA?s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The J.N. Orr Water Treatment Plant has a strict policy of informing the contractors of known potential hazards related the contractorA?s work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084586,
      "SummaryText": "ccur.\n\n\n\n5.    Five-year Accident History\n\nThe J.N. Orr Water Treatment Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n\n6.    Emergency Response Plan\n\nThe J.N. Orr Water Treatment Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nClay County EPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\n\n7.  Planned Changes to Improve Safety\n\nWe will further enhance our emergency response plan and coordinate closely with the CCEPC, the West Point Fire Department, and the Golden Triangle HazMat Team."
    }
  ]
}