{
  "FacilityID": 1000039899,
  "FacilityName": "Ryder Integrated Logistics Inc.",
  "FacilityStr1": "6805 Beatrice Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Kalamazoo",
  "FacilityState": "MI",
  "FacilityZipCode": "49009",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26077",
  "LEPC": "Kalamazoo County LEPC",
  "FacilityLatDecDegs": "42.240278",
  "FacilityLongDecDegs": "-085.683889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.ryder.com",
  "FacilityEmailAddress": "charlie.kurth@ryder.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Ryder Truck Rental,Inc",
  "Company2Name": null,
  "CompanyDUNS": 80193097,
  "Company2DUNS": 0,
  "OperatorName": "DeWayne Nostrant",
  "OperatorStr1": "6805 Beatrice Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Kalamazoo",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49009",
  "OperatorZipCodeExt": null,
  "RMPContact": "DeWayne Nostrant",
  "RMPTitle": "Facility Manager",
  "FTE": 38,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000002043",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-06-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-04-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-04-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-09-03 00:00:00",
  "DeRegistrationEffectiveDate": "2014-09-02 00:00:00",
  "AnniversaryDate": "2019-04-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.24031,
  "FRS_Long": -85.68523,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049187,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000039899,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000049649,
          "ProcessID": 1000049187,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059671,
          "ProcessID": 1000049187,
          "ChemicalID": 56,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000559671,
          "ProcessID": 1000049187,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039899,
      "SummaryText": "Executive Summary\n\n\n\nScope \n\n                 \n\nThe EPA RMP regulation requires that an Executive Summary be provided as part of this registration submitted to the EPA. The following areas are addressed in this summary:\n\n\n\nA. Accidental Release Prevention and Emergency Response Policies \n\nB. Stationary Source Activities And Regulated Substances Handled\n\nC. Prevention Program\n\nD. Five-Year Accident History\n\nE. Emergency Response Program\n\nF. Planned Changes to Improve Safety\n\n\n\n\n\nA. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \n\n\n\nThe emergency response procedures are detailed in the Kalamazoo Logistic Center II Emergency and Hazardous Materials Response Plans and Procedures. These manuals were designed to meet the following objectives: \n\n                                     \n\n1) To save lives.\n\n2) To minimize and avoid injuries. \n\n3) To protect the environment and the public.\n\n4) To minimize property damage. \n\n  \n\nThe Emergency Response Plan and Procedures provides the reporting and notification procedures, evacuation procedures, and mitigation procedures that may be implemented to ensure operators respond effectively to an emergency situation. All employees are trained in their specific roles when responding to an emergency. The manuals are kept in strategic locations throughout the facilities and are readily available to all employees. \n\n\n\nB. STATIONARY SOURCE AND REGULATED SUBSTANCE  \n\n \n\n The ammonia refrigeration system is a closed system that cycles the refrigerant, or ammonia, from liquid to gas and back again. The system, consisting of vessels, interconnecting piping, valves, and process equipment, cycles ammonia through various states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for product and process equipment. \n\n\n\nChanges in pressure are directly related to changes in temperature: lowering the ammonia pressure lowers its temperatur"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039899,
      "SummaryText": "e. Low-pressure (cold) liquid ammonia provides refrigeration by removing ambient heat. Removal of ambient heat causes the liquid ammonia (contained within the system) to vaporize. Heat is latter removed from the ammonia as it is condensed back into a liquid. Typical operating conditions range from 5\" hg on the low side to 150 psig on the high side. \n\n\n\nAmmonia is used as the refrigerant in the refrigeration process. \n\n\n\nThe maximum intended inventory of ammonia is 12,000 pounds. \n\n\n\nC. ACCIDENTAL RELEASE PREVENTION PROGRAM \n\n\n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n\n\nIIAR Bulletin 107, A Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie-ins@\n\n\n\nIIAR Bulletin 109, Minimum  Safety Criteria for a Safe Ammonia Refrigeration System@\n\n\n\nIIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\" \n\n\n\nIIAR, A Guide to Good Practices for the Operation of an Ammonia Refrigeration System@ \n\n\n\nIn addition the Kalamazoo Logistic Center II has implemented a Process Safety Management program for compliance with CFR 29, 1910.119. This included an initial Process Hazard Analysis that is revalidated every five years. In addition, the facility has a Mechanical Integrity program that includes an Engineering Checklist for equipment inspections. \n\n\n\nD. FIVE YEAR ACCIDENT HISTORY    \n\n\n\nThere have been no reported releases of ammonia at this facility over the last five years (April 20, 2009 through March 27, 2014 ).\n\n\n\nE. EMERGENCY RESPONSE PROGRAM\n\n\n\nRyder's Emergency Response Program is described in their Emergency Response Plan (ERP) for the Kalamazoo facility. \n\nThis plan includes planned responses and procedures for evacuation. Notification and alarm procedures are outlined  in the ERP as well. The plan addresses training requirements for employees, including production employees, supervisors, managers, and opera"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039899,
      "SummaryText": "tors. Emergency response drills involving all facility personnel are performed on an annual basis. This ensures that employees are familiar with evacuation routes from the facility and employee roles. \n\n\n\nF. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThere have been numerous changes to the facility to improve process chemical safety as a result of PSM and RMP implementation. Kalamazoo Logistic Center II will maintain PSM /RMP programs for continued process safety improvement. This will be accomplished through audits, PHA revalidations, training, mechanical integrity testing and inspections. The facility is in the process of inspecting all piping, and painting pipes where needed., Klc II has recently installed catwalks around evapoative condensers for employee safety and improved serviceability. KLCII has also added new microprocessors ammonia alarms, relief valves, exhaust fans and a new central computer control state of the art monitoring system."
    }
  ]
}