{
  "FacilityID": 1000091899,
  "FacilityName": "Foster Farms Kelso Poultry Plant",
  "FacilityStr1": "1700 South 13th Street",
  "FacilityStr2": null,
  "FacilityCity": "Kelso",
  "FacilityState": "WA",
  "FacilityZipCode": "98626",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53015",
  "LEPC": null,
  "FacilityLatDecDegs": "46.127000",
  "FacilityLongDecDegs": "-122.89883",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9178856,
  "ParentCompanyName": "Foster  Poultry Farms",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Foster Poultry Farms",
  "OperatorStr1": "1700 South 13th Street",
  "OperatorStr2": null,
  "OperatorCity": "Kelso",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98626",
  "OperatorZipCodeExt": null,
  "FTE": 700,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127294",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "98-2115R2",
  "SafetyInspectionDate": "2014-06-12 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-02-09 11:39:50",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-02-09 11:39:50",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-02-09 11:39:50",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-02-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 46.126527,
  "FRS_Long": -122.899112,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000114168,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000091899,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000142672,
          "ProcessID": 1000114168,
          "ChemicalID": 56,
          "Quantity": 33000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000115561,
          "ProcessID": 1000114168,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000097555,
              "Process_NAICS_ID": 1000115561,
              "SafetyReviewDate": "2021-01-21 00:00:00",
              "PHA_Date": "2021-01-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-01-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Diffusion Tank for Pressure Relief Valves",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-11-02 00:00:00",
              "TrainingReviewDate": "2020-01-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-01-02 00:00:00",
              "EquipmentInspectionDate": "2018-03-22 00:00:00",
              "EquipmentTested": "Entire System Inspection",
              "ChangeMgmtDate": "2020-11-30 00:00:00",
              "ChangeMgmtReviewDate": "2019-07-01 00:00:00",
              "PreStartupReviewDate": "2020-10-23 00:00:00",
              "ComplianceAuditDate": "2020-10-01 00:00:00",
              "AuditCompletionDate": "2021-10-01 00:00:00",
              "IncidentInvestigationDate": "2020-09-18 00:00:00",
              "InvestigationChangeDate": "2020-11-02 00:00:00",
              "ParticipationPlansReviewDate": "2020-01-02 00:00:00",
              "HotWorkPermitReviewDate": "2019-07-01 00:00:00",
              "ContractorSafetyReviewDate": "2020-09-26 00:00:00",
              "ContractorSafetyEvalDate": "2020-01-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000121696,
                  "PreventionProgram3ID": 1000097555,
                  "ProcessChemicalID": 1000142672
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000091899,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-06-01 00:00:00",
    "ERTrainingDate": "2020-09-30 00:00:00",
    "CoordinatingAgencyName": "Cowlitz 2 Fire",
    "CoordinatingAgencyPhone": "3605785218",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000091899,
      "SummaryText": "ia handling operations at its facility. As such, this document and related attachments and program elements will evolve as Foster Farm continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community. Foster Farms will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the RMP/PSM and related attachments and program elements will be incorporated consistent with Foster Farms' internal review practices and Foster Farms will maintain the most current versions on site. Thus, the most current version RMP/PSM and related documents and elements maintained on site may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000091899,
      "SummaryText": "for oil draining\r\n\r\nIn addition to the physical features of the ammonia refrigeration system at the facility, Foster Farms has extensive administrative controls in place to maintain safe operation of the system. Administrative controls include, but are not limited to, formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lock-out/tag-out program, a contractor safety program, incident investigation program, mechanical integrity program, management of change program, pre start-up safety review program, and a RMP/PSM auditing and inspection program. Written standard operating procedures (SOPs) have been prepared for the ammonia system at the facility. The SOPs provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\r\n\r\nFoster Farms is committed to maintaining the mechanical integrity of the ammonia refrigeration system. A preventive maintenance system is being utilized to manage the maintenance of the refrigeration system. Preventive maintenance at the facility includes daily, weekly, and periodic inspection; calibration; testing; and overhaul of ammonia system equipment. The system is utilized to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\r\n\r\nPlanned Changes to Improve Safety\r\nChanges to improve safety at the facility are ongoing. The majority of the mitigation measures suggested by the Process Hazard Analysis team have already been implemented. Foster Farms will respond to all suggested mitigation measures. Foster Farms is scheduling completion of proposed actions. Management responses and support will be consistent with Foster Farms' commitment to safe and environmentally responsible operations.\r\n\r\nFoster Farms recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammon"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000091899,
      "SummaryText": "FOSTER FARMS\r\nKELSO POULTRY PLANT\r\nRISK MANAGEMENT PROGRAM AND\r\nPROCESS SAFETY MANAGEMENT PROGRAM\r\n\r\nAnhydrous Ammonia Refrigeration System\r\n\r\n                                                             EXECUTIVE SUMMARY\r\n\r\nFoster Farms Kelso Poultry Plant (referred to hereafter as Foster Farms or Kelso) prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with Title 40 of the Code of Federal Regulations (CFR), Part 68. The Environmental Protection Agency (EPA) promulgated the Risk Management Program (RMP) regulations as required in the 1990 Amendments to the Clean Air Act. The goal of the RMP is to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that do occur. The RMP regulations apply to facilities that handle, manufacture, use, or store toxic and flammable substances above specified threshold quantities. In addition to the RMP regulations, both the State of Washington and Occupational Safety and Health Administration (OSHA) regulate facilities with certain acutely hazardous materials under Process Safety Management (PSM) regulations, as defined in Washington Administrative Code (WAC), Chapter 296 67, and CFR Title 29, Part 1910, Section 119, respectively. As the PSM regulations contain similar requirements to the RMP requirements, Kelso's RMP/PSM was developed with consideration to both.\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\nFoster Farms prepared the RMP/PSM to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve the anhydrous ammonia handling system and practices at the facility. Foster Farms incorporated many state-of-the-art safety features into the ammonia refrigeration system at the facility as part of the original system construction and system modifications. Foster Farms will continue to improve ammonia handl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000091899,
      "SummaryText": "ing safety through the implementation of the prevention program elements of the RMP/PSM. In the unlikely event that a chemical release does occur at the facility, Foster Farms personnel are trained in the appropriate response measures and do not rely on support services provided by the local fire department and/or hazardous materials response team for mitigation of the release. Foster Farms will rely on community responders for medical assistance and public evacuation or protection in place, if necessary. \r\n\r\nStationary Source and Regulated Chemicals Handled\r\nThe Foster Farms facility is located at 1700 South 13th Avenue in Kelso, Washington. The surrounding area consists of industrial and commercial businesses. The facility is in an industrial park that is generally bordered by Interstate 5 on the northeast and the Kelso Airport on the southwest. The Cowlitz River, residential, and commercial development are located northwest of the industrial park.\r\n\r\nThe facility was constructed in 1998 for Foster Farms. Operations at the facility consist of the processing of live chickens, storage, packaging and shipment of poultry products (NAICS code 311615 Poultry Processing). The facility is surrounded by chain-link fencing and has a secured entrance that is staffed by security personnel 24 hours per day, 365 days per year.\r\n\r\nAnhydrous ammonia (CAS 7664-41-7) is is the regulated substance used in a refrigeration system at the facility. The refrigeration system, which is a closed system, provides cooling for production areas, product, water chilling, and ice making. A central computer system monitors and controls the refrigeration system. The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves; float switches, transfer pumps, and compressor controls. \r\n\r\nThe RMP regulations require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling systems"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000091899,
      "SummaryText": "covered by the RMP. Program 3 requirements of the RMP apply to the Kelso facility due to the quantity of ammonia used and the process is subject to the PSM regulations. Program 3 facilities are required to evaluate a worst-case release scenario (release parameters are defined by the regulations) and an alternative release scenario. The regulations define a worst-case release scenario as ...the greatest amount held in a single vessel...released as a gas over 10 minutes. An alternative release scenario is identified as a release that is more likely to occur at the facility. This facility has prepared worst-case and alternative release scenarios. These are not summarized herein as recommended by EPA, but are presented in the RMP.\r\n\r\n5-Year Accident History\r\nThe RMP/PSM regulations require a review of the 5-year accident history at the regulated facility. Foster Farms reported no reportable accidental releases at the facility within the past 5 years.\r\n\r\nEmergency Response Program\r\nFoster Farms has recently revised their written Emergency Response Plan (ERP) that identifies emergency personnel responsibilities, procedures, evacuation measures and reporting requirements. The revised ERP is based on an emergency operations organization in which the Incident Commander serves as the chief officer in emergency situations. The Incident Commander will take charge of the emergency response and response team, direct all operations when an emergency is declared and will remain in charge until the emergency is ended. The ERP addresses ammonia specific issues as required by the RMP/PSM standards, including a determination of incidents that constitute an emergency\r\n\r\nAccidental Release Prevention Program and Chemical-specific Prevention Steps\r\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility. Foster Farms has incorporated many safety features in the ammonia refrigeration system to preve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000091899,
      "SummaryText": "nt system failures and to mitigate potential releases. The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion. The Foster Farms ammonia system is continuously monitored by an automated control system that shuts down components if deviations from normal operating conditions occur. The major pressure vessels in the system are connected to a diffusion panel. Ammonia from the vessels can be mixed with water (neutralized) to prevent over-pressurization of the vessels. Further, all pressure vessels in the system are equipped with pressure relief valves.\r\n\r\nOther safety features at the facility include: \r\n¿\temergency shutdown systems\r\n¿\tcomponent specific safety shutdowns\r\n¿\tan ammonia leak detection system is installed that closes ammonia supply solenoid valves if a \tleak is detected\r\n¿\tpressure relief valves on all vessels, compressors, and several other areas in the system where trapped ammonia could build pressure\r\n¿\tall pressure relief valves discharge to a water filled tank where the ammonia is neutralized\r\n¿\tall major vessels are connected to a fire diffusion panel\r\n¿\tammonia pipes, valves and components are labeled\r\n¿\tpressure relief valves are replaced at least every five years\r\n¿\ta central computer system monitors the refrigeration system and alarms when safety set-points are exceeded\r\n¿\tammonia system can be monitored and controlled remotely through the central computer system\r\n¿\tfacility is fully sprinklered for fire protection\r\n¿\tengine room is ventilated\r\n¿\toperators receive ongoing training in operations, maintenance and emergency response\r\n¿\ta formal preventive maintenance program has been implemented for all refrigeration system equipment\r\n¿\tannually all safety alarms and shutoffs are tested\r\n¿\tthe review and revision of SOPs is completed annually\r\n¿\tline labeling and valve tagging has been completed\r\n¿\tspring return valves are used"
    }
  ]
}