{
  "FacilityID": 1000079708,
  "FacilityName": "Southside WWTP",
  "FacilityStr1": "10011 Log Cabin Road",
  "FacilityStr2": null,
  "FacilityCity": "Dallas",
  "FacilityState": "TX",
  "FacilityZipCode": "75253",
  "Facility4DigitZipExt": "4102",
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.641333",
  "FacilityLongDecDegs": "-096.646867",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G6",
  "LatLongDescription": "PC",
  "FacilityURL": "www.dallascityhall.com/dallas/eng/html/water_utilities.html",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Dallas Water Utilities",
  "Company2Name": "City of Dallas",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Dallas Water Utilities",
  "OperatorStr1": "Dallas City Hall",
  "OperatorStr2": "1500 Marilla Street, Room 4A North",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75201",
  "OperatorZipCodeExt": "4102",
  "RMPContact": "Nosa Irenumaagho",
  "RMPTitle": "Senior Program Manager",
  "FTE": 104,
  "OtherEPAFacilityID": "TXD980798409",
  "EPAFacilityID": "100000129513",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-22 00:00:00",
  "SafetyInspectionBy": "OHSAS",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-07-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.6425,
  "FRS_Long": -96.64333,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099468,
      "AltID": "Southside Cl2 System",
      "FacilityID": 1000079708,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100708,
          "ProcessID": 1000099468,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124657,
          "ProcessID": 1000099468,
          "ChemicalID": 62,
          "Quantity": 240000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624657,
          "ProcessID": 1000099468,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000099469,
      "AltID": "Southside SO2 System",
      "FacilityID": 1000079708,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100709,
          "ProcessID": 1000099469,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124658,
          "ProcessID": 1000099469,
          "ChemicalID": 49,
          "Quantity": 150000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624658,
          "ProcessID": 1000099469,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079708,
      "SummaryText": ".INTRODUCTION\n\nThe Dallas Water Utilities (DWU) Southside Wastewater Treatment Plant (WWTP) has adopted this Risk Management Program under 40 Code of Federal Regulations (CFR) 68, the Chemical Accident Prevention regulations regulating extremely hazardous chemicals. This Risk Management Program as implemented will assist to prevent the occurrence of, or minimize the consequences of chemical releases.\n\n\n\nThis Executive Summary includes information required under 40 CFR Part 68.155.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nDWU implements preventive maintenance, inspection, and testing programs to minimize the potential for accidental releases. Standard operating procedures have been reviewed and revised to enable the employees to perform their work safely and provide immediate corrective response to any accident.\n\n\n\nThe Southside WWTP personnel are trained to respond in the event of a chemical release incident. Emergency response to accidental releases is also coordinated with the City of Dallas Police and Fire Department, the State and County Emergency Response Centers, and Local Emergency Planning Committees.\n\n\n\nStationary Sources and Regulated Substances\n\n\n\nThe Southside WWTP utilizes chlorine and sulfur dioxide (regulated substances) as a disinfectant and dechlorination agent in the wastewater treatment process. \n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nA Hazard Analysis as well as written safety information has been developed to enable personnel to identify and understand the hazards posed by processes involving highly hazardous chemicals including chlorine and sulfur dioxide. The City of Dallas verifies that all equipment used in the chlorine and sulfur dioxide processes comply with applicable codes, standards, and industry accepted good engineering practices.\n\n\n\nThe Hazard Review (Process Hazard Analysis) completed for this Risk Management Plan (RMP) documents the process and the findi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079708,
      "SummaryText": "ngs to minimize or eliminate hazards, to mitigate the consequences of hazards of any releases or other unplanned events, and to reduce the likelihood of exposure to chlorine or sulfur dioxide. \n\n\n\nWritten procedures have been developed, implemented, and maintained for equipment processes, including steps for each operating phase and operating limits.\n\nAll employees involved in working with and around the chlorine and sulfur dioxide systems are trained in process and safety procedures, including emergency response on an annual basis.\n\nThe mechanical integrity of chlorine and sulfur dioxide process equipment is documented and maintained through maintenance, inspection, and testing programs. \n\n\n\nA Compliance Audit Program has also been implemented. The objective of this self-evaluation program is to ensure that a successful RMP program is maintained, implemented, and followed by appropriate personnel. \n\nPersonnel have developed a formal documented system to manage incident investigations and follow up. Each incident that results in, or could reasonably result in, a catastrophic release of chlorine or sulfur dioxide in the workplace will be investigated and a copy of the incident investigation report filed in the RMP. \n\n\n\nThe Southside WWTP chlorine and sulfur dioxide system technologies are not confidential and any information regarding the process or process chemistry is available for review in the RMP.\n\nFive-Year Accident History\n\n\n\nIn the last 5 years, the Southside WWTP had one accidental leak that resulted in an employee injury.\n\n\n\nEmergency Response Program\n\n\n\nThe RMP Emergency Response Plan for the Southside WWTP includes the following elements:\n\n?    Procedures for informing the public and local emergency response agencies about accidental releases\n\n?    Documentation of proper first-aid and emergency medical treatment necessary to treat accidental human exposures \n\n?    Procedures and measures for emergency response after an accidental release of a regulated substance\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079708,
      "SummaryText": "\n?    Procedures for the use of emergency response equipment and for its inspection, testing, and maintenance\n\n?    Training for designated employees (such as operators, mechanics, and other employees that are involved in the process) in relevant procedures\n\n?    Procedures to review and update, as appropriate, the emergency response plan to reflect changes at the stationary source and ensure that employees are informed of changes\n\n\n\nA copy of the emergency procedures is maintained at the WWTP Administration Building. Southside WWTP personnel are trained to take action and will attempt to control a release within their capability. In the event that the release is beyond the control of the operators, maintenance personnel, or the Southside HazMat Response Team, they will immediately notify the Fire Department. \n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe Southside WWTP planned changes to improve safety include conducting and documenting the following:\n\n?    Additional chlorine/sulfur dioxide release drills with the Dallas Fire Department; \n\n?    Monthly safety briefings with employees; and \n\n?    Periodic review of personal protective equipment (PPE) maintenance (requirements follow Occupational Health and Safety Assessment Series [OHSAS] 18001 Safety Management System and DWU-PRO-063 Respiratory Protection Program), inspection, and testing with employees. \n\n\n\nDWU uses a certified International Organization for Standardization (ISO) 9001, ISO 14001, and OHSAS 18001-Safety Management System, which incorporates safety standards.\n\n\n\n\n\n"
    }
  ]
}