{
  "FacilityID": 1000007893,
  "FacilityName": "Tyson Foods, Inc. - FOOD SERVICE DIVISION",
  "FacilityStr1": "706 FACTORY STREET",
  "FacilityStr2": null,
  "FacilityCity": "WILKESBORO",
  "FacilityState": "NC",
  "FacilityZipCode": "28697",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37193",
  "LEPC": "Wilkes County LEPC",
  "FacilityLatDecDegs": "36.144444",
  "FacilityLongDecDegs": "-081.161944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.tyson.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 71574479,
  "ParentCompanyName": "TYSON FOODS, INC.",
  "Company2Name": null,
  "CompanyDUNS": 6903702,
  "Company2DUNS": 6903702,
  "OperatorName": "TYSON FOODS, INC.",
  "OperatorStr1": "706 FACTORY STREET",
  "OperatorStr2": null,
  "OperatorCity": "WILKESBORO",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28697",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kirk Church",
  "RMPTitle": "Plant Manager",
  "FTE": 400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000052685",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-05-02 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.22255,
  "FRS_Long": -80.93895,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009124,
      "AltID": "Food Service Division",
      "FacilityID": 1000007893,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000009363,
          "ProcessID": 1000009124,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000010328,
          "ProcessID": 1000009124,
          "ChemicalID": 56,
          "Quantity": 64000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000510328,
          "ProcessID": 1000009124,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000007893,
      "SummaryText": "EPA RISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\nTYSON FOODS - FOOD SERVICE DIVISION\nWILKESBORO, NC\n\n\n1.  Accidental release prevention and emergency response polices.                \n\nTo insure safe operation and release prevention at Tyson Foods, Wilkesboro, NC  this facility has implemented The Occupational Safety and Health Administrations Chemical Process Safety Management Program 29 CFR 1910.119.  All operators of systems containing the threshold amount of hazardous chemicals will undergo Chemical Process Safety Management training and operator training specific to the system. \n\nTo insure proper response to emergency situations, Tyson Foods, Wilkesboro, NC has implemented Emergency Action Plans as required by The Occupational Safety and Health Administrations 29 CFR 1910.38(a) and Emergency Response Plans  29 CFR 1910.120. All safety personnel and operators of the process will be trained in these emergency procedures.\n\n2.  The stationary source and regulated substances handled.\n\nThe Tyson Foods Inc. Food Service Division is a further processing plant.  We receive raw product from other points and process mostly \"Ready to heat & eat\" as well as some frozen fillet products. In the Processing area, we use Ammonia Refrigeration for blast cooling finished products as well as controlling room temperatures in order to maintain safe temperatures for storage.  \n \n3.  The general accidental release prevention program.\n  \nThis facility complies with the Occupational Safety and Health Administrations Chemical Process Safety Management 29 CFR 1910.119 and the Environmental Protection Agencies Risk Management Program 40 CFR Part 68.  For ammonia systems, Tyson Foods, Inc. has adopted the International Institute of Ammonia Refrigeration guidelines for system operation and maintenance.  Tyson Foods Inc. uses the IIAR Basic Ammonia Refrigeration Training Series for all operators regardless of prior work history in other companies.  Tyson Corporate Refrigeration has also developed "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000007893,
      "SummaryText": "higher training, Operator 1 & 2, for anyone currently operating a Refrigeration system that has passed all other requirements.  \n \n4.  Five-year accident history.\n\nThere have been no incidents at this facility in the past five years.\n\n5.   The emergency response program.\nA fully trained and equipped Emergency Response Team is on site.  This team is trained to the Hazardous Materials Responder-Technician capability in accordance with OSHA 29 CFR 1910.120 (q).  The team is capable of affecting all control measures (both confinement operations and containment operations) required to re-mediate the incident.\n\nA written Emergency Response Plan has been developed and is on record at the Facility.  This plan includes Pre-Emergency Planning with Outside Agencies, Personnel Roles and Lines of Incident Command Authority, Facility Hazard Analysis and Emergency Prevention, Safe Distances and Places of Refuge, Site Security and Control, Evacuation Routes and Procedures, Decontamination Procedures, provisions for Emergency Medical Treatment, Emergency Notification Procedures, Chemical Response Procedures, Post Incident Critique, and Personal Protective Clothing and Emergency Equipment.\n\nAll Hazmat courses at Tyson Foods, Inc. are designed to meet training requirements of the OSHA 29 CFR 1910.120 (q) (7) and (8).  All Tyson Foods - Food Service Division Hazmat Team Members are trained 24 hours initially to the Technician level.  Followed by 8-24 hours of refresher training per year, under the direction of the on-site Hazmat Instructor at the facility. \n\nThe training is designed to teach both theory and hands-on training giving the person an overall understanding of the nature of hazardous materials and the ability to assess and safely respond to the incidents in the Incident Command structure.  Technician level training includes but is not limited to the following:\nA? Knowledge of basic hazards and risk assessment techniques\nA? Proper selection and use of appropriate and required "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000007893,
      "SummaryText": "PPE for the chemical hazard\nA? Terminology associated with Hazmat\nA? Advanced site control/security procedures\nA? Advanced Containment/Control/De-con procedures\nA? Use of Atmospheric Monitoring Equipment and Contaminant Test Procedures\nA? Incident Command Structure Roles and Line of Authority\nA? Interaction with Local and State Officials\nA? Standard Operating Procedures for Clean-up and termination \nA? Critique\n\nOn Site facility Instructors have completed in excess of 40 hours of Instructor's training, achieving the Incident Command level.  All training materials, hands-on drills and response procedures have been developed under the direction of the Corporate Loss Control Department.\n\nAll Team members are taught in Hazard Communication to report any observed Chemical leaks, spills and odors to their supervisor or lead person immediately.  Supervisors and Leads are taught to report the above to their Supervisor or Lead-person, Safety, Refrigeration Dept or Process Safety Manager immediately for further investigation and action by the Hazmat team.  MSDS information books are accessible to all team members for review.\n\n6.  Planned changes to improve safety.\nTyson Foods-Food Service Division believes that through our pro active approach to follow the guidelines of the Process Safety Management Program, OSHA Standard 29 CFR 1910.119, that we are improving the quality of safety continually through training, communication with our team Members, PSM Program Audits and the Mechanical Integrity Program for our Ammonia Refrigeration System."
    }
  ]
}