{
  "FacilityID": 1000059957,
  "FacilityName": "Outdoor Municipal Pool",
  "FacilityStr1": "172 Providence Road",
  "FacilityStr2": null,
  "FacilityCity": "Oak Ridge",
  "FacilityState": "TN",
  "FacilityZipCode": "37830",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47001",
  "LEPC": "Anderson County LEPC",
  "FacilityLatDecDegs": "36.016444",
  "FacilityLongDecDegs": "-084.266778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cortn.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Oak Ridge",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Oak Ridge",
  "OperatorStr1": "P.O. Box 1",
  "OperatorStr2": null,
  "OperatorCity": "Oak Ridge",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37831",
  "OperatorZipCodeExt": "0001",
  "RMPContact": "Vonda Wooten",
  "RMPTitle": "Aquatics Supervisor",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000196502",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-05-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-09-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-09-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-09-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-10-20 00:00:00",
  "DeRegistrationEffectiveDate": "2020-05-01 00:00:00",
  "AnniversaryDate": "2021-09-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074885,
      "AltID": null,
      "FacilityID": 1000059957,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000076047,
          "ProcessID": 1000074885,
          "NAICSCode": "71394",
          "_desc": {
            "NAICS_CODE": "71394",
            "NAICS_DESCRIPTION": "Fitness and Recreational Sports Centers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092612,
          "ProcessID": 1000074885,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000592612,
          "ProcessID": 1000074885,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059957,
      "SummaryText": "The City of Oak Ridge owns and operates a public outdoor swimming pool located at 172 Providence Road. The pool is spring fed and considered one of the largest in the nation.  Depths in the pool range from zero to 13.5 feet.  It opens each summer during the first part of June and closes in mid-August.  Gaseous Chlorine, which is used as a disinfectant for the pool water is brought on site in one-ton containers just a few days prior to start-up of the pool and removed in the week of the closing of the pool for the season.  The maximum amount of chlorine on site at any given time is 4,000 lbs. configured in two one-ton containers.  No less than two containers could effectively keep a constant, safe chlorine residual in the pool.  Since chlorine is an extremely hazardous substance and the location of the outdoor pool is in close proximity to residential housing, schools and churches, the City of Oak Ridge provided state-of-the-art equipment to ensure safe regulation ofchlorine.  The PSM/RMP that was developed for the Outdoor Municipal Pool in May, 2006 provides information on the hazardous properties of chlorine, delineates the areas at risk in case of an accidental chlorine release and outlines prevention and response procedures designed to minimize the threat to health and environment in the area of consequence.  The PSM/RMP provides thorough discussion of all fourteen sections required in 29 CFR 1910.119 and in 40 CFR Part 68.  The chlorine containers are housed in a cement block building, away from sources of external corrosion.  A Ecometric chlorine monitoring/alarm system is installed in the chlorine feed building.  An airborne chlorine release equal to or greater than a one mg/l concentration will activate the alarm and warn pool personnel.  Also, the Ecometric chlorine monitoring/alarm system activation will cause the immediate shutdown of the chlorine flow from the chlorine container by activating the halogen valve automatic shutoff device attached to the one-"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059957,
      "SummaryText": "ton container in service.  Furthermore, the chlorine gas injection system employees a vacuum-operated chlorinator unit.  If the piping downstream of the chlorinator loses a vacuum due to damage, the spring-loaded inlet valve of the chlorinator tightly closes, stopping the chlorine flow.  Neverthelesss, the PSM/RMP does not rely solely on this safety equipment to protect life and property.  The PSM/RMP specifies the responsiblities that each person involved with the chlorine process and hazard mitigation has.  The Maintenance Supervisor or designee will only attempt to correct minor leaks at the time of chlorine container changeout.  Otherwise, the highly trained Oak Ridge Fire Department response teams will be the primary off-site responders handling all major leaks and providing advanced medical aid to victims of chlorine gas/liquid exposure.  The criteria for initiating either evacuation or sheltering in place to pool patrons or nearby residents when a major chlorine release occurs is addressed in the written plan.  The emergency response teams will be notified immediately in case of a major release by the calling of the \"911\" telephone number and/or by the City wide radio system.  In the last five years, there have been no accidental releases of chlorine on site. A new Ecometric chlorine monitoring/alarm system was installed in July, 2006.  Also, a windsock was installed in plain view of the lifeguards to aid in the case of an accidental chlorine release. All processes are reviewed annually by the Aquatics Supervisor, Risk Manager and Fire Chief.\n\n\n\nAdditionally, due to the large quantity of chlorine gas located on the property, the City of Oak Ridge is regulated by the Department of Homeland Security and is in compliance with their regulations."
    }
  ]
}