{
  "FacilityID": 1000067783,
  "FacilityName": "Skinny Jones Water Filtration Plant",
  "FacilityStr1": "3001 Veterans Drive",
  "FacilityStr2": null,
  "FacilityCity": "Scottsboro",
  "FacilityState": "AL",
  "FacilityZipCode": "35769",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01071",
  "LEPC": "Jackson County LEPC",
  "FacilityLatDecDegs": "34.649082",
  "FacilityLongDecDegs": "-085.985973",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.scottsborowsg.com",
  "FacilityEmailAddress": "bradley@scottsboro.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Scottsboro Water, Sewer and Gas Board",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Scottsboro Water, Sewer & Gas Board",
  "OperatorStr1": "P.O. Box 550",
  "OperatorStr2": "404 East Willow Street",
  "OperatorCity": "Scottsboro",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35768",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joshua Potts",
  "RMPTitle": "WTPs Superintendent",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000203852",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-09-23 00:00:00",
  "SafetyInspectionBy": "Water Treatment & Controls Company",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-05-28 00:00:00",
  "DeRegistrationEffectiveDate": "2020-05-18 00:00:00",
  "AnniversaryDate": "2023-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "39.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085041,
      "AltID": "Chlorination",
      "FacilityID": 1000067783,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000086224,
          "ProcessID": 1000085041,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000106078,
          "ProcessID": 1000085041,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000606078,
          "ProcessID": 1000085041,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067783,
      "SummaryText": "JONES WATER FILTRATION PLANT\n\n  EXECUTIVE SUMMARY FOR CHLORINATION PROCESS\n\n\n\n\n\n1.      Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe Jones Water Filtration Plant is strongly committed to employee, public and \n\nenvironmental safety.  This commitment is inherent to a comprehensive accidental \n\nrelease prevention program in place that integrates areas such as design, installation, \n\nmanagement practices, operating procedures, maintenance, and employee training \n\nassociated with the chlorination process at our facility.  The chlorination system at our \n\nplant is designed to meet industry standards and is well maintained.  Appropriate controls \n\nand alarms are also in place to prevent possible releases of chlorine.  Furthermore, all \n\napplicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention \n\nProgram Level 2 are adhered to.  \n\nIn the event an accidental release does occur, our facility is coordinated with the \n\nJackson County Emergency Management Agency, local fire and police departments, as \n\nwell as, Harcros Chemicals in Muscle Shoals, Alabama.  These institutions provide \n\nhighly trained emergency response personnel to control and mitigate effects of the \n\nrelease.\n\n\n\n2. Our Facility and the Regulated Substances Handled\n\n\n\nOur facility is a publicly owned water treatment plant.  Our primary activity is \n\ntreating potable water and pumping it into the Board's distribution system for public use.  \n\nWe provide water to the residents, businesses, and industries in Scottsboro, AL and much \n\nof Jackson County, AL.  We have one regulated substance, Chlorine.  Chlorine is used \n\nfor disinfecting the water.  The maximum inventory of Chlorine at our facility is 8,000 \n\npounds.\n\n\n\n3. The Worst Case Release Scenario and the Alternative Release Scenario\n\n\n\n3.    Hazard Assessment\n\n \n\nThe RMP Rule requires The Scottsboro Water, Sewer and Gas Board Skinny Jones Water Filtration Plant \n\nto perform a Hazard Assessment of the regulated substa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067783,
      "SummaryText": "nces stored and used in the covered processes at \n\nthe facility.  This Hazard Assessment includes an offsite consequence analysis for the following scenarios:\n\n \n\n* One worst-case and one alternative release scenario for the toxic substance chlorine for the chlorination \n\n  process unit at the facility.\n\n\n\nThe Scottsboro Water, Sewer and Gas Board Skinny Jones Water Filtration Plant completed a Hazard Assessment for \n\nthe covered processes and the results have been appropriately communicated to the local emergency response agencies. \n\n\n\n\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific \n\nPrevention Steps.\n\n\n\nOur facility has taken all the necessary steps to comply with the accidental release \n\nprevention requirements set out under 40 CFR part 68 of the EPA regulations.  The \n\nfollowing sections briefly describe the elements of the release prevention program that is \n\nin place at our facility.\n\n\n\nSafety Information\n\nOur facility maintains a record of safety information that describes the chemical \n\nhazards, operating parameters and equipment designs associated with the chlorine \n\nprocess.\n\n\n\nHazard Analysis\n\nOur facility conducts a comprehensive overview and analysis of our chlorination \n\nsystem to ensure that the associated hazards are identified and controlled efficiently.  The \n\nmethodology used to carry out this analysis is a hazard review checklist specifically \n\ndesigned for water plants.  This checklist was designed to meet the requirements of The \n\nChlorine Manual published by The Chlorine Institute.  The analyses are performed by \n\nqualified personnel and are revalidated at regular intervals.  Any findings related to the \n\nhazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our chlorination process, \n\nour facility maintains written operating procedures.  These procedures address various \n\nmodes of operation such as initial startup, normal operations,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067783,
      "SummaryText": " temporary operations, \n\nemergency shutdown, emergency operations, normal shutdown, and startup after a \n\nchange.  The information is regularly reviewed and is readily accessible to operators \n\ninvolved in the chlorination process.\n\n\n\nTraining\n\n\n\nOur facility has a comprehensive training program in place to ensure that \n\nemployees who are operating the chlorine process are competent in the operating three \n\nyears in accordance with EPA's RMP regulations and more frequently as needed.\n\n\n\nMaintenance\n\nOur facility has established routine maintenance checks on the chlorine process \n\nequipment to ensure proper operations.  Process equipment examined by these checks \n\nincludes among others, ton containers, piping, chlorinators, vent systems, rotometers, and \n\nejectors.  Maintenance operations are carried out by qualified personnel with previous \n\ntraining in maintenance practices.  Any equipment deficiencies identified by the \n\nmaintenance checks are corrected in a safe and timely manner.\n\n\n\nCompliance Audits\n\nOur facility conducts audits on a regular basis to determine whether the provisions \n\nset out under the RMP rule are being implemented.  In accordance with EPA's RMP \n\nregulations we perform these audits at least every three years.  Any corrective actions \n\nresulting from these audits are completed in safe and timely manner.\n\n\n\nIncident Investigation\n\nOur facility promptly investigates any incident which resulted in, or could \n\nreasonably result in a catastrophic release of a regulated substance.  These investigations \n\nprovide valuable information for assessing all possible causes of the incident ranging \n\nfrom human error to equipment failure.  In addition, possible corrective actions are \n\nidentified to prevent the accident from recurring.  All reports are retained for a minimum \n\nof five years as required by EPA's RMP regulations. \n\n\n\n5. Five Year Accident History\n\n\n\nOur facility takes pride in doing everything possible to prevent accidental releases \n\nand has "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000067783,
      "SummaryText": "had an excellent record of preventing accidental releases over the last five years.  \n\nDue to our stringent release prevention policies, there has been no accidental release \n\nduring this period.\n\n\n\n6. Emergency Response\n\n\n\nIn the event of an accidental release of chlorine, we at the Scottsboro Water, \n\nSewer& Gas Board have opted not to implement an Emergency Response Program.  \n\nInstead, in accordance with RMP regulations, we have included our facility in the \n\ncommunity emergency response plan and have the appropriate procedures in place to \n\nnotify emergency responders when there is a need to respond.\n\n\n\n7. Planned Changes to Improve Safety\n\n\n\nAs a result of preparing this Risk Management Plan, our facility will take the \n\nextra step to ensure all employees continually receive the appropriate training required \n\nto safely operate the chlorination system.  In addition, we will continue to install more \n\nlabels on the chlorination equipment to make each component more easily identifiable for the \n\noperator and emergency responders.\n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n"
    }
  ]
}