{
  "FacilityID": 1000056258,
  "FacilityName": "Quadren Cryogenic Processing Ltd",
  "FacilityStr1": "2490 Kirkville Rd",
  "FacilityStr2": "PO Box 272",
  "FacilityCity": "Robbins",
  "FacilityState": "CA",
  "FacilityZipCode": "95676",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06101",
  "LEPC": "Region III LEPC",
  "FacilityLatDecDegs": "38.908267",
  "FacilityLongDecDegs": "-121.662494",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "quadren@aol.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Steve Tomlinson",
  "OperatorStr1": "2490 Kirkville Road",
  "OperatorStr2": null,
  "OperatorCity": "Robbins",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95676",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Plant Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000216312",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-03-08 00:00:00",
  "SafetyInspectionBy": "County Environmental Agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-03-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-03-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-03-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-03-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000070266,
      "AltID": "LNG Packaging",
      "FacilityID": 1000056258,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000071468,
          "ProcessID": 1000070266,
          "NAICSCode": "22121",
          "_desc": {
            "NAICS_CODE": "22121",
            "NAICS_DESCRIPTION": "Natural Gas Distribution"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000086833,
          "ProcessID": 1000070266,
          "ChemicalID": 93,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000586833,
          "ProcessID": 1000070266,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056258,
      "SummaryText": "Quadren Cryogenic Processing Ltd (Quadren) has been requested by the cognizant Administering Agency, Sutter County Environmental Health Services, to prepare a Risk Management Plan (RMP) for its liquid natural gas (LNG) repackaging process containing LNG and gaseous methane, a Regulated Substance (RS). This request was made pursuant to California Health & Safety Code (H&SC) Division 20, Chapter 6.95, Article 2, Section 25534(b)(1) and California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5, California Accidental Release Prevention Program (CalARP). The threshold values for LNG / methane are identical for both Federal and California regulatory requirements.  This facility is also required to institute a Risk Management Program as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68.\n\n\n\nThe RMP submitted to Federal and State regulatory authorities reflects its classification of this stationary source to Program 1 requirements. \n\n\n\nAccidental Release Prevention and Emergency Response Policies \n\n\n\nIt is the policy of Quadren that the receipt, storage and handling of LNG at its facility be done in a manner which meets regulatory requirements and minimizes the probability and severity of releases of liquid and gaseous methane to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment. In order to accomplish this goal, Quadren has gathered safety information on LNG and on the covered process, equipment and procedures involving LNG and methane; performed a structured assessment of hazards of the process and external events which might affect the process; performed an offsite consequences analysis of defined release scenario; established a written program for prevention and mitigation of releases; and established a written emergency response program coordinated with emergency response agencies. Those program elements required under the Federal ARP and CalARP regulations g"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056258,
      "SummaryText": "overning Program 1 RMPs are being maintained in force, and the other policies mentioned herein are being followed as required by the Federal Clean Air Act's General Duty Clause at Sec. 112(r)(1) and Cal / OSHA PSM requirements 8 CCR 5189.\n\n\n\nQuadren has performed a hazard assessment by completing 5 year accidental release information and a worst case release scenario as required by regulation.\n\n\n\nStationary Source and Regulated Substances Handled\n\n\n\nQuadren Cryogenic Processing LTD is located at 2490 Kirkville Rd, Robbins, CA, in Sutter County. The RS used at the Quadren and considered in this RMP is LNG / methane.\n\n\n\nThere are two processes onsite: \n\n?    A methane repackaging process and a methane well purification process.  The methane packaging process receives methane as LNG and repackages it as high purity methane in smaller quantities.  Quadren receives the LNG by DOT regulated tanker truck which is stored in two bulk tanks above threshold quantities.  This process is included in the RMP.\n\n?    There is a process onsite that was built to separate nitrogen from methane and produce the methane onsite.  It is currently unused with no plans to decommission the plant.  There is a tank capable of storing methane from this process that is locked out and not used.  This process is not included in the RMP.\n\n\n\nWorst Case Release Scenario\n\n\n\nLNG and methane are considered to be flammables for RMPs.  The worst case release scenario is defined in the ARP and Cal/ARP regulations as the release of the contents of the largest single container of RS (in this case the tank) into the atmosphere in 10 minutes.  Atmospheric dispersion modeling of this scenario resulted in a flammable endpoint located offsite. The resulting Zone of Vulnerability (0.2 miles) did not include any public receptors.\n\n\n\nFive Year Accident History\n\n\n\nThere have been no accidents involving LNG or methane at this facility within the past five years. \n\n\n\nEmergency Response Program\n\n\n\nQuadren is a non-responding f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056258,
      "SummaryText": "acility for LNG / methane releases. Its Emergency Response Program applicable to LNG consists of notification of the public agency assigned responsibility for First Response to hazardous materials release emergencies, and evacuating persons from affected areas of the site. The Consolidated Contingency Plan portion of the Hazardous Materials Business Plan is used for this purpose. This program has been coordinated with the cognizant emergency planning and response agencies and Robbins Volunteer Fire Department.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nAny measures identified will be thoroughly reviewed and considered for implementation in a timely manner."
    }
  ]
}