{
  "FacilityID": 1000043036,
  "FacilityName": "Bayer HealthCare LLC - Berkeley Site",
  "FacilityStr1": "800 Dwight Way",
  "FacilityStr2": null,
  "FacilityCity": "Berkeley",
  "FacilityState": "CA",
  "FacilityZipCode": "94701",
  "Facility4DigitZipExt": "1986",
  "FacilityCountyFIPS": "06001",
  "LEPC": "City of Berkeley",
  "FacilityLatDecDegs": "37.858361",
  "FacilityLongDecDegs": "-122.295611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bayer.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5068705,
  "ParentCompanyName": "Bayer HealthCare Pharmaceuticals",
  "Company2Name": null,
  "CompanyDUNS": 5068705,
  "Company2DUNS": null,
  "OperatorName": "Bayer HealthCare LLC",
  "OperatorStr1": "800 Dwight Way",
  "OperatorStr2": null,
  "OperatorCity": "Berkeley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94701",
  "OperatorZipCodeExt": "1986",
  "FTE": 1311,
  "OtherEPAFacilityID": "94710CTTRB4THAN",
  "EPAFacilityID": "100000139389",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-12-12 00:00:00",
  "SafetyInspectionBy": "City of Berkeley",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-07-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.858361,
  "FRS_Long": -122.295611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053074,
      "AltID": "NH3 refrigeration process",
      "FacilityID": 1000043036,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064399,
          "ProcessID": 1000053074,
          "ChemicalID": 56,
          "Quantity": 18700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000053829,
          "ProcessID": 1000053074,
          "NAICSCode": "325414",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000044637,
              "Process_NAICS_ID": 1000053829,
              "SafetyReviewDate": "2013-02-22 00:00:00",
              "PHA_Date": "2013-02-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-03-05 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Additional Diffusion Tank High Level Control Installed",
              "OpProceduresReviewDate": "2013-07-30 00:00:00",
              "TrainingReviewDate": "2013-07-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-06-04 00:00:00",
              "EquipmentInspectionDate": "2014-05-29 00:00:00",
              "EquipmentTested": "Cooling towers, ammonia compressors, ammonia scrubber units",
              "ChangeMgmtDate": "2012-12-18 00:00:00",
              "ChangeMgmtReviewDate": "2011-12-16 00:00:00",
              "PreStartupReviewDate": "2011-06-14 00:00:00",
              "ComplianceAuditDate": "2012-12-12 00:00:00",
              "AuditCompletionDate": "2014-09-30 00:00:00",
              "IncidentInvestigationDate": "2010-05-04 00:00:00",
              "InvestigationChangeDate": "2010-06-11 00:00:00",
              "ParticipationPlansReviewDate": "2011-12-28 00:00:00",
              "HotWorkPermitReviewDate": "2010-12-09 00:00:00",
              "ContractorSafetyReviewDate": "2014-04-14 00:00:00",
              "ContractorSafetyEvalDate": "2013-10-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000053687,
                  "PreventionProgram3ID": 1000044637,
                  "ProcessChemicalID": 1000064399
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043036,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-05-01 00:00:00",
    "ERTrainingDate": "2014-05-29 00:00:00",
    "CoordinatingAgencyName": "Berkeley Fire Department",
    "CoordinatingAgencyPhone": "5109813473",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043036,
      "SummaryText": "ase from reoccurring. All reports are retained for a minimum of 5 years.\r\n\r\nEmployee Participation\r\n\r\nBayer HealthCare truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation to the RMP rule in particular information resulting from process hazard analyses.\r\n\r\nContractors\r\n\r\nOn occasion, our company hires contractors to conduct specialized preventive maintenance and/or construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Bayer Corporation has a strict policy of informing the contractors of known potential hazards related the contractor's work and the ammonia refrigeration process. Contractors are also trained in all the appropriate procedures related to emergency response should an accidental release of a regulated substance occur.\r\n\r\nFive-year Accident History\r\n\r\nBayer HealthCare has had an excellent record of preventing accidental releases over the last five years. Due to our stringent release prevention policies, there has been no accidental release during this period.\r\n\r\nEmergency Response Plan \r\n\r\nBayer HealthCare carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\r\n\r\nCit"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043036,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\r\n\r\nWe at Bayer HealthCare are strongly committed to employee, public and environmental safety. This commitment is the basis of having a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release does occur, we are prepared to work closely with the Berkeley Fire Department which provides highly trained emergency response personnel to control and mitigate the effects of the release.\r\n\r\nThe Stationary Source and the Regulated Substances Handled\r\n\r\nOur facility's primary activities encompass biotechnological pharmaceutical manufacturing and research. We have one regulated substance present at our facility, anhydrous ammonia, which is used for process equipment refrigeration. The total quantity of ammonia in the system is approximately 18,700 pounds.\r\n\r\nThe required offsite consequence analysis for our facility was originally performed with the use of EPA's RMP Guidance for Ammonia Refrigeration Reference Tables/Equations, and most recently (06/2014) utilizing EPA's RMP*Comp Software, downloaded from EPA's Website. Distance to Endpoints remained unchanged for both Worst Case & Alternate Case Releases.\r\n\r\nThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps are as follows:\r\n\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. The anhydrous ammonia refrigeration process at our facility is also subject to the California OSHA PSM standard under 8 CCR 5189.\r\n\r\nThe following sections briefly describe the elements of our release prevention program currently in place at our stationary source.\r\n\r\nProcess Safe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043036,
      "SummaryText": "y of Berkeley is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\r\n\r\nRecent Changes to Improve Safety\r\n\r\nSince the last RMP submission in 2009 Bayer has continued to strive to keep all elements of our accidental release prevention program up to date. Additionally, Bayer Berkeley continues to routinely review and update its procedures pertaining to emergency response, including the conducting of refresher training, exercises, and response drills with facility operations personnel, the Site Emergency Response Team, and the Berkeley Fire Department. \r\n\r\nIn March 2014, the ammonia sensors where replaced with units that could more easily be calibrated/tested with a certified concentration of ammonia. \r\n\r\nAdditionally, in early 2014, installation of a Diffusion Tank high level control system was completed to further mitigate against possible filling and overflow of the Diffusion Tank to the storm sewer, impacting the environment by discharging ammonia-contaminated water."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043036,
      "SummaryText": "ty Information\r\n\r\nBayer HealthCare maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with the anhydrous ammonia refrigeration process.\r\n\r\nProcess Hazard Analysis\r\n\r\nOur facility conducts comprehensive studies to ensure that potential hazards associated with the anhydrous ammonia refrigeration process are identified and controlled. The methodology used to carry out these analyses is a Hazard and Operability Study (HAZOP). The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are regularly revalidated every five years. Any findings related to the hazard analysis are addressed in a timely manner.\r\n\r\nOperating Procedures\r\n\r\nFor the purposes of safely conducting activities within our covered process, Bayer HealthCare maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and certified at least every three years, and is readily accessible to operators involved with the processes.\r\n\r\nTraining\r\n\r\nBayer HealthCare has a comprehensive training program in place to ensure that employees that are operating the covered process are completely competent in the operating procedures associated with this process.\r\n\r\nNew employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently. Refresher training is provided at least every year and more frequently as needed. Additionally, All site employees receive Ammonia General Awareness Training, which covers Basic Properties of Ammonia; Building Alarms, Evacuation Procedures, & Community Siren; and Basic First Aid for Exposure.\r\n\r\nMechanical Integrity\t\r\n\r\nBayer HealthCare carr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043036,
      "SummaryText": "ies out highly documented maintenance checks on process equipment to ensure proper functionality. Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\n\r\nWritten procedures are in place at Bayer HealthCare to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel and any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of the changes and offered training to understand and deal with the modification.\r\n\r\nPre-startup Safety Reviews\r\n\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a requirement at Bayer HealthCare. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures and operator training are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\n\r\nBayer HealthCare conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and timely manner.\r\n\r\nIncident Investigation\r\n\r\nBayer HealthCare promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the rele"
    }
  ]
}