{
  "FacilityID": 1000084083,
  "FacilityName": "South Treatment Plant",
  "FacilityStr1": "1200 Monster Rd. SW",
  "FacilityStr2": "Mail Stop:  STP-NR-0100",
  "FacilityCity": "Renton",
  "FacilityState": "WA",
  "FacilityZipCode": "98055",
  "Facility4DigitZipExt": "2962",
  "FacilityCountyFIPS": "53033",
  "LEPC": "King County LEPC",
  "FacilityLatDecDegs": "47.468395",
  "FacilityLongDecDegs": "-122.234423",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://dnr-web.metrokc.gov",
  "FacilityEmailAddress": "website.wtd@kingcounty.gov",
  "FacilityDUNS": null,
  "ParentCompanyName": "Wastewater Treatment Division (WTD)",
  "Company2Name": "King County - Dept. of Natural Resources (DNRP)",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Wastewater Treatment Division",
  "OperatorStr1": "201 S. Jackson St.",
  "OperatorStr2": "MS: KSC-NR-0500",
  "OperatorCity": "Seattle",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98104",
  "OperatorZipCodeExt": "3854",
  "FTE": 117,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000144756",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "28503",
  "SafetyInspectionDate": "2024-06-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-12-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-12-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-12-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-12-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 47.469196,
  "FRS_Long": -122.238935,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000104990,
      "AltID": "Digester Gas - Wastewater",
      "FacilityID": 1000084083,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131472,
          "ProcessID": 1000104990,
          "ChemicalID": 155,
          "Quantity": 27519.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000115685,
              "ProcessChemicalID": 1000131472,
              "ChemicalID": 93
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000106343,
          "ProcessID": 1000104990,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000088977,
              "Process_NAICS_ID": 1000106343,
              "SafetyReviewDate": "2024-04-17 00:00:00",
              "PHA_Date": "2024-09-13 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2025-07-25 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Structural Failure & Abnormal Biological Process Condition/ Treatment Process Upset",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Ovation - Process Supervisory Control System, LEL Detection & Alarms",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Process Systems Drains, Pressure Relief Devices & Overflow Protection",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Fixed & Portable Atmospheric LEL Meters & Alarms, Ovation - Process Supervisory Control System",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Enhanced Plant Physical Security Protocols, Ovation - Process Supervisory Control System, Additional LEL Detection & Alarms, and conversion to IBM Maximo CMMS",
              "OpProceduresReviewDate": "2024-11-18 00:00:00",
              "TrainingReviewDate": "2024-09-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "WEIS Online PowerPoint and Practical Performance Demonstration of O&M Process Area Checklist",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Technical Training O-J-T Review of O&M Process Area Checklist Performance",
              "MaintenanceReviewDate": "2024-10-29 00:00:00",
              "EquipmentInspectionDate": "2024-11-20 00:00:00",
              "EquipmentTested": "LEL Detection System & Digester Gas Compressor Equipment - See Mainsaver System",
              "ChangeMgmtDate": "2024-10-01 00:00:00",
              "ChangeMgmtReviewDate": "2024-10-17 00:00:00",
              "PreStartupReviewDate": "2024-11-21 00:00:00",
              "ComplianceAuditDate": "2023-11-13 00:00:00",
              "AuditCompletionDate": "2025-05-13 00:00:00",
              "IncidentInvestigationDate": "2024-11-05 00:00:00",
              "InvestigationChangeDate": "2024-11-29 00:00:00",
              "ParticipationPlansReviewDate": "2024-08-15 00:00:00",
              "HotWorkPermitReviewDate": "2024-11-14 00:00:00",
              "ContractorSafetyReviewDate": "2024-12-05 00:00:00",
              "ContractorSafetyEvalDate": "2024-12-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000110756,
                  "PreventionProgram3ID": 1000088977,
                  "ProcessChemicalID": 1000131472
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000084083,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-02-16 00:00:00",
    "ERTrainingDate": "2024-10-15 00:00:00",
    "CoordinatingAgencyName": "Renton Fire Dept. & KC Zone 3",
    "CoordinatingAgencyPhone": "4254307000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "WA-Dept of Labor & Industries-DOSH/WISHA and WA-Dept of Ecology Regulations",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084083,
      "SummaryText": "KING COUNTY\nDEPARTMENT OF NATURAL RESOURCES & PARKS (DNRP)\nWASTEWATER TREATMENT DIVISION (WTD)\nSOUTH TREATMENT PLANT (STP)\nEPA RISK MANAGEMENT PROGRAM (RMP) & PROCESS SAFETY MANAGEMENT (PSM) PROGRAM\n\nEXECUTIVE SUMMARY\nKing County's South Treatment Plant (STP) at Renton, Washington is subject to the requirements stated in Section 112r of the Clean Air Act and 40 CFR Part 68, Chemical Prevention Provisions, known as the Risk Management Program (RMP).  This RMP executive summary and program submittal describes and details the key elements of the STP Risk Management Program (RMP), as well as the associated Process Safety Management (PSM) program elements.  This summary also outlines our existing health and safety programs; our internal management implementation procedures; emergency response procedures; and ongoing actions that are designed to prevent, eliminate or minimize impacts of accidental releases of digester gas to the environment. The STP is proud of its continuous dedication and commitment to ensuring accident prevention, employee safety and process safety, and as a result the STP has had an excellent record in preventing accidents from occurring.\nIn demonstration of the STP's commitment to eliminate or minimize the impacts of potential accidental releases, the STP has in previous years formally discontinued the use of chlorine gas for disinfection and discontinued the use of sulfur dioxide gas for the de-chlorination.  STP fully decommissioned the facilities and equipment associated with the storage and use of chlorine gas and sulfur dioxide gas.  As a result, the STP has converted to the safer use of sodium hypochlorite for disinfection and sodium bisulfite for de-chlorination.\n\n(1) Accidental Release Prevention and Emergency Response Policy:\nThe STP is totally dedicated and committed to ensuring the prevention of any potential for accidental releases of toxic and flammables materials. The STP accidental release prevention program involves a unified approach"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084083,
      "SummaryText": "that integrates proven technology, state of the art equipment, advanced safety training programs, staff training on operation and maintenance practices, project management protocols and tested management system practices. All applicable procedures of the State of Washington Department of Labor & Industries, Department of Ecology and the U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to, including key elements such as employee training, safety systems management, and emergency response procedures. \nAs a result, the STP comprehensively complies with the EPA Risk Management Program under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68, and the State of Washington Department of Labor & Industries - Division of Occupational Safety and Health - Process Safety Management of Highly Hazardous Chemicals Program under Washington Administrative Code (WAC) 296-67.\n(2) Description of Facility and Regulated Substances:\nThe STP is an integrated sewage treatment facility that provides both primary and secondary treatment of domestic and industrial wastewater prior to discharge to Puget Sound.  The 88-acre site takes in wastewater from 21 pump stations on the east and south sides of Lake Washington, an area of about 140 square miles.  The plant capacity is approximately 70 million gallons of sewage per day.  The treatment plant processes an average of 115 million gallons per day (mgd) wet weather flow and can handle an instantaneous maximum flow of approx. 325 mgd.  Sodium Hypochlorite (a non-covered chemical) disinfects all the wastewater following treatment before being pumped to Puget Sound.  The digester gas results from the anaerobic biological waste treatment in the secondary treatment system.  The methane from the digester gas is primarily compressed and sold to a commercial gas pipeline system (Puget Sound Energy) for use as domestic natural gas and is also used onsite to fuel a cogenerati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084083,
      "SummaryText": "on and fuel cell facility.  The STP is rated as a US-EPA and WA-DOE Class IV treatment plant.\nThe liquid treatment process includes screening, grit removal, primary clarification, secondary clarification, sodium hypochlorite disinfection, and sodium bisulfite de-chlorination. The disinfected effluent is conveyed through the Effluent Transfer System (ETS) and discharges to Puget Sound through a multi-port diffuser located offshore in deep marine waters. \nAs for solids treatment, the primary and waste activated solids are blended in a tank and thickened. The thickened sludge is anaerobically digested in a system of digesters and dewatered by centrifuges. The plant produces biosolids used in agriculture and forestry, reclaimed water used for in-plant processes and irrigation. Digester gas (methane) is also produced, and this gas is primarily compressed and sold to a commercial pipeline for use as domestic natural gas and is also occasionally used onsite to fuel a cogeneration facility.\n\nThe facility complies with all applicable regulations and good engineering practices in the operation of only one process that has a greater than threshold quantity of hazardous chemical (methane/ flammable mixture) as defined in the RMP requirements. This process is the wastewater digester gas (methane/ flammable mixture) system. It is the policy of King County to meet and/or exceed all applicable federal, state, and local laws in the operation of all processes, and to design and operate the systems in accordance with the best industry standards to protect workers, visitors, and the public. \nThe STP digester gas was previously considered a system that was eligible for the exclusive fuel exemption, as the digester gas is used exclusively as a fuel for onsite processes or sold to a commercial gas pipeline system (Puget Sound Energy).\nHowever, a joint assessment and interpretation ruling by EPA Region 10 and the State of Washington Department of Labor & Industries, interpreted that the di"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084083,
      "SummaryText": "gester gas system's recirculation of digester gas is considered a \"process use\" and therefore is not eligible for exemption from the RMP regulation. \n(3) The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps:\nThe general accidental release prevention program includes the following key program elements;\na)\tRisk Management Plan - comprehensive plan for preventing the accidental release of hazardous chemicals.\nb)\tSTP PSM/ RMP Program Manual -  comprehensive manual to centralize safety information and better ensure existing program elements are being properly implemented at the site. \nc)\tPSM/ RMP Management System - system designed to provide and ensure the consistent implementation of the PSM/RMP program.\nd)\tPSM/RMP Management Committee and Sub-Committees\u0096 the PSM/RMP Management Committee and sub-committees of specific subject matter experts, which meets monthly and/or weekly as needed, to comprehensively address all aspects of the implementation of the PSM/RMP Program\ne)\tPSM/ RMP Hazard Assessment - program designed to ensure the review and analysis of potential worst-case scenarios, alternate-case scenarios, and five year accident history.\nf)\tWTD Employee Safety & Accident Prevention Program - comprehensive program implementing all Safety Management Systems elements directing Safe Work Programs, Policies, Procedures and Training.\ng)\tProcess Safety Information - information pertaining to the process is accurate and up to date.\nh)\tProcess Hazards Analysis - formal technical hazard reviews are conducted and updated.\ni)\tOperating Procedures - written standard operating procedures are in place and up to date.\nj)\tTraining - personnel are formally trained for the technical and safety aspects of the jobs they are to perform.\nk)\tMechanical Integrity - written procedures are in place for inspection, testing and maintenance of equipment.\nl)\tManagement of Change - procedures are in place to review and approve changes to the process.\nm)\tPre-Star"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000084083,
      "SummaryText": "tup Safety Review - a formal procedure is in place to review changes to the process before startup to ensure the highest level of safe work operations.\nn)\tCompliance Audits - periodic comprehensive Program Level 3 reviews of the PSM/ RMP elements for compliance.\no)\tIncident Investigation - incidents with the potential for serious consequences are reviewed by a dedicated team.\np)\tEmployee Participation - all employees are required to participate in all the release prevention program elements.\nq)\tSafe Work Practices (Hot Work Permit) - special permits, protocols, procedures and programs are in place for all Hot Work, Hazardous Energy Control, Electrical Safety, Confined Space Entry and Gas Purging operations.\nr)\tContractor Safety - a formal program is in place for the selection and review of contractors.\ns)\tEmergency Planning, Response & Recovery - program to ensure the establishment and implementation of the necessary emergency action plans for various potential emergency scenarios\n\nIn the event of an accidental PSM/ RMP release, the STP is well practiced and exercised in the implementation of the STP emergency action plans, as well as the notification and coordination with the City of Renton Fire Department, Puget Sound Regional Fire Authority, King County Zone 3 Technical Response Teams, the King County Office of Emergency Management and other applicable emergency response agencies.\n\nChemical-specific prevention steps include staff awareness of the hazardous properties of digester gas, the presence of LEL methane gas detectors, alarms, beacons, pressure relief devices, flame arrestors, Ovation Supervisory Control System warnings and the other redundant safety control systems.\nThe STP accidental release prevention program is based on the following key elements:\na)\tCommitment to safety by the Wastewater Treatment Division and STP management and staff\nb)\tComprehensive process safety information and technical system information that is readily available to staff, emerg"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000084083,
      "SummaryText": "ency responders, and contractors\nc)\tComprehensive corrective and preventive maintenance program\nd)\tRoutine shift checklist and process hazard analysis of equipment and procedures with operation and maintenance staff participation and review\ne)\tUse of state-of-the-art process and safety equipment\nf)\tUse of accurate and effective operating procedures, written with operations and maintenance staff participation\ng)\tHigh level of training of operators and maintenance staff\nh)\tImplementation of an incident investigation, inspection, and auditing programs by highly qualified and experienced staff\ni)\tComprehensive oversight by the PSM/RMP Management Committee and Sub-Committees of specific subject matter experts to address all aspects of the implementation of the PSM/RMP Program\n\n(4) Five-Year Accident History:\nThe South Treatment Plant (STP) has completed the required updated 5-year accident history review and has not had a reportable accident in the last five years that involved deaths, injuries, property damage, environmental damage, evacuations or sheltering in place. Procedures and policies are in place and implemented to properly report, respond, record, investigate and debrief any such future accidents and/or incidents.  As a result, the STP RMP/ PSM Program has maintained an exemplary safety record with no significant accidental releases of regulated substances. Minor equipment incidents and equipment maintenance issues have been promptly addressed with thorough investigations and corrective measures to prevent recurrence.\n\n(5) STP Emergency Response Plan/ Emergency Action Program:\nThe STP emergency response plan and emergency action program has continually evolved and has been routinely updated from successful existing programs to assure worker safety at the facility. It is the policy of the King County Department of Natural Resources and Parks, Wastewater Treatment Division to notify the Renton Fire Department and the Puget Sound Regional Authority/ ER Zone 3 and"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000084083,
      "SummaryText": "request they train, drill and respond to various emergency conditions at the facility. This policy has been discussed, coordinated, and implemented with the fire departments and they are aware of the specific chemicals that exceed threshold quantities.  \n\n(6)Planned Changes to Improve Safety:\nThe STP is constantly striving develop and implement workplace safety improvements for employees, contractors, collection, conveyance and treatment processes, as well as our surrounding community neighbors. Through the continuous implementation of the PSM/ RMP Program, the STP routinely reviews and pursues process  and program changes to improve the safety of the regulated systems, and the facility.  The current safety improvement projects at the STP include the following: \na)\tContinued expansion, development and training of the principles of PSM/ RMP to the current regulated PSM/RMP Systems utilizing national consensus standards, the AIChE Center for Chemical Process Safety,  and all applicable recognized and generally accepted good engineering practices.\nb)\tExpansion and development of the principles of PSM/ RMP to other unregulated wastewater hydraulic system through the new WTD Wastewater Hydraulic Life Safety Management (LSM) Program\nc)\tDatabase updating and formal migration of the legacy MainSaver Computerized Maintenance Management System (CMMS) to an updated MAXIMO CMMS with integrated PSM/ RMP Program elements \nd)\tExpansion of the WTD Safety & Hazardous Materials Program to include new safety and emergency staff positions allowing for increased PSM/RMP time allocation for the STP - Plant Safety Officer.\ne)\tContinued development of onsite Safety & Technical Training capabilities and staff resources\nf)\tEnhanced staff and physical security protocols, barriers, video monitoring systems,  key card access security, and other Physical Security Elements as identified in the ASCE Guidelines for Critical Infrastructure Security for Wastewater Facilities\ng)\tUpgraded SQL database"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000084083,
      "SummaryText": "programming of digital photo enhanced Safe Work Procedures (SWP) including a specific emphasis on Hazardous Energy Control Procedures (HECPs), Confined Space Entry Procedures, Chemical Safety Procedures and PSM/RMP Standard Operating Procedures (SOPs).\nh)\tEnhanced annual review and update of the STP PSM/ RMP Program Manual and the associated employee training \ni)\tEnhanced annual review and update of the STP Emergency Response Plan, associated employee training, Incident Command System training, and emergency response preparedness drills & exercises\nj)\tEnhanced training and response exercise drills with the City of Renton Fire Department, King County Zone 3 Hazardous Material Response, Puget Sound Regional Fire & Emergency Response Authority and King County Office of Emergency Management\nk)\tEnhanced update and revision of STP Operations and Maintenance (O&M) Manuals, O&M Training and the associated employee safety emergency response training \n(7) In Conclusion\nKing County's South Treatment Plant (STP) demonstrates unwavering commitment to the highest standards of safety, operational integrity, and regulatory compliance, as evidenced by its comprehensive Risk Management Program (RMP) and associated Process Safety Management (PSM) elements. Through robust accidental release prevention and emergency response protocols, meticulous handling of regulated substances, and continuous safety enhancements, the STP ensures the protection of its employees, the community, and the environment.\nThe STP\u0092s exemplary five-year accident history, proactive emergency response strategies, and recent transition to safer chemical alternatives underscore its dedication to mitigating risks and enhancing safety. Moving forward, the STP remains focused on implementing advanced safety measures, upgrading critical equipment, and fostering a culture of continuous improvement to safeguard against accidental releases and uphold the integrity of its operations.\nBy adhering to these principles and prac"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000084083,
      "SummaryText": "tices, the STP not only meets but exceeds regulatory requirements, setting a benchmark for excellence in process safety management and environmental protection."
    }
  ]
}