{
  "FacilityID": 1000050785,
  "FacilityName": "Martha Ann Simpson Water Treatment Plant",
  "FacilityStr1": "29528 FM 510",
  "FacilityStr2": null,
  "FacilityCity": "San Benito",
  "FacilityState": "TX",
  "FacilityZipCode": "78586",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48061",
  "LEPC": "Cameron County LEPC",
  "FacilityLatDecDegs": "26.137036",
  "FacilityLongDecDegs": "-097.549789",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.erhwsc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 96386610,
  "ParentCompanyName": "East Rio Hondo Water Supply Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "East Rio Hondo Water Supply Corp.",
  "OperatorStr1": "206 Industrial Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Rio Hondo",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78583",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Macmanus",
  "RMPTitle": "General Manager",
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000212673",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-04-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-12-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-12-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-12-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-12-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064040,
      "AltID": "Water Treatment Plant",
      "FacilityID": 1000050785,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000065182,
          "ProcessID": 1000064040,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000079245,
          "ProcessID": 1000064040,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000579245,
          "ProcessID": 1000064040,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050785,
      "SummaryText": "A. The East Rio Hondo Water Supply Corporation (ERHWSC) Accidental Release Prevention Policy involves a unified approach that integrates technologies, procedures, and management practices. All applicable procedures of the U.S. Environmental Protection Agency (EPA) Preventive Program are adhered to this program.  The ERHWSC Emergency Response Policy involves the preparation of the response plan which is tailored to the facility and to the emergency response services available to the rural community, and is in compliance with the EPA Emergency Response Program requirements. \n\n \n\nB. The ERHWSC plant was installed to coagulate, settle, filter, and chlorinate water for use by its members. The facility is located at 29528 FM 510 San Benito, TX 78586. The plant utilizes a chlorinating station, various electrical panels and safety equipment. The amount of chlorine that will be on site will be 6-one ton containers, with three on-line & three on stand-by. Water treatment operators will be at the facility 24 hours per day and 7 days a week and will respond to any trouble alarms that may occur. \n\n\n\nC. The off-site consequences analysis includes consideration of two release scenarios, identified as \"worst case release\" and \"alternative release scenerio\". The first scenerio follows EPA guidelines which states, \"The owner or operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutes\" due to unspecified failure.  The alternative release scenerio is defined as \"more likely to occur\" than the worst-case scenerio.  Atmoshperic dispersion modeling has to be performed to determine the distance traveled by the chlorine release before its concentration decreases to the \"toxic end-point\" selected by the EPA at .0087 mg/L, which is the Emergency Response Planning Guidline Level (ERPG-2). This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that all individuals c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050785,
      "SummaryText": "ould be exposed for up to one hour without experiencing or developing irreversable or other serious health effects or symptoms which could impair an individual's ability to take protective action\". The residential population within a circle with a radius corresponding to the endpoint distance has to be defined as \"to estimate the population potentially effected\". The worst-case release scenerio at the ERHWSC facility involves a failed valve or a rupture of the actual body of the one ton container. The off-site consequence analysis for this scenerio was performed. The predefined conditions set by EPA, namely the release of the entire amount as a gas in 10 minutes, use of the one hour average ERP-2 as the toxic end point, and the consideration of the population residing within a full circle with a radius corresponding to the endpoint distance. EPA-mandated meteorological conditions, namely Stability F, wind speed of 1.5 m/sec., air temperature @ 77F, and average humidity of 50% were used. When atmospheric dispersion modeling for the worst-case scenario as performed using the EPA RMP*Comp, a distance to toxic endpoint of 2.2 miles and an estimate of residential population of 2,536 was obtained.  The alternative release scenario involves the rupture of the vacuum regulator connected to the one ton container due to clogged vent holes or seperation of the vacuum regulator from the chlorine ton container valve stem. Estimated distance to toxic endpoint of 0.3 miles was calculated by the RMP*Comp Ver. 1.07. The atmospheric dispersion radius of 0.3 miles will be used as a safegaurd. The amount of chlorine released is 2000 lbs. at an average  rate of over 40 minutes (the duration of the release) at 50 lbs/min to the toxic endpoint distance of the ERPG-2 Level.\n\n\n\n D. The general ERHWSC accidental release prevention program is based on the following key elements: a.) High level of training of the operators b.) Preventive maintenance program c.) Use of state-of-the-art process "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050785,
      "SummaryText": "and safety equipment d.)Use of accurate and effective operating procedures e.)Perform hazard review of equipment and procedures f.)Implementaion of a chemical audit and inspection program. Chemical-specific prevention steps include availability of combined breathing apparatus (CBA) worn by the operators during connection/disconnection of chlorine supply, awareness of the hazardous and toxic properties of chlorine, and automatic plant shutdown due to lack of chemicals injection in the operation process of the plant.\n\n\n\nE. No accidental releases of chlorine have occurred at ERHWSC in the past five years.\n\n\n\nF. The ERHWSC has an Emergency Response Plan that has been reviewed by the Local Emergency Planning Committee (LEPC). This program includes an emergency response decision tree and a notification plan Emergency response drill and drill evaluations will be conducted every five years; emergency operations and response procedures will be reviewed at that time.\n\n\n\nG. Changes to improve safety (recommended actions) will be reviewed upon completion of a ERHWSC Hazard Assessment and Compliance Audit on an annual basis.  "
    }
  ]
}