{
  "FacilityID": 1000074080,
  "FacilityName": "6th Street Cooling, LLC",
  "FacilityStr1": "521 Olive Avenue",
  "FacilityStr2": "P.O. Box 808",
  "FacilityCity": "Holtville",
  "FacilityState": "CA",
  "FacilityZipCode": "92250",
  "Facility4DigitZipExt": "0808",
  "FacilityCountyFIPS": "06025",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.811802",
  "FacilityLongDecDegs": "-115.385385",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 112446146,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "6th Street Cooling, LLC",
  "OperatorStr1": "P.O. Box 808",
  "OperatorStr2": null,
  "OperatorCity": "Holtville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92250",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tomas Armenta",
  "RMPTitle": "General Manager",
  "FTE": 54,
  "OtherEPAFacilityID": "CAL000209616",
  "EPAFacilityID": "100000185211",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-06-11 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "RMP Update 2009",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-11-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-11-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.813,
  "FRS_Long": -115.388,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092337,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000074080,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093599,
          "ProcessID": 1000092337,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115527,
          "ProcessID": 1000092337,
          "ChemicalID": 56,
          "Quantity": 42148.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000615527,
          "ProcessID": 1000092337,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000074080,
      "SummaryText": "1 EXECUTIVE SUMMARY\n\nThis is the Executive Summary component of a routine 5-year update of the Risk Management Plan for 6th Street Cooling, LLC (2018).  The facility is subject to the Federal Risk Management Program, Cal/OSHA Process Safety Management Program (PSM) and the California Accidental Release Prevention Program (Cal/ARP) in the Level 3 designation.  The Cal/ARP Program establishes additional state-specific requirements.  Additional state-specific requirements are addressed in an addendum report submitted to the local implementing agency (Department of Toxic Substance Control/Imperial County Certified Unified Program Agency a.k.a. Imperial DTSC CUPA).  \n\n\n\nThe Southern California Cal/OSHA PSM Unit, Imperial CUPA Agency and USEPA Region IX have inspected the facility.  The Holtville Fire Department periodically visits the facility to assure effective emergency response preparation & coordination.  6th Street Cooling strives to maintain good working relationships with these oversight agencies.  \n\n\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe 6th Street Cooling Accidental Release Prevention and Emergency Response Policies are simply not to have accidental releases or emergencies. The Company endeavors to execute this policy through the daily implementation of its Safety Programs. The Company safety program includes but is not limited to a comprehensive Process Safety Management Program (PSM). The PSM Program is an integrated approach to the safe operation of processes using Regulated Substances and forms the Program Level 3 Prevention Program component of the RMP.  The PSM Program is specifically designed and intended to prevent accidental releases, and to deal safely with emergencies if and when they do happen.  It is the primary goal of 6th Street Cooling to protect its employees, visitors and neighbors from harm due to Company operations. With this in mind, the priorities of protection of life, the environment, and then property"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000074080,
      "SummaryText": " have been established.  Only when these goals are achieved may the focus shift to resumption of business operations.\n\n\n\n6th Street Cooling has adopted a \"non-responding facility\" policy but recognizes the need to be prepared for an emergency.  A California Hazardous Material Business Plan has been developed and submitted to the local Certified Unified Program Agency; with a copy provided to the Holtville Fire Department.  The Plan is consistent with Emergency Action Plan requirements and includes written regulatory release or threatened release notification requirements.  The Business Plan includes the Hazardous Material Inventory consistent with EPCRA compliance in California, and the information necessary to be included in the Area Emergency Plan.  An Emergency Coordinator has been established.   Emergency response pre-planning is coordinated and kept current through the annual submittal of appropriate reports; and relationships with the aforementioned Holtville City Fire & DTSC/CUPA.  The Fire Department has attended past Process Hazard Analysis (PHA) which provides a comprehensive Overview of the Process.  Local response capabilities have been verified.  6th Street Cooling policy includes maintaining appropriate technical capabilities and to deal with releases safely & properly if and when they happen.  The policy is to support Public Responders with appropriate technical resources in the event of an ammonia emergency.\n\n\n\n1.2 General Description of the Stationary Source and Regulated Substances\n\n\n\n6th Street Cooling, LLC is a California Limited Liability (LLC) Company made up of Western Precooling Systems - 50% and Saikhon Family LLC - 50%.  The 6th Street Cooling, LLC is responsible for operations at the site.\n\n\n\n6th Street Cooling is a seasonally operated fresh produce refrigeration plant located on the southeast side of Holtville, CA.  Harvest & cooling periods normally begin in early November and conclude in late June each year.  The facility provides refri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000074080,
      "SummaryText": "geration effect for the removal of field heat from freshly harvested produce (precooling) and subsequent short-term refrigerated storage until the produce is shipped.  The Plant's stationary refrigeration system is supported with portable refrigeration equipment during peak periods.  General maintenance is year-round, with major maintenance occurring in the off-season summer months.\n\n\n\nThe Regulated Substance in use is anhydrous ammonia (NH3).  Refrigeration equipment consists of Pressure Vessels, HydroVac&trade; Vacuum Tubes, Stationary and Portable Compressing Units, Ice-making equipment, Pressure Cooling Equipment, Cold Storage Room Evaporators and associated valves, instrumentation and piping.  \n\n\n\nVacuum tubes and Pressure Coolers are used to pre-cool agricultural product; the refrigerated storage portion of the facility is used for short-term product storage.  Evaporators (Room Units) in the storage sections of the facility maintain temperature until product is sold and shipped.  The refrigeration system is configured in a closed-loop system with isolation and overpressure relief valves installed in key areas. An ammonia-water diffusion system protects against accidental releases from High-Side Pressure Relief Valves. Refrigerated storage space is monitored with ammonia sensors and an automated alarm system.  \n\n\n\n6th Street Cooling, LLC is supported by an affiliate company, Western Precooling Systems (WPS) a stakeholder in the operation.  WPS is a statewide and well-known provider of ammonia refrigeration equipment and maintenance services.  WPS supports 6th Street Cooling, LLC from its Yuma Operations Office.  Key WPS employees are 1910.120(q) trained and are an additional resource in the event of an emergency. \n\n   \n\n1.3 General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n\n\nAccidental Release Prevention Program\n\n\n\nA comprehensive Process Safety Management Program (PSM) has been established in accordance with CCR 8, 5189, and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000074080,
      "SummaryText": " makes up the Level 3 Prevention Program component of the RMP.  The PSM Program is specifically intended to promote the safe operation of ammonia-handling equipment and process, and to prevent accidental releases.  6th Street Cooling, LLC strives to make the PSM Program an integral part of daily Plant operation.  Other safety programs are integrated with the PSM Program, to the extent practicable and appropriate.  The written PSM document is maintained in the site's RMP binder and/or electronically via the \"Web-Based Business Manager\" (WBBM); which is an online RMP/PSM/Cal-ARP management solution.\n\n\n\nChemical-Specific Prevention Steps\n\n\n\nOver the years it had become apparent in the industry that a mishap while draining oil from the system was historically one of the most common incidents to occur.  Special self-closing valves are now installed as a permissive for oil drain flow in order to mitigate this issue.  If a release were to develop during an oil-draining task, the mechanic simply releases the handle of the self-closing valve and flow is terminated.  The facility has installed these types of valves at the designated oil drain points.  Other release prevention measures include:\n\n\n\n-    Entrance to the facility is closely controlled & monitored\n\n-    A sign-in / sign-out program is established; only authorized personnel are allowed access to process areas\n\n-    The facility is enclosed with fencing & gates and configured to discourage access by un-authorized personnel\n\n-    Employees are trained for hazard communication (discovery and communicating) for releases, fires, vandals, etc.  Training is documented in each employees training record file. \n\n-    Personnel are trained in the benefits of good housekeeping.  There is a staff to maintain the general appearance of the facility on a day-to-day basis, and limit the accumulation of combustible detritus.\n\n-    Only qualified personnel operate or perform work on the process\n\n-    The facility is manned while in operation  \n\n-    Appropr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000074080,
      "SummaryText": "iate automatic safety cut-outs are installed on process equipment\n\n-    Safety cut-outs are regularly inspected and tested\n\n-    Diffusion tanks systems (3) prevent accidental Pressure Relief Valve lifts from releasing directly to the atmosphere (ammonia would be absorbed in water).\n\n-    Pressure Relief Valves are on a 5-Year replacement schedule  \n\n-    Traffic Patterns, Barriers and Equipment Placement have been evaluated and established to prevent vehicular collisions\n\n-    Seismic retrofits and bracing are installed \n\n-    Off-season ammonia storage is protected with an automated evaporative cooling system (reduces pressure during sustained seasonal hot spells)\n\n\n\n1.4 Five-Year Accident History\n\n\n\nThere is no data to report.  \n\n\n\n1.5 The Emergency Response Program\n\n\n\nThe Emergency Response Program is divided into two elements, as only properly trained and qualified personnel are authorized to respond to emergencies.  Personnel that are not trained to OSHA 1910.120 (q) standards are required to notify and evacuate.  Only the responding Fire Department(s) and 6th Street Cooling's 1910.120 (q) trained personnel would respond to an actual emergency.  PPE for 6th Street personnel is maintained on-site.  \n\n\n\nThe facility maintains required written emergency planning documents.  Written emergency action procedures are detailed in the 6th Street Cooling Hazardous Material Business Plan.  The Hazardous Material Business Plan contains procedures for small spills and procedures for materials other than ammonia.  The Plan is maintained on-site and updated on a regular basis.\n\n  \n\n1.6   Planned changes to improve safety \n\n\n\nThe primary mechanisms to identify and plan safety improvements include (but are not limited to):\n\n-    Process Hazard Analysis update;\n\n-    Compliance Audits;\n\n-    Mechanical Integrity Program maintenance and inspections;\n\n-    IIAR Bulletin 109 Inspections; and\n\n-    6th Street Cooling, LLC & WPS Equipment Inspection Protocols\n\n\n\nEach of the Programs above may result in recommendati"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000074080,
      "SummaryText": "ons ranging from capital improvements to routine maintenance of the plant.  Work Orders/Service Calls are established in parallel to identified needs; employee time cards track day-to-day activities. Changes in the past 5 years include safety improvements via an electrical upgrade, installation of an additional Suction Accumulator, and upgrades to the ammonia sensor and monitoring system.  These changes did not introduce additional hazards, increased risk or result in more ammonia.  \n\n\n\nCurrent planned changes to improve safety are a result of the latest 7/10/2018 Process Hazard Analysis (PHA).  A summary is provided below; a detailed schedule is kept on-site.  The improvements were expected to be completed by 1/11/2019:\n\n\n\n-    Administrative and documentation improvements;\n\n-    Re-check and re-secure water supply points;\n\n-    Minor mechanical improvements and off-season maintenance considerations;\n\n-    Continued management awareness regarding Human Error potentials;\n\n-    Continued portable equipment placement awareness including barrier placement for equipment and piping protection.\n\n\n\n\n\nEnd of Executive Summary\n\n"
    }
  ]
}