{
  "FacilityID": 1000066557,
  "FacilityName": "Woodbridge Alabama LP",
  "FacilityStr1": "5549 Endeavor Way",
  "FacilityStr2": null,
  "FacilityCity": "Tanner",
  "FacilityState": "AL",
  "FacilityZipCode": "35761",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01083",
  "LEPC": "Limestone County LEPC",
  "FacilityLatDecDegs": "34.6359",
  "FacilityLongDecDegs": "-86.870227",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.woodbridgegroup.com",
  "FacilityEmailAddress": "info@woodbridgegroup.com",
  "FacilityDUNS": 173702150,
  "ParentCompanyName": "The Woodbridge Group",
  "Company2Name": null,
  "CompanyDUNS": 173702150,
  "Company2DUNS": null,
  "OperatorName": "The Woodbridge Group AL, LP",
  "OperatorStr1": "5549 Endeavor Way",
  "OperatorStr2": null,
  "OperatorCity": "Tanner",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35671",
  "OperatorZipCodeExt": null,
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000236997",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-10-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-10-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-10-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-10-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-10-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 34.63263,
  "FRS_Long": -86.89753,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000083433,
      "AltID": "Production of foam",
      "FacilityID": 1000066557,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000103861,
          "ProcessID": 1000083433,
          "ChemicalID": 44,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000084636,
          "ProcessID": 1000083433,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000052210,
              "Process_NAICS_ID": 1000084636,
              "SafetyReviewDate": "2017-10-04 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2017-10-04 00:00:00",
              "ChangeCompletionDate": "2017-10-18 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Isocynate monitors to detect any leaks greater than .005 ppm",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-05-01 00:00:00",
              "TrainingReviewDate": "2017-09-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-10-16 00:00:00",
              "EquipmentInspectionDate": "2017-10-20 00:00:00",
              "EquipmentTested": "Process safety valves, switches, flow meters, Isocynate alarms &  overfill sensors",
              "ComplianceAuditDate": "2017-08-30 00:00:00",
              "AuditCompletionDate": "2017-09-25 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000052895,
                  "PreventionProgram2ID": 1000052210,
                  "ProcessChemicalID": 1000103861
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000066557,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-05-30 00:00:00",
    "ERTrainingDate": "2017-10-23 00:00:00",
    "CoordinatingAgencyName": "Huntsville AL LEPC & Fire Deptartme",
    "CoordinatingAgencyPhone": "2567227120",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Alabama Department of Environmental Management Land Division - Hazardous Waste Program",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000066557,
      "SummaryText": "WOODBRIDGE AL, LP RISK MANAGEMENT PROGRAM\r\n\r\nThis document contains a description of the RMP program at Woodbridge AL, LP, Tanner, AL  facility.  The following sections describe in detail the facilities approach in developing the RMP program and the following:\r\n\r\n1. THE STATIONARY SOURCE AND REGULATED CHEMICALS HANDLED-A summary of the toxic substance handled, toluene diisocyanate (TDI), in excess of the threshold quantities listed in the RMP regulations.\r\n2. IMPLEMENTATIONA Management Program for implementing the RMP program\r\n3. OFF-SITE CONSEQUENCE ANALYSIS SCENARIOS-Worst-case and alternative release scenarios analyzed for TDI \r\n4. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS-Prevention Program\r\n5. FIVE YEAR ACCIDENT HISTORY Emergency Response Program\r\n6. PLANNED CHANGES TO IMPROVE SAFETY-On going review of the RMP program\r\n\r\n\r\nAPPLICABILITY\r\nThe facility has inventoried all chemicals stored or handled at the facility and determined that only TDI is subject to the RMP regulations.  To accomplish this task the maximum inventory of TDI onsite was compared to the threshold quantities listed in the RMP regulations.  Upon review of the facility operations it was determined that the entire facility is considered one process.   \r\n\r\n1. THE STATIONARY SOURCE AND REGULATED CHEMICALS HANDLED\r\n\r\nThe primary purpose of the Tanner, Alabama Foam Plant is to produce polyurethane foam seat cushions for the automotive industry.  The foam is made by high pressure mixing of chemicals as they are poured into a mold that is attached by carrier to a continuously moving line.  The mold then moves through a curing oven.  Upon exiting the oven, the foam pads are removed from the mold, vacuum or mechanically crushed, trimmed, and prepared for shipment to customers.\r\n\r\nToluene Diisocyanate (TDI), which is regulated by EPA's risk management program rule, is one of the reactants required to manufacture polyurethane foam.  TDI is received at the plant by"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000066557,
      "SummaryText": "railcar and tanker truck, and is stored in 2 tanks located in the contained bulk storage tank room.  The TDI is then transferred to the process utilizing a computer-controlled system.\r\n\r\nAccess to the site is restricted to authorized facility employees, management personnel, and contractors.  \r\nIt is our policy to:\r\n\r\nComply with all applicable laws, regulations, and standards. review and assess our operations for the purpose of making health, safety, & environmental improvements.\r\n\r\nOur complete Health, Safety, & Environmental policy statement, signed by our Plant Manager, is posted in the lobby of our facility.\r\n\r\n2.IMPLEMENTATION.We use a combination of prevention programs and emergency response planning, to help ensure the safety of our employees, the public, and to ensure protection of the environment.  Our Plant Manager has the overall responsibility for ensuring that our facility operates in a safe and reliable manner.  This responsibility includes overseeing the implementation of the elements of our risk management program.  To ensure that our risk management program is appropriately developed and implemented, our Plant Engineering Manager has assigned the role of RMP Coordinator to a staff member with the background, training, and experience necessary to manage the program.  The RMP Coordinator, acting with the authority delegated directly from the Plant Manager, is responsible for coordinating the development, implementation and integration of the RMP elements as is required under Section 68.15 of the RMP rule.  \r\n\r\nGENERAL DUTY\r\nSection 112 (r)(l) of the CAA requires that \"owners and operators of stationary sources producing, processing, handling, or storing...(substances regulated by this rule) or any other extremely hazardous substance, have a general duty to identify hazards which may result from... releases using appropriate assessment techniques, to design and maintain a safe facility taking such measures as are necessary to prevent releases and to m"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000066557,
      "SummaryText": "inimize the consequences of accidental releases which do occur.\"  In accordance with Section 112 (r)(l) of the CAA, the facility is committed to designing and maintaining a safe facility.  The facility will take steps as are necessary to prevent the accidental release and minimizing the consequences of any such release of any regulated substances defined in 29 CFR, Part 68 or any other extremely hazardous substance.\r\n\r\n3. OFF-SITE CONSEQUENCE ANALYSIS SCENARIOS\r\n\r\nEPA's RMP rule requires that we provide information about the worst-case release and alternative release scenarios for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario.\r\n\r\nThe methodology used to determine the distance to the toxic endpoint as established by the RMP rule was EPA's RMP Comp.\r\n\r\nWORST-CASE Release Scenario:\r\n\r\nCatastrophic failure of a truck tanker full of TDI at the unloading site; discharging a significant amount of its entire contents of 92,396 pounds in 60 minutes; using the ALOHA model.  \r\n\r\nThe facility used the ALOHA model and guidance contained in the RMP Offsite Consequence Analysis Guidance document to determine the distance to the toxic endpoint for each worst-case release scenario.  For the worst-case scenario, the maximum temperature in the past three years for the area was 100 degrees with 50% RH.\r\n\r\nIt is assumed that the maximum temperature the TDI could reach during an unload is 100 degrees F.  There is containment at the truck tanker unloading site. The chemical escaped as a liquid and formed an evaporating puddle. The puddle spread to a diameter of 6.5 yards Max Average Sustained Release Rate: 0.00948 pounds/min (averaged over a minute or more). The total Amount Released: 0.57 pounds.\r\n\r\nNote: The chemical escaped as a liquid and formed an evaporating puddle.\r\n \r\n\r\nThe distance to the endpoint concentration of 0.02 mg/L i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000066557,
      "SummaryText": "s 0.12 miles, or 209 yards.  There are no residences within this boundary.\r\n\r\nALTERNATIVE Release Scenario:\r\n\r\nWhile off-loading, from a tanker truck, a 2 inch hose ruptures length triggering a release of TDI.  Excess flow valves function to stop the flow, and only the contents of the hose are released.  The resulting liquid forms a puddle diameter of 10 feet with a volume of 20 gallons which evaporates to form a toxic cloud that disperses downwind.  The distance to the endpoint concentration of 0.02 mg/L is 0.03 miles or 48 yards.  This release should not leave the facility boundary. \r\n\r\n4.THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS\r\n\r\nWe take a systematic, proactive approach to preventing accidental releases of chemicals.  Our management systems for our TDI process address each of the key features of successful prevention programs including:\r\n\r\n-Contractor Awareness\r\n-Hot Work Permitting\r\n-Monthly Workplace Inspection by members of the JHS&C Team\r\n-Safety Information\r\n-Hazard Reviews of our Processes\r\n-Operating Procedures\r\n-Training\r\n-Equipment Maintenance Programs\r\n-RMP Compliance Audits\r\n-Accident/Incident Investigation\r\n-Start-up reviews\r\n-Risk assessments for new equipment installations\r\n\r\nIn addition, we have an established Isocyanate Control Program that outlines both the hazards of handling Toluene Diisocyanate and the controls that are in place to reduce those hazards.  Controls are in place to reduce exposure to employees, the community, and the environment.\r\n\r\nThese listed individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems are setup for the way we conduct business, and we have specific accountability and controls to ensure that we are meeting our own high standards for accident prevention. \r\n\r\n5. FIVE YEAR ACCIDENT HISTORY\r\n\r\nThe Tanner, Alabama Foam Plant is a new start up a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000066557,
      "SummaryText": "nd has no Five-year history for which a TDI releases could qualify for listing in the EPA's required five-year accident history report.\r\n  \r\nTHE EMERGENCY RESPONSE PLAN\r\n\r\nWe maintain an integrated contingency plan, which consolidates the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides essential planning and training to effectively protect workers, the public, and the environment during emergency situations.  As our LEPC and SEPC are one and the same, we will coordinate our program with the local fire department.  A representative group from the fire department will be requested to be a part of spill exercises and if desired, routine visits to the site to discuss how to respond to a release of TDI.  We have also given local medical service providers information regarding medical treatment for exposure to TDI. Our organization requires we conduct quarterly spill drills to ensure the readiness of our emergency response team.\r\n\r\n6. PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nAt this time the facility is a startup and all of the equipment is new. We will review our operations as required by our current EH&S management systems and scrutinize our systems as we drive continual improvement through operational efficiency, process training and maintenance. We will conduct assessments of the process with our staff of Professional Engineers (PE's), and technical advisors, to ensure we have adequately covered all risk as we gain experience. A robust Preventative Maintenance (PM) program exist that tracks history of each piece of equipment and safety devices, e.g. overfill switches, overflows, actuators, etc."
    }
  ]
}