{
  "FacilityID": 1000042778,
  "FacilityName": "Lawton Valley Water Plant",
  "FacilityStr1": "2154 W Main Rd",
  "FacilityStr2": null,
  "FacilityCity": "Portsmouth",
  "FacilityState": "RI",
  "FacilityZipCode": "02871",
  "Facility4DigitZipExt": "1035",
  "FacilityCountyFIPS": "44005",
  "LEPC": "District 7 LEPC",
  "FacilityLatDecDegs": "41.56442",
  "FacilityLongDecDegs": "-071.28460",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.ci.newport.ri.us/departments/utilities/home.cfm",
  "FacilityEmailAddress": "rschultz@cityofnewport.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Newport",
  "Company2Name": null,
  "CompanyDUNS": 75714626,
  "Company2DUNS": 0,
  "OperatorName": "City of Newport Dept. of Utilities",
  "OperatorStr1": "70 Halsey St",
  "OperatorStr2": null,
  "OperatorCity": "Newport",
  "OperatorStateFIPS": "RI",
  "OperatorZipCode": "02840",
  "OperatorZipCodeExt": "1332",
  "RMPContact": "Julia Forgue",
  "RMPTitle": "Director of Utilities",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000077702",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-07-08 00:00:00",
  "DeRegistrationEffectiveDate": "2014-10-01 00:00:00",
  "AnniversaryDate": "2019-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.5593,
  "FRS_Long": -71.28785,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000052767,
      "AltID": "chlorine",
      "FacilityID": 1000042778,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000053491,
          "ProcessID": 1000052767,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064051,
          "ProcessID": 1000052767,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564051,
          "ProcessID": 1000052767,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042778,
      "SummaryText": "The City of Newport Department of Utilities Water Division accidental release prevention policy involves a unified approach that combines technologies, procedures, and management practices. All applicable prevention procedures of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) will be adhered to. The City of Newport Department of Utilities Water Division emergency response policy involves the preparation of evacuation and notification procedures and coordination of emergency response procedures with the Local Emergency Response Committee (LEPC) and the local fire department.\n\n                                                            \n\nThe Lawton Valley Water Treatment plant (LVWTP), installed in 1945, serves the Portsmouth, Rhode Island community by disinfecting drinking water. The water treatment plant is located at the corner of West Main Road and Route 114. The water treatment plant contains a storage building which contains liquid chlorine ton-cylinders; a treatment process; an instrument room which contains flow recorders and other electronic panels; and various safety and monitoring equipment. Within the storage building, one ton-cylinder is on- line, one ton-cylinder is in reserve, and four (4) ton-cylinders are in storage. The facility operates on three (3) shifts with a minimum of three (3) operators per shift. The chlorine storage area and the chlorinator room are monitored with chlorine detectors. A new LVWTP is currently under construction and will be online by December 2014. The new LVWTP will replace gaseous chlorine with liquid sodium hypochlorite and an RMP will no longer be required.\n\n\n\nThe water treatment plant's off-site consequence analysis includes consideration of two release scenarios involving chlorine.  These scenarios are identified as the \"worst case\" and \"alternative\".  EPA states that for the worst case scenario \"the owner or operator shall assume the maximum quantity in the largest vessel is released over "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042778,
      "SummaryText": "10 minutes'.  The worst case scenario is to result from an unspecified failure. EPA defines the alternative scenario as one that is \"more likely to occur that the worst case scenario\".\n\n\n\nThe purpose of the release scenarios is to determine the distance to \"toxic endpoint\" which is defined by the American Industrial Hygiene Association as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or serious health effects or symptoms which could impair an individual's ability to take protective action\". Additionally, the residential population within a circle, which is made using the distance to toxic endpoint as its radius, has to be defined as an estimate of the population potentially affected.  For purposes of determining worst case and alternative release scenario distance to toxic endpoint, the water treatment plant utilized EPA's RMP Comp software.\n\n\n\nThe worst case release scenario at the Lawton Valley Water Treatment Plant involves a failure of one ton cylinder. The distance to toxic endpoint was determined to be 1.3 miles and an estimate of the residential population potentially affected of 5480 was obtained.\n\n\n\nThe water treatment plant used, as an alternative release scenario, a leak during a hookup of a ton cylinder. The leak came from the 3/8\" whip, which carries the gaseous chlorine from the ton cylinder to a one-inch gas rated steel pipe.  As described in EPA's CEPPO's Risk Management Program Guidance for Wastewater Treatment Plants. A choked gas release was assumed as the treatment plant pulls gaseous chlorine from the cylinder. The distance to toxic endpoint for the alternative scenario was determined to be 0.1 miles and an estimate of the residential population potentially affected of 25 was obtained.\n\n\n\nThe general City of Newport Department of Utilities Water Division's accidental release prevention program is based on training of o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042778,
      "SummaryText": "perators, implementation of preventative maintenance, auditing and inspection programs; continual review and upgrade of process and safety equipment; use of accurate and effective operating procedures (developed with the participation of the operators); and the execution of periodic reviews of equipment and procedures.\n\n\n\nAn accidental releases of chlorine  occurred at the Lawton Valley Water Treatment plant on 2/10/11.\n\n\n\nThe water treatment plant has coordinated its emergency response procedures with the District 7 Local Emergency Response Committee (LEPC). Procedures have been developed for the effective and timely notification of response personnel and the community and for the safe evacuation of employees."
    }
  ]
}