{
  "FacilityID": 1000088675,
  "FacilityName": "Blanchard Terminal Company LLC - Selma Buffalo",
  "FacilityStr1": "3707 Buffalo Rd",
  "FacilityStr2": null,
  "FacilityCity": "Selma",
  "FacilityState": "NC",
  "FacilityZipCode": "27576",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37101",
  "LEPC": "Johnston County LEPC",
  "FacilityLatDecDegs": "35.548381",
  "FacilityLongDecDegs": "-78.305669",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78697868,
  "ParentCompanyName": "MPLX Terminals, LLC",
  "Company2Name": null,
  "CompanyDUNS": 962993101,
  "Company2DUNS": 0,
  "OperatorName": "Blanchard Terminal Company LLC",
  "OperatorStr1": "3707 Buffalo Rd",
  "OperatorStr2": null,
  "OperatorCity": "Selma",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27576",
  "OperatorZipCodeExt": null,
  "RMPContact": "Laurie Wilkins",
  "RMPTitle": "TTR General Manager",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000214234",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-02-27 00:00:00",
  "SafetyInspectionBy": "NC Dept of Agric. and Consumer Svcs - Standrds Div",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-08-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-08-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-08-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-08-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110344,
      "AltID": null,
      "FacilityID": 1000088675,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000111617,
          "ProcessID": 1000110344,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000137731,
          "ProcessID": 1000110344,
          "ChemicalID": 118,
          "Quantity": 500000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000637731,
          "ProcessID": 1000110344,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000088675,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RELEASE POLICIES\n\n\n\nBlanchard Terminal Company LLC - Selma Buffalo (Selma Buffalo) is committed to operating and maintaining processes in a safe, reliable and environmentally sound manner. Selma Buffalo believes that excellent performance in health, safety, and the environment goes hand in hand with operating reliably, and that outstanding HES performance is of paramount importance.\n\n\n\nSelma Buffalo is designed, operated, and maintained in a manner that promotes the health and safety of workers, contractors, and the community and protects the environment. This is accomplished through programs of awareness, compliance, prevention and protection. These programs include a combination of accidental release prevention and emergency response planning. This document provides a brief overview of the comprehensive risk management activities including:\n\n\n\nA. A description of the facility and the use of regulated substances;\n\nB. An overview of the accidental release prevention programs;\n\nC. A five-year accident history for accidental releases of regulated chemicals;\n\nD. An overview of the emergency response program; and\n\nE. An overview of planned changes to improve safety.\n\n\n\nA. STATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nThe primary function of the Selma Buffalo Terminal is to act as a refined petroleum distribution facility. The Terminal stores, receives, and distributes various petroleum products including gasoline and diesel. The facility also includes butane blending operations. The butane blending process has been classified as Prevention Program Level 3. No Program 1 or 2 processes were identified at the facility. By virtue of the flammable effects associated with butane, it is necessary to observe certain safety precautions to prevent unnecessary human exposure, to reduce the threat to employee health, and to minimize the threat and impact to nearby members of the community. Selma Buffalo is strongly committed to employee, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000088675,
      "SummaryText": "public, and environmental safety and health. Safety at the Facility depends upon the manner in which butane is handled as well as the various safety devices incorporated into the design of the process. Furthermore, comprehensive training is provided to employees, which reinforces the safety policies and procedures of the Terminal.\n\n\n\nThe facility has fixed inventories of butane. Butane is received by truck (transports) and stored in two (2) storage vessels. Specifically, liquefied butane is off-loaded by truck for storage under pressure. The butane is pumped to a blending skid for direct injection into blend grade and premium unleaded gasoline lines feeding the site gasoline truck-loading rack. Injection quantities are controlled via the blending skid and dedicated Analyzer. Process safety controls include excess flow valves, fusible element (<250 degrees Fahrenheit) feeds to pneumatic valves (fail safe), 85% fill shutoff on the vessel, emergency shut-off devices on the system and video display terminal, line thermal reliefs, vessel pressure reliefs, and grounding/interlock devices. Access to the Terminal is restricted to authorized employees, management personnel and authorized contractors/visitors.\n\n\n\nB. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION MEASURES\n\n\n\nThe Selma Buffalo accidental release prevention programs and emergency planning and response programs help effectively manage the hazards posed by regulated substances to its employees, the public, and the environment. The covered process is regulated by the EPA RMP regulation 40 CFR Part 68, as well as the OSHA Process Safety Management standard 29CFR 1910.119. The following accident prevention program elements are in place at Selma Buffalo Terminal:\n\n\n\n1) Employee Participation\n\n2) Process Safety Information\n\n3) Process Hazard Analysis (PHA)\n\n4) Standard Operating Procedures\n\n5) Operator Training\n\n6) Contractor Safety\n\n7) Pre-startup Safety Review\n\n8) Mechanical Integrity "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000088675,
      "SummaryText": "with Preventive Maintenance\n\n9) Work (Hot Work) Permits\n\n10) Management of Change\n\n11) Accident or Potential Catastrophic Event Investigation\n\n12) Emergency Response\n\n13) Compliance Audits\n\n14) Trade Secrets\n\n\n\nThese fourteen (14) individual elements of Selma Buffalo's prevention program work together to prevent/mitigate accidental chemical releases. The company and its employees are committed to the standards required by these management programs. In addition to the above elements, we also have specific prevention measures that are employed as part of our operating procedures and engineering and administrative controls to help contain/control a release, quickly detect a release, and reduce the consequences of a release. These are briefly summarized as follows:\n\n\n\nGeneral Risk Reduction and Safety Measures\n\n\n\n-Engineering and construction in accordance with recognized industry and company standards\n\n-Equipment properly designed with protection from overpressure (pressure safety relief valves, etc.)\n\n-Updated technical drawings, Piping & Instrument Diagrams and Process Flow Diagrams\n\n-Operating systems monitored and controlled by trained Operators\n\n-Computerized monitoring (local and remote) and control of process operation\n\n-Redundant control systems with battery back-ups\n\n-Automatic and manual shutdown devices for critical systems\n\n-Scheduled inspection and testing of critical equipment such as instruments, analyzers, safety devices, etc.\n\n-Controlled facility access\n\n-Regular safety meetings and safety awareness programs\n\n-Routinely scheduled safety inspections and audits\n\n-Frequent unit surveillance by operators\n\n\n\nGeneral Release Mitigation\n\n\n\n-Automatic and remotely operated shut-offs to limit release quantity\n\n-Strategically located valves to isolate leaks\n\n-Hydrocarbon detectors at key areas to warn of a chemical release and disable process\n\n-Fire monitors installed near offload area\n\n-Intumescent coating on vessels\n\n\n\nGeneral Emergency Response\n\n\n\n-Emergency"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000088675,
      "SummaryText": " alert system\n\n-Periodic emergency training for employees\n\n-Communication systems with local emergency responders and regulatory agencies\n\n-Emergency drills with terminal personnel, regulatory agencies, and community emergency responders to enhance response skills and coordination among agencies\n\n-Mutual Aid with Local Fire Departments\n\n\n\nFurther, the Terminal complies with NFPA's Liquefied Petroleum Gas (LPG) Code (NFPA-58) requirements for LP Gas storage. In addition to the presence of appropriate controls to prevent possible releases of butane, if a release does occur, a Facility Response Plan (FRP) [aka \"SMART PLAN\"] is in place for the facility and response activities are coordinated with Selma Fire Department and the Johnston County LECP.\n\n\n\nC. FIVE YEAR ACCIDENT HISTORY\n\n\n\nSelma Buffalo has an excellent record of accident prevention. The terminal maintains records for all significant accidental chemical releases that occur at our facility. There have been no reportable accidents within the past five (5) years resulting from the release of materials covered under the EPA RMP regulation.\n\n\n\nD. EMERGENCY RESPONSE PROGRAM\n\n\n\nA previously identified \"SMART PLAN\" is in place to inform employees what to do in case of a release/fire, and to notify emergency responders when there is a need for a response.  \n\n\n\nThe Terminal maintains a relationship with the Selma Fire Department. Tours and drills with members of local emergency response organizations are held routinely. These tours and drills enable the public emergency responders to become familiar with butane hazards, equipment, resources and personnel in the terminal.\n\n\n\nE. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Terminal is implementing an updated Car Seal Program and is reviewing current alarms to determine if any may not be critical to the process.\n\n"
    }
  ]
}