{
  "FacilityID": 1000080814,
  "FacilityName": "Atkins Water Treatment Plant",
  "FacilityStr1": "293 Galla Park Road",
  "FacilityStr2": null,
  "FacilityCity": "Pottsville",
  "FacilityState": "AR",
  "FacilityZipCode": "72858",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05115",
  "LEPC": "Pope County LEPC",
  "FacilityLatDecDegs": "35.260833",
  "FacilityLongDecDegs": "-093.051389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City Of Atkins Water Works",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City Of Atkins",
  "OperatorStr1": "PO Box 128",
  "OperatorStr2": null,
  "OperatorCity": "Atkins",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72823",
  "OperatorZipCodeExt": null,
  "RMPContact": "Terry Bowden",
  "RMPTitle": "Plant Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000075875",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-05-07 00:00:00",
  "SafetyInspectionBy": "Environmental Services Group, Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.2357,
  "FRS_Long": -93.0437,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101042,
      "AltID": "Chlorine",
      "FacilityID": 1000080814,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000102311,
          "ProcessID": 1000101042,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000126662,
          "ProcessID": 1000101042,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000626662,
          "ProcessID": 1000101042,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080814,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nIn this water treatment plant facility, chlorine is handled, which is considered hazardous by EPA.  The same properties that makes chlorine valuable as a water treatment chemical also makes it necessary to observe certain safety precautions in handling chlorine. Overall, the prevention of unnecessary human exposure, reducing the threat to personal health, and reducing the threat to nearby members of the community is the main goal of incorporating this risk management plan into the facility's daily operations.  It is the facility's policy to adhere to all applicable federal and state rules and regulations.  Safety depends upon the manner in which the facility handles chlorine combined with the safety devices inherent in the facility design, utilizing safe handling procedures and personnel training.  \n\n\n\nThe facility's emergency response program was developed with the assistance of Environmental Services Group, Inc.  The emergency response plan includes procedures for Terry Bowden (Plant Manager)notification of the Pottsville Fire Department and then notifying the Pope County 911 System for 911 call-out to responding agencies.  The Pottsville Fire Department and Pottsville Police Department will help to notify and evacuate any potentially affected neighbors by utilizing vehicles with PA mounted announcing systems.  The 911 System will also notify Pope County Office of Emergency Management.  \n\n\n\nThe primary purpose of this facility is to treat the water system by utilizing chemicals such as chlorine. Chlorine is received by individual one ton cylinders at the Galla Park Rd. location and stored until needed. Chlorine is fed into the water system by automatic feeders.  All cylinders operate on a vacuum system. This vacuum system will prevent the continual operation of the system if there is an increase or decrease in operating pressure on the cylinders or lines.  Access to the site is restricted to the authorized facility employee, authorized managem"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080814,
      "SummaryText": "ent personnel, and authorized contractors.  \n\n\n\nThe regulated substance handled at the Galla Park Rd. location is chlorine.  The maximum amount of chlorine that can be stored at this plant is 6,000 pounds.  There will only be one cylinder (2,000 pounds) on line at any one time, and one on automatic switch-over.  The rest of the 2,000 pounds are in storage.\n\n\n\nThe worst-case scenario is failure of the largest storage tank when filled to the greatest amount allowed would release 2,000 pounds of chlorine from the Galla Park Rd. location. Passive mitigation has been considered for this scenario.  The chlorine storage tanks are located in the chlorine feed room, which is constructed of concrete walls on all sides in contact with outside air.  It is assumed that the entire contents are released as vapor.  The distance to the endpoint of 0.0087 mg/l for the worst-case scenario is 0.9 miles.  This location is classified as urban due to the thickly populated trees and steep hilly terrain around the site.  Within this affected area, there are approximately 208 persons, and 81 households.  The population densities were determined using Circular Area Profiles (CAPS) - Version 2010 from the Missouri Census Data Center.\n\n\n\nAn alternative scenario was determined for this facility; however, based on the type of prevention system in place, the alternative release from a one ton cylinder should be minimal for the Galla Park Rd. site.  The vacuum system has been determined to be effective in preventing small amounts of chlorine from escaping upon a system failure.  An estimation, based on the line capacity for the feeder lines, would be approximately 10 pounds released into the atmosphere.  This amount of vapor chlorine release would result in a distance to endpoint of approximately <0.1 miles.  Within this affected area, there are approximately 0 persons,and 0 households.  The population densities were determined using Circular Area Profiles (CAPS) - Version 2010 from the Missouri Ce"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080814,
      "SummaryText": "nsus Data Center.\n\n\n\nThis water treatment facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations. \n\n\n\nThe facility has had no accidental releases of chlorine in the last five years.  The automatic vacuum system limits the amount (if any) of chlorine that escapes during operational periods.\n\n\n\nThe facility's emergency response program was developed with the assistance of Environmental Services Group, Inc.  The facility has discussed this program with the Pope County Office of Emergency Management (479)-968-1800), the Pope County 911 System, the Pope County Sheriff's Office, as well as the Pottsville Fire Department (HazMat Response Agency). A representative of Environmental Services Group, Inc. visited this plant May 7, 2019.\n\n\n\nThe water treatment facility at the Galla Park Rd. facility was constructed in 1976, and the one-ton chlorination system was added in 1995.  This facility is in compliance with all applicable regulations for water treatment facilities."
    }
  ]
}