{
  "FacilityID": 1000042179,
  "FacilityName": "JCI Jones Chemicals, Inc. - Milford, VA",
  "FacilityStr1": "16248 Industrial Drive",
  "FacilityStr2": null,
  "FacilityCity": "Milford",
  "FacilityState": "VA",
  "FacilityZipCode": "22514",
  "Facility4DigitZipExt": "2139",
  "FacilityCountyFIPS": "51033",
  "LEPC": "Caroline County LEPC",
  "FacilityLatDecDegs": "38.011633",
  "FacilityLongDecDegs": "-077.370822",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.jcichem.com",
  "FacilityEmailAddress": "mwashington@jcichem.com",
  "FacilityDUNS": 2216091,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "JCI Jones Chemicals, Inc.",
  "OperatorStr1": "16248 Industrial Drive",
  "OperatorStr2": null,
  "OperatorCity": "Milford",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22514",
  "OperatorZipCodeExt": "2139",
  "RMPContact": "Mike Washington",
  "RMPTitle": "Branch Manager",
  "FTE": 10,
  "OtherEPAFacilityID": "22514JNSCHRT640",
  "EPAFacilityID": "100000114217",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-09-19 00:00:00",
  "SafetyInspectionBy": "Virginia Department of Labor and Industry",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 38.0102,
  "FRS_Long": -77.372,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ZIP+4 CENTROID",
  "HorizontalAccMeasure": "150",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051971,
      "AltID": null,
      "FacilityID": 1000042179,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000052586,
          "ProcessID": 1000051971,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000063040,
          "ProcessID": 1000051971,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000563040,
          "ProcessID": 1000051971,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000051972,
      "AltID": null,
      "FacilityID": 1000042179,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000052587,
          "ProcessID": 1000051972,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000063041,
          "ProcessID": 1000051972,
          "ChemicalID": 49,
          "Quantity": 31500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000563041,
          "ProcessID": 1000051972,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042179,
      "SummaryText": "EXECUTIVE SUMMARY\n\nJCI JONES CHEMICALS, INC.\n\nMILFORD, VIRGINIA\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\n\n\nJCI is committed to being a responsible member of any community in which it has operations by giving top priority to operating in a safe and environmentally sound manner. As part of this commitment, JCI has obtained Responsible Care &reg; Management System certification.  Corporate policy dictates that facilities continuously identify methods to provide the safest working environment possible to its employees and to reduce the risk to the community and environment. This commitment to safe and environmentally sound operations is documented in the corporate policy and compliance/procedure manuals, which are available to all employees. This facility stresses safe and environmentally sound operations in employee training programs, and in written materials available at the facility. This facility's safety and environmental programs include monthly safety meetings of all employees. JCI has an environmental manual and a safety manual that cover general environmental and safety best practices and compliance topics. Each employee at this facility has access to the environmental and safety manuals that cover topics specific to this facility. There are regularly scheduled safety and environmental audits conducted by facility management, and periodic safety and environmental audits of the facility conducted by JCI corporate personnel. This risk management program document has been prepared to meet the requirements of the U.S. Environmental Protection Agency's Risk Management Program regulations as stated in 40 CFR Part 68 (Appendix A).\n\n\n\n2.    The JCI Facility and the Regulated Substances Handled\n\n\n\nThe primary function of this facility is to protect public health by supplying chemicals including chlorine and sodium hypochlorite to disinfect bulk water systems. The primary operations conducted at this facility include the distribution of inorganic"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042179,
      "SummaryText": " chemicals and repackaging of inorganic gases. Chemicals are brought on site in bulk quantities (railcars, tank trucks, etc.), repackaged into smaller containers, and then transported to customers on an as-needed basis. Any residual compressed gas is absorbed in an appropriate solution and sold as product.  The regulated substances handled by this facility are chlorine and sulfur dioxide.\n\n\n\n3.    The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nThe prevention programs described in this facility's Safety and Safety Training Manuals represent integrated administrative controls intended to ensure the safety of workers, the public, and the environment. Many of these prevention programs (e.g., PHAs, compliance audits, incident investigations) result in the development and implementation of additional safeguards (administrative and engineering controls). All covered processes have control systems designed to maintain operating parameters (temperature, pressures, flow, and level) within allowable limits. The covered processes are also equipped with alarms to alert personnel when the operating parameters exceed the allowable limits. This facility developed procedures and conducted training of personnel to familiarize them with the consequences of exceeding allowable limits (safety and operability) to ensure the correct response to the alarms. Safeguards to prevent, detect, or mitigate accidental releases of regulated substances are described in the facility's Safety and Safety Training Manuals.\n\n\n\n4.    The Five-Year Accident History\n\n\n\nThis facility compiled a five-year accident history (June 1, 2009 - May 31, 2014) for all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage as required by the RMP regulations. The five-year accident history allows the facility t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042179,
      "SummaryText": "o explain to the community the factors causing or contributing to accidental releases, the on-site and off-site impacts of accidental releases, and the procedural and technological changes made to minimize the likelihood that these accidental releases will ever occur again. The intent of this information exchange is to create an informed community, while also documenting that accidental releases are investigated and concrete changes are made to protect against recurrence.\n\n\n\nPersonnel at the facility reviewed all incident investigation reports from June 1, 2009 to May 31, 2014 to identify accidental releases of extremely hazardous substances that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  No accidental releases were identified.\n\n\n\n5.    The Emergency Response Plan\n\n\n\nOverall safety at this facility is governed not only by the ability to prevent accidental releases of regulated substances, but also by the ability to mitigate any accidental releases. This facility therefore developed an emergency response program to minimize the effects of accidental releases of regulated substances on employees, the public, and the environment. The facility has a trained emergency response team (ERT), appropriate equipment and supplies, and a detailed Contingency Plan. The Contingency Plan outlines the procedures to be taken in the event of an accidental release of a regulated substance and specifies notification, evacuation, and release control and containment measures for accidental releases that may occur at the facility or on the highway (in transportation accidents).\n\n\n\nThe Contingency Plan Manual includes specific process information, a list of emergency equipment, emergency evacuation plans, and a list of plant personnel. The manual also includes a list of telephone numbers of agencies and individuals to contact in the event that one of sever"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000042179,
      "SummaryText": "al pre-identified emergencies (e.g., fire, employee injury, employee fatality). The agencies and individuals represent local emergency responders (e.g., fire department), public notification and regulatory reporting requirements (e.g., EPA), and internal notification (e.g., Branch Manager, Corporate Headquarters). Written coordination agreements that document arrangements with local emergency responders are maintained in the Contingency Plan Manual.\n\n\n\nThe Contingency Plan includes plans to respond to releases of regulated substances, and identifies the ERT training requirements, qualifications, and responsibilities within the incident command system. The ERT comprises individuals from operations, maintenance, and engineering. In addition to the ERT, this facility has identified, properly trained, and properly equipped employees to administer first aid until the outside responders arrive. All ERT members complete on-site annual eight-hour refresher training.\n\n\n\nThe Contingency Plan includes the chemical-specific emergency response procedures for releases of regulated and other extremely hazardous substances. The procedures identify the individuals by training level that perform the actions, administrative and engineering controls (e.g., ventilation), the required PPE, first aid requirements, and required equipment.\n\n\n\nThis facility maintains emergency response equipment and PPE for use by the ERT and the fire department. The emergency response equipment is included in the mechanical integrity program, assuring that required testing and inspection frequencies are adhered to and preventive maintenance activities are conducted. Examples of PPE maintained at this facility include air-purifying respirators and self contained breathing apparatuses.\n\n\n\nThe Contingency Plan is reviewed monthly to ensure that it remains accurate and current. Employees are trained in the emergency response program when initially hired, when the emergency response plan is revised, and when emp"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000042179,
      "SummaryText": "loyees' responsibilities are changed. All employees receive annual refresher training on the emergency response program.\n\n\n\nThe Contingency Plan and documentation of emergency response activities are maintained in the facility's Contingency Plan Manual.\n\n\n\n6.    Planned Changes to Improve Safety\n\n\n\nStudies associated with prevention program elements such as PHAs, incident investigations, management of change, and compliance audits are regularly conducted at this facility to verify designs and to identify potential hazards. Recommendations may be developed as a result of those studies and as a result of equipment inspections, safety meetings, review of industry experience, technology improvements, and employee suggestions. Once formulated, recommendations are reviewed and corresponding action items are developed to implement each recommendation.\n\n\n\nJCI facility personnel reviewed the following documents to identify all action items that were formulated to reduce the risk (severity or likelihood) of an incident that could have plausibly resulted in an off-site consequence (i.e., the emergency response planning guideline level 2 [ERPG-2] developed by the American Industrial Hygiene Association for toxic gases):\n\n\n\n?    Accident Investigation Reports\n\n?    Process Hazard Analysis\n\n?    Standard Operating Procedures\n\n\n\nIn addition to the extensive safety and security mitigation systems that JCI currently has at its facility, JCI is currently planning on installing an intrusion detection system at this facility to provide continuous monitoring of its regulated substances.  This system will include electrical monitoring of door contacts along with motion detector activated video cameras that will be monitored by a third-party company.\n\n\n\n7.    Worst Case and Alternative Case Release Scenarios\n\n\n\nWorst Case Release Scenario: Entire contents of 180,000 pound railcar of Chlorine.\n\n\n\nAlternative Case Release Scenario: A chlorine container begins leaking at the filling station at any time dur"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000042179,
      "SummaryText": "ing the repackaging process, to include immediately before or after the connection or disconnection process, for any reason to include employee error.\n\n\n\nAlternative Case Release Scenario: A valve on a sulfur dioxide container begins leaking while the container is in storage."
    }
  ]
}