{
  "FacilityID": 1000094063,
  "FacilityName": "INV Polypropylene, LLC",
  "FacilityStr1": "118 Huntsman Way",
  "FacilityStr2": null,
  "FacilityCity": "Longview",
  "FacilityState": "TX",
  "FacilityZipCode": "75602",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48183",
  "LEPC": "Gregg County LEPC",
  "FacilityLatDecDegs": "32.434887",
  "FacilityLongDecDegs": "-94.711771",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.fhr.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 962724535,
  "ParentCompanyName": "Koch Industries Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": null,
  "OperatorName": "Flint Hills Resources Longview, LLC",
  "OperatorStr1": "118 Huntsman Way",
  "OperatorStr2": null,
  "OperatorCity": "Longview",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75602",
  "OperatorZipCodeExt": null,
  "FTE": 70,
  "OtherEPAFacilityID": "TXR000020842",
  "EPAFacilityID": "100000178087",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-1282",
  "SafetyInspectionDate": "2019-10-10 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Longview,  Texas",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-06-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-06-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-06-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-06-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 32.433611,
  "FRS_Long": -94.711389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116751,
      "AltID": "Polypropylene ProcessUnit",
      "FacilityID": 1000094063,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000146034,
          "ProcessID": 1000116751,
          "ChemicalID": 129,
          "Quantity": 330000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000146033,
          "ProcessID": 1000116751,
          "ChemicalID": 98,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000118164,
          "ProcessID": 1000116751,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000099899,
              "Process_NAICS_ID": 1000118164,
              "SafetyReviewDate": "2021-02-10 00:00:00",
              "PHA_Date": "2021-05-03 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "LOPA",
              "PHACompletionDate": "2021-10-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "SIL-2 rated shut-down on cycle gas compressor.   Permanent blind installed isolating C62 compressor from ethylene on 10/10/18",
              "OpProceduresReviewDate": "2022-05-23 00:00:00",
              "TrainingReviewDate": "2020-06-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Computer Based Training",
              "MaintenanceReviewDate": "2021-02-26 00:00:00",
              "EquipmentInspectionDate": "2021-05-06 00:00:00",
              "EquipmentTested": "External API 570 visual examination with UT inspection at Line 119-4-K2AHPF83981X (previously established TML location)",
              "ChangeMgmtDate": "2021-05-04 00:00:00",
              "ChangeMgmtReviewDate": "2020-07-23 00:00:00",
              "PreStartupReviewDate": "2021-04-15 00:00:00",
              "ComplianceAuditDate": "2021-07-29 00:00:00",
              "AuditCompletionDate": "2021-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2020-08-17 00:00:00",
              "HotWorkPermitReviewDate": "2020-06-24 00:00:00",
              "ContractorSafetyReviewDate": "2021-04-17 00:00:00",
              "ContractorSafetyEvalDate": "2020-06-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000125300,
                  "PreventionProgram3ID": 1000099899,
                  "ProcessChemicalID": 1000146034
                },
                {
                  "PrimaryKey": 1000125299,
                  "PreventionProgram3ID": 1000099899,
                  "ProcessChemicalID": 1000146033
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000094063,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-11-11 00:00:00",
    "ERTrainingDate": "2021-01-21 00:00:00",
    "CoordinatingAgencyName": "TXO Emergency Response Team",
    "CoordinatingAgencyPhone": "9032376911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "49 CFR 191-195",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094063,
      "SummaryText": "INV Polypropylene, LLC (INVISTA), formerly known as Flint Hills Resources Longview, LLC (FHR), owns and operates a polypropylene process unit (polypropylene manufacturing) located near Longview, Harrison County, Texas.   In the previous RMP submission, INVISTA also operated an associated Propylene Unloading area located approximately two (2) miles west of the Polypropylene Process unit in Gregg County, but this process was taken out of service and completely decommissioned on 4/22/2021. \r\nINVISTA's Longview polypropylene process unit is enclaved within a large chemical complex owned by Eastman Chemical Company. Although INVISTA owns the equipment that makes up the INVISTA Longview Facility, it leases the associated land from Eastman Chemicals. Operators and emergency response activities are provided by Eastman under a contract agreement. The INVISTA Longview Facility is the only industrial facility operated by INVISTA at the Eastman Chemical Company complex. The land leased by INVISTA is surrounded by Eastman Chemical Company's other property.\r\nOperators and Emergency Response in the Polypropylene Process unit is still supplied by Eastman by agreement. \r\n\r\nThe INV Polypropylene, LLC - Longview Facility (INVISTA) is located at 118 Huntsman Way in Longview, Texas.\r\nINVISTA is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors, and the public while fully complying with applicable laws and regulations. INVISTA's management philosophy goals are achieved through the implementation of its Environmental Health and Safety Management Systems, by the personal commitments of employees and contractors, and by open communication with employees, customers, neighbors, and regulators.\r\nThe purpose of this Risk Management Plan is to provide information about operations at the facility, programs to prevent accidental chemical releases, emergency response plans in the event of an accidental relea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094063,
      "SummaryText": "se, the five-year accident history of the facility, and planned changes to improve safety at the plant.\r\n2.1.2\tStationary Source and Regulated Substances\r\nINVISTA owns and operates a Polypropylene Process unit located near Longview, Harrison County, Texas. INVISTA's polypropylene process unit Longview Facility in Harrison County is enclaved within a large chemical complex owned by Eastman Chemical Company. Although INVISTA owns the equipment that makes up the INVISTA Longview Facility, it leases the associated land from Eastman Chemicals. The INVISTA Longview Facility is the only industrial facility operated by INVISTA at the Eastman Chemical Company complex. The land leased by INVISTA is surrounded by Eastman Chemical Company's other property.\r\nThe INV Polypropylene, LLC - Longview Facility (INVISTA) polypropylene process unit is located on the Eastman Longview Chemical Complex at 300 Kodak Boulevard in Longview, Texas. Given that INVISTA is the owner of the unit and Eastman is the operator, the policies applied at the unit are a combination of INVISTA and Eastman policies.\r\nAs the owner of the unit, INVISTA is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors, and the public while fully complying with applicable laws and regulations. INVISTA's management philosophy goals are achieved through the implementation of its Environmental Health and Safety Management Systems, by the personal commitments of employees and contractors, and by open communication with employees, customers, neighbors, and regulators.\r\nThe polypropylene process unit at the Eastman Longview Complex, owned by INVISTA and operated by Eastman, is a polypropylene production unit. The polypropylene unit is integrated into Eastman Operations safety and emergency response practices and processes, and in the past has been considered part of the Eastman facility for purposes of compliance with the RMP regulation. T"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094063,
      "SummaryText": "he polypropylene produced at the unit is primarily supplied to industrial customers.\r\nAs part of its polypropylene production, the facility uses two EPA RMP covered chemicals - propylene and propane - in quantities greater than the threshold quantity of 10,000 lbs. The Longview facility does not have any EPA RMP-regulated toxic chemicals.\r\nThe polypropylene process unit is subject to the OSHA Process Safety Management Standard, 29 CFR 1910.119, and regulated under EPA Risk Management Program 40 CFR Part 68\r\n- Program Level 3 requirements.\r\n2.1.3\tAccidental Release Prevention and Emergency Response Policies\r\nThe accidental release prevention and emergency response programs in place at the facility are part of the high standards adopted by INVISTA. These standards include:\r\nOperating in compliance with required environmental permits and regulations. Operating and maintaining the assets such that unintentional releases are minimized.\r\nOperating and maintaining assets in such a manner that the small releases associated with normal operation and maintenance will be minimized to the extent possible.\r\nCorrecting findings identified in regular audits of the facility.\r\nINVISTA is committed to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our processes. The Longview facility adheres to process safety policies, guidelines, and best practices that have been developed based on company and industry experience over the years. INVISTA's practice is to implement the controls necessary to prevent releases of regulated substances to the environment. However, if a release does occur, trained INVISTA personnel will respond, to control and contain the incident. Details on the emergency response program are outlined in Section 2.1.6.\r\nAdditionally, Eastman policies applicable to the unit are summarized in the Eastman \"Pri"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094063,
      "SummaryText": "nciples of Safety\" document. Eastman conducts all aspects of its business in a manner that provides for the safety of employees, contractors, communities, customers, and the environment. The Eastman safety process consists of six main steps:\r\nHazard identification, prevention and control Safe design and construction\r\nSafety and health education and training\r\nEmployee involvement, accountability, and responsibility\r\nInspection, testing, repair and preventative maintenance (mechanical integrity) Systematic evaluation for continual improvement\r\n\r\nDetails of the Eastman accident prevention efforts are contained in the Texas Operations General Operating Procedures, the Texas Operations Authorized Safe Practice Manual, and the Standard Operating Procedures of the unit. These document specific practices and procedures to help ensure the safety of the employees, contractors, community, and the environment.\r\nDetails of the emergency response efforts are contained in the mentioned documents, as well as the Texas Operations Emergency Plan. This plan specifies the responsibilities and duties of Eastman personnel during emergencies and potential emergencies. These responsibilities and duties provide for the prompt mobilization of the company's resources, including both personnel and equipment in an emergency situation. These plans are updated routinely, and are periodically reviewed in their entirety.\r\n2.1.4\tPrevention Program\r\nThe INVISTA Longview Facility polypropylene process unit is operating under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program. Ongoing analysis of the potential hazards of the process, detailed training of employees and emphasis on safety has contributed to process safety. The facility has had no RMP chemical release accidents over the last 5 years. Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases, as part of a detailed prevention program. A f"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000094063,
      "SummaryText": "ew examples of the prevention features implemented at this facility include:\r\nMinimizing the possibility of an interruption in power supply to the process control system by having a backup power generator.\r\nProviding preventive maintenance and testing of vessels through the Mechanical Integrity program to ensure that structural failures do not occur in process equipment.\r\nMinimizing the possibility of a release of propane and propylene, using shutdown interlocks installed on process equipment.\r\nReducing the severity of fires when operating automatic and manual deluge systems. Installing combustible gas detectors in the facility.\r\n2.1.5\tFive-Year Accident History\r\nEPA requires that all incidents involving regulated chemicals that resulted in any off-site impact or significant on-site impact be reported in this document. Within the last five years (May 10, 2016 - May 10, 2021 ), there were no releases of hazardous materials that met the criteria for an RMP accident.\r\n2.1.6\tEmergency Response Program\r\nPolypropylene Process Unit Emergency Response: At the polypropylene process unit facility, the Eastman Plant Manager is responsible for coordinating emergency actions. The Eastman facility is contractually in charge of providing emergency support to the INVISTA process unit. A written and specific Emergency Response Plan coordinated with local officials is in place for the facility. The Emergency Response Program provides the essential planning for effectively protecting workers, the public, and the environment during emergency situations.\r\nEastman maintains a comprehensive site emergency response plan. Employees train annually on the plan as they prepare for a plant wide drill. Key elements of the emergency response plan as it relates to the community emergency response include, but are not limited to, the following:\r\nEastman maintains an emergency response team whose members are specifically trained and equipped to respond to emergencies such as leaks, spills, fires, et"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000094063,
      "SummaryText": "c.\r\nEastman emergency response personnel use a computerized modeling system to predict the concentration and location of any vapor cloud resulting from a hazardous vapor release using real time weather information.\r\nResponse is coordinated with emergency response agencies in the community via a Field Command Post and the Eastman emergency response center.\r\nEastman maintains a community emergency notification plan. For events that might impact the community, a direct line to the City of Longview dispatcher is utilized. The dispatcher contacts the Gregg County Sheriff's office and Harrison County Sheriff's office.\r\nEmergency response personnel are regularly trained to comply with all federal, state, and local requirements.\r\nAn automated community telephone emergency notification system, \"Smart911\", is available to provide quick, concise emergency information to Eastman's nearby neighbors if an event were to occur that could affect them.\r\nEastman serves on and gives significant support to both the Gregg County and the Harrison County LEPCs.\r\nEastman hosts the Northeast Texas Fire School where local municipal and volunteer firefighters from throughout the area receive both classroom and hands-on training for hazardous materials response.\r\nSite wide Emergency Response (ER) Training/Drills are held regularly at Eastman, and most recent drill was 01/21 /2021.\r\n  ER plan is reviewed regularly at Eastman including the Polypropylene Processing Unit area, most recent review/update of the TXO Emergency Plan was on 11/11/2020 (Section 1.10 \"Response to Injuries, Illnesses, and/or Facilities\" of the TXO Emergency Plan Manual).\r\n2.1.7\tPlanned Changes to Improve Safety\r\nCompliance with the RMP Prevention Program forms the framework for continuous safety improvement. Some of the key components of the safety program are:\r\nThe Management of Change provisions ensure that the potential safety and health impacts of changes made to process chemicals, technology, equipment or procedures ar"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000094063,
      "SummaryText": "e considered.\r\nThe Process Hazard Analysis (PHA) provisions serve as a tool to ensure\r\ntimely evaluation of potential hazards, thereby leading to continual improvements in safety standards.\r\nThe Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed, and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of the safety program.\r\nHazard Analysis: Continual identification of potential hazards, and prompt implementation of corrective action are done in accordance with applicable regulations and as a matter of company policy.\r\nIncident Investigation: Prompt, thorough investigation of all significant incidents and near-misses are conducted and findings are shared across the company.\r\nBenchmarking: Through our trade association, the American Chemistry Council, and through other cooperative efforts, such as the Center for Chemical Process Safety, we continually evaluate our safety program and processes against the best in the world, with the goal of continual improvement."
    }
  ]
}