{
  "FacilityID": 1000086145,
  "FacilityName": "WPSC- Fox Energy Center",
  "FacilityStr1": "310 East Frontage Road",
  "FacilityStr2": null,
  "FacilityCity": "Kaukauna",
  "FacilityState": "WI",
  "FacilityZipCode": "54130",
  "Facility4DigitZipExt": "9674",
  "FacilityCountyFIPS": "55087",
  "LEPC": "Outagamie County LEPC",
  "FacilityLatDecDegs": "44.322532",
  "FacilityLongDecDegs": "-088.209084",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.we-energies.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 143169162,
  "ParentCompanyName": "Wisconsin Public Service Corporation",
  "Company2Name": null,
  "CompanyDUNS": 7947435,
  "Company2DUNS": null,
  "OperatorName": "Wisconsin Public Service Corporatio",
  "OperatorStr1": "700 North Adams Street",
  "OperatorStr2": null,
  "OperatorCity": "Green Bay",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54307",
  "OperatorZipCodeExt": null,
  "FTE": 32,
  "OtherEPAFacilityID": "WIR000118406",
  "EPAFacilityID": "100000191589",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "445159110-P12",
  "SafetyInspectionDate": "2019-04-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-03-25 14:18:11",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-03-25 14:18:11",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-03-25 14:18:11",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-03-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 44.3208,
  "FRS_Long": -88.2089,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107592,
      "AltID": "Electric Power Generation",
      "FacilityID": 1000086145,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000134515,
          "ProcessID": 1000107592,
          "ChemicalID": 57,
          "Quantity": 308400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000108864,
          "ProcessID": 1000107592,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000067214,
              "Process_NAICS_ID": 1000108864,
              "SafetyReviewDate": "2019-11-13 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": "All equipment design and installations were based on these standards.",
              "HazardReviewDate": "2019-09-06 00:00:00",
              "ChangeCompletionDate": "2019-11-13 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Uninterrupted Power Supply not on the ammonia tank delivery system",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-04-02 00:00:00",
              "TrainingReviewDate": "2020-01-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-11-13 00:00:00",
              "EquipmentInspectionDate": "2019-11-14 00:00:00",
              "EquipmentTested": "Leak detection",
              "ComplianceAuditDate": "2017-09-13 00:00:00",
              "AuditCompletionDate": "2018-01-19 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2019-09-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000068002,
                  "PreventionProgram2ID": 1000067214,
                  "ProcessChemicalID": 1000134515
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000086145,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Village of Wrightstown",
    "CoordinatingAgencyPhone": "9205324556",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000086145,
      "SummaryText": "Introduction\r\n\r\nWisconsin Public Service Corporation (WPSC) owns the Fox Energy Center, a combined-cycle electric power generating facility located in Kaukauna, in Outagamie County, Wisconsin. The facility has two Selective Catalytic Reduction (SCR) systems that use ammonia for the reduction of nitrogen oxide (NOx) emissions. The ammonia is stored in aqueous form in one 40,500-gallon storage tank located at the facility. At full capacity, the tank can store as much as 302,304 pounds of aqueous ammonia. Since the facility will be storing more than 20,000 pounds of aqueous ammonia in a process, it is subject to United States Environmental Protection Agency (USEPA) Risk Management Program (RMP) regulations codified in 40CFR Part 68.\r\n\r\nAmmonia is an easily liquefiable colorless gas with a sharp, intensely irritating odor. The aqueous form ammonia is a solution of ammonia and water, and it is listed by the USEPA as a regulated toxic substance for release prevention. \r\n\r\nRelease Prevention and Emergency Response Policy\r\n \r\nPursuant to the RMP regulations (40 CFR Part 68), the facility has developed a comprehensive written program to protect employees and the surrounding community from exposure to ammonia. WPSC is committed to the safe operation of the SCR ammonia system at the Fox Energy Center. A release prevention program has been developed and implemented by the facility that is a combination of several programs. The release prevention program includes employee education in the hazards of aqueous ammonia and measures that can be used to reduce employee and community exposure to accidental releases of ammonia. The program includes preventive maintenance programs (mechanical integrity) for the ammonia system that incorporates inspections of the system in accordance with recognized standards of equipment inspection within the ammonia industry, as well as tests of system components in accordance with component manufacturer's recommendations.\r\n\r\nThe release prevention prog"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000086145,
      "SummaryText": "ram includes programs for pre-startup safety reviews and management of changes (MOC) to the ammonia system. The program also includes specific requirements for safe work practices (such as safe approaches to welding and similar hot work) and safety requirements for contractors who may be hired to work on the systems.\r\n\r\nSpecial emphasis is placed on handling accidental releases of ammonia and coordination of emergency response with local fire departments and other emergency response organizations in the release prevention program.\r\n\r\nAs part of the release prevention program requirements, the facility undertook a review of the potential offsite consequences of the accidental releases from one 40,500-gallon aqueous ammonia storage tank. Although such a release is highly unlikely, the regulation requires this review.\r\n\r\nWorst-Case Release Scenario\r\nAs required by USEPA regulations, the worst-case release scenario was assumed to be the complete loss of the contents of one 40,500-gallon storage tank containing 302,304 pounds of aqueous ammonia based on the specific gravity of the solution in the tank. This analysis included a common containment dike for the tank as a passive mitigation measure. Aqueous ammonia is a liquid solution at ambient temperature (77°F) and is therefore considered a toxic liquid evaporating from a pool formed by the released liquid for the worst-case release scenario.  The storage tank is located outdoors within a 1,474 ft2 containment structure.  For the worst-case release, the maximum area of the pool with a depth of 1 cm was calculated to be 166,267 ft2 using the maximum quantity released from one tank and the density factor. Since the maximum area of the pool was much larger than the diked area, the area of the evaporating pool used for modeling purposes equaled the total area of the containment structure.  Furthermore, the volume of the dike (6,633 ft3) is much greater than the volume of the spilled toxic liquid released (5,487ft3), ensuring"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000086145,
      "SummaryText": null
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000086145,
      "SummaryText": "revention program provides the procedural backbone for safe operability functions (i.e., continual review of safe operating procedures, review of mechanical integrity of equipment, improved maintenance schedules, increased training, better access to process safety information and hazard awareness for both employees and onsite contractors, and effective emergency response planning), and allows the facility to maintain, review and evaluate the program on a periodic basis.\r\n\r\nEmergency Response Program\r\n\r\nThe release prevention program incorporates the facility's comprehensive emergency response plan. The emergency response program places special emphasis on handling accidental releases of aqueous ammonia and coordination of emergency response with Village of Wrightstown Fire Department and other emergency response organizations, such as the Outagamie County Local Emergency Planning Committees (LEPCs) and local/state police. The response plan details the emergency response structure and includes personnel responsibilities and procedures within that structure. In addition, the plan includes procedures for notification of local agencies in the event of an incident, facility evacuation and decontamination. Finally, the facility reviews emergency preparedness and planning, including plans for conducting emergency response team training and drills.\r\n\r\nFox Energy Center's management is committed to supporting the emergency response organization and its prescribed functions. \r\n\r\nAuditing Program\r\nThe facility uses a contractor to conduct the 3 year assessment.  The company uses a Corporate wide scheduling program to keep track of the assessment due date.\r\n\r\nFox Energy Center has developed an incident investigation program for the facility's ammonia system. \r\n\r\nFive Year Accident History\r\n\r\nThere have been no accidents at the Fox Energy Center within the ammonia system.  If one was to occur the RMP will be updated with the release information within 6 months of the occurrence."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000086145,
      "SummaryText": "that the entire contents of the tank would be captured within the containment structure.\r\n\r\nThe maximum amount of liquid released into the containment structure from the tank is 302,304 pounds of aqueous ammonia, the maximum capacity of the storage tank.  The evaporation rate depends on the concentration in the solution and is calculated based on the liquid factor (ambient) (LFA) of aqueous ammonia and the diked area enclosing the spill.   The LFA takes into account the change in evaporation rate with time due to the decreasing concentration.  The evaporation rate was calculated using the RMP OCAG as 54 lbs/min.\r\n\r\nFor the purposes of this Off-Site Consequence Analysis (OCA), the AFTOX (Air Force Toxics Model) model was used to determine the distance to toxic endpoint. AFTOX is one of EPA's recommended models, used for continuous or instantaneous liquid or gas release from an area source.  The resulting maximum distance to the endpoint of 201 ppm (0.14 mg/L) was calculated as 0.35 miles. At a 0.35 mile radius from the release site, MARPLOT (mapping program) 4.2.4 estimates that 32 people reside in the area.\r\n\r\nFox Energy Center employees thoroughly inspect the aqueous ammonia system per guidance contained in the operations and maintenance procedures. This greatly minimizes the chance that the tanks will fully discharge their contents in a release and minimizes the potential for an offsite impact.\r\n\r\n\r\nAlternative Release Scenario\r\n\r\nFor the facility, the alternative release scenario was assumed to be the structural failure of a 2-inch pipe filled with aqueous ammonia under pressure at 63 pounds per square inch gauge (psig) pressure beyond the confines of the concrete dike. The model assumed that active mitigation (e.g., use of emergency shutdown systems etc.) starts within a reasonable time after the accidental release begins. For this analysis, the total release duration is assumed to be the time period from the beginning of the release event until the release is"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000086145,
      "SummaryText": "totally contained. The total release duration was assumed to be 10 minutes. In this analysis, no passive mitigation measures were assumed. Thus, the ammonia emission rate from the alternative release scenario is given as the loss of 66,500 pounds of aqueous ammonia averaged over a 10-minute period (i.e., 1,670 lbs/min release rate of ammonia to outside air).\r\n\r\nUSEPAs public-domain RMP*Comp model was used to determine the distance to the toxic endpoint of 0.14 mg/L (or 200 ppm). The model predicted a distance of 1.0 mile as the distance to the toxic endpoint due to the specified alternative release. Based on LandView 6 output, the total population within the potential exposure area is 202 individuals with residences being the primary public receptor that could potentially be impacted.\r\n\r\nFox Energy Center employees thoroughly inspect the aqueous ammonia system per guidance contained in the operations and maintenance procedures. This greatly minimizes the chance that there will be any discharge of tank contents in a release and minimizes the potential for an offsite impact.\r\n\r\nRelease Prevention Program\r\n\r\nAs indicated earlier, Fox Energy Center has proactively implemented a release prevention program for the SCR ammonia system. The scope of the release prevention program encompasses various facets of release prevention; e.g., it engenders employee participation, increases employee awareness about the hazards of handling ammonia, establishes safe standard operating procedures and enhances access to process safety information. Fox Energy Center performed a Process Hazards Analysis on the SCR ammonia system during the design process, as well as during commissioning activities for the facility. In addition, reviews of operating procedures, equipment maintenance schedules, and operational safeguards have been performed to identify action items to render the process safer. Fox Energy Center has developed a written release prevention program for the facility. The release p"
    }
  ]
}