{
  "FacilityID": 1000064963,
  "FacilityName": "Kiva Energy- LP Terminal, LLC Rocklin",
  "FacilityStr1": "1545 Nichols Drive",
  "FacilityStr2": null,
  "FacilityCity": "Rocklin",
  "FacilityState": "CA",
  "FacilityZipCode": "95765",
  "Facility4DigitZipExt": "1306",
  "FacilityCountyFIPS": "06061",
  "LEPC": "Placer County Emergency Svcs",
  "FacilityLatDecDegs": "38.810528",
  "FacilityLongDecDegs": "-121.3160",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.kivaenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Kiva Energy- LP Terminal, LLC Rocklin",
  "Company2Name": null,
  "CompanyDUNS": 62457304,
  "Company2DUNS": 0,
  "OperatorName": "Kiva Energy",
  "OperatorStr1": "1262 Dupont Court",
  "OperatorStr2": null,
  "OperatorCity": "Manteca",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95336",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165974",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-05-31 00:00:00",
  "SafetyInspectionBy": "Placer County Environmental Health Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-07-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-07-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-07-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-07-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.81148,
  "FRS_Long": -121.31079,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000081497,
      "AltID": "Propane terminal storage",
      "FacilityID": 1000064963,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000101515,
          "ProcessID": 1000081497,
          "ChemicalID": 98,
          "Quantity": 4536000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000082738,
          "ProcessID": 1000081497,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000068594,
              "Process_NAICS_ID": 1000082738,
              "SafetyReviewDate": "2017-07-19 00:00:00",
              "PHA_Date": "2017-07-17 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-07-19 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Low Pressure Shutdown on Transfer Pumps",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Odorized propane. Operator surveillance and truck loader attendance during product transfer operations; Automatic notification of fire department upon activation of terminal deluge system.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-07-19 00:00:00",
              "TrainingReviewDate": "2017-07-19 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer Based Training (CBT); Safety meetings",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-07-19 00:00:00",
              "EquipmentInspectionDate": "2017-07-10 00:00:00",
              "EquipmentTested": "Water Deluge System",
              "ChangeMgmtDate": "2017-05-31 00:00:00",
              "ChangeMgmtReviewDate": "2017-07-19 00:00:00",
              "PreStartupReviewDate": "2012-11-30 00:00:00",
              "ComplianceAuditDate": "2017-06-30 00:00:00",
              "AuditCompletionDate": "2017-07-31 00:00:00",
              "IncidentInvestigationDate": "2001-02-26 00:00:00",
              "InvestigationChangeDate": "2001-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2016-10-25 00:00:00",
              "HotWorkPermitReviewDate": "2017-07-19 00:00:00",
              "ContractorSafetyReviewDate": "2017-07-19 00:00:00",
              "ContractorSafetyEvalDate": "2017-02-27 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Kiva Energy Rocklin Terminal has a fourteen point safety management and accident prevention program that is is full compliance with the Cal/OSHA Process Safety Management standard and the California Accidental Release Program (CalARP) Risk Management Program regulation.  The plan is designed to insure the safe design, operation, maintenance and modification of the terminal facility.  More details on the safety management / accident prevention program are contained in the Executive Summary.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000084902,
                  "PreventionProgram3ID": 1000068594,
                  "ProcessChemicalID": 1000101515
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000064963,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2016-11-30 00:00:00",
    "ERTrainingDate": "2017-01-10 00:00:00",
    "CoordinatingAgencyName": "Placer County OES",
    "CoordinatingAgencyPhone": "5308865300",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000064963,
      "SummaryText": "Rocklin LPG Terminal\n\nKiva Energy, LP Terminal, LLC\n\nExecutive Summary\n\nRisk Management Plan\n\nEPA Identifier:  1000 0016 5974\n\n\n\n\n\nAccidental Release Prevention and Response\n\n\n\nThe Rocklin LPG Terminal has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of the facility's processes.  It is the practice of Kiva Energy, LP Terminal LLC to implement reasonable controls to prevent foreseeable releases of substances.  However, if a release does occur, trained personnel will respond to, control and contain the release.\n\n\n\nEXECUTIVE SUMMARY (19 CCR 2745.3)\n\n\n\nES - 1.0    FACILITY ACCIDENTAL RELEASE POLICY\n\nThe owners, management, and employees of Kiva Energy - LP Terminal, LLC Rocklin (Rocklin Terminal) located at 1545 Nichols Drive, Rocklin, California in Placer County, are committed to the prevention of any accidental release of odorized, liquefied petroleum gas (LPG, propane). If an accidental release should occur, the facility staff are prepared to work with the local fire department, or other authorities to mitigate any release and minimize the impact of the release to people and the environment. A detailed Consolidated Emergency Response/Contingency Plan (CCP) has been developed and will be implemented in the event of an accidental release.\n\n\n\nES - 2.0    FACILITY INFORMATION\n\nThe Facility is a bulk, hydrocarbon storage and handling facility that receives LPG by rail cars and trucks. The liquefied petroleum gas is stored in the facility's 18 aboveground, pressurized storage tanks prior to being loaded into DOT approved delivery trucks (including those owned by Kiva Energy as well as third-party distributors). The 18 tanks are interconnected into three groups of six vessels (PVI.001-PVI.006, PVI.007-PVI.012, and PVI.013-PVI.018). Each group of six bullets is operated as if it were a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000064963,
      "SummaryText": " single storage vessel.\n\n\n\nA propane compressor is used to create a pressure differential between the rail cars or trucks being unloaded and the receiving vessels. The differential pressure \"pushes\" the LPG from the tank cars or trucks into the storage vessels. \n\n\n\nThe propane stored in the 30,000-gallon, aboveground propane storage bullets (identified below) is transferred to DOT approved LPG transportation trucks of approximately 10,000 gallons or smaller bobtail propane delivery trucks of approximately 3,000 gallons through the use of a liquid propane pump. The storage vessels are protected by an automatic fire protection system (a deluge system) that would activate and automatically initiate a response from the local fire department in the event of a fire within the storage yard.\n\n\n\nVessel                    Vessel Capacity          Maximum Volume          Amount of Propane \n\nPVI.001 - PVI.016         30,000 gals              25,500 gals             107,610 lbs\n\nNet PVI.001 - .016        480,000 gals             408,000 gals            1,721,760 lbs\n\nPVI.017                   29,995 gals              25,496 gals             107,593 lbs\n\nPVI.018                   29,998 gals              25,498 gals             107,602 lbs\n\nTotals                    539,994 gals             450,994 gals            1,936,955 lbs\n\n\n\nThe maximum amount of propane present within the interconnected storage vessels is 1,936,955 lbs. This number represents that volume contained in the 18 storage bullets (as described above). \n\n\n\nDOT Railcar               Vessel Capacity          Maximum Volume          Amount of Propane\n\nRailcar (on siding)       34,500 gals              29,325 gals             123,752 lbs\n\n\n\nRailcars (21) Total       630,000 gals             615,825 gals            2,598,792 lbs\n\n\n\nThe maximum amount of propane contained in the 21 DOT railcars on the Rocklin Terminal's siding is 2,598,792 lbs. That number represents that volume present in the DOT Type 105, 112, or 114 "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000064963,
      "SummaryText": "rail cars.\n\n\n\nThe maximum amount of propane on site is 1,066,819 gallons of liquefied propane. At the assumed density of 4.22 lbs per gallon, that volume of propane has an approximate weight of 4,536,000 lbs. \n\n\n\nES - 3.0    THE WORST-CASE RELEASE SCENARIO AND ALTERNATIVE RELEASE SCENARIO\n\nThe worst-case release scenario and the alternative release scenario were evaluated for each of the regulated processes. The detailed results of the evaluation are provided in the Risk Management Plan (RMP). Administrative controls limit the tank fill capacity to in accordance with NFPA 58 7.4.3.2(B).\n\n\n\nWorst-Case Release Scenario. The worst-case release scenario is the release of propane from a bank of six (6) storage bullets when filled to the greatest amount . The scenario assumes a complete release of 645,660 pounds of propane gas. The pressure wave (with an endpoint of 1 pound per square inch gauge over atmospheric pressure) would extend 0.7 miles (1.12 kilometers). The pressure wave could reach the residential neighborhood located to the southwest of the site as well as the Placer County government center located to the east of the site. There are no sensitive receptors within this blast zone.\n\n\n\nAlternative Release Scenario. The alternative release scenario based on the hazard review (or a more plausible potential incident) is a catastrophic release from a full-sized (10,000 gallon water capacity), tanker truck. This scenario assumes that the tanker leaks from the bottom mounted entry valve and that the entire contents of the truck are released to the atmosphere. The alternative release scenario would produce a pressure wave with an endpoint of 1 pound per square inch gauge over atmospheric pressure that would extend 0.3 miles (0.48 kilometers). The resulting pressure wave has the potential to impact nearby businesses within this blast radius. There are no residences or sensitive receptors within this blast zone. \n\n\n\nES - 4.0    ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe Facilit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000064963,
      "SummaryText": "y has implemented the following prevention program elements.\n\nSafety Information:  Kiva Energy keeps a variety of technical documents that are used to help maintain a safe operating process. These documents address chemical properties. Chemical specific information, including exposure hazards and emergency response/exposure. Treatment considerations is provided in safety data sheets (SDS's).\n\n\n\nKiva Energy also maintains numerous technical documents that provide information about the safe normal operations and emergency shutdown of the process equipment. This information includes materials of construction, design pressure ratings, temperature ratings and electrical rating of equipment.\n\n\n\nThe most recent review of safety information pertaining to the covered processes took place on January 16, 2017. \n\n\n\nHazard Review:  Kiva Energy conducted a hazard review of the operations at the Rocklin Terminal. The hazard review employed the Hazard and Operability Study (HAZOPS) methodology and a Checklist method analysis. The plant operator and operations management identified and evaluated hazards of the process as well as accident prevention and mitigation measures, and the team made recommendations for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\n\n\nThe most recent, complete update of the hazard review was conducted on July 17, 2017. \n\n\n\nOperating Procedures:  The Rocklin Terminal maintains written procedures that address various modes of process operations such as; (1) start-up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown and (6) initial startup of a new process. These procedures provide guidance for experienced operators and also provide the basis for training new operators. Operating procedures include applicable safety precautions that must be taken in the operation of the facility. The procedures are periodically reviewed and annually certified as current and accurat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000064963,
      "SummaryText": "e. The review and certification process involves both operators and technical staff. \n\n\n\nThe operating procedures were last reviewed on October 6, 2016. \n\n\n\nTraining:  The Rocklin Terminal facility staff, and Kiva Energy corporate staff, understand that incidents involving the accidental release of regulated substances can be reduced by having trained operations and maintenance staff. A training program, which incorporates specific operating procedures and safe work practices, is an essential element of an effective prevention program. \n\n\n\nThe Rocklin Terminal has a comprehensive training program for all employees involved in operating the process equipment. The training program was last reviewed on July 19, 2017. \n\n\n\nThe training program is comprised of the following:\n\n* - Initial employee training;\n\n* - Periodic refresher training (provided at least every three years);\n\n* - Training provided as a result of a new equipment addition or modification;\n\n* - Competency testing involving written tests and observation following training; and\n\n* - Training records for each employee.\n\n\n\nMaintenance & Mechanical Integrity:  The maintenance program at the Rocklin Terminal is intended to preserve the mechanical integrity of the process equipment to minimize the potential for an accidental release. The Rocklin Terminal has well established practices and procedures for maintaining process equipment. The basic aspects of this program include \n\n(1) training, \n\n(2) developing written procedures, \n\n(3) performing inspections and tests, \n\n(4) correcting equipment deficiencies. \n\n\n\nIn combination, these activities form a system that maintains the mechanical integrity of the process. \n\n\n\nEquipment inspections are conducted on a monthly or quarterly basis. The frequency of the inspection is based upon regulatory framework impacting the particular system or subsystem. \n\n\n\nThe most recent review of maintenance procedures was conducted on July 19, 2017.\n\n\n\nRMP Change Management (aka Manage"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000064963,
      "SummaryText": "ment of Change):  The Kiva Energy Rocklin Terminal employs a change management system that requires changes to various systems or items, such as process equipment, technology, procedures and other facility functions, be properly reviewed and authorized before being implemented. This program ensures that the safety of the facility is not compromised by the change. Operating and maintenance personnel are provided any necessary training on any changes as part of the change management process.\n\n\n\nPre-startup Safety Review:  The Rocklin Terminal conducts a pre-startup safety review prior to the operating equipment or systems following a modification that requires a change in process safety information. The purpose of the pre-startup safety review is to ensure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment in service. The most recent pre-startup safety review occurred on November 30, 2012. \n\n\n\nCompliance Audits:  Periodic compliance audits to assess the effectiveness of the written plan must be conducted every three years. Plant operations and management personnel participate as audit team members. The audit team develops findings that are forwarded to operations or facility management for resolution.\n\n\n\nRecords of the audits and follow-up documentation are maintained to indicate findings and resolution of findings. The most recent RMP Compliance Audit was conducted on June 30, 2017. The most recent administering agency (Placer County CUPA) an audit of the facility occurred on March 12, 2016.\n\n\n\nIncident Investigation:  The Rocklin Terminal has procedures in place that require prompt investigation of incidents that resulted in or could have reasonably resulted in, a fire/explosion, major property damage, environmental loss, or personal injury. The investigation team documents its findings, develops recommendation(s) to prevent a recurrence and presents these results to the business management"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000064963,
      "SummaryText": " team for resolution. \n\nEmployee Participation:  The Facility must rely upon the operational expertise and training of its employees at all levels and disciplines to ensure safe operations. The Facility has implemented procedures regarding employee participation to ensure consideration of their knowledge and experience in all applicable areas of the prevention program.\n\n\n\nThe most recent revision of employee participation plans was October 25, 2016.\n\n\n\nHot Work Permit:  With regard to hot work that may occur on or near the propane process, the Rocklin Terminal has developed a written contractor evaluation program and a Hot Work Permit program to document the evaluation of the fire prevention and protection requirements. The Hot Work Permit system is implemented prior to allowing activities that could result the generation of sparks (e.g. cutting and grinding) or that involve the use of open flames.\n\n\n\nContractor Safety:  The Rocklin Terminal uses contractors during periods of increased maintenance or construction activities. The Kiva Energy Rocklin Terminal evaluates and qualifies contractors who will work on the systems and equipment. Rocklin Terminal has procedures in place to ensure that contractors \n\n* - perform their work in a safe manner; \n\n* - have appropriate knowledge and skills;\n\n* - are aware of the hazards of their workplace; \n\n* - understand what they should do in the event of an emergency;\n\n* - understand and follow site specific safety rules; and inform plan personnel of any hazards that they find while performing their work. \n\n\n\nEffective implementation of the contractor safety program is accomplished by providing contractors with an orientation session that covers\n\n(1) a process overview, \n\n(2) information about the safety and health hazards, \n\n(3) emergency response plan requirements and \n\n(4) safe work practices prior to beginning their work. \n\n\n\nThe date of most recent review of contractor safety procedures was at July 19, 2017. The date of the m"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000064963,
      "SummaryText": "y response officials, local government officials and industry representatives. The Rocklin Terminal has around the clock communications capability with appropriate Emergency Management Program officials and emergency response organizations (e.g., Placer County Fire). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. The facility's emergency response program is developed in accordance with Section 25503, Division 6.95 of the California Health and Safety Code, Hazardous Materials Business Plan requirements. \n\n\n\nThe emergency response program is updated in when necessary based on modifications made to the plant facilities. The Consolidated Emergency Response/Contingency Plan (CCP) was most recently updated on November 9, 2016.\n\n\n\nES - 7.0    PLANNED CHANGES TO IMPROVE SAFETY\n\nSafety improvement is an on-going process at the Rocklin Terminal. Periodic evaluations will be performed to assess the maintenance of safe conditions. Specific changes to the propane process at the Rocklin Terminal will be implemented as needed.\n\n\n\n"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000064963,
      "SummaryText": "ost recent evaluation of contractor safety performance was February 27, 2017.  \n\n\n\nPropane Regulatory Framework:  The Facility implements the provisions of the following guidelines and regulations for this regulated substance. The California Code of Regulations Title 8 provide the regulatory framework for the design of equipment and use of propane gas. The National Fire Protection Code (NFPA) 58, LP-Gas Code, 2014 Edition is incorporated by reference in Title 8, Section 450. The NFPA 58 standard is supplemented by additional regulations in Title 8 Sections 470 through 494. \n\n* - California Code of Regulations, Title 8, Division 1, Chapter 4, Subchapter 1, Unfired Pressure Vessel Safety Orders;\n\n* - National Fire Protection Association (NFPA) 58 - Liquefied Petroleum Gas Code, 2014 edition;\n\n* - NFPA 70 - National Electrical Code; and\n\n* - United States Department of Labor, Occupational Safety and Health Administration (OSHA), 29 CFR 1910.110, Storage and Handling of Liquefied Petroleum Gases.\n\n\n\nES - 5.0    FIVE-YEAR ACCIDENT HISTORY\n\nOver the past five years there have been no large or small releases which have resulted in any injuries, property damage or offsite consequences. An incident investigation program is in place at the Facility and incident investigations would be implemented if needed. \n\n\n\nES - 6.0    THE EMERGENCY RESPONSE PROGRAM\n\nThe Rocklin Terminal maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment. The procedures describe the manner of response to a fire or explosion if a flammable substance is accidentally released. The procedures address notification of local emergency response agencies if a release occurs. Employees receive training in emergency procedures.\n\n\n\nThe overall emergency procedure program for the Rocklin Terminal is coordinated with the Placer County Emergency Management Program. This coordination involves periodic meetings of the committee, which includes local emergenc"
    }
  ]
}