{
  "FacilityID": 1000061067,
  "FacilityName": "Santa Rosa Water Reclamation Facility",
  "FacilityStr1": "26266 Washington Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Murrieta",
  "FacilityState": "CA",
  "FacilityZipCode": "92562",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.533167",
  "FacilityLongDecDegs": "-117.189333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ranchowater.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 53836235,
  "ParentCompanyName": "Santa Rosa Regional Resources Authority",
  "Company2Name": null,
  "CompanyDUNS": 80103939,
  "Company2DUNS": 0,
  "OperatorName": "Rancho California Water District",
  "OperatorStr1": "26266 Washington Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Murrieta",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92562",
  "OperatorZipCodeExt": null,
  "RMPContact": "Thomas Greene",
  "RMPTitle": "Operations Analyst",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000072146",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-04-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "California ARP Submittal Info",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-11-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-11-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-11-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-10-29 00:00:00",
  "DeRegistrationEffectiveDate": "2020-08-05 00:00:00",
  "AnniversaryDate": "2021-11-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 33.53007,
  "FRS_Long": -117.18842,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Source substituted Chlorine for Bleach. Chlorine removed from site.",
  "_processes": [
    {
      "ProcessID": 1000076282,
      "AltID": "Chlorination",
      "FacilityID": 1000061067,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000077462,
          "ProcessID": 1000076282,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094555,
          "ProcessID": 1000076282,
          "ChemicalID": 62,
          "Quantity": 41000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000594555,
          "ProcessID": 1000076282,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061067,
      "SummaryText": "Facility Description\n\n\n\nThe Santa Rosa Regional Resources Authority (SRRRA) is a newly formed Joint Powers Authority, formed by Elsinore Valley Municipal Water District (EVMWD), Rancho California Water District (RCWD), and Western Municipal Water District (WMWD) to perform all functions for the treatment and disposal of wastewater from its member agencies, including the acquisition, construction and financing for capital projects. \n\n\n\nThe SRRRA held its first Board meeting on December 11, 2015. The Authority's service area encompasses all three districts but focuses on those areas delivering flows to the Santa Rosa Wastewater Reclamation Facility (SRWRF) in Murrieta. The SRWRF is the only treatment plant governed by SRRRA and is the current and expected focus of its efforts. The SRWRF is currently owned and operated by RCWD, and is to be purchased by SRRRA upon successful completion of acquiring the necessary financing. \n\n\n\nThe SRRRA service area is located in the southwestern part of Riverside County, including portions of the City of Temecula and City of Murrieta, and other contiguous land in the unincorporated territory of the County of Riverside. The SRWRF is operated by RCWD. The facility uses and handles chlorine use for disinfection.\n\n \n\nThe chlorine system consists of the chlorine bulk storage system, chlorinators, chlorine rapid mix basins, and chlorine contact basins. Chlorine is stored onsite in sixteen, one-ton cylinders (8 duty, 8 standby).  During normal operations, chlorine is withdrawn from the cylinders and the gaseous chlorine is fed by chlorinators to injectors which mix chlorine with water, forming a solution.  The RCWD water department also stores a maximum of 60 @ 150 pound cylinders in the chlorine room which are for use at RCWD well sites and pump stations throughout the district area. \n\n\n\nA scrubber system is available to treat and prevent releases of chlorine to the atmosphere.\n\n\n\nChemicals Subject to USEPA Risk Management Plan (RMP), Calif"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061067,
      "SummaryText": "ornia Accidental Release Prevention Program (CalARP) and OSHA Process Safety Management (PSM)\n\nRCWD uses chlorine at the SRWRF in quantities large enough to trigger the USEPA Risk Management Plan (RMP) and California Accidental Release Prevention Program (CalARP).  The USEPA RMP threshold quantity for chlorine is 2,500 pounds.  The CalARP threshold quantity for chlorine is 100 pounds.  The maximum quantity present is 41,000 pounds of chlorine.  Chlorine is transported to the facility by truck.  SRWRF stores and uses one-ton cylinders.  There are also 150 pound cylinders stored in the chlorine room for RCWD water department use.\n\n\n\nThe SRWRF is also subject to OSHA Process Safety Management (PSM) regulations for all equipment and operations associated with the chlorine storage and disinfection systems.  The threshold quantity under PSM for chlorine is 1,500 pounds.\n\n\n\nAccidental Releases During Past Five Years\n\n\n\nThe SRWRF has not had any releases of chlorine during the past five years that resulted in any injuries, off-site evacuations, or property damage.  \n\nRCWD's RMP programs include the following to minimize the potential for an accidental release:\n\n      ?    Review of the design of all equipment and controls for the chlorine storage and disinfection systems to verify that they are properly designed and installed.\n\n      ?    Updating of standard operating procedures to include specific information on safety procedures. All procedures are reviewed and certified annually.\n\n      ?    Initial safety training and 3-year refresher training is provided for all operators and maintenance staff.\n\n      ?    Procedures to provide safety information to all contractors.\n\n      ?    Regular inspection of all equipment, monitoring systems and controls, including documentation of all inspections.\n\n      ?    Prompt corrective action for any non-conforming items identified by the regular inspections.\n\n      ?    Safety reviews conducted prior to system startup, if any equipment or operations are "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061067,
      "SummaryText": "modified.\n\n      ?    Investigation of any incidents that have the potential to have caused chlorine releases.\n\n      ?    Periodic evaluation of the safety records of all outside contractors who work on the RMP-regulated systems.\n\n      ?    Development of an effective emergency response program.\n\n      ?    Implementation of an employee participation program to have all plant-wide staff aware of the PSM/RMP program and consulted regarding safety issues.\n\n      ?    Independent audits of the entire PSM/RMP program every three years.\n\n\n\nEmergency Response Procedures\n\n\n\nEmergency procedures are described in RCWD's Emergency Response Plan. In the unlikely event of an accidental release of chlorine, the key elements of RCWD's emergency response program are as follows:\n\n      ?    All plant staff members (including administrative and clerical staff) are trained in the specific elements of the program.\n\n      ?    A team of supervisors and operators are trained, certified and equipped for hazardous materials (HAZMAT) emergency operations to repair accidental releases.\n\n      ?    The plant uses a combination of visual and audible alarms and a plant loudspeaker system to commuicate and alert the staff of a potential accident \n\n      ?    In the event of a large release, the facility would immediately contact a telephone call-down list that includes the Riverside County Fire Department, and several nearby commercial establishments.\n\n\n\nSafety Improvements\n\n\n\nRCWD will continue to improve safety by continually updating process safety information, providing employee training, annually reviewing operating procedures & emergency response plan, encouraging employee participation and incorporating system improvements identified during scheduled hazard reviews.  \n\nBased on safety reviews conducted every 5 years since the 1999 RMP implementation, RCWD has completed the following actions to either reduce the likelihood or severity of potential chemical releases:\n\n\n\n      ?    Installed USFilter scrubber with a t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061067,
      "SummaryText": "reatment capacity of 9,400 pounds in August 1999 to handle chlorine releases.\n\n      ?    Established an annual contract with USFilter to perform monthly maintenance on the chlorine scrubber.\n\n      ?    Replaced the pressure portion of the chlorination system with vacuum design.\n\n      ?    Control valves/regulators are annually maintained by manufacturers.\n\n      ?    Modified the Standard Operation Procedures, titled \"Chlorination Handling\", to include specific information on what operators need to do if a vacuum control valve or regulator fails.\n\n      ?    Installed a leak indication on the local SCADA and detector panels at the Disinfection Building.\n\n      ?    Require all SRWRF visitors (RCWD staff, contractors, landscapers, etc) to sign-in/out at the Operations Building and read SRWRF safety handout regarding chlorine hazards.\n\n      ?    An annual review of the applicable operating limits on temperature, pressure, flow and level of the chlorine system were provided for operators.\n\n      ?    Operators were reminded to complete a Management of Change (RMP Section 12) review for any temporary or permanent change, other than replacement in kind, of chlorine system.\n\n      ?    Internal compliance audits are conducted at 3-year intervals to evaluate process safety and risk management programs and their implementation. \n\n      ?    A Consolidated Emergency Response Plan was prepared for RCWD facilities in August 2014.  An emergency response exercise is conducted annually in conjunction with the local Fire Department. \n\n      ?    At the beginning of 2011, RCWD launched a state-of-the-art computerized infrastructure maintenance and management system (CMMS) for all RCWD operations to facilitate thorough maintenance planning and documentation.  As a result, important safety activities, such as emergency eyewash/shower flushing, are scheduled and reminders are provided to operators.\n\n      ?    To better prepare RCWD operators who attend the deliveries and minimize potential leaks/spills during deliv"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000061067,
      "SummaryText": "ery, the Standard Operating Procedures of the chlorine supplier was reviewed.\n\n      ?    In addition to the RMP, the RMP Manager maintains a separate binder that includes key RMP issues, such as the list of PHA and audit recommendations and implementation schedules, up-to-date process flow diagrams, and current material data safety sheets for quick reference.\n\n\n\nSecurity Improvements\n\n\n\nThe typical security measures at the SRWRF site include the perimeter fence, staff-controlled electric entrance & exit gates and lighting. RCWD installed locks on the Disinfection Building doors that require specifically programmed cyber keys to access the chlorine.  The cyber key system allows RCWD to track which key opens the gate/doors and when the lock is activated.\n\n\n\n      \n\n\n\n"
    }
  ]
}