{
  "FacilityID": 1000021217,
  "FacilityName": "Honda Transmission Manufacturing of America Inc.",
  "FacilityStr1": "6964 State Route 235 N",
  "FacilityStr2": null,
  "FacilityCity": "Russells Point",
  "FacilityState": "OH",
  "FacilityZipCode": "43348",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39091",
  "LEPC": "Logan County LEPC",
  "FacilityLatDecDegs": "40.460000",
  "FacilityLongDecDegs": "-083.880000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 22442727,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Honda Transmission Mfg. of Am. Inc.",
  "OperatorStr1": "6964 State Route 235 N",
  "OperatorStr2": null,
  "OperatorCity": "Russells Point",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43348",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lee Sanders",
  "RMPTitle": "Environmental Staff Engineer",
  "FTE": 1200,
  "OtherEPAFacilityID": "OHD980997142",
  "EPAFacilityID": "100000195647",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "P0105494",
  "SafetyInspectionDate": "2006-05-22 00:00:00",
  "SafetyInspectionBy": "USEPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-04-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-04-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-04-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-11-03 00:00:00",
  "DeRegistrationEffectiveDate": "2017-10-19 00:00:00",
  "AnniversaryDate": "2016-04-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000025746,
      "AltID": "Propane",
      "FacilityID": 1000021217,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000026128,
          "ProcessID": 1000025746,
          "NAICSCode": "33635",
          "_desc": {
            "NAICS_CODE": "33635",
            "NAICS_DESCRIPTION": "Motor Vehicle Transmission and Power Train Parts Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000030630,
          "ProcessID": 1000025746,
          "ChemicalID": 98,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000530630,
          "ProcessID": 1000025746,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000021217,
      "SummaryText": "Honda Transmission Manufacturing of America Inc. (HTM) has developed and implemented two policies which directly impact and influence Honda's accident release prevention and emergency response activities.  First, HTM's Safety Policy expresses HTM's commitment to:\n\n- provide a safe and healthful working environment,\n- conduct its operations with the highest regard for associate safety,\n- continually improve the safety management system, \n- train associates in respects to safety related to their job, and\n- comply with all applicable safety and health requirements and standards mandated by federal, state, and local law.\n\nSecond, HTM's Environmental Policy expresses HTM's commitment to:\n\n- comply with all applicable environmental requirements mandated by federal, state, and local law,\n- operate and continually improve an environmental management system, and \n- implement methods to prevent pollution, conserve natural resources and reduce waste.\n\nWith these policies as a foundation, HTM has made a significant effort to ensure compliance and good management in all areas relating to chemical safety. HTM has implemented the full prevention program and emergency response requirements to comply with both USEPAA?s Risk Management Program (RMP) and OSHAA?s Process Safety Management (PSM) standards.  Facility representatives have an open line of communication with local response agency and local emergency planning committee representatives to establish emergency response procedures necessary to protect our surrounding community and the environment.\n\nA Description of the Facility and Regulated Substances:\n\nHTM manufactures automobile transmissions for Honda autos manufactured across North America.  The facility has a Program 3 covered process due to the onsite storage and use of propane as a raw material.  As part of the manufacturing process, HTM operates heat-treating furnaces to enhance the physical properties of the steel prior to its use.  Propane is used as a raw material in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000021217,
      "SummaryText": " the heat treating process.       \n\nPropane Process:\n\nPropane is stored in an 18,000-gallon storage tank, limited to 15,300-gallons by the National Fire Protection Association (NFPA) Chapter 58.  Propane vapor is used both as fuel and as a raw material.  Propane liquid is passed through a vaporizer, to supply vapor to the Gas Generator and Heat Treating Furnace.  It is also used as a fuel for the furnace pilot.\n\nThe General Accidental Release Prevention Program and Chemical-Specific Prevention Steps at HTM:\n\nSubject to both RMP and PSM standards, this facility implements one combined Process Safety and Risk Management Program.  This program consists of a written management system with a documented approach to compliance with each of the prevention program elements.  The backbone of the program is the Management of Change Procedure.  This procedure enables the facility to initiate and manage change associated with the propane system while effectively maintaining the Process Safety and Risk Management Program.\n\nThe propane storage system is leased from a certified propane supplier.  The supplier is responsible for the transport and unloading of propane at the facility, as well as the mechanical integrity of the equipment and ancillary systems.  The supplier is a certified Honda supplier compliant with the Contractor requirements in the Process Safety and Risk Management Program.\n\nFive-year Accident History:\n\nHTM has not had any RMP reportable releases of propane in the past five years.  \n\nThe Emergency Response Program:\n\nHTM has developed a company-wide Emergency Response Plan (ERP), which explains Honda's commitment to emergency response.  This plan describes the responsibility and procedures of Honda personnel and establishes a system in which the members of each plant's emergency response team work with local emergency response organizations.  This company-wide plan also serves as a model upon which the HTM emergency response team has based its own site specific ER"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000021217,
      "SummaryText": "P.  The HTM emergency response team conducts intensive annual training regarding chemical specific response scenarios and maintains chemical specific response equipment.  The HTM fire brigade is trained on responding to propane incidents.\n\nPlanned Improvements to Improve Safety:\n\nHTM, through its continuous improvement process, is constantly seeking methods to improve safety throughout the operation.  Through the internal audit process and Process Hazard Analysis revalidations every 5 years, the newly installed propane system will be periodically reviewed and consideration given to new means of reducing risk and improving the overall safety performance.\n\nThe Emergency Response Team (ERT) will meet annually with the Logan County ERC and the Indian Lake Joint Fire District representatives to review operations at the plant.  This meeting will include an in-depth tour of the plant."
    }
  ]
}