{
  "FacilityID": 1000078570,
  "FacilityName": "Compass Chemical International LLC",
  "FacilityStr1": "5544 Oakdale Road SE",
  "FacilityStr2": null,
  "FacilityCity": "Smyrna",
  "FacilityState": "GA",
  "FacilityZipCode": "30082",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13067",
  "LEPC": "Cobb County LEPC",
  "FacilityLatDecDegs": "33.818518",
  "FacilityLongDecDegs": "-084.500570",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.compasschemical.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 125498969,
  "ParentCompanyName": "Compass Chemical Internaitonal LLC",
  "Company2Name": null,
  "CompanyDUNS": 125498969,
  "Company2DUNS": null,
  "OperatorName": "Compass Chemical International LLC",
  "OperatorStr1": "5544 Oakdale Road SE",
  "OperatorStr2": null,
  "OperatorCity": "Smyrna",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30082",
  "OperatorZipCodeExt": null,
  "FTE": 55,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000133722",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-08-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-05-28 16:11:39",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-28 16:11:39",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-05-28 16:11:39",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.818518,
  "FRS_Long": -84.50057,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097970,
      "AltID": "Formaldehyde",
      "FacilityID": 1000078570,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122906,
          "ProcessID": 1000097970,
          "ChemicalID": 1,
          "Quantity": 184000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000099210,
          "ProcessID": 1000097970,
          "NAICSCode": "32519",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000083141,
              "Process_NAICS_ID": 1000099210,
              "SafetyReviewDate": "2018-10-11 00:00:00",
              "PHA_Date": "2019-10-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-10-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-02-01 00:00:00",
              "TrainingReviewDate": "2019-02-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Self examination/self study",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-05-14 00:00:00",
              "EquipmentInspectionDate": "2019-05-03 00:00:00",
              "EquipmentTested": "Formaldehyde flow control meter",
              "ChangeMgmtDate": "2016-02-24 00:00:00",
              "ChangeMgmtReviewDate": "2018-04-26 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2018-10-11 00:00:00",
              "AuditCompletionDate": "2019-10-11 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-05-10 00:00:00",
              "HotWorkPermitReviewDate": "2019-05-10 00:00:00",
              "ContractorSafetyReviewDate": "2019-05-10 00:00:00",
              "ContractorSafetyEvalDate": "2019-05-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000103527,
                  "PreventionProgram3ID": 1000083141,
                  "ProcessChemicalID": 1000122906
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000078570,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-06-11 00:00:00",
    "ERTrainingDate": "2012-01-12 00:00:00",
    "CoordinatingAgencyName": "Cobb County Fire & ER Services",
    "CoordinatingAgencyPhone": "7705288000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Clean Air Act"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078570,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nCompass Chemical International is committed to worker and public safety and to the protection of the environment.  We are committed to operating and maintaining all of our processes in a safe and responsible manner, as demonstrated by the resources we invest to prevent accidents.  In addition to ensuring that our employees have the best training in the operation of our processes, we demand that safety be the first priority in the design, installation, operation and maintenance of our processes.\r\nIt is the policy of Compass Chemical International to manufacture and distribute materials with minimal impact on the environment and without injury to our employees, customers, and community.  To that end, Compass Chemical Internationl is committed to:\r\n\r\nThe protection of the health, safety, and security of our employees and facilities;\r\nComplying with all applicable federal, state and local Environmental, Health, Safety, and Security regulations and our other related voluntary requirements.\r\nContinual reduction of the impact of our operations on the environment through ongoing pollution prevention programs;\r\nContinual communications and openness with our stakeholders;\r\nTraining all employees regarding the importance of EHS&S protection and roles they play as stewards.\r\n\r\nWe have implemented maintenance and inspection programs that help ensure site integrity.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  Examples of controls to prevent releases include (1) installation of pressure relief valves to prevent rupture of vessels due to over pressurization, (2) routine visual inspection and thickness checks to ensure vessels and piping are in good condition, (3) using materials of construction that are compatible with the process chemistry, (4) vessel pressure and temperature are continuously monitored and (5) use of carbon and water scrubbers to remove al"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078570,
      "SummaryText": "l emissions.\r\n\r\nHowever, should a release occur, all operators are trained in accordance with standard operating practices to respond in order to control and contain the release.  Mitigation measures that have been included in our design include installation of isolation valves, fire suppression systems in areas where flammable chemicals are present and fire fighting equipment in all process areas, vapor suppression monitors to control vapors,  appropriate PPE and an alarm system for early notification of a release.  The local fire department is also familiar with our site.\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\n\tCompass Chemical International manufactures phosphonates, polymeric dispersants and toll manufactures products for other companies.  Raw materials are received via rail cars, tank trucks and in tote bins and drums.  As a part of the phosphonate manufacturing processes, we use 37% formaldehyde which is covered by the Risk Management Program (RMP) rule (40 CFR 68).  The plant also uses a combination of good design practices, an accidental release prevention program and an emergency response program to ensure the safety of our employees, the public and the environment.  We are committed to operating our facility in a safe and responsible manner.  Following is a brief description of the facility and the RMP regulated chemicals at the site.\r\n\r\n\tThe Smyrna plant is situated on 60 acres.  Covered processes are the phosphonate manufacturing processes which uses the RMP covered chemical Formaldehyde (37% solution).  This chemical, along with others used at the site, are also covered under OSHAs Process Safety Management Regulations.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\tWe take a systematic, proactive approach to preventing accidental releases of our chemicals.  Compass' Quality Management System addresses each of the key features of a successful prevention program, as described in the sections below."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078570,
      "SummaryText": "PROCESS SAFETY INFORMATION\r\n\r\n\tCompass Chemical International maintains a variety of technical documents that describe the chemicals and processes at our facility.  These documents are kept up to date and are available to all employees and address important process parameters such as (1) operating limits for the equipment, (2) design basis and configuration of the equipment and (3) physical properties and hazards associated with each chemical.  \r\n\t\r\n\tChemical information is usually documented within the finished product manufacturing batch sheet which incorporates by reference the raw materials Material Safety Data Sheets (MSDSs) or Safety Data Sheets (SDS).  MSDS/SDSs contain information concerning both the physical properties and the hazards associated with each chemical.  This information typically includes (1) toxicity information, (2) physical data, (3) reactivity and corrosivity  data, (4) thermal and chemical stability data and (5) hazards of mixing substances together.  MSDS/SDSs are available to all employees as well as the emergency responders in our community.  MSDS/SDSs for all Smyrna materials are maintained on site. Manufacturing instruction described on the product batch sheet are followed closely to ensure the finished product is made safely and meets strict quality criteria.\r\n\r\n\tImportant process parameters are also documented and maintained.  Engineering design documents may include (1) operating limits, (2) block flow or simplified process flow diagrams, (3) process chemistry, (4) maximum intended inventories, (5) design basis and configuration, (6) piping and instrumentation diagrams and (7) other information that is important for understanding the design intent, operating limits and hazards of each process.\r\n\r\nPROCESS HAZARD ANALYSES\r\n\r\n\tThe Smyrna plant has a comprehensive program for ensuring that the hazards associated with our processes are identified and controlled.  Each process is examined in detail to ensure that all hazards are identifi"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000078570,
      "SummaryText": "There has been no major spill or release of formaldehyde from our facility in the last five years.\r\n\r\n\tFor any incidents that occur, we complete a non conformance notification (NCN) to identify and correct the root cause(s) of the event.  The following list describes some of the improvements made as a result of these investigations:\r\n-\tTank level alarms and gauges\r\n-\tImplemented a Mechanical Integrity program\r\n-\tUpgraded secondary containment\r\n-\tImplemented a scrubber system check list\r\n-\tInstalled perimeter monitoring devices\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\n\tThe Smyrna plant maintains a written emergency response plan that is designed to protect employees, the public and the environment.  This plan includes personnel safety , evacuation plans and community emergency response notification procedures. The emergency response plan is coordinated with local emergency responders (e.g., the fire department).  This includes periodic meetings with community responders so that they are aware of the hazards of our processes.   This coordination and communication ensures that the public is quickly notified, if necessary, and that action is promptly taken to minimize the consequences of a release."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078570,
      "SummaryText": "ed and that appropriate controls are in place to manage those hazards.\r\n\r\n\tA hazard and operability (HAZOP) analysis is typically used for our process hazard analyses (PHAs).  A team comprising personnel with engineering, operations, environmental and maintenance experience systematically examines each hazard in each section of the process and identifies potential causes and a range of possible consequences.  The team then compares the hazard to the existing set of prevention and mitigation measures designed to contain that hazard, making further recommendations when deemed necessary.  These recommendations are resolved and prioritized by management and tracked until they are implemented.  We update and re-validate each PHA every five years or whenever a significant change is made.  The results and findings from these re-validation studies are documented and retained and recommendations are tracked by management until resolved or completed.\r\n\r\nOPERATING PROCEDURES\r\n\r\n\tOur engineers, operators and supervisors work together to develop and maintain operating procedures that ensure the safe operation of our facility.  These procedures cover all modes of operation, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown and (6) initial start-up of a new or improved process.  Operating procedures are used as a reference by experienced employees and provide a consistent basis for training new employees.  In addition to describing the steps for safely conducting operations, the procedures also contain valuable information about the safe upper and lower limits, consequences of deviations and applicable safety and health information. \r\n\t Smyrna also operates using the Compass batch sheet system.  Batch sheets are the detailed operating procedures for making a batch of product.  The batch sheets include process deviation codes describing the actions to take under various conditions (e.g., high temperature, high pre"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078570,
      "SummaryText": "ssure, loss of cooling, etc) that may be encountered while manufacturing batches containing hazardous chemicals. \r\n\r\nTRAINING\r\n\r\n\tThe Smyrna plant trains workers to safely and effectively perform their tasks.  Employees who are new to a process are given basic training that includes (1) a general overview of the process, (2) the properties of the substances used in the process and their associated hazards and (3) a detailed review of the operating procedures for that process.  Once they have demonstrated their understanding of this initial training, they are paired with an experienced operator to learn their specific job functions and tasks.  After they demonstrate their competence in performing these tasks, they are allowed to work independently. \r\n\r\n\tThrough oral reviews, written tests and on-the-job demonstration, we ensure that our employees understand the training given to them.   All training given to an employee is documented, along with the means used to verify that the training is understood.\r\n\r\nMECHANICAL INTEGRITY\r\n\r\n\tThe Smyrna plant maintains the mechanical integrity of our equipment to prevent equipment failures that could endanger workers, the public or the environment.  Our inspection and testing program helps identify equipment damage or deterioration before the equipment fails.  When a deficiency is found, maintenance personnel will correct the problem and try to identify the root cause(s) of the deficiency so that future problems are avoided.  Our quality assurance system ensures that new or replacement equipment meets the strict design standard required for service in our facility.  The mechanical integrity system includes (1) inspection and testing procedures, (2) replacement equipment specifications, (3) procedures for safe work practices, (4) maintenance personnel training and (5) required documentation.\r\n\r\nMANAGEMENT OF CHANGE\r\n\r\n\tWe review any changes to our processes to determine if new hazards are introduced or existing prevention measures"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000078570,
      "SummaryText": "are threatened.  Except for replacements-in-kind (e.g., replacing a valve with an identical valve), all changes are subjected to a hazard analysis to ensure that (1) new hazards are not inadvertently introduced into the system, (2) safety consequences resulting from the change are addressed, (3) operators in the process are notified of the change and made aware of possible repercussions and (4) all training material, process safety information and operating procedures are updated.  The management of change system applies to changes in the chemicals used, process equipment, technology, procedures and other facility changes.\r\n\r\nPRE-STARTUP SAFETY REVIEW\r\n\r\n\tWhenever a change occurs that requires updating the process safety information, the Smyrna plant performs a pre-startup safety review.  This review ensures that safety features, procedures, personnel and the equipment are prepared for service before the process is restarted.  A pre-startup safety review will generally include field verification of new construction and also serves a quality assurance function by verifying that accident prevention measures are implemented correctly.  Generally, a pre-startup review will ensure that (1) construction and equipment are consistent with design standards, (2) adequate operating, safety and maintenance procedures are in place, (3) training for all affected employees is complete and (4) a Process Hazard Analysis (PHA) has been performed, if necessary.\r\n\r\nINCIDENT INVESTIGATION\r\n\r\n\tThe Smyrna plant trains its employees to promptly investigate each incident that resulted in, or could have resulted in serious injury to employees, the public or the environment.  Incident investigations are designed to determine the facts, identify the root causes and provide recommendations for ensuring that the incident does not recur.  Corrective actions resulting from an incident investigation are tracked until they are resolved.  Incident investigations are conducted in accordance with our"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000078570,
      "SummaryText": "in house policies and documented in Non-Conformance Notices (NCNs) that are defined through our ISO Problem Elimination Procedures (AP-010).\r\n\r\nEMPLOYEE PARTICIPATION\r\n\r\n\tThe Smyrna plant encourages employees to be involved in every aspect of process safety management and accident prevention.  Employees are routinely asked to participate in PHAs, incident investigations, management of change hazard analyses and all other aspects of the prevention program.  Employees have access to all information developed as part of the prevention program and are specifically informed of any changes that occur in their process areas.  \r\n\r\nSAFE WORK PRACTICES\r\n\r\n\tThe Smyrna plant has established safe work practices that ensure the safety of our employees.  Examples of these procedures include (1) hot work permits designed to control spark or flame producing activities, (2) a permit and procedure to control confined space entry and (3) a lockout/tagout procedure for isolating energy sources during maintenance.  These procedures and permits ensure that operations and maintenance activities are performed safely.\r\n\r\nCONTRACTORS\r\n\r\n\tThe Smyrna plant uses contractors for various activities such as maintenance and construction.  All contractors are evaluated to ensure that they are well trained and are able to perform their job function in a safe manner.  A contractors safety record and performance are reviewed during the selection process.  Once a contractor is selected, the plant provides training and procedures to ensure that contractor employees (1) perform their work in a safe manner, (2) are aware of the hazards associated with the area in which they will be working, (3) understand the emergency response procedures and (4) report any hazards they find during their work.  Our personnel periodically monitor contractor activities to ensure they are performing their work in a safe manner.\r\n\r\nCOMPLIANCE AUDITS\r\n\r\n\tAn in house compliance audit is performed annually to help ensure that the"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000078570,
      "SummaryText": "prevention program activities at our facility are adequate and that safety issues are addressed effectively.  Audits are performed by an EHS team that is knowledgeable in our processes, but is independent of our facility to ensure a thorough and complete evaluation.  The audit team systematically evaluates each aspect of the prevention program, ensuring both compliance with the RMP rule and effective hazard prevention.  The results of audits are documented and recommendations are tracked until they are resolved. \r\n\r\nCHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\n\tThe prevention program described previously ensures the safe operation of our facility by providing our employees with a system they can use to safely perform their job functions.  This management system helps prevent hazards associated with equipment failures and human error.  In addition to the prevention program, the Smyrna plant has safety features built into the design of our facility that help to ensure safe process operation for our employees, the public and the environment.  These features may contain or control a release, detect a release or reduce the consequences of a release.  They may also prevent a release by providing strict design standards for process equipment.  The following types of safety features are used in various processes in our facility:\r\n-\tRelease detection monitors\r\n-\tProcedures require that a plan employee be present during loading and unloading operations\r\n-\tValves to permit isolation of the process\r\n-\tAutomated notification systems for some process parameters, (e.g., high level, high pressure)\r\n-\tManual shutdown systems located in the control room\r\n-\tDiked areas designed to contain a release and prevent its spread\r\n-\tPressure relief valves and rupture disks that discharge safely to the atmosphere\r\n-\tFire/Vapor suppression equipment\r\n-\tPersonal Protective Equipment (PPE)- protective clothing, self-contained breathing apparatus\r\n-\tSpill clean up equipment\r\n\r\nFIVE-YEAR ACCIDENT HISTORY"
    }
  ]
}