{
  "FacilityID": 1000043098,
  "FacilityName": "Westlake PVC Corporation",
  "FacilityStr1": "230 Johnson Riley Road",
  "FacilityStr2": null,
  "FacilityCity": "Calvert City",
  "FacilityState": "KY",
  "FacilityZipCode": "42029",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21157",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "37.045833",
  "FacilityLongDecDegs": "-088.350556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.westlake.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 555908813,
  "ParentCompanyName": "Westlake Chemical Corporation",
  "Company2Name": null,
  "CompanyDUNS": 783918485,
  "Company2DUNS": 783918485,
  "OperatorName": "Westlake PVC Corporation",
  "OperatorStr1": "Box 1027",
  "OperatorStr2": "230 Johnson Riley Rd",
  "OperatorCity": "Calvert City",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42029",
  "OperatorZipCodeExt": null,
  "FTE": 68,
  "OtherEPAFacilityID": "42029pcfcwjohns",
  "EPAFacilityID": "100000100115",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "V-05-084R2",
  "SafetyInspectionDate": "2010-11-15 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.04583,
  "FRS_Long": -88.35056,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053145,
      "AltID": "PVC",
      "FacilityID": 1000043098,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064495,
          "ProcessID": 1000053145,
          "ChemicalID": 101,
          "Quantity": 560000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000053901,
          "ProcessID": 1000053145,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000044672,
              "Process_NAICS_ID": 1000053901,
              "SafetyReviewDate": "2014-04-09 00:00:00",
              "PHA_Date": "2013-02-21 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-05-31 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Continuous Monitoring by Computer Control",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Fire water cannons",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-05-13 00:00:00",
              "TrainingReviewDate": "2011-10-14 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-05-25 00:00:00",
              "EquipmentInspectionDate": "2014-03-27 00:00:00",
              "EquipmentTested": "Reactor Reflux Condenser",
              "ChangeMgmtDate": "2014-03-27 00:00:00",
              "ChangeMgmtReviewDate": "2013-09-30 00:00:00",
              "PreStartupReviewDate": "2014-03-28 00:00:00",
              "ComplianceAuditDate": "2013-05-20 00:00:00",
              "AuditCompletionDate": "2014-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-12-11 00:00:00",
              "HotWorkPermitReviewDate": "2013-09-30 00:00:00",
              "ContractorSafetyReviewDate": "2013-09-30 00:00:00",
              "ContractorSafetyEvalDate": "2014-03-10 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Prevention Program 3 applies to all manufacturing operations at the facility.  Since Westlake considers these operations to be a single covered process, implementation of the prevention program does not distinguish between process units at the facility.  Some Process Safety management (PSM) and prevention program elements are applied separately to individual process areas at the facility, such as unit-specific process safety information, process hazard analyses, and operating procedures.  Other elements are applied on a facility-wide basis, with no distinctions between process areas, such as hot work permit requirements, the management of change program, and mechanical integrity.\n\n\n\nWestlake maintains compliance with all elements of OSHA 1910.120, PSM, and other programs: Hot Work SA, Vehicle Entry SA, Critical Spares, Equipment Painting, Internal Safety Audits, Scheduled Maintenance Turn-arounds, Emergency Shutdown Drills, Environmental Monitoring.\n\n\n\nWestlake also maintains an automatic deluge system, heat activation devices, fire hydrants with water cannons for fire protection, curbed concrete pads, dikes for spill protection, and 24-hr computer monitoring of its process.  The facility program includes an extensive employee training program, 24-hr surveillance, and is also ISO 9002 certified.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000053729,
                  "PreventionProgram3ID": 1000044672,
                  "ProcessChemicalID": 1000064495
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043098,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2013-09-30 00:00:00",
    "ERTrainingDate": "2014-03-17 00:00:00",
    "CoordinatingAgencyName": "Marshall County L.E.P.C.",
    "CoordinatingAgencyPhone": "2705271333",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043098,
      "SummaryText": "WESTLAKE PVC CORPORATION\n\nRISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\n\n\nThe Westlake PVC Corporation (Westlake) at Calvert City, Kentucky is a Program 3 facility under the EPA Risk Management Plan rule and is maintained as one covered process with the handling of vinyl chloride.\n\n\n\nThe Westlake Plant Manager has the overall responsibility for the facility and utilizes a staff of safety and environmental professionals to maintain compliance with all aspects of the plants Risk Management Plan.  In addition, all plant personnel are trained to be responsible for carrying out their respective duties in a safe manner using established approved procedures.\n\n\n\nThe Westlake PVC Plant at Calvert City manufactures polyvinyl chloride for use in the plastics industry.  The largest quantity feedstock, vinyl chloride, is used to produce polyvinyl chloride resin through a series of process reactors, stripping operations, and product finishing steps prior to product storage for subsequent shipment to customers.  In 2013, the site produced over 1 Billion pounds of PVC resin and shipped to various customers in the United States and Canada.\n\n\n\nThe Westlake PVC Corporation is committed to continuous improvement in all aspects of safety and environmental performance.  As a site that is under the OSHA Process Safety Management (PSM) regulation, the Calvert City Plant is committed to preventing chemical emergencies.  Prevention of chemical emergencies starts with specifying that all equipment, piping, vessels, tanks, and systems meet all applicable design codes and specifications.  Documentation of these codes and specifications form the basis of Westlake's process information and include flow diagrams, piping and instrument diagrams, process descriptions, and materials of construction and manufacturer's specifications.  Supplementing this information are trained employees working with operating instructions, startup/shutdown instructions, and awareness of consequences of deviations in standa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043098,
      "SummaryText": "rdized procedures.  These programs are designed to keep the processes operating within safe limits that minimize potential adverse impact to employees, the environment, and the surrounding community.\n\n\n\nUnder PSM, skilled employees are involved in all aspects of plant operations, including the Safety & Environmental programs.  Employees are routinely trained and challenged to insure the safety of the plant.  Westlake's safety program consists of many elements, such as use of a Management of Change system for plant operating procedures, hot work and lock-out/tag-out procedures, and regular process hazards analyses using standard industrial practices of hazard and operability (HAZOP) methodologies.  All contractors at the facility are subject to the same rules and procedures as Westlake employees.\n\n\n\nA comprehensive Mechanical Integrity Program includes routine checks and testing of process equipment, tanks, vessels, and piping.  Periodic reviews and auditing of the proper implementation of such programs involves personnel from the production units, the Health, Safety, and Environmental group, and Plant and Corporate Management.\n\n\n\nKey to the Plants prevention programs are the levels of protection intentionally designed into the process.  At the most basic levels, trained operators working with current operating procedures and process safety information keep the processes operating safely and in compliance.  Control systems and instrumentation provide the tools to maintain the process within these limits and provide the information and equipment to keep the process controlled at established operating ranges.  Instrumentation alarms, process safety trips, and interlocks alert the plant operators to deviations and provide early warning of process changes.  In the event of an out-of-range condition, process safety devices, such as pressure relief valves, rupture discs, automatic shutdown, and critical interlocks would become active.  Major process areas may also activate"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043098,
      "SummaryText": " the use of fire sprinklers, sensors, monitor nozzles, and dry or CO2 chemical extinguishers to further mitigate immediate incidents as necessary.\n\n\n\nAnother level of protection to the safety systems are trained emergency responders.  Each shift is led by a Shift Supervisor who, in an emergency, assumes the duties as On-Scene Commander.  Westlake PVC is a member of the Calvert Industrial Mutual Aid Program (CIMAP) and can also count on pooled resources from surrounding plants.  The Calvert City Fire Department is also a responding party to emergencies if needed.  As a member of the Marshall County Local Emergency Planning Committee (LEPC), Westlake stages drills with all emergency responders.  Disaster Emergency Service (DES), LEPC, and the Calvert City Fire Department members periodically tour the facility to familiarize themselves with the plant, hazardous materials, equipment, layout, and personnel.\n\n\n\nThere have been no accidental releases of vinyl chloride at the Westlake PVC Facility in the past five years that have met the EPA Risk Management Program (RMP) reporting requirements. Westlake uses an internal auditing program to evaluate opportunities to improve safety performance and plans to continue using its proven management systems and intra-plant communications as a means to continue to improve safety performance in protecting its workforce and surrounding community."
    }
  ]
}