{
  "FacilityID": 1000045352,
  "FacilityName": "Lineage Seafreeze",
  "FacilityStr1": "206 SW Michigan St",
  "FacilityStr2": null,
  "FacilityCity": "Seattle",
  "FacilityState": "WA",
  "FacilityZipCode": "98106",
  "Facility4DigitZipExt": "1908",
  "FacilityCountyFIPS": "53033",
  "LEPC": "King County LEPC",
  "FacilityLatDecDegs": "47.542222",
  "FacilityLongDecDegs": "-122.338889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "lineagelogistics.com",
  "FacilityEmailAddress": "info@lineagelogistics.com",
  "FacilityDUNS": 115176323,
  "ParentCompanyName": "Lineage Logistics",
  "Company2Name": null,
  "CompanyDUNS": 78545588,
  "Company2DUNS": 0,
  "OperatorName": "Lineage Seafreeze",
  "OperatorStr1": "206 SW Michigan St",
  "OperatorStr2": null,
  "OperatorCity": "Seattle",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98106",
  "OperatorZipCodeExt": "1908",
  "RMPContact": "Marty Houck",
  "RMPTitle": "Facility Manager",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000112512",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-11-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-09-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-09-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-09-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-09-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 47.54104,
  "FRS_Long": -122.33615,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000056247,
      "AltID": "Frozen Warehouse",
      "FacilityID": 1000045352,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000057168,
          "ProcessID": 1000056247,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068583,
          "ProcessID": 1000056247,
          "ChemicalID": 56,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568583,
          "ProcessID": 1000056247,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045352,
      "SummaryText": "1.1  INTRODUCTION\n\n\n\nWelcome to Lineage Seafreeze. We are classified as a Public Refrigerated Warehouse and store frozen food for our customers. To keep the millions of pounds of product frozen, we use Anhydrous Ammonia as a refrigerant. Since we use over 10,000 pounds of ammonia, we actively participate in two major government programs to safely control its use.  Their primary function is dealing with safety and emergency response. The first program is Processes Safety Management (PSM) from OSHA. It deals with how we handle ammonia inside our facility on a day to day basis. The second program is Risk Management Program (RMP) from the EPA. In the event of an ammonia release, RMP is a tool that responding government agencies use to access information about our facility so that they can protect themselves and the surrounding community.\n\n\n\nLineage Seafreeze and its food processing tenant employ 200-300 members of our community. Although they are our primary concern, they are not our only concern. We realize that Ammonia is a hazardous substance and must always be handled in such a way as to prevent any release to the building, environment or the surrounding community. We do not take this responsibility lightly. Seafreeze continues to invest (not just spend) money and time to comply with PSM and RMP. They are not small programs. These programs are not set up and forgotten, but constantly reviewed, updated and implemented. They are part of our day to day operation. It makes the quality of life better for all of us.\n\n\n\n\n\n\n\n1.2   WORST CASE SCENARIO\n\n\n\n\n\nThe worst case scenario does not deal with how a full release happens or with the likelihood that it may or may not happen. It deals only with the idea that it could and if it did, what is the affected area. \n\n\n\nIn our case, a full release in ten minutes would be 16,000 pounds of ammonia which is the total amount our low pressure receiver can hold. Under normal operating conditions, this receiver contains approximately 530"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045352,
      "SummaryText": "0 pounds. But since it is impossible to guarantee that this full condition (which in itself does not constitute a danger of release) could not exist, we must treat it as a possibility. Hence the term worst case scenario. Using the E.P.A.'s RMP Comp software, we have determined using wind, temperature, humidity and topography the affected area around Seafreeze would be 1.2 miles. Outside this radius or toxic end point represents an exposure level, according to the EPA, that is believed a person could be exposed to for one hour without experiencing or developing irreversible health effects that could impair that persons ability from taking protective action. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1.3  ALTERNATIVE RELEASE SCENARIO \n\n\n\nThe alternative release deals with the type of situation that would normally expect to cause a release, such as a broken pipe or valve. For our scenario, we examined the affect from a broken valve stem on a pipe from the condenser. With a release rate of 10 pounds per minute for 10 minutes before it was secured, would have a toxic end point less than .1 miles or less.\n\n\n\n\n\n\n\n1.4  GENERAL ACCIDENTAL RELEASE PREVENTION\n\n\n\nIn order to prevent a worst case or alternate case scenario from happening, we have over 13 prevention programs in operation. These range from doing a Process Hazard Analysis of the entire refrigeration system, which looks for and corrects possible causes of a release, to obvious programs like Training and Lock-Out Tag-Out. Contractors doing work on our system even have their company?s safety programs reviewed and welding certifications checked.  The City of Seattle licenses our 4 refrigeration maintenance employees for Ammonia. Training, testing, program reviews are done at minimum, annually. As an added back up, an outside consultant is hired to do a complete audit of all our programs to ensure that we are doing it right.\n\n\n\n\n\n1.5  FIVE YEAR ACCIDENT HISTORY\n\n\n\nIn the last five years (6-14 thru 6-09), Seafreeze Cold Storage has had no recordab"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045352,
      "SummaryText": "le releases. A recordable release is defined as causing any one of the following. Property damage, injury, death, evacuation, sheltering in place or environmental damage.\n\n\n\n\n\n1.6  EMERGENCY RESPONSE PLAN\n\n\n\nOur Emergency Response Plan is activated by the ammonia detection system or first awareness of ammonia release by an employee. This awareness is communicated to the maintenance department by person, building phone, cell phone or hand held radio. Using written and practiced procedures, an assessment is made as to the severity of the release. If the release area cannot be controlled or ventilated  below 250 Parts per Million (PPM) of ammonia the building is evacuated along with calling 911 to alert the Fire Department and Hazardous Materials Team. Surrounding businesses can be contacted to inform them of the release with instructions to evacuate or shelter in place. If the ammonia detector indicates below 250 PPM the area is ventilated and needed repairs are performed by Seafreeze Refrigeration technicians in appropriate PPE.\n\n\n\nThe ammonia detectors are connected to our off-site 24-hour alarm monitoring company. Electrical power for the alarm monitoring computer, refrigeration equipment computer and fire systems are backed-up by batteries and an automatic standby generator. After normal business hours, the alarm company contacts one of 5 maintenance employees that are trained to operate the refrigeration system. This employee responds to the alarm to make the initial assessment as to what should happen next. \n\n\n\nSeafreeze conducts evacuation drills at least annually involving all personnel on site. The Seattle Fire Department conducts an annual inspection of our facility. The Seattle Fire Departments Hazardous Materials Response Team has toured our facility. At the end of the tour, the team made recommendations that have since been implemented.  Seafreeze has traveled to the Response Team to discuss response activities. Seven days a week, a one and a half hour bu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045352,
      "SummaryText": "ilding wide inspection is made of the entire refrigeration system. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1.7  PLANNED CHANGES\n\n\n\nLineage Seafreeze does not have any major changes planned for the ammonia system, of course we are always looking for ways to improve its safe operation. Since the persons working on the system day to day will be the first affected by any release we have a keen interest in making sure it stays safe.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n6-17-09\n\nExecutive Summary\n\n\n\nC:\\Documents and Settings\\martyhouck\\My Documents\\PSM\\RMP Submit 04\\09 Exec Sum.txt\n\n\n\n"
    }
  ]
}