{
  "FacilityID": 1000046926,
  "FacilityName": "SRH A9-11 Central Lift Station",
  "FacilityStr1": "20 miles N of Big Lake, TX",
  "FacilityStr2": "on Hwy 33, 8 miles E.",
  "FacilityCity": "Big Lake",
  "FacilityState": "TX",
  "FacilityZipCode": "76932",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48383",
  "LEPC": "Reagan County LEPC",
  "FacilityLatDecDegs": "31.4772",
  "FacilityLongDecDegs": "-101.4116",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Laredo Petroleum",
  "OperatorStr1": "15 West 6th St., Suite 1800",
  "OperatorStr2": null,
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74119",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000227248",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-10-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-10-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2025-03-14 00:00:00",
  "DeRegistrationEffectiveDate": "2025-03-14 00:00:00",
  "AnniversaryDate": "2019-10-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 31.4772,
  "FRS_Long": -101.4116,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058498,
      "AltID": "SRH A9-11 Lift Station",
      "FacilityID": 1000046926,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000071473,
          "ProcessID": 1000058498,
          "ChemicalID": 155,
          "Quantity": 236389.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000060452,
              "ProcessChemicalID": 1000071473,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000060453,
              "ProcessChemicalID": 1000071473,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000060454,
              "ProcessChemicalID": 1000071473,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000060455,
              "ProcessChemicalID": 1000071473,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000060456,
              "ProcessChemicalID": 1000071473,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000060457,
              "ProcessChemicalID": 1000071473,
              "ChemicalID": 125
            }
          ]
        },
        {
          "ProcessChemicalID": 1000071468,
          "ProcessID": 1000058498,
          "ChemicalID": 125,
          "Quantity": 233715.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000059479,
          "ProcessID": 1000058498,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000046926,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-02-26 00:00:00",
    "ERTrainingDate": "2014-02-26 00:00:00",
    "CoordinatingAgencyName": "Reagan County LEPC",
    "CoordinatingAgencyPhone": "3258842665",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046926,
      "SummaryText": "he reference documents are maintained on file at the local offices. Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, are provided in material safety data sheets (SDSs) located at the nearest field offices. \r\n\r\nArea 8 SRH A9-11 Central Lift Station will maintain numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\n\r\n\r\nOperating Procedures\r\n\r\nArea 8 SRH A9-11 Central Lift Station has written procedures that address various modes of operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. The procedures are kept current and accurate by revising them as necessary to reflect changes made.\r\n\r\n\r\nTraining\r\n\r\nAll employees involved in operating Area 8 SRH A9-11 Central Lift Station receive basic training in facility operations if they are not already familiar with such operations.  New operators are paired with a senior operator to learn process-specific duties and tasks. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted on an as needed basis.  All of this training is documented for each operator, including the means used to verify that th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000046926,
      "SummaryText": "e operator understood the training.\r\n\r\n\r\nContractors\r\n\r\nArea 8 SRH A9-11 Central Lift Station uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the station has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in event of an emergency, (5) understand and follow site safety rules, and (6) inform facility personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work.  In addition, Laredo Petroleum has a program in place to evaluate contractor safety programs and performance. Facility personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\r\n\r\n\r\nPre-startup Safety Reviews (PSSRs)\r\n\r\nLaredo Petroleum will conduct a PSSR for this facility or modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR team uses checklists to verify all aspects of readiness.  A PSSR involves field verification of the construction and serves as a quality assurance function by requiring that accident prevention program requirements are properly implemented.\r\n\r\n\r\nMechanical Integrity\r\n\r\nMaintenance personnel receive training on (1) an overview of the proce"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046926,
      "SummaryText": "Laredo Petroleum\r\nSRH A9-11 Central Lift Station\r\nExecutive Summary\r\n\r\n\r\nLaredo Petroleum, owner and operator of the Area 8 SRH A9-11 Central Lift Station, has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Laredo Petroleum's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, facility trained personnel will respond to control and contain the release. \r\n\r\n\r\nDescription of the Stationary Source and Regulated Substances\r\n\r\nNatural gas compression of wellhead gas provides gas lift to remove liquids from the wellbore. Gas is gathered from the surrounding wells, sent to the Area 8 SRH A9-11 Central Lift Station for the purpose of compressing the gas.  The high pressure gas is sent back to the wells for the purpose of removing liquids from the wellbore.  Area 8's inlet gas contains enough liquid that liquid extraction is necessary for a portion of the gas so as to use for fuel to power the station compressors and nearby drilling rigs.\r\n\r\nThe process of the compression and dehydration of natural gas and removal of condensate and natural gas liquids occurs in the following way.\r\n\r\nNatural gas from nearby wells is gathered into pipes that extend out into the field in a spider web configuration. The pipes are designed so diameters increase as they grow closer into proximity of the Area 8 SRH A9-11 Central Lift Station and volumes are larger. The gas then enters the SRH A9-11 Central Lift Station.  Oil and water are separated out and sent to 300 bbl produced water and condensate fixed roof atmospheric storage tanks.   The oil is then trucked offsite following custody transfer.  The produced water is sent to a nearby injection well for disposal.  From the separator the gas is measure"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046926,
      "SummaryText": "d through orifice meters prior to being compressed.  After the gas is compressed, it is dried in a glycol dehydrator to remove entrained water.  Downstream from the glycol dehydrator, a portion of the gas is split off. The main stream of gas leaving the glycol dehydrator enters the high pressure pipeline where it is re-distributed back to the wells for the purpose of gas lift. A side stream is routed away from the main stream to go through a gas conditioning (refrigerated J-T) unit.   Purpose is to remove the natural gas liquids so as to provide fuel gas suitable for powering the station and nearby drilling rigs.  The processed fuel gas goes to the compressor fuel system and the fuel gas pipeline.  The pressurized liquids are routed to a pressurized natural gas liquid storage tank for storage. The pressurized liquid is then trucked offsite following custody transfer.\r\n\r\nThe processes at the station are interconnected by piping and fit the EPA's definition of a stationary source in 40 CFR part 68.  The facility contains two sources of regulated substances held over their respective threshold quantities; condensate (pentane) and natural gas liquids.\r\n\r\n\r\nGeneral Accident Release Prevention and Program Information\r\n\r\nThe following is a summary of the accident prevention program in place for the process at the facility. \r\n\r\n\r\nEmployee Participation\r\n\r\nLaredo Petroleum encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating in safety training and E.R.\r\n\r\n\r\nProcess Safety Information\r\n\r\nLaredo Petroleum keeps a variety of technical documents that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information.  T"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000046926,
      "SummaryText": "ss, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.  \r\n\r\n\r\nSafe Work Practices\r\n\r\nLaredo Petroleum has long-standing safe work practices in place to help ensure worker and process safety.  Examples of these include, (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work) and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\n\r\n\r\nIncident Investigation\r\n\r\nLaredo Petroleum promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts, and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  \r\n\r\n\r\nCompliance Audits\r\n\r\nTo help ensure the safe operation of all facilities, Laredo Petroleum periodically conducts an audit to determine the safe operation and compliance of its facilities.  Compliance audits are conducted on a periodic basis.  Both hourly and staff personnel participate as audit team membe"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000046926,
      "SummaryText": "rs.  The audit team develops findings that are forwarded to facility management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented.\r\n\r\n\r\nChemical - Specific Prevention Steps\r\n\r\nThe processes at Area 8 SRH A9-11 Central Lift Station have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to the prevention of accidental releases of regulated substances in the facility.  \r\n\r\n\r\nUniversal Prevention Activities\r\n\r\nThe programs summarized previously are applied to all RMP-covered processes at Area 8 SRH A9-11 Central Lift Station. Collectively, these prevention program activities prevent or mitigate potential accident scenarios that could be caused by equipment failures and human errors.\r\n\r\n\r\nSpecialized Safety Features\r\n\r\nArea 8 SRH A9-11 Central Lift Station  has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release.  The following types of safety features are used in the covered process:\r\n\r\nRelease Detection\r\n\r\n1.\tTanks are gauged\r\n2.\tTanks/vessels are equipped with level and pressure sensors\r\n3.\tHigh/Low alarms and shutdowns\r\n\r\nRelease Containment/Control\r\n\r\n1.\tProcess relief valves venting vapors to the atmosphere to prevent vessels from rupturing\r\n2.\tValves to permit isolation of the process (manual and automated)\r\n3.\tAutomated shutdown systems for specific process parameters (e.g., high pressure)\r\n\r\n\r\nRelease Mitigation\r\n\r\n1.\tTrained emergency response personnel\r\n2.\tPersonal protective equipment (e.g., chemical protective clothing)\r\n3.\tSPCC Plan\r\n4.\tFire extinguishers\r\n\r\n\r\nEmergency Response Program Information\r\n\r\nArea 8 SRH A9-11 Central Lift Station will maintain a written emergency response program, which is in place to protect worker and public safety as well a"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000046926,
      "SummaryText": "s the environment.  The program consists of procedures for responding to the release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements. Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to facility processes.  \r\n\r\nThe overall emergency response program for Area 8 SRH A9-11 Central Lift Station is coordinated with the Reagan County Local Emergency Planning Committee (LEPC). The Hon. Larry Isom is the contact for the LEPC (325/884-2665). Area 8 SRH A9-11 Central Lift Station has around-the-clock communications capability.  Laredo Petroleum operators are automatically called in the event of a process upset.  The operator will then call the appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  Laredo Petroleum conducts periodic emergency drills that involve emergency response organizations, and Area 8 SRH A9-11 Central Lift Station provides annual refresher training to local emergency responders regarding the hazards of regulated substances in the facility.  \r\n\r\n\r\nFive - Year Accident History\r\n\r\nAccording to Laredo Petroleum personnel, there have been no reportable incidents in the last 5 years. \r\n\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nLaredo Petroleum, owner and operator of Area 8 SRH A9-11 Central Lift Station, has a long-standing commitment to worker"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000046926,
      "SummaryText": "and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Laredo's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, facility trained personnel will respond to control and contain the release."
    }
  ]
}