{
  "FacilityID": 1000070086,
  "FacilityName": "Barrel Ten Quarter Circle Land Company",
  "FacilityStr1": "21801 Highway 120",
  "FacilityStr2": null,
  "FacilityCity": "Escalon",
  "FacilityState": "CA",
  "FacilityZipCode": "95320",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.800278",
  "FacilityLongDecDegs": "-121.040556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Bronco Wine Company",
  "Company2Name": null,
  "CompanyDUNS": 68861202,
  "Company2DUNS": 0,
  "OperatorName": "Barrel Ten Quarter Circle Land Co.",
  "OperatorStr1": "21801 Highway 120",
  "OperatorStr2": null,
  "OperatorCity": "Escalon",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95320",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rene Soto",
  "RMPTitle": "Maintenance Manager",
  "FTE": 52,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000188628",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-01-16 00:00:00",
  "SafetyInspectionBy": "San Joaquin County CUPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-03-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-06-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-06-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-06-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000088072,
      "AltID": "Refrigeration System",
      "FacilityID": 1000070086,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000089293,
          "ProcessID": 1000088072,
          "NAICSCode": "31213",
          "_desc": {
            "NAICS_CODE": "31213",
            "NAICS_DESCRIPTION": "Wineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000110282,
          "ProcessID": 1000088072,
          "ChemicalID": 56,
          "Quantity": 95325.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000610282,
          "ProcessID": 1000088072,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000088073,
      "AltID": "Sulfur Dioxide",
      "FacilityID": 1000070086,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000089294,
          "ProcessID": 1000088073,
          "NAICSCode": "31213",
          "_desc": {
            "NAICS_CODE": "31213",
            "NAICS_DESCRIPTION": "Wineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000110283,
          "ProcessID": 1000088073,
          "ChemicalID": 49,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000610283,
          "ProcessID": 1000088073,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000070086,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe CalARP Program developed for this facility is designed to prevent the occurrence of, or minimize the consequences of, catastrophic releases by stating and implementing our policies and procedures for the management of process hazards in design, construction, start-up, operation, inspection, maintenance, and the other matters addressed in the CalARP Program regulation.  This comprehensive program has been developed to enable all those who may be affected to be able to identify and understand the hazards posed by the ammonia refrigeration system and the sulfur dioxide process.\n\n\n\nEmployees are provided with hazard awareness training and participate in the implementation of the Program.  This Program document, as well as the other documents and reports that are created pursuant to this Program, are made accessible to our employees and to other affected persons in accordance with applicable requirements and the provisions of the CalARP Program.\n\n\n\nEmergency planning and response measures have been developed and implemented for proper and safe evacuation and notifications to outside emergency responders.  These measures reflect the established policies of this facility for ensuring the health and safety of all employees and those who may be on site or in the area in the event of an accidental release of ammonia or sulfur dioxide.\n\n\n\nThis CalARP Program is regularly reviewed and updated as required, and whenever necessary to reflect new or modified tasks and procedures.  Facility personnel ensure that safety and environmental policies are implemented at this facility by conducting periodic compliance inspections.\n\n\n\nThis CalARP Program includes additional elements as required for compliance with the federal EPA Accidental Release Prevention Program requirements and the OSHA PSM Standard.  The use of the term \"CalARP Program\" throughout the program documents implies inclusion of all applicable accidental "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000070086,
      "SummaryText": "release prevention and process safety management requirements.\n\n\n\n \n\nTHE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n\n\nThis facility operates one (1) anhydrous ammonia refrigeration system and one (1) sulfur dioxide process.\n\n\n\nFacility Description\n\n\n\nBarrel 10 Quarter Circle, produces wines at its San Joaquin County facility in Escalon, California.  Anhydrous ammonia is used to provide refrigeration for wine and glycol chilling and sulfur dioxide is used to treat incoming grapes as a fumigant and disinfectant.\n\n \n\nThe plant entrance is located along State Highway 120 (Yosemite Avenue) approximately 1-1/2 miles west of the town of Escalon, California.   The facility is bordered by Sexton Road to the east and South Van Allen Road to the west.  The facility lies approximately eight (8) miles east of State Highway 99 and the City of Manteca.  The area around the plant is largely agricultural with a few residences in the area.\n\n\n\nThe facility maintains approximately 30 full time employees on site.  The plant operates three (3) shifts five (5) days a week throughout the year, except during the grape harvest season, when operation extends to seven (7) days a week and additional employees are hired for the season.  \n\n\n\nThe plant is comprised of offices, production and laboratory buildings, loading docks, warehouses, parking, tank farms, and wastewater ponds.  The facility is fenced along the entire perimeter and there is a security guard shack at the entrance.\n\n\n\nThe Emergency Evacuation Assembly Areas are located as required for potential evacuations.  Employees are trained and drill for alarm responses and evacuations annually.\n\n\n\nProcess Description - Ammonia Refrigeration\n\n\n\nThe refrigeration system uses anhydrous ammonia as the heat transfer fluid.  The ammonia refrigeration process is a closed-loop, single-stage, mechanical refrigeration system, with little or no need for operator involvement.  The system is automatically controlled by a programmable logic co"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000070086,
      "SummaryText": "ntroller, which minimizes the potential for human error.  The system operates on the principles of flooded and recirculated liquid heat exchange.\n\n\n\nFacility maintenance mechanics regularly monitor process parameters, including pressure, temperature, and vessel levels for proper operation.  Abnormal conditions may be corrected by mechanics when trained for the task and when safe to do so but are typically referred to the refrigeration contractor technician.  A qualified ammonia refrigeration company provides service, design, and most regular preventive maintenance for the system.\n\n\n\nAll refrigeration system equipment, including jacketed wine tanks, chillers, compressors, condensers, and receivers is located outside.\n\n\n\nSystem components are connected with steel piping approved for ammonia refrigeration service and the system includes numerous safety devices, detection systems, alarms, and control valves.  Physical protective measures and emergency shower and eyewash stations are located as required to improve safety.  Oil pots are provided at various pressure vessels for periodically draining accumulated refrigerant oil safely.\n\n\n\nPiping and Instrumentation Diagrams (P&ID) provide a graphical description of the system.  Written Standard Operating Procedures (SOP) describe the modes of operation, safety and health considerations, operating limits, and the safety systems and their functions.  The ammonia refrigeration system is audited regularly for mechanical integrity and complies with industry standards and the applicable codes and regulations.\n\n\n\nThe ammonia refrigeration system at Barrel 10 Quarter Circle is used for controlling fermentation, chilling wine (referred to as \"cold stabilization\") and chilling grape juice.  The system is also used to produce cold glycol which is used for temperature controlled warehouse storage.  The system contains approximately 95,325 lbs. of ammonia.\n\n\n\nJuice and wine are stored in tanks.  The typical tank is constructed of epoxy "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000070086,
      "SummaryText": "coated stainless steel and insulated with high density foam insulation.  A small number of tanks have ammonia jackets installed.  The juice or wine stored in tanks without jackets is pumped to a shell and tube heat exchanger for temperature control.\n\n\n\nThe refrigeration cycle operates on the principle of the latent heat of vaporization and the transfer/absorption of heat that occurs as a result.  The compressors provide high-temperature, high-pressure vapor as ammonia vapor is compressed.  Next, the evaporative condensers remove the heat of compression generated when the ammonia vapor is compressed.\n\n\n\nThe result of evaporative condensing is a high-pressure liquid, which drains to the receiver and is made available for cooling via control valves to other parts of the system.  As cooling is required in chillers or wine tank jackets, the liquid is metered and pumped from the suction accumulators.  As the liquid ammonia passes through the cooling coils or chillers, it absorbs heat from the wine and subsequently expands and vaporizes as the pressure of the ammonia drops.\n\n\n\nThe resulting liquid/vapor mixture is returned from the chillers to the accumulators, where the liquid and vapor are separated to protect the compressors from liquid slugging.  Ammonia vapor is returned to the compressors to repeat the cycle and accumulated liquid ammonia at the bottom of the vessel supplies the pumps.  \n\n\n\nEmergency switches are located in the Compressor Area for emergency shutdown. \n\n\n\nThe system operating set points are +20 ??F S.S.T. (+35 psig) and +90 ??F S.D.T. (+167 psig).\n\n\n\nThe Primary System Components include:\n\n\n\nEQUIPMENT    QUANTITY\n\nReciprocating Compressors w/ separate oil separators    2\n\nScrew Compressors w/ integral oil separators    2\n\nEvaporative Condensers    4\n\nHigh-Pressure Receivers    2\n\nSuction Accumulators    2\n\nLiquid Transfer Units    3\n\nWine Chillers (Shell & Tube Heat Exchangers)    13\n\nGlycol Chillers (Shell & Tube Heat Exchangers)    1\n\nRecirculator Package with Pumps    1\n\nPilot "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000070086,
      "SummaryText": "Receiver (liquid injection compressor cooling)    1\n\nOil Pots    3\n\nJacketed Wine Tanks (recirculated liquid)    31\n\nDiffusion Tank    2\n\nRental Ammonia Compressor Trailer Units    2\n\n \n\nProcess Description - Sulfur Dioxide Process\n\n\n\nSulfur dioxide gas is added to wines and juices to prevent unwanted microbial activity.  Sulfur dioxide is also used to protect the headspace (air space at the top of a vessel) of storage tanks and barrels.\n\n\n\nSulfur dioxide is transferred from one-ton cylinders to 6 lb., 25 lb., and 100 lb. portable cylinders.  The portable cylinders are transported to the point of use for injection into fruit juice, pulp and/or skins to inhibit unwanted microbial activity.\n\n\n\nNo chemical reactions or special process temperatures need to be maintained.  The process involves the simple transfer from a larger vessel to a smaller one.  Plant nitrogen is connected and opened to the vapor valve of the one-ton cylinder to assist in the transfer of liquid sulfur dioxide.  The amount (pounds) loaded into the canister is monitored by the operator observing the liquid level sight glass on the canister.\n\n\n\nThe operation is conducted outdoors.  A bleed line is available during portable tank filling.  A second bleed line is also available to purge residual sulfur dioxide within the transfer lines before hoses are disconnected.  These bleed lines are connected to a scrubber system which is continuously fed water.  Since sulfur dioxide is soluble in the water (forming sulfurous acid), no emissions are produced.  Clean water passes through the scrubber continuously, thus, the water discharged to drain doesn't become over saturated with sulfur dioxide and a highly corrosive acid is not produced.\n\n\n\nSulfur dioxide from a one-ton cylinder is injected into the must line containing juice to inhibit fermentation.  The feed rate is controlled by a mass flow meter and metering pump.  Sulfur dioxide is soluble in water and juice, so no emissions are produced.  The quantity of sulfur dioxide"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000070086,
      "SummaryText": " added is determined by the wine maker.  The metering pump is interlocked with the must pump such that sulfur dioxide is only added when the must pump is on.\n\n\n\nSulfur dioxide gas is also used to prevent the growth of harmful bacteria in full and empty barrels in the Barrel Room.  Sulfur dioxide is injected from a 6 lb. dispenser into the head space of barrels before and after they are filled with wine for aging.\n\n \n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe release prevention steps listed in the CalARP Program manual (Chapter 7 (Release Prevention Program)) include the critical elements for preventing accidental releases.  These steps include all elements as required for Program 3 release prevention.  Specifically, the elements of the release prevention Program 3 require and include:\n\n\n\n1.    Process Safety Information\n\n2.    Process Hazard Analysis\n\n3.    Operating Procedures\n\n4.    Training\n\n5.    Mechanical Integrity\n\n6.    Management of Change\n\n7.    Pre-Startup Safety Review\n\n8.    Compliance Audits\n\n9.    Incident Investigation\n\n10.    Employee Participation\n\n11.    Hot Work Permit\n\n12.    Contractors\n\n\n\nThis facility involves employees in the program, qualifies contractors before hire, conducts pre-startup safety and work assessments, implements hot work procedures and permitting, and manages changes in the processes with comprehensive procedures and documentation.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nNo releases have occurred that are subject to the California Accidental Release Prevention Program and federal EPA Accidental Release Prevention Program five-year accident history reporting requirements.\n\n\n\n \n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nBarrel 10 Quarter Circle maintains an Emergency Planning & Response Program as described in the Emergency Action Plan.  As a facility that will not respond to uncontrolled releases, the emergency response measures primarily include the safe evacuation of all personnel and notification to outside emergency respon"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000070086,
      "SummaryText": "ders.  Incidental releases that do not pose an imminent safety hazard may be abated by employees or contractor who are trained to provide such a response, are wearing the appropriate personal protective equipment (PPE), and are authorized by Barrel 10 Quarter Circle to perform such activities.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\n1. Modify maintenance program activities and documentation.\n\n2. Review impact protection for system equipment.\n\n3. Review safe work practices.\n\n4. Training program modifications.\n\n5. Revise ammonia system operating procedures.\n\n6. Improve labeling of equipment and piping.\n\n7. Emergency response plan modifications.\n\n8. Evaluate several equipment changes.\n\n9. Review ammonia system control drawings for currency.\n\n10. Develop accurate and complete P&IDs for the sulfur dioxide system.\n\n11. Develop accurate and complete operating procedures for the sulfur dioxide system."
    }
  ]
}