{
  "FacilityID": 1000082428,
  "FacilityName": "Wilbur-Ellis Company (Morenci, MI)",
  "FacilityStr1": "13813 Munson Highway",
  "FacilityStr2": null,
  "FacilityCity": "Morenci",
  "FacilityState": "MI",
  "FacilityZipCode": "49256",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26091",
  "LEPC": "Lenawee County LEPC",
  "FacilityLatDecDegs": "41.714649",
  "FacilityLongDecDegs": "-84.32623",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "http://ag.wilburellis.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6913479,
  "ParentCompanyName": "Wilbur-Ellis Company LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Wilbur-Ellis Company LLC",
  "OperatorStr1": "13813 Munson Highway",
  "OperatorStr2": null,
  "OperatorCity": "Morenci",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49256",
  "OperatorZipCodeExt": null,
  "RMPContact": "James Ream",
  "RMPTitle": "Manager",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169881",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-05-08 00:00:00",
  "SafetyInspectionBy": "MDARD",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-02-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-09-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-09-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-09-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 41.71147,
  "FRS_Long": -84.32852,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000102975,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000082428,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000104248,
          "ProcessID": 1000102975,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000128940,
          "ProcessID": 1000102975,
          "ChemicalID": 56,
          "Quantity": 506000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000628940,
          "ProcessID": 1000102975,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082428,
      "SummaryText": "The Plan describes procedures implemented by Wilbur-Ellis Company, Agribusiness Division (\"Wilbur-Ellis\") to prevent accidental releases of ammonia that could cause harm to the public and the environment from short-term exposures.  The Plan includes an analysis of the potential offsite consequences of an accidental release, a five-year accident history, and a release prevention and emergency response program.  \n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nWilbur-Ellis has implemented release prevention and emergency response procedures to minimize the potential for accidental releases of hazardous materials.  Emergency response procedures including evacuation procedures and notification procedures have been implemented by Wilbur-Ellis.  In addition, Wilbur-Ellis has developed operating procedures and preventative maintenance activities to reduce the likelihood of accidental releases.\n\n\n\nThis Plan and the emergency response procedures document the accidental release prevention, safety, and emergency policies in place at Wilbur-Ellis.\n\n\n\nDescription of Stationary Source and Regulated Substances\n\n\n\nWilbur-Ellis is located at 13813 Munson Highway in Morenci, Michigan (the \"facility\").  Wilbur-Ellis is a retailer of fertilizer in the form of anhydrous ammonia stored under pressure.  There are two anhydrous ammonia storage tanks located at the facility with capacities of approximately 30,000 gallons and 16,500 gallons.  The anhydrous ammonia is transferred from the storage tanks into 1,000-gallon and 1,500-gallon nurse tanks.  A maximum total of 56 nurse tanks containing anhydrous ammonia are stored at the facility at any given time.  The contents of the nurse tanks are sold to the local farming community for use as fertilizer.  \n\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n  \n\nWilbur-Ellis has developed and implemented this Plan with the objective of complying with the requirements and guidelines set fort"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082428,
      "SummaryText": "h by the Federal Risk Management Plan program.  The Plan's purpose is to enhance the facility's existing safety programs implemented at the site to reduce the possibility of accidental releases of anhydrous ammonia that could cause harm to employees, the public and the environment.  The emergency response program, documented in the emergency response procedures, includes accidental release prevention and chemical specific prevention steps.\n\n\n\nWilbur-Ellis ensures that equipment meets the appropriate industry standards prior to use.  Wilbur-Ellis implements operating procedures and maintenance procedures in accordance with manufacturer and industry specifications to prevent accidental releases at the facility.  Chemical specific prevention steps implemented at the site include excess flow valves, pressure relief valves, emergency shut off valves with cables that run along the length of the horizontal storage tanks for quick access, and ammonia training for personnel.\n\n \n\nFive-Year Accident History\n\n\n\nThere have been no qualifying accidents involving ammonia in the five-year period prior to the completion of this Plan.\n\n\n\nEmergency Response Program\n\n\n\nThe facility coordinates with the Morenci Fire Department (\"fire department\") regarding specific actions to be taken in response to an accidental release of anhydrous ammonia.  The facility has established emergency evacuation procedures to evacuate the site and notify the appropriate agencies regarding a release.  The facility's emergency response program is documented in the facility's Emergency Response Procedures.  The emergency procedures contain the following key elements:\n\n\n\n1.    Procedures for informing local agencies responsible for responding to accidental releases.\n\n2.    Information on emergency health care.\n\n3.    Emergency response training for employees.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nPlans to improve safety at the facility were developed based on the results of compliance audits, hazard reviews, and a Ri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082428,
      "SummaryText": "sk Management Plan (RMP) site inspection conducted by an outside contractor.  The Branch Manager is currently working on an implementation schedule for the recommended actions.  Recommended actions include the following:\n\n\n\n1.Discuss installing fence with area management. \n\n2. Request statement from trucking company certifying adequacy and maintenance of equipment. \n\n3. Check to see if nameplate is on the top of the tank. \n\n4. Place fire extinguisher near tank area when tank is in use. \n\n5. Request statement from trucking company that appropriate and dedicated hoses are used. \n\n6. Place fire extinguisher near riser/loadout are when tank is in use. \n\n7. Place portable air horn in area during transfer operations.  \n\n\n\nTo improve the safety of ammonia and all other aspects of operations, Wilbur-Ellis has implemented a comprehensive, risk-based safety management process to help guide employees to improved safety performance. The safety management process, branded Guiding People to Safety (GPS), is designed to be implemented in four steps, step one comprising of the foundation and fundamental elements of a strong safety program and positive safety culture. The GPS process provides guidelines for each safety program that describes methods for effective implementation. The GPS program includes measures for tracking progress and success and for addressing opportunities for improvement within the process and individual safety programs. These measures include action tracking software to facilitate timely corrections of deficiencies and recommended improvements identified during inspections, audits, and hazard analyses. Wilbur-Ellis is committed to preventing incidents cultivating a positive safety culture throughout the company. The mission of our Environmental Health, Safety, and Security (EHSS) team is to drive effective results in reducing incidents and employee injuries by combing the GPS process with a positive safety culture. \n\n"
    }
  ]
}