{
  "FacilityID": 1000057489,
  "FacilityName": "Ingleside Ethylene LLC, Markham",
  "FacilityStr1": "6600 FM 1468 North",
  "FacilityStr2": null,
  "FacilityCity": "Clemville",
  "FacilityState": "TX",
  "FacilityZipCode": "77414",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48321",
  "LEPC": null,
  "FacilityLatDecDegs": "28.998607",
  "FacilityLongDecDegs": "-96.147902",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79741081,
  "ParentCompanyName": "Occidental Chemical Corp.",
  "Company2Name": null,
  "CompanyDUNS": 6908354,
  "Company2DUNS": 0,
  "OperatorName": "Occidental Chemical Corp",
  "OperatorStr1": "P.O. Box CC",
  "OperatorStr2": null,
  "OperatorCity": "Ingleside",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78362",
  "OperatorZipCodeExt": null,
  "RMPContact": "Aron Baggett",
  "RMPTitle": "Environmental Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000232624",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Railroad Commission of Texas",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-02-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-02-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-02-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-02-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000071953,
      "AltID": "Ethylene Storage",
      "FacilityID": 1000057489,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000073134,
          "ProcessID": 1000071953,
          "NAICSCode": "48691",
          "_desc": {
            "NAICS_CODE": "48691",
            "NAICS_DESCRIPTION": "Pipeline Transportation of Refined Petroleum Products"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000088841,
          "ProcessID": 1000071953,
          "ChemicalID": 95,
          "Quantity": 347081.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 95,
            "ChemicalName": "Ethylene  [Ethene]",
            "CASNumber": "74-85-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000588841,
          "ProcessID": 1000071953,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057489,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nOccidental Chemical Corporation (OxyChem), a wholly owned subsidiary of Occidental Petroleum Corporation (OPC), is a leading producer of electrochemicals, proprietary products, plastics, and resins.   Occidental Chemical Corporation's Ingleside Plant is an integral part of the OxyChem commitment to the industrial chemicals market. The new IELLC Markham Ethylene Storage and Surface facility contains a salt dome that serves as a reservoir to store excess ethylene produced by the IELLC Ingleside ethylene unit. Ethylene flows to and from the Markham salt dome storage well via a bi-directional pipeline. The pipeline traverses 114 miles between the IELLC ethylene production unit near Ingleside, Texas and the salt dome storage facilities near Markham, Texas. \n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nOxyChem is committed to operating the IELLC Markham Ethylene Storage and Surface facility in a manner that is safe for its workers, the public and the environment. It is our policy to adhere to all applicable Federal, State and local rules and regulations, industry standards and best practices. As part of this commitment, OxyChem has established systems to help ensure safe operation of the processes at this facility, which includes the prevention of accidental releases of hazardous substances and emergency response programs. OxyChem is focusing on individual employee responsibilities for working safely and achieving the targets of zero safety and environmental incidents. This program includes training of all employees on the basic values and beliefs that all accidents and chemical releases are preventable and it is the responsibility of every employee to ensure that they are aware of the goals of zero incidents and will be held accountable for their actions.\n\n\n\nTHE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe Markham Ethylene Storage and Surface facility, located on FM 1468 North near Markham and Bay City, Texas, will sto"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057489,
      "SummaryText": "re the important commodity chemical ethylene. The Markham Ethylene Storage and Surface site has three regulated substances that are products, intermediates, or raw materials:\n\n\n\nEthylene, Methane, Ethane\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC\n\nPREVENTION STEPS\n\nThe following sections briefly describe the elements of the Ingleside Plant's and Markham facility's Program 3 prevention program that address EPA's RMP rule prevention program requirements. Each of the sections listed below are documented and maintained in two documents at the plant; The Plant Safety and Health Procedures Manual and the OxyChem Process Reliability Guidelines Manual. Each of these manuals is updated regularly. The Ingleside Plant's and Markham facility's prevention program has been prepared for compliance with OSHA's Process Safety Management (PSM) and the EPA's Risk \n\n\n\nManagement Rule (RMP) and consists of the following elements:\n\nProcess Safety Information Pre-startup Review Management of Change\n\nProcess Hazard Analysis Compliance Audit Mechanical Integrity\n\nOperating Procedures Employee Participation Contractor Safety\n\nTraining Hot Work Permits\n\nEmergency Response Incident Investigation\n\n\n\nBefore using a hazardous substance at the Ingleside Plant and Markham facility, less hazardous alternatives are always considered. When a hazardous substance is used at the Ingleside Plant or Markham facility, OxyChem reviews the potential for an accidental release of this substance, which could adversely affect plant workers, the public and the environment, and takes steps to prevent any such effects. This is accomplished through the facility's Management of Change (MOC) and Process Hazard Review (PHR) procedures, which are followed for all new installations or modifications of existing processes. The equipment is carefully designed, installed, operated and maintained to reduce the likelihood of an accidental release. Industry and government standards are closely adhered to i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057489,
      "SummaryText": "n the design, construction and operation of the equipment. OxyChem also uses the Corporate Fire, Safety and Environmental (FS&E) Guidelines when designing new or modifying existing processes. In addition, OxyChem requires the documentation of standard operating procedures and training of affected employees with regard to these procedures as part of the MOC procedure. OxyChem's mechanical integrity program provides an ongoing process to verify the mechanical integrity of the equipment, piping and instruments to prevent the release of hazardous substances.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no reportable releases in the past five years. Markham Ethylene Storage and Surface facility is a new facility.\n\n\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nThe Ingleside Plant has established a written emergency response plan and maintains an emergency response team (ERT) that is trained in these emergency response procedures. The Ingleside onshift shift operators are the incident commanders and RMP emergency contact while on shift. The Markham Ethylene Storage and Surface facility has established a written emergency response plan. The Markham onshift shift operators and Operations Manager are the incident commanders and RMP emergency contact while on shift. All plant personnel, at both facilities, are trained in action they are expected to take in an emergency, such as evacuation procedures. In-plant drills are conducted periodically in order to test the effectiveness of the plan, the plant employee accountability program, and to activate the plant's Emergency Operations Center (EOC). The Ingleside Plant has a Chemical Emergency Response Team (CERP Team) that is available 24 hours per day to respond to Oxy facility chemical emergencies.\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Ingleside Plant and Markham facility continue to improve the safety of the processes through annual reviews of our plant procedures, near misses and incident investigation programs, and a program solic"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000057489,
      "SummaryText": "iting safety and environmental suggestions from the plant employees. The key element of Ingleside's and Markham's safety and environmental programs is prevention. Ingleside and Markham will continue to improve all its processes in order to prevent significant events from occurring in the future.\n\n"
    }
  ]
}