{
  "FacilityID": 1000090184,
  "FacilityName": "Linde - Fort Dodge, IA",
  "FacilityStr1": "3160 200th Street",
  "FacilityStr2": null,
  "FacilityCity": "Duncombe",
  "FacilityState": "IA",
  "FacilityZipCode": "50532",
  "Facility4DigitZipExt": "7509",
  "FacilityCountyFIPS": "19187",
  "LEPC": "Region 5 LEPC",
  "FacilityLatDecDegs": "42.500896",
  "FacilityLongDecDegs": "-094.018532",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.linde.com",
  "FacilityEmailAddress": "info@linde.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Linde Inc.",
  "Company2Name": null,
  "CompanyDUNS": 197154586,
  "Company2DUNS": 197154586,
  "OperatorName": "Linde Inc.",
  "OperatorStr1": "3160 200th Street",
  "OperatorStr2": null,
  "OperatorCity": "Duncombe",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50532",
  "OperatorZipCodeExt": "7509",
  "RMPContact": "Ed Plansky",
  "RMPTitle": "Facilities Manager",
  "FTE": 11,
  "OtherEPAFacilityID": "50501LQDCROLDHW",
  "EPAFacilityID": "100000087522",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "08-TV-002R1",
  "SafetyInspectionDate": "2020-05-12 00:00:00",
  "SafetyInspectionBy": "IA DNR",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-11-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-11-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-11-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-11-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.45633,
  "FRS_Long": -93.97879,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "55",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112153,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000090184,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000113485,
          "ProcessID": 1000112153,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000140177,
          "ProcessID": 1000112153,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000640177,
          "ProcessID": 1000112153,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090184,
      "SummaryText": "Facility Description\n\n\n\nThe Linde facility at Fort Dodge, Iowa is a carbon dioxide purification plant.  We receive carbon dioxide gas as a byproduct from a nearby chemical plant.  Normally, this carbon dioxide gas is vented to the atmosphere, but it is collected and transferred to our facility via pipeline.  Linde purifies and liquefies the carbon dioxide using a simple process of drying and distillation.  The final liquid carbon dioxide product is stored in our insulated storage tanks, and is shipped by truck and railcar to customers throughout the midwest.\n\n\n\n\n\nRegulated Substances\n\n\n\nThis facility uses, manufactures, or stores a chemical listed in part 68 of Title 40 of the Code of Federal Regulations, beyond a threshold quantity, as established by the EPA; Anhydrous Ammonia\n\n\n\nAs part of the carbon dioxide production process, the Fort Dodge facility uses a standard ammonia refrigeration process to purify and liquefy the carbon dioxide.  Similar to the freon used in a home refrigerator, the ammonia is neither produced nor consumed in the process, but is repeatedly compressed, cooled and expanded in order to produce the cold temperatures necessary to cool and condense the carbon dioxide gas.  \n\n\n\n\n\nAccidental Release Prevention Policy\n\n\n\nLinde is dedicated to being the best performing industrial gas company in all aspects of our business, including safety, health, and environmental affairs. Our safety, health, and environmental policy call for a commitment to protecting the health and safety of our employees, neighbors, and the surrounding environment. This policy is the basis for engineering and construction programs that produce equipment and process systems that minimize the possibility of accidental chemical releases and operational safety programs that ensure safe operation of our facilities. Linde is committed to the continuous improvement of these programs.\n\n\n\nLinde is an active member of the American Chemistry Council and subscribes to the council's progra"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090184,
      "SummaryText": "m of Responsible CareA&reg; Employee Health and Safety Code of Management Practices.\n\n\n\n\n\nPrevention Program\n\n\n\nIn accordance with OSHA's Process Safety Management standard and EPA's Risk Management Program rule, the Fort Dodge, IA facility has a comprehensive accident prevention program in place. This program is built around process safety concepts such as:\n\n- Technical documentation of Process Safety Information, describing the physical properties of the hazardous substances, the safety systems in place to control these substances, and the critical operating parameters of the associated equipment and systems.\n\n- Procedures and programs to develop, maintain, and control key program elements such as process operations, equipment mechanical integrity, employee training, management of change, hot work permits, incident investigation, and contractor activity. \n\n- Initial and periodic review of new or modified processes through application of comprehensive design safety and management of change programs that include Process Hazard Analysis study and pre-startup review. \n\n\n\nLinde has an employee participation program that promotes involvement in the process safety program and helps ensure understanding of facility-specific elements of the safety program.\n\n\n\nThe prevention program is audited periodically, by our corporate assessment group, to ensure that the process safety concepts and practices are in place and working effectively.\n\n\n\n\n\nChemical-specific Prevention Steps\n\n\n\nIn addition to the required prevention program elements, we have implemented safety features specific to the covered process at our facility. Following is a description of some of these safety features.\n\n\n\nAnhydrous ammonia areas within the plant are equipped with atmospheric monitoring systems to detect any ammonia presence in the air.  Operating equipment including compressors and vessels have a  combination of high level alarms and shutdowns, high temperature alarms and shutdowns.  These are connec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090184,
      "SummaryText": "ted to the process control system to automatically shutdown the respective compressors and sound an alarm in the control room.  Equipment and piping are constructed of carbon steel or stainless steel, which is suitable for anhydrous ammonia service and resistant to the action of anhydrous ammonia under the service conditions.\n\n \n\n\n\nFive-year Accident History\n\n\n\nThe Fort Dodge CO2 facility accident history indicates continuous safe operation of our covered chemical process over the last five years. There were no covered process releases that resulted in an EPA RMP recordable accident.\n\n\n\n\n\nEmergency Response Programs\n\n\n\nLinde has an emergency response program in place to minimize the effects of accidental release of regulated substances on employees, the public, and the environment.  Linde employees will respond to minor incidents.\n\n\n\nFor other than minor incidents Linde has in place an emergency response plan in coordination with the Duncombe Fire Department and the Webster County Emergency Unit in Fort Dodge.  In an event of an emergency, the Fort Dodge facility would dial 911 to contact the Duncombe Fire Department for assistance.   In addition,  the Webster County Emergency Unit would be contacted.\n\n\n\nAll facility employees are trained in their role in the emergency plan and emergency drills are conducted at least annually.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nLinde has a commitment to safety that is expressed in a company-wide goal of \"Zero/Zero\", which means zero accidents and zero injuries or illnesses at each and every location. We look to constantly improve the safety of our processes using recommendations developed through the prevention program and a program soliciting safety suggestions from our employees.\n\n\n\nThere are currently no major projects for safety improvement that have reached the planning stage."
    }
  ]
}