{
  "FacilityID": 1000040452,
  "FacilityName": "Texas Dock and Rail LLC",
  "FacilityStr1": "7002 Marvin L Berry Road",
  "FacilityStr2": null,
  "FacilityCity": "Corpus Christi",
  "FacilityState": "TX",
  "FacilityZipCode": "78409",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48355",
  "LEPC": "Nueces County LEPC",
  "FacilityLatDecDegs": "27.827814",
  "FacilityLongDecDegs": "-97.499219",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Texas Dock and Rail LLC",
  "OperatorStr1": "7002 Marvin L Berry Road",
  "OperatorStr2": null,
  "OperatorCity": "Corpus Christi",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "22879",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeffrey Siadak",
  "RMPTitle": "Terminal Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000221967",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-12-10 00:00:00",
  "SafetyInspectionBy": "United States Coast Guard",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-04-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-04-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-04-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049887,
      "AltID": null,
      "FacilityID": 1000040452,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000050354,
          "ProcessID": 1000049887,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000060419,
          "ProcessID": 1000049887,
          "ChemicalID": 118,
          "Quantity": 13000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000560419,
          "ProcessID": 1000049887,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000040452,
      "SummaryText": "Trafigura Terminals LLC d/b/a Texas Dock & Rail Company Ltd (Trafigura) currently performs butane storage and marine loading activities at its terminal site located in Corpus Christi, Texas.  Trafigura is required to comply with United States Environmental Protection Agency (USEPA) Risk Management Program (RMP) regulations under 40 Code of Federal Regulations (CFR) Part 68 because the facility stores butane on-site in quantities exceeding the rule threshold quantity for this substance.  In December 2013, Trafigura added six new 90,000-gallon pressurized butane bullet storage tanks to its existing operations and, as a result, is updating the its Risk Management Plan to reflect the expanded butane storage.  The following executive summary is provided in accordance with the requirements of 40 CFR 68.155.\n\n\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\n\n\nTrafigura is committed to operating and maintaining its butane operations in a safe and responsible manner.  Trafigura has developed and implemented accidental release prevention and emergency response provisions at the facility, including those required under the USEPA RMP rule and the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standard.  The facility is also subject to other emergency plan regulations such as those under the Oil Pollution Act (OPA) of 1990, state Emergency Planning and Community Right-to-Know Act (ECPRA), and United States Coast Guard (USCG) rules.\n\n\n\n1.2 Description of the Facility and Regulated Substances\n\n\n\nTrafigura operates a petroleum product terminal located in Corpus Christi, Texas, which handles butane, a regulated flammable substance under RMP regulations.  Trafigura's butane marine loading activities consist of:\n\n\n\n* Butane transfer from trucks to pressurized bullet tanks or floating storage pressurized barges; \n\n\n\n* Butane transfer from pressurized bullet tanks to floating storage pressurized barges; and\n\n\n\n* Closed loop mar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000040452,
      "SummaryText": "ine butane load-out from barges to pressurized ocean going vessels.\n\n\n\nIn December 2013, Trafigura added six new 90,000-gallon pressurized bullet tanks for additional butane storage.  The present RMP update addresses changes to the process associated with the expanded butane storage.\n\n\n\nThe following maximum transfer rates are expected at the facility:\n\n\n\n* Trucks - Thirty butane trucks per day with a capacity of 200 barrels each and capable of being unloaded to bullet tanks or floating storage at a rate of 200 to 600 gallons per minute.\n\n\n\n* Existing pressurized butane bullet tanks - Four tanks with a capacity of 30,000 gallons each capable of being unloaded to floating storage at a rate of 200 to 600 gallons per minute.\n\n\n\n* New pressurized butane bullet tanks - Six tanks with a capacity of 90,000 gallons each capable of being unloaded to floating storage at a rate of 200 to 600 gallons per minute.\n\n\n\n* Floating storage barges - Up to three barges used with a capacity ranging from 15,000 to 18,000 barrels and capable of being unloaded to ocean going vessels at a rate of 1,400 gallons per minute.\n\n\n\n1.3 General Accident Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nThe facility's general accident prevention program consists of compliance with USEPA RMP and OSHA PSM regulations.  Key elements include:\n\n\n\n* Process Safety Information - Information regarding butane hazards, process technology, and process equipment is complied, updated, and made available to operating personnel.\n\n\n\n* Process Hazard Analysis - Analyses are conducted every five years with the objective of identifying, evaluating, and controlling the process hazards, and findings and recommendations are promptly addressed.\n\n\n\n* Operating Procedures - Procedures are developed and maintained up to date to provide instructions for safe operations of process equipment during various phases of operation.\n\n\n\n* Training - Initial and recurring training is provided to all employees involve"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000040452,
      "SummaryText": "d in operating a regulated process.\n\n\n\n* Mechanical Integrity - Procedures are developed and implemented to maintain the on-going integrity of vessels, process piping, transfer hoses, and other process equipment.  These include procedures for maintenance, training of maintenance employees, and inspection and testing.\n\n\n\n* Management of Change - Written procedures are used to manage changes to process-related chemicals, technology, equipment, and procedures, and other changes that may affect a regulated process.\n\n\n\n* Pre-Startup Review - Reviews are conducted for new or significantly modified processes to ensure the facilities and processes are adequate and safe for operation.\n\n\n\n* Compliance Audits - Periodic audits are conducted at least every three years to verify compliance with RMP requirements, with prompt and appropriate responses following any finding and deficiencies identified during the audit.\n\n\n\n* Incident Investigation - Incidents that result in or could reasonably result in catastrophic releases of butane will be investigated within 48 hours of an incident, and findings will be addressed promptly.\n\n\n\n* Employee Participation - The facility has a program for involvement of employees in conducting and developing process hazard analyses and other process safety management elements.\n\n\n\n* Hot Work Permit - Permits will be required and issued for hot work operations conducted on or near a butane process.\n\n\n\n* Contractor Safety - The facility has a program to evaluate contractors and ensure that contractors are properly trained, informed of all hazards, and performing work in a safe manner.\n\n\n\n1.4 Five-Year Accident History\n\n\n\nThe equipment is recently or newly built with butane operations beginning on June 1, 2013 and new butane tanks added in December 2013.  There have been no releases in the previous five years of a RMP regulated chemical.\n\n\n\n1.5 Emergency Response Program\n\n\n\nThe facility has developed an emergency response program, including a written emer"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000040452,
      "SummaryText": "gency response plan with notification, emergency medical treatment, and \n\nemergency response procedures.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nTrafigura continually strives to improve process safety.  The facility's butane process is recently or newly built, and designed in accordance with recognized safety industry standards and/or government requirements.  Trafigura expects that on-going programs such as process hazard analyses, compliance audits, and incident investigations will result in continual improvements to process safety."
    }
  ]
}