{
  "FacilityID": 1000004526,
  "FacilityName": "Arizona Chemical Company, LLC-Pensacola, FL",
  "FacilityStr1": "411 South Pace Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Pensacola",
  "FacilityState": "FL",
  "FacilityZipCode": "32502",
  "Facility4DigitZipExt": "5009",
  "FacilityCountyFIPS": "12033",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "30.408032",
  "FacilityLongDecDegs": "-087.241771",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Arizona Chemical Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": 139305197,
  "Company2DUNS": null,
  "OperatorName": "Arizona Chemical Company, LLC",
  "OperatorStr1": "411 South Pace Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Pensacola",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32502",
  "OperatorZipCodeExt": "5009",
  "FTE": 18,
  "OtherEPAFacilityID": "FLD98471611",
  "EPAFacilityID": "100000049716",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-08-07 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-10-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.407524,
  "FRS_Long": -87.241972,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000005478,
      "AltID": "Boron Trifluoride",
      "FacilityID": 1000004526,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000006124,
          "ProcessID": 1000005478,
          "ChemicalID": 52,
          "Quantity": 15200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000005666,
          "ProcessID": 1000005478,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000004011,
              "Process_NAICS_ID": 1000005666,
              "SafetyReviewDate": "2008-09-25 00:00:00",
              "PHA_Date": "2008-09-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-09-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Fixed cameras",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Added fire wall between process and BF3 storage area.",
              "OpProceduresReviewDate": "2008-09-07 00:00:00",
              "TrainingReviewDate": "2008-08-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2002-12-04 00:00:00",
              "EquipmentInspectionDate": "2009-05-18 00:00:00",
              "EquipmentTested": "Boron Trifluoride deluge system",
              "ChangeMgmtDate": "2008-12-15 00:00:00",
              "ChangeMgmtReviewDate": "2008-08-29 00:00:00",
              "PreStartupReviewDate": "2008-12-15 00:00:00",
              "ComplianceAuditDate": "2008-10-20 00:00:00",
              "AuditCompletionDate": "2009-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-08-29 00:00:00",
              "HotWorkPermitReviewDate": "2008-08-20 00:00:00",
              "ContractorSafetyReviewDate": "2008-11-26 00:00:00",
              "ContractorSafetyEvalDate": "2008-06-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000004718,
                  "PreventionProgram3ID": 1000004011,
                  "ProcessChemicalID": 1000006124
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000004526,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-10-31 00:00:00",
    "ERTrainingDate": "2009-05-18 00:00:00",
    "CoordinatingAgencyName": "City of Pensacola Fire Department",
    "CoordinatingAgencyPhone": "8504365200",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000004526,
      "SummaryText": "of the process SOP's and safe work practices.\n\n1.3.5  Mechanical Integrity.  Arizona Chemical maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The mechanical integrity program includes an inspection and testing program to help identify equipment deterioration and damage before equipment fails and a quality assurance program to ensure that new and replacement equipment meet the design standards required for chemical services in plant processes.  The mechanical integrity program includes:  specifications for inspection and testing process equipment; specifications for replacement parts and equipment; procedures for inspecting, testing, and maintaining process equipment; procedures for safe work practices such as lockout/tagout, hot work, confined space entry, PPE and linebreaking; training of maintenance personnel and documentation of maintenance activities.\n\n1.3.6  Management of Change.  The Arizona Chemical management of change program (MOC) evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to help ensure that the change does not negatively affect safe operations. Process changes that are determined to be replacement in kind are excluded from the MOC process.  All other changes must be confirmed through the full MOC process to ensure that inadvertant consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the change.\n\n1.3.7  Pre-startup Safety Review.  Arizona Chemical performs a safety review of a new or modified process before the process is placed into service to verify that the process has been prepared to operate safely.  This review confirms that construction and equipment are in accordance with design specifications; adequate safety, operating, maintenance, and eme"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000004526,
      "SummaryText": "Arizona Chemical is committed to operating in a manner that is safe for employees, the public, and the environment.  As part of this commitment, Arizona Chemical has established a system to help ensure safe operation of the processes of this facility.  One component of this system is a risk management program (RMP) that helps manage the risks at Arizona Chemical and that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirements:  Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at Arizona Chemical.  This document is intended to satisfy the RMPlan of the RMP rule to provide the public with a summary of the risk management program at Arizona Chemical.\n\nThe risk management program at Arizona Chemical consists of three elements:\n\n1.  a hazard assessment to help understand (a) the potential offsite consequences of hypothetical accidental releases and (b) accidents that have occurred during the last five years associated with the use of substances regulated by RMP rule - see topic 1.4,\n\n2.  a prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance (covered processes) - see topic 1.3,\n\n3.  an emergency response program to help respond to accidental releases of regulated substances from covered processes - see topic 1.5.\n\nInformation further describing these elements is provided in this RMPlan.\n\nAlthough the risk management program at Arizona Chemical helps provide the assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety program at Arizona Chemical.  Arizona Chemical has a comprehensive safety program in place establishing many levels of safeguards against release of a hazardous substance and injuries and damage from a release of a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000004526,
      "SummaryText": "hazardous substance.  Arizona Chemical was accepted into OSHA's Voluntary Protection Program as a Star site in 2003  and recertified in 2006 further demonstrating our commitment to health and safety.\n\nThe safety program at Arizona Chemical consists of many elements, only some of which are required by the RMP rule.  This RMPlan is primarily intended to describe those parts of the safety program at Arizona that are required by the RMP rule.\n\n1.1  Accidental Release Prevention and Emergency Response Policies\n\nArizona Chemical is committed to the safety of employees and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Arizona has implemented reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of processes; and programs to evaluate the hazards.\n\nIn the event of an accidental release, a water deluge system is available to control and minimize the release in a manner that will greatly reduce hazards to employees and will help to prevent injury to the public or the environment.  Arizona Chemical provides response training to employees, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with the local fire department.  Response activities have also been discussed with the LEPC.\n\nIn order to effectively implement these policies, Arizona Chemical established a management system headed by an Environmental, Health and Safety Manager (EHS Manager) to oversee safety-related activities.\n\n1.2  Arizona Chemical and Boron Trifluoride\n\nArizona Chemical manufactures Terpene-Phenolic resins.  These resins are used in the adhesive and ink industries.  As part of this manufacturing process, Arizona Chemical handles one regulated substance in sufficient quantity to be covered by the RMP rule."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000004526,
      "SummaryText": "The RMP covered process at Arizona Chemical is Boron Trifluoride.  Boron Trifluoride (BF3) is used in the manufacture of Terpene-Phenolic resins.  It is received in pressurized tube trailers.  Each trailer contains eight tubes, each tube containing a maximum of 1,900 lbs.  The maximum process quantity is 15,200 lbs.\n\n1.3  Accidental Release Prevention Program\n\nArizona Chemical has used a prevention program to help prevent accidental releases of hazardous substances for several years.  Beginning in 1992, Arizona Chemical  formalized this prevention program for the Boron Trifluoride Storage and Handling process to comply with the fourteen elements of the OSHA process safety management (PSM) prevention program.  In 1996, the EPA RMP rule established prevention requirements similar to PSM, except that the program also focuses on protecting the public and the environment.\n\nThe following paragraphs briefly describe the elements of Arizona Chemical's prevention program that address the EPA RMP rule prevention program requirements.\n\n1.3.1  Process Safety Information.  Arizona Chemical maintains a variety of technical documents that are used to ensure safe operation of the covered processes.  These documents address (1) physical properties of hazardous substances handled at Arizona Chemical, (2) operating parameters of the equipment, and (3) design basis and configuration of the equipment.  Arizona Chemical ensures that the necessary process safety information is available to all employees, the LEPC and the fire department.\n\n1.3.2  Process Hazard Analysis.  Arizona Chemical performs and periodically updates process hazard analyses (PHAs) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process.  A team composed of personnel with engineering and process operating experience and a leader with process hazard analyses experience is assembled to analyze the hazards of the process.  Arizona Chemic"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000004526,
      "SummaryText": "al primarily uses the hazard and operability (HAZOP) technique, supplemented with checklists, to perform the analysis.  The PHA team prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility to resolve the recommendations is assigned to unit personnel and, when appropriate, changes to enhance the safety of the process are implemented.  Approved recommendations are tracked to completion.  PHA revalidations are conducted in a similar fashion.  Key employees are contacted to review changes made in the covered process, previous recommendation status, process safety information, accuracy of piping and instrument diagrams, any qualifying incidents and any changes to facility siting or human factors checklists.\n\n1.3.3  Operating Procedures.  Arizona Chemical process engineers, operators, and supervision work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures are used to train employees and serve as a reference guide for appropriate actions to take during both normal operations and process upsets.  Operating procedures include: steps for safely conducting activities; applicable process safety information such as safe operating limits and consequences of deviation; and safety and health considerations, such as chemical hazards and personal protective equipment requirements.\n\nArizona Chemical operating procedures cover all phases of operations, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a maintenance outage or emergency shutdown, and temporary operations.\n\n1.3.4  Training.  Arizona Chemical trains workers to safely and effectively perform their assigned tasks.  The training program includes both initial and refresher training that covers a general overview of the process, the properties and hazards of the substances in the process, and a detailed review"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000004526,
      "SummaryText": "rgency procedures are in place; employee training has been completed; and a PHA has been performed if the process is new or MOC requirements have been completed if an existing process has been modified.\n\n1.3.8  Compliance Audit.  Arizona Chemical has performed compliance audits historically.  Currently, a team comprised of Arizona Chemical EHS management members lead the audit.  The team includes personnel knowledgeable in the RMP/PSM audit criteria and personnel knowledgeable in the covered processes.  The intent of the audit is to be certain that the prevention program is effectively addressing the safety issues of Arizona Chemical operations.  The results of the audit are documented, recommendations are resolved and appropriate enhancements to the prevention program are implemented.\n\n1.3.9  Incident Investigation.  Arizona Chemical investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented.  Arizona Chemical relies on trained employees to identify and report any incident requiring investigation.  An investigation team is assembled, and the investigation is initiated immediately.  The results of the investigation are documented and corrective actions are taken as needed and tracked to completion.\n\n1.3.10  Employee Participation.  Arizona Chemical developed a written employee participation program for covered processes to help ensure that safety concerns of employees are addressed.  Arizona Chemical encourages active participation of personnel in the prevention program activities of all processes at the facility.\n\n1.3.11  Hot Work Permits.  A hot work permit system has been in place at the facility for well over sixteen years.  The purpose of the hot work permit program is to control spark or flame producing activities that could result in fires or explosions in covered processes at the facility.  Arizona Chemical's hot work permit procedure complies with"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000004526,
      "SummaryText": "OSHA's fire prevention and protection requirements in 29 CFR 1919.252(a).  Hot work permits are issued for any spark producing activities.  Employees performing hot work must check with control room operators to communicate job details and make sure no other jobs are in progress that could be negatively impacted by spark producing work.\n\n1.3.12  Contractors.  Arizona Chemical established a program to ensure that contractor activities at the facility are performed in a safe manner.  The program requires review of contractor's written safety programs, accident history and insurance requirements prior to being allowed to bid on plant projects.  Once a contractor is successful in passing corporate review, they receive a plant safety orientation that describes plant safety requirements, safe work procedures, emergency procedures etc.  After passing a written test they are allowed to work on plant property.  Periodic reviews are conducted to verify contractors are performing their duties in a safe manner.\n\n1.3.13  Chemical-Specific Prevention Steps\n\nIn addition to the required prevention program elements, Arizona Chemical has implemented safety features specific to the boron trifluoride system.  The following paragraph describes some of these safety features.\n\nIndustry standards are followed at Arizona Chemical to help ensure safe handling of boron trifluoride.  The manufacturer supplies BF3 via Department of Transportation (DOT) approved tube trailers and follows DOT standards for maintenance and inspection of the tube trailer.  The BF3 manufacturer routinely inspects the Arizona Chemical storage and unloading system and provides feedback on best practices for safe handling of BF3.  The BF3 manufacturer also has conducted safe handling training for our production and maintenance employees.  The local fire department has also attended the training sessions.  BF3 has excellent visual warning properties.  Small leaks can be detected easily by the naked eye.  Fixed cameras"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000004526,
      "SummaryText": "have been installed strategically to allow operators to view BF3 piping and storage.  Leak detection monitors have also been installed around the storage and piping system.  A water deluge is also installed above the BF3 trailer and piping to knock down and contain any leaking material.  The water deluge can be activated from the control room or near the process.\n\n1.4  Five-Year Accident History\n\nThere have been no accidents of consequence related to BF3 causing off-site impact or major monetary damage since Arizona Chemical acquired the facility in 1989.\n\n1.5  Emergency Response\n\nArizona Chemical has established a written emergency response program to safely respond to accidental releases of hazardous substances.  The emergency response plan includes procedures for:  informing the local fire department and the public about accidental releases that could reasonably result in offsite consequences; providing proper first aid and emergency medical treatment to treat accidental human exposure to substances at Arizona Chemical; operation of engineering controls such as activation of the deluge system to contain accidental releases of BF3, and reviewing and updating the emergency response plan.\n\nArizona Chemical provides awareness level training to employees in these emergency response procedures.  All personnel are trained in evacuation procedures and \"shelter in place\".\n\nThe written emergency response plan complies with other federal contingency plan regulations (e.g. the OSHA regulation 29 CFR 1910.38(a) and has been communicated to local emergency response officials through the local fire department.  Arizona Chemical maintains a regular dialogue with the local fire chief.\n\n1.6  Planned Changes to Improve Safety\n\nArizona Chemical constantly strives to improve the safety of the processes at the plant through process hazard reviews, procedural improvements and by soliciting safety suggestions from our employees and the BF3 manufacturer.  Currently there are no planned c"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000004526,
      "SummaryText": "hanges to the BF3 system, however, our safety culture is one of continuous improvement and further improvements may be made when warranted."
    }
  ]
}