{
  "FacilityID": 1000071316,
  "FacilityName": "Larson Grain Company Fredonia Ammonia Facility",
  "FacilityStr1": "Highway 56",
  "FacilityStr2": null,
  "FacilityCity": "Fredonia",
  "FacilityState": "ND",
  "FacilityZipCode": "58440",
  "Facility4DigitZipExt": "0035",
  "FacilityCountyFIPS": "38047",
  "LEPC": "Logan County LEPC",
  "FacilityLatDecDegs": "46.336492",
  "FacilityLongDecDegs": "-099.118915",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "LARSONGRAINCOMPANY.com",
  "FacilityEmailAddress": "Joe.engels@larsongrain.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Larson Grain Company",
  "Company2Name": null,
  "CompanyDUNS": 31881410,
  "Company2DUNS": 0,
  "OperatorName": "Larson Grain Company",
  "OperatorStr1": " 103 1st St NE",
  "OperatorStr2": null,
  "OperatorCity": " Lamoure",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58458",
  "OperatorZipCodeExt": "0000",
  "RMPContact": "Joe Engels",
  "RMPTitle": "Agronomy Manager",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000019393",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-07-13 00:00:00",
  "SafetyInspectionBy": "USI Insurance Safety Resources",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-07-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-07-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-07-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 46.32983,
  "FRS_Long": -99.10297,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000089334,
      "AltID": "transfer/storage",
      "FacilityID": 1000071316,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000090556,
          "ProcessID": 1000089334,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000111762,
          "ProcessID": 1000089334,
          "ChemicalID": 56,
          "Quantity": 158000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000611762,
          "ProcessID": 1000089334,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000071316,
      "SummaryText": "RISK MANAGEMENT PLAN (RMP) AMMONIA\n\nEXECUTIVE SUMMARY\n\nLarson Grain Company\n\nFREDONIA, NORTH DAKOTA\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nWe at Larson Grain Company in Fredonia are strongly committee to employee, public, and environmental safety.  This commitment is an inherent part of our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  If such a release does occur, our trained emergency response personnel are at hand to control and mitigate the effects of the release.  We also coordinate our response efforts with the Logan County LEPC, which provides additional emergency response expertise.  \n\n2.  General Accidental Release Prevention Program\n\nOur facility has taken all the necessary steps to comply with the EPA's accidental release prevention requirements as set forth in 40 CFR part 68.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\n\nLarson Grain Company maintains a detailed record of safety information that describes the chemical hazards, operation parameters, and equipment designs associated with all processes.\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled effectively.  Any findings from the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\n\nLarson Grain Company maintains written operating procedures to ensure that activities within our covered processes are conducted safely.  These procedures address various modes of operation; the information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraini"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000071316,
      "SummaryText": "ng\n\nLarson Grain Company has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. All Employees go thru training annually \n\nMechanical Integrity\n\nLarson Grain Company conducts documented maintenance checks on process equipment to ensure proper operation.  Maintenance checks are conducted by qualified personnel with previous training in maintenance practices.  Examples of process equipment that would receive maintenance checks include: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\n\nWritten procedures are in place at Larson Grain Company to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel or other employees whose job tasks are affected by a modification in process conditions are promptly notified of the modification and offered training to deal with it.  \n\nPre-Startup Reviews\n\nLarson Grain Company routinely conducts pre-startup safety reviews related to new processes and modifications in established processes.  These reviews are conducted to confirm that construction, equipment, and operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\n\nLarson Grain Company conducts compliance audits on a regular basis to determine whether the plan's provisions, set our under the 40 CFR part 68, are being implemented.  Any non-compliance issue discovered during the audit is promptly corrected.  \n\nEmployee Participation\n\nLarson Grain Company truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention iss"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000071316,
      "SummaryText": "ues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP, particularly information resulting from process hazard analyses.  \n\n3.  Five-year Accident History\n\nLarson Grain Company has an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, no accidental release has occurred during this period.\n\n"
    }
  ]
}