{
  "FacilityID": 1000050279,
  "FacilityName": "Coastal Cooling, LLC",
  "FacilityStr1": "11296 Blackie Road",
  "FacilityStr2": null,
  "FacilityCity": "Castroville",
  "FacilityState": "CA",
  "FacilityZipCode": "95012",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.756944",
  "FacilityLongDecDegs": "-121.744722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Coastal Cooling, LLC",
  "OperatorStr1": "11296 Blackie Road",
  "OperatorStr2": null,
  "OperatorCity": "Castroville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95012",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000063414",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-12-30 00:00:00",
  "SafetyInspectionBy": "Monterey County Health Dept. - CUPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.756944,
  "FRS_Long": -121.744722,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000063253,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000050279,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000078204,
          "ProcessID": 1000063253,
          "ChemicalID": 56,
          "Quantity": 16624.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000064396,
          "ProcessID": 1000063253,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000052524,
              "Process_NAICS_ID": 1000064396,
              "SafetyReviewDate": "2015-05-19 00:00:00",
              "PHA_Date": "2015-05-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Error; Forklift Traffic",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Programmable Logic Controller (PLC)",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ammonia-Water Diffusion (2); ER1 is inside enclosed building space",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Precoolers and Berry Juice Chillers (Heat Exchangers) added",
              "OpProceduresReviewDate": "2015-06-18 00:00:00",
              "TrainingReviewDate": "2015-06-18 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Online",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-05-13 00:00:00",
              "EquipmentInspectionDate": "2015-06-18 00:00:00",
              "EquipmentTested": "Chillers-Prestart Safety Review",
              "ChangeMgmtDate": "2015-05-13 00:00:00",
              "ChangeMgmtReviewDate": "2015-05-13 00:00:00",
              "PreStartupReviewDate": "2015-06-18 00:00:00",
              "ComplianceAuditDate": "2013-02-12 00:00:00",
              "AuditCompletionDate": "2014-12-10 00:00:00",
              "IncidentInvestigationDate": "2011-07-23 00:00:00",
              "InvestigationChangeDate": "2011-08-03 00:00:00",
              "ParticipationPlansReviewDate": "2013-02-12 00:00:00",
              "HotWorkPermitReviewDate": "2014-12-05 00:00:00",
              "ContractorSafetyReviewDate": "2014-12-05 00:00:00",
              "ContractorSafetyEvalDate": "2014-12-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000064548,
                  "PreventionProgram3ID": 1000052524,
                  "ProcessChemicalID": 1000078204
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000050279,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-05-13 00:00:00",
    "ERTrainingDate": "2015-05-13 00:00:00",
    "CoordinatingAgencyName": "CUPA/Monterey County Health Dept",
    "CoordinatingAgencyPhone": "8317554511",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Calif. Title 19, Div 2, Chapter 4.5 Cal/ARP; Calif. Title 8 (Cal/OSHA GISO's as applicable)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 8,
      "FacilityID": 1000050279,
      "SummaryText": "epared written itemized lists of the improvements which are to be implemented.  The last of the 12/18/2015 PHA improvements is expected to be completed by 11/06/2015 after the end of the high season.  The last of the 05/19/2015 PHA update improvements is expected to be completed by 12/31/2015 after the end of the high season."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050279,
      "SummaryText": "Coastal Cooling, LLC\r\n\r\nINTRODUCTION - RMP Update June 2015:  Executive Summary \r\n\r\nForward:  California has adopted the Federal RMP Program with additional state-specific requirements; the State Program is known as the California Accidental Release Prevention Program or Cal/ARP (collectively; Cal-ARP RMP/PSM).  In the Program Level 3 designation, Cal/ARP includes CA Title 8, Section 5189 Process Safety Management as the basis for the Prevention Program component of the Plan/Program.  Coastal Cooling is updating its RMP (and the associated submittals) due to a complete PHA Update conducted 12/18/2014, which included an expansion project.  Another PHA update was conducted 5/19/2015 and addressed two chillers added to the process.  All 9 sections of the RMP are being updated as a result.     \r\n\r\nA.\tRMP EXECUTIVE SUMMARY \t\r\n\r\n1.\tAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe Coastal Cooling Accidental Release Prevention and Emergency Response Policies are simply not to have accidental releases or emergencies.  The Company endeavors to execute these policies through the daily implementation of its Safety Programs.  Company safety programs include, but are not limited to the Process Safety Management Program (PSM) for its Program Level III Process.  The PSM Program is an integrated, holistic approach to the safe operation of processes using Regulated Substances.  The design of the Process in use and the PSM Program are specifically intended to prevent accidental releases, and to deal safely with emergencies if and when they do happen.  It is the primary goal of Coastal Cooling to protect its employees, visitors and neighbors from harm due to Company operations.  With this in mind, the priorities of protection of life, the environment, and then property have been established.\r\nThe Company also recognizes the need to be prepared for accidental releases that could occur should established prevention programs fail. In addition to a Fire Alarm and Sprink"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050279,
      "SummaryText": "ler System, the ammonia refrigeration process is equipped with an automated ammonia monitoring, control and alarm system.  The monitoring system is supervised on-site and remotely by a third party alarm company.  If and when an ammonia leak is detected, notifications and alarms are triggered according to pre-determined parameters.  Our policy is to regularly test and maintain emergency safety systems per our Mechanical Integrity Program, which is intended to ensure proper operation, actuation and function of the refrigeration-related systems and components.  The Plant is also equipped with Ammonia-Water Diffusion Tank Systems (ADT).  The function of the ADT systems is to prevent ammonia from venting to atmosphere should a Pressure Relief Valve operate. \r\nThe Company has adopted a Non-responding Facility Emergency Response Policy.  The Plant's California Hazardous Material Business Plan (HMBP) was developed to be consistent with Emergency Action Plan requirements (i.e. notify and evacuate).  Emergency response pre-planning is coordinated through the local Certified Unified Program Agency (Monterey County Health Department/CUPA). The CUPA inspects the plant and receives copies of the routinely updated HMBP.  It is our policy to maintain RMP/PSM compliance, a good working relationship with the Monterey County Health Department/CUPA, and other Public Emergency Responders that are part of the Monterey County Emergency Response Mutual Aid Agreement.\r\nCoastal Cooling's ammonia refrigeration process is supported by Western Precooling Systems (WPS), which is a stakeholder in the operation as described below.  WPS is a well-known and reputable supplier of ammonia refrigeration equipment and services.  WPS has a Regional Service Center in Castroville within two miles of the Coastal Cooling facility.  WPS employs experienced ammonia technicians trained beyond 1910.120 Awareness level.  WPS supports training and certifications for its technicians via the Refrigerating Engine"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050279,
      "SummaryText": "e and shipping of fresh strawberries.  This RMP update is intended to address the most recent changes including the 2015 facility expansion; and the addition of two shell-and-tube berry juice chillers. The chillers are leased by a separate tenant.  \r\n\r\nThe facility is open year-around with a busy season picking up in early March and continuing through the summer months.  Remaining months may see little in the way of fresh produce; however the refrigeration equipment is still operative.  Annual refrigeration equipment maintenance is performed during low-season winter months. \r\n\r\nThe Regulated Substance in use is anhydrous ammonia (NH3) CAS #7664-41-7, which is used as the refrigerant in two mechanical refrigeration systems that operate independently but are connected via cross-over valves.  These systems are collectively considered one Co-located Process as defined by USEPA.  Refrigerating process equipment overall consists of Pressure Vessels, Compressors, Evaporative Condensers, Room-Unit Evaporators, Pressure Cooler Units and associated valves, instrumentation and piping.  Pressure and temperature controls are installed in accordance with appropriate codes & standards, including isolation and overpressure relief valves.  Pressure relief valves are piped to headers that terminate at one of two ammonia-water diffusion tanks.  In addition to automated monitoring, pre-qualified personnel regularly check the refrigeration system for proper operating parameters.\r\nAs noted above, there are two systems that comprise the ammonia refrigeration process; a third system (ER3) was removed during the recent expansion project.  System 1 consists of a complete high (compression) and low (evaporators) side refrigeration system that supports pressure cooling within the main cold storage building and two strawberry juice chillers.   System 2 consists of a complete high and low side refrigeration system that supports room evaporators which are also located inside the main cold stora"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050279,
      "SummaryText": "ers and Technicians Association (RETA).  WPS technicians are on call to the facility 24/7/365.  WPS assists Coastal Cooling with implementation of its RMP/PSM Accidental Release Prevention Program elements, and would serve as a technical resource in an emergency situation.\r\n\r\nIt is through these measures, policies and pre-planning that Coastal Cooling endeavors to maintain effective Accidental Release Prevention and Emergency Response.\r\n    \r\n2.\tGeneral Description of the Stationary Source and Regulated Substances\r\n\r\nCoastal Cooling, LLC is a California Limited Liability Company made up of On the Move Logistics and Western Precooling Systems (WPS).  The facility is an ammonia refrigeration plant located in Castroville, CA, in a commercial/industrial area on the SE side of the city.  Coastal Cooling leases the property and refrigerating equipment from WPS.  The ammonia refrigeration process was built in 1985 with expansions in 1994, 1998, 2014 & 2015. From 1999 to 2006, this facility was registered under the D'Arrigo Bros. Company.  In December 2006 the facility closed and D'Arrigo Bros. de-registered from the RMP Program.  The facility was re-opened by Dole Fresh Vegetables (Dole) in 2008.  Dole stopped operating at the facility and moved out at the end of the 2008/2009 season.  Coastal Cooling, LLC started leasing the facility in early 2010, notified the local CUPA Agency, and took responsibility for ongoing development and implementation of the RMP Program.  Coastal filed its first RMP update with USEPA and the local CUPA on 3/2/2010.  RMP changes not affecting the Federal RMP eSubmit Report were completed in June, 2010, but were filed with the local CUPA Agency.  Western Precooling Systems purchased the facility from D'Arrigo Brothers in early 2011, but Coastal Cooling LLC remains the Lessee.  Between 2011 and now, Ice-making equipment has been removed and the facility has been upgraded, expanded and optimized for the pre-cooling, short-term refrigerated storag"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050279,
      "SummaryText": "ge building.  Systems 1 & 2 are interconnected via cross-over valves, and operate independently of each other, however pressure coolers and room evaporators are located within the same building space.  This configuration meets with USEPA's definition of co-located.\r\n\r\n3.\tGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\r\n\r\nAccidental Release Prevention Program\r\n\r\nAs noted above a PSM (CCR 8, 5189) Plan has been established within the existing RMP.  The PSM Program is specifically intended to promote the safe operation of the ammonia-handling equipment and to prevent accidental releases.  Coastal Cooling strives to make the PSM Program an integral part of daily Plant operation.  Other safety programs are integrated with the PSM Program, to the extent practicable, appropriate and/or required (such as the California Injury and Illness Prevention Program/IIPP).  \r\n\r\nWPS is the company that inspects and performs mechanical maintenance of the ammonia refrigeration equipment.  Schedules and written procedures for the operation and maintenance of ammonia-handling equipment, including the steps to be taken in the event of a release or threatened release, have been developed.  Written procedures include necessary safety precautions for operations, inspection, maintenance, and moving of portable equipment (Pressure Coolers).  In addition to existing equipment technical documentation and procedures, WPS also maintains an extensive library of refrigeration equipment technical documentation including written manufacturer reference manuals and technical bulletins.  As maintenance needs are determined, the need is expressed at the WPS workload meetings conducted by the WPS Area Manager.  The specific task for the expressed need is decided by the WPS Area Manager and entered into the WPS service call system. Tasks are then tracked to completion through the service call system.  Through this regular routine of inspect, discuss, assign and confirma"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000050279,
      "SummaryText": "tion of completion, Coastal Cooling and WPS reduce equipment operational problems and potential for releases.\r\n\r\nWPS actively encourages its ammonia technicians to seek Certification through the Refrigerating Engineers and Technicians Association (RETA).  Technicians only perform tasks for which they have been pre-qualified.\r\n\r\nChemical-Specific Prevention Steps\r\n\r\nHistorically it has become apparent that a mishap while draining oil from a system was one of the most common incidents to occur in the ammonia refrigeration industry.  To correct this issue special self-closing valves were developed and installed as a permissive for oil drain flow.  If a release were to develop during the oil-draining task, the mechanic simply releases the handle of the self-closing valve and flow is terminated.  These types of valves are installed at the Plant's oil drain points.\r\n\r\nOther release prevention steps taken at the Plant:\r\n\r\n-\tManagement has taken ownership of the RMP/PSM Program.  \r\n-\tContinuing implementation of the Prevention Program elements.  The Prevention Program is equivalent to PSM including Process Safety Information, Process Hazard Analysis, Written Procedures, Training, Mechanical Integrity, Management of Change, Pre-startup Safety Review, Employee Participation, Incident Investigation, Compliance Audits, Contractor Safety, and Injury and Illness Prevention.\r\n-\tRefrigerated space is protected against fire by an automated fire sprinkler system.  \r\n-\tThe refrigerating systems are equipped with automated monitoring and alarms that are supervised by a third-party alarm company.  The monitoring system is configured to make notifications based on pre-determined parameters. Technicians are notified if out-of-tolerance parameters are being approached, so potential problems can be remedied before they escalate to a release situation.\r\n-\tPressure Relief Valves (PRVs) are installed to protect vessels from operating above their ratings. \r\n-\tPRVs are piped to headers that term"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000050279,
      "SummaryText": "inate at Ammonia-Water Diffusion tanks.  Discharge from a PRV would be absorbed into water containment, thereby preventing an ammonia release to atmosphere.  \r\n-\tThe facility is protected by fencing and gates to limit access by potential wrong-doers.\r\n-\tA Cooler sign-in/sign-out program has been implemented.\r\n-\tEmployees are trained for ammonia awareness and hazard communication (discovery and communicating) for un-authorized personnel, suspicious activity, fires, releases or other hazardous/suspicious condition.\r\n-\tCoastal Cooling strives to maintain a good working relationship with the local implementing agency (Monterey County Health Department/CUPA).  Coastal Cooling and WPS personnel have worked closely with this CUPA at this and other locations within its jurisdiction.  \r\n-\tStaff is trained in the fire and accident prevention benefits of good housekeeping.  The general appearance of the facility is maintained on a day-to-day basis.\r\n\r\n4.\t  Five-Year Accident History\r\n\r\nThere is no data to report.  \r\n\r\n5.\t Emergency Response Program\r\n\r\nThis plant is engineered to provide for life safety and effective emergency response.  Building space is equipped with a fire-alarm system & fire sprinklers.  Refrigerated space and Engine Rooms are equipped with ammonia sensors and associated alarm system.  The refrigeration process' Control, Monitoring and Alarm System (described above) is supplemented with backup systems (kill switches).  Currently, authorized personnel can access critical process system controls via the Plant's Electrical Rooms.  Portions of the refrigeration process are equipped with Fire Department Emergency Control Boxes and a KNOX BOX KEY has been installed.  The KNOX is kept up-to-date per the North County Fire & City of Castroville Police Departments.  Automated systems and safety cut-outs are regularly inspected, tested and maintained at pre-determined intervals. Personnel are experienced in ammonia awareness, manual discovery, emergency shutdown, ev"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000050279,
      "SummaryText": "acuation and notification procedures in the event of a failure of the engineered safety and emergency systems.  \r\n\r\nThe Plant does not require its employees to participate in conducting offensive-type emergency response activities under the HAZWOPER standard; a Non-responding Facility Policy has been adopted.  In the event of an ammonia emergency, the response is to follow the procedures in the Equipment SOP's and the California Hazardous Material Business Plan.  The overall procedure is to shutdown when and where appropriate and safe, evacuate, and notify the local response agencies and WPS (technical support).  Plant employees are to implement hazard communications, provide for the safety of visitors and report to the established Evacuation Staging Area(s) for a head count.  Emergency response is coordinated with the County of Monterey Health Department/CUPA and local Fire Department.  Coastal Cooling has verified it is included in the Monterey County Area Emergency Plan. \r\n   \r\n6.\tPlanned changes to improve safety\r\n\r\nThe primary mechanisms to identify and plan safety improvements include (but are not limited to):\r\n¿\tProcess Hazard Analysis review;\r\n¿\tCompliance Audits;\r\n¿\tRoutine inspections, tests & maintenance (Mechanical Integrity Program);\r\n¿\tIIAR Bulletin 109 Inspections (IIAR Minimum Safety Criteria For The Safe Operation Of Ammonia Refrigeration Process);\r\n¿\tCoastal Cooling and WPS Internal Inspection Protocols\r\n¿\tIncident Investigation\r\n\r\nThe Programs above may result in recommendations ranging from capital improvements to routine maintenance of the plant.  Service calls are established in parallel to identified needs.  \r\n\r\nCurrent planned changes to improve safety include the recommendations identified in the most recent Process Hazard Analyses, which were conducted by experienced teams on 12/18/2014 (Expansion) and 5/19/2015 (Chillers).  A summary of improvements includes engineering, mechanical, and administrative changes or upgrades.  Coastal has pr"
    }
  ]
}