{
  "FacilityID": 1000068499,
  "FacilityName": "Lear Corporation - Hebron Plant",
  "FacilityStr1": "180 North High Street",
  "FacilityStr2": null,
  "FacilityCity": "Hebron",
  "FacilityState": "OH",
  "FacilityZipCode": "43025",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39089",
  "LEPC": "Licking County LEPC",
  "FacilityLatDecDegs": "39.968706",
  "FacilityLongDecDegs": "-082.488339",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.lear.com",
  "FacilityEmailAddress": "amavi@lear.com",
  "FacilityDUNS": 2326721,
  "ParentCompanyName": "Lear Corporation",
  "Company2Name": null,
  "CompanyDUNS": 175592476,
  "Company2DUNS": 0,
  "OperatorName": "Lear Corporation EEDS & Interiors",
  "OperatorStr1": "21557 Telegraph Road",
  "OperatorStr2": null,
  "OperatorCity": "Southfield",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48033",
  "OperatorZipCodeExt": null,
  "FTE": 96,
  "OtherEPAFacilityID": "43025RNSLC180NH",
  "EPAFacilityID": "100000200034",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-09-10 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "February 08 revisions",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-03-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-03-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-03-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-03-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085915,
      "AltID": "Seating Line",
      "FacilityID": 1000068499,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000107263,
          "ProcessID": 1000085915,
          "ChemicalID": 20,
          "Quantity": 27079.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000107264,
          "ProcessID": 1000085915,
          "ChemicalID": 44,
          "Quantity": 108315.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000087117,
          "ProcessID": 1000085915,
          "NAICSCode": "33636",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000068499,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2016-08-03 00:00:00",
    "ERTrainingDate": "2017-10-27 00:00:00",
    "CoordinatingAgencyName": "Licking County LEPC",
    "CoordinatingAgencyPhone": "7406705575",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068499,
      "SummaryText": "RISK MANAGEMENT PLAN -  EXECUTIVE SUMMARY\n\n\n\nLear Corporation - Hebron Plant\n\n180 NORTH HIGH STREET\n\nHEBRON, OHIO\n\n\n\n\n\nAccidental Release Prevention and Emergency Response Policies at the Facility\n\n\n\nLear Hebron Plant endeavors in all its activities to promote a quality environment. Hebron Plant recognizes that our activities may impact our employees and the surrounding community. Because of this, Hebron Plant is dedicated to environmental protection, employee health and safety, regulatory compliance and pollution prevention through a strategy of continual improvement and teamwork.\n\n\n\nThe Hebron Plant is ISO-14001 certified.  ISO 14001 is an internationally recognized environmental standard. The ISO-14001 management system provides the structure for continuing to examine and improve our environmental impact. Through these and other initiatives, the Hebron Plant has implemented a system that holds each employee accountable for the safety and environmental performance of the company.\n\n\n\n\n\nStationary Source and the Regulated Substances Handled\n\n\n\nThe Hebron Plant produces polyurethane foam seating, headrest, armrest and console cushions for the automotive industry. The polyurethane foam is produced by using a blend of polyol and an isocyanate expander.  Only the isocyanate material is subject to the RMP requirement. The isocyanate material is received at the plant via tanker truck, and is stored in two storage tanks located inside the building. The isocyanate storage tanks are contained within a concrete curbed area capable of holding more than one tanks liquid content.   Both storage tanks have a maximum capacity of 6,500 gallons each and 13,000 gallons total. From the indoor storage tanks, isocyanate is transferred via hard plumbed lines to smaller retaining tanks for daily use.  There is approximately 300 gallons of isocyanate day tanks and transfer piping and 13,000 gallons of in the storage tanks for an onsite maximum capacity of 13,300 gallons.\n\n\n\nThe polyurethan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068499,
      "SummaryText": "e foam line is a partially enclosed process consisting of a multi-station race track type conveyor line with each station containing one mold. At the first station, foam (mixture of polyol and isocyanate) is mechanically (robotic) poured into the mold. The lid to the mold is then immediately closed and clamped shut. The foam is cured as it rotates through the various stations. The lid is then opened and the foam seat is removed. The mold is scrubbed clean and a wax release agent is applied to the mold so that it can be used again.\n\n\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nThe facility complies with all applicable federal and state codes and regulations. The facility conducts safety meetings and safety training periodically. The process safety management at the facility for the isocyanate-related activities and equipment represents one of the facility's main active commitments to an accidental release prevention program.\n\n \n\nThe Hebron Plant complies with a variety of environmental and safety programs including waste management, storm water pollution prevention, spill prevention, community right-to-know programs (EPCRA), hazardous materials management, and emergency response. \n\n\n\nThe isocyanate is stored indoors within a concrete containment system constructed integral with the building. Strict procedures are followed when materials are unloaded including the requirement that a person observes the unloading of the delivery tanker truck.\n\n\n\nFixed air monitoring equipment is installed within the building to provide an early warning of any isocyanate release. These monitors are inspected and tested on a regular basis to ensure their accuracy and functioning ability. The principle of detection is based on a chemical reaction caused by the presence of isocyanate on a chemically impregnated paper tape. A sample of plant air is drawn through the tape by a pump. When isocyanate is present in the sample, it causes a stain to "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068499,
      "SummaryText": "form on the paper tape. The intensity of the stain is proportional to the concentration of isocyanate in the sample. A photo diode monitors the stain intensity as a chemical reaction occurs on the paper. If the intensity of the stain is above a pre-set level, the alarm relays are initiated and an indication is shown on the LCD display. The display shows flashing bells to indicate that the instrument is in alarm mode. Employees are immediately evacuated to a safe and designated gathering area outside the building. The alarm condition persists until a reading below the alarm set point is reached. No employee is allowed back into the area until a reading of below the set alarm is reached (0 ppb is the alarm level).\n\n\n\n\n\nFive-Year Accident History\n\n\n\nThere have been no reportable accidents involving isocyanate in the last five years.\n\n\n\n\n\nEmergency Response Program\n\n\n\nThe Emergency Response Program is focused on the internal HAZWOPER trained team to handle accidental spills of isocyanate. Release events that are too large to be handled by the internal team are to be handled by both local emergency responders and the facilities regional waste management company (US Ecology).  The Hebron Plant has made a significant effort to communicate the elements of its response program with local emergency responders. Members of the local fire department have visited the facility. Facility personnel involved with the isocyanate process receive regular training on pollution prevention and emergency response. This training includes participating in an emergency drill which is documented. Alert systems are also in place at the facility. As previously described the facility is equipped with isocyanate air monitoring devices to provide early warning of a isocyanate release.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe Hebron Plant continues to review its programs and procedures and make improvements where necessary. At this time, no significant improvement needs have been identified.\n\n"
    }
  ]
}