{
  "FacilityID": 1000107283,
  "FacilityName": "Hutchinson Storage Facility",
  "FacilityStr1": "2610 South Mohawk Road",
  "FacilityStr2": null,
  "FacilityCity": "Hutchinson",
  "FacilityState": "KS",
  "FacilityZipCode": "67501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20155",
  "LEPC": "Reno County LEPC",
  "FacilityLatDecDegs": "38.021500",
  "FacilityLongDecDegs": "-097.992861",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Enterprise Products Operating, LLC",
  "Company2Name": null,
  "CompanyDUNS": 841528859,
  "Company2DUNS": 841528859,
  "OperatorName": "Enterprise Products Operating, LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000172083",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-04-21 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-10-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-10-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-10-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-10-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 38.02339,
  "FRS_Long": -97.99538,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000134150,
      "AltID": "Truck & Rail Loading Optn",
      "FacilityID": 1000107283,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000168072,
          "ProcessID": 1000134150,
          "ChemicalID": 155,
          "Quantity": 65000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000150957,
              "ProcessChemicalID": 1000168072,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000150956,
              "ProcessChemicalID": 1000168072,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000150955,
              "ProcessChemicalID": 1000168072,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000150954,
              "ProcessChemicalID": 1000168072,
              "ChemicalID": 125
            }
          ]
        },
        {
          "ProcessChemicalID": 1000168073,
          "ProcessID": 1000134150,
          "ChemicalID": 155,
          "Quantity": 45000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000150953,
              "ProcessChemicalID": 1000168073,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000150952,
              "ProcessChemicalID": 1000168073,
              "ChemicalID": 118
            }
          ]
        },
        {
          "ProcessChemicalID": 1000168074,
          "ProcessID": 1000134150,
          "ChemicalID": 155,
          "Quantity": 46000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000150951,
              "ProcessChemicalID": 1000168074,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000150950,
              "ProcessChemicalID": 1000168074,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000150949,
              "ProcessChemicalID": 1000168074,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000150948,
              "ProcessChemicalID": 1000168074,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000150947,
              "ProcessChemicalID": 1000168074,
              "ChemicalID": 122
            }
          ]
        },
        {
          "ProcessChemicalID": 1000168075,
          "ProcessID": 1000134150,
          "ChemicalID": 155,
          "Quantity": 40000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000150946,
              "ProcessChemicalID": 1000168075,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000150945,
              "ProcessChemicalID": 1000168075,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000135563,
          "ProcessID": 1000134150,
          "NAICSCode": "42471",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000107283,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Hutchinson Fire Department",
    "CoordinatingAgencyPhone": "6206942871",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000107283,
      "SummaryText": "Hutchinson Storage Facility\nEnterprise Products Operating LLC\nExecutive Summary Risk Management Plan\nEPA Identifier: 1000 0017 2083\n\nAccidental Release Prevention and Response\n\nAt Enterprise, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n* A description of our facility and use of substances regulated by EPA's RMP regulation\n* An overview of our accidental release prevention programs\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n* An overview of our emergency response program\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n\nDescription of the Stationary Source and Regulated Substances\n\nEnterprise Products Operating, LP operates a hydrocarbon liquid storage facility (Facility) located at 2610 S. Mohawk Road, Hutchinson, Kansas. The Hutchinson Storage Facility is regulated by Federal OSHA 29 CFR 1910.119 and EPA 40 CFR Part 68. We have entered the facility as an RMP Program 1 facility.\n\nThe Hutchinson Storage Facility handles propane, normal butane, refinery grade mixed butanes (RGB) and a natural gasoline product of mixed butanes and pentanes. The propane and butane LPG products are delivered to the facility by truck, railcar, or pipeline and offloaded into storage tanks and underground storage caverns. These products are likewise distributed from the storage facility by transport trucks, railcars and pipeline. The natural gasoline product is deli"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000107283,
      "SummaryText": "vered to the facility by pipeline, and is distributed from storage into either railcars or pipelines. The facility contains one Risk Management Plan (RMP) regulated process; hydrocarbon terminal loading and unloading operations. Ethyl mercaptan is also present on the site for use as a propane odorant, but is stored below the threshold quantity. No other RMP regulated flammables or toxic substances other than those noted above are handled at the Facility.\n\nThe facility is regulated by Federal OSHA 29 CFR 1910.119 and 40 CFR Part 68.  We have entered the facility as an RMP Program Level 1 facility.\n\nToxics\n\nThere are no toxic materials contained on site above the threshold limits.\n\nFlammables\n\nPropane, normal butane, mixed refinery grade butanes (RGB) and a natural gasoline mixture are the finished products which can be delivered from or loaded into tank trucks and rail tank cars. Small quantities of ethane and isobutane above one percent can be found in the propane, and some isobutane can likewise be found in the normal butane and natural gasoline products. These materials are routed through on site above ground storage tanks when being offloaded into storage, or when being loaded for wholesale delivery by truck transport and rail car.\n\nOffsite Consequence Analysis Results\n\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.\n\nGeneral Accidental Release Prevention Program\n\nThe following is a summary of the accidental release prevention program in place at Hutchinson Storage Facility.  The process at the facility is regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation (Program 1).  Release prevention is provided through the use of written operating procedures, employee training in written procedures, including normal operation and emergency release procedures,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000107283,
      "SummaryText": "and in the design of safety and release prevention equipment installed at the terminal site.  In addition, a written safety program designed to comply with all applicable OSHA safety performance regulations is strictly enforced at all Enterprise facilities, including the Hutchinson Storage Facility  facility.  As part of the Enterprise safety program, the facility utilizes procedures that are included in the Enterprise program, but may not specifically be required at non-PSM and/or RMP Program 1 facilities (e.g. Safe work practice training; safe work permitting and hot work permitting).\n\nUniversal Prevention Activities\n\nThe accident prevention program summarized previously is applied to all RMP covered processes at Hutchinson Storage Facility .  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\nSpecialized Safety Features\n\nThe Hutchinson Storage Facility  has safety features on many units to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\n\nRelease Detection\n\n* Hydrocarbon (hazardous gas) detectors and alarms\n* Plant video surveillance system\n\nRelease Containment and Control\n\n* Valves to permit isolation of the process (manual or automated).\n* Automatic shutdown systems for specific process parameters (e.g., high pressure).\n* Secondary containment (curbs and dikes) to contain any release of liquid chemicals\n* Redundant equipment and instrumentation where advisable\n* Atmospheric relief devices\n\nRelease Mitigation\n\n* Hand-held fire extinguishers\n* Personnel trained in emergency response and procedures.\n* Personnel protective equipment (e.g., flame retardant coveralls, hard hats, safety glasses, etc.)\n\nFive Year Accident History\n\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000107283,
      "SummaryText": "brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\n\nThis facility has had no accidental releases in the last five years which meets the criteria set forth in 40 CFR 68.10.\n\nEmergency Procedures Information\n\nThe Hutchinson Storage Facility maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address notification of local emergency response agencies if a release occurs. Employees receive training in emergency procedures. The emergency procedure is updated when necessary based on required plan changes or modifications made to the terminal facilities.\n\nThe overall emergency procedure program for the Hutchinson Storage Facility is coordinated with the Reno County Local Emergency Planning Committee (LEPC). This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials and industry representatives. The Hutchinson Storage Facility has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\n\nPlanned Changes to Improve Safety\n\nThe Hutchinson Storage Facility resolves all findings from PHAs, some of which result in modifications to the process.  Other recommendations for possible changes to improve safety come from periodic accident prevention program audits, incident investigations, or employee suggestions and recommendations.  The following changes are planned for implementation at the Hutchinson Storage Facility .\n\n* No changes are planned."
    }
  ]
}