{
  "FacilityID": 1000039301,
  "FacilityName": "Sharyland WSC Plant No. 2",
  "FacilityStr1": "12200 N. Ware Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Edinburg",
  "FacilityState": "TX",
  "FacilityZipCode": "78541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48215",
  "LEPC": "Hidalgo County LEPC",
  "FacilityLatDecDegs": "26.3189",
  "FacilityLongDecDegs": "-98.2456",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 55122717,
  "ParentCompanyName": "Sharyland WSC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sherilyn Dahlber",
  "OperatorStr1": "4210 E. Main Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Alton",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78573",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jose Villescas",
  "RMPTitle": "Operations Manager",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000224777",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-10-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-12-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-03-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-03-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-03-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "1",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000048544,
      "AltID": "Disinfection",
      "FacilityID": 1000039301,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000048986,
          "ProcessID": 1000048544,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000058928,
          "ProcessID": 1000048544,
          "ChemicalID": 62,
          "Quantity": 16150.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000558928,
          "ProcessID": 1000048544,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039301,
      "SummaryText": "The Accidental Release Prevention Risk Management Program rule (40CFR Part 68) is similar to the\n\nOccupational Safety and Health Administration's Process Safety Management Program, which is designed to protect workers from the accidental release of hazardous substances. The Risk Management Program Rule addresses over 100 chemical substances, 77 of which are acutely toxic and 63 are flammable gases, and the accidental release of these substances. The United States Environmental Protection Agency (USEPA) estimates that over 100,000 sources are covered by the rule, including chemical manufacturers and wholesalers, certain retailers, potable water treatment systems, wastewater treatment plants, ammonia refrigeration systems, and federal facilities.\n\n\n\nThe Sharyland WSC Water Treatment Plant (WTP) No.2 falls under this regulation because of the on-site storage of chlorine. The amount of chlorine stored is above the threshold limit specified by the USEPA thereby making the facility subject to compliance with the regulation. Sharyland WSC personnel have complied with the USEPA Risk Management Program rule and have completed an Accidental Release Program Plan (ARPP) that contains the following required information.\n\n\n\nMANAGEMENT SYSTEM\n\n\n\nA hazards assessment that establishes the worst case and alternate release scenarios and their impact on the population and the environment (40 CFR Subpart B)\n\n\n\nA prevention program that includes safety information, a hazards review, operating procedures, training,\n\nmaintenance, compliance audits and incident investigation (40 CFR Subpart C)\n\n\n\nAn emergency response plan (40 CFR Part 68 Subpart E)\n\n\n\nThe following subsections discuss details of the plan that have been implemented at the Sharyland WSC\n\nWTP No. 2.\n\n\n\nRELEASEPREVENTIONAND EMERGENCYRESPONSEPOLICIES\n\n\n\nThe emergency response policies at this facility ensure that there is emergency response coverage 24 hours a day, 7 days per week. There are also adequate provisions for coordin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039301,
      "SummaryText": "ation with outside agencies, such as the City of McAllen Fire Department in the event of an emergency. In the event of a release, plant staff will contact the City of McAllen Fire Department, relaying information regarding the release prior to implementing plant evacuation to a location outside the plant gates, awaiting the fire department to inform\n\nits personnel of all information about the release and to provide assurance that the plant has been totally\n\nevacuated.\n\n\n\nREGULATEDSUBSTANCES\n\n\n\nThe WTP uses chlorine as a disinfectant in the water treatment process. The plant regularly has a storage\n\nmaximum quantity of 8 one-ton cylinders and one 150 lb. cylinder of chlorine at its facility that is stored outside. This is above the threshold limit of 2,500 pounds set by the EPA.\n\n\n\nPROCESS DESCRIPTION\n\n\n\nFour raw water pumps take suction from a terminal reservoir located at the water treatment plant site.  From there, the water flows into a raw water structure where the pumps convey water into a rapid mix chamber and then into a splitter box where the flow splits into four identical treatment trains.  Each treatment train consists of two flocculation chambers, two sedimentation basins and two mixed media filters.  After the treatment trains, the water combines to supply a transfer clearwell.  From the clearwell, two transfer pumps supply two ground storage tanks.  Four high service pumps take suction from the storage tanks to supply the distribution.\n\n\n\nLiquid ammonium sulfate is applied after the raw water structure but before the rapid mix.  Liquid alum and chlorine dioxide are applied at the rapid mix chamber, and gas chlorine is injected at the splitter box.  Post disinfection with gas chlorine is applied ahead of the ground storage tanks as needed.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThe Sharyland WSC WTP Plant No. 2 accident history was reviewed from January 2009 to February 2014. During this period, no accidental releases of chlorine have occurred.\n\n\n\nEMERGENCYRE"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039301,
      "SummaryText": "SPONSEPROGRAM\n\n\n\nThis facility has developed an Emergency Response Program involving the immediate plant evacuation once the City's Fire Department is called to implement response and repair to leaking chlorine gas. The plant is staffed 24 hours per day, 7 days a week. Plant operators are required to make rounds for inspection and monitoring of the plant's processes every hour. Accordingly, plant staff will detect any releases of chlorine and the Fire Department is trained to respond to the situation.\n\n\n\nThe Emergency Response Plan includes: (1) procedures to follow in the event of a chlorine emergency, (2) information about the plant's evacuation plan and (3) a detailed description for the emergency responders' plan for handling such as an emergency.\n\n\n\nThe City of McAllen Fire Department has been designated to provide emergency responders and equipment, and will assume Incident Command upon arrival to the plant's emergency.\n\n\n\nPLANNED CHANGESTO IMPROVE SAFETY\n\n\n\nThe water treatment plant will continue to train plant personnel in chlorine safety procedures by attending\n\nclasses and safety meetings. The use of safety equipment (self-contained breathing apparatus, gloves,\n\nclothing) shall be emphad.\n\n\n\n"
    }
  ]
}