{
  "FacilityID": 1000042846,
  "FacilityName": "LANXESS Southeast Dist Center, Simpsonville, SC",
  "FacilityStr1": "103 Harrison Bridge Road",
  "FacilityStr2": null,
  "FacilityCity": "Simpsonville",
  "FacilityState": "SC",
  "FacilityZipCode": "29681",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45045",
  "LEPC": "Greenville County LEPC",
  "FacilityLatDecDegs": "34.705320",
  "FacilityLongDecDegs": "-082.233880",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lanxess.com",
  "FacilityEmailAddress": "eric.smith@lanxess.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "LANXESS AG",
  "Company2Name": null,
  "CompanyDUNS": 333335490,
  "Company2DUNS": 333335490,
  "OperatorName": "LANXESS Corporation",
  "OperatorStr1": "111 RIDC Park West Drive",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburgh",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15275",
  "OperatorZipCodeExt": "1112",
  "RMPContact": "Eric Smith",
  "RMPTitle": "Head, Warehouse & Transp Operations",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000160719",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-07-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-08-08 00:00:00",
  "DeRegistrationEffectiveDate": "2019-06-28 00:00:00",
  "AnniversaryDate": "2019-07-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.70893,
  "FRS_Long": -82.23234,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000052845,
      "AltID": "Drum Storage",
      "FacilityID": 1000042846,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000053575,
          "ProcessID": 1000052845,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064143,
          "ProcessID": 1000052845,
          "ChemicalID": 77,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564143,
          "ProcessID": 1000052845,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042846,
      "SummaryText": "This RMP correction submitted on July 02, 2014 is to address a minor administrative change for Emergency Contact from Robert (Bob) E. Scott to Chuck Bridwell, D.C. Manager, Terminal Warehouse Inc.\n\n\n\nThis RMP correction, entered on August 16, 2011, is to document that in spring 2009, the SEDC Worst-Case (WC) release calculation was reviewed. It was determined that no significant changes had occurred since the last resubmission in 2004 that would affect the distance-to-endpoint in such a way that it would reach offsite receptors or alter the 0.01 mile distance-to-endpoint recorded in the RMP.  However, on August 10, 2007, a maximum daily temperature of 105F was reached, which is higher than the 99F used in the 2004 submission.  Re-calculating the distance-to-endpoint for the WC using 105F provides a slight increase from 37 to 45 feet but this still results in a 0.01 mile distance reported in the RMP, and does not reach offsite receptors. Therefore, the SEDC site remains an RMP Level 1 site. In addition, the emergency contact information under registration information section 1.8 was updated.\n\n\n\nThe RMP resubmission on September 3, 2010 addressed a clerical issue with the RMP report submitted on November 5, 2009.  That November 5, 2009 report was the 5-year RMP resubmission for the LANXESS SEDC facility but upon submission it was apparently recorded inadvertently as a \"Correction\" rather than a \"Resubmission.\"\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies:\n\nWe at LANXESS Corporation are committed to employee, public, and environmental safety. This is demonstrated by our accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the storage and distribution processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release were to occur, our personnel are trained to t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042846,
      "SummaryText": "ake emergency actions to control and mitigate the effects of the release.  We are coordinated with the local Fire Department, which provides additional emergency response expertise.  Also, LANXESS Corporation is a member of the American Chemistry Council (ACC); we have implemented the provisions of the ACC Responsible Care program at our Southeast Distribution Center facility.\n\n\n\n2. The Facility and the Regulated Substances Handled:\n\nOur facility's primary activities encompass warehousing and wholesaling of chemicals. Contract employees manage and operate the warehouse.  We have one substance present at our facility that is regulated under the EPA Risk Management Regulation. This substance, toluene diisocyanate, is used as a reactant in the manufacturing of flexible polyurethane foams and other elastomers. No manufacturing or processing of toluene diisocyanate or any other chemical takes place at this facility.\n\n\n\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\n\nWe have taken the necessary steps to comply with the accidental release prevention requirements. Materials are stored in containers constructed according to Federal Department of Transportation (DOT) requirements. The closed containers are stored in accordance with the National Fire Protection Agency (NFPA) codes. Containers are inspected for integrity when pulling orders for shipment and during the loading process.\n\n\n\nIn addition, our facility implements a variety of safety and environmental preventive procedures and programs, including but not limited to written operating procedures, employee training (including training on operating procedures, safety topics, and emergency actions), contractor safety programs, pre-startup safety reviews, safe work practices, incident investigation, and compliance audits.\n\n\n\n4. Five-year Accident History\n\nDue to our stringent release prevention policies, there have been no incidents meeting accidental release criteria during"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042846,
      "SummaryText": " the last 5 years.\n\n\n\n5. Emergency Response Plan\n\nOur facility maintains a written emergency response plan to deal with accidental releases of hazardous materials. The plan addresses applicable aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\n6. Planned Changes to Improve Safety:\n\nThere are no new developments and no findings that have resulted from the implementation of the various elements of our accidental release prevention program. No recommendations were made.\n\n\n\n"
    }
  ]
}