{
  "FacilityID": 1000043553,
  "FacilityName": "Lake of the Pines Water Treatment Plant",
  "FacilityStr1": "12812 Torrey Pines Drive",
  "FacilityStr2": null,
  "FacilityCity": "Auburn",
  "FacilityState": "CA",
  "FacilityZipCode": "95603",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06057",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "39.033333",
  "FacilityLongDecDegs": "-121.050000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.nidwater.com",
  "FacilityEmailAddress": "crough@nidwater.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Nevada Irrigation District",
  "Company2Name": null,
  "CompanyDUNS": 47883061,
  "Company2DUNS": 0,
  "OperatorName": "Nevada Irrigation District",
  "OperatorStr1": "1036 West Main St.",
  "OperatorStr2": null,
  "OperatorCity": "Grass Valley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95945",
  "OperatorZipCodeExt": "1019",
  "RMPContact": "Timothy A. Crough, PE",
  "RMPTitle": "Assistant General Manager",
  "FTE": 0,
  "OtherEPAFacilityID": "4941",
  "EPAFacilityID": "100000039674",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-10-14 00:00:00",
  "SafetyInspectionBy": "Nevada County CUPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-02-26 00:00:00",
  "DeRegistrationEffectiveDate": "2015-02-24 00:00:00",
  "AnniversaryDate": "2019-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.02876,
  "FRS_Long": -121.06865,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053738,
      "AltID": "water treatment plant",
      "FacilityID": 1000043553,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054521,
          "ProcessID": 1000053738,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065400,
          "ProcessID": 1000053738,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565400,
          "ProcessID": 1000053738,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043553,
      "SummaryText": "Nevada Irrigation District has instituted a Risk Management Program for their water treatment facility, Lake of the Pines Water Treatment Plant, as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68, California Health & Safety Code (H&SC) Division 20, Chapter 6.95, Article 2, Section 25534(b)(1), and California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5, California Accidental Release Prevention Program (Cal/ARP). The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substances (RS's) handled at this facility in excess of Federal threshold quantities; describes the structured assessment of hazards which was conducted to assess possible effects on employees and offsite public and environmental receptors; provides the results of an offsite consequences analysis; defines a prevention program, emergency response program, and mitigation measures to reduce the probability and magnitude of accidental releases of RS's; and establishes a schedule and responsibilities for implementation of mitigation measures and auditing of program elements.  This Risk Management Plan (RMP) is being filed as required by ARP and CalARP regulations in order to report the elements of the current Risk Management Program and to describe further measures planned to mitigate or prevent accidental releases of RS's. \n\n\n\nThis submittal is a complete revision and re-certification of the RMP as required every 5 years. It is being filed with USEPA and with the local Administering Agency, Nevada County Department of Environmental Health. \n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n\n\nNevada Irrigation District provides water service to a large portion of western Nevada County and a small area of Placer County near the City of Auburn.  It operates several water treatment plants.  Its Lake of the Pines Water Treatment Plant is located at 12812 Torrey Pines Dr., Au"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043553,
      "SummaryText": "burn, CA in Nevada County, and uses chlorine, an RS, for disinfection in quantities greater than the California and Federal threshold quantities for this RS.  The facility is located in a residential neighborhood in the Lake of the Pines subdivision.  There are no full-time employees at this site.  Operators visit the site daily.  Chlorine is received in ton containers by truck, handled with an electric hoist, and stored on ton container scales inside the building.  The chlorine is used to control biological growth on the filters and to disinfect the treated water. Pressurized chlorine gas within a ton container is reduced to vacuum at a vacuum regulator valve mounted directly on the ton container's gas valve. The chlorine under vacuum is metered through rate valves and rotameters in chlorinators, and drawn into water solution by the passage of pressurized water through an injector.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nIt is the policy of Nevada Irrigation District that the receipt, storage and handling of chlorine at its facility be done in a manner which meets regulatory requirements and minimizes the probability and severity of accidental releases of chlorine to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment.  In order to accomplish this goal, Nevada Irrigation District has gathered safety information on chlorine and on the process, equipment and procedures involving chlorine; performed a structured assessment of hazards of the process and external events which might affect the process; performed an offsite consequences analysis of defined release scenarios; established a written program for prevention and mitigation of accidental releases; and established a written emergency response program coordinated with emergency response agencies.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\n\n\nGeneral accidental release prevention programs instituted by Nevada Irrigation Distric"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043553,
      "SummaryText": "t are categorized as administrative (management) programs; procedures, training, and engineering controls; and emergency response programs. Nevada Irrigation District has instituted a Process Safety Management (PSM) Program meeting OSHA requirements at 29 CFR 1910.119 and Cal/OSHA reauirements at GISO 5189 covering its chlorine process.  This constitutes the general accidental release prevention program for Nevada Irrigation District's operations. Nevada Irrigation District has established formalized program and document management procedures used as the management system for the PSM and RMP.\n\n\n\nCHEMICAL-SPECIFIC RELEASE PREVENTION STEPS\n\n\n\nRelease prevention steps specific to chlorine have been identified and implemented. This includes elimination of the pressurized chlorine header and installation of cylinder mounted vacuum regulators. Also, a chlorine leak scrubber has been installed at this site. A chlorine leak detector was installed at the discharge of the chlorine leak scrubber.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no accidents involving chlorine at this facility within the past five years resulting in injuries or offsite consequences.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nNevada Irrigation District's Emergency Response Program applicable to chlorine has been coordinated with Nevada County Department of Environmental Health, the local agency responsible for hazardous materials inventory reporting and release response coordination.  It consists of notification of the public agency assigned responsibility for First Response to hazardous materials release emergencies and evacuation of persons on site to designated assembly areas upwind of the released gas.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nNevada Irrigation District plans to change the disinfectant treatment chemical at the Lake of the Pines water treatment plant to aqueous bleach, and to eliminate chlorine, later this year. All of the improvements and mitigation measures identified in the process h"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043553,
      "SummaryText": "azard analyses which Nevada Irrigation District committed to accomplish have been completed or are in progress.  Any other measures identified by employees during workplace hazard surveys, or as a result of audit activities, will be thoroughly reviewed and considered for implementation."
    }
  ]
}