{
  "FacilityID": 1000036265,
  "FacilityName": "Lisbon LNG Gas Processing Facility",
  "FacilityStr1": "50 North Big Indian Spur",
  "FacilityStr2": "County Road 111",
  "FacilityCity": "Moab",
  "FacilityState": "UT",
  "FacilityZipCode": "84532",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49037",
  "LEPC": null,
  "FacilityLatDecDegs": "38.160556",
  "FacilityLongDecDegs": "-109.280000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.prometheusenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Prometheus Energy Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 828776612,
  "Company2DUNS": null,
  "OperatorName": "Prometheus Energy Group, Inc.",
  "OperatorStr1": "10370 Richmond Ave., Suite 450",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77042",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000203816",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-09-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-09-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-09-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-03-27 00:00:00",
  "DeRegistrationEffectiveDate": "2016-02-04 00:00:00",
  "AnniversaryDate": "2018-09-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 38.56129,
  "FRS_Long": -109.52945,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044456,
      "AltID": "LNG Storage&Truck Loading",
      "FacilityID": 1000036265,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000053501,
          "ProcessID": 1000044456,
          "ChemicalID": 93,
          "Quantity": 160000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000044878,
          "ProcessID": 1000044456,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000038659,
              "Process_NAICS_ID": 1000044878,
              "SafetyReviewDate": "2013-07-19 00:00:00",
              "PHA_Date": "2009-11-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-05-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Natural Berm area around tanks",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-07-19 00:00:00",
              "TrainingReviewDate": "2013-07-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-07-19 00:00:00",
              "EquipmentInspectionDate": "2013-08-16 00:00:00",
              "EquipmentTested": "Refrigeration system",
              "ChangeMgmtDate": "2012-06-27 00:00:00",
              "ChangeMgmtReviewDate": "2013-07-23 00:00:00",
              "PreStartupReviewDate": "2013-08-15 00:00:00",
              "ComplianceAuditDate": "2013-07-08 00:00:00",
              "AuditCompletionDate": "2013-11-30 00:00:00",
              "IncidentInvestigationDate": "2012-03-18 00:00:00",
              "InvestigationChangeDate": "2012-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2013-07-19 00:00:00",
              "HotWorkPermitReviewDate": "2013-07-23 00:00:00",
              "ContractorSafetyReviewDate": "2013-07-19 00:00:00",
              "ContractorSafetyEvalDate": "2013-07-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000045823,
                  "PreventionProgram3ID": 1000038659,
                  "ProcessChemicalID": 1000053501
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000044879,
          "ProcessID": 1000044456,
          "NAICSCode": "32799",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000044880,
          "ProcessID": 1000044456,
          "NAICSCode": "42499",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000036265,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-07-19 00:00:00",
    "ERTrainingDate": "2012-07-25 00:00:00",
    "CoordinatingAgencyName": "Moab Fire Department",
    "CoordinatingAgencyPhone": "4352595557",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036265,
      "SummaryText": "Lisbon LNG Gas Processing Facility Executive Summary\r\n\r\nPrometheus Energy Group (PEG) has prepared this Risk Management Plan to comply with federal Risk Management Program regulations contained in 40 CFR Part 68.\r\n\r\nPEG is committed to operating in a manner that is safe for PEG employees, the public, and the environment.  As part of this commitment, PEG has established a system to help ensure safe operation of the processes at its facility in Lisbon, Utah. \r\n\r\nOne component of this system is a risk management program (RMP) that helps manage the risks at the Lisbon LNG Processing Facility and complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR Part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at PEG's Lisbon LNG Processing Facility.  This document is intended to satisfy the RMPlan requirement of the RMP rule and to provide the public with a description of our risk management program.\r\n\r\nThe risk management program at the Lisbon LNG Processing Facility consists of three elements:\r\n\r\n1. A hazard assessment to help understand the potential offsite consequences of hypothetical accidental releases and accidents that are more likely to occur at the facility.\r\n\r\n2. A prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance, in our case, Methane.\r\n\r\n3. An emergency response program to help respond to accidental releases of regulated substances from covered processes.\r\n\r\nInformation further describing these elements is provided in this RMPlan.\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nPrometheus Energy Group is committed to the safety of employees and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036265,
      "SummaryText": "substances.  The Lisbon LNG Processing Facility implements reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of processes in the gas processing facility; and programs to continuously evaluate the hazards at the Lisbon LNG processing facility.\r\n\r\nIn the event of an accidental release, PEG controls and contains the release in a manner that will be safe for employees and will help prevent injury to the public or the environment.  Although the local fire department, the Moab Fire Department, is the designated first responder to the Lisbon LNG Processing Facility, PEG provides response training to its employees, designates an emergency response coordinator to oversee response activities until the fire department takes over, and coordinates response efforts with the local fire department.  The Moab Fire Department is staffed with certified firemen and is manned 24 hours per day.  \r\n\r\nIn order to effectively implement these policies, PEG has established a management system headed by Director of Operations  to oversee RMP-related activities.\r\n\r\nFacility Information and Regulated Substances\r\nPrometheus Energy Group operates a residue gas to liquid natural gas processing facility that employs approximately 2 full-time workers.  The gas processing produces up to approximately 21,000 gallons per day of liquefied natural gas (LNG).  The LNG produced at the facility consists of 97% methane and is stored in two above ground storage tanks that are co-located and permanently interconnected, each with a capacity to hold 27,000 gallons.  However, administrative and engineering controls maintain that the maximum amount of LNG in the storage tank at any point is 24,800 gallons.  The LNG from the storage tank is transported off site in tanker trucks that fill up at the LNG Truck Loading station. According to 40 CFR 68,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036265,
      "SummaryText": "facilities with acutely hazardous materials or flammable materials over the regulatory threshold in a single process are required to prepare a Risk Management Plan (RMP).\r\n\r\nThe RMP-covered process at the Lisbon LNG Processing Facility is the LNG Storage and Truck Loading process.  The LNG storage tank stores up to but no more than 48,600 gallons of LNG, which equates to approximately 165,800 pounds of methane, a flammable material.  The regulatory threshold for methane is 10,000 pounds.  The LNG Storage and Truck Loading process is a Program Level 3 process.\r\n\r\nAccidental Release Prevention Program and Chemical-specific Prevention Steps\r\n\r\nAccidental Release Prevention Program\r\nThe Lisbon LNG Processing Facility complies with both the Federal and State Chemical Accident Prevention Program provisions as well as OSHA's Process Safety Management regulations and as such, has developed procedures and policies that address the following:\r\n\r\n* Maintaining process safety information to document physical properties of hazardous substances handled at the gas processing facility and the design basis and safe operating parameters for equipment at the facility.\r\n\r\n* Performing process hazard analyses to help identify potential process hazards and to generate recommendations and action plans to improve safe operations.\r\n\r\n* Defining safe operating procedures.\r\n\r\n* Training of workers to safely and effectively perform assigned tasks.\r\n\r\n* Inspecting and testing to assess equipment mechanical integrity.\r\n\r\n* Managing change to ensure that change does not negatively affect safe operations.\r\n\r\n* Performing pre-startup safety reviews of new or modified processes.\r\n\r\n* Conducting compliance audits to be certain that safety programs are effectively addressing safety issues.\r\n\r\n* Investigating incidents so that similar accidents can be prevented.\r\n\r\n* Employee participation to help ensure that safety concerns of employees are addressed.\r\n\r\n* Using hot work permits to control spark or fl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036265,
      "SummaryText": "ame producing activities that could result in fires or explosions.\r\n\r\n* Using other safe work permits such as Lockout/Tagout and confined space entry permits.\r\n\r\n* Managing contractor activities to ensure their work is performed in a safe manner.\r\n\r\n\r\nChemical-specific Prevention Steps\r\nIn addition to the required prevention program elements, PEG has implemented safety features specific to the hazardous substance at the Lisbon LNG Processing Facility. The facility was designed to include several risk mitigation items which include: \r\n\r\n* combustible gas and fire detectors strategically placed throughout the facility;\r\n* alarms for temperature, pressure, and flow; \r\n* high-high and low-low interlocks that shut down equipment and isolate gas flow; \r\n* a dike around the storage tank; \r\n* fail-safe valves upon loss of power or air; and\r\n* emergency shut down  and isolation valves.\r\n\r\n\r\nFive-Year Accident History\r\n\r\nThere were no accidents/release events. There was one minor first aid incident at the facility. On 3/18/2012, a plant operator strained himself while trying to latch the door for an instrument air compressor enclosure. Prometheus  filed a worker's comp report with State of Utah Labor Division and with its worker's comp insurance carrier.  Prometheus also filed an OSHA injury report form. Firs aid was administered but detailed medical examination showed no long-lasting or permanent injuries for the employee.\r\n\r\nEmergency Response Program\r\nPEG has coordinated emergency response procedures with the Moab Fire Department and also developed a written emergency action plan to help safely respond to a wide range of incidents including the accidental release of hazardous materials.  The emergency action plan includes procedures for:\r\n\r\n* Informing the Moab Fire Department and the public about accidental releases that could reasonably result in off-site consequences.\r\n* Providing proper first aid and emergency medical treatment to treat accidental human exposure to haz"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036265,
      "SummaryText": "ardous substances.\r\n* Controlling and containing accidental releases of hazardous substances.\r\n\r\nPlanned Changes to Improve Safety\r\nPrometheus Energy Group constantly strives to improve the safety of their process at the Lisbon LNG Processing Facility through both the incident investigation program and a program soliciting safety suggestions from everyone involved in operating the process. All safety suggestions and observations are scrutinized and discussed during monthly all-company safety meetings. Pending improvements:  Prometheus will incease the frequency of internal safety audits."
    }
  ]
}