{
  "FacilityID": 1000081492,
  "FacilityName": "S&S Foods, LLC",
  "FacilityStr1": "1120 W. Foothill Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Azusa",
  "FacilityState": "CA",
  "FacilityZipCode": "91702",
  "Facility4DigitZipExt": "2818",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.131977",
  "FacilityLongDecDegs": "-117.924105",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 71496314,
  "ParentCompanyName": "CTI Foods",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "S&S Foods, LLC",
  "OperatorStr1": "1120 W. Foothill Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Azusa",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91702",
  "OperatorZipCodeExt": "2818",
  "RMPContact": "Tim Erbe",
  "RMPTitle": "Director Operations",
  "FTE": 220,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173279",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "115117",
  "SafetyInspectionDate": "2018-01-09 00:00:00",
  "SafetyInspectionBy": "Cal-OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-07-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.13345,
  "FRS_Long": -117.92673,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101850,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000081492,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000103132,
          "ProcessID": 1000101850,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        },
        {
          "Process_NAICS_ID": 1000103133,
          "ProcessID": 1000101850,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127700,
          "ProcessID": 1000101850,
          "ChemicalID": 56,
          "Quantity": 22340.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000627700,
          "ProcessID": 1000101850,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081492,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nS&S Foods is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the ammonia refrigeration equipment at the S&S Foods facility. \n\n\n\nIt is the policy of S&S Foods to ensure that controls are in place to limit the risks of potential ammonia releases.  S&S Foods maintains a safety committee whose members include the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  The policy is reviewed and updated as needed to ensure it remains an accurate reflection of the facility's policies regarding evacuation and the protocol to deal with emergency scenarios.\n\n\n\nS&S Foods coordinates emergency response efforts with the local fire department and with the contracted refrigeration operation and maintenance firm.  In the case of an ammonia-related emergency, it is the policy of S&S Foods to evacuate and to allow the fire department/HazMat Team to respond to the emergency.  The S&S Foods Chief Engineer will be available for guidance and assistance.\n\n\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe S&S Foods facility began operation of the facility in 1998.  The building was constructed in 1984 with several additions/modifications taking place since then.  The ammonia refrigeration system was designed and constructed in accordance with all applicable federal, state, and local regulations including the Uniform Mechanical Code (1994 updated to 1997), Uniform Building Code, and the Uniform Fire Code.  The refrigeration system at the facility was installed with and ha"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081492,
      "SummaryText": "s operated using R-22, a freon-based refrigerant.  It was designed with the intent of switching refrigerants to ammonia so that very few equipment/piping modifications were necessary.  The initial ammonia charge was received by the facility at the time that the Phase 3 expansion was finalized which included the addition of a process spiral freezer (IQF), several evaporators for new cold rooms, one compressor, and two vessels.  The refrigeration system was shut down, purged of R-22, and restarted using ammonia in November 2000.\n\n\n\nThe facility processes meat products that are distributed to fast food establishments.  The facility is located at 1120 W. Foothill Blvd. in Azusa, California, just north of the Interstate 210 freeway, between Irwindale Avenue and Vernon Avenue.  The immediate area is primarily commercial with some light industrial and residential areas.  The ammonia system was upgraded to meet the requirements of the current applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes, as well as the PSM, RMP, and CalARP regulations that govern the handling of anhydrous ammonia.\n\n\n\nRefrigeration process equipment at the facility operates continuously.  Compressors and condensers cycle on and off to comply with system demand during operation.  The refrigeration system maintains low temperatures for cold storage and for blast freezing product.  The cold storage areas include: Finished Goods, Raw Goods, Blend/Grind, Dock, Freezer, IQF (Individual Quick Freeze), Fajita Process.  There are also multiple spiral freezers.\n\n\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the Thermosyphon Receiver (TSV-1) to the High Pressure Receiver (HPR-1), which is the main liquid storage vessel in the system.  The HPR transfers high pressure liquid through the Intercooler (IC-1) in order to subcool it prior to routing to each of three Low Pressure Receivers (LPR-1, LPR-2, LPR-3).  Each Low Pressure Rec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081492,
      "SummaryText": "eiver operates an independent system with a specific process or storage freezer(s).  The HPR also supplies high pressure liquid to the Controlled Pressure Receiver (CPR-1), which maintains a constant pressure through the use of pressure regulating valves.  CPR-1 is the main liquid supply vessel for the evaporators.  As the liquid ammonia enters the various evaporator/freezer coils, it expands, reducing the temperature.\n\n\n\nAs heat from the room (or product in the Spiral Freezers) is transferred to the low temperature liquid ammonia in the coils, the ammonia is (partially) vaporized.  The suction from the evaporators is pulled to the Suction Accumulator vessel (AC-1).  The suction from each of the spiral freezers is returned to the corresponding Low Pressure Receiver.  Four compressors (HC-1, HC-2, LC-1, and BC-1) pull the gaseous ammonia from the suction vessels and work in combination to compress the low pressure ammonia to high pressure gas (hot gas).  The hot gas is discharged through a common header to the Condensers (EC-1, EC-2), where fans and sprayed water are used to condense the ammonia in the coils back into a liquid.  As the ammonia changes phase into liquid, the heat from the system is discharged to the atmosphere.  The liquid is then drained into TSV-1.\n\n\n\nHot gas (high stage compressor discharge) is also used for defrost in the evaporators and for pressurizing liquid transfer tanks associated with the recirculator vessels.  The system also has a water diffusion tank (into which a common relief header vents), which is kept full of water in order to neutralize any ammonia vapor that is vented.\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe S&S Foods ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the S&S Foods facility utilizes the continuing services of a professional refriger"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081492,
      "SummaryText": "ation operations and maintenance company to assist with required inspections and tests and to conduct any necessary repairs to the ammonia refrigeration equipment.\n\n\n\nThe S&S Foods facility, including the ammonia system, was designed and constructed in accordance with the Uniform Mechanical Code, which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include a water diffusion tank, ammonia sensors in the machine room as well as sensors in the cold storage areas, and automatic shut down systems that prevent equipment damage and ammonia releases.  The ammonia sensor in the machine room is interlocked to: 1) provide alarms for facility operators (via a telemetry system), 2) shut down the system, and 3) activate emergency ventilation that scrubs ammonia through a water reservoir.  There is also an emergency button located outside the machine room that when manually activated, will shut down the machine room equipment.\n\n\n\nIn addition, the majority of the ammonia inventory is centrally located (inside the machine room and just outside of the machine room).  All pressure vessels are equipped with pressure relief valves that automatically engage in case of a high pressure situation and vent through a common header to a water diffusion tank where any ammonia vapors are neutralized.\n\n\n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted and repaired immediately.\n\n\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nEPA's RMP regulation defines \"accident\" as the following: \n\n\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the pro"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081492,
      "SummaryText": "cess. The release must have caused at least one of the following: \n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\" \n\n\n\nAn investigation into the facility's accident history during the past 5 years (July 2014 - July 2019) revealed that there have been no releases of ammonia over the past five years that exceeded the Federal Reportable Quantity of 100 pounds in 24 hours, or that meet the EPA reporting criteria for the Five-Year Accident History as specified above.  In addition, there have been no injuries resulting from a release of ammonia, nor any releases or \"near misses\" that warranted an internal incident investigation.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nS&S Foods has an emergency action plan in effect at the facility.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document.  Emergency response activities are coordinated with the Los Angeles County Fire Department and the City of Azusa Fire Department.  In case of a major ammonia emergency, the facility will first call 9-1-1 to alert the local Police and Fire Departments.  Other responders will be called as needed, including the LA County Hazardous Materials Response Team.  If a release exceeds the federal reporting quantity of 100 pounds for ammonia, the National Response Center would be called.\n\n\n\nThe S&S Foods facility has an Emergency Command System in place.  The Director of Operations will assume command in an emergency situation with backup personnel appointed to serve if he is not available.  S&S Foods maintains a safety committee whose members include the designated emergency coordinators for the facility plus corporate representation.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be imp"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000081492,
      "SummaryText": "lemented to respond effectively to emergency situations that may arise at the facility.  The facility holds evacuation drills and/or other emergency action plan training at least once per year.\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nS&S Foods is committed to the safety of employees as well as neighboring residents and businesses.  Continual evaluations of risks associated with the ammonia refrigeration process by in-house personnel as well as outside risk management professionals help to limit the possibility of unintended impacts from the ammonia system.\n\n\n\nItems identified in studies such as the recent Process Hazard Analysis Revalidation will be implemented to further reduce the risks.  S&S Foods also plans to improve safety as follows:\n\n \n\n?    Continued involvement of refrigeration and safety personnel in the ongoing development and implementation of the risk management policies.\n\n?    Attendance and participation of key personnel in industry groups such as RETA and IIAR ensure the facility is aware of evolving industry standards and techniques used to encourage safety.\n\n?    Conducting routine RMP and PSM meetings to ensure any issues identified by refrigeration personnel, contractors, consultants, or the safety department are discussed and addressed.\n\n\n\nThe facility also plans to address and resolve findings and recommendations from recent studies such as the PHA Revalidation Study and the Three-Year Compliance Audit.\n\n"
    }
  ]
}