{
  "FacilityID": 1000004251,
  "FacilityName": "Octoraro Water Treatment Plant",
  "FacilityStr1": "100 Ashville Road",
  "FacilityStr2": null,
  "FacilityCity": "Little Britain",
  "FacilityState": "PA",
  "FacilityZipCode": "19362",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42071",
  "LEPC": "Lancaster County LEPC",
  "FacilityLatDecDegs": "39.795000",
  "FacilityLongDecDegs": "-076.045833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.chesterwater.com",
  "FacilityEmailAddress": "rcwilliams@chesterwater.com",
  "FacilityDUNS": 7910219,
  "ParentCompanyName": "Chester Water Authority",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Chester Water Authority",
  "OperatorStr1": "100 Ashville Road",
  "OperatorStr2": null,
  "OperatorCity": "Nottingham",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19362",
  "OperatorZipCodeExt": null,
  "FTE": 34,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000107868",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-10-29 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.79358,
  "FRS_Long": -76.0446,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "240000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000005184,
      "AltID": "Chlorination",
      "FacilityID": 1000004251,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000005824,
          "ProcessID": 1000005184,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000005388,
          "ProcessID": 1000005184,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000003310,
              "Process_NAICS_ID": 1000005388,
              "SafetyReviewDate": "2009-05-29 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute, AWWA",
              "FR_Comments": "Process equipment for chlorine use complies with applicable Chlorine Institute and AWWA standards.",
              "HazardReviewDate": "2009-05-29 00:00:00",
              "ChangeCompletionDate": "2009-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Vacuum feed system for chlorine gas for all chlorine process piping and equipment external to chlorine storage building",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Remotely activated emergency shutoff on ton container. Scrubber system installed May 2005",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-06-09 00:00:00",
              "TrainingReviewDate": "2009-06-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-06-09 00:00:00",
              "EquipmentInspectionDate": "2009-05-14 00:00:00",
              "EquipmentTested": "No. 1 Chlorine Evaporator",
              "ComplianceAuditDate": "2009-05-29 00:00:00",
              "AuditCompletionDate": "2009-06-09 00:00:00",
              "IncidentInvestigationDate": "2004-05-24 00:00:00",
              "InvestigationChangeDate": "2004-07-21 00:00:00",
              "MostRecentChangeDate": "2008-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000003376,
                  "PreventionProgram2ID": 1000003310,
                  "ProcessChemicalID": 1000005824
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000004251,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lancaster County EMA",
    "CoordinatingAgencyPhone": "7176641200",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000004251,
      "SummaryText": "1. INTRODUCTION\n\nThe Chester Water Authority (CWA) operates the Octoraro Water Treatment Plant in Little Britain Township, Lancaster County, Pennsylvania. Water from Octoraro Reservoir, and the Susquehanna River, is treated by conventional physical and chemical processes to meet EPA drinking water standards.  These processes include disinfection with chlorine.\n\nCWA carefully stores and handles chlorine to prevent its accidental release.  This Risk Management Plan (RMPlan) describes the chemical hazards and explains what CWA has done and continues to do, to prevent an accidental release.  It has been developed and implemented in accordance with the U.S. Environmental Protection Agency (EPA) Accidental Release Prevention Provisions (40 CFR 68) and guidelines specifically created for water treatment plants (WTPs).\n\nCWA purchases chlorine (CAS Number 7782-50-5) as a compressed liquefied gas from commercial suppliers.  In the disinfection process, liquid chlorine is fed to a vaporizer where the liquid is converted to a gas and then injected under vacuum into the treated drinking water. CWA's chlorine inventory exceeds the threshold quantity of 2,500 pounds established under the RMP regulations. The Octoraro WTP also uses ammonia, but the maximum inventory is below the RMP threshold quantity of 10,000 pounds; therefore, CWA's ammonia use is not regulated under RMP. \n\nCWA's Policies, Release Prevention, and Emergency Response programs for chlorine are described in the following subsections. \n\n2. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Chester Water Authority has a policy that addresses its commitment to accident prevention and risk management. This policy reads as follows:\n\nThe Chester Water Authority is committed to protecting its employees, the public, and the environment from any accidental releases of hazardous materials used at its facilities.  CWA has implemented safety, environmental protection, and risk management programs to minimize the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000004251,
      "SummaryText": "risks presented by hazardous materials used at its facilities.  If there is an accidental release, CWA is a non-responding facility and will request from Lancaster County EMA, immediate emergency response to minimize the effect of the release. CWA will also immediately notify the public, through county emergency management agencies, of any actions necessary to ensure public protection and safety.\n\n3. FIVE-YEAR ACCIDENT HISTORY\n\nWithin the past five years, CWA's Octoraro Water Treatment Plant has had no accidental releases that resulted in injuries or damages. Under the RMP regulations, all accidental releases of a regulated substance that resulted in deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage, within the past 5 years must be reported.  \n\n4. PREVENTION PROGRAM\n\nUnder the EPA RMP regulations, three levels of prevention program requirements have been established to roughly match the level of effort to the risk of off-site impacts.  Because the offsite consequence analysis showed that the worst-case release scenario could impact offsite public receptors, and because the OSHA PSM standard (29 CFR 1910.119) is not applicable at this facility, CWA's Octoraro WTP must meet RMP Program 2 Prevention Program requirements for its chlorination process.  CWA's Prevention Program is summarized below.\n\nA.  Management System:\n\nCWA has developed a management program that assigns overall responsibility for the development and implementation of the Risk Management Program to the Chief of Treatment and Pumping at the Octoraro WTP. The management program also clearly delineates accountability and responsibility for each of the prevention program elements.\n\nB.  Safety Information:\n\nUp-to-date safety information related to the chlorination process is maintained at the plant and is used by plant operators and maintenance personnel who are responsible for operating a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000004251,
      "SummaryText": "nd maintaining the chlorination system.  It includes the following:\n\n- Material Safety Data Sheets (MSDSs) for chlorine that meet the requirements of 29 CFR 1910.1200(g).  \n- A summary of the maximum intended inventory of the equipment in which the chlorine is stored or processed.\n- Safe upper and lower operating limits (i.e., temperatures, pressures, flows, and compositions) for the chlorination system.\n- Equipment specifications for the chlorination system.\n- A list of the codes and standards used to design, build, and operate the chlorination equipment.\n- A process flow diagram of the chlorination process.\n\nThe chlorination equipment at the Octoraro WTP has been reviewed against recognized and accepted good engineering practices and is designed, maintained, inspected, tested, and operated in a safe manner.  The safety information is updated any time a major change is made to the process that renders the original information inaccurate.\n\nC. Hazard Review:  \n\nCWA performed an initial hazard review of its chlorination system using the WTP Hazard Review Checklist for Simple Chlorine Feed Systems found in the Compliance Guidance and Model Risk Management Program for Water Treatment Plants.  CWA recently conducted a scheduled Hazard Review on May 29, 2009 using a Review Checklist for Chlorine Vaporizers (based in part on The Chlorine Institute's Pamphlet 9, Chlorine Vaporizer Systems) and a Review Checklist for Chlorine Systems from the Chlorine Institute Chlorine Manual. These checklists have been utilized in previous Hazard Reviews and satisfy the requirements of 40 CFR 68.50.  Two safety recomendations were noted during this review and CWA is making the required modifications by the end of June 2009 to resolve these issues.  A copy of the completed hazard review checklists is maintained with the safety information for the Octoraro WTP chlorination system.  \n\nPrior to CWA's first hazard review (in 1999), a formal safety inspection of the chlorination system was condu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000004251,
      "SummaryText": "cted by a representative of the EPA Region 3 on 15 December 1994.  The EPA recommended several modifications to improve the safety of the chlorination process and CWA quickly acted to implement the recommended modifications.  A follow-up inspection was conducted by the EPA on 31 May 1996, and soon after, CWA received a letter from the EPA commending the facility for its commitment to accidental release prevention and mitigation. A subsequent EPA visit on 29 October 1999 achieved similar results.\n\nD.  Operating Procedures: \n\nDetailed and up-to-date standard operating procedures (SOPs) have been developed and are maintained for the chlorination process at the Octoraro WTP in accordance with 40 CFR 68.52.  These SOPs provide clear step-by-step instructions for safely conducting activities involving the chlorination process in a manner consistent with the chlorine safety information, and are readily available to all employees responsible for working with the chlorination process.  These SOPs are reviewed and updated as necessary prior to startup following modifications to the chlorination process.\n\nThese SOPs cover each operating phase of the chlorination process including normal operations, temporary operations, temporary shutdown, emergency shutdown, and startup following an emergency or temporary shutdown.  The SOPs contain special warnings and precautions for procedures that could be dangerous if performed incorrectly.  Where appropriate, the SOPs identify the consequences of deviating from the standard procedure, and also provide instructions on how to correct or avoid such deviations.  \n\nE.  Training  \n\nAll new employees who work with the chlorination system at the Octoraro WTP receive initial training in accordance with 40 CFR 68.54.  The training includes an overview of the chlorination process and equipment and emphasizes standard operating procedures, safe work practices, health and safety hazards, and emergency operations including shutdown procedures.  \n\nRef"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000004251,
      "SummaryText": "resher training is provided at a minimum of every 3 years to all employees involved in working with a regulated process.  Employees were consulted when determining the appropriate frequency of refresher training.  Documentation is maintained for each employee to ensure he or she has received and understood the required training.\n\nF.  Maintenance:\n\nA maintenance program for the chlorination system at the Octoraro WTP has been developed in accordance with 40 CFR 68.56.  Employees responsible for the maintenance of the chlorination equipment receive additional training, which includes an overview of the process, its hazards, and applicable procedures to ensure they can perform the job in a safe manner.\n\nWritten procedures and checklists are used to ensure that the chlorination equipment is properly maintained, tested, and inspected at regularly scheduled intervals and that these activities are thoroughly documented.  Maintenance, inspection, and testing procedures and frequencies are consistent with manufacturer's recommendations and follow accepted engineering practices.  Equipment deficiencies identified during maintenance, inspection, and testing are corrected in a safe and timely manner, then documented for future reference.\n\nG.  Compliance Audits:\n\nThe continued compliance of the Risk Management Program for the chlorination system at the Octoraro WTP is ensured through compliance audits. The most recent compliance audit was completed on May 29, 2009. The audits are completed by the plant's Chief of Treatment and Pumping with the assistance of those who operate and maintain the chlorination process and an individual outside the Octoraro WTP.  A report of the findings is generated following the audit and all deficiencies and/or recommendations are promptly addressed and the resolution is documented.  Previous compliance audit reports are maintained at the facility.\n\nH.  Incident Investigation:\n\nSpecific incident investigation, reporting, and documentation procedures"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000004251,
      "SummaryText": "have been implemented and are adhered to, in accordance with 40 CFR 68.60, in response to any incident involving a regulated process that did or could have reasonably resulted in a catastrophic release of a regulated substance.  Under EPA RMP, a catastrophic release is defined as a uncontrolled emission, fire, or explosion, involving one or more regulated substances that present imminent and substantial endangerment to public health and the environment.\n\nThe incident investigation procedure is initiated as soon as possible and no later than 48 hours following any incident.  A team is then established to perform the incident investigation and always includes at least one person knowledgeable in the process; a contract employee, if the incident involved the work of a contractor; and other persons with appropriate qualifications to investigate an incident. Following the investigation, a written report is prepared summarizing the following information at a minimum:  date and time of the incident; date the investigation began; description of the incident and  contributing factors; and recommendations resulting from the investigation.  When completed, the report is reviewed by all affected personnel (i.e., those that operate or maintain the process) including contract employees.  Incident investigation reports are maintained at the facility for a minimum of 5 years. \n\n5.  EMERGENCY RESPONSE PROGRAM\n\nCWA takes every precaution to prevent an emergency from occurring, including training and equipping its employees to abate a potential release in its initial stages before it becomes an emergency. CWA is a non-responding facility and relies on Lancaster County Emergency Management Agency to provide emergency response personnel and equipment.\n\nCWA's emergency action plan contains:\n\n- Emergency notifications required by the facility's SARA Title III Off-Site Response Plan, developed by Lancaster County LEPC.  Agencies notified directly by CWA include the Lancaster County Emerge"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000004251,
      "SummaryText": "ncy Management Agency, Pennsylvania Emergency Management Agency, Pennsylvania Departmant of Environmental Protection and the National Response Center. \n- Evacuation of non essential plant personnel from the immediate plant area and sheltering at another location that is at a higher elevation and upwind from the chlorine building.\n- Coordination with emergency responders by qualified plant personnel.\n\n6. SAFETY IMPROVEMENTS\n\nIn CWA's ongoing effort to improve safety and reduce the risk of accidental releases at the Octoraro WTP, the following changes to the RM Program and the facility have been implemented since the last RMP submittal of June 21, 2004 or are currently planned.  These improvements were identified as risk reduction measures during scheduled hazard reviews or EPA and DEP inspections of the WTP chlorination system, or were the result of CWA's desire to develop an improved RM Program and an inherently safer process. Implementation dates are shown in parenthesis.\n\n- Replaced the liquid chlorine manifold piping and valves. (Dec. 2004)\n- Installed a dry chlorine scrubber system to mitigate an accidental chlorine release in the chlorine storage building. Scrubber system was designed to mitigate a worst case scenario as lised in section two of this report. (May 2005)\n- Installed six additional chlorine leak sensors that work in conjuction with the dry scrubber system. (May 2005)\n- Repiped pressure relief vents to the inlets of the scrubber system. (May 2005)\n- Installed motorized louvers to the air intakes to the chlorine room. (May 2005)\n- Added interlocked controls to the exhaust fan and scrubber system to shut down the exhaust fan when scrubber system is in operation. (May 2005)\n- Intergrated scrubber status into SCADA system for remote viewing in the plant control room. (May 2005)\n- Replaced standard windows in the chlorine building with glass block providing inhanced security and containment. (June 2005)\n- Installed a new door to the chlorine storage room"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000004251,
      "SummaryText": "with \"panic hardware\" improving personnel safety. (May 2006)\n- Made improvments to the storm water drainge system around the chlorine building improving personnel safety during inclement weather. (May 2006)\n- Constructed new chlorine unloading platform improving safety during delivery of ton storage containers. (Jan. 2007)\n- Updated process diagrams to include piping modifications. (Aug. 2007)\n- Replaced / upgraded the emergency auto dialer system. (Jan. 2008)\n- Updated the P&ID drawings for the chlorine system and posted them in the chlorine room, O&M manuals and SOP's. (March 2008)\n- Relocated the post-treatment chlorination feed points and replaced chemical feed lines. (March 2008)\n- Develop NFPA Hot Work procedures and incorporate them into the existing O&M manuals and SOP's. (June 2009)\n- Replace or overlay exposed wood roof material, located in the chlorine storage room with approved fire grade materials. (June 2009)"
    }
  ]
}