{
  "FacilityID": 1000045197,
  "FacilityName": "GateFront, LLC - Corpus Christi, Texas Facility",
  "FacilityStr1": "7002 Marvin Berry Road",
  "FacilityStr2": null,
  "FacilityCity": "Corpus Christi",
  "FacilityState": "TX",
  "FacilityZipCode": "78409",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48355",
  "LEPC": "Nueces County LEPC",
  "FacilityLatDecDegs": "27.830561",
  "FacilityLongDecDegs": "-097.500169",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 830669920,
  "ParentCompanyName": "Helena Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 7036759,
  "Company2DUNS": 0,
  "OperatorName": "GateFront, LLC",
  "OperatorStr1": "P.O. Box 10739",
  "OperatorStr2": null,
  "OperatorCity": "Corpus Christi",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78460",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff Holley",
  "RMPTitle": "Terminal Manager",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000208839",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-11-19 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-02-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-10-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-10-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055981,
      "AltID": "Railcar Storage (NH3)",
      "FacilityID": 1000045197,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000059978,
          "ProcessID": 1000055981,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068285,
          "ProcessID": 1000055981,
          "ChemicalID": 56,
          "Quantity": 1320832.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568285,
          "ProcessID": 1000055981,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000055982,
      "AltID": "Fertilizer Blending",
      "FacilityID": 1000045197,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000059979,
          "ProcessID": 1000055982,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068286,
          "ProcessID": 1000055982,
          "ChemicalID": 56,
          "Quantity": 165104.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568286,
          "ProcessID": 1000055982,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045197,
      "SummaryText": "This Process Safety Management (PSM) and Risk Management Plan (RMP) Program document (PSM/RMPr) was prepared on behalf of GateFront, LLC pursuant to the requirements of the Clean Air Act ? 112(r) as codified by the Occupational Safety and Health Administration (OSHA) at 29 CFR ? 1910.119 and by the U.S. Environmental Protection Agency (EPA) at 40 CFR ?68.  The OSHA PSM and EPA Subpart D RMP standards are applicable to operations at the Corpus Christi Facility, Corpus Christi, TX.  At this Facility, GateFront engages in the formulation, distribution and sale of chemicals (i.e. retail) to customers, most of who use GateFront's products to support agricultural operations.\n\n\n\nThis electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Corpus Christi Facility located at 7002 Marvin Berry Road, Corpus Christi, TX 78409.  The electronic RMP summarizes the policies and procedures implemented by the Corpus Christi Facility to minimize the likelihood of an accident.  The electronic RMP also summarizes the actions that the Facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner.\n\n\n\nPURPOSE FOR UPDATING RMP\n\n\n\nGateFront is submitting this RMP update as a Correction to reflect an increase in the no. of railcars anticipated to be received at the Facility.  On February 2, 2018, GateFront updated the RMP in anticipation of receiving up to 6 total railcars at the Faiclity.  On February 14, 2018, GateFront updated the RMP in the anticipation of receiving up to 9 total railcars.  Although the railcars have been increased, the current OCA is still valid as it considers the release of the total contents of a single railcar (i.e. largest vessel) for the worst case scenario.  The process has not changed and therefore the alternative release scenario is still valid as well.  All relevant sections for a Program 3 PSM/RMPr Fa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045197,
      "SummaryText": "cility have been addressed.\n\n\n\nFACILITY\n\n\n\nThe Operations at the Corpus Christi Facility consists of agricultural chemical storage and handling, blending, retail sale and distribution.  As related to the PSM/RMPr, the Corpus Christi Facility stores and handles one covered chemical (i.e. anhydrous ammonia) at quantities that exceed the threshold quantity established by EPA.  Two covered processes are operated at this Facility and they include:\n\n\n\no    Covered Process 1: Railcar Storage (NH3)\n\no    Covered Process 2: Fertilizer Blending\n\n\n\nAt this Facility, anhydrous ammonia is blended with water and phosphoric acid to make ammonium polyphosphate.  Ammonium polyphosphate is a liquid fertilizer that is used by farmers on a seasonal basis.  Covered process equipment used in this process includes a railcar for the storage of the anhydrous ammonia and a Mobile Pipe Reactor (MPR).  The railcar is owned by the chemical manufacturer or railroad, and the MPR is owned and operated by an Independent Fertilizer Reacting Contractor (IFRC).\n\n\n\nThe Corpus Christi Facility orders anhydrous ammonia from a chemical vendor and the chemical vendor ships the anhydrous ammonia to the Facility in railcar(s).  The Facility receives and temporarily stores the railcar(s) on its rail spur in accordance with its railcar operating procedures.  When the IFRC arrives to the Facility, the Facility transfers the responsibility of the anhydrous ammonia railcar(s) to the IFRC.  At this point, the IFRC connects the railcar to the MPR by transfer hoses and prepares to operate the MPR to blend the ammonium polyphosphate.  When the IFRC is complete with its operations, the IFRC transfers the responsibility for the railcar back to the Facility.  The Facility then coordinates with the railroad to transfer the anhydrous ammonia railcar back to the chemical vendor.  The Facility releases the railcar in accordance with its railcar operating procedures.\n\n\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\n\n\nWorst case and alternative c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045197,
      "SummaryText": "ase offsite consequence analyses were completed for both the ammonia storage process and the blending process.  The worst case release scenario is the same for the both the ammonia storage and the blending process because the largest vessel (i.e. a 34,000-gallon railcar) is common to both of the covered processes when connected.  The worst case scenario release for the Corpus Christi Facility was modeled as if the 34,000-gallon railcar was punctured on the side at the ground level and the resulting release being a ground level horizontal jet at the maximum temperature.\n\n\n\nThe alternative (or more likely to occur) scenarios are different for the two processes.  For the railcar storage covered process, the alternative consequence analysis assumes that an operator fails to fully close the vapor valve on the railcar.  For the fertilizer blending process, the alternative consequence analysis assumes that a 3-inch liquid transfer hose is severed during the blending process.  Although these events are classified as an alternative scenario, even an accident of these types is unlikely to occur due to the safety equipment (excess flow devices and emergency shutoff valves) and operating procedures that the Facility and the IFRC uses to safeguard ammonia transfer operations.\n\n\n\nACCIDENT PREVENTION PROGRAM\n\n\n\nThe Terminal Manager implements the risk management planning process at this Facility.  The Terminal Manager is assisted by other GateFront staff, as directed.  The Terminal Manager is responsible for ensuring that Facility Operators are properly trained in the implementation of the Program 3 Accident Prevention Program elements: Management System, Employee Participation, Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Contractor, Pre-Startup Review, Mechanical Integrity, Hot Work Permit, Management of Change, Incident Investigation, Emergency Response, and Compliance Audits.  \n\n\n\nThe Terminal Manager is responsible for managing the IFRC"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045197,
      "SummaryText": " in accordance with the Contractor PSM/RMP requirements.  However, the IFRC is responsible for ensuring that its Operators are properly trained in the implementation of its OSHA PSM accident prevention program.\n\n\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nGateFront's Corpus Christi Facility is a non-responding facility. The Facility has coordinated emergency response activities with its local emergency response agency and local fire department.  \n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Corpus Christi Facility.\n\n\n\nCONCLUSION\n\n\n\nThe Risk Management Plan implemented by GateFront, LLC at the Corpus Christi Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Corpus Christi Facility adds, deletes, or changes processes. The Emergency Response Program has been coordinated with the Nueces County LEPC.\n\n\n\nNOTE: Sections 4, 5, 6, and 8 of the standard RMP produced by EPA's RMP Submit Program are not applicable to the Corpus Christi Facility.\n\n"
    }
  ]
}