{
  "FacilityID": 1000070137,
  "FacilityName": "Elite Octane, LLC",
  "FacilityStr1": "60502 Glacier Rd",
  "FacilityStr2": null,
  "FacilityCity": "Atlantic",
  "FacilityState": "IA",
  "FacilityZipCode": "50022",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19029",
  "LEPC": "Cass County LEPC",
  "FacilityLatDecDegs": "41.422653",
  "FacilityLongDecDegs": "-95.030026",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "P2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.eliteoctane.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Elite Octane, LLC",
  "OperatorStr1": "60502 Glacier Road",
  "OperatorStr2": null,
  "OperatorCity": "Atlantic",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50022",
  "OperatorZipCodeExt": null,
  "RMPContact": "Amanda Breheny",
  "RMPTitle": "Environmental Manager",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000238968",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "New facility - TBD",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000088113,
      "AltID": "Ethanol Fuel Production",
      "FacilityID": 1000070137,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000089335,
          "ProcessID": 1000088113,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000110321,
          "ProcessID": 1000088113,
          "ChemicalID": 155,
          "Quantity": 379717.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000096685,
              "ProcessChemicalID": 1000110321,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000096686,
              "ProcessChemicalID": 1000110321,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000096687,
              "ProcessChemicalID": 1000110321,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000610321,
          "ProcessID": 1000088113,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000070137,
      "SummaryText": "RISK MANAGEMENT PLAN EXECUTIVE SUMMARY\n\nElite Octane, LLC\n\n\n\nACCIDENT RELEASE PREVENTION AND RESPONSE POLICIES\n\n\n\nElite Octane is a fully operational ethanol production facility which began operations in June 2018.  Elite is designed to produce approximately 120,000,000 gallons of fuel-grade ethanol per year. Dried distillers grains (DDGS), as well as corn oil, are byproducts of ethanol production and are sold to local markets as animal feed. Ethanol production activities fall under the SIC code 2869, Industrial Chemicals, Not Elsewhere Classified.\n\n\n\nElite Octane is committed to worker and public safety.  This commitment is demonstrated by Elite's investment in accident prevention, through the establishment of a facility that is well designed, installed, operated and maintained. In addition, training is considered a crucial part of safe operation and accident presentation. Staff is trained about spill prevention and control methods as well as emergency response plans in place at the facility.\n\n\n\nIt is Elite Octane policy to implement reasonable controls to prevent foreseeable releases of regulated substances and if a release does occur, plant personnel will respond to contain the release as necessary. Elite Octane management is dedicated to safety, spill prevention and proper emergency response.\n\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Elite Octane ethanol plant is located at 60502 Glacier Road near Atlantic, Iowa.  This location is approximately 1 mile northwest of Atlantic.  The site is generally located in Section 31, Township 77 North, and Range 36 West of Cass County, Iowa.  The Elite Octane property is a long, triangular stretch of land that encompasses approximately 102 acres.  The site is bounded by Glacier Road to the south, Buck creek road to the east, and by fields to the north and west.  A facility road provides access to Glacier Road.  The Iowa Interstate Railroad borders the site to the southeast. \n\n \n\nThe facility operat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000070137,
      "SummaryText": "es 24 hours per day, 7 days per week for the purpose of manufacturing fuel grade ethanol from corn. The substance which Elite Octane has onsite that is regulated by the RMP program is Denaturant (natural gasoline) which is considered a flammable mixture.  The denaturant (natural gasoline) is used to denature the ethanol so that it is unfit for human consumption before being shipped offsite. Denaturant is generally stored onsite in the denaturant and final product storage tanks.  \n\n\n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\n\n\nThe worst case scenario (WCS) for the flammable substance at Elite Octane is a vapor cloud fire resulting from the release of 813,678 pounds (130,000 gallons) of the flammable mixture from the Denaturant Tank, creating a vapor cloud fire with a 0.6 mile radius. In this scenario, the tank is filled to capacity and the administrative controls to limit the maximum fill to 90%, or 180,000 gallons, have failed. \n\n\n\nThe alternative release scenario (ARS) for the flammable substances at Elite Octane is a vapor cloud fire resulting from the release of 732,310 pounds (117,000 gallons) of the flammable mixture from the Denaturant Tank, creating a vapor cloud fire with a 0.6 mile radius. This scenario takes into account the administrative controls limiting the maximum amount of denaturant in the tank to 180,000 gallons. \n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nElite Octane is a new facility and therefore has had no reportable accidents.\n\n\n\nEMERGENCY REPSONSE PROGRAM INFORMATION\n\n\n\nElite Octane is included in the Atlantic, Iowa Community Emergency Response Plan and therefore does not have its own Emergency Response Plan for emergencies requiring a high level of emergency support. In the case that an incident occurred which required high level emergency response, Elite Octane would call 911 for the necessary fire, medical or other emergency support. \n\n\n\nAs explained above, Elite Octane is committed to worker and public safety and has invested in training and equipment"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000070137,
      "SummaryText": " to prevent chemical spills and other emergency situations. In the event of a chemical spill, plant personnel will respond to contain the release, as necessary. Some physical aspects of the plant would also help the personnel contain a potential spill. For example, all tanks that contain denaturant are located in a large, bermed containment area that is separated from the plant.  A release from one of these tanks would be prevented from migrating off-site, and a fire could be extinguished before it spreads to other units at the facility. \n\n \n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\n\n\n\nElite Octane is subject to RMP Prevention Program Level 3.  Elite Octane is fulfilling its duties to comply with the EPA requirements of 40 CFR Part 68.115(d) through the completion of this RMP and similar efforts regulated by OSHA's Process Safety Management standard (29 CFR 1910.119).  Elite Octane has complied with Process safety information, safe work practices such as Hot Work, Confined Space Entry and Lockout/Tagout, and operations and maintenance procedures are documented on-site. Periodic functions such as process hazard analyses (PHA), training, management of change, pre-startup safety reviews, and incident investigation are conducted on a regular basis.  \n\n\n\nThe denaturant tank is equipped with tank level sensors and alarms and has a bermed containment structure that surrounds the entire tank farm.  These chemical specific prevention measures minimize the risk for an RMP reportable incident.  Compliance audits of the RMP Prevention Program will be conducted on a regular basis to assure compliance with EPA and OSHA regulations. \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY \n\n\n\nAs previously mentioned, Elite Octane is committed to protecting its employees, the greater community and the environment from the release of hazardous substances used in the ethanol fuel production process. Elite Octane management is committed to promoting a safe work environment and will continue to provid"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000070137,
      "SummaryText": "e its employees with the necessary training, tools, and ongoing support to operate the ethanol production facility in a safe and efficient manner. Periodic audits will help us assure that we are doing everything reasonable to minimize the risk and mitigate the effects of an accidental release.\n\n"
    }
  ]
}