{
  "FacilityID": 1000080344,
  "FacilityName": "Hill Brothers Chemical Co. - Salt Lake City",
  "FacilityStr1": "75 North 640 West Street",
  "FacilityStr2": null,
  "FacilityCity": "North Salt Lake",
  "FacilityState": "UT",
  "FacilityZipCode": "84054",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49011",
  "LEPC": "Davis County LEPC",
  "FacilityLatDecDegs": "40.844167",
  "FacilityLongDecDegs": "-111.926111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.hillbrothers.com",
  "FacilityEmailAddress": "hillchem@hillbrothers.com",
  "FacilityDUNS": 24495595,
  "ParentCompanyName": "Hill Brothers Chemical Co.",
  "Company2Name": null,
  "CompanyDUNS": 56599178,
  "Company2DUNS": 0,
  "OperatorName": "Hill Brothers Chemical Co.",
  "OperatorStr1": "1675 North Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Orange",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92867",
  "OperatorZipCodeExt": "3499",
  "RMPContact": "Rick Hill",
  "RMPTitle": "Process Documentation Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000067009",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-11-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-02-20 00:00:00",
  "DeRegistrationEffectiveDate": "2019-12-20 00:00:00",
  "AnniversaryDate": "2024-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.84432,
  "FRS_Long": -111.92628,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100306,
      "AltID": "Warehouse 2",
      "FacilityID": 1000080344,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101554,
          "ProcessID": 1000100306,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125645,
          "ProcessID": 1000100306,
          "ChemicalID": 56,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625645,
          "ProcessID": 1000100306,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080344,
      "SummaryText": "RISK MANAGEMENT PLAN - SALT LAKE CITY FACILITY\n\n\n\nEXECUTIVE SUMMARY\n\n\n\nHill Brothers Chemical Company has established a risk management plan (RMP) according to Federal EPA's (40 CFR Part 68) and OSHA Process Safety Management (29 CFR 1910.119) regulations to enhance already existing safety and emergency response programs for the storage and distribution of chlorine and anhydrous ammonia cylinders at the Salt Lake City Facility.\n\n\n\nHill Brothers Chemical Company is extremely cautious in the handling of all chemicals and is very diligent about safety of its employees, the communities where its facilities are located, and customers.  Hill Brothers Chemical Company staff is well trained and utilizes well maintained equipment to handle chemicals.  \n\n\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nHill Brothers Chemical Company has an emergency response plan in effect to handle potential emergency situations at this facility.  This plan was designed to meet the following objectives:\n\n\n\n1.) To save lives.\n\n2.) To minimize and avoid injuries.\n\n3.) To protect the environment.\n\n4.) To minimize property damage.\n\n \n\nHill Brothers Chemical Company policy is to conduct all operations in a safe and conscientious manner to prevent accidental releases of any hazardous material.  Hill Brothers Chemical Company trains its employees at this facility to properly handle and store hazardous materials to minimize the possibility of adversely affecting its worker's health, the workplace, the public, and the environment.  Hill Brothers Chemical Company Accidental Release Prevention policy is implemented through the management system contained in its RMP.\n\n\n\nHill Brothers Chemical Company emergency response policy is contained in its current written Hazardous Materials Business Plan.  A designated Emergency Coordinator (EC) and an alternate EC initiate emergency notifications and evacuations.  All employees are trained in their appropriate role in emergency response and p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080344,
      "SummaryText": "roper procedures for awareness level response.  The Salt Lake City Facility has established a highly cooperative relationship with the South Davis Fire Department to ensure a full understanding of normal storage practices and emergency response and evacuation procedures related to regulated substances.  \n\n\n\n\n\nStationary Source and Regulated Substance\n\n\n\nSalt Lake City Facility stores and distributes anhydrous ammonia and chlorine cylinders.  Covered processes include unloading, loading and storing pre-packaged chemicals for resale to commercial accounts.  No manufacturing or repackaging is performed at this facility.  \n\n\n\nPre-packaged anhydrous ammonia and chlorine containers are stored indoors at designated locations.  All cylinders are inspected upon arrival at the facility to ensure that they meet all applicable safety codes.  The cylinders are stored upright, with cylinder caps and storage tags in place.  One-hundred fifty (150) pound cylinders of both chemicals are chained to a wall at opposite ends of the warehouse.  One-ton containers of chlorine are blocked in place in the warehouse.  Anhydrous ammonia skids have flat bases and require no restraints.  All containers meet DOT specifications and the suppliers (other Hill Brothers Chemical Company facilities) maintain them in proper condition.  \n\n\n\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nHill Brothers Chemical Company has PSM and Risk Management programs in place to manage handling of regulated substances.  The programs which comply with Federal RMP and PSM requirements, include strict requirements for written operating procedures, personnel training, contractor safety, equipment maintenance, incident investigation, process hazard analysis, management of change and periodic review or audit of program elements.  Management of change element addresses proper implementation of system updates to ensure that all changes are reviewed properly by knowledgeable persons, all eng"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080344,
      "SummaryText": "ineering documents and operating procedures reflect the change, and personnel are trained on the change.   The programs also require a pre-startup safety review to ensure that any changes are reviewed before revenue operation resumes.\n\n\n\n\n\nFive Year Accident History\n\n\n\nThe five-year accident history (June 2014 to June 2019) for the Hill Brothers Chemical Company Salt Lake City Facility reveals that there were no reportable accidents during this period.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nHill Brothers Chemical Company is taking additional steps to further safety.  Several studies have been conducted recently to examine mitigation measures and additional steps to enhance public safety at the Hill Brothers Chemical Company, Salt Lake City Facility.  The changes primarily include detailed reviews and updates of formal operating, maintenance, and emergency response procedures to address comments and recommended actions identified through various analyses.  All recommended changes from the Process Hazard Analysis and triennial RMP/PSM Audit have been reviewed and implemented.\n\n"
    }
  ]
}