{
  "FacilityID": 1000037160,
  "FacilityName": "Peetz Recovered Energy Facility",
  "FacilityStr1": "37500 County Road 78",
  "FacilityStr2": null,
  "FacilityCity": "Peetz",
  "FacilityState": "CO",
  "FacilityZipCode": "80747",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08075",
  "LEPC": "Logan County LEPC",
  "FacilityLatDecDegs": "40.9919",
  "FacilityLongDecDegs": "-102.8530",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ormat.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "OREG 4, Inc.",
  "Company2Name": "Ormat Nevada, Inc.",
  "CompanyDUNS": 929315661,
  "Company2DUNS": 0,
  "OperatorName": "OREG 4, Inc.",
  "OperatorStr1": "6225 Neil Road",
  "OperatorStr2": null,
  "OperatorCity": "Reno",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89511",
  "OperatorZipCodeExt": "1136",
  "RMPContact": "George Freeman",
  "RMPTitle": "O&M Manager, OREG",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000204557",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-11-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-11-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-11-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000045509,
      "AltID": "1",
      "FacilityID": 1000037160,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000045931,
          "ProcessID": 1000045509,
          "NAICSCode": "221118",
          "_desc": {
            "NAICS_CODE": "221118",
            "NAICS_DESCRIPTION": "Other Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000055039,
          "ProcessID": 1000045509,
          "ChemicalID": 125,
          "Quantity": 57513.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000555039,
          "ProcessID": 1000045509,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000037160,
      "SummaryText": "Risk Management Plan Executive Summary\n\nOrmat Recovered Energy Generator: OREG 4 - Peetz\n\n\n\nDescription of Corporate Prevention and Emergency Response Approach\n\n\n\nThis OREG 4, Inc. (OREG4) Recovered Energy Generation (REG) facility complies with numerous standards for pressure vessel design and testing as well as all Federal process safety management requirements. It is our policy to adhere to all applicable federal, state, and local laws. Copies of emergency response, process hazard analyses and process safety management plans and all technical drawing (P&IDS) for process equipment are maintained onsite for reference. Regular inspection and testing of the pentane and thermal oil systems are performed to ensure equipment integrity is maintained. The facility is equipped with a network of leak detection equipment, automatic shutdown logic controls, insulation, safety relief valves, fire detection monitors. OREG4 provides high levels of training in operating procedures, safety and emergency response. If an emergency were to occur, it is our policy to implement the emergency response procedures to mitigate damages, and to notify the nearest fire department and request their assistance.\n\n\n\nDescription of Stationary Source\n\n\n\nThe OREG 4 process is located adjacent to a gas pipeline compressor station.  The pipeline compressor is driven by a natural gas turbine.  The OREG process is fueled by waste heat from the gas compressor's turbine exhaust. \n\n\n\nWaste heat is converted to electrical energy by utilizing organic Rankine cycle (ORC) technology. The hot gases of the turbine exhaust flow through a Waste Heat Oil Heater (WHOH), where the heat from the gases is transferred to a thermal oil heat transfer fluid.  The heat transfer fluid reaches a maximum temperature of 572?F.  At this particular location, there are two turbines exhausting to two WHOHs.  The heat transfer fluid flows in parallel to the WHOHs, then recombines to feed the single Ormat Energy Converter (OEC).  In "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000037160,
      "SummaryText": "the OEC, the recombined thermal oil stream is circulated to the shell and tube heat exchangers. The motive fluid (pentane) on the shell side is vaporized and these vapors drive an organic fluid turbine. The turbine drives a generator which produces grid-compatible power. The turbine exhaust vapors are then condensed in an air-cooled heat exchanger and enter the cycle again as a liquid. On the thermal oil side of the heat exchangers, after exiting the heat exchangers, the thermal oil is routed through a thermal oil surge tank, thermal oil feed pumps, and back to the WHOH. \n\n\n\nThe power from this project is sold to Highline Electric Association based in Holyoke, CO.  The facility is rated at 6000 KW. The net power output to the electrical grid is rated at 5100 KW. Power output is reduced in warm weather due to limitations of the air cooled heat exchangers.\n\n\n\nUse of Regulated Substance\n\n\n\nPentane, a flammable vapor/liquid is used as the working fluid in the organic Rankine cycle. Liquid pentane is pumped from a condenser to shell and tube heat exchangers. Thermal energy provided by thermal oil is transferred to the pentane. The thermal oil heat input causes the pentane to change physical states from liquid to high pressure superheated vapor that is passed through a turbine to produce electric power. The vapor is condensed and recycled back to a pressurized liquid recuperator vessel to complete the Rankine cycle. A pentane storage tank is available for makeup. The facility design is segregated into multiple sections, each having its own design specifications dictated by the pentane conditions in that section. The sections include: the low pressure process equipment, the high pressure process equipment, pentane unloading system, vapor recovery system, evacuation system and non-condensable removal system. Each section is protected by pressure relief systems that may include pressure safety valves, pressure control valves, control system shutdown and intervention logic an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000037160,
      "SummaryText": "d administrative practices.\n\n\n\nQuantities Handled or Stored\n\n\n\nThe pentane is normally found in both the operating and static portions of the process.  When in operation, the majority of the pentane is found in the working process.  There is some additional pentane present in the connected storage tank.  For the purpose of defining registration quantities, a fully-charged operating system is assumed plus a storage tank that contains up to 3,500 gallons.  The basis for the registration quantities is as follows:\n\n\n\nFacility Name    Binary Process Inventory (lbs)    Storage Tank Inventory (lbs)    Total Inventory and Registration Quantity (lbs)\n\nPeetz    39,138    18,375    57,513\n\n\n\n\n\nWorst Case Scenario Description\n\n\n\nWorst case scenario is based on a vapor cloud explosion. Although safeguards are in place, that makes a worst case scenario extremely unlikely, it was assumed the explosion originates at a full pentane storage tank, which represents the largest single container onsite.  The tank is assumed to be filled to 80% of water capacity. ______________________________________________\n\n\n\nEnd Point Distance: 0.3 miles\n\nConsequence Analysis: Calculated by RMP*Comp\n\n\n\nResults of Consequence Analysis\n\nChemical: Pentane\n\nCAS #: 109-66-0\n\nCategory: Flammable Liquid\n\nScenario: Worst-case\n\nQuantity Released: 39,718 lbs\n\nRelease Type: Vapor Cloud Explosion\n\nEstimated Distance to 1 psi Overpressure: 0.3 miles (0.5 kilometers)\n\n\n\n --------Assumptions About This Scenario-------- \n\nWind speed: 1.5 meters/second (3.4 miles/hour)\n\nStability Class: F\n\nAir Temperature: 77 degrees F (25 degrees C)\n\n______________________________________________\n\n\n\nThe RMP comp model is a conservative screening tool and may overestimate distances to endpoint. By RMP rules, the model does not accommodate mitigative measures that may prevent propagation of any accident.\n\n\n\nOREG4 Peetz REG facility is located in a relatively isolated area surrounded by farmland. The facility is approximately 13.8 miles east-northeast of"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000037160,
      "SummaryText": " Peetz, CO.  Examination of topographic maps and visual observation of the potentially affected area in a worst case scenario did not identify any residential structures or parks.  However, this facility is adjacent to the compressor station that provides the heat source and this station is within the affected area.  The compressor station staff is not employed by Ormat, nor does Ormat control their access to the compressor station.  Given this proximity to public receptors, this facility cannot qualify for an RMP program level 1. In the initial RMP submittal, compressor station employees were not considered public receptors; hence, a program level 1 was designated.  Although program level 1 was initially designated, the OREG always had a program level 3 prevention program in place.\n\n\n\nAlternate Case Scenario Description\n\n\n\nThe alternate case scenario is based on a pool fire.  The pool is formed upon a hose rupture that occurs during tanker truck offloading to the pentane storage tank.  It is very conservatively assumed that it takes approximately 10 minutes to stop the flow.\n\nEnd Point Distance: 0.1 miles\n\nConsequence Analysis: Calculated by RMP*Comp\n\n______________________________________________\n\n\n\nResults of Consequence Analysis\n\nChemical: Pentane\n\nCAS #: 109-66-0\n\nCategory: Flammable Liquid\n\nScenario: Alternate Case\n\nQuantity Released: 1,020 lbs/minute over 10 minutes\n\nRelease Type: Pool Fire\n\nEstimated Distance to heat radiation of 5 kw/sq. meters: 0.1 miles (0.2 kilometers)\n\n\n\n --------Assumptions About This Scenario-------- \n\nWind speed: 3.0 meters/second (6.7 miles/hour)\n\nStability Class: D\n\nAir Temperature: 77 degrees F (25 degrees C)\n\n______________________________________________\n\n\n\nPrevention Program Description\n\n\n\nProcess Safety Information:  Design information, including Process Flow Diagrams, Piping & Instrument Diagrams, Plant Control Logic, Safe Limits, and Safety System Description, is available on site.\n\n\n\nProcess Hazard Analysis: OREG4 utilizes "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000037160,
      "SummaryText": "personnel experienced in organic Rankine power cycles to perform a hazard analysis appropriate to the complexity of the process for identifying, evaluating, and controlling hazards involved in the process. A HAZOP analysis was selected and utilized.\n\n\n\nThe original process hazard analysis was revalidated in February, 2013.\n\n\n\nStandard Operating Procedures:  Operating procedures are developed to address plant startup, shutdown, normal operation and monitoring, and emergency shutdown.\n\n\n\nTraining: Some equipment in the OREG4 facilities poses potential fire, explosion, and electrical hazards that could cause serious personal injuries and costly property damage if procedures are not followed correctly. Personnel are trained in standard operating procedures and emergency response procedures.  Additionally, safety training, conducted monthly and required of all employees, identifies the different hazards to be found on the sites. These subjects include electrical safety, fire prevention and protection, lock out and tag out procedures, hazard communication, gas detectors, fire panels, personal protective equipment, and the safe use of tools and equipment. Safety training is supplemented by the use of the Industrial Hygiene and Standard safety procedures manuals.\n\n\n\nMaintenance: OREG4 management tracks maintenance on electronic spreadsheets. Maintenance documentation includes information on all equipment in the facility requiring maintenance, inspection, testing, certification, calibration, etc. NFPA, OSHA, manufacturer's recommendations and operations experience have been utilized to produce a comprehensive maintenance tasks that are scheduled and assigned to plant personnel. Employees report any equipment deficiencies to the Operation and Maintenance Manager who generates work orders for the repair or assessment of the problem. Routine comprehensive inspections are performed using checklists.\n\n\n\nAccident History: OREG4 Peetz REG facility has not had any reportable acciden"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000037160,
      "SummaryText": "ts.\n\n\n\nSafety Systems: The principal methods of accident prevention include equipment design safeguards, written procedures and operator training. Safety systems are present in the plant that provide alarms and control interlocks to place the process in a safe state.\n\n\n\nHigh pressure safety systems are one such example.  An initial alarm alerts the control room operator both audibly and visually of the pressure rise.  This initial alarm affords the operator the opportunity to take some corrective action.  If the pressure rise continues unabated, automatic shutdown of select process equipment is initiated to mitigate the problem.  If the initial alarm and subsequent shutdown fail to mitigate the pressure rise, pressure safety valves are in place to relieve to pressure to the atmosphere or to larger, low pressure systems. \n\n\n\nA combustible gas detection system is present in each of the plants. Sensors are strategically located in each plant. Control Room audio and visual alarms annunciate concentrations in excess of 40% of LEL.  \n\n\n\nEmergency Response Plan: OREG4 personnel are trained to recognize emergencies, mitigate the emergency to the extent possible, and notify local emergency responders and Trailblazer Pipeline personnel.  Plant personnel do not fight pentane fires.  \n\n\n\nUpon detection of a pentane fire, personnel are instructed to initiate automatic shutdown of the process which removes heat, closes isolation valves and depressurizes equipment.  OREG 4 and Trailblazer Pipeline personnel are then alerted of the need to evacuate the site.  Responding fire department personnel assume incident command upon arrival.\n\n\n\n\n\nCallout procedure: If any of the following alarm conditions are indicated by the OREG4 monitoring system, the call-out procedure must be followed: OEC failure, security/fire alarm trip. If any of these events should occur the monitoring staff will immediately contact the Operation and Maintenance (O&M) Manager. If the O&M Manager is not reached in "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000037160,
      "SummaryText": "a timely manner the parent company, Ormat Nevada Inc. will be notified on the 24 hour phone number (775) 852-1912. If a fire is detected, the monitoring staff shall notify local emergency personnel including fire and police departments.\n\n\n\nNotification of Trailblazer Pipeline Personnel: Any Trailblazer Pipeline personnel which may be at the site during the alarm condition must also be notified through Trailblazer Pipeline procedures.  Trailblazer Pipeline personnel do not respond to alarm conditions at OREG 4.\n\n"
    }
  ]
}