{
  "FacilityID": 1000019136,
  "FacilityName": "Bayonne Plant Holding L.L.C.",
  "FacilityStr1": "10 Hook Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Bayonne",
  "FacilityState": "NJ",
  "FacilityZipCode": "07002",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34017",
  "LEPC": "Bayonne City OEM",
  "FacilityLatDecDegs": "40.650833",
  "FacilityLongDecDegs": "-074.111667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "dllewelyn@morrisenergy.com",
  "FacilityDUNS": 943307728,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bayonne Plant Holding L.L.C.",
  "OperatorStr1": "10 Hook Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Bayonne",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07002",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard Vaccaro",
  "RMPTitle": "Environmental Compliance Specialist",
  "FTE": 14,
  "OtherEPAFacilityID": "NJD986567675",
  "EPAFacilityID": "100000064397",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "12174",
  "SafetyInspectionDate": "2006-09-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-09-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-12-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-12-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-12-01 00:00:00",
  "DeRegistrationEffectiveDate": "2018-07-31 00:00:00",
  "AnniversaryDate": "2015-12-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.65184,
  "FRS_Long": -74.09704,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000023344,
      "AltID": "Anhydrous Ammonia System",
      "FacilityID": 1000019136,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000023646,
          "ProcessID": 1000023344,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000027681,
          "ProcessID": 1000023344,
          "ChemicalID": 56,
          "Quantity": 64000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000527681,
          "ProcessID": 1000023344,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000019136,
      "SummaryText": "Bayonne Plant Holding L.L.C.\nProgram 3 Executive Summary\n\nSystem Description\n\nBayonne Plant Holding, L.L.C. owns a 165 megawatt (MW) cogeneration (cogen) plant in Bayonne, Hudson County, New Jersey. On October 1, 2010 Morris Energy Operations Company (MEOpCo) took over operation of the facility from GE, which had been operating the facility since 1988. A number of the former GE EHS-trained operators were retained by MEOpCo. The facility is located wholly within the boundaries of the IMTT bulk storage terminal.  The land use immediately surrounding the facility is industrial.  Residential and commercial land use occurs approximately (DELETED per NJDEP-BRP request) feet from the site.\n\nThe facility combusts natural gas in three GE Frame 6 combustion turbines  (the stationary  source) to generate electricity.  Each combustion turbine is equipped with a heat recovery steam generator (HRSG) that utilizes waste heat from the exhaust to convert water to steam.  The steam from each HRSG is combined to drive a steam turbine.  Electricity is generated at each gas turbine and at the steam turbine.  Steam is also generated from 4 auxiliary boilers and piped to IMTT's petroleum storage facility for use in providing heat to IMTT's storage tanks.  A selective catalytic reduction (SCR) system is located within each HRSG to reduce nitrogen oxide (NOx) emissions from the combustion turbine exhaust gases.  Each SCR consists of a catalyst and injection grid within the HRSG.  Ammonia gas is injected through the grid upstream of the catalyst.  The ammonia mixes with the exhaust gas and as the exhaust/ammonia mixture passes through the catalyst, NOx emissions are converted to nitrogen and water.\n\nThe ammonia (the hazardous material of concern)injected into the HRSG is stored in a 30,000 gallon storage tank which is kept pressurized by ambient radiant heat and/or electric vaporizers.  A maximum of 64,000 pounds of ammonia is stored on site at any time.  The ammonia gas generated in the sto"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000019136,
      "SummaryText": "rage tank flows to ammonia skids located adjacent to each HRSG.  The ammonia gas is mixed with air through a blower system and then the ammonia/air mixture flows to the injection grids.  The injection grids are simple pipe and nozzle systems with outlets provided within the HRSGs.\n\nExisting Risk Management Activities\n\nThe ammonia system has been regulated under New Jersey's Toxic Catastrophe Prevention Act (TCPA - NJAC 7:31), New Jersey's Pollution Discharge Elimination System (NNJPDES)regulations (NJAC 7:1E), and OSHA's Process Safety Management (PSM) regulations (29 CFR 1910.119).  These regulations required the development of risk management programs and procedures similar to the EPA's risk management requirements.  The elements of these programs include safety information compilation, development of standard operating procedures, training, preventative maintenance procedures, emergency response plans, incident investigation, development of health and safety procedures, compliance and safety reviews and reporting, employee participation, management of change, contractor safety, hazard reviews and hazard assessments.\n\nThe Bayonne facility has also implemented environmental programs and procedures to ensure compliance with all environmental regulations.  These programs and procedures, maintained in manuals at the plant, are kept up to date and available to all plant personnel. \n\nIn summary, the owner, Bayonne Plant Holding, LLC,  has residents and the environment are protected.\n\nRisk Management Program Summary\n\nBayonne Plant Holding, LLC has maintained a risk management program at the facility and there has never been an incident in more than 22 years of operation. The owner's \"asset manager\" has overall responsibility for maintaining this program.  Responsibilities for specific program elements are shared among the owner and MEOpCo.  \n\nSafety reviews are required for new construction or modifications to the existing ammonia system.  These reviews are conducted pri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000019136,
      "SummaryText": "or to construction or operation of new or modified systems.  Safety information is also maintained at the facility.  Since there have been only minimal recent changes to the ammonia system, no safety reviews have been required and modifications to the safety information have been minimal.\n\nOperating procedures have been implemented at the facility and address the possible operating conditions of the ammonia system.  A preventative maintenance program is in place and consistes of procedures, testing and inspection schedules as well as a work order system that initiates and tracks work and inspections performed on the ammonia system.  Hot works procedures, along with other health and safety procedures, e.g., lockout/tagout, etc., exist at the plant and are applicable to all plant work.  Contractors working on the ammonia system or any plant equipment/system are required to comply with the facility's contractor safety program.\n\nAll facility personnel must complete initial and refresher training on procedures applicable to their position.  All operators and maintenance personnel undergo a qualification process which addresses ammonia system operating procedures and/or maintenance procedures along with emergency response training.  \n\nCompliance audits are continually conducted on an annual basis.  These audits consist of a risk management program (RMP) audit plus a safety review of the ammonia system.  The program audit consists of reviewing the risk management program, procedures and documentation to ensure the program is being implemented.  The ammonia system safety review consists of an audit of the ammonia system, equipment and operating procedures to ensure that the ammonia system is designed and operated in accordance with the appropriate safety protocols.\n\nIncident investigation procedures are in place at the facility to investigate any events related to the ammonia system plus any other events.  All matters that are investigated are properly documented.  Recommen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000019136,
      "SummaryText": "dations are promptly addressed.\n\nManagement of change procedures are maintained at the facility and are implemented when there are any changes to the ammonia system.  Change procedures do not apply to replacement in kind, but do apply to temporary procedures, e.g., emptying the NH3 storage tank for an internal inspection.\n\nEmployee participation has always been implemented at the facility.  Employees are included in hazard reviews and incident investigations.  In addition, employees hold weekly safety meetings, conduct annual drills and participate in safety committees.\n\nHazard reviews have been conducted at this facility.  The last hazard review was conducted in April 2008.  Hazard reviews identify the hazards associated with the process, opportunities for equipment malfunctions or human errors that could cause an accidental release, safeguards used or needed to control the hazards or prevent equipment malfunctions or human error, and steps used or needed to detect or monitor releases.  Once the hazard review is completed , a list of recommendations is developed and reviewed by plant personnel and management.  The recommendations are then implemented at the site to further reduce the risk associated with the ammonia system. In addition, an \"inherently safer technology\" (IST)review was performed to determine if an alternative system could feasibly mitigate the improbable ammonia release potential further. \n\nAt this time, no changes to the risk/safety programs are anticipated since current programs have been performing well for more than 22 years.  \n\nProcess Hazard Assesment\n\nAn updated \"process hazard assissment\" (PHA) was completed in 2008 to comply with the RMP regulations.  The hazard assessment consists of analyzing the effects of a worst case release scenario and an alternate release scenario.  The worst case release considers the entire contents of the ammonia tank being released within 10 minutes.  The EPA-approved \"SLAB\" dispersion model was utilized to mode"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000019136,
      "SummaryText": "l the offsite impacts of such a release.  The results of the model estimate that the worst case release scenario may hypothetically have a maximum endpoint distance of (DELETED pert NJDEP-BRP request) and have a potential impact on residences , hospitals, parks and industrial/commercial facilities.  No environmental receptors are believed to be impacted.  The only mitigation allowed by the regulation and applicable to the site is the secondary containment provided for the storage tank.  Bayonne Plant Holding submits that this is not a credible scenario since previous hazard assessments have determined that the frequency of a catastrophic vessel failure is less than 1.5EE-05 per year.  In addition, the ammonia tank is surrounded by a water curtain that can be utilized to \"deluge\" ammonia vapors originating from the tank, essentially rendering them harmless.  Furthermore the ammonia storage tank does not operate at the elevated temperatures nor pressures required to facilitate this release scenerio.\n\nThe ammonia storage tank undergoes \"in service\" and \"out of service\" inspections in accordance with API standards, monthly safety inspections, and daily inspections.  In addition, the ammonia tank is protected by concrete barriers to prevent exposure to traffic in the plant.  All ammonia truck deliveries are escorted by plant personnel and the plant is enclosed within a security fence with monitored access.  The plant also coordinates annual emergency drills with the local fire department and provides information and equipment access to the fire department to support site emergency activities.\n\nThe alternate release scenario that was analyzed assumed a 1.17 inch diameter hole in an ammonia line with a release of ammonia for one hour.  This scenerio may also represent a leak from a delivery hose or crack in a valve.  The EPA RMP Comp model was used to determine offsite impacts for this alternative release scenario.  The results of the modeling estimate that the endpoint di"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000019136,
      "SummaryText": "stance will be (DELETED per NJDEP-BRP request) and have no impact on residences, hospitals, nor parks.  Only the adjacent industry could be impacted by this release scenario.  This scenario takes into account that it will take 60 minutes to respond and stop the release.  This release scenario is very conservative since the mitigation effects of the water curtain deluge system were not considered in this analysis.  The one hour release duration is a reasonable maximum time period as determined by the fire department's response time confirmed by drills that have been conducted with the Bayonne Fire Department.\n\nThere have been no accidents nor releases from the ammonia system within the last five years.\n\nEmergency Response\n\nAn emergency response program has been implemented at the facility since the plant's construction.  The emergency response program includes an emergency response plan and coordination of emergency information and activities with both the IMTT site's emergency response team plus the Bayonne Fire Department.  The emergency response plan contains the information and procedures necessary to respond to a release of any hazardous material at the site.  Emergency information includes a list of emergency response personnel, notification requirements, evacuation procedures, and health/first aid data.  The facility has confirmed with the Bayonne Fire Department that personnel and equipment necessary to respond to a release of a hazardous substance at the site will be provided.  Coordination with the fire department has included providing a copy of the emergency response plan, drawings, and other plant operating data.  The emergency information has been placed in a computer program that is used as a reference at an emergency site by the department's hazmat unit.  The fire department has participtated in annual plant emergency response drills and drill critiques for the last six years.  In addition to emergency drills, the fire department tours the facility to"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000019136,
      "SummaryText": " familiarize their personnel with plant operations and the locations of potential hazards.\n"
    }
  ]
}