{
  "FacilityID": 1000044040,
  "FacilityName": "Stewart Creek West Wastewater Treatment Plant",
  "FacilityStr1": "5100 4th Army Memorial Drive",
  "FacilityStr2": null,
  "FacilityCity": "Frisco",
  "FacilityState": "TX",
  "FacilityZipCode": "75034",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48121",
  "LEPC": "Denton County LEPC",
  "FacilityLatDecDegs": "33.121067",
  "FacilityLongDecDegs": "-96.858083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "North Texas Municipal Water Dist.",
  "OperatorStr1": "P.O. Box 2408",
  "OperatorStr2": null,
  "OperatorCity": "Wylie",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75098",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": "TX0103501",
  "EPAFacilityID": "100000147432",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-04-24 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-05-05 00:00:00",
  "DeRegistrationEffectiveDate": "2021-04-28 00:00:00",
  "AnniversaryDate": "2019-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.1418,
  "FRS_Long": -96.8413,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054406,
      "AltID": "Chlorination",
      "FacilityID": 1000044040,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000066205,
          "ProcessID": 1000054406,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000055202,
          "ProcessID": 1000054406,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000035338,
              "Process_NAICS_ID": 1000055202,
              "SafetyReviewDate": "2014-06-09 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "2014-06-09 00:00:00",
              "ChangeCompletionDate": "2014-09-12 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-06-09 00:00:00",
              "TrainingReviewDate": "2014-06-09 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-06-09 00:00:00",
              "EquipmentInspectionDate": "2014-06-09 00:00:00",
              "EquipmentTested": "All process equipment is inspected daily as part of normal operations.",
              "ComplianceAuditDate": "2014-06-09 00:00:00",
              "AuditCompletionDate": "2014-09-12 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Prevention Program - Chlorination",
              "_chemicals": [
                {
                  "PrimaryKey": 1000035829,
                  "PreventionProgram2ID": 1000035338,
                  "ProcessChemicalID": 1000066205
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000044040,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Frisco  Fire Department",
    "CoordinatingAgencyPhone": "9110000000",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044040,
      "SummaryText": "North Texas Municipal Water District\n\nStewart Creek West Wastewater Treatment Plant\n\nRISK MANAGEMENT PROGRAM\n\nEXECUTIVE SUMMARY\n\n\n\n\n\n1.0    Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant is committed to the safety of our workers, the public, and the environment.  The resources invested in the prevention of accidental releases of hazardous substances demonstrate this commitment.  The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant implements reasonable controls, such as training of personnel and the safe design, installation, operation and maintenance of our processes.  Our policy is to make every effort to prevent the release of hazardous substances but in the event of a release, our trained personnel and local emergency response agencies will respond to control and contain the release in a manner that will be safe for workers and will help prevent injuries to the public or the environment.\n\n\n\n\n\n2.0    Description of The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant and Regulated Substances\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant handles one substance regulated by the Risk Management Plan Rule (RMP Rule) in quantities above the Threshold Quantity.  This substance is:\n\n\n\n* Chlorine - stored in 1 ton cylinders and used for disinfection of the treated water prior to release to the receiving stream.\n\n\n\n\n\n\n\n3.0    Hazard Assessment\n\n \n\nThe RMP Rule requires The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant to perform a Hazard Assessment of the regulated substances stored and used in the covered processes at the facility.  This Hazard Assessment includes an offsite consequence analysis for the following scenarios:\n\n \n\n* One worst-case and one alternative release scenario for the toxic substance chlorine for the chlorinati"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044040,
      "SummaryText": "on process unit at the facility.\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant completed a Hazard Assessment for the covered processes and the results have been appropriately communicated to the local emergency response agencies. The Hazard Assessment has been recently updated to reflect changes in population.\n\n\n\n\n\n4.0    Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nThe RMP Rule requires that a prevention program be established for The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant chlorination processes.  The following details the prevention program elements at The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant that apply to these processes.\n\n\n\n4.1    Safety Information\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant maintains a variety of technical documents that are used to help ensure safe operation of The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant processes.  Material safety data sheets (MSDSs) document the physical and chemical properties of hazardous substances handled at The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant, including the chlorine in the covered process.  The engineering design documents include the operating parameters, the design basis and configuration of the equipment in each covered process, and references to applicable codes and standards.\n\n\n\n\n\n4.2    Hazard Review\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant performs and periodically updates hazard reviews of the covered processes to help identify and control process hazards.  Checklists are used to guide the hazard review.  These checklists include items to help ensure The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant operates and maintains the equipm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044040,
      "SummaryText": "ent in a manner consistent with the applicable design specifications, codes, standards, and regulations.\n\n\n\n4.3    Operating Procedures\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant develops and maintains operating procedures to define how tasks related to process operations should be performed.  The operating procedures are used to:\n\n\n\n1. train employees and contractors, and\n\n2. serve as reference guides for appropriate actions to take during both normal and abnormal process conditions.\n\n\n\n4.4    Training\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant trains personnel in the operating procedures to help ensure safe and effective performance of their assigned tasks. A record of all training is maintained to help ensure new and refresher training is provided on a timely basis.\n\n\n\n4.5    Maintenance\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant properly maintains the equipment in our processes.  The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant maintenance program includes:\n\n\n\n1. procedures to safely guide workers in their maintenance tasks,\n\n2. worker training in the maintenance procedures, and\n\n3. inspection and testing program to help identify equipment deterioration and damage before equipment fails.\n\n\n\n4.6    Compliance Audits\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant performs periodic (at least every three years) audits of covered processes to verify the processes are operating in compliance with the requirements of the RMP Rule.  A compliance audit report is prepared after each audit, and any deficiencies noted by the audit are corrected in a timely manner.\n\n\n\n\n\n4.7    Incident Investigations\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant investigates all incidents that could reasonably have resulted in a serious injury t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044040,
      "SummaryText": "o personnel, the public, or the environment.  The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant trains employees to identify and report any and all incidents requiring investigation.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n\n\n4.8    Chemical-specific Prevention Steps - Chlorine\n\n\n\nIndustry standards are followed at The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant to help ensure safe handling of chlorine.  The vendor supplies chlorine via a Department of Transportation (DOT) approved truck and in DOT approved 1 ton cylinders.  The process equipment is designed and constructed with state-of-the-art materials and technology utilizing the standards and guidelines of the Chlorine Institute, American Water Works Association, ASME, ANSI, and other applicable codes.  Workers who perform operations involving chlorine receive training emphasizing safe handling procedures according to the guidelines required by The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant.\n\n\n\n\n\n5.0    Five Year Accident History\n\n\n\nThere has been no accidents or incidents that resulted in injuries to employee, the public, or the environment The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant in the past five years.\n\n\n\n\n\n6.0    Emergency Response Programs\n\n\n\nThe North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant has prepared a written emergency response plan that complies with the RMP Rule, other federal standards and industry guidelines.  This plan has been communicated to the Local Emergency Planning Committee (LEPC) and local fire department.  \n\n\n\n\n\n7.0    Planned Changes to Improve Safety\n\n\n\nThe North Texas Municipal Water District Stewart Creek"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044040,
      "SummaryText": " West Wastewater Treatment Plant continuously attempts to improve the safety of our processes to protect our employees, the public and the environment.  The North Texas Municipal Water District Stewart Creek West Wastewater Treatment Plant incident investigations, employee suggestions and improvements in technology are utilized to update the safety aspects of the processes.  \n\n\n\n"
    }
  ]
}