{
  "FacilityID": 1000115101,
  "FacilityName": "Dandy Cooling Company~Cross Dock Services",
  "FacilityStr1": "1252 Growers Street",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.649747",
  "FacilityLongDecDegs": "-121.631714",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Dandy Cooling Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": 112526152,
  "Company2DUNS": null,
  "OperatorName": "Dandy Cooling Company, LLC",
  "OperatorStr1": "1252 Growers Street",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "FTE": 36,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000122066",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-07-16 00:00:00",
  "SafetyInspectionBy": "Monterey County Environmental Health/CUPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "RMP Update 2009",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 36.648056,
  "FRS_Long": -121.633056,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000143508,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000115101,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000179537,
          "ProcessID": 1000143508,
          "ChemicalID": 56,
          "Quantity": 21849.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000145182,
          "ProcessID": 1000143508,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000122754,
              "Process_NAICS_ID": 1000145182,
              "SafetyReviewDate": "2023-07-14 00:00:00",
              "PHA_Date": "2024-04-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2026-10-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Programmable Logic Controllers; Microprocessors; Penn Switches",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ammonia-water diffusion system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Integrated NH3 detector and alarm system",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-06-04 00:00:00",
              "TrainingReviewDate": "2023-07-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Online",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-07-23 00:00:00",
              "EquipmentInspectionDate": "2024-03-12 00:00:00",
              "EquipmentTested": "Annual Safety Checklist",
              "ChangeMgmtDate": "2024-03-31 00:00:00",
              "ChangeMgmtReviewDate": "2024-03-31 00:00:00",
              "PreStartupReviewDate": "2024-04-05 00:00:00",
              "ComplianceAuditDate": "2022-08-08 00:00:00",
              "AuditCompletionDate": "2023-07-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-07-14 00:00:00",
              "HotWorkPermitReviewDate": "2023-07-14 00:00:00",
              "ContractorSafetyReviewDate": "2023-07-14 00:00:00",
              "ContractorSafetyEvalDate": "2023-07-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000153977,
                  "PreventionProgram3ID": 1000122754,
                  "ProcessChemicalID": 1000179537
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000115101,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-06-01 00:00:00",
    "ERTrainingDate": "2024-05-08 00:00:00",
    "CoordinatingAgencyName": "City of Salinas Fire Department",
    "CoordinatingAgencyPhone": "8317587261",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000115101,
      "SummaryText": "DANDY COOLING COMPANY~CROSS DOCK SERVICES\nCAL/ARP RISK MANAGEMENT PLAN LEVEL 3\n5-YEAR UPDATE 2024\n\n1\tEXECUTIVE SUMMARY\n\t1.1   Accidental Release Prevention and Emergency Response Policies.\n\t1.2   General Description of The Stationary Source and Regulated Substances.\n        1.3   Summary of The General Accidental Release Prevention Program and Chemical- Specific     Prevention Steps\n\t1.4   Summary of the Five-Year Accident History.\n\t1.5   Summary of the Emergency Response Program.\n\t1.6   Planned Changes to Improve Safety.\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\nThe Dandy Cooling Company, LLC ~ Cross Dock Services (DCC~CDS) Accidental Release Prevention and Emergency Response Policies are simply to not have accidental releases or emergencies. The Company endeavors to execute this policy through the daily implementation of its Safety Programs. Company safety programs include but are not limited to EPA's and California's Level 3 Prevention Program and Cal/OSHA's Process Safety Management Program (PSM), which are practically identical but with nuanced differences. Together these are a comprehensive and integrated approach to the safe operation of processes using Regulated Substances and form the Program Level III Prevention Program component of the RMP. The DCC~CDS Prevention Program is specifically designed and intended to prevent accidental releases, and to deal safely with emergencies if and when they do happen. It is the primary goal of DCC~CDS to protect its employees, visitors and neighbors from harm due to Company operations. With this in mind, the priorities of protection of life, the environment, and then property have been established.\n\nThe Company also recognizes the need to be prepared to respond safely to accidental releases that could occur should established prevention programs fail. The Company has adopted a \"Non-responding facility\" policy and has established an Emergency Action Plan within its California Hazardous Material B"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000115101,
      "SummaryText": "usiness Plan. Emergency response pre-planning is coordinated through the local Certified Unified Program Agency (Monterey County Health Department) and the Salinas City Fire Department. The local CUPA inspects the facility on a regular basis.\n\nThe facility is supported by a partner company, Western Precooling Systems (WPS), which has offices and staff about ten miles from the facility. WPS employs ammonia technicians trained beyond 1910.120(q) Awareness level. These technicians would be notified to provide technical support in the event of an emergency.    \n\n1.2 General Description of the Stationary Source and Regulated Substances\n\nThe facility is a refrigeration plant located in Salinas, CA. and was constructed in the early 1980's.  In February of 1999, DCC~CDS became the owner and tenant.  The facility provides pre-cooling refrigeration effect for the removal of field heat from freshly harvested vegetables, and subsequent short-term refrigerated storage, and is operated seasonally.  Product harvest period pick up in the month of April and finish in November.  Operational maintenance is performed year-round.  Scheduled maintenance is performed in the remaining winter months.  Other commercial neighbors are located on the same site.\n\nThe Regulated Substance in use is anhydrous ammonia (NH3). The facility's max intended inventory is 21,849 pounds of ammonia for the Refrigeration System. Refrigeration equipment consists of Refrigeration Trailers (Compression Units), Evaporative Condensers, Pressure Vessels, HydroVac&trade; Vacuum Tubes, Pressure Cooling Equipment, Cold Storage Room Evaporators and associated valves, instrumentation and piping.  The vacuum tubes are used to pre-cool agricultural product; the refrigerated storage portion of the facility is used for pressure cooling and short-term product storage.  Evaporators in the storage section of the facility maintain temperature until product is sold and shipped.  The refrigeration system is configured in a closed"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000115101,
      "SummaryText": "-loop system with isolation and overpressure relief valves installed in key areas. Some of the equipment is portable and is used in different areas during the off-season.  DCC~CDS owns the fixed facility, stationary ammonia-handling equipment and several of the portable units.  DCC~CDS leases or is a partner with WPS in other portable refrigeration equipment. Portable refrigeration equipment is common in the industry.\n\n1.3 General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nAccidental Release Prevention Program\n\nA comprehensive Prevention Program has been established as described in Section 1.1.  The Program is specifically intended to promote the safe operation of ammonia-handling equipment and process, prevent accidental releases and respond safely to any emergencies that could occur.  DCC~CDS strives to make the Prevention Program elements an integral part of daily Plant operation.  \n\nDCC~CDS has delegated maintenance of its ammonia refrigeration equipment to WPS.  WPS is a reputable state-wide provider of ammonia refrigeration equipment and services; and has developed comprehensive written procedures for the maintenance of ammonia-handling equipment, including the steps to be taken in the event of a release or threatened release.  Written procedures include necessary safety precautions, from seasonal installation and start-up to tear-down and removal of portable equipment.  As equipment inspection or maintenance needs are determined, the need is expressed at workload meetings conducted by the WPS Area Manager.  Specific repair tasks or upgrade for the expressed need is collaboratively decided by the DCC~CDS and WPS Area Manager and entered into the Service Call system. Tasks are then tracked through the system.  Through this regular routine of inspect, discuss, assign and confirmation of completion, DCC~CDS and WPS have reduced equipment operational problems and also reduced release potential.\n\nWPS actively encourages its ammoni"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000115101,
      "SummaryText": "a Technicians to seek Certification through the Refrigerating Engineers and Technicians Association (RETA).  Technicians only perform tasks for which they have been pre-qualified.\n\nChemical-Specific Prevention Steps\n\nSince occupying the facility in 1999, DCC~CDS has made continuous improvements to the facility and ammonia refrigeration equipment.  Improvements include, but are not limited to:  \n\n - Special self-closing valves are installed as a permissive for oil drain flow\n - Seismic improvements\n - Ammonia/water diffusion system\n - Ammonia sensors and alarms\n - Equipment upgrades\n - General facility appearance and upkeep\n - A vigorous Food Safety Program has been instituted\n\nOther release prevention steps taken at Dandy Cooling Company~Cross Dock Services:\n\n - DCC~CDS has enclosed the facility with fencing and gates to limit access to the facility to increase the security of the facility from potential \"wrong-do-ers\".\n - Employees are trained for hazard communication (discovery and communicating) for releases, fires, vandals etc.  Training is documented.\n - A strong relationship exists with the Monterey County Health Department (CUPA).  Over the years DCC~CDS has worked closely with the CUPA in the planning and execution of refrigeration system improvements.  A \n - CUPA representative was invited to and participated in the most recent Process Hazard Analysis.\n - DCC~CDS and WPS are long-term sponsors of the Salinas Valley Ammonia Safety Day.  The Safety Day includes specialized classes and promotes ammonia safety.  Numerous regional Fire Departments are on the \n   invitation list; the local CUPA also participates in this event.\n - Staff is trained in the benefits of good housekeeping.  The general appearance of the facility is maintained on a day-to-day basis.\n\n1.4 Summary of the Five-Year Accident History\n\nThe facility has had no releases of ammonia meeting the reporting criteria within the last five years.\n\n1.5 The Emergency Response Program\n\nDCC~CDS does not re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000115101,
      "SummaryText": "quire its employees to participate in conducting emergency response activities under the HAZWOPER standard (non-responding facility). In the event of an ammonia emergency, the response is to evacuate and to notify the local response agencies. Employees are trained on hazard communications procedures. \"Notify and Evacuate Drills\" are performed and documented.  Several regional Fire Departments and mutual aid agencies have participated in a drill at the facility.\n\nAmmonia release emergency response would be done by the Salinas City Fire Department.  DCC~CDS has coordinated emergency response with the Fire Department including the installation of a Knox Box.  WPS would also be notified in case of a release.  WPS is located about 10 miles from the facility and employs technicians trained beyond 29 CFR 1910.120(q) Awareness level.  The Technician's role would be to support the Fire Department if an ammonia emergency were to occur.  WPS and its Refrigerating technicians maintain control of their written ammonia emergency procedures and equipment. \n\n1.6   Planned changes to improve safety\n\nThe primary mechanisms to identify and plan safety improvements include (but are not limited to):\n\n - Process Hazard Analysis update;\n - Compliance Audits;\n - Mechanical Integrity Program (Routine Inspections & Maintenance);\n - IIAR Bulletin 109 Safety Inspections; \n - Cal/ARP Seismic Assessment; and\n - DCC~CDS & WPS Inspection Protocols\n\nEach of the Programs above may result in recommendations ranging from capital improvements to routine maintenance of the plant. When appropriate, Service Calls are established in parallel to identified needs. Current planned changes to improve safety include recent PHA 5-Year update recommendations, which include mechanical and administrative improvements. A written record of the recommendations has been prepared and submitted to DCC Management. Completion of changes resulting from the most recent PHA is expected by 10/16/2026, during seasonal shutdown."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000115101,
      "SummaryText": null
    }
  ]
}