{
  "FacilityID": 1000089522,
  "FacilityName": "Ascensus Specialties Callery LLC",
  "FacilityStr1": "1424 Mars-Evans City Road",
  "FacilityStr2": null,
  "FacilityCity": "Evans City",
  "FacilityState": "PA",
  "FacilityZipCode": "16033",
  "Facility4DigitZipExt": "9360",
  "FacilityCountyFIPS": "42019",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "40.748889",
  "FacilityLongDecDegs": "-080.048889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.ascensusspecialties.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Ascensus Specialties LLC",
  "Company2Name": null,
  "CompanyDUNS": 80571132,
  "Company2DUNS": null,
  "OperatorName": "Ascensus Specialties Callery LLC",
  "OperatorStr1": "1424 Mars-Evans City Road",
  "OperatorStr2": null,
  "OperatorCity": "Evans City",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16033",
  "OperatorZipCodeExt": "9360",
  "FTE": 95,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000070479",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-07-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-08-30 10:15:11",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-09-14 16:11:26",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-09-14 16:11:26",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-09-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.7462,
  "FRS_Long": -80.0369,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000111309,
      "AltID": "Boron Trifluoride",
      "FacilityID": 1000089522,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000139051,
          "ProcessID": 1000111309,
          "ChemicalID": 52,
          "Quantity": 33120.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000112582,
          "ProcessID": 1000111309,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000094877,
              "Process_NAICS_ID": 1000112582,
              "SafetyReviewDate": "2020-06-30 00:00:00",
              "PHA_Date": "2020-06-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-06-29 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Emergency Response Team",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-04-01 00:00:00",
              "TrainingReviewDate": "2018-07-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-03-11 00:00:00",
              "EquipmentInspectionDate": "2020-05-21 00:00:00",
              "EquipmentTested": "Modified BF3 Shed (Bldg.) to fit MEGC Tube Trailer",
              "ChangeMgmtDate": "2020-02-25 00:00:00",
              "ChangeMgmtReviewDate": "2020-03-16 00:00:00",
              "PreStartupReviewDate": "2020-05-21 00:00:00",
              "ComplianceAuditDate": "2018-11-07 00:00:00",
              "AuditCompletionDate": "2020-12-31 00:00:00",
              "IncidentInvestigationDate": "2020-08-11 00:00:00",
              "InvestigationChangeDate": "2020-08-11 00:00:00",
              "ParticipationPlansReviewDate": "2019-06-11 00:00:00",
              "HotWorkPermitReviewDate": "2019-06-24 00:00:00",
              "ContractorSafetyReviewDate": "2020-08-25 00:00:00",
              "ContractorSafetyEvalDate": "2020-01-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000118476,
                  "PreventionProgram3ID": 1000094877,
                  "ProcessChemicalID": 1000139051
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000089522,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-05-01 00:00:00",
    "ERTrainingDate": "2018-10-24 00:00:00",
    "CoordinatingAgencyName": "Butler County EMA",
    "CoordinatingAgencyPhone": "7242845211",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089522,
      "SummaryText": "Ascensus Specialties Callery LLC\r\nEvans City, PA 16033\r\nAugust 27, 2020\r\n\r\nAscensus Specialties Callery LLC (Ascensus) is committed to protection of human health and the environment.  This commitment is supported by its Code of Ethical Conduct and policies on Business Ethics, Workplace Health and Safety, and Environmental Law Compliance and Management.  \r\n\r\nThe Ascensus Specialties Callery LLC is located in Butler County at 1424 Mars-Evans City Road between Mars and Evans City, Pennsylvania.  A small portion of the facility lies within the Borough of Callery; the majority is within Forward Township.  Ascensus owns approximately 88.74 acres but approximately 30 acres have been developed for commercial use.  The facility was purchased from Mine Safety Appliances Company (MSA) in September 2003.  MSA complied with the provisions of 40 CFR Part 68 and submitted their RMP to the agency in June of 1999, and then in December of 2013 as BASF, all elements of those submittals remain in place. In March 2017, Edgewater Capital Partners purchased the facility from the BASF Corporation which is now called Callery. Then again, in September 2019 Wind Point Partners purchased Callery, LLC from Edgewater Capital Partners and continues to operate the facility manufacturing as previously operated and is now called Ascensus Specialties Callery LLC.\r\n\r\nEPA's Chemical Accident Prevention Provisions, 40 CFR Part 68, also known as the Risk Management Program, were created to reduce the probability and severity of accidental releases and to stimulate dialogue between industry and the public to improve accident prevention and response.  In an effort to better educate others, Ascensus has presented a summary of the site's Risk Management Program to the Local Emergency Planning Committee (LEPC), local firefighters and its own employees.  This written summary should also help others to understand Ascensus's Risk Management Program.  \r\n \r\n\r\nRegulated Substances:\r\n\r\nAscensus manufactures a range"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089522,
      "SummaryText": "of chemicals based on alkali metal chemistry and boron hydride chemistry.  Its products are used in the pharmaceutical and electronics industries.  Boron trifluoride (BF3), Chemical Abstract Services Registry Number 7637-07-2 is the only substance used at the site in quantities above the Risk Management Program regulated threshold quantity.  That regulatory threshold for BF3 is 5,000 pounds.  Typically, Ascensus receives BF3 in specially constructed, Department of Transportation certified tube trailers. These tube trailers have seven individual high pressure tubes permanently mounted to a truck trailer. Ascensus also uses individual spheres (net wt. 325 kgs. or 716.7 lbs.) to store / hold BF3.  Maximum amount of BF3 on-site at any one-time is up to 33,120 pounds.  The BF3 is directly piped to Ascensus 's process from the tube trailer or spheres which is standard industry practice.\r\n\r\nBF3 is commonly used throughout the world to manufacture synthetic motor oils, adhesives, pharmaceuticals, and flavors and fragrances.  Ascensus uses it to manufacture diborane, which is a basic boron chemical.\r\n\r\nOther materials listed by EPA in 40 CFR Part 68 are purchased, stored and consumed in quantities below their threshold quantities.  Ascensus has a procedure to limit the amount of these materials purchased and stored onsite such that they will not exceed these thresholds.\r\n\r\nRelease Scenario:\r\n\r\nEPA's Chemical Accident Prevention Provisions require the preparation of a worst case and an alternate (or more likely) case scenario for the release of the regulated substances.  These release scenarios were prepared in July 2020 while using the CAMEOfm suite.  The model used for the scenarios was the ALOHA model.  The ALOHA model is capable of modeling dispersions of high pressure releases of heavier than air gases, such as BF3.\r\n\r\nThe worst case scenario involves the catastrophic failure of one of the high pressure tubes (holding ~2,751 lbs. / tube of BF3 gas) on the BF3 trailer, re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089522,
      "SummaryText": "sulting in a release of 2,733 pounds of BF3 gas over a 7 minute period.  The alternate case scenario involves the occurrence of a 1/4 inch diameter hole in the unloading line from the tube trailer to the first pressure regulator in the facility's BF3 system.  The result would be a release of 2,542 pounds of BF3 up to a 60 minute time period; ALOHA limited the release duration to 1 hour.  It is assumed that it could take Ascensus personnel up to 30 minutes to detect the release and close the remote shut-off valve on the tube trailer.  By procedure, BF3 is never transferred or used without supervision by a trained operator.\r\n\r\nEmergency Response Program:\r\n\r\nThe facility maintains a detailed Emergency Preparedness Plan.  The Plan is reviewed and updated periodically.  It details responsibilities and actions to be taken by facility personnel as well as by outside response organizations.  The facility has its own Emergency Response Team.  They, along with community firefighters, emergency medical services, HazMat Teams, and the LEPC have been trained to handle and to respond to a release of BF3 by the manufacturer of BF3.  In addition, they have held their own practice drills.  Ascensus works closely with the LEPC and other community responders to prepare and preplan for proper response.\r\n\r\nThe proper response to a release of BF3, which is a corrosive gas and will produce a white cloud, is to hit it with water spray in order to prevent its offsite migration by knocking down the cloud.  If the BF3 cannot be controlled this way, it will eventually react with moisture in the atmosphere or be diluted enough in the air so that it is no longer a hazard.\r\n\r\nMSA installed a CAS (Community Alert System) (siren and community education program) in 1998.  Ascensus has and will continue to maintain and exercise this CAS equipment.  For a release of BF3 with off-site consequences, the proper community response is to shelter in place to prevent exposure to the material.  If needed, the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089522,
      "SummaryText": "siren would be used to alert the community to shelter in place and take proper precautions.  An all-clear signal will let the community know that the emergency is over.  CAS drills are conducted monthly.  The alert system may also be activated for weather emergencies at the request of the Butler County EMA Director.\r\n\r\nIf the Community Alert System is activated, Ascensus will also call \r\n9-1-1 to activate the off-site response plan managed by Ascensus and the LEPC.  The LEPC has developed a plan in conjunction with local industry to address road closures, etc., if they were ever to become necessary.\r\n\r\nRelease Prevention:\r\n\r\nThe facility uses a number of programs to design, operate and maintain a safe facility and prevent releases.\r\nThese programs include but are not limited to the following:\r\n¿\tThe OSHA Process Safety Management (PSM) standard.\r\n¿\tConducting Process Hazard Analysis studies.\r\n¿\tWriting and implementing a series of Environmental, Safety and Health procedures.\r\n¿\tPreparing and implementing a site Emergency Preparedness Plan.\r\n¿\tExtensive use of computer control and monitoring of chemical processes.\r\n¿\tInstallation and use of on-site fire and leak detection systems.\r\n¿\tMaintenance of on-site fire detection and suppression systems.\r\n¿\tContinuous training of operations personnel utilizing Standard Operating Procedures (SOPs).\r\n¿\tImplementation of a Contractor Safety Program.\r\n¿\tImplementation of an Incident Investigation procedure.\r\n¿\tThe use of a computerized maintenance management system to implement a preventive maintenance program.\r\n¿\tEquipment lockout, tagout (control of hazardous energy) procedures, hot work (flame and heat producing activities), and line breaking procedures.\r\n \r\n\r\nFive Year Accident History:\r\n\r\nAll incidents for the past five years were reviewed for actual or potential off-site consequences.  No incidents during the past 5 years were found to have actual or potential off-site consequences. \r\n\r\nPlanned Changes to Improve Safety:"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000089522,
      "SummaryText": "The facility reviews its manufacturing processes on a regular basis in order to improve the processes, related procedures, and plans. During the site's 5-year required PHA (Process Hazard Analysis) update the BF3 building / system was modified to accommodate a larger tube trailer in the second quarter of 2020.  No further changes to the system are planned.\r\n\r\nAscensus's Commitment:\r\n\r\nAscensus's is committed to making continual efforts to improve its processes, procedures, and plans.  Preventing accidents is an important part of our efforts.  Pre-planning and practicing response with Ascensus's Emergency Response Team, the community's firefighters, and the LEPC is an important part of our emergency planning."
    }
  ]
}