{
  "FacilityID": 1000013488,
  "FacilityName": "Houston Plant",
  "FacilityStr1": "1000 N. South Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77503",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Pasadena  LEPC",
  "FacilityLatDecDegs": "29.734056",
  "FacilityLongDecDegs": "-95.17",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "WR",
  "FacilityURL": "www.ethyl.com",
  "FacilityEmailAddress": "steve.livesay@ethyl.com",
  "FacilityDUNS": 8096158,
  "ParentCompanyName": "Ethyl Corporation",
  "Company2Name": null,
  "CompanyDUNS": 3132222,
  "Company2DUNS": 3132222,
  "OperatorName": "Ethyl Corporation",
  "OperatorStr1": "PO Box 472",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77501",
  "OperatorZipCodeExt": "0472",
  "RMPContact": "H. Steve Livesay",
  "RMPTitle": "Sr. Manager, HSSE",
  "FTE": 101,
  "OtherEPAFacilityID": "TXD008096158",
  "EPAFacilityID": "100000012719",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0-01460",
  "SafetyInspectionDate": "1995-09-05 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-03-16 00:00:00",
  "DeRegistrationEffectiveDate": "2016-03-11 00:00:00",
  "AnniversaryDate": "2015-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.73524,
  "FRS_Long": -95.1699,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016738,
      "AltID": "PIBSA Dispersant Unit",
      "FacilityID": 1000013488,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017122,
          "ProcessID": 1000016738,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019903,
          "ProcessID": 1000016738,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000519903,
          "ProcessID": 1000016738,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000016739,
      "AltID": "Mannich",
      "FacilityID": 1000013488,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017123,
          "ProcessID": 1000016739,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019904,
          "ProcessID": 1000016739,
          "ChemicalID": 1,
          "Quantity": 250000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000519904,
          "ProcessID": 1000016739,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013488,
      "SummaryText": "EXECUTIVE SUMMARY\n\nI.  Accidental Release Prevention and Emergency Response Policies\n\nSafety receives the highest priority at the Ethyl Corporation-Houston Plant manufacturing facility in Pasadena, Texas.  Ethyl's believes that effective safety management requires the concurrent implementation of three basic concepts:\n1. Each individual is responsible and accountable for his or her own safety,\n2. Ethyl Corporation has the responsibility to provide a safe work environment,\n3. As a responsible individual, each employee has a duty to also care for the safety of his coworkers and appropriately discuss safety behavior with each other.\n\nManagement wants to have one of the safest manufacturing facilities in the chemical industry and has set its goal to be \"zero OSHA recordable injuries\".  Integral to zero OSHA recordable injuries is preventing accidental chemical releases that could potentially harm employees or members of the public.\n\nThe plant maintains detailed manuals with information and procedures for its safe operation.  Frequent training sessions provide the employees and contractors the knowledge and skills needed for conducting safe operations.  The manuals also contain detailed information on the nature of the chemicals and equipment present in the plant, the safe modes for operating the equipment and handling the chemicals, and the procedures to be followed in the event of accidental release or other emergency event.   Management supports the active participation of employees in the Channel Industries Mutual Aid organization comprised of the areas neighboring chemical manufacturers.  Routine drills are carried out at various members' facilities to practice emergency responses to hypothetical fire, explosion and chemical release scenarios.  Members of our emergency response teams receive annual training at the Texas A&M Fire School and annual refresher training as Hazmat Technicians.  Many members are certified Emergency Medical Technicians and Fire Fighters wit"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013488,
      "SummaryText": "h many years of chemical plant experience.\n\n\nII. RMP Regulated Substances at the Ethyl Corporation-Houston Plant\n\nThe Ethyl Corporation-Houston Plant is located approximately one mile north of Highway 225 on N. South Street in Pasadena, Texas.  The plant began operation in 1952.  In 1994 Ethyl spun off major portions of the plant to Albemarle Corporation.  The present Ethyl plant manufactures over 100 million pounds annually of specialty lubricant additives and fuel additives, and serves as a distribution terminal for fuel additives.  The lubricant and fuel additives are oil-based polyalkylphenols, polyaklylphenylamines, and polyisobutylene compounds.  The plant uses two chemicals above the threshold quantities listed the EPA Risk Management Plan rule to carry out the chemical reactions that are part of producing the additives; chlorine and formaldehyde.\n\nChlorine\n\nA 90-ton capacity rail car of chlorine is positioned inside the plant to feed the polyisobutylene process where it serves as a reaction promoter. The polyisobutylene process produces oil-based lubricant additives.  The process uses approximately 4 to 5 rail cars of chlorine per year.  This annual usage makes it impractical to use the smaller, 1-ton chlorine cylinders.  As a passive mitigation control, only one chlorine rail car is allowed in the process area of the plant.\n\n\n\nFormaldehyde\n\nFormaldehyde is brought into the plant by truck trailer.  The formaldehyde is a solution composed of 44% formaldehyde, 1% methanol, and 55% water.  It is unloaded from the truck trailer to a 61,000-gallon capacity storage tank (T-1203) in the Mannich dispersant area.  Formaldehyde is one of four materials reacted in oil to produce specialty oil dispersants and gasoline performance additives.\n \n\nIII.  Worst Case Scenario\n\nChlorine\n\nThe worst case scenario for chlorine is the structural failure of one, full rail car that releases the 90 tons (180,000 pounds) of gas over a ten-minute period.  The wind speed is assumed to be"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013488,
      "SummaryText": " low at 1.5 meters/second (3.4 miles/hour) with an F-Stability class meteorological condition.  An F-Stability class is a meteorological condition that gives little air turbulence and therefore a low level of mixing and dilution of the released gas. The EPA established the Toxic Endpoint for chlorine, based on the Emergency Response Planning Guideline-2, to be 0.0087 mg/l.  Using the Look-Up Tables from the EPA Off- Site Consequences Guidance Document the distance to the toxic end point is estimated to be 14 miles.\n\nThe amount of chlorine present at the plant site is limited to one, 90-ton capacity rail car in the process area. The rail car is unloaded in an secured fenced area of the plant that is isolated from routine rail traffic.  A derailer is placed across the rail tracks and locked on to prevent accidental movement by a train while the rail car is being unloaded.  The rail car is not connected to any other cars and its wheels are chocked. There is 24-hour video surveillance of the chlorine rail car and 5 detectors to alert personnel of a possible leak. Operators make routine rounds to inspect the Chlorine system during their shift.\n\n IV.  Alternative Release Scenarios\n\n\nChlorine\n\nThe Alternative Release Scenario for chlorine is a gasket failure at a flanged joint, upstream of the remote operated shutoff valve, in the one-inch unloading line connected to the rail car transfer hose system.  The release rate is assumed to be 240 pounds per minute, which is just below the setting of the rail car's automatic, excess flow, shutoff valve.  It is assumed the leak lasts 20 minutes before the emergency response crew stops it.  The wind speed is assumed to be at 3.0 meters/second (6.8 miles/hour) with a D-Stability class meteorological condition.  A D-Stability class is a meteorological condition that gives little air turbulence and therefore a low level of mixing and dilution of the released gas. The EPA established the Toxic Endpoint for chlorine, based on the Emergen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013488,
      "SummaryText": "cy Response Planning Guideline-2, to be 0.0087 mg/l.  Using the Look-Up Tables from the EPA Off- Site Consequences Guidance Document the distance to the toxic end point is estimated to be .30 miles.\n\nAn emergency Chlorine \"C\" Kit is maintained at the walkway of the chlorine rail car unloading rack.  It has the materials needed to do an emergency-shutoff of the rail car.  Fire fighting equipment on site would spray the downwind area to absorb and disperse the escaping gas.  Five ambient air-monitoring detectors, which surround the rail car, sound an alarm if chlorine above 1 ppm is detected. A surveillance camera monitors the unloading spot 24 hours per day.  Detailed written response procedures are in place.  Operators and emergency response personnel train periodically on the chlorine response procedures.\n \nFormaldehyde\n\nThe Alternative Release Scenario for formaldehyde is the failure of the 3-inch rubber hose during the unloading of a truck trailer.  It is estimated that the 4,400 pounds per minute for a period of 10 minutes would be spilled to the curbed concrete containment area in which the truck trailer is staged for unloading, before the valve on the truck trailer would be closed. The wind speed is assumed to be 3.0 meters/second (6.8 miles/hour) with a D-stability class meteorological condition.  A D-stability class is a meteorological condition that gives little air turbulence and therefore a low level of mixing and dilution of the released gas. The EPA established the Toxic Endpoint for formaldehyde, based on the Emergency Response Planning Guideline-2, to be 0.012 mg/l.  Using the Look-Up Tables from the EPA Off- Site Consequences Guidance Document the distance to the toxic end point is estimated to be 0.19 miles.\n\n\nV. General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nThe Ethyl Corporation-Houston Plant uses the Process Hazards Analysis method as one means of identifying potential chemical process hazards.  A well-docum"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000013488,
      "SummaryText": "ented ISO style system is in place to track the progress of resolving any potential hazards identified and to document their final engineered resolution.  A corporate policy for Employee participation in the PHA process written in 1993 is followed.  Employees have full access to the computer based PHA progress tracking system.\n\nSpecific PHA reviews have been conducted for the Chlorine Unloading System, and the Formaldehyde Unloading and Storage system.   These reviews are periodically renewed as needed for planned process changes, in response to process incidents, or as required by schedule renewal dates.\n\nAnother element of the plant's accidental release prevention is it inspection and maintenance program to assure equipment mechanical integrity.  The program is designed to fulfill the requirements of the OSHA Process Safety Management rules.\n\n\nOver arching these programs is plant management's commitment to safe operations.  Constant attention is given to see that the resources and individuals needed for the various prevention programs are available to insure the chemical accident prevention programs, such as the ones mentioned previously, are in place and current.\n\nVI.  Five Year Accident History\n\nThere have been no accidental releases of chlorine or formaldehyde at the Houston plant during the past five years that have resulted in death, injury, or property damage on-site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\nVII.  Emergency Response Program\n\nThe Ethyl Houston plant's emergency response program is carried out at three levels.  First, there is a program internal to the Ethyl facilities.  The written emergency response program covers all of the plant's facilities and the chemicals used.  All employees and contract personnel receive periodic, mandatory training in the emergency response procedures.  The program is under the leadership of the plant manager and a full time, qualified safety pr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000013488,
      "SummaryText": "ofessional.  Second, the plant shares security and emergency response equipment and personnel from its adjacent neighbors, the Albemarle Corporation, MEMC, and Bigler.  In the event of an emergency release, fire, or explosion trained security and emergency response personnel respond from Albemarle, MEMC, and Bigler in proportion to the level of need.  Albemarle, MEMC, and Bigler are physically located on the same complex and they have external and internal access to the Ethyl plant at all times.  Finally, Ethyl participates as a member of the Channel Industries Mutual Aid organization (CIMA).  This organizations is composed of over 100 local chemical and petrochemical plants who have an extensive array of fire fighting and emergency rescue equipment which can be quickly mobilized to deal with the all levels of emergency events that range from chemical releases, fires, or explosions.  Quarterly, drills are held which cover a wide range of emergency scenarios.  The locations for the drills are rotated among the member's plants to build a broad depth of knowledge among the response personnel.  All of the responders are employees at the member plants who have received training in the various aspects of emergency response (e.g. fire fighting, hazardous materials, first aid, emergency medical treatment, personnel rescue).\n\n\nIX. Overview of Plans to Improve Safety\n\nThe plan to continuously improve safety is based on improving the current safety systems and adding carefully selected new programs.  The current safety programs include the Joint Labor and Management Safety Committee, Process Hazard Analyses (initial and periodic renewals), OSHA Process Safety Management systems, employee safety training, and Safety, Health and Environmental Incident Investigations. In the past, investigations were directed at recordable incidents and safety performance was measured by tracking the number of OSHA recordable and lost time injuries.  This has been expanded to include near misses,"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000013488,
      "SummaryText": " and minor injuries that do not qualify as OSHA recordable.  Investigating these incidents will allow corrective actions that may pre-empt more serious injuries.  Including them in the performance measure will help to prevent complacency that might result from just observing very low recordable and lost time injury rates.  \n\n\nThe RMP program was audited 1n December 2009 by our Corporate HS&E, as part of the three year PSM Audit. This program will again be auditted in 2012 by our Corporate HS&E, as part of a combined RMP/PSM Audit."
    }
  ]
}