{
  "FacilityID": 1000113754,
  "FacilityName": "Cosme Water Treatment Plant",
  "FacilityStr1": "16015 Racetrack Road",
  "FacilityStr2": "N/A",
  "FacilityCity": "Odessa",
  "FacilityState": "FL",
  "FacilityZipCode": "33556",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12057",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "28.097161",
  "FacilityLongDecDegs": "-082.598260",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.stpete.org",
  "FacilityEmailAddress": "james.kramer@stpete.org",
  "FacilityDUNS": 73194920,
  "ParentCompanyName": "City of St. Petersburg",
  "Company2Name": "N/A",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of St. Petersburg",
  "OperatorStr1": "1650 Third Avenue North",
  "OperatorStr2": "N/A",
  "OperatorCity": "St. Petersburg",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33713",
  "OperatorZipCodeExt": null,
  "FTE": 48,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000043525",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2024-02-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-07-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-07-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-12-18 00:00:00",
  "DeRegistrationEffectiveDate": "2024-12-18 00:00:00",
  "AnniversaryDate": "2029-07-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 28.096516,
  "FRS_Long": -82.597221,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000141850,
      "AltID": null,
      "FacilityID": 1000113754,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000177240,
          "ProcessID": 1000141850,
          "ChemicalID": 62,
          "Quantity": 64000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000143344,
          "ProcessID": 1000141850,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000121072,
              "Process_NAICS_ID": 1000143344,
              "SafetyReviewDate": "2024-05-10 00:00:00",
              "PHA_Date": "2020-02-12 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Human error / terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-05-14 00:00:00",
              "TrainingReviewDate": "2023-04-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-12-19 00:00:00",
              "EquipmentInspectionDate": "2024-04-03 00:00:00",
              "EquipmentTested": "Chlorinators and Regulators.  Auto leak detector gas monitor self check everyday.",
              "ChangeMgmtDate": "2020-02-26 00:00:00",
              "ChangeMgmtReviewDate": "2024-05-03 00:00:00",
              "PreStartupReviewDate": "2020-01-02 00:00:00",
              "ComplianceAuditDate": "2024-05-10 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2024-05-10 00:00:00",
              "HotWorkPermitReviewDate": "2023-04-13 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000151875,
                  "PreventionProgram3ID": 1000121072,
                  "ProcessChemicalID": 1000177240
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000113754,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Hillsborough County Fire Dept.",
    "CoordinatingAgencyPhone": "8132643914",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 8,
      "FacilityID": 1000113754,
      "SummaryText": "fects of each scenario. \n\n5-YEAR ACCIDENT HISTORY\nThere were no reportable releases of chlorine at the Cosme WTP between June 21, 1994 and the present date.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nThe City plans to continue to perform the activities of the PSM/RMP programs in order to further develop its quality."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000113754,
      "SummaryText": "EXECUTIVE SUMMARY: City of St. Petersburg Water Treatment Facilities\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY\nThe City of St. Petersburg's Water Resources Department has a long history of using chlorine and is committed to using it in a safe manner.    The Department implemented a written policy to comply with requirements of the EPA's Risk Management Plan and the OHSA's Process Safety Management regulations.  Another written policy established procedures for response to minor chlorine leaks and specifies procedures for safe handling of chlorine and chlorine equipment.  In the event an emergency response is required, the Cosme Water Treatment Plant will be serviced by the Hillsborough County Hazmat Team (this stationary source is included in the community emergency response plan).  Because of our role in public health and safety, the Department has an Emergency Operations Plan to carry out mission essential functions in the event of disruption of one of our facilities due to an emergency/disaster.  \n\nFACILITY AND REGULATED SUBSTANCES \nThe City of St. Petersburg Water Resources Department, Division of Water Treatment & Distribution consists of three water treatment and storage facilities: the Cosme Water Treatment Plant (WTP), the Oberly Pump Station(PS)  and the Washington Terrace Pump Station (PS).   The Cosme WTP, located in suburban northwest Hillsborough County, Florida, provides drinking water to the city of St. Petersburg and neighboring communities.  The treatment processes at the plant include aeration, lime softening, filtration, fluoridation, and disinfection.\nThe Cosme Water Treatment Plant stores chlorine in quantities above the regulatory thresholds requiring Risk Management Plan implementation.  The maximum inventory of chlorine stored at the Cosme WTP is 64,000 pounds.  The chlorine is used to disinfect the water prior to distribution.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC STEPS\nWhile Florida does not"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000113754,
      "SummaryText": "have a state plan for occupational safety and health, the Water Resources Department has established policy to comply with the PSM regulation.  Although the Department would qualify for RMP Program Level 2, the Department has elected to comply with Program Level 3 requirements. \nThe Risk Management Plan consists of three major parts.  One part is a Prevention Program that consists of 12 elements designed to improve the system safety and decrease the likelihood of a release.  Another part is the Emergency Response Program, which develops a plan for dealing with a release in the unlikely event that one would occur.  The last part of the program is the Offsite Consequence Analysis, which is performed to determine the effects that a release of a regulated substance could have on the public.\n \nPart One:  Prevention Program\nThe Prevention Program consists of 12 elements designed to improve the system safety and decrease the likelihood of a release.\n\n1)\tProcess Safety Information\nThe RMP regulations require that information concerning process chemicals, technology, and equipment be compiled as part of an RMP program. Emergency response planners can use such information to develop training programs and procedures, or as a general resource. The information will be supplied to contractors who will work in the chlorine process area as part of the requirements outlined in the Contractors element.  All the required process safety information was compiled as required by the PSM & RMP regulations. The information meets and in many cases exceeds the minimum required by the regulations.\n\n2)\tProcess Hazard Analysis\nA process hazard analysis (PHA) is reviewed and revalidated at least once every 5 years for the chlorine process to evaluate potential causes and consequences of accidental releases. This information is used by water treatment facility staff to improve safety and reduce the consequences of accidental releases. Equipment, instrumentation, utilities, human actions, and exte"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000113754,
      "SummaryText": "rnal factors that might affect the process were the focus of the PHA.\nA Process Hazard Analysis team was assembled within the Division of Water Treatment & Distribution. The chlorine PHA was conducted by a team of water treatment facility staff familiar with the process operation and maintenance and facility management. The PHA team has expertise in engineering, chlorine process and operation and chlorine process hazard analysis methodology. \nThe PHA was accomplished using a \"What-If\" method.  The most recent PHA reflected a mature program.  After consideration of all the components and procedures in place that contribute to the overall safety of the process, it was recommended to copy an SOP for the leak detector at one facility from the SOP for same unit at another facility.  As facilities share identical copies of a common SOP book, is was noted that the procedure was already readily available for the lacking site.  \n\n3)\tOperating Procedures\nOperating procedures for the chlorination process are incorporated into RMP/PSM programs. Written operating procedures assure continuous, efficient, and safe operation of the facility. The goal of the operating procedures is to provide clear instructions to safely operate the process. Operating procedures are also used to train new employees and to provide refresher training for existing staff.\nThe detailed operating procedures include startup, shutdown and emergency operating procedures. The procedures describe how the system should be operated in order to minimize the chances of an accidental release. The procedures also emphasize safety considerations during operation and address hazardous situations that can occur and how to correct them.\n\n4)\tTraining\nAn effective RMP/PSM training program can significantly reduce the number and severity of accidental releases. Employees involved in operating or maintaining the chlorination process must receive training that includes applicable operating and maintenance procedures and an o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000113754,
      "SummaryText": "verview of the process. Training must emphasize safety and health hazards and safe work practices.\nCity of St. Petersburg water treatment facility employees have received initial training on the operations and maintenance of the regulated processes through on-the-job training.  The Division of Water Treatment & Distribution certifies each of the Water Plant Operators and Maintenance personnel on the safe handling of chlorine and emergency action annually.  The Water Resources Department gives annual training on equipment lock-out/tag-out procedures, confined space entry procedures and hot work permit procedures.  \n\n5)\tMechanical Integrity\nAn effective mechanical integrity program is one of the primary lines of defense against a release. The mechanical integrity program addresses equipment testing and inspection, preventive maintenance schedules, and personnel training.  The intent is to ensure that equipment used to process, store, or handle chlorine is maintained and installed to minimize the risk of releases.\nThe City's water treatment facility maintenance staff has a mechanical integrity program that includes equipment and instrumentation identification, maintenance, testing and inspection schedules, personnel training and maintenance documentation. Preventive maintenance is scheduled based on equipment manufacturers' recommendations published in their operation and maintenance (O&M) manuals.  In addition to preventive maintenance, water treatment facility staff performs corrective maintenance in the event of equipment malfunction or breakdown. Work orders indicate what safety precautions must be followed including whether lockout/tagout or confined space entry provisions are applicable. \n\n6)\tManagement of Change\nA system for the proper management of changes and modifications to equipment, procedures, chemicals, and processing conditions is required under the RMP/PSM. Modifications to the chlorine system will be reviewed before they are implemented to determine i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000113754,
      "SummaryText": "f the modification would compromise system safety. An effective change management system will help minimize the chance for an accidental release.\nIf a modification covered under RMP/PSM is made, its effects must be addressed, employees must be informed, and the written procedures must be updated. The intent is to require that all modifications to equipment, procedures, and processing conditions other than \"replacement in kind\" be managed by identifying and reviewing them before implementation. A Management of Change Evaluation Form will be completed and evaluated for any modifications that are covered under the RMP/PSM. The Management of Change Form will be evaluated by the Water Plant management team who will authorize the change prior to its initiation.  A Notification of Process Change Checklist is also completed prior to system modification.\n\n7)\tPre-startup Review\nA pre-startup safety review must be conducted for any new covered process or for significant modifications to the existing chlorine process that necessitate a change in the process safety information.  No new or significantly modified process will start up and no acutely hazardous chemicals will be introduced into such a process prior to the pre-startup safety review.  The purpose of the pre-startup safety review is to ensure that the facility is ready to operate new and modified regulated processes safely. \nTo initiate the pre-startup safety review, all updated elements of the Process Safety Management Plan are assembled for review. This includes all process safety information, process hazard analysis, operating procedures, employee training and mechanical integrity records. The pre-startup safety review team should complete and sign a Pre-startup Safety Review Form. This form documents the process, and helps ensure that the review has been properly performed. The Pre-startup Safety Review Form must be authorized before startup.\n\n8)\tCompliance Audit\nThe City of St. Petersburg's water treatment facilit"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000113754,
      "SummaryText": "ies are required to complete a compliance audit at least once every 3 years for the chlorine process the RMP/PSM program. The primary goals of conducting an internal compliance audit are to gather sufficient data to verify compliance with RMP/PSM requirements and good process safety practices, identify process safety deficiencies and develop corrective actions, and increase safety awareness among facility staff.  The most recent internal compliance audit was modeled after the Florida Division of Emergency Management's onsite inspection checklist for program level 3. \n\n9)\tIncident Investigation\nEach incident that resulted in or could reasonably have resulted in a catastrophic release (i.e. a release that results in death or permanent injury) of chlorine must be investigated.   A process to identify the underlying causes of incidents and to implement procedures for preventing similar events has been developed.   To investigate an incident, an Incident Investigation Review Committee will be established.  As part of the investigation, an Incident Report Form will be prepared to recommend system changes.\nThe investigation team should ask questions such as what equipment failed, which behavior failed, and which material leaked, reacted, or exploded?  As part of the incident review, staff actions that may have contributed to the incident will also be reviewed.   A determination will be made as to whether it is necessary to institute additional training for the employees to prevent the incident from occurring in the future.  On the Incident Report Form, the Water Plant Chief Operator identifies which of the recommended system changes are approved for implementation.   The incident investigation report and any changes resulting from the report will be reviewed with all staff members who operate and maintain the applicable system. \n\n10)\tEmployee Participation\nThe participation of the City of St. Petersburg water treatment facility staff in preparing the RMP/PSM program was cr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000113754,
      "SummaryText": "itical to the program's successful implementation.  Employee participation is valuable because it increases the safety awareness of the staff and it allows the staff's experience in operating and maintaining the processes to be incorporated into the plan.\nWater treatment facility staff participated in the development of the Prevention Program through a series of meetings and workshops, as well as the Process Hazard Analysis described below. All facility staff received awareness training that instructed staff on how the RMP/PSM requirements may impact their jobs, an overview of each of the RMP/PSM plan elements and the procedures that must be followed to comply with the requirements of the RMP/PSM plan.\n\n11)\tHot Work Permits\nRMP/PSM regulations require employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the chlorine process.  To ensure that hot work is done safely, a Hot Work Permit Program has been developed that requires a permit to be issued before hot work is performed. The hot work permit requires the identification of hazards and appropriate safeguards, as well as the implementation of the safeguards to ensure a fire-safe workplace.   Examples of such work include, but are not limited to: welding, cutting, grinding, brazing and operating flame- or spark-producing operations.  \n\n12)\tContractors\nThe City's water treatment facilities must make contractors aware of the known hazards of the chlorine process related to the contractors' work.  In addition, the water treatment facilities must make contractors aware of the applicable elements of its emergency response plan.  The City should screen for contractors that can perform work on or adjacent to the chlorine process without compromising the safety and health of employees at the facility. \nThe City must obtain and evaluate information regarding the contractor's safety performance and programs before allowing a contractor to work on or adjacent to the chlorine proces"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000113754,
      "SummaryText": "s.  When a contract that involves work on or adjacent to the chlorine process is to be bid, the bidding procedures must ensure that contractor safety management requirements are met.  To make the contractor aware of the water treatment facilities RMP/PSM plan requirements, a safety briefing must be conducted before work begins in or adjacent to any covered process.  Upon arriving at the facility for the first time to perform work, the contractor will be presented a Contractor Safety Management Briefing Form that must be read and signed. \n\nPart 2: Emergency Response Program\nThe Water Resources department considers the Cosme WTP, Oberly PS and Washington Terrace PS facilities to be Non-Responding facilities.  In accordance with 40 CFR 68.90(b)(1),  the stationary source is identified in the Hazardous Materials Emergency Plan of the  Tampa Bay Local Emergency Planning Committee (LEPC) District VIII.  The employees have been trained in the emergency action (evacuation) plan.   Evacuation of areas surrounding the facility, if necessary, will be facilitated through local law enforcement and fire departments.  The Hillsborough County HAZMAT teams will be called upon to secure the release.  The Department's Emergency Operations Plan can be implemented to ensure the highest level of efficient response for recovery from the release. \n\nPart Three: Offsite Consequence Analysis\nAn Offsite Consequence Analysis was performed to determine the effects a release would have on the public.  For chlorine, the distance a set endpoint concentration of the gas would travel must be determined. In addition, an estimate of the population that could be affected by a release of chlorine was determined and sensitive receptors such as hospitals, schools, and nursing homes were identified. The analysis considers two release scenarios -- a \"worst case\" and an \"alternative case.\"   The most recent analysis used the EPA's OCA Guidance reference tables or equations and Marplot 5.1.1 to estimate the ef"
    }
  ]
}