{
  "FacilityID": 1000021700,
  "FacilityName": "City of Donna Wastewater Treatment Plant",
  "FacilityStr1": "1 1/4 Mile South Old River Road",
  "FacilityStr2": null,
  "FacilityCity": "Donna",
  "FacilityState": "TX",
  "FacilityZipCode": "78537",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48215",
  "LEPC": "Hidalgo County LEPC",
  "FacilityLatDecDegs": "26.149167",
  "FacilityLongDecDegs": "-098.053889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Donna",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CH2MHILL, Inc.",
  "OperatorStr1": "1 1/4 Mile South Old River Road",
  "OperatorStr2": null,
  "OperatorCity": "Donna",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78537",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jose Ramos",
  "RMPTitle": "CH2MHILL PM",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000145764",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-05-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-05-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-04-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-04-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-04-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 26.14833,
  "FRS_Long": -98.05328,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000026344,
      "AltID": null,
      "FacilityID": 1000021700,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055394,
          "ProcessID": 1000026344,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000031332,
          "ProcessID": 1000026344,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000531332,
          "ProcessID": 1000026344,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000021700,
      "SummaryText": "Executive Summary\n\n\n\nThis four section report meets the Risk Management Plan (RMP) requirements of the Environmental Protection Agency for Prevention Program 3 [40 CFR 68] and the Process Safety Management (PSM) requirements of the Occupational Safety and Health Administration [29 CFR 1910.119]. \n\n\n\nJose Ramos, Project Manager for  CH2MHILL is the responsible official at the City of Donna Wastewater Treatment. \n\n\n\nThe City of Donna Wastewater Treatment Plant is located at 1 1/2 mile So. Old River Road, Donna, Hidalgo County, Texas, at North 26.149167 Latitude and West -098.053889 Longitude. The facility serves a population of approximately 16,400 according to the U.S. Census Bureau 2000 population estimate (www.census.gov). The facility contains two one-ton cylinders of chlorine. One container is connected to the system and the other serves as backup. Personnel oversee the facility 24-hours a day and conduct daily inspections of the chlorine building. The facility houses emergency air and power supply. Self-Contained-Breathing-Apparatuses (SCBA) are stored in the office. \n\n\n\nRMP regulations for Program 3 processes require the performance of a consequence analysis for one worst-case release scenario, estimated to create the greatest distance in any direction to a toxic endpoint. The worst-case release scenario selected involved the complete loss of the Chlorine to the air.  The quantity present in a vessel will be released as a gas over 10 minutes for toxic substances that are normally gases at ambient temperature and handled as a gas or a liquid under pressure. The RMP*Comp32 results indicate that the maximum distance needed for the concentration of chlorine to reach the toxic endpoint (0.0087 mg/L) as a result of a 10-minute release of 2,000 pounds of chlorine is 1.3 miles. The total potentially affected population with the entire area of the circle is estimated at 7,300. \n\n\n\nOne alternative release scenario was selected for the offsite consequence analysis, since "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000021700,
      "SummaryText": "chlorine is the only regulated toxic substance used at the facility. The scenario selected involves the failure of the regulator connections to a one-ton container. This failure results in the release of the entire container's contents over a period of 15 minutes. This is equivalent to a release rate of 133 lbs. per minute. The RMP*Comp32 dispersion modeling results indicate that 0.2 miles is the maximum distance for the concentration of chlorine to reach the toxic endpoint (0.0087 mg/L). The total potentially affected population within the entire area of the circle is estimated at 0.\n\n\n\nPopulation estimates are based on 2000 U.S. Census Bureau data from LandView&reg;5 and MARPLOT. The Weslaco population has increased more than 30% in the past decade, so the potentially affected population should be higher than the numbers used in this report.  Most of the growth in Donna has occurred outside of the 1.3-mile radius, therefore, although the population has increased, it has not increased 30% within the area in question. \n\n\n\nA search of MARPLOT Satellite and Topographic maps did not identify any offsite impacts of environmental receptors within the endpoint. Environmental receptors include natural areas such as national or state parks, forests, or monuments officially designated wildlife sanctuaries, preserves, refuges, and federal wilderness areas.\n\n\n\nNo accidental chlorine releases have occurred at this facility.\n\n \n\nChemical-specific prevention steps include availability of Self-Contained-Breathing-Apparatus (SCBA) that operators wear during connection/disconnection of chlorine and staff awareness of the hazardous and toxic properties of chlorine.\n\n\n\nTo comply with Prevention Program 3 and Process Safety Management requirements, Donna Wastewater Treatment Plant personnel employed the HAZOP technique to conduct a Process Hazard Analysis.  All equipment was inspected during the Process Hazard Analysis. It was determined that the chlorination facility was designed, bui"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000021700,
      "SummaryText": "lt and operated in accordance with applicable codes and industrial guidelines. Continuous inspections as to the integrity and the condition process are made daily by Donna Wastewater Plant personnel.\n\n\n\nThe City of Donna emergency procedure addresses potential emergencies that can reasonably be expected to occur at the facility. Effort has been made to identify potential cause and consequence scenarios; however, it is possible that an event could occur that has not been foreseen. The Program Hazard Analysis and the Hazard Assessment are examples of this effort. The emergency procedure complies with the EPA Emergency Response Program requirements. Donna Wastewater Treatment Plant personnel are not the first responders, although the employees are trained in response techniques and notification of other first responders in the event of accidental chlorine releases. The first responder is the Donna Fire Department.\n\n\n\nThe City of Donna has developed and implemented an emergency response program for the purpose of protecting public health and the environment.  The City of Donna Fire and Police Departments reviewed the facility's emergency response program. Both departments are members of the Hidalgo County Local Emergency Planning Committee (LEPC). The program includes an emergency response decision tree and a notification plan. Emergency response drills, drill evaluations, and emergency operation and response procedures are reviewed annually.\n\n\n\n"
    }
  ]
}