{
  "FacilityID": 1000092481,
  "FacilityName": "Gateway Generating Station",
  "FacilityStr1": "3225 Wilbur Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Antioch",
  "FacilityState": "CA",
  "FacilityZipCode": "94509",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06013",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "38.017539",
  "FacilityLongDecDegs": "-121.758667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Pacific Gas and Electric",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Tim Wisdom",
  "OperatorStr1": "3225 Wilbur Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Antioch",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94509",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": "CAR000188565",
  "EPAFacilityID": "100000204708",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "18143",
  "SafetyInspectionDate": "2016-09-29 00:00:00",
  "SafetyInspectionBy": "Contra Costa Health Services/Hzarous Materals Prog",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Gateway Generating Station - Aqueous and Anhydrous",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-02-18 08:20:52",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-02-18 08:20:52",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-02-18 08:20:52",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-02-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10",
  "FRS_Lat": 38.017539,
  "FRS_Long": -121.758667,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000114822,
      "AltID": "Aq. Ammonia: SCR & pH",
      "FacilityID": 1000092481,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000143463,
          "ProcessID": 1000114822,
          "ChemicalID": 57,
          "Quantity": 134968.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000116215,
          "ProcessID": 1000114822,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000072393,
              "Process_NAICS_ID": 1000116215,
              "SafetyReviewDate": "2017-10-20 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "UBC, UFC",
              "FR_Comments": null,
              "HazardReviewDate": "2017-10-20 00:00:00",
              "ChangeCompletionDate": "2021-03-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Containment area and covered sump",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-07-23 00:00:00",
              "TrainingReviewDate": "2020-06-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-01-17 00:00:00",
              "EquipmentInspectionDate": "2020-04-30 00:00:00",
              "EquipmentTested": "aqueous ammonia system -Storage Tank",
              "ComplianceAuditDate": "2020-11-09 00:00:00",
              "AuditCompletionDate": "2021-07-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2017-10-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000073161,
                  "PreventionProgram2ID": 1000072393,
                  "ProcessChemicalID": 1000143463
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000092481,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Contra Costa Health Services",
    "CoordinatingAgencyPhone": "9253353200",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092481,
      "SummaryText": "1.1\tIntroduction\r\n\r\nPacific Gas and Electric Company (PG&E) operates the Gateway Generating Station (GGS), a nominal 530 megawatt (MW) natural gas-fired combined cycle electric power generating facility located in Antioch, California. The GGS uses aqueous ammonia in its selective catalytic reduction (SCR) system to reduce emissions of nitrogen oxides (NOX) to the atmosphere, as well as for condensate hydrogen ion content (pH) control. As the company responsible for operating GGS, PG&E takes its safety obligations in storing and using aqueous ammonia seriously. The following document describes what could happen if there were to be an accident, the steps PG&E takes every day to ensure a safely operating plant, and what to do in the event of an emergency.\r\n\r\n1.2\tAccidental Release Prevention and Emergency Response Policies\r\n\r\nPG&E's vision is to be the leading utility in the United States; to that effect, PG&E's values are presented below:\r\n-\tWe act with integrity and communicate honestly and openly.\r\n-\tWe are passionate about meeting our customers' needs and delivering for our shareholders.\r\n-\tWe are accountable for all of our own actions; these include safety, protecting the environment, and supporting our communities.\r\n-\tWe work together as a team and are committed to excellence and innovation.\r\n-\tWe respect each other and celebrate our diversity.\r\n\r\nThe GGS accidental release prevention policy involves a unified approach that integrates proven technology, staff training on operation and maintenance practices, and tested management system practices. All applicable procedures of the State of California and the United States Environmental Protection Agency (EPA) regulatory programs are adhered to, including key elements such as training, systems management, and emergency response procedures.\r\n\r\nAs a supplier of energy to approximately 5 percent of Americans and more than 40 percent of Californians, we recognize that the choices we make about the way we produce and del"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092481,
      "SummaryText": "iver our products and serve our customers can have a direct impact on the environment. We also believe that a healthy environment is necessary for the well-being and vitality of our customers, our employees, the communities we serve, and for society at large.\r\n\r\nAt PG&E, we are committed to being an environmental leader and demonstrating this through our actions. We pledge to think creatively, work cooperatively, and be results-oriented in our environmental stewardship efforts.\r\n\r\nOur environmental policy reflects our environmental commitment and challenges us to find ways to produce, deliver, and use energy as sustainably, responsibly, and efficiently as possible. It is our policy to:\r\n-\tComply fully with the letter and spirit of all applicable environmental laws and regulations;\r\n-\tSeek opportunities to exceed current standards of environmental protection, including pollution prevention, climate protection, and habitat and species protection;\r\n-\tLead efforts to craft and reform laws and regulations to create more effective policies and greater environmental benefits;\r\n-\tImprove management programs and standards that foster environmental excellence and innovation and reduce our impact on the environment;\r\n-\tEnsure that regular independent reviews of all environmental aspects of our business are conducted through a risk-based audit plan and corrective action program;\r\n-\tEnhance our transparency with regard to environmental progress and performance and provide this information to the public;\r\n-\tMaintain a constructive dialogue with our customers and stakeholders on environmental matters and seek out partnerships to achieve results more effectively and efficiently;\r\n-\tTrain all employees on applicable environmental requirements and the importance of environmental leadership to achieving our vision, and ensure that there is accountability for and recognition of actions; and\r\n-\tStrive for continual improvement in our environmental performance.\r\n\r\nWe aim for an injury- a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092481,
      "SummaryText": "nd illness-free work environment for the benefit of our employees, our customers, and our communities. Our Safety and Health Policy forms the foundation for the programs PG&E uses to achieve this goal. This policy requires that employees do their jobs with the goal of creating a work and business environment free from injury, illness, and property damage for the benefit of employees, customers, and the general public; employees (1) perform work in a way that protects and promotes the safety and health of themselves, co-workers, and the public, and (2) comply with all applicable health and safety laws and regulations; and each officer effectively manages the occupational and public safety and health matters concerning business activities for which he or she is responsible.\r\n\r\nGGS staff verify and improve the safety and environmental program by implementing the Risk Management Plan (RMP) prevention program requirements such as performing hazard reviews (HRs), maintaining current operating procedures, conducting training on the ammonia system, conducting compliance audits, and implementing procedures for process modifications. Manuals and procedures are available to employees at all times. The environmental, health, and safety program manuals at the GGS include the California Accidental Release Prevention (CalARP) Program RMP.\r\n\r\nThis document complies with the EPA Risk Management Program under Section 112(r) of the Clean Air Act (CAA) Amendments of 1990, Title 40 of the Code of Federal Regulations (CFR), Part 68, and the CalARP Program under Title 19 of the California Code of Regulations (CCR), Division 2, Chapter 4.5. This document summarizes our existing health and safety programs, our internal management response procedures, and ongoing actions that are designed to prevent or minimize impacts of accidental releases of ammonia to the environment. The GGS has also prepared an Emergency Action Plan to handle any potential accidental releases.\r\n\r\n1.3\tFacility Descripti"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000092481,
      "SummaryText": "on and Regulated Substances Information\r\n\r\nThe GGS is located on Wilbur Avenue, in the City of Antioch, in Contra Costa County, California, on the southern shore of the San Joaquin River. Highway 4 and the Antioch Bridge are just east of the site. Immediately south and west of the site are existing industrial facilities. The river borders the north side, while a recreational marina, open space, and additional industrial land uses are present east of the site.\r\n\r\nThe GGS combined cycle power unit consists of two natural gas-fired combustion turbine generators, two heat recovery steam generators (HRSGs), and one steam turbine generator. In the combined cycle process, electricity is generated from the combustion turbines and the steam turbine. Each combustion turbine generator converts the thermal energy of the natural gas fuel to mechanical energy, which drives the electrical generator. At the same time, the thermal energy from the exhaust flue gas off the combustion turbines is directed to the HRSG to convert pressurized water into steam, which turns the steam turbine to drive the electricity generator. The facility also includes two 195-foot-tall exhaust stacks on the HRSGs, one air-cooled condenser system, a wet surface air cooler, storage tanks, a control building, electrical power transformers, and transmission facilities to interconnect the generated electricity to the power grid.\r\n\r\nAqueous ammonia is used in the GGS's SCR system to reduce NOX emissions and for condensate pH control. Up to 18,020 gallons of 29.4 percent aqueous ammonia solution (39,628 pounds of ammonia in solution) are present in the process at any given time.\r\n\r\nThe maximum quantity of aqueous ammonia stored and handled at the GGS exceeds the Risk Management Program and CalARP Program threshold quantities, but not the Process Safety Management (PSM) threshold quantities. Therefore, the aqueous ammonia process is subject to Risk Management Program and CalARP Program regulations, but not PSM re"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000092481,
      "SummaryText": "al releases of aqueous ammonia. However, recommendations were made for correcting several inconsistencies in how the design and operation of the aqueous ammonia system are documented. Those recommendations are currently being assessed by GGS personnel for implementation, as appropriate. No additional changes are currently planned to improve safety of the aqueous ammonia system.\r\n\r\nDetails of the recommendations from the most recent HR, as mentioned above, can be found in the action item tables attached with Section 6, Hazard Review, of this RMP. The GGS uses the action item tables developed for the HR to track progress and timely closure of action items from technical studies. The GGS also reports the number of recommended action items, the number of action items completed, and the number of action items in progress. Eighteen items were recommended for follow-up as a result of the most recent HR; GGS is in the process of determining and implementing resolutions to each of these recommended action items, as discussed with CCHS during a September 2020 audit.\r\n\r\nIn assessing action items/planned activities for resolution, GGS prioritizes their implementation by applying the policy of protecting firstly the personnel, secondly the environment, and thirdly the properties."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000092481,
      "SummaryText": "quirements. The aqueous ammonia process is a Program 2 process.\r\n\r\n1.4\tSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n\r\nManagement System\r\n\r\nRisk Management Program and CalARP Program regulations require those facilities with processes subject to Program 2 to develop a management system to oversee the implementation of the program elements. The management system has to be assigned to a qualified person or position that has the overall responsibility for the development, implementation, and integration of the RMP. PG&E has assigned the Plant Manager as the qualified person who has the overall responsibility for the development, implementation, and integration of the RMP. The Plant Manager is assisted by the Operations Supervisor, Plant Engineer, Maintenance Supervisor, and Environmental Compliance Manager in the implementation of the RMP.\r\n\r\nIn addition to the management system, the RMP and changes to it are communicated by supervisors to staff through normal day-to-day interactions, refresher training, and regular safety meetings. The Plant Manager, Plant Engineer, Operations Supervisor, Maintenance Supervisor, and Environmental Compliance Manager are the primary staff responsible for various elements of the RMP. Changes to the aqueous ammonia process are managed, reviewed, and communicated through the process modification procedures.\r\n\r\nChemical-Specific Prevention Steps\r\n\r\nThe prevention program elements described in the following section represent integrated administrative controls intended to ensure the safety of workers, the public, and the environment. The program elements such as HRs, compliance audits, and incident investigations result in the development of additional safeguards. In addition, this facility is staffed 24 hours per day, 365 days per year. Some of the safety features of the ammonia process are described below. Unless otherwise noted, the safeguards listed below have been installed as part of the or"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000092481,
      "SummaryText": "iginal installation of the aqueous ammonia process.\r\n\r\nAqueous Ammonia Process\r\n\r\nThe aqueous ammonia storage tanks are enclosed within a walled containment basin that slopes to a centrally located, covered sump beneath the tanks that runs the length of the containment area. There is a walled containment pad under the tanker truck unloading facility that drains into the covered sump under the tanks.\r\n\r\nStandby power needed for electrical systems, such as monitors and alarms, is provided by the Uninterruptible Power Supply System. Other safety features of the aqueous ammonia storage and unloading facility include:\r\n\r\n-\tAmmonia area monitoring system with audible and visible alarms, which monitor for ammonia releases\r\n-\tEyewash and shower station in case of worker exposure to ammonia\r\n-\tPiping and connections for wash-down of containment basin with clean water\r\n-\tPermanent lighting to allow for safe working conditions during low-light conditions\r\n-\tLightning protection to prevent damage from lightning\r\n-\tTruck barrier posts to protect ammonia tanks and delivery lines from vehicle damage\r\n-\tLiquid level indication and high-level alarm for each tank, easily visible from the unloading position\r\n-\tTank level and pressure indicators and pressure relief valves and alarms in the plant Control Room\r\n>\tThe indicators allow for monitoring of pressure and ammonia level in various vessels and prevent over-pressurization and overfilling.\r\n>\tThe pressure relief valves are designed to release excess pressure, preventing a catastrophic failure of the vessels.\r\n-\tShut-off valves located on the tank fill lines, which automatically close if the emergency high-level alarm is triggered\r\n-\tLocal manual controls for all pumps to allow operators to shut down\r\n-\tVacuum breaker valves on each tank to prevent backflow into the tank\r\n\r\nSafety equipment (for two personnel) includes: two rescue breathers, face shields, non-vented chemical goggles, two pairs of ammonia-resistant gloves, two pairs o"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000092481,
      "SummaryText": "f ammonia-resistant hoods, two pairs of ammonia-resistant pants and jacket/slicker, one first aid kit, and one fire extinguisher.\r\n\r\nArea sensors are located in the ammonia unloading and storage facility and injection skid to monitor for ambient ammonia concentrations. Alarms are designed to warn staff of ammonia releases and annunciate in the Control Room with local audible sound.\r\n\r\nPrevention Program Elements\r\n\r\nThe GGS accidental release prevention program is based on the following key elements:\r\n-\tDetailed management system and clear levels of responsibilities and team member roles\r\n-\tComprehensive safety process information that is readily available to staff, emergency responders, and contractors\r\n-\tComprehensive preventive maintenance (PM) program\r\n-\tA HR of equipment and procedures with operations and maintenance (O&M) staff participation\r\n-\tUse of state-of-the-art process and safety equipment\r\n-\tUse of accurate and effective operating procedures, written with O&M staff participation\r\n-\tHigh level of training of O&M staff\r\n-\tImplementation of an incident investigation, inspection, and auditing program using qualified staff\r\n\r\nFor the aqueous ammonia process, the prevention program contains the following elements: \r\n\r\nSafety Information \r\nHazard Review \r\nOperating Procedures \r\nTraining\r\nMaintenance \r\nCompliance Audits \r\nIncident Investigation\r\n\r\n1.5\tFive-Year Accident History Summary\r\n\r\nThe Risk Management Program and CalARP Program regulations require reporting the five-year accident history of the covered process. The details of accidental releases are required for accidents that have caused at least one of the following:\r\n\r\n-\tOnsite deaths, injuries, or significant property damage\r\n-\tKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place\r\n\r\nThere have been no accidents involving aqueous ammonia at the GGS in the last five years.\r\n\r\n1.6\tEmergency Response Program Summary\r\n\r\nGGS has established a written em"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000092481,
      "SummaryText": "ergency action program that is followed by the employees to help safely control accidental releases of hazardous substances. Risk Management Program regulations require that an Emergency Action Plan be prepared for facilities that are not responding facilities. The plan must be prepared in accordance with the provisions of 8 CCR Section 3220. The Emergency Action Plan described in this section is for facilities with employees who are not responders to emergency situations. \r\n\r\nGGS's Emergency Action Plan is submitted with the revised CalARP RMP to Contra Costa Health Services (CCHS) for review and comment to ensure that it is consistent with the Contra Costa County Emergency Response Area Plan. Changes to this plan, including updated emergency contact information, are otherwise coordinated with CCHS and the Contra Costa County Fire Protection District at least once per year. The names and contact information of individuals involved in the coordination activities, as well as the date and a description of coordination activities, are documented.\r\n\r\nThe Contra Costa Hazardous Materials Programs (CCHMP) Incident Response Team is the designated primary response agency for the GGS. PG&E has ongoing emergency response coordination activities with the following agencies:\r\n-\tCCHMP\r\n-\tContra Costa County Fire Protection District\r\n-\tContra Costa County Sheriff's Department\r\n-\tSutter Delta Medical Center\r\n\r\nPG&E has a signed agreement with Sutter Delta Medical Center and Contra Costa County Fire Protection District to receive customary and appropriate emergency assistance in the event of emergency.\r\n\r\nPG&E conducted an ammonia release response drill with the Contra Costa County Fire Protection District, CCHMP, Airgas, and neighboring facility (NRG) on December 14, 2010. PG&E also conducted a Table Top Ammonia Emergency Response Exercise with CCHS on December 3, 2014. Beginning in 2024, GGS will also begin conducting annual exercises of its emergency notification procedures."
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000092481,
      "SummaryText": "GGS maintains a calling tree, as indicated in the GGS Emergency Action Plan, to report incidents to plant personnel and agencies.\r\n\r\nPlant personnel:\r\n\r\n-\tFacility Emergency Coordinator (Plant Manager) \r\n\r\nWork Telephone: 925-522-7812\r\n\r\n24-Hour Telephone: 925-200-4811\r\n-\tGGS Control Room\r\n        Land Line: 925-522-7826\r\n        Cell Phone: 925-206-5520\r\n\r\nAgencies:\r\n-\tEmergency (police, fire, and ambulance): 9-1-1\r\n-\tHospital (Sutter Delta Medical Center): 925-779-7200\r\n-\tPolice (Non-emergency): 925-778-2441\r\n-\tFire Department (Non-emergency, Contra Costa Fire Protection District): 925-941-3300\r\n-\tEmergency Spill Response/Cleanup (Contra Costa Health Services): \r\n        24-Hour Hot Line: 925-335-3232\r\n        Normal Business Line: 925-335-3200\r\n\r\nThe Plant Manager shall be responsible for implementing the Emergency Action Plan, and for reviewing and updating the program at least every three years. The Plant Manager is also responsible for maintaining up-to-date emergency contact information. The Environmental Compliance Manager shall be responsible for scheduling and coordinating training of the personnel according to the requirements of the Emergency Action Plan. The Plant Manager can provide additional information regarding the contents of the Emergency Action Plan.\r\nThe Plant Manager is responsible for the safety and security of all plant personnel, contractors, visitors, and equipment. The Plant Manager is also responsible for reviewing and approving the Emergency Action Plan.\r\n\r\n1.7\tPlanned Changes to Improve Safety\r\n\r\nA number of studies and inspections have been conducted to improve the safety of the aqueous ammonia process at the GGS. The most recent HR of the aqueous ammonia process was conducted in October 2017. A seismic assessment was also conducted in October 2017.\r\n\r\nDuring these studies and inspections, no risk reduction measures were recommended because existing safeguards were thought to adequately mitigate risk associated with potential accident"
    }
  ]
}