{
  "FacilityID": 1000013562,
  "FacilityName": "Enterprise Kutz Terminal & Storage",
  "FacilityStr1": "#55 CR 4980",
  "FacilityStr2": null,
  "FacilityCity": "Bloomfield",
  "FacilityState": "NM",
  "FacilityZipCode": "87413",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35045",
  "LEPC": "San Juan LEPC",
  "FacilityLatDecDegs": "36.682986",
  "FacilityLongDecDegs": "-107.980471",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "LF",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 48210686,
  "ParentCompanyName": "Enterprise Terminals and Storage, LLC",
  "Company2Name": "Mapletree, LLC",
  "CompanyDUNS": 49563984,
  "Company2DUNS": 49563984,
  "OperatorName": "Enterprise Products Operating LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000191954",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-05-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-05-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-05-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-11-25 00:00:00",
  "DeRegistrationEffectiveDate": "2020-11-17 00:00:00",
  "AnniversaryDate": "2015-05-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016811,
      "AltID": "Y-Grade Storage Tank",
      "FacilityID": 1000013562,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019995,
          "ProcessID": 1000016811,
          "ChemicalID": 155,
          "Quantity": 360288.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 98872,
              "ProcessChemicalID": 1000019995,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 98873,
              "ProcessChemicalID": 1000019995,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 98874,
              "ProcessChemicalID": 1000019995,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 98875,
              "ProcessChemicalID": 1000019995,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 98876,
              "ProcessChemicalID": 1000019995,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 98877,
              "ProcessChemicalID": 1000019995,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 98878,
              "ProcessChemicalID": 1000019995,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000017193,
          "ProcessID": 1000016811,
          "NAICSCode": "48699",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000013878,
              "Process_NAICS_ID": 1000017193,
              "SafetyReviewDate": "2009-06-22 00:00:00",
              "PHA_Date": "2007-01-30 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-08-30 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Maintenance flare knockout drum",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Disconnect carbon steel blowdown piping,; New relief valve being installed",
              "OpProceduresReviewDate": "2009-05-12 00:00:00",
              "TrainingReviewDate": "2009-05-11 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Safety meetngs, Computer based training. (CBT)",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "Computer based testing.",
              "MaintenanceReviewDate": "2009-05-11 00:00:00",
              "EquipmentInspectionDate": "2010-04-16 00:00:00",
              "EquipmentTested": "Facility relief valves and control valves",
              "ChangeMgmtDate": "2010-04-16 00:00:00",
              "ChangeMgmtReviewDate": "2010-03-09 00:00:00",
              "PreStartupReviewDate": "1999-11-15 00:00:00",
              "ComplianceAuditDate": "2009-05-11 00:00:00",
              "AuditCompletionDate": "2009-08-13 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-05-11 00:00:00",
              "HotWorkPermitReviewDate": "2007-03-01 00:00:00",
              "ContractorSafetyReviewDate": "2009-12-15 00:00:00",
              "ContractorSafetyEvalDate": "1997-03-19 00:00:00",
              "CBI_Flag": 0,
              "Description": "Mixed LPG unloading Storage and Terminal",
              "_chemicals": [
                {
                  "PrimaryKey": 1000016642,
                  "PreventionProgram3ID": 1000013878,
                  "ProcessChemicalID": 1000019995
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000013562,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-06-01 00:00:00",
    "ERTrainingDate": "2009-07-28 00:00:00",
    "CoordinatingAgencyName": "San Juan County Emergency Managemen",
    "CoordinatingAgencyPhone": "5053346622",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013562,
      "SummaryText": "Environmental Protection Agency Risk Management Plan\nEnterprise Kutz Terminal & Storage\nRisk Management Plan (RMP)\nExecutive Summary\n\nAt the Enterprise Kutz Terminal and Storage, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.\n\nThe Enterprise Kutz Terminal and Storage is owned by Enterprise Terminals & Storage, LLC, a wholly-owned subsidiary of Mapletree, LLC and operated by Enterprise Products Operating,LLC.  We use a combination of accidental release prevention programs and emergency response planning programs to help provide for the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n* A description of our facility and use of substances required by EPA's RMP regulation and the processes involved\n* A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n* Emergency Response Programs\n* General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n* A five-year accident history for accidental releases of chemicals at the Kutz Terminal that are regulated by EPAA?s RMP rule.  \n\nFacility Description\n\nThe Kutz Terminal is a natural gas liquid (NGL) pipeline system, mixed NGL storage and unloading facility.  The tank storage facility is covered by Federal Regulation 40 CFR Part 68.   We have entered the facility as an RMP Program Level 3 facility due to the presence of receptors within the facility's estimated worst case scenario distance.\n\nThe Kutz Terminal has a single Department of Transportation regulated pipeline that is "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013562,
      "SummaryText": "routed from the storage tank at the facility and injects into the mixed NGL pipeline.  This pipeline contains mixed NGL (natural gasoline, normal butane, iso-butane, propane and ethane).  The Kutz storage tank is a single pressure vessel that receives mixed NGL from the transport truck unloading docks.  This tank is used as a holding tank for injection into the mixed NGL pipeline.  The tank level is administratively controlled to hold and not exceed 90% of its capacity.\n\nIn our process we use the following hazardous materials that the EPA has identified as having the potential to cause significant offsite consequence in the event of a substantial accidental release:\n\nToxics\n\nNo toxic materials to report.\n\nFlammables\n\nMixed NGL is received from transport trucks and is delivered into the storage tank.  This material from the tank is pumped into the mixed NGL product pipeline for distribution.\n\nKey Offsite Consequence Analysis Scenarios\n\nThe EPA's RMP rule requires that we provide information about the worst-case scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario.\n\nWorst Case Release Scenario - Regulated Toxic Chemical\n\nThere are no regulated toxic chemicals to report for the Hobbs Terminal.\n\nAlternate Release Scenario(s) - Regulated Toxic Chemical\n\nThere are no regulated toxic chemicals to report for the Hobbs Terminal.\n\nWorse Case Scenario - Regulated Flammable Chemicals\n\nThis simulation involves the rupture or failure of the storage tank resulting in a simulated vapor cloud explosion.  The entire inventory of the tank is used in the simulation, which assumes there would be no mitigation.  All emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to occur.  The quantity and endpoint of the si"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013562,
      "SummaryText": "mulation and the specifics of the simulation are available in the specified reporting of the Risk Management Plan\n\nAlternate Case Scenario - Regulated Flammable Chemicals\n\nThe alternate release scenario is a simulated rupture of the mixed NGL supply pipe from the loading docks resulting in a ten minute release and simulated vapor cloud explosion.  This scenario assumed the pump continued to operate at its normal flow rate for 10 minutes after the line break.  Mitigation measures were taken into account when selecting the alternative release scenario.  These measures consisted of reviewing the use of relief valves, check valves, manual shutoff valves, automatic shutoffs, startup and operating procedures, grounding equipment, hazardous gas monitors and excess flow devices.  Activation of the Emergency Shutdown Devices would isolate the source of the material and secure the facility.  All emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to occur.  The quantity and endpoint of the simulation is contained in the data elements.\n\nWe are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.\n\nEmergency Response Program\n\nEnterprise maintains an Integrated Contingency Plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning and reporting.  The program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, the plan is coordinated with the New Mexico State Police, District 10, which includes the San Juan County SheriffA?s Department, the local Bloomfield Police department, Fire Department, and Emergency Medical Service.\n\nIn the event of an accidental release, local Enterprise personnel are trained to sound the alarm, shut off the "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013562,
      "SummaryText": "source from a safe location or activate the emergency shutdown system, contact Enterprise Operations Control and secure the area.  Enterprise Operations Control in turn notifies San Juan Emergency Management, the New Mexico State Police and local Fire Departments.  Remote activation can also be accomplished from the Operations Control center which is based in Houston, Texas.  In addition, there are local gas detection systems that alarm locally and in Houston Control.  If these detectors annunciate, the facility can be shutdown remotely from Houston Control or locally by operations personnel.    \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nEnterprise takes a systematic, protective approach to preventing accidental release of hazardous chemicals.  Our Process Safety Management systems address each of the key features of successful prevention program, including:\n\n* Process safety information\n* Process hazard analysis\n* Operating procedures\n* Training\n* Mechanical integrity\n* Management of change\n* Pre-Startup Safety Review - \"PSSR\"\n* Compliance audits\n* Incident investigation\n* Employee participation\n* Hot work permit\n* Contractors\n\nAs a part of the prevention efforts, there are several programs in which Enterprise employees participate.  A training program has been developed in which Operations and Maintenance personnel are specifically trained in the operation of the facility, the operating procedures, maintenance procedures, and specific other regulations and policies, as well as in all areas of emergency response.  Employees are trained on, use, and apply the guidelines also used in our PSM program, which include all of the above-listed issues.  All of these programs come under scheduled scrutiny and critique.\n\nThere is an on-going inspection program designed to detect any deficiencies with the process equipment prior to any incident.\n\nOperations personnel make regular inspections of the equipment and processes they opera"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000013562,
      "SummaryText": "te.  If something out of the ordinary is found, it is reported to management in order to expediently resolve any problems.\n\nThe engineering and administrative controls in place have been established to reduce the risk of an accidental release of identified hazards.  Enterprise is committed to operations that are safe for employees and the surrounding community.\n\nAccident History\n\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\n\nBased on the criteria set forth in 40 CFR 68.10, this facility has not had an accidental release.\n\nPlanned Changes to Improve Safety\n\nThe following is a list of reviews and/or improvements that are planned for implementation at the facility to help prevent and/or better respond to accidental hazardous material releases:\n\n* The written PSM management system is presently undergoing a complete review to provide an updated program which complies with the requirements of the PSM Standard and can be fully implemented at the diverse number of facilities in the Enterprise partnership.  \n* The Kutz Terminal is currently installing a larger relief valve on the maintenance flare knockout drum."
    }
  ]
}