{
  "FacilityID": 1000067520,
  "FacilityName": "Alon Bakersfield Refining - Areas 1&2",
  "FacilityStr1": "6451 Rosedale Highway",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93308",
  "Facility4DigitZipExt": "1132",
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.382500",
  "FacilityLongDecDegs": "-119.070556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.alonusa.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 45267002,
  "ParentCompanyName": "Delek US Holdings, Inc.",
  "Company2Name": "Alon USA Energy, Inc",
  "CompanyDUNS": 876661062,
  "Company2DUNS": 0,
  "OperatorName": "Alon Bakersfield Refinery",
  "OperatorStr1": "6451 Rosedale Highway",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93308",
  "OperatorZipCodeExt": "1132",
  "RMPContact": "Mark Denis",
  "RMPTitle": "General Manager",
  "FTE": 17,
  "OtherEPAFacilityID": "93308TXCRF6451R",
  "EPAFacilityID": "100000147815",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "S-33",
  "SafetyInspectionDate": "2017-04-01 00:00:00",
  "SafetyInspectionBy": "CUPA/ Kern county",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Federal RMP 4/23/07",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-02-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-02-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-02-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-09-10 00:00:00",
  "DeRegistrationEffectiveDate": "2020-08-27 00:00:00",
  "AnniversaryDate": "2023-02-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 35.38306,
  "FRS_Long": -119.07323,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000084716,
      "AltID": "Unit 81-2 Boilers",
      "FacilityID": 1000067520,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000085898,
          "ProcessID": 1000084716,
          "NAICSCode": "32411",
          "_desc": {
            "NAICS_CODE": "32411",
            "NAICS_DESCRIPTION": "Petroleum Refineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000105707,
          "ProcessID": 1000084716,
          "ChemicalID": 56,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000605707,
          "ProcessID": 1000084716,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067520,
      "SummaryText": "Risk Management Plan\n\n\n\nAlon Bakersfield Property, Inc. doing business as Alon Bakersfield Refining\n\nBakersfield Refinery, Areas 1 and 2\n\n\n\nExecutive Summary\n\n\n\nThis is the risk management plan (RMP) for Areas 1 and 2 of Alon Bakersfield Refining (ABR) facility (EPA Facility ID 1000 0014 7815).  The RMP is required under the U.S. Environmental Protection Agency (EPA) risk management program codified in 40 Code of Federal Regulations, Part 68 (40 CFR 68).  Refining operations are temporarily suspended, but are primarily conducted in Areas 1 and 2, which are on contiguous properties. A separate RMP submittal has been prepared for Area 3.\n\n\n\nThe RMP for Areas 1 and 2 was last fully updated and re-submitted in January 2018.  Certain equipment in Areas 1 and 2 was de-inventoried and has been temporarily suspended prior to the latest RMP update and does not currently contain any RMP-regulated substances. \n\n\n\nThe purpose of the risk management program is to identify and prevent potential accidental releases of specific \"regulated substances\" that have the potential to cause harm to the public and the environment.  \"Regulated substances\" are hazardous chemicals identified by EPA.  ABR has quantities of various \"regulated substances\" above the threshold amounts.  \n\n\n\nThe remainder of the Executive Summary is organized as follows:\n\n\n\nSection 1: Accidental Release Prevention and Emergency Response Policies at ABR\n\nSection 2: Overview of Regulated Substances at ABR\n\nSection 3: Worst-case Release Scenarios and Alternative Release Scenarios\n\nSection 4: ABR Accidental Release Prevention Program\n\nSection 5: Five-year Accidental Release Summary\n\nSection 6: Emergency Response Program\n\nSection 7: Planned Changes to Improve Safety\n\n\n\n\n\nSection 1:  Accidental Release Prevention and Emergency Response Policies at ABR\n\n\n\nEquipment at the various units must be designed, operated, and maintained in full compliance with applicable internal engineering standards, accepted industry codes, or i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067520,
      "SummaryText": "ndustry standards.  Systems and procedures are in place to control changes in process technology, facilities, operating procedures, and maintenance procedures, in order to provide for continued safe and reliable operations.\n\n\n\nAll employees at ABR have the responsibility to protect the environment and to ensure the safety and security of his/her fellow workers.  Written policies and standards are in place to ensure:  \n\n\n\n* The safety and health of employees and other workers at the site;\n\n* Protection of the environment;\n\n* Reliable and efficient operation of the facilities;\n\n* Minimization of the risk of product or property losses; and\n\n* Maintaining a positive relationship with the communities adjacent to our facility.  \n\n\n\nThese written policies and standards are discussed further elsewhere in this submittal.\n\n\n\n\n\nSection 2:  Overview of Regulated Substances at ABR Areas 1 and 2\n\n\n\nABR began operations as Mohawk Petroleum in 1932.  Under different owners, regular expansion and improvements of facilities have occurred over the years, including the integration of an adjacent refinery in 1986 that doubled gasoline production.  In 1998, the refinery became a part of Equilon Enterprises, LLC, a joint venture of Shell Oil Company and Texaco Inc.  Shell Oil Products US acquired Texaco's interest in 2002.  On March 16, 2005 Big West of California, LLC acquired interest in the refinery.  Alon Bakersfield Property, Inc. took over the site in 2010.  Several units previously reported in 2012 Risk Management Plan submittal to the U.S. EPA have been de-inventoried, or the inventories have been reduced.  \n\n\n\n\n\nSummary of Covered Process Units below lists the covered process units that are subject to the federal risk management program, defines the appropriate RMP program level, and identifies the regulated substances handled in these units.\n\n\n\n\n\nSummary of Covered Process Units - ABR Areas 1 and 2\n\n\n\nUnit: Steam Systems/Boilers: Boilers (Unit 81-2)\n\nGenerate steam that is distr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067520,
      "SummaryText": "ibuted to refinery units.  Flue gases generated from boiler 81-H9 are treated in an SCR system for Nox/CO removal.\n\nFederal RMP Program Level: Level 3\n\nRegulated Toxic Substances: Ammonia (anhydrous)\n\nRegulated Flammable Substances: None \n\n\n\n\n\nSection 3:  Worst-case Release Scenarios and Alternative Release Scenarios\n\n\n\nOff site consequence analyses are essential in identifying potential hazards of accidental releases.  The results of the analyses are used to assist the Kern County Environmental Health Services Department and Fire Department in their emergency response planning.\n\n\n\n3.1  Worst-case Scenarios\n\n\n\nABR conducted offsite consequence analyses for the worst-case scenarios (WCS) using EPA's \"RMP Offsite Consequence Analysis Guidelines\" (OCAG).  This methodology was used because the RMP rule set forth specific criteria that must be followed for modeling the worst-case scenarios.  The worst-case scenarios must incorporate very conservative, simplified assumptions about the nature of the releases and the resulting emission rates into the air.\n\n\n\nA worst-case release scenario is defined as the scenario that results in the greatest distance from the point of release to a specified \"endpoint.\"  As defined by the rule, the endpoint for toxics substances is a specified concentration, and for flammables is a specified overpressure from a vapor cloud explosion (VCE).  \n\n\n\nThe WCS for a regulated toxic is one where the total quantity in the largest vessel or pipe is released over 10 minutes, resulting in acute health effects associated with airborne exposure.  For a regulated flammable, the WCS is one where the total quantity of regulated flammables in the largest vessel or pipe is assumed to vaporize and instantaneously result in a VCE.\n\n\n\nA summary of the WCS for ABR Areas 1 and 2 is provided below.  As required by the RMP rule, the results are shown for one vessel containing a toxic substance (anhydrous ammonia). These scenarios produced the greatest distance to the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000067520,
      "SummaryText": "ir respective toxic and flammable endpoints.\n\n\n\nSummary of Worst-case Scenario Results - ABR Areas 1 and 2\n\n\n\nToxic WCS\n\nRegulated Substance: Ammonia, anhydrous (toxic gas)\n\nArea/Unit: Unit 81-2 Area 2 Steam Systems/ Boilers (SCR Anhydrous Ammonia Storage Tank at Boiler 81H09)\n\nAdministrative Controls Considered: Quantity stored limited to 85% of capacity by written operating procedures\n\nPassive Mitigation Considered: None\n\nOff Site Impacts: Yes\n\n\n\n3.2  Alternative Release Scenarios\n\n\n\nIn addition to the WCS, this RMP contains a second set of release scenarios designated as alternative release scenarios (ARS).  These scenarios are more realistic than the WCS for assessing the potential hazards posed by process units and developing emergency response plans.  Although these scenarios may be unlikely to occur, they are physically possible and reasonably feasible.  \n\n\n\nABR conducted offsite consequence analyses for the ARS using EPA's RMP OCAG.  \n\n\n\nA summary of the ARS for ABR Areas 1 and 2 is provided below.  There is one scenario for each toxic substance.\n\n\n\nSummary of Alternative Release Scenario Results - ABR Areas 1 and 2\n\n\n\nToxic ARS 1\n\nRegulated Substance: Ammonia, anhydrous (toxic gas)\n\nArea/Unit: Unit 81-2 Area 2 Steam Systems/ Boilers (SCR Anhydrous Ammonia Storage Tank at Boiler 81H09)\n\nAdministrative Controls Considered: Quantity stored limited to 85% of capacity by written operating procedures\n\nPassive Mitigation Considered: None\n\nOff Site Impacts: Yes\n\nRelease duration: 10 minutes\n\n\n\n\n\nSection 4:  ABR Accidental Release Prevention Program\n\n\n\nThis section describes the general accident prevention programs in place at ABR.  This program is required for all level 3 covered process units described in Section 2, Table 1, and are applied throughout the facility.\n\n\n\nEmployees are responsible for implementing the prevention elements for his/her department as follows:\n\n\n\nProcess Safety Information: Engineering, Safety, and Inspections\n\nProcess Hazards Analysis: PS"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000067520,
      "SummaryText": "M, Engineering, and Operations\n\nOperating Procedures: Operations\n\nTraining: Operations\n\nContractors: Procurement, Safety, and Maintenance\n\nPre-startup Safety Review: Operations and Engineering\n\nMechanical Integrity: Maintenance\n\nHot Work Permit: Operations\n\nManagement of Change: Project/Process Engineering, Management, Operations, PSM, Safety, Maintenance, Environmental, and Inspections\n\nIncident Investigation: Safety, Environmental, and PSM\n\nEmergency Planning and Response: Safety\n\nInjury Illness Prevention Program: Safety\n\nEmployee Participation Program: PSM\n\n\n\nAll records associated with the prevention elements and the risk management program are retained for a minimum of 5 years.\n\n\n\n4.1  Process Safety Information\n\n\n\nABR maintains a variety of technical documents that are used to help ensure safe operations of the process units.  Process safety information (PSI), which addresses chemical properties and associated hazards, limits for key process parameters, limits for specific chemical inventories, and equipment design information, was compiled for each process unit.\n\n\n\nPSI is used in process unit hazard analyses, inspection, maintenance, and training activities.  This information is kept current by management of change and pre-startup safety review procedures, which are discussed further in this section.\n\n\n\nThis information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\n\n4.2  Process Hazards Analysis\n\n\n\nABR conducts process hazards analyses (PHAs) to ensure that hazards associated with process units are identified and controlled.  Under this program, each process is systematically examined by a multi-disciplinary team to identify hazards that could result in an accidental release of a regulated substance and to ensure that adequate control is i"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000067520,
      "SummaryText": "n place to manage those hazards.  ABR has used the hazard and operability study methodology as the refinery's primary PHA technique.  Pertinent parameters, such as flow, temperature, pressure, and liquid level, were reviewed.\n\n\n\nIn order to help ensure that the process controls or process hazards do not deviate significantly from the original design safety features, ABR updates and revalidates the hazard analyses every 5 years.  \n\n\n\nA seismic review of the refinery was conducted as part of the technical studies.  The refinery is located in an area that is prone to earthquakes.  A site walkthrough was conducted in 1996 by a qualified engineering company for Shell, the previous owner.  The objective of seismic assessments was to provide reasonable assurance that a release of regulated substance having offsite consequences would not occur as a result of a major earthquake.  The results and findings from the seismic review are documented and retained in the computerized tracking system.\n\n\n\n4.3  Operating Procedures\n\n\n\nABR has developed and implemented written operating procedures that provide clear instructions for safely conducting activities involved in each process.  The written operating procedures address the various modes of process operations, such as unit startup, normal operations, temporary operations, emergency shutdown, normal shutdown, and initial startup of a new process.\n\n\n\nThese procedures are used as references by experienced operators and for consistent training of new operators.  The procedures are maintained current and accurate by revising them to reflect changes made through the management of change process and through annual certification.\n\n\n\n4.4  Training\n\n\n\nABR's general policy requires operating personnel to be trained in the safe operation of facilities, handling process upsets, emergency response, and personal safety.  Employees who understand the process and how to safely operate a process can significantly decrease the number and severity o"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000067520,
      "SummaryText": "f incidents.  \n\n\n\nRefresher training for all operations and maintenance employees in Safety, Health, and Environmental subjects and operating procedures (as appropriate) is provided at varying intervals, depending upon requirements. \n\n\n\n4.5  Management of Change\n\n\n\nA management of change (MOC) review is required for modifications to facilities or changes to process unit operating conditions.  The procedure does not apply to \"replacement in kind,\" which is defined as replacements that satisfy the design specifications and are functionally identical to the item being replaced.\n\n\n\nThe MOC process is intended to assess the impact of proposed changes on process safety, the environment, operability, reliability, and product quality in process units.  The requirements for MOC are documented in a written procedure.  MOC information is kept for the life of the process unit.\n\n\n\n4.6  Pre-startup Safety Reviews\n\n\n\nThe purpose of the pre-startup safety review is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides additional assurance that construction is in accordance with the design specifications and that all systems are operationally ready.  The pre-startup safety review also verifies that accident prevention program requirements are properly implemented.\n\n\n\nPre-startup reviews are governed by a written pre-startup safety review procedure and cover a variety of issues, including:\n\n\n\n* Construction and/or equipment are in accordance with design specifications;\n\n* Safety, operating, maintenance, and emergency procedures are in place and are adequate;\n\n* For new facilities, a process hazard analysis has been performed and recommendations have been resolved or implemented before startup;\n\n* Modified facilities have complied with MOC requirements, including updating the PSI (e.g., piping instrument diagrams, operating procedures); and\n\n* Training of each appli"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000067520,
      "SummaryText": "cable operating employee and maintenance worker has been completed.\n\n\n\n4.7  Mechanical Integrity\n\n\n\nABR has established and implemented written procedures to maintain the ongoing integrity of process equipment, pressure vessels and storage tanks, relief and vent systems and devices, emergency shutdown systems, and controls.\n\n\n\nThe ABR mechanical integrity program follows recognized and generally accepted good engineering practices.  ABR maintains a certification record that each inspection and test has been performed, which includes the date of the inspection, the name of the inspector and test, and the serial number or other identifier of the equipment.  Every recommendation made by an inspector is resolved and documented.  In so doing, ABR will correct deficiencies in equipment that are outside acceptable limits (as defined by the PSI) before further use, or in a safe and timely manner that ensures safe operation.\n\n\n\n4.8  Compliance Audits\n\n\n\nTo ensure that the accident prevention program is functioning properly, ABR conducts audits every 3 years to ensure that the accident prevention program is being implemented.  The audits include an assessment of written prevention program elements, retained records (e.g., training records, completed hot work permits), and personnel interviews to assess level of implementation for the prevention program.\n\n\n\nCompliance reviews are performed by trained, expert personnel.  Action items or recommendation resulting from the various audits are tracked to completion through a computerized database.\n\n\n\n4.9  Incident Investigation\n\n\n\nThe ABR accident investigation program covers four types of incidents:\n\n\n\n* Personal injury;\n\n* Environmental release; \n\n* Equipment damage and loss of production caused by fire, equipment failure, or other circumstance; and\n\n* Those incidents that could have reasonably resulted in a catastrophic event.\n\n\n\nThe goal of an investigation is to determine the facts associated with a release or near miss and to "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000067520,
      "SummaryText": "develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team is directed by a team leader who has had training in incident investigation. \n\n\n\nThe results of the investigation are communicated to all employees. Corrective measures and action items resulting from an investigation are tracked to completion in a computerized database.\n\n\n\n4.10 Employee Participation\n\n\n\nAll ABR employees have the right to participate in the development and conduct of PSM activities as stated in the risk management and PSM regulations.  It is the policy and practice of ABR to encourage employee participation in all aspects of accidental release prevention elements. \n\n\n\n4.11 Safe Work Practices\n\n\n\nABR safe work practices include hot work, confined space entry, lockout/tagout, line entry, and various other types of work covered under a Departmental Safety Permit.  \n\n\n\nThe ABR hot work permit certifies that the various portions of fire prevention and protection requirements have been implemented prior to beginning hot work operations.  This procedure documents the date(s) authorized for hot work, identifies the equipment on which hot work is to be done, and ensures that all personnel involved in permitting are trained on this procedure. \n\n\n\n4.12 Contractors\n\n\n\nContractors at ABR are selected based on their past safety performance, their current safety programs, and their conformance to the \"ABR Refinery Safety Rules and Regulations Manual\".\n\n\n\nThe \"ABR Refinery Safety Rules and Regulations Manual\" provides contractor employees safety information, including entrance and exit procedures, safe work practices and work permitting procedures, emergency action plans, PSI, and contractor injury/illness reporting.  \n\n\n\nABR also requires annual contractor orientation training, which includes information on the emergency action plan, potential process hazards, and site safety rules.  Proof of training is provided via renewable access cards.\n\n\n\n\n\nSecti"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000067520,
      "SummaryText": "on 5:  Five-year Accidental Release Summary\n\n\n\nABR compiled a 5-year accident history for accidental releases from covered processes in Areas 1 and 2 that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.  The compilation of this information satisfy the requirements of the federal risk management program and EPA's implementing regulations (40 Code of Federal Regulations, Part 68).\n\n\n\nThe 5-year accident history provides an explanation of the factors that caused the accident, the on- and offsite impacts of the accident, and the changes made by ABR to minimize the likelihood that these accidents will occur again.\n\n\n\nNo reportable accidents occurred at the ABR in the five-year period preceding this resubmission of the RMP.\n\n\n\n\n\nSection 6:  Emergency Response Program\n\n\n\nABR has established a comprehensive emergency response program.  The purpose of the program is to protect workers, the public, and the environment from harm due to refinery emergencies.  The program includes procedures to provide for comprehensive emergency response through the following:\n\n\n\n* First aid and medical treatment\n\n* Emergency incidents, including fire, potential fire, hazardous materials releases, and natural disasters such as floods, winds, earthquakes, and electrical storms\n\n* Emergency evacuation and rescue\n\n* Notification of local, state and federal emergency response agencies and the public if an incident occurs\n\n* Post-incident cleanup and decontamination\n\n\n\nThe emergency response program provides training of all refinery staff, which varies in level of detail based on assigned roles and responsibilities for staff under the program.  Routine audits are routinely performed by ABR staff and third parties (the Kern County Fire Department and ABR's insurance company) to ensure compliance with portions or the entire emergency response program.\n\n\n\n\n\nSection 7:  Pla"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000067520,
      "SummaryText": "nned Changes to Improve Safety\n\n\n\nABR has a comprehensive hazard identification and mitigation program to ensure process safety.  This program includes periodic PHAs, investigations of near misses, and audits of processing units.  Management is notified of deficiencies or potential hazards, and a mitigation plan is developed.\n\n\n\nCurrent plans to improve safety include installation of more reliable process controls and process area detection systems.\n\n"
    }
  ]
}