{
  "FacilityID": 1000105204,
  "FacilityName": "KDC West",
  "FacilityStr1": "11009 Highway 43",
  "FacilityStr2": null,
  "FacilityCity": "Delano",
  "FacilityState": "CA",
  "FacilityZipCode": "93215",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": null,
  "FacilityLatDecDegs": "35.755056",
  "FacilityLongDecDegs": "-119.343047",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "KDC West",
  "OperatorStr1": "10889 Casey Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Delano",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93215",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169747",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-08-25 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-06-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-06-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-06-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.755056,
  "FRS_Long": -119.343047,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000131331,
      "AltID": "North Refrigeration",
      "FacilityID": 1000105204,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000164653,
          "ProcessID": 1000131331,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000132765,
          "ProcessID": 1000131331,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000113160,
              "Process_NAICS_ID": 1000132765,
              "SafetyReviewDate": "2022-12-28 00:00:00",
              "PHA_Date": "2022-12-28 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2025-06-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-06-29 00:00:00",
              "TrainingReviewDate": "2022-07-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-07-11 00:00:00",
              "EquipmentInspectionDate": "2022-09-08 00:00:00",
              "EquipmentTested": "Ammonia Detection Calibration",
              "ChangeMgmtDate": "2022-09-19 00:00:00",
              "ChangeMgmtReviewDate": "2022-07-11 00:00:00",
              "PreStartupReviewDate": "2022-09-19 00:00:00",
              "ComplianceAuditDate": "2021-07-13 00:00:00",
              "AuditCompletionDate": "2023-01-13 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2022-07-11 00:00:00",
              "HotWorkPermitReviewDate": "2022-07-11 00:00:00",
              "ContractorSafetyReviewDate": "2023-03-13 00:00:00",
              "ContractorSafetyEvalDate": "2022-07-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000142059,
                  "PreventionProgram3ID": 1000113160,
                  "ProcessChemicalID": 1000164653
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000105204,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Kern County Environmental Health",
    "CoordinatingAgencyPhone": "6615499927",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000105204,
      "SummaryText": "strives to improve in all areas, including safety.\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP/PSM/CalARP Program. This has improved KDC West\u0092s ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP/PSM/CalARP related events so that KDC West\u0092s management team can ensure that the RMP/PSM/CalARP Program is being implemented.\n\nKDC West has implemented all aspects of the RMP/PSM/CalARP Program. When a RMP/PSM/CalARP Program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, KDC West has also entered into a contract with Resource Compliance to obtain help with RMP/PSM/CalARP Program implementation.\n\nKDC West considers the RMP/PSM/CalARP Program a \u0093living document\u0094. It is an interactive framework that guides safe action for KDC West employees, but allows for feedback and continual improvement. Through the RMP/PSM/CalARP Program KDC West will continue to maintain overall plant worker, public, and environmental safety."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000105204,
      "SummaryText": "ntities, the risks presented by the covered processes, and the resources and capabilities at our facility to respond to an accidental release of a regulated substance. The emergency response coordination activities will consist of the following:\nCoordinations will be completed at least annually. Additional coordinations will be made to account for changes at our facility that may affect the community emergency response plan.\nCoordinations will include KDC West\u0092s emergency response plan, updated emergency contact information, and any other information necessary for developing and implementing the local emergency response plan.\n\nCoordination activities will be appropriately documented. The coordination records will include the names of individuals involved and their contact information (phone number, email address, and organizational affiliations), dates of coordination activities, and nature of coordination activities.\n\nThe disclosure of information classified or restricted by the Department of Defense or other Federal agencies or contractors of such agencies is controlled by applicable laws, regulations, or executive orders concerning the release of that classified or restricted information.\n1.5.2 Emergency Response Notification Exercises\n\nAt least once per calendar year, KDC West will conduct an exercise of the facility\u0092s emergency response notifications mechanism. The facility will record each notification exercise utilizing PSMWriter.\n\nAlternatively, the facility may meet the notification requirements through other exercises conducted to meet other Federal, state or local requirements, provided that the necessary notification is performed. Additionally, if a notification is made in response to an accidental release, this would also satisfy the notification requirement.\n\n1.6 Planned Changes to Improve Safety\n\nKDC West has implemented many policies and procedures to promote overall plant, worker, public, and environmental safety. Nevertheless, KDC West continually"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000105204,
      "SummaryText": "n and response program has been developed to satisfy the following requirements:\nCal/OSHA\u0092s Emergency Action Plan \u0096 Title 8 CCR §3220\nU.S. Occupational Safety and Health Administration\u0092s (OSHA) Emergency Action Plans \u0096 Title 29 CFR §1910.38\nCal/OSHA\u0092s Process Safety Management [Emergency Response Program Requirements] \u0096 Title 8 CCR §5189(n)\nU.S. Occupational Safety and Health Administration\u0092s (OSHA) Process Safety Management [Emergency Planning and Response Requirements] \u0096 Title 29 CFR §1910.119(n)\nCalifornia Accidental Release Prevention (CalARP) Program [Emergency Response Program Requirements] \u0096 Title 19 CCR, Division 2, Chapter 4.5 §2765.1-2765.2\nUSEPA Risk Management Program [Emergency Response Program Requirements] \u0096 Title 40 CFR §68.90-96\nCalifornia Hazardous Materials Business Plan (HMBP) [Emergency Response Plans and Procedures] \u0096 Title 19 CCR, Division 2, Chapter 4 §2731\nCalifornia \u0093Hazardous Waste Operations and Emergency Response\u0094 (HAZWOPER) \u0096 Title 8 CCR Title 8 §5192(q)\nFederal \u0093Hazardous Waste Operations and Emergency Response\u0094 (HAZWOPER) \u0096 Title 29 CFR §1910.120(q)\n\nStrategically, KDC West has chosen to be a non-responding stationary source. Our employees will not respond to accidental releases of ammonia. In lieu of responding to accidental releases, KDC West is implementing the following protocols:\nThe facility is included in the community emergency response plan developed under Title 42 USC §11003.\nAppropriate mechanisms are in place to notify emergency responders when there is a need for a response.\nAnnual emergency response coordination activities are performed (Section 1.5.1).\nAnnual notification exercises are performed (Section 1.5.2).\n\n1.5.1 Emergency Response Coordination Activities\n\nThe purpose of emergency response coordination activities is to coordinate response needs with local emergency planning and response organizations. The intent is for local response organizations to be made aware of the regulated substances at KDC West, their qua"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000105204,
      "SummaryText": "he refrigeration machinery is contained within or directly above the machinery rooms.\n\n1.2.4 Process Classification\n\nEach ammonia refrigeration system at KDC West consists of vessels, equipment, and valves which are interconnected by piping. The systems are neither interconnected nor co-located relative to each other. As such, the refrigeration systems at KDC West are treated as two (2) independent processes.\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n1.3.1 General \n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meetings we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\nKDC West has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \n\n1.3.2 Anhydrous Ammonia\n\nThe ammonia refrigeration process at the KDC West facility is an integral part of the overall business and operates most of the year. It is extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\nOur refrigeration personnel monitor the ammonia refrigeration process and keep active records of all procedures and transactions that pertain to ammonia. In addition, the process is checked frequently by one of the outside refrigeration contractors that we use. These contractors also assist in performing the annual mechanical integrity inspection of our ammonia equipment. \n\n1.4 Five Year Accident History\n\nKDC West has had no accidental release within the last five (5) years.\n\n1.5 Emergency Action and Response Plan\n\nKDC West\u0092s emergency actio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000105204,
      "SummaryText": "h general business practices\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\nThe RMP/PSM/CalARP Program sets forth rules, procedures, and practices that will help our employees and neighbors protect themselves.\n\n1.2 Process Descriptions\n\n1.2.1 Facility Overview\n\nKDC West operates a commercial cold storage for table grapes in Delano, CA. The facility has two (2) ammonia refrigeration systems that provide refrigeration capacity to the following:\n\nSystem 1 (North System)\n(4) Storage Rooms\n(1) Precool Room\n(1) Hallway\n(1) Shipping Dock\n\nSystem 2 (South System)\n(4) Storage Rooms\n(1) Precool Room\n1.2.2 Facility Location\n\nKDC West is located at 11009 Central Valley Hwy, Delano, CA 93215. The latitude and longitude of the System 1 machinery room is 35.755094, -119.343043. The facility is located adjacent to state highway 43 in a rural area surrounded primarily by agricultural land.\n\nAccording to FEMA Flood Map Service, the facility is not located in \u0093a special flood hazard area\u0094.\nKDC West is not located in an Alquist-Priolo Fault Zone as defined by the California Department of Conservation. In addition, a review of United States Geological Survey (USGS) fault maps showed that faults within close proximity are not considered high risk:\nGreat Valley Thrust Fault System: <150 years\nPremier Fault: <150 years\nPond Fault: <150 years\nKern Front Fault: <150 years\nWith regard to USGS Quaternary Faults, the threat of fault rupture is low. The USGS 2018 One-Year Model revealed that KDC West has a 2-5% chance of experiencing \u0093potentially minor-damage\u0094 due to ground shaking in 2018.\n\n1.2.3 Description of Covered Processes\n\nThe refrigerated areas are equipped with air-cooling evaporators and accumulators as required for flooded operation.\n\nThe P1 North system control valves are located on the roof to provide easy access. The P2 South system control valves are located alongside the building (elevated). T"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000105204,
      "SummaryText": "1. Executive Summary\n\nThis program is intended to meet the spirit and intent of the following regulations:\nCalifornia Accidental Release Prevention (CalARP) Program \u0096 Title 19 CCR, Chapter 4.5\nFederal EPA Risk Management Program (RMP) \u0096 Title 40 CFR §68\nCalifornia Process Safety Management (PSM) Program \u0096 Title 8 CCR §5189\nFederal Process Safety Management (PSM) Program \u0096 Title 29 CFR §1910.119\nHereafter this program will be referred to as the RMP/PSM/CalARP Program.\n\nThis program is intended to be a \u0093living document\u0094. As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, KDC West has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP/PSM/CalARP related activities. \n\n1.1 KDC West, Risk and Process Safety Management Program\n\nThis is to inform all interested persons, including employees, that KDC West has updated/developed their unified RMP/PSM/CalARP Program. This program has been prepared to address the risks involved in operating and maintaining the following processes which have the presence of hazardous chemicals above threshold quantities: \n\nNorth System\nAnhydrous Ammonia\n18,000\n\nSouth System\nAnhydrous Ammonia\n9,800\n\nOur RMP/PSM/CalARP Program promotes overall plant, worker, public, and environmental safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses, and physical property damage.\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n1. Prepared a unified program based on the PSM regulation to meet CalARP and RMP obligations as well\n2. Organized the program so that it meshes closely wit"
    }
  ]
}