{
  "FacilityID": 1000000879,
  "FacilityName": "Defiance Water Pollution Control Plant",
  "FacilityStr1": "26273 State Route 281 East",
  "FacilityStr2": null,
  "FacilityCity": "Defiance",
  "FacilityState": "OH",
  "FacilityZipCode": "43512",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39039",
  "LEPC": "Defiance County LEPC",
  "FacilityLatDecDegs": "41.289722",
  "FacilityLongDecDegs": "-084.318333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Defiance, Ohio",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Defiance",
  "OperatorStr1": "613 PerryStreet",
  "OperatorStr2": null,
  "OperatorCity": "Defiance",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43512",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark Lehnert",
  "RMPTitle": "Superintendent",
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059321",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-07-10 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-11-18 00:00:00",
  "DeRegistrationEffectiveDate": "2020-06-04 00:00:00",
  "AnniversaryDate": "2014-05-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.28249,
  "FRS_Long": -84.30757,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001065,
      "AltID": "CL2 and SO4 Storage",
      "FacilityID": 1000000879,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001151,
          "ProcessID": 1000001065,
          "NAICSCode": "325181",
          "_desc": {
            "NAICS_CODE": "325181",
            "NAICS_DESCRIPTION": "Alkalies and Chlorine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001108,
          "ProcessID": 1000001065,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000001109,
          "ProcessID": 1000001065,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501108,
          "ProcessID": 1000001065,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501109,
          "ProcessID": 1000001065,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000001066,
      "AltID": "CL2 and SO4 Feed Room",
      "FacilityID": 1000000879,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001152,
          "ProcessID": 1000001066,
          "NAICSCode": "325181",
          "_desc": {
            "NAICS_CODE": "325181",
            "NAICS_DESCRIPTION": "Alkalies and Chlorine Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001110,
          "ProcessID": 1000001066,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000001111,
          "ProcessID": 1000001066,
          "ChemicalID": 49,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501110,
          "ProcessID": 1000001066,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501111,
          "ProcessID": 1000001066,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000879,
      "SummaryText": "Executive Summary\n\nThe City of Defiance, Ohio is committed to the RMP requirements under 40 CFR Part 68 and recognizes the responsibility to prevent harm to employees and the public due to a chlorine release or a sulfur dioxide release. DefianceA?s accidental release prevention program integrates management practices, safety procedures, employee participation, process safety and operating information, process hazard analysis and compliance auditing, pre-start up reviews, mechanical integrity, management of change procedures, incident investigation, emergency planning and response, and updating practices and procedures. Applicable requirements for Program 3 Risk Management Programs are adhered to. The emergency response program is tailored with respect to the available emergency responders and the Defiance County LEPC and includes notification procedures as well as plant evacuation procedures.\n\nThere are two processes involved at the Defiance WPC facility. One is the storage of chlorine and sulfur dioxide containers. The second is the feeding of chlorine and sulfur dioxide to the WPC effluent.\n\nThe chlorination system for the Defiance WPCP is used to disinfect wastewater prior to discharge to the Maumee River. The chlorination facilities include outside storage for one-ton containers, a chlorine scale and feed room, various safety equipment and controls, two chlorinators, the necessary cylinder handling equipment, a chlorine gas alarm system and a residual chlorine analyzer. Normally chlorine is supplied from two one-ton containers connected to the process feed piping. The cylinders in service are controlled automatically using a switchover device that limits operation from a single cylinder. Plant operators check the operation of the chlorination system at least once each shift and respond to trouble or warning alarms.\n\nThe offsite consequence analysis considers two chlorine release scenarios as the worst-case scenario and the alternate release scenario. Predictive "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000879,
      "SummaryText": "release information was obtained using EPAA?s RMP* Comp model to identify the distance to endpoint for a potential chlorine release. The worst-case scenario involves a failure or rupture of a one-ton container releasing the entire contents of the container within ten minutes. The distance to the end point was estimated to be 1.3 miles from the chlorination facilities assuming a wind speed of 1.5 meters/second and atmospheric stability class F. The endpoint determination assumes out door storage of the container. The potential population affected by the worst-case scenario was estimated to be 770 persons. The alternate release scenario involves a potential pipe leak where 1,845 pounds of chlorine gas may be released during a 15-minute accidental release. The distance to endpoint was estimated to be 0.2 miles from the chlorination faculties assuming a wind speed of 3.0 meters/second and atmospheric stability class D. The endpoint determination includes enclosure of the container within the scale and feed room. The potential population affected by the alternate release scenario was estimated to be 5 persons.\n\nActuation of the chlorine gas detectors was considered to be an active mitigation measure. Additionally, the chlorine gas piping is vacuum tubing connected directly to the chlorine gas header. A loss of vacuum in the tubing immediately stops the flow of chlorine gas from the header and reduces possibility of a chlorine release due to a piping leak.\n\nThe dechlorination system for the Defiance WPCP is used to dechlorinate wastewater using sulfur dioxide gas prior to discharge to the Maumee River. The dechlorination facilities include outside storage for one-ton containers, a sulfur dioxide scale and feed room, various safety equipment and controls, two sulfinators, the necessary cylinder handling equipment, and a sulfur dioxide alarm system. Normally chlorine is supplied from two one-ton containers connected to the process feed piping. The cylinders in service are c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000879,
      "SummaryText": "ontrolled automatically using a switchover device that limits operation from a single cylinder. Plant operators check the operation of the dechlorination system at least once each shift and respond to trouble or warning alarms.\n\nThe offsite consequence analysis considers two sulfur dioxide release scenarios as the worst-case scenario and the alternate release scenario. Predictive release information was obtained using EPAA?s RMP* Comp model to identify the distance to endpoint for a potential chlorine release. The worst-case scenario involves a failure or rupture of a one-ton container releasing the entire contents of the container within ten minutes. The distance to the end point was estimated to be 1.3 miles from the dechlorination facilities assuming a wind speed of 1.5 meters/second and atmospheric stability class F. The endpoint determination assumes outdoor storage of the container. The potential population affected by the worst-case scenario was estimated to be 770 persons. The alternate release scenario involves a potential pipe leak where 1,845 pounds of sulfur dioxide gas may be released during a 15-minute accidental release. The distance to endpoint was estimated to be 0.1 miles from the dechlorination faculties assuming a wind speed of 3.0 meters/second and atmospheric stability class D. The endpoint determination includes enclosure of the container within the scale and feed room. The potential population affected by the alternate release scenario was estimated to be 5 persons.\n\nActuation of the sulfur dioxide gas detectors was considered to be an active mitigation measure. Additionally, the sulfur dioxide gas piping is vacuum tubing connected directly to the sulfur dioxide gas header. A loss of vacuum in the tubing immediately stops the flow of sulfur dioxide gas from the header and reduces possibility of a sulfur dioxide release due to a piping leak.\n\nThe Defiance WPCP Risk Management Program has the key elements listed below. These elements are aimed "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000879,
      "SummaryText": "at preventing a chlorine release from the chlorination and dechlorination systems.\nA?High level of operator training and maintenance training,\nA?An established preventive maintenance program,\nA?Implementation of an audit and inspection programA?\nA?Use of effective written operating procedures,\nA?Implementation of an employee participation program,\nA?Use of emergency air supply and container leak kits,\nA?Performance of process hazard analysis and compliance auditing procedures,\nA?And use of process alarms and emergency shut down procedures.\n\nNo accidental releases of chlorine gas have occurred at the Defiance WPCP in the past five years.\n\nAn emergency response program is established and is coordinated with the Defiance County LEPC. The program includes plant evacuation procedures, emergency notification procedures for responders, and a notification plan. Plant evacuation drills are performed on accordance with 29 CFR 1910.38. Emergency response drills are performed in accordance with LEPC schedules. No recommendations for change from the process hazard analysis and the compliance audit were identified from these activities."
    }
  ]
}