{
  "FacilityID": 1000089946,
  "FacilityName": "Ele Corporation",
  "FacilityStr1": "7847 West 47th Street",
  "FacilityStr2": null,
  "FacilityCity": "McCook",
  "FacilityState": "IL",
  "FacilityZipCode": "60525",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.805804",
  "FacilityLongDecDegs": "-87.817426",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5191044,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ele Corporation",
  "OperatorStr1": "7847 West 47th Street",
  "OperatorStr2": null,
  "OperatorCity": "McCook",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60525",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Lesnik",
  "RMPTitle": "EHSS Manager",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000088996",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-02-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-09-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-09-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-09-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-09-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.80603,
  "FRS_Long": -87.81658,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000111855,
      "AltID": null,
      "FacilityID": 1000089946,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000113168,
          "ProcessID": 1000111855,
          "NAICSCode": "32519",
          "_desc": {
            "NAICS_CODE": "32519",
            "NAICS_DESCRIPTION": "Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000139818,
          "ProcessID": 1000111855,
          "ChemicalID": 9,
          "Quantity": 275000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 9,
            "ChemicalName": "Ethylene oxide  [Oxirane]",
            "CASNumber": "75-21-8",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000139819,
          "ProcessID": 1000111855,
          "ChemicalID": 12,
          "Quantity": 220000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 12,
            "ChemicalName": "Propylene oxide  [Oxirane, methyl-]",
            "CASNumber": "75-56-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000139820,
          "ProcessID": 1000111855,
          "ChemicalID": 1,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000139821,
          "ProcessID": 1000111855,
          "ChemicalID": 27,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 27,
            "ChemicalName": "Allyl alcohol  [2-Propen-1-ol]",
            "CASNumber": "107-18-6",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000139822,
          "ProcessID": 1000111855,
          "ChemicalID": 133,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 133,
            "ChemicalName": "Dimethylamine  [Methanamine, N-methyl-]",
            "CASNumber": "124-40-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000639818,
          "ProcessID": 1000111855,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000639819,
          "ProcessID": 1000111855,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000639820,
          "ProcessID": 1000111855,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000639821,
          "ProcessID": 1000111855,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000639822,
          "ProcessID": 1000111855,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089946,
      "SummaryText": "General Executive Summary for Chemical, Manufacturing and Oil Refining Facilities.\n\n\n\n1.Accidental Release Prevention and Emergency Response Policies:\n\n\n\nWe at Ele Corporation are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n \n\n2.The Stationary Source and the Regulated Substances Handled:\n\n\n\nThe Ele Corporation is located at 7847 West 47th Street in McCook, IL. The facility's operation involves the manufacturing of feed stock products for the urethane plastics industry. This includes the manufacturing and packaging of various custom feed stocks leaving the plant in 5 to 300-gallon containers as well as tank trucks. The manufacturing process utilizes raw chemicals primarily consisting of ethylene oxide, propylene oxide, formaldehyde, allyl alcohol and dimethylamine. Raw materials for the process are received via tank truck and rail car. Packaging materials are received by dray truck. Liquid raw materials are stored on the plant property in outside storage tanks. Packaged raw materials are stored on pallets in pallet racks until they are required in the manufacturing process. The products are manufactured in a batch process in reaction vessels of various sizes. Finished products are stored in the tanks within the warehouse or in the vessels until they are packaged.\n\n \n\n3.The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\n\n\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. The following sections briefly describe the elements of the release prevention program that i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089946,
      "SummaryText": "s in place at our stationary source.\n\n\n\nProcess Safety Information: Ele Corporation maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis: Our facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is HAZOP. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years. Any findings related to the hazard analysis are addressed in a timely manner. The most recent PHA/update was performed on 9/22/2020.\n\n\n\nOperating Procedures: For the purposes of safely conducting activities within our covered processes, Ele Corporation maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining: Ele Corporation has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every 3 years and more frequently as needed.\n\n\n\nMechanical Integrity: Ele Corporation carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Any equipment deficiencies id"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089946,
      "SummaryText": "entified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change: Written procedures are in place at Ele Corporation to manage changes in process chemicals, technology, equipment and procedures. The most recent review/revision of maintenance procedures was performed on 02/03/2020. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews: Pre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Ele Corporation. The most recent review was performed on 02/03/2020. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits: Ele Corporation conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. The most recent compliance audit was conducted on 9/22/2020. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation: Ele Corporation promptly investigates any incident that has resulted in or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation: Ele Corporation truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000089946,
      "SummaryText": "he major steps we want to take to improve safety at our facility. These changes are continuous and ongoing.\n\n \n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089946,
      "SummaryText": "have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses.\n\n\n\nContractors: On occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Ele Corporation has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n \n\n4.Five-year Accident History:\n\nEle Corporation has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n \n\n5.Emergency Response Plan:\n\nEle Corporation carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. To ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nThe McCook Fire Dept is the local emergency response agency who has we have communicated with and have done pre-planning and chemical specific training.\n\n \n\n6.Planned Changes to Improve Safety:\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. Employee Suggestions, design of equipment with vendors, and engineering of the process are some of t"
    }
  ]
}