{
  "FacilityID": 1000013789,
  "FacilityName": "Fresh Start Bakeries - Bakersfield facility",
  "FacilityStr1": "6800 McDivitt Drive",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93313",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.314722",
  "FacilityLongDecDegs": "-119.079444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 783435258,
  "ParentCompanyName": "Fresh Start Bakeries - North America",
  "Company2Name": null,
  "CompanyDUNS": 877582981,
  "Company2DUNS": 877582981,
  "OperatorName": "Mark Haynes, Facilities Manager",
  "OperatorStr1": "6800 McDivitt Drive",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93313",
  "OperatorZipCodeExt": null,
  "FTE": 58,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000057163",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-05-29 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-05-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-05-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-02-18 00:00:00",
  "DeRegistrationEffectiveDate": "2011-02-07 00:00:00",
  "AnniversaryDate": "2015-05-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.31454,
  "FRS_Long": -119.07868,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017264,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000013789,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020536,
          "ProcessID": 1000017264,
          "ChemicalID": 56,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000017647,
          "ProcessID": 1000017264,
          "NAICSCode": "311822",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000014247,
              "Process_NAICS_ID": 1000017647,
              "SafetyReviewDate": "2010-04-21 00:00:00",
              "PHA_Date": "2010-03-31 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-03-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-08-11 00:00:00",
              "TrainingReviewDate": "2008-05-20 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-01-15 00:00:00",
              "EquipmentInspectionDate": "2009-09-24 00:00:00",
              "EquipmentTested": "All pressure vessels, piping, compressors, evaporative condensers, relief valves, heat exchangers, pumps, emergency shutdown system, sensors, and alarns.",
              "ChangeMgmtDate": "2009-04-13 00:00:00",
              "ChangeMgmtReviewDate": "2007-08-06 00:00:00",
              "PreStartupReviewDate": "2008-05-20 00:00:00",
              "ComplianceAuditDate": "2009-12-29 00:00:00",
              "AuditCompletionDate": "2010-08-25 00:00:00",
              "IncidentInvestigationDate": "2008-06-30 00:00:00",
              "InvestigationChangeDate": "2008-07-01 00:00:00",
              "ParticipationPlansReviewDate": "2007-07-30 00:00:00",
              "HotWorkPermitReviewDate": "2009-10-14 00:00:00",
              "ContractorSafetyReviewDate": "2009-11-30 00:00:00",
              "ContractorSafetyEvalDate": "2010-04-27 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia refrigeration system",
              "_chemicals": [
                {
                  "PrimaryKey": 1000017082,
                  "PreventionProgram3ID": 1000014247,
                  "ProcessChemicalID": 1000020536
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000013789,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Bakersfield City Fire Department",
    "CoordinatingAgencyPhone": "6613263979",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013789,
      "SummaryText": "Executive Summary\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\nIt is the policy of Fresh Start Bakeries to comply with all requirements of the EPA Accidental Release Prevention (Risk Management) Program regulation (40 CFR Part 68) as well as all other applicable federal and state rules and regulations regarding hazardous chemicals.  The Bakersfield plant has developed an OSHA Process Safety Management (PSM) Program (29 CFR 1910.119) to satisfy the release prevention element of the EPA and California Accidental Release Prevention Programs and to support this policy.\n\nIt is the also the policy of this facility to devote the time, energy, and capital toward maintaining emergency planning activities, programs, and exercises appropriate to the inherent dangers with the use of hazardous chemicals.\n\n2.    Facility and Regulated Substance(s) Handled\n\nThe plant is located at 6800 McDivitt Drive, Bakersfield in Kern County, California in a commercial/industrial area west of State Highway 99.  The facility produces frozen dough products, such as bread, rolls and other baked goods.  The dough is processed, flash frozen, packaged, and stored in a frozen goods warehouse prior to shipment.\n\nAnhydrous ammonia is the only regulated substance at this facility subject to the requirements under the EPA Risk Management Program.  Ammonia is used to provide refrigeration for process cooling/freezing and in finished product storage and handling areas.  The system charge is approximately 24,000 lbs.\n\nThe Fresh Start Bakeries facility utilizes anhydrous ammonia as a heat transfer fluid (refrigerant) in the plant refrigeration system.  This system is considered a two-stage refrigeration system.  High-pressure liquid ammonia is fed from the Thermosyphon Receiver to the thermosyphon oil coolers, the Intercooler, the Water Chiller, the Glycol Chiller, and the Controlled Pressure Receiver.\n\nThe Intercooler de-superheats the discharge gas from the Booster Compressors.  If too m"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013789,
      "SummaryText": "uch liquid accumulates in the Intercooler, a High Level Alarm float switch will transfer the excess ammonia to the Suction Accumulator.\n\nThe Water Chiller supplies chilled water for use in the Dough Mixer(s), while the Glycol Chiller supplies glycol to Air Handlers in the Dock and also supplies glycol to the Dough Mixer for cooling.  The Controlled Pressure Receiver delivers the necessary sub-cooled liquid ammonia for proper operation of the evaporators in the Holding Freezer, Ice Maker, Ante Room and (2) Spiral Freezers.  With exception of the Ice Maker, these evaporators are intentionally fed more ammonia than can be evaporated to increase the efficiency of the heat transfer surface.  This excess liquid is separated from the ammonia vapor in the Suction Accumulator.  The liquid is returned to the Controlled Pressure Receiver by means of a Liquid Transfer System and the vapor is pulled off by the Booster Compressors.  The Booster Compressors discharge the compressed ammonia vapor into the Intercooler where much of the heat of compression is removed before the High Stage Compressors finish the compression.  The two evaporative condensers condense the ammonia vapor back into a liquid and drain into the Thermosyphon Receivers to start the cycle over again. \n\nAn ammonia diffusion system has been installed to mitigate the release of ammonia into the atmosphere during emergencies.  Each pressure relief valve is piped to a relief main, which in turn, is piped directly to the Ammonia/Water Diffusion Tank.  Each vessel containing liquid ammonia is piped separately to a valve in the Fire Diffusion Panel located outside the Engine Room.  The panel is piped directly to the Ammonia/Water Diffusion Tank.  During emergency situations, pressure can be manually reduced and safely released from any or all vessels and safely diffused into water from outside the building.\n\nThe production schedule varies but often operates 24 hours per day, 7 days per week.  Regardless, the refrigerati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013789,
      "SummaryText": "on system operates continuously to maintain the holding freezer.\n        \nAmmonia sensors have been installed throughout the facility in each area containing ammonia evaporators and/or control-valve groups.  This system is designed to indicate alarm conditions and create evacuation and fire department notifications at prescribed levels.\n\nAny sensor indicating an alarm condition will automatically close the respective liquid and hot gas solenoids at the units.  The system can be manually operated.  This facility has a guard on site 24 hours per day during non-operation, and the fire and ammonia system are monitored 24/7. \n\nSafety systems include:\n\n1.    Pressure relief valves on each pressure vessel\n2.    Compressor control panels to shut down the compressor operation if pre-set safe operating conditions are exceeded\n3.    Liquid level float switches\n4.    Ventilation system for continuous and emergency ventilation of the Engine Room\n5.    Ammonia detection and alarm system for response to elevated levels of ammonia vapor in the Engine Room.\n6.    Ammonia Diffusion Tank (ADT).\n7.    Spring-loaded, self-closing oil drain valves\n8.    Emergency refrigeration control switch for emergency shutdown of the system (E-stop)\n9.    Fire suppression system and fire extinguishers\n10.    Emergency showers and eyewash stations\n\n3.    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThis facility has implemented the release prevention measures for a Program 3 process as required for the federal and state Accidental Release Prevention Programs.  The process is also subject to the OSHA Process Safety Management (PSM) Standard requirements and has implemented these requirements to satisfy the PSM Standard as well as the Program 3 release prevention elements.  For processes with greater than 10,000 lbs. anhydrous ammonia, compliance with both requirements is mandatory.\n\nThe PSM Program includes the following elements:\n\nA?    Process Safety Information (chemical, refrigeration technology, eq"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013789,
      "SummaryText": "uipment)\nA?    Process Hazard Analysis (an evaluation of system deficiencies with recommendations to improve safety and reduce the risk of a release)\nA?    Operating Procedures (detailed written instructions for operating the system safely; reviewed and certified annually)\nA?    Training (initial and refresher training for operators and mechanics)\nA?    Mechanical Integrity (scheduled preventive maintenance activities, inspections, testing, calibrations, quality assurance, deficiency control and correction)\nA?    Management of Change (all planned changes are evaluated for safety and required process and program changes before implementation)\nA?    Pre-Startup Safety Review (prior to startup for new or modified processes where safety information has changed, all elements of the program and process are verified)\nA?    Compliance Audits (conducted every three years, at a minimum, to ensure that all program elements are implemented properly)\nA?    Incident Investigation (team investigation of actual and near-miss events to ensure root cause is understood and to prevent recurrence.\nA?    Employee Participation (provides awareness and involves employees in the program; provides access to program implementation and encourages team ownership of the program).\nA?    Hot Work Program (procedures and permit control spark, heat, and flame-producing activities to prevent fires, explosions, or toxic releases)\nA?    Contractors (program qualifies contractors based upon safety record and experience; periodic review of contractor performance)\n\nIn addition, the process is also subject to requirements under the applicable fire and mechanical codes.  In addition to the codes, standards developed under the International Institute of Ammonia Refrigeration (IIAR) apply to the process as the \"recognized and generally-accepted good engineering practices\" and have been implemented as well.  For instance, ANSI/IIAR 2  Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigeration Systems is applicable to"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000013789,
      "SummaryText": " this process and has been applied where required.\n\nMost of the equipment maintenance and regular scheduled service is provided by a qualified refrigeration contractor.  \n\n4.    Five-Year Accident History\n\nThere has been no releases of ammonia from this facility in the last five years that have resulted in deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage. \n\n5.    Emergency Response Preparedness Program\n\nOur Emergency Action Plan (EAP) details the response this facility will take as a result of an uncontrolled release of ammonia.  The Plan includes procedures for notification of the local emergency responders and for initiation of evacuations.  This EAP also includes a specific protocol for responding to an ammonia release and assigns an Emergency Coordinator to implement the response.  This Plan is current and updated as required by law and conforms to the requirements for an Emergency Action Plan as per 29 CFR 1910.38.\n\nThis facility has also coordinated with the local emergency responders and will maintain regularly-scheduled familiarization tours to ensure that the responders are familiar with the system and with the general safety and accidental release program at our plant.  The facility also conducts annual drills with community first responders.\n\n \n6.    Planned Changes to Improve Safety \n\nAs a result of the recent Triennial Compliance Audit and the Process Hazard Analysis Revalidation and Update, the facility plans a number of changes to improve safety.  These changes include:\n\nA.    Modifications and additions to the Standard Operating Procedures\nB.    Addition of ammonia vapor detectors in new locations\nC.    Five-year Mechanical Integrity Audit\nD.    Seismic Assessment\nE.    Security enhancements\nF.    Charging line modifications\nG.    Program enhancements\nH.    Maintenance recordkeeping modifications\n"
    }
  ]
}