{
  "FacilityID": 1000003587,
  "FacilityName": "Burdick & Jackson",
  "FacilityStr1": "1953 South Harvey Street",
  "FacilityStr2": null,
  "FacilityCity": "Muskegon",
  "FacilityState": "MI",
  "FacilityZipCode": "49442",
  "Facility4DigitZipExt": "6184",
  "FacilityCountyFIPS": "26121",
  "LEPC": "Muskegon County LEPC",
  "FacilityLatDecDegs": "43.216667",
  "FacilityLongDecDegs": "-086.206667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.honeywell.com",
  "FacilityEmailAddress": "steve.movesian@honeywell.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Honeywell",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Honeywell",
  "OperatorStr1": "101 Columbia",
  "OperatorStr2": null,
  "OperatorCity": "Morristown",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07962",
  "OperatorZipCodeExt": null,
  "RMPContact": "Stephen Movesian",
  "RMPTitle": "PSM / Process Engineer",
  "FTE": 87,
  "OtherEPAFacilityID": "MID72575731",
  "EPAFacilityID": "100000098592",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-06-04 00:00:00",
  "SafetyInspectionBy": "MI Dept. of Env Quality checked raw material tanks",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.2164,
  "FRS_Long": -86.20573,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000004393,
      "AltID": "North Tank Farm",
      "FacilityID": 1000003587,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000004579,
          "ProcessID": 1000004393,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000004949,
          "ProcessID": 1000004393,
          "ChemicalID": 92,
          "Quantity": 58870.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 92,
            "ChemicalName": "Ethyl ether  [Ethane, 1,1'-oxybis-]",
            "CASNumber": "60-29-7",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000005205,
          "ProcessID": 1000004393,
          "ChemicalID": 4,
          "Quantity": 123023.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 4,
            "ChemicalName": "Chloroform  [Methane, trichloro-]",
            "CASNumber": "67-66-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000504949,
          "ProcessID": 1000004393,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000505205,
          "ProcessID": 1000004393,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000003587,
      "SummaryText": "RMP*eSubmit Executive Summary\nHoneywell Muskegon\n\n\nAbout Honeywell Muskegon\n\nThe Honeywell Muskegon plant is a manufacturing facility located in Muskegon, MI (Honeywell Muskegon).  It is part of the Specialty Materials business group of Honeywell International Inc.\n\nHoneywell International Inc. (Honeywell.com) is a Fortune 100 diversified technology and manufacturing leader, serving customers worldwide with aerospace products and services; control technologies for buildings, homes and industry; automotive products; turbochargers; and specialty materials.  Based in Morristown, New Jersey, HoneywellA?s shares are traded on the New York, London, and Chicago Stock Exchanges.  For more news and information on Honeywell, please visit www.honeywellnow.com.\n\nHoneywell Specialty Materials, also based in Morristown, N.J., is a global leader in providing customers with high-performance specialty materials, including fluorine products, specialty films and additives, advanced fibers and composites, intermediates, specialty chemicals, electronic materials and chemicals, and technologies and materials for petroleum refining.\n\nHealth, Safety and Environment/Responsible CareA?\n\nHoneywell Muskegon is committed to managing health, safety and the environment as a core business value to ensure compliance with all applicable government standards and regulations.  Honeywell Muskegon also integrates health, safety and environmental management into our business as a way of achieving profitable growth and accelerated productivity.\n\nHoneywell Specialty Materials participates in the Responsible CareA? program of the American Chemistry Council, and has achieved and maintained certification to the standard since 2005.  Responsible CareA? is a chemical industry program focused on achieving improvements in environmental, health and safety performance beyond levels required by the U.S. government.\n\nThe Responsible CareA? program directs its companies to adopt practices for the safe use of materials"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000003587,
      "SummaryText": ", to perform regular audits, and to reach out and communicate with the communities in which the companies operate.\n\nHoneywell Muskegon\n\nThe Honeywell Muskegon plant is a high purity solvent manufacturing facility that has approximately 80 employees. The plantA?s products are used in a variety of different industries for laboratory testing and pharmaceutical and electronic components manufacturing.  \n\nTwo of the materials used by the facility are chloroform and ethyl ether, which are on the RMP Rule's list of regulated substances.  Honeywell Muskegon's storage and use of chloroform and ethyl ether exceeds the specified thresholds of 20,000 lbs. and 10,000 lbs. respectively, as defined by the EPAA?s RMP Rule.  \n\nIn accordance with the requirements of the RMP Rule, a description of the following six elements is provided for Honeywell Muskegon: \n\n1)    Accidental Release Prevention and Emergency Response Policies: \n\nIt is the policy of Honeywell Muskegon to operate a safe and environmentally sound facility by identifying and controlling health, safety, or environmental risks related to its operations; by designing its processes to protect people, property and the environment; by conducting and continually reviewing and improving programs for safety, health and environmental excellence; and by establishing processes to ensure that all laws and regulations applicable to its operations and products are known and observed. The accidental release prevention and emergency response policy associated specifically with the plant's use of chloroform and ethyl ether involves the integration of safety devices and technologies inherent in the design of the processes, safe operational procedures and management practices, operator training, emergency response plans, maintenance of emergency response equipment, coordination with local emergency response services, and communicating with the community. \n\n2)    Description of the Facility and the Regulated Substance Handled: \n\nHoneywell Muskego"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000003587,
      "SummaryText": "n stores chloroform and ethyl ether as raw materials for small batch purifying processes.  They are stored in quantities that exceed the threshold quantities specified in the RMP Rule.\n\nThe siteA?s stationary source of chloroform consists of a tanker unloading area and a bulk storage tank.  Chloroform is purchased from an outside vendor and is delivered to the plant via tank truck on an A?as neededA? basis.  The tankerA?s contents are unloaded by plant operators into an above-ground bulk storage tank identified as #19, which is located in the north outdoor, above-ground tank farm.\n\nThe siteA?s stationary source of ethyl ether consists of a tanker unloading area and a bulk storage tank.  Ethyl ether is purchased from an outside vendor and is delivered to the plant via tank truck on an A?as neededA? basis.  The tankerA?s contents are unloaded by plant operators into an above-ground bulk storage tank identified as #17, which is located in the north outdoor, above-ground tank farm.\n\n \n3)    The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps: \n\nThe general accidental release prevention program at Honeywell Muskegon for the chloroform (toxic) and ethyl ether (flammable) stationary sources includes the following elements: a) established process safety management system for oversight and control of the chloroform (toxic) and ethyl ether (flammable) processes; b) development and implementation of accurate procedures for safe operation and maintenance of the process; c) an on-going mechanical integrity program that ensures critical process equipment is designed, constructed, and installed in accordance to codes and standards and is also inspected, tested, and proactively maintained; d) performance of process hazards analyses with resolution of recommendations; e) use of safety shutdown, relief and vent systems, interlocks, dikes and other secondary containment installations, control instrumentation, and process monitoring for early warning a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000003587,
      "SummaryText": "nd detection; f) implementation of procedures designed to review and manage changes to the process; g) performance of incident investigations, process safety compliance audits, and pre-startup safety reviews; and h) a thorough area-specific training program for process operators and maintenance personnel.\n\nChemical specific prevention steps include: a) developing an understanding among the operators for the hazardous properties of chloroform (toxic) and ethyl ether (flammable), and of the process chemistry and safe operational process limits such as temperatures, pressures, and flows; b) understanding and preventing the consequences of unsafe chemical handling, process deviations and inadvertent mixing of incompatible chemicals; c) having knowledge of the requirements, capabilities and limitations of both personal protective and emergency response equipment and maintaining easily accessible inventories of each; d) designing the process technology and process equipment based on a thorough understanding of the hazardous properties of chloroform (toxic) and ethyl ether (flammable); and e) providing operators with specialized training for chloroform (toxic) and ethyl ether (flammable) regarding their hazards and proper handling procedures.\n\n4)    The Five Year Accident History:\n\nNo accidental releases from the chloroform (toxic) or ethyl ether (flammable) stationary sources, that would have an effect beyond the property line, have occurred at the Honeywell Muskegon site in the past five (5) years.\n\n5)    The Emergency Response Plan: \n\nHoneywell Muskegon has an emergency preparedness planning and response program designed to deal with accidental releases and other unplanned events associated with the facilityA?s stationary sources involving chloroform and ethyl ether.  The site has a written Emergency Response Plan that addresses various types of contingencies, including actions for responding to an accidental release of chloroform or ethyl ether.  The Plan provides for both i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000003587,
      "SummaryText": "nternal site and external community emergency alerting and notification processes with multiple means of communication identified.  The Plan addresses emergency medical care, in-place sheltering, evacuation, emergency responsibilities, response and control procedures, and emergency equipment.  The Plan provides for the implementation of an Incident Command System to direct and coordinate the siteA?s response activities.  The Plan has been coordinated with the Muskegon Fire Department who would direct all community response activities in conjunction with the siteA?s Incident Commander.  During an emergency company personnel would serve as technical resources to public emergency responders as well as coordinate safe evacuation of onsite personnel, recovery and start-up operations.  The company organizes and conducts plant emergency drills and exercises, both internally and jointly with public emergency responders.  Plant tours are conducted for public emergency responders to familiarize them with the facility layout, potential hazards and emergency response plans.\n\n6)    Planned Changes to Improve Safety:\n\nProcess hazard analyses (PHAs) of Honeywell MuskegonA?s stationary sources of chloroform and ethyl ether were completed in July and September 2007, respectively.  The purpose of these systematic safety reviews, is to identify opportunities to improve upon the existing safeguards of the covered source and to further reduce the potential for accidental release. The process hazard analysis for the chloroform and ethyl ether stationary sources will be reviewed and revalidated at least every five years and resulting improvements made as appropriate.\n\n\n\nRichard C. Davis\nHealth, Safety & Environmental Leader\nJune 2, 2009\n\n"
    }
  ]
}