{
  "FacilityID": 1000002717,
  "FacilityName": "Flint Hills Resources Chemical Intermediates, LLC",
  "FacilityStr1": "23425 W. Amoco Road",
  "FacilityStr2": null,
  "FacilityCity": "Channahon",
  "FacilityState": "IL",
  "FacilityZipCode": "60410",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17197",
  "LEPC": "Will County LEPC",
  "FacilityLatDecDegs": "41.446389",
  "FacilityLongDecDegs": "-088.174444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fhr.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 962724261,
  "ParentCompanyName": "Koch Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": 6944334,
  "OperatorName": "Flint Hills Resources Chemical Inte",
  "OperatorStr1": "23425 W. Amoco Road",
  "OperatorStr2": null,
  "OperatorCity": "Channahon",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60410",
  "OperatorZipCodeExt": null,
  "FTE": 250,
  "OtherEPAFacilityID": "60434MCCHM12MIL",
  "EPAFacilityID": "100000061853",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "197800ABZ",
  "SafetyInspectionDate": "2003-06-26 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-05-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-05-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.441669,
  "FRS_Long": -88.172781,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000003402,
      "AltID": "Maleic Anhydride Unit",
      "FacilityID": 1000002717,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000003691,
          "ProcessID": 1000003402,
          "ChemicalID": 118,
          "Quantity": 3446200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000052656,
          "ProcessID": 1000003402,
          "NAICSCode": "325194",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000044002,
              "Process_NAICS_ID": 1000052656,
              "SafetyReviewDate": "2014-03-19 00:00:00",
              "PHA_Date": "2014-03-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-12-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "emergency response",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "control room process monitoring and operator rounds",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": "emergency response",
              "OpProceduresReviewDate": "2014-02-05 00:00:00",
              "TrainingReviewDate": "2013-04-04 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "written training documents",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "computer based training",
              "MaintenanceReviewDate": "2014-02-25 00:00:00",
              "EquipmentInspectionDate": "2013-02-22 00:00:00",
              "EquipmentTested": "butane sphere external and ultrasonic thickness test",
              "ChangeMgmtDate": "2014-03-26 00:00:00",
              "ChangeMgmtReviewDate": "2013-03-07 00:00:00",
              "PreStartupReviewDate": "2014-03-10 00:00:00",
              "ComplianceAuditDate": "2013-10-14 00:00:00",
              "AuditCompletionDate": "2016-10-14 00:00:00",
              "IncidentInvestigationDate": "2013-10-09 00:00:00",
              "InvestigationChangeDate": "2014-07-31 00:00:00",
              "ParticipationPlansReviewDate": "2012-06-30 00:00:00",
              "HotWorkPermitReviewDate": "2013-02-01 00:00:00",
              "ContractorSafetyReviewDate": "2014-03-03 00:00:00",
              "ContractorSafetyEvalDate": "2008-06-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000052826,
                  "PreventionProgram3ID": 1000044002,
                  "ProcessChemicalID": 1000003691
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000002717,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-02-27 00:00:00",
    "ERTrainingDate": "2014-04-04 00:00:00",
    "CoordinatingAgencyName": "Will County LEPC",
    "CoordinatingAgencyPhone": "8157408351",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000002717,
      "SummaryText": "Flint Hills Resources Chemical Intermediates, LLC - Joliet Facility\r\nEPA Risk Management Plan (RMP)\r\nExecutive Summary\r\n\r\n\r\nThe Flint Hills Resources Chemical Intermediates, LLC - Joliet Facility (FHR) is located at 23425 West Amoco Road in Channahon, Illinois  (the Facility).  The Facility was purchased from BP Amoco Chemical Company by FHR on May 28, 2004.  \r\n\r\nAccidental Release Prevention and Response Policies\r\n\r\nFHR is committed to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our processes.  The Facility adheres to process safety policies, guidelines, and best practices that have been developed based on company and industry experience over the years.  FHRs practice is to implement the controls necessary to prevent releases of regulated substances to the environment.  However, if a release does occur, our trained personnel will respond to control and contain the incident.\r\n\r\nDescription and Regulated Substances\t\r\n\r\nVarious chemicals are processed at the Facility to produce materials for polyester fibers, fiberglass gasoline tanks, paints, wire coatings, plastics, insecticides, and food additives.  The only RMP-regulated substance at the Facility in excess of the threshold quantity is butane, which is the primary material used in the Maleic Anhydride (MAN) production process.\r\n\r\nFive-Year Accident History\r\n\r\nThe Facility has an excellent record of accident prevention over the past five years.  If an incident were to occur, it would be investigated very carefully to determine ways to prevent a recurrence or a similar incident from occurring.  \r\n\r\nPrevention Program\r\n\r\nThe following is a summary of the accident prevention efforts in place at the Facility.  Because the MAN production process that is regulated by the EPA RMP regulation is also subject to the Occupational Safety and Health Administr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000002717,
      "SummaryText": "ation (OSHA) Process Safety Management (PSM) standard, this executive summary complements the OSHA PSM elements and describes the management system in place to implement the prevention program.\r\n\r\nEmployee Participation\r\n\r\nThe Facility encourages employees to participate in process safety management and accident prevention.  Examples of employee participation range from compiling and updating technical information to participating as a member of a team that systematically analyzes new and modified processes for hazards.  Teams that represent a good cross-section of levels and areas of the Facility are formed to revise and update safety standards and to investigate accidents and issue reports to appropriate personnel.  Safety focus teams in each area promote individual responsibility for safe work behaviors.  Some individual employees responsibilities include writing operating procedures and Job Safety Analysis (JSA) plans, serving as compliance auditors for the Facility, and serving as members of the Facility's Fire and Emergency Response Team.   Refer to PSM Job Aid PSM-110 Employee Participation Plan for additional details.\r\n\r\nProcess Safety Information\r\n\r\nThe Facility maintains documents describing process safety information for the MAN process.  These documents describe chemical properties and associated hazards, limits for key process parameters, chemical inventories, and equipment design basis/configuration information.  Chemical-specific information, including exposure hazards and treatments, and emergency response considerations are provided in material safety data sheets.  The process operators use modern instrumentation to assist them in controlling the process within the design ranges. \r\n\r\nThe Facility also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, electrical ratings of equipment, pipi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000002717,
      "SummaryText": "ng and instrument drawings, etc.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are properly maintained.\r\n\r\nRefer to PSM Job Aid PSM-115 Process Safety Information for additional details.\r\n\r\nProcess Hazard Analysis\r\n\r\nThe Facility has a structured program to help ensure that hazards associated with the RMP-regulated process are controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place.\r\n\r\nThe Facility uses the Hazard and Operability (HAZOP) analysis technique to perform these evaluations.  HAZOP analysis is recognized by OSHA as one of the most systematic and thorough hazard evaluation techniques.  The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  A HAZOP study of the entire process unit is completed every five years.\r\n\r\nThe HAZOP team's recommendations for improvement are forwarded to management for resolution.  Recommendations are tracked until they are complete.  The final resolution of each recommendation is documented and retained.\r\n\r\nRefer to PSM Job Aid PSM-205 Process Hazard Analysis Program for additional details.\r\n\r\nOperating Procedures\r\n\r\nFHR maintains written procedures that address various modes of process operations, including such activities as unit startup, normal operations, temporary operations, emergency shutdown, normal shutdown, and initial startup of a new process.  These procedures are used as a reference by experienced process operators and provide a basis for consistent training of new process operators.  Each process unit reviews all operating procedures annually.  The procedures are located in the unit control room for ready-reference by process operators and are av"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000002717,
      "SummaryText": "ailable electronically to all Facility employees on the Facility's internal Infonet.\r\n\r\nTraining\r\n\r\nIn addition to the written operating procedures, operators receive two other elements of formal training.  Basic operator training is available at local institutions (e.g. Joliet Junior College) and consists of the essentials that process operators need to know about process equipment and controls, regardless of their work location.  Basic operating training either through local institutions and/or through online CBT training is completed before an operator starts the training specific to the process unit.    Unit-specific training is self-paced and is conducted in the unit under the oversight of experienced process operators over a period of several months.  An operator must become qualified on each section of the unit by demonstrating a hands-on mastery of every section task before operating that section independently.\r\n\r\nContractors\r\n\r\nContractors are utilized at the Facility for construction and maintenance activities.  \r\n\r\nBecause some contractors work on or near process equipment, the Facility has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform Facility personnel of any hazards that they find during their work.  \r\n\r\nThis is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to initiating work.  \r\n\r\nAll contractors must complete the Three Rivers Manufacturing Council Safety Course for contractors before they are allowed to work at the Facility.  Contractors must recertify in this course annually.  In addition, the Facility evaluates contractor safety programs and perfo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000002717,
      "SummaryText": "rmance during the selection of the contractor.  Facility FHR personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.  \r\n\r\nRefer to Policy CS-810-Contractor EHS Performance Policy for additional details.\r\n\r\nPre-Startup Safety Reviews (PSSRs)\r\n\r\nThe Facility conducts a PSSR for any new unit or unit modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, equipment, procedures, and personnel are properly prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure that construction is completed in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention measures are properly implemented.\r\n\r\nMechanical Integrity\r\n\r\nPractices and procedures are under continuous development and improvement in order to effectively maintain pressure vessels piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include (1) conducting training, (2) developing written procedures and plans, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  The combination of these activities forms a system that maintains the mechanical integrity of the process equipment.\r\n\r\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to ensure that they perform their job in a safe manner.  Written procedures ensure that"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000002717,
      "SummaryText": "work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed on process equipment to ensure that equipment functions as intended, and to verify that equipment complies with design standards and specifications.\r\n\r\nAnother integral part of the mechanical integrity program is quality assurance.  The Facility incorporates quality assurance measures into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\r\n\r\nSafe Work Practices\r\n\r\nFHR has long-standing safe work practices in place to ensure worker and process safety.  Detailed and rigorous safety standards control entry into work areas and confined spaces, specify procedures to follow for isolating energy sources by lockout/tagout and describe the permitting process for completing work in the Facility.  There are separate procedures for cleaning and isolating all major pieces of equipment.  Safety standards and work procedures are reviewed annually by all personnel who use them.  Refer to Policy S-345 Safe Work Permitting Standard for additional details.\r\n\r\nHot Work Permit\r\n\r\nThe Facility has a hot work permit program that details areas which require a permit and those areas for which a permit is not required.  A permit is required in process areas for all cutting, welding, spark producing equipment, etc., except in designated free burn areas.  The procedure includes accountability and responsibility for authorizing and issuing the hot work permit, display of the permit at the site of the hot work until the work is completed, site inspection, designation of appropriate precautions to be taken with the hot work, and assignment of a fire watch where appropriate.  Refer to Policy S-320 Hot Work Policy for additional details.\r\n\r\nManagement of Change\r\n\r\nThe Facility has a comprehensive system to manage changes to processes.  This system requires that"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000002717,
      "SummaryText": "changes to items such as process equipment, chemicals and process operating conditions be properly reviewed and authorized before being implemented.   Procedures at the Facility are controlled, reviewed, and approved in a process separate from the MOC process. Changes are reviewed to ensure that adequate controls are in place to manage any new hazards and to verify that existing controls have not been compromised by the change.  Chemical hazard information, process operating limits, equipment information, and procedures are all updated to incorporate these changes.  In addition, all personnel involved in the process are provided any necessary training on the change.  This system ensures that all documentation is updated and training is completed prior to the commissioning of the change.  Refer to Facility PSM MOC policies for additional details. \r\n\r\nIncident Investigation\r\n\r\nThe Facility promptly investigates incidents that resulted in, or reasonably could have resulted in a fire/explosion, toxic gas release, major property damage, environmental damage, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to management for resolution.  Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees and contractors who could be affected by the findings.  Incident investigation reports are retained for at least five years, so that the reports can be reviewed during future HAZOP studies.  Refer to Policy S-140 Report and Investigation Policy for additional details \r\n\r\nCompliance Audits\r\n\r\nTo ensure that the RMP and PSM programs are functioning properly, t"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000002717,
      "SummaryText": "he Facility periodically conducts targeted compliance audits.  A complete audit of the entire PSM program is conducted every three years.  Both hourly and management personnel participate as audit team members.  The audit team develops findings that are forwarded to Facility management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\r\n\r\nChemical Specific Prevention Steps\r\n\r\nThe processes at the Facility include hazards that must be managed to ensure continued safe operation.  The PSM Program summarized previously is applied to the MAN production process (the only EPA RMP-regulated process at the Facility).  Collectively, these program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\r\n\r\nIn addition to PSM, the Facility has instrumentation and equipment to detect, contain, and reduce the consequences of a release at and around the MAN production unit and associated butane sphere, including but not limited to:\r\n\r\nRelease Detection\r\n-\tHydrocarbon detectors with alarms\r\n-\tMonitoring equipment to detect density, temperature, level, and pressure changes\r\n\r\nRelease Containment/Control\r\n-\tAtmospheric relief devices\r\n-\tValves to permit isolation of the process\r\n-\tAutomated shutdown systems\r\n-\tRedundant equipment and instrumentation (i.e., uninterruptible power supply for the process control system)\r\n-\tInert gas purge system\r\n\r\nRelease Mitigation\r\n-\tContainment to contain liquid releases\r\n-\tFire suppression and extinguishing systems\r\n-\tDeluge system and snuffing steam\r\n-\tTrained emergency response personnel\r\n-\tEmergency response equipment located onsite\r\n\r\nEmergency Response Program Information\r\n\r\nThe Facility maintains a written emergency response program, which is in place to protect workers and the public as well as the environment.  The"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000002717,
      "SummaryText": "program consists of procedures for responding to a release of an RMP-regulated substance, including the possibility of a fire or explosion if a flammable substance is released.  The procedures address aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and personnel accountability after an evacuation; notification of local emergency response agencies and the public if a release occurs; and post-incident cleanup and decontamination requirements.  In addition, the Facility has procedures in place that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to facility processes or emergency response procedures.\r\n\r\nThe overall emergency response program for the Facility is coordinated with the Will County Local Emergency Planning Committee (LEPC).  This coordination includes periodic meetings of the committee, which involves local emergency response officials, local government officials, and industry representatives.  The Facility has the capability of communicating with appropriate LEPC officials and emergency response organizations (e.g., fire departments, industrial neighbors, and mutual aid with industry) around-the-clock.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, the Facility conducts periodic emergency drills that involve the LEPC and local emergency response organizations.  Additionally, the Facility provides occasional refresher training to local emergency responders.  Refer to the procedure S-110 Emergency and Evac Procedure for additional details\r\n\r\nPlanned Changes to Improve S"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000002717,
      "SummaryText": "afety\r\n\r\nThe Facility resolves all findings from HAZOP studies, some of which result in modifications to the process.  The resolutions and resulting changes are tracked internally to ensure completion.  Findings from the most recent PHA have not yet been formally approved for implementation.  Other changes that have been completed or are being considered for implementation within the MAN unit include:\r\n-\tDrainage trenching within the process unit to remove hazardous chemicals spills from the immediate process area;\r\n-\tConstruction of security fencing around the butane sphere;\r\n-\tUpdates to MOC program to facilitate transition to an electronic system.\r\nFinally, within the coming months, FHR will be revising the Facility (including the MAN unit) MOC process so that MOC reviews are managed and tracked through an electronic system.  The MOC procedures will be updated to incorporate the revised MOC methodologies."
    }
  ]
}