{
  "FacilityID": 1000114704,
  "FacilityName": "Santa Ynez Chlorination Station",
  "FacilityStr1": "1351 North Palisades Drive",
  "FacilityStr2": null,
  "FacilityCity": "Pacific Palisades",
  "FacilityState": "CA",
  "FacilityZipCode": "90272",
  "Facility4DigitZipExt": "2153",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.071944",
  "FacilityLongDecDegs": "-118.568056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ladwp.com",
  "FacilityEmailAddress": "water@ladwp.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Los Angeles Department of Water and Power",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Department of Water and Power",
  "OperatorStr1": "111 North Hope Street",
  "OperatorStr2": "Room 1449",
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90012",
  "OperatorZipCodeExt": "2607",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000138317",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-12-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.071944,
  "FRS_Long": -118.568056,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000142973,
      "AltID": "Chlorination",
      "FacilityID": 1000114704,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000178735,
          "ProcessID": 1000142973,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000144486,
          "ProcessID": 1000142973,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000122220,
              "Process_NAICS_ID": 1000144486,
              "SafetyReviewDate": "2024-01-19 00:00:00",
              "PHA_Date": "2024-01-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2026-07-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "A dry media chlorine mini-scrubber is also in use as a process control system.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Vacuum regulating valves on ton containers.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Remotely monitored chlorine detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Miscellaneous Changes",
              "OpProceduresReviewDate": "2024-03-05 00:00:00",
              "TrainingReviewDate": "2023-12-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-01-11 00:00:00",
              "EquipmentInspectionDate": "2024-02-26 00:00:00",
              "EquipmentTested": "Testing of chlorine leak detectors.",
              "ChangeMgmtDate": "2023-01-19 00:00:00",
              "ChangeMgmtReviewDate": "2022-06-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2023-01-10 00:00:00",
              "AuditCompletionDate": "2024-07-10 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-05-10 00:00:00",
              "HotWorkPermitReviewDate": "2024-01-19 00:00:00",
              "ContractorSafetyReviewDate": "2024-04-03 00:00:00",
              "ContractorSafetyEvalDate": "2024-04-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000153319,
                  "PreventionProgram3ID": 1000122220,
                  "ProcessChemicalID": 1000178735
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000114704,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-12-20 00:00:00",
    "ERTrainingDate": "2023-09-21 00:00:00",
    "CoordinatingAgencyName": "Los Angeles Fire Department",
    "CoordinatingAgencyPhone": "3105758523",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 10,
      "FacilityID": 1000114704,
      "SummaryText": "Safety\n\n      Based on the 2019 PHA, eight recommendations were made for the SYCS to improve chlorine safety. These recommendations have been evaluated, and implemented or adequately addressed by the LADWP. Additionally, a set of recommendations to further improve chlorine safety were made in 2024, when PHA was updated/revalidated for the SYCS.\n      \n      Based on the 2019 seismic assessment for the SYCS, three recommendations were made to improve chlorine safety. The recommendations for the SYCS included the performance of a detailed seismic assessment. The 2019 seismic assessment recommendations have been evaluated, and implemented or adequately addressed by the LADWP. Based on the performance of the detailed seismic assessment for the SYCS in 2021, it was recommended that the SYCS be replaced or retrofitted. The replacement recommendation is due to SYCS? use and age. LADWP is currently evaluating the replacement option for the SYCS. \n      \n      Based on the 2024 seismic assessment update for the SYCS, one additional recommendation has been made to further improve chlorine safety during future earthquakes.\n      \n      It is expected that all the above 2024 recommendations will be evaluated, and implemented or adequately addressed by the LADWP by July 2026. The implementation of these recommendations will further enhance the safety of the chlorination station."
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000114704,
      "SummaryText": "ironmental damage, evacuations, or sheltering in place) occurred at the SYCS during the last five years. \n      \nEmergency Response Program Summary\n\n      The LADWP is a first responder, its employees respond to chlorine accidental releases. In the event an accidental release that could result in offsite consequences occurs, external resources, such as the City of Los Angeles Fire Department will also be solicited to respond.  \n      \n      As part of the emergency response program, the LADWP has developed and implemented an emergency response plan for the purpose of protecting public health and the environment. The following elements are included:\n      \n(a) Emergency response plan, maintained at the Santa Ynez Reservoir Complex Chlorination Station and at the Los Angeles Aqueduct Filtration Plant (LAAFP) containing:\n* Organizational structure (chain-of-command) and responsibilities of various LADWP personnel.\n* Procedures for planning and coordination with off-site emergency response organizations.\n* Details of the training programs for all employees involved with the chlorination process, contractor training, and medical surveillance of LADWP personnel who respond to chlorine releases.\n* Details of emergency recognition and prevention at the LADWP.\n* Procedures for informing the public and local emergency response agencies about accidental releases.\n* Documentation of proper first aid and emergency medical treatment necessary to treat accidental human exposures and the detailed information on emergency health care.\n* Procedures and measures for emergency response after an accidental release.\n\n(b)\tProcedures for the use of emergency response equipment and for its inspection, testing, and maintenance. \n\n(c)\tTraining in relevant procedures for all employees involved with the chlorination .\n\n(d)\tProcedures to review and update, as appropriate, the emergency response plan to reflect changes and ensure that employees are informed of changes.\n\nPlanned Changes to Improve"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000114704,
      "SummaryText": "in the LADWP?s files.\n      \n      The compliance audit for the chlorination station consists of separating the RMP program elements or sections and auditing each element to determine compliance and effectiveness. For each internal audit, the audit team completes a Compliance Audit Certification Page and a Compliance Audit Checklist. The Compliance Audit Certification Page provides process identification, the dates of the audit, team members, and certification by the audit leader. The Compliance Audit Checklist details the requirements of each RMP element and contains questions that may assist with the auditing process. The audit checklist for each element consists of the following three sections:\n      \n* Records Review: A review of the RMP written Prevention Program.\n* On-Site Conditions: The audit team will review the program elements based on observation of the plant conditions and safety practices.\n* Interviews: The program elements will be evaluated by interviewing personnel from appropriate functions including operations, maintenance, management, and contractors.\n      Compliance Auditor records RMP program deficiencies identified during the audit on the checklist.\n      \nIncident Investigation\n\n      The LADWP incident investigation procedures describe incident reporting, investigation, and investigation reporting steps to be followed by plant personnel. The incident investigation is started promptly but no later than 48 hours after the event. The LADWP promptly addresses and resolves all recommendations and implements the recommendations in a timely manner to prevent an incident recurrence. All incident investigation reports are retained in the LADWP?s file for at least a period of five years from the date the reports are completed.\n      \nFive-year Accident History Summary\n\n      No chlorine release that could have caused safety or health hazard (on-site deaths, injuries, or significant property damage; known offsite deaths, injuries, property damage, env"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000114704,
      "SummaryText": "h the printed work order. The water treatment supervisor is responsible for this task.\n      \n      In addition, the written maintenance procedure is provided in the O&M Manual as follows: Preventive maintenance schedules are provided which summarize inspection, test, and maintenance schedules on a daily, weekly, bi-monthly, monthly, biannual, and annual, every 2 to 10 years, and as-needed basis. These procedures allow the operator to rapidly review what maintenance is necessary.\n      \n      The LADWP documents inspection, testing, and maintenance of chlorination equipment and assures the performance is performed in accordance with the recommendations of the manufacturer and industry groups.\n      \nHot Work Permits and Management of Change\n\n      Hot work refers to work involving electric or gas welding, cutting, brazing, or similar flame or spark producing operations. The hot work procedures require the issuance of a hot work permit whenever it is conducted on or near the chlorination process and other areas deemed appropriate as described in these procedures. Fire prevention and protection systems are in place before a hot work permit is issued. The permit indicates the dates the work is authorized for, the location, and specific operational requirements, and it is kept on file in the administrative office. \n      \n      The LADWP Management of Change procedures include steps required to be taken by plant personnel before implementing changes to chlorination equipment, procedures, raw materials, and processing conditions. Training, process safety information, operating procedures, and maintenance procedures are updated according to the changes made.\n      \nInternal Compliance Audits\n\n      The LADWP has been certifying every three years (or earlier) that compliance with Prevention Program requirements is met and that procedures and practices developed are adequate and being followed. The two most recent audit reports and a list of the recommendations are retained"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000114704,
      "SummaryText": "ce from contractors that they have informed their employees of the appropriate safety rules. The LADWP provides information and explanations concerning the hazards and processes. \n      \nPre-Startup Safety Review and Mechanical Integrity Program\n\n      The LADWP has procedures in place to ensure that a pre-startup safety review is conducted prior to starting a new covered process or prior to making modifications to the chlorination systems that require a Management of Change (MOC) procedure implementation. The required conditions prior to startup include the following:\n      \n* Construction and/or equipment are in accordance with design specifications.\n* Safety, operating, maintenance, and emergency procedures are in place and are adequate.\n* A PHA has been performed for any new facilities and recommendations have been resolved or implemented prior to startup.\n* At modified facilities, MOC requirements have been met.\n* Training of each operating and maintenance employee involved in the process is complete.\n      \n      These procedures ensure that no new and/or new/significantly modified process will startup and no regulated substances will be introduced into such a process before the pre-startup safety review. This constitutes a final check that the process and equipment are ready to go and that the recommendations of the PHA have been implemented or adequately addressed. This will ensure that the design and construction of a new or modified process is safely executed and that the facility is prepared to operate it. \n      \n      Mechanical integrity procedures for the plant ensure that written maintenance procedures are implemented and documented, including training of maintenance personnel.\n      \nMaintenance \n\n      The LADWP operates a Computerized Maintenance Management System (CMMS) software Program, an asset management program that generates a preventive maintenance work order at a designated frequency. Description of the work to be performed is included wit"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000114704,
      "SummaryText": "or safely conducting activities relating to chlorination process. They are consistent with the chlorine safety information. Written operating procedures included in the facility?s Operation and Maintenance (O&M) Manual are as follows:\n      \n* Delivery of Chlorine.\n* Ton Container Connections.\n* Initial Startup Procedure.\n* Normal Operation.\n* Normal Shutdown.\n* Temporary Operations.\n* Emergency Operations.\n* Emergency Shutdown.\n* Startup Following Emergency Shutdown.\n\nTraining\n\n      The LADWP ensures that each employee operating or maintaining the chlorination process, and each employee newly assigned to this process, is trained and tested for competency in the operating procedures listed above. LADWP employee training documentation files include training records for each employee assigned to operate or maintain the chlorination process. The training ensures that the employee has the required knowledge, skills, and abilities to safely perform the duties and responsibilities, including chlorine emergency response, as provided in the operating procedures. Employee training includes as a minimum the following elements:\n      \n* Safety Information.\n* Process Technology and Process Equipment, including safety systems.\n* Maintenance Procedures.\n* Operating Procedures for the chlorine system.\n* RMP Program contents.\n* Emergency Response Plan and Procedures.\n      \n      Refresher training is provided at least every three years to each employee operating the chlorination process to ensure that the employee understands and adheres to the current operating procedures. In addition, the LADWP ensures that operators are trained in any updated or new procedures prior to startup of a process after major modifications.  \n      \nContractors\n\n      The LADWP Contractor?s procedures specify the information required to be provided to the contractors performing work on or near the chlorination process, the training requirements for contractor employees, and mechanism to obtain assuran"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000114704,
      "SummaryText": "toring, use of automatic shutoff valve actuators, and a chlorine mini-scrubber.\n      \nProcess and Chemical Safety Information\n\n      Comprehensive chemical data has been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine. This information includes chlorine background information and Safety Data Sheets.\n      \n      Equipment safety information was compiled on the chlorine process. Specifications for the chlorine process are collected and provided in one place for easy reference. Details (such as maximum intended inventory; safe upper and lower temperatures; and safe upper and lower pressures for the chlorination facility) are on file at the facility. The LADWP also has procedures in place that are triggered to update process safety information if there is a major change that makes existing information inaccurate.\n      \nProcess Hazard Analysis\n\n      A PHA for the chlorination process was performed in January 2024 for updating/revalidating the previously performed PHA in 2019. This PHA will be updated/revalidated again within a five-year period or whenever there will be a major change in the process. A set of recommendations was made to further improve the chlorine safety. These recommendations are being evaluated for implementation. The LADWP staff will document the completion of the recommended actions. \n      \n      A seismic assessment, including the walkthrough of the chlorination facility on April 15, 2024 was completed in June 2024. An additional recommendation was made to further improve the chlorine safety during future earthquakes. This recommendation is being evaluated for implementation. The LADWP staff will document the completion of this recommended action.\n      \nOperating Procedures\n\n      The LADWP has prepared written operating procedures for Santa Ynez Reservoir Complex Chlorination Station that provide clear instructions or steps f"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000114704,
      "SummaryText": "nation station. The MS is an emergency chlorine scrubber intended to protect personnel working in the building or immediate area from a chlorine gas release from the pressure safety relief valve provided on the piping between the vacuum regulating valve and the chlorinator. It can neutralize up to 25 lbs. of chlorine, and the media manufacturer specifies chlorine removal to less than 5 parts per billion.\n      \n      In the event power is lost at the SYRC Chlorination Station, an alarm will alert the LAAFP control room. The chlorine flow will continue unaffected, with no safety consequences. Access to the facility is through gates, which are kept locked all the time.\n      \nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n      The LADWP accidental release prevention program is based on the following key elements:\n      \n* Detailed management system and clear levels of responsibilities and team member roles.\n* Comprehensive process safety information that is readily available to staff, emergency responders, and contractors.\n* Comprehensive preventive maintenance program.\n* Performance of process hazard analysis review of equipment and procedures with operation and maintenance staff participation and review.\n* State-of-the-art process and safety equipment.\n* Accurate and effective operating procedures, written with the participation of the station operators.\n* High level training for the operators and maintenance staff.\n* A State of California Water Treatment Facility Staff Certification is required to operate the station.\n* An incident investigation, inspection, and auditing program using qualified staff.\n      \n      Chemical-specific prevention steps include the following: availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine supply; awareness of the hazardous and toxic properties of chlorine; presence of chlorine detectors and alarms with remote moni"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000114704,
      "SummaryText": "n containers is stored in the SYRC chlorine building. All three chlorine ton containers can be connected to the chlorination process to feed chlorine gas. All the three ton containers rest on load cell scales, which allow operators to monitor the chlorine weight remaining in the container. Each container is restrained by two chain guards to prevent movement during earthquakes.\n      \n      Chlorine gas is withdrawn from the containers through a vacuum-regulating valve, which is installed directly on the container angle valve. Chlorine gas is pulled under vacuum from the vacuum-regulating valve through plastic tubing (polyvinyl chloride; PVC) and the chlorine PVC header lines to one or more of the three chlorinators provided at the chlorination station. In case of rupture of the plastic tubing connecting the container to the header lines, air would be drawn in rather than chlorine being released, and the vacuum regulator would shut down the chlorine supply at the container angle valve, operating as a shut-off valve. From the chlorinator, the gas is pulled by vacuum to injectors which draw chlorine gas into mixing water to form a concentrated solution. The injectors are in a cabinet near the chlorination building. The chlorine solution is then piped into diffusers to treat the reservoir and the reservoir outlet pipeline.\n      \n      Chlorine residual analyzers continuously monitor and record the treated water residuals. Three motorized valves are provided downstream of the chlorinators; these will close the chlorine gas flow from the chlorinators to maintain the chlorine residuals within the specified limits in case water flow rate reduces to zero in the pipeline feeding the Santa Ynez Reservoir.\n      \n      Chlorine leak detectors are provided inside the chlorine building, which alarm locally as well as at the LADWP?s Los Angeles Aqueduct Filtration Plant (LAAFP) at Sylmar.\n      \n      A dry media chlorine ?mini-scrubber? unit (MS) has been installed at the chlori"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000114704,
      "SummaryText": "The above information for the Santa Ynez Reservoir Complex Chlorination Station is provided below.\n      \nAccidental Release Prevention and Emergency Response Policies\n\n      The LADWP accidental release prevention policy involves a unified approach that integrates the use of proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices. All applicable requirements of the State of California and the EPA?s Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.  \n      \n      The LADWP emergency response policy involves the preparation of emergency response plans for hazardous materials, which are tailored to each facility and to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program Requirements. The LADWP has prepared an Emergency Response Plan for the Santa Ynez Reservoir Complex Chlorination Station to facilitate coordination and emergency planning with offsite response officials and facilities in the event of an emergency. The Emergency Response Plan has been coordinated with the local response agency (City of Los Angeles Fire Department). \n      \nGeneral Facility and Regulated Substance Information\n\n      The Santa Ynez Reservoir Complex Chlorination Station is located at 1351 North Palisades Drive in Pacific Palisades, California. The station serves to chlorinate water stored in the Santa Ynez Reservoir. The treated water is then piped into the distribution network which serves parts of West Los Angeles with potable water.\n      \n      The chlorination station has a building which houses chlorine stored in ton containers, three weighing systems for the ton containers, three chlorinators, a mini-scrubber, and associated process piping. The facility stores chlorine, a regulated toxic substance under the EPA and the CalARP Program rules. A maximum of three to"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000114704,
      "SummaryText": "Chlorine is the most commonly used substance for disinfecting drinking water. The addition of chlorine or chlorine compounds to water is called chlorination. Chlorination is considered to be the most important process for preventing the spread of waterborne disease in drinking water. The Los Angeles Department of Water and Power (LADWP) also uses chlorine for drinking water disinfection purposes at the Santa Ynez Reservoir Complex to protect public health per state and federal water quality standards.\n      \n      The LADWP Santa Ynez Reservoir Complex Chlorination Station (SYCS) chlorine handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program and Plan and to the California Accidental Release Prevention (CalARP) Program and Plan requirements. The chlorination facility is also subject to the California Occupational Safety and Health Administration (Cal/OSHA) Process Safety Management (PSM) Standard. The facilities subject to the EPA and the CalARP regulations are required to prepare and update Risk Management Plans (RMPs). An update of the RMP is required at least once every five years from the date of its initial submission. The RMP is to include policies and procedures followed to safely operate the facility and the actions, which will be taken by the facility in an event of an emergency.\n      \n      The LADWP prepared Program 3 Risk Management Plan for the SYCS in June 2019. This 2024 update of the 2019 RMP for SYCS and also demonstrates compliance with Program 3 requirements.\n      \n      The following information is specifically required in the RMP Executive Summary: \n      \n* Accidental release prevention and emergency response policies.\n* General facility and regulated substances information.\n* Summary of the accidental release prevention program and chemical-specific prevention steps.\n* Five-year accident history summary.\n* Emergency response program summary.\n* Planned changes to improve safety."
    }
  ]
}