{
  "FacilityID": 1000039929,
  "FacilityName": "Big Valley Ag Services",
  "FacilityStr1": "954 Highway 99",
  "FacilityStr2": null,
  "FacilityCity": "Gridley",
  "FacilityState": "CA",
  "FacilityZipCode": "95948",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06007",
  "LEPC": "Region III LEPC",
  "FacilityLatDecDegs": "39.340279",
  "FacilityLongDecDegs": "-121.683850",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 793962713,
  "ParentCompanyName": "Butte County Rice Growers Association",
  "Company2Name": null,
  "CompanyDUNS": 9167255,
  "Company2DUNS": 0,
  "OperatorName": "Dean Miller",
  "OperatorStr1": "954 Highway 99",
  "OperatorStr2": null,
  "OperatorCity": "Gridley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95948",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dean Miller",
  "RMPTitle": "President",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000086202",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "bva-87-01",
  "SafetyInspectionDate": "2012-04-09 00:00:00",
  "SafetyInspectionBy": "Butte County Environmental Health Division",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-04-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-04-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-10-31 00:00:00",
  "DeRegistrationEffectiveDate": "2017-06-01 00:00:00",
  "AnniversaryDate": "2019-04-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.34337,
  "FRS_Long": -121.68654,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049233,
      "AltID": "Aqua Ammonia Storage",
      "FacilityID": 1000039929,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000049698,
          "ProcessID": 1000049233,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059714,
          "ProcessID": 1000049233,
          "ChemicalID": 57,
          "Quantity": 77000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000559714,
          "ProcessID": 1000049233,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039929,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1.    Facility Accidental Release Policy\n\nThe owners, management, and employees of the Big Valley Ag Services, Gridley Facility (herein referred to as BVAS or the Facility) at 954 Highway 99, Gridley, California 95948 are committed to the prevention of any accidental release of aqua ammonia.  If an accidental release should occur, the Facility is prepared to work with the local fire department, or other authorities to mitigate any release and minimize the impact of the release to people and the environment.  A detailed Emergency Response Plan has been developed and will be implemented in the event of an accidental release.\n\n2.    Facility Information\n\n?    The Facility is a retail agricultural facility whose primary activity is the storage and sale of fertilizers, in addition to, the sale of pre-packaged agricultural chemicals to farmers.\n\n?    Aqua ammonia is received by truck, stored in one 10,000 gallon aboveground storage tanks, and distributed for direct application as crop production nutrients..  The maximum quantity of aqua ammonia handled at the site is 77,000 pounds.\n\n3.        The Worst-Case Release Scenario and Alternative Release Scenario\n\nAqua Ammonia Worst-Case and Alternative Release Scenarios.  The worst-case release scenario is a release of 77,000 pounds of aqua ammonia, the volume of the largest storage tank when full, in to the secondary containment berm. The alternative release scenario based on the hazard review (or a more plausible potential incident) is a release from a pipe break modeled with an increased wind speed and \"D\" Stability modeling parameters.\n\n4.    Accidental Release Prevention Program\n\nThe Facility has implemented the following prevention program elements.\n\nSafety Information:  BVAS ensures that information concerning covered processes and regulated substances are up-to-date and available for review by employees.  The most recent review of safety information pertaining to the covered processes took place on January 2, 2014.\n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039929,
      "SummaryText": "\nHazard Review:  A hazard review of the regulated processes is conducted every five years or as needed by changes in the processes.  The most recent update of the hazard review was conducted on March 14, 2014.  Results indicate that no high risk hazards were identified through the hazard review update.\n\nOperating Procedures:  Written standard operating procedures have been developed for the covered process and are reviewed and revised as needed.  The operating procedures were last revised on March 14, 2014.\n\nTraining:  The BVAS staff, as well as the Butte County Rice Growers Association (BUCRA) corporate staff, understands that incidents involving the accidental release of regulated substances can be reduced by having trained operations and maintenance staff.  A training program, which incorporates specific operating procedures and safe work practices, is an essential element of an effective prevention program.  The training program was last reviewed on January 2, 2014.  The current training program is comprised of the following:\n\n?    Initial employee training;\n\n?    Periodic refresher training;\n\n?    Training provided as a result of a new equipment addition or modification;\n\n?    Competency testing involving written tests and observation following training; and\n\n?    Training records for each employee.\n\nMaintenance:  The maintenance program at the Facility is intended to preserve the mechanical integrity of the process equipment to minimize the potential for an accidental release.  The maintenance program includes equipment inspection, preventative maintenance, recordkeeping, and training.  The latest equipment inspections were conducted on February 14, 2014 and the latest review of maintenance procedures was conducted on March 14, 2014.\n\nCompliance Audits:  Periodic compliance audits to assess the effectiveness of the written plan must be conducted every three years.  Records of the audits and follow-up documentation are maintained to indicate findings and resolution of finding"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039929,
      "SummaryText": "s.  The most recent compliance audit was conducted on March 14, 2012.\n\nIncident Investigation:  An incident investigation program is in place at the Facility and incident investigation procedures would be implemented, if needed.\n\n5.    Five-year Accident History\n\nThere have been no accidental releases of aqua ammonia during the last five years resulting in death, injuries, evacuation, sheltering in place, or property or environmental damage.\n\n6.    The Emergency Response Program\n\nThe Facility's emergency response program has been developed in accordance with the following regulations:\n\n?    OSHA 29 CFR 1910.38; and\n\n?    Section 25503, Division 6.95 of the California Health and Safety Code, Hazardous Materials Business Plan.\n\nThe Emergency Response Plan was most recently updated on January 25, 2011 and will be implemented in the event of a release of a regulated substance.\n\n7.    Planned Changes to Improve Safety\n\nSafety improvement is an on-going activity at the Facility.  Periodic evaluations will be performed to assess the maintenance of safe conditions.  Specific changes to the aqua ammonia process at the Facility will be implemented as needed.\n\n"
    }
  ]
}