{
  "FacilityID": 1000020176,
  "FacilityName": "Johnson Controls, Inc. Greenfield",
  "FacilityStr1": "1147 N. Washington Street",
  "FacilityStr2": null,
  "FacilityCity": "Greenfield",
  "FacilityState": "OH",
  "FacilityZipCode": "45123",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39071",
  "LEPC": "Highland County LEPC",
  "FacilityLatDecDegs": "39.355556",
  "FacilityLongDecDegs": "-083.388889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.johnsoncontrols.com",
  "FacilityEmailAddress": "debra.l.lacey@jci.com",
  "FacilityDUNS": 6556849,
  "ParentCompanyName": "Johnson Controls, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 199558404,
  "Company2DUNS": null,
  "OperatorName": "Johnson Controls, Inc.",
  "OperatorStr1": "1147 N. Washington Street",
  "OperatorStr2": null,
  "OperatorCity": "Greenfield",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45123",
  "OperatorZipCodeExt": null,
  "FTE": 150,
  "OtherEPAFacilityID": "45123JHNSN1147",
  "EPAFacilityID": "100000085169",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0536010034",
  "SafetyInspectionDate": "2008-11-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-02-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-02-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-02-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-02-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.355556,
  "FRS_Long": -83.388889,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000024544,
      "AltID": "auto seating foam",
      "FacilityID": 1000020176,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000029128,
          "ProcessID": 1000024544,
          "ChemicalID": 77,
          "Quantity": 244000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000024906,
          "ProcessID": 1000024544,
          "NAICSCode": "33636",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000020176,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-02-07 00:00:00",
    "ERTrainingDate": "2011-02-07 00:00:00",
    "CoordinatingAgencyName": "Highland County LEPC",
    "CoordinatingAgencyPhone": "9373935880",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000020176,
      "SummaryText": "JOHNSON CONTROLS INC. GREENFIELD, OHIO\n\n1.\tEXECUTIVE SUMMARY\n\nJohnson Controls, Inc., owns and operates a foam seat manufacturing facility located in Greenfield, Ohio. This facility idled its production in July of 2009, this facility did submit a de-registration form to the RMP reporting center on September 3rd 2009. This facility is in the process of resuming production on or around March 1st of 2011.  The Greenfield facility plans to operate a process that uses LUPRANATE;8020 ISOCYANATE, a liquid chemical that contains two toxic substances regulated under EPA's Risk Management Program (40 CFR Part 68), toluene-2,4-diisocyanate and toluene-2,6-diisocyanate referred to here as Toluene diisocyanate (unspecified isomer) [Benzene, 1,3-diisocyanatomethyl-] TDI.  TDI will be delivered to the plant via tank trucks which will fill up to six 5000-gallon storage tanks located inside of the plant within a specially designed containment room.  The threshold quantity for the Risk Management Plan for TDI is 10,000 lb. With a density of 10.2 lb per gallon the maximum amount of LUPRANATE that can be stored at the plant is 306,000 lbs, which corresponds to about 244,000 lb of TDI.   \n\nSince the quantity of TDI exceeds the threshold quantity, this facility is required to implement a Risk Management Program (RMP).  The Greenfield facility is subject to Program Level 1 requirements.  This submission of RMPSubmit presents the details of the RMP compliance measures conducted by the Greenfield facility. The submission of the required RMP information was electronically submitted to the United States Environmental Protection Agency (U.S. EPA) in a timely manner before the deadline of June 21, 1999. It was re-submitted as a five year update on September 10, 2004. The next five year udpate was due on September 8, 2009 but due to the plant idleing, a de-registration form was submitted. Previous RMP submissions had the site at program level 2 because of the receipt by rail.  And at this time T"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000020176,
      "SummaryText": "DI will only be received by truck.\n\n1.1\tAccidental Release Prevention and Emergency Response Policies\nAt the Greenfield facility, certain precautions, such as implementing engineering controls, and wearing appropriate personal protective equipment, including respiratory protection if exposure limits may be exceeded, are taken when handling TDI itself or equipment that has been in contact with the chemical.  In order to prevent accidental release of the chemical from various sources, numerous safety procedures have been enacted to ensure the maximum safety of the employees working with TDI and the population surrounding the plant.  Employees of the plant have been trained in the proper handling of TDI and in the actions to be taken in case of an accidental release.\n\nThe Greenfield's emergency response policies have been designed to comply with all applicable state and federal regulations.  These policies also summarize the actions that need to be taken in response to a chemical release.\n\n1.2\tDescription of the Greenfield facility and the Regulated Substance Handled\nThe Greenfield facility, an ISO-14001 certified facility, produces molded polyurethane foam for automotive seating applications.  Foam production is a result of a specific blend of chemicals, including TDI, which are poured into specially designed molds.  Once the foam is inspected for imperfections and then packed and shipped to Johnson Controls customers.\n\nThe regulated substance handled at this facility is toluene-2,4-diisocyanate and toluene-2,6-diisocyanate (TDI). The maximum amount of TDI that can be stored in the plant is 244,000 pounds.\n\n1.3\tWorst Case and Alternate Release Scenarios\nA worst-case consequence analysis has been conducted in accordance with RMP requirements. The RMP regulation defines a worst-case release of a liquid as an instantaneous spill of a single vessel accounting for passive mitigation including physical barriers that prevent the spread of the resulting pool and enclosures wh"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000020176,
      "SummaryText": "ich would limit the rate of evaporation.  The temperature of the release is the maximum daily temperature over the past three years or the process temperature, whichever is higher.  The release to the atmosphere is assumed to be at ground level and dispersion conditions are set to atmospheric stability category F (very stable) and a surface (10 m) wind speed of 1.5 m/sec.   \n\nGiven that the tank truck is covered under DOT regulations, it is not considered part of the RMP regulated process unless the tank is disconnected from the motive force.  In this case the tank truck remains connected to the motive force and so is not part of the regulated process.  If it is conservatively assumed that a storage tank is filled to its 5000 gallon capacity, the worst-case release involves 51,000 lb of LUPRANATE.  This release will be entirely contained within the 24' 5 x  45' 8 containment room.  Accounting for the six approximately 8-ft diameter tanks, the effective spill area is 813 sqft.  The room is maintained at a temperature of about 80 F to 90 F and the process temperature of the LUPRANATE under storage is no greater than 110 F.  This process temperature, which is greater than the maximum recorded outdoor temperature in Ohio over the past three years, is used in the assessment.  \nThe containment room is not ventilated except for a 2 ft x 2 ft window in the roof near the center of the room which would be opened in the event of a spill.  Although the roof vent is more than 22 ft above the ground, in accordance with the RMP definition of a worst-case release the release is conservatively assumed to be at ground level.  Without active mitigation, which is not considered for a worst-case release, the rate of release of TDI to the atmosphere from will eventually equal the rate that it is emitted from the exposed floor area of the containment room.\n\nTo estimate the steady state rate of release from the spill area, Equation D-1 of EPA's Risk Management Guidance for Offsite Conseq"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000020176,
      "SummaryText": "uence Analysis (EPA 550B99009) was applied.\n\nBecause TDI has a high molecular weight with respect to air, worst-case dispersion was modeled with SLAB, a public domain heavy-gas model developed by Lawrence Livermore Laboratory.  SLAB was applied assuming a ground level release from a 4 sqft area.  The ambient temperature and humidity was set to the RMP default of 77 F and 50%, respectively and the surface roughness was set to 10 cm, indicative of the combination of industrial and rural dispersion environment.  SLAB was used to estimate the distance at which the worst-case ground-level concentration would fall below the RMP toxic endpoint for TDI of 0.007 mg/liter (0.98 ppmv).  The worst-case endpoint distance was estimated to be 35 m.\n\nThe closest property boundary from the containment room vent is approximately 100m to both the north and the south.  Given that the modeled worst-case endpoint distance is 35m, no off-site receptors will be affected and as such the Johnson Controls Greenfield facility meets the RMP Program 1 off-site hazards requirement.\n\n1.4\tThe General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n The Greenfield facility has specific process controls in place to minimize the risks of spills.  All chemical storage tanks are located indoors, above ground with secondary containment.  Tanks critical to the process have level sensors to prevent any tank from being overfilled.  Fill duration is also monitored during the transfer of TDI to the process lines and if not satisfied within a set time period, auto filling ceases and an alarm is activated.  Chemical wet systems are equipped with high and low-pressure switches to shut down in the event of a line rupture.  Critical valves are monitored electronically as to open/closed positioning.\n\nThe Greenfield facility has a preventative maintenance software program in place to address maintenance of all vital parts of the plant's day to day operations.  Specific environmental issu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000020176,
      "SummaryText": "es are also addressed with this computer driven program.\n\nThe Greenfield facility has established an Air Monitoring Program that monitors the airborne concentration of  TDI within the production facility.\n\nProperty Conservation and Risk Management audits are conducted annually by Factory Mutual Risk Appraisers as well as Environmental audits by the Automotive Experience business environmental department located  in Plymouth, Michigan.\n\n1.5\tFive-Year Accident History\nIn the past five years, there have been no accidental releases of TDI at the Johnson Controls Greenfield facility.\n\n1.6\tThe Emergency Response Program\nThe Greenfield facility's emergency response policies have been designed to comply with all applicable state and federal regulations.  These policies summarize the actions to be taken in response to a chemical release.  In the event of a release, the HazMat Team will respond using appropriate actions, as described in the Environmental Spill Contingency Plan, in association with the local fire department and Veolia Environmental Services Companies.\n\nThe Greenfield facility has established a spill response team (HazMat Team) and has assigned specific duties and responsibilities to specific individuals, like the spill Incident Commander, who have been selected and trained to respond to in-house chemical releases.  If necessary, the appropriate outside facilities, such as the hospital or nearby residences and businesses, will be notified.  Employees are and will be trained in the safe handling and management of hazardous materials, respiratory protection, confined space entry, transportation of dangerous goods, and in the emergency response procedures to be taken in the event of an accidental release.\n\nAll spills that take place at the Greenfield facility must be documented and reported to the appropriate personnel.  The reporting allows the number and type of spills that occur to be tracked.  This in turn allows measures to be implemented to prevent similar s"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000020176,
      "SummaryText": "pills from occurring in the future.  Spills exceeding the reportable quantity must be reported to certain regulatory agencies.\n\nIf a release of 10 gallons or more of TDI has occurred, Johnson Controls will inform BASF Chemicals, the supplier of TDI, of the accidental release and inquires about assistance and advice.\n\n1.7\tPlanned Changes to Improve Safety\nThe Greenfield facility is committed to continuous improvement in all aspects of its operation, including safety.  As such, the facility strives to take a proactive approach to ensure employee safety, health and wellness and to protect the environment.\n\nThe facility conducts routine inspections and audits to ensure safe work conditions and compliance to applicable regulations.  These inspections and audits may be conducted by internal personnel from various levels of the organization (line employee to plant manager), by Johnson Controls personnel from other locations, or by outside consultants.  Results of the inspections and audits are documented and communicated, and action plans are developed to correct noted deficiencies."
    }
  ]
}