{
  "FacilityID": 1000093163,
  "FacilityName": "Cytec Industries Inc. - Mt. Pleasant Site",
  "FacilityStr1": "7910 Mt. Joy Road",
  "FacilityStr2": null,
  "FacilityCity": "Mt. Pleasant",
  "FacilityState": "TN",
  "FacilityZipCode": "38474",
  "Facility4DigitZipExt": "0152",
  "FacilityCountyFIPS": "47119",
  "LEPC": "Maury County LEPC",
  "FacilityLatDecDegs": "35.519154",
  "FacilityLongDecDegs": "-087.241478",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.solvay.com",
  "FacilityEmailAddress": "Travis.Martin@solvay.com",
  "FacilityDUNS": 4038550,
  "ParentCompanyName": "Cytec Industries Inc.",
  "Company2Name": "Solvay Holding Inc.",
  "CompanyDUNS": 809749948,
  "Company2DUNS": 874748937,
  "OperatorName": "Cytec Industries Inc.",
  "OperatorStr1": "7910 Mt. Joy Road",
  "OperatorStr2": null,
  "OperatorCity": "Mt. Pleasant",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38474",
  "OperatorZipCodeExt": "0152",
  "RMPContact": null,
  "RMPTitle": "Health Safety and Environmental Mgr",
  "FTE": 94,
  "OtherEPAFacilityID": "38474CMRCSMTJOY",
  "EPAFacilityID": "100000025723",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-05-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-05-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-05-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-05-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-05-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 35.52108,
  "FRS_Long": -87.22765,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115755,
      "AltID": "Process A",
      "FacilityID": 1000093163,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000117168,
          "ProcessID": 1000115755,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144717,
          "ProcessID": 1000115755,
          "ChemicalID": 70,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 70,
            "ChemicalName": "Phosphorus oxychloride  [Phosphoryl chloride]",
            "CASNumber": "10025-87-3",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000644717,
          "ProcessID": 1000115755,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000115756,
      "AltID": "Storage A",
      "FacilityID": 1000093163,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000117169,
          "ProcessID": 1000115756,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144718,
          "ProcessID": 1000115756,
          "ChemicalID": 70,
          "Quantity": 55000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 70,
            "ChemicalName": "Phosphorus oxychloride  [Phosphoryl chloride]",
            "CASNumber": "10025-87-3",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000644718,
          "ProcessID": 1000115756,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093163,
      "SummaryText": "Introduction\n\n\n\nThe Cytec Mt. Pleasant Site has been manufacturing chemicals safely for over 50 years.  The site originated as Victor Chemical in 1957.  The Site became part of Cytec Industries in August 2003 and later became a legal entity of Solvay Holding Inc. in 2016.  The Mt. Pleasant Site has 94 full-time employees.  The chemicals manufactured at the Mt. Pleasant Site are used by industries to make products familiar to our daily lives - plastics, acrylics, make-up, copper, and gold.  The Site consists of over 1600 acres with approximately 100 acres used as manufacturing space.  \n\n\n\nUnderstanding and managing risks is a fundamental part of how we operate.  Cytec is committed to continuously improve its safety, health, and environmental performance.  The Mt. Pleasant site takes safety very seriously and the site has an excellent program in place to prevent accidental releases of all the chemicals we handle.  The site uses a variety of safety and operating procedures to prevent releases from occurring.  Our employees are committed to working safely with all of the chemicals the site handles as evidenced by an excellent safety record.\n\n\n\n(a) Accidental Release Prevention and Emergency Response Policies:\n\n\n\nThe Mt. Pleasant Site has one chemical that is covered by the RMP rule (phosphorus oxychloride).  This chemical is considered hazardous by the EPA.  This chemical is used as a raw material in our manufacturing process. The site will also be storing this chemical in one of our on-site warehouses separate from the manufacturing process.\n\n\n\nSince this chemical is new to the Mt. Pleasant site, there have been no accidental chemical releases that have impacted the health and safety of the local community around our facility.  It is the site's policy to meet all the laws and regulations relevant to our industry at the local, state, and federal levels.  The properties that make these chemicals valuable as building blocks for our manufacturing processes also make it nec"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093163,
      "SummaryText": "essary to observe certain safety precautions.  These precautions include handling all chemicals to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community.  Safety depends upon the manner in which the site handles these chemicals combined with the safety devices inherent in the design of this facility combined with safe handling procedures that we use and the training of our personnel.\n\n\n\nIf an accidental chemical release were to occur, the Mt. Pleasant Site has a comprehensive emergency response program to respond to such a release.   Our plant employees are trained as emergency responders and have both hazardous materials response and fire-fighting training.  Our emergency response plan includes procedures for notification of the local fire/police authorities who are responsible for notification of the local community if necessary.  \n\n\n\n(b) The Stationary Source and Regulated Substances Handled\n\n\n\nThe RMP covered substance, phosphorus oxychloride (CAS# 10025-87-3), is used as a raw material in our manufacturing process. This chemical is received by truck, packaged in drums and will be transported to the storage area and manufacturing process with a fork lift.  Access to the Site is restricted to authorized facility employees, authorized management personnel, and authorized contractors.\n\n\n\n(c) The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nThe Mt. Pleasant Site manufacturing facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  The Mt. Pleasant site has an existing accidental release prevention program already in place that was developed for the OSHA Process Safety Management regulation.  The details of the prevention program are summarized below:\n\n\n\n**Process Safety Information**\n\nWritten process safety information has been compiled for both of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093163,
      "SummaryText": " the covered processes at the Mt. Pleasant Site.  This information enables Mt. Pleasant Site management and the employees involved in operating the process to identify and understand the hazards posed by those production facilities involving highly hazardous chemicals. This information is kept current by the Safety, Health, and Environmental and Process Engineering Departments.  The data includes information pertaining to the hazards of the regulated substances, information pertaining to the technology of the process, and information pertaining to the equipment in the process.  The information is available to all employees, 24 hours/day.\n\n\n\n**Process Hazards Analysis**\n\nProcess hazard analysis (PHA) have been completed on the covered process.  The site primarily uses the hazard and operability (HAZOP) analysis technique to perform these evaluations. HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques. Findings that result from the PHAs are promptly addressed.  The PHA teams are led by a trained PHA leader and are made up of a cross-section of plant departments, knowledgeable process engineers and include technicians from both the Production and Maintenance Departments.   Refer to Section 7 of the RMP submission for the Mt. Pleasant Site for specific details concerning the PHAs.  Any significant process changes include a PHA prior to implementation and startup. \n\n\n\n**Operating Procedures and Training\"\n\nThe Mt. Pleasant Site has developed and implemented written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent with the process safety information.  These operating procedures are reviewed as often as necessary to assure that they reflect current operating practice, including those that result from changes in process chemicals, technology, and equipment, and changes to facilities.  Production management certifies annually that these operating "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093163,
      "SummaryText": "procedures are current and accurate.  Production employees involved in operating the covered processes receive training to assure that the employee understands and adheres to the current operating procedures of the processes.  Management in consultation with the employees involved in operating the process, determine the appropriate frequency of refresher training.   \n\n\n\n**Mechanical Integrity**\n\nThe Mt. Pleasant Site has established written procedures to maintain the on-going integrity of process equipment.  The mechanical integrity program includes inspection and testing procedures that follow recognized and generally accepted good engineering practices.  The frequency of inspections and tests of process equipment are consistent with applicable manufacturers' recommendations, Site Engineering Procedures, and good engineering practices, and more frequently if determined to be necessary by prior operating experience, and equipment history review.  Any deficiencies found during the inspection and testing are promptly corrected.  The mechanical integrity program includes training each employee involved in maintaining the on-going integrity of process equipment in an overview of that process and its hazards and in the procedures applicable to the employee's job tasks to assure that the employee can perform the job tasks in a safe manner.\n\n\n\n**Management of Change and Pre-Startup Review**\n\nThe Mt. Pleasant Site has established and implemented a written procedure to manage changes to process chemicals, technology, equipment, and procedures; and changes to structures and facilities that affect a covered process.  The procedure includes authorization requirements by site management as well as steps taken to assure that employees whose job tasks will be affected by a change in the process are informed of, and trained in, the change prior to start-up of the process or affected part of the process.  Site management performs pre-startup safety reviews for new facilities and for"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093163,
      "SummaryText": " modified facilities when the modification is significant enough to require a change in the process safety information.\n\n\n\n**Compliance Audits** \n\nTo help ensure that the accident prevention program is functioning properly, the Mt. Pleasant Site periodically conducts and audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. Both hourly and management personnel participate in these audits. The audit team develops findings that are forwarded to plant management for resolution. Corrective actions taken in response to the audit team's findings are tracked until complete. The final resolution of each finding is documented, and the two most recent audit reports along with the resolution of findings are retained.\n\n\n\n**Incident Investigation**\n\nThe Mt. Pleasant Site investigates each incident which resulted in, or could reasonably have resulted in a catastrophic release of any highly hazardous chemical in the workplace.  An incident investigation team is established immediately following an incident.  The investigation team consist of employees involved in the process and includes a contract employee if the incident involved work of the contractor, and other persons with appropriate knowledge and experience to thoroughly investigate and analyze the incident.  A report is prepared at the conclusion of the investigation and an established system is in place to promptly address and resolve the incident report findings and recommendations.  \n\n\n\n**Employee Participation**\n\nThe Mt. Pleasant Site management believes that broad and active employee participation in all elements of the PSM Program will enhance the overall program.  A cross section of Mt. Pleasant Site employees from all levels of the organization are involved in the design and implementation of the RMP and PSM Programs. \n\n\n\n**Hot Work Permit**\n\nThe Mt. Pleasant Site has a comprehensive hot work"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000093163,
      "SummaryText": " permit program to ensure that the proper preparations have been taken to prevent fire or explosions in the work place.  The permit documents that applicable fire prevention and protection requirements have been implemented prior to beginning the hot work operations.  Both Mt. Pleasant and contractor employees receive training on hot work permits.\n\n\n\n**Contractors**\n\nThe Mt. Pleasant Site is committed to ensuring that all of its employees, as well as, all contract employees are provided with a safe place to work.  The site expects that all contractors and their employees will support this effort by working within recognized safety standards and actively complying with the Mt. Pleasant Site Safety Manual.   Contractors receive training and understand that safe work practices are a condition of employment.  Prior to starting work on the Mt. Pleasant Site, each qualified contractor employee receives an initial safety orientation.  The contractor employees must successfully pass a written safety proficiency exam before he/she can begin work on the Mt. Pleasant Site.\n\n\n\n**Chemical Specific Prevention Steps**\n\n\n\n-Phosphorus Oxychloride\n\nThe phosphorus oxychloride handling system has been designed to prevent accidental releases and a system is in place to respond quickly in case of a release. Phosphorus oxychloride is delivered to the site in drums. The drums are charged to a reactor with the continual presence of and monitoring by a process technician. The technician is stationed at the unloading station ready to respond in an emergency. The containment area surrounding the charging and processing facilities has a passive mitigation containment system that is enclosed and is large enough to contain a full accidental release of the largest tank of material. The process technician has the ability to remotely stop the flow of phosphorus oxychloride by remotely closing the tank bottom valve in case of a release. All of the phosphorus oxychloride associated equipment is includ"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000093163,
      "SummaryText": "ed in the Mt. Pleasant Site's mechanical integrity program; preventive maintenance (PM) and testing is completed on a routine basis. Any deficiencies found during the PM and testing are corrected promptly by production management.\n\n\n\n(d) The Five Year Accident History\n\n\n\nSince this is a new chemical to the site, there has been no reportable quantity accidental releases in the last five years.  The Mt. Pleasant Site has a comprehensive incident investigation program whereby all incidents, including minor events, are investigated by members of management.  Since the Mt. Pleasant Site is located in a relatively remote, unoccupied area, it is extremely unlikely that any incident involving the RMP covered substance could result in an off-site release.  \n\n\n\n(e) The Emergency Response Program\n\n\n\nThe Mt. Pleasant site has a very comprehensive emergency response system in place. The site takes safety very seriously and it has an excellent program in place to prevent accidental releases of all the chemicals the site handles. In the event that an emergency does occur, the site employees have received extensive safety, health, and environmental training and they continue to train on a monthly basis.  The Mt. Pleasant site employees are committed to working safely with all the chemicals we handle.\n\n\n\nThe site emergency response team is made up of plant employees.  The employees are trained as emergency responders and have both hazardous materials response and fire-fighting training.  The employees who participate in the emergency response have received special training on the RMP covered substances.  The site emergency response plan includes procedures for notification of the local fire/police authorities who are responsible for notification of the local community if necessary.  If an accidental chemical release did occur that impacted the local community, local citizens would receive information/directions from the Mt. Pleasant City and Maury County emergency response agencies "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000093163,
      "SummaryText": "as to the steps you should take to protect yourself.\n\n\n\n(f) Planned Changes to Improve Safety\n\n\n\nImprovements that are currently underway include the following:\n\n\n\n* Improved production operator training for new processes\n\n* Improve reactor jackets to eliminate the use of water based heat transfer fluid\n\n* Upgraded PPE for production technicians\n\n* Upgrade the site security systems\n\n\n\n"
    }
  ]
}