{
  "FacilityID": 1000065098,
  "FacilityName": "Markwest Hopedale Fractionator",
  "FacilityStr1": "46700 Giacobbi Road",
  "FacilityStr2": null,
  "FacilityCity": "Jewett",
  "FacilityState": "OH",
  "FacilityZipCode": "43986",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39067",
  "LEPC": "Harrison County LEPC",
  "FacilityLatDecDegs": "40.332369",
  "FacilityLongDecDegs": "-80.936484",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.markwest.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "MarkWest Ohio Fractionation Company, L.L.C.",
  "Company2Name": "MarkWest Energy Partners, L.P.",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Rick Kline",
  "OperatorStr1": "46700 Giacobbi Road",
  "OperatorStr2": null,
  "OperatorCity": "Jewett",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43986",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jim Morrocco",
  "RMPTitle": "Safety Coordinator",
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000223607",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-05-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-07-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-07-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-07-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-07-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000081654,
      "AltID": "NGL Fractionation",
      "FacilityID": 1000065098,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000082896,
          "ProcessID": 1000081654,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000101702,
          "ProcessID": 1000081654,
          "ChemicalID": 98,
          "Quantity": 76000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000101703,
          "ProcessID": 1000081654,
          "ChemicalID": 118,
          "Quantity": 35000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000101704,
          "ProcessID": 1000081654,
          "ChemicalID": 107,
          "Quantity": 21000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000101705,
          "ProcessID": 1000081654,
          "ChemicalID": 125,
          "Quantity": 11000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000101706,
          "ProcessID": 1000081654,
          "ChemicalID": 115,
          "Quantity": 94000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 115,
            "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
            "CASNumber": "78-78-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000101707,
          "ProcessID": 1000081654,
          "ChemicalID": 137,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 137,
            "ChemicalName": "2,2-Dimethylpropane [Propane, 2,2-dimethyl-]",
            "CASNumber": "463-82-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000101708,
          "ProcessID": 1000081654,
          "ChemicalID": 105,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 105,
            "ChemicalName": "Ethyl mercaptan [Ethanethiol]",
            "CASNumber": "75-08-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601702,
          "ProcessID": 1000081654,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601703,
          "ProcessID": 1000081654,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601704,
          "ProcessID": 1000081654,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601705,
          "ProcessID": 1000081654,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601706,
          "ProcessID": 1000081654,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601707,
          "ProcessID": 1000081654,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601708,
          "ProcessID": 1000081654,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000065098,
      "SummaryText": "MarkWest Ohio Fractionation Company, L.L.C. - Hopedale Facility\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe MarkWest Ohio Fractionation Company, L.L.C. (MarkWest) - Hopedale facility located in Jewett, Ohio is strongly committed to employee, public, and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program that covers such areas as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is the policy of MarkWest to implement appropriate controls to prevent the possible release of regulated substances.  Unforeseeably, if such a release does occur, MarkWest is completely coordinated with the Harrison County, Ohio Local Emergency Planning Committee (LEPCs) which provide emergency response personnel to control and mitigate the effects of the release.\n\n\n\n2.    The Stationary Source and the Regulated Substance Handled\n\n\n\nThe primary function of the MarkWest facility encompasses the fractionation of natural gas liquids (NGLs).  The NGL stream is separated into purity products of Propane, Iso-Butane, N-Butane, and Natural Gasoline, which consists of Iso-Pentane and Normal-Pentane amongst other things.  Ehtyl Mercaptan is also stored at the site and is used as an odorant in some propane shipments.  \n\n\n\nThe NGL are received through NGL pipelines to the facility.  They are separated using extraction towers with specific heats and pressures to isolate each purity product.  Once separated the products are stored in storage tanks at the site awaiting shipment via pipeline, truck or rail.  \n\n\n\nThe total quantity of product stored in the vessels and the total of each substance over the threshold for RMP substances has been calculated in a separate document that is available for review but is not included in this summary as it may contain confidential business information.  \n\n\n\n3.    The Worst Case Release Scenario and Alternative R"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000065098,
      "SummaryText": "elease Scenario\n\n\n\nThe parameters of the offsite consequence analyses for this MarkWest facility were based on the requirements set forth in the RMP rules outlined in 40 CFR 68.25 (e), Worst-case release scenario-flammables, and 40 CFR 68.28, Alternative release scenario analysis.  The worst case and alternative case radii of effect were determined utilizing RMP*Comp software provided by the EPA.\n\n\n\nThe worst-case scenario would be a complete rupture failure of a propane storage tank leading to a complete loss of the product in the tank. Other tank failures were evaluated as well but the propane tank led to the largest radius in the worst-case scenario computations. The alternative-case scenario is described as a hose failure during loading of a railcar or tanker truck which would lead to a release.  This release is described as a five-minute release until the valves are completely shut off, which would lead to up to 5,000 gallons (24,000 pounds) of propane being released.  Additional alternative-case scenarios were considered including leaking components; however, none of the other cases were more likely to occur or would have a greater release than the alternative scenario chosen.\n\n\n\nThe worst-case and alternative-case radius of impact were determined using the EPA RMP-COMP model. In evaluating the worst-case and alternative-case scenarios there were no administrative controls or mitigation measures taken into account to reduce potential off-site impact. Populations within that radius were determined using the Circular Area Profiling System (CAPS), Version 10c using data from Summary File 1, 2010 Census and by inputing the coordinate points and the radius of influence.  \n\n\n\n4.    The General Accident Release Prevention Program and the Chemical-Specific Prevention \n\n    Steps\n\n\n\nMarkWest has taken all the necessary steps to comply with accidental release prevention requirements set out under 40 CFR Part 68 of the EPA regulations.  The propane, normal butane, isobutane, n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000065098,
      "SummaryText": "atural gasoline, and NGL storage and distribution processes at MarkWest are subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.\n\n\n\nThe following briefly describes the elements of the release prevention program in place at the MarkWest stationary source.\n\n\n\nProcess Safety Information\n\n\n\nMarkWest maintains a detailed record of written safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis\n\n\n\nMarkWest conducts comprehensive studies to ensure that the hazards associated with the processes at the facility are identified and controlled efficiently.  The hazard and operability (HAZOP) study in conjunction with the \"What If?\" and checklist methodology is used to carry out these analyses.  The studies are undertaken by a team of qualified personnel in engineering and process operations and are revalidated at regular intervals.  Any findings related to the hazard analyses are addressed in a timely manner.\n\n\n\nOperating Procedures\n\n\n\nFor the purpose of safely conducting activities within covered processes, MarkWest maintains written operating procedures.  These procedures address various modes of operation such as initial start up, normal operations, temporary operations, emergency shutdown, normal shutdown, and startup after turn around.  The information is regularly reviewed and is readily accessible to operators involved with the process.\n\n\n\nTraining\n\n\n\nMarkWest has a comprehensive training program in place to ensure that the employees operating processes are completely competent in the operating procedures associated with the processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided as needed.\n\n\n\nMechanical Integrity\n\n\n\nThe integrity of mechanical operations at "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000065098,
      "SummaryText": "MarkWest is ensured through documented maintenance checks on process equipment.  Process equipment examined by these checks include among others: pressurized storage vessels, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\n\n\nWritten procedures are in place at MarkWest to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel, or any other employees whose job tasks are affected by a modification in process conditions are promptly made aware of and are trained on the specifics of the modification.\n\n\n\nPre-Startup Reviews\n\n\n\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted as required.  These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\n\n\nMarkWest conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out every three years as required by RMP regulations (40 CFR 68.58) and any corrections required as a result of the audits are undertaken in a safe and timely manner.\n\n\n\nIncident Investigation\n\n\n\nMarkWest investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident, as well as any corrective actions needed to prevent the release from reoccurring.  All reports are retained for a period of five years.\n\n\n\nEmpl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000065098,
      "SummaryText": "oyee Participation\n\n\n\nMarkWest believes that successful PSM and accident prevention programs require a team effort.  Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, MarkWest employees have access to all information created as part of the facility's implementation of the RMP program, in particular, information relating to and resulting from process hazard analysis. \n\n\n\nContractors\n\n\n\nPeriodically, MarkWest hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of the safety performance of the contractor is undertaken.  MarkWest has a strict policy of informing contractors of known potential hazards relating to the contractor's work and the associated processes.  Contractors are also informed of all procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n5.    Five Year Accident History\n\n\n\nMarkWest has had an excellent record of preventing accidental releases over the last five years.  Due to stringent release prevention policies, there have been no accidental releases during this period.\n\n\n\n6.    Emergency Action Plan\n\n\n\nA written emergency action plan to deal with accidental releases of regulated substances is retained at the MarkWest facility.  The plan includes all aspects of emergency response including medical treatment, evacuations, and notification of local emergency response agencies and the public.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within processes that would require a modified emergency response.\n\n\n\nThe Harrison County, Ohio LEPC is the local emergency response agencies with which our emergency plan has been coordinated and verified.\n\n\n\n7.    Planned Changes to Improve Safety  \n\n\n\nMarkWest will cont"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000065098,
      "SummaryText": "inue to monitor the implementation of the RMP program at the Hopedale facility to ensure that accidental release of flammable materials does not occur.  \n\n\n\n8.    Conclusion\n\n\n\nMarkWest Ohio Fractionation Company, L.L.C. has taken all necessary measures required by EPA and OSHA regulations to ensure the continued safe operations of the MarkWest - Hopedale facility.  The Risk Management Plan provided herein summarizes the active release prevention program that is currently in place at the facility.  This risk management program illustrates MarkWest's commitment to employee, public, and environmental safety.  In the unforeseeable event that a release does occur, MarkWest's emergency action plan combined with the assistance of the Harrison County, Ohio LEPC provide assurance that such an event will be successfully and safely mitigated. \n\n"
    }
  ]
}