{
  "FacilityID": 1000021013,
  "FacilityName": "Northampton Wastewater Treatment Plant",
  "FacilityStr1": "33 Hockanum Road",
  "FacilityStr2": null,
  "FacilityCity": "Northampton",
  "FacilityState": "MA",
  "FacilityZipCode": "01060",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25015",
  "LEPC": "Northampton LEPC",
  "FacilityLatDecDegs": "42.313056",
  "FacilityLongDecDegs": "-072.623333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.nohodpw.org",
  "FacilityEmailAddress": "Gbrehm@nohodpw.org",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Northampton",
  "OperatorStr1": "33 Hockanum Road",
  "OperatorStr2": null,
  "OperatorCity": "Northampton",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01060",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000174508",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-06-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-02-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-04-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-04-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-05-03 00:00:00",
  "DeRegistrationEffectiveDate": "2017-11-05 00:00:00",
  "AnniversaryDate": "2016-04-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.313056,
  "FRS_Long": -72.623333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000025580,
      "AltID": null,
      "FacilityID": 1000021013,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000030439,
          "ProcessID": 1000025580,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000025923,
          "ProcessID": 1000025580,
          "NAICSCode": "92411",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000017490,
              "Process_NAICS_ID": 1000025923,
              "SafetyReviewDate": "2011-01-20 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute, Chemical Manufacturing Association, and EPA Model Checklist",
              "FR_Comments": null,
              "HazardReviewDate": "2011-01-20 00:00:00",
              "ChangeCompletionDate": "2011-02-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-01-20 00:00:00",
              "TrainingReviewDate": "2011-01-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-01-20 00:00:00",
              "EquipmentInspectionDate": "2010-08-20 00:00:00",
              "EquipmentTested": "Chlorine System",
              "ComplianceAuditDate": "2011-01-20 00:00:00",
              "AuditCompletionDate": "2011-02-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2000-11-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000017756,
                  "PreventionProgram2ID": 1000017490,
                  "ProcessChemicalID": 1000030439
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000021013,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-01-20 00:00:00",
    "ERTrainingDate": "2011-01-12 00:00:00",
    "CoordinatingAgencyName": "Northampton Fire Department",
    "CoordinatingAgencyPhone": "4135871030",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000021013,
      "SummaryText": "an.  This section also describes the employee responsibilities associated with each duty.\n\nA major component of the Plan is the assessment of impact associated with the accidental release of the hazardous material(s) in question.  The relevant plan section evaluates both the worst-case release as well as alternative releases that are specific to the site.\nOur analysis focuses on the impact to neighboring areas called receptors. \n\nProcess Safety Information (PSI) is a repository for information related to the safety of a process.  Three major subjects addressed in this Section are: \nÂ¿\tThe hazards of the chemicals and the process (physical properties, toxicity and exposure limits, fire and explosion characteristics, reactivity data, thermal and chemical stability, corrosivity data).\nÂ¿\tThe process technology (process chemistry, process flow diagrams, safe operating limits, maximum intended inventories, consequences of deviation).\nÂ¿\tEquipment information (piping and instrumentation diagrams, material and energy balances, safety systems involved, materials of construction, electrical classification, relief system design and design basis, ventilation system design and design basis, design codes and standards employed).  This information is used as a reference during Process Hazards Analyses.\nDocumentation is found primarily in the Material Safety Data Sheets (MSDS).  The MSDS are filed alphabetically at the Northampton WWTP along with any evidence of employee participation in the development of PSI.\n\nProcess Hazard Analysis (PHA) is a systematic approach toward evaluating the safety of a process.  PHA's must address the hazards of a process, previous incidents having potential for serious consequences, engineering and administrative controls, facility siting, human factors and an evaluation of the range of exposures if controls fail. Employees must have input into the prioritization of PHA's and this schedule must be fully communicated to all employees.  PHA's must fol"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000021013,
      "SummaryText": "ually.  Safe work procedures must exist for hot work, lock-out/tag-out, confined space entry, opening process equipment/piping and controlling entry to chlorine storage and distribution areas, for both employees and contractors.\nTypical documentation should include evidence that employees had input to the content and format of Operating Instructions, an index of all Operating Instructions, completed Confined Space Entry permits, completed Lock-out/Tag-out Program audit forms, etc.  Copies of the Operating Instructions are kept in the Operating Procedure File.\n\nOperating procedures in this document were developed by Tighe & Bond in association with information provided by the facility's operators.  The operating procedures were reviewed by the RMPC prior to implementation and incorporation into this document.  Operating procedures have remained unchanged since the 2008 update.\n\nInitial training must be provided for employees involved with Risk Management Program processes that covers an overview of the process, specific safety and health hazards, emergency operations including shutdown and other safe work procedures that may be applicable.  For existing employees, the employer must document that operators have the required knowledge and do not need initial training.  Refresher training must be provided periodically that covers understanding and adherence to current operating procedures.  Records must be kept that verify that an employee has received and understood the training; these records must include employee identification, date of training and method of verification.Documentation is found primarily in the Training Files.  This file should contain evidence that employees had input into retraining frequency and other aspects of the training program.\n\nIntroductory training was performed by Tighe & Bond on October 11, 2000.  The introductory training provided an overview of the EPA regulations and provided a preview to the elements of this Risk Management Plan.  In"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000021013,
      "SummaryText": "The Northampton Wastewater Treatment Plant at 33 Hockanum Rd. in Northampton, MA is a publicly owned facility. Gaseous chlorine is used to disinfect wastewater prior to discharge. The Northampton WWTP stores more than 2,500 pounds of chlorine at its Northampton facility. Therefore, the plant is required to address the requirements of 40 CFR 68.\n\nThe Northampton Waste Water Treatment Plant (WWTP) currently stores up to 16,000 pounds of chlorine in eight, one-ton containers.  The chlorine is stored in a dedicated building located at the waste water treatment plant site.  The goal of 40 CFR 68 is to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that do occur. The 1990 Amendments to the Clean Air Act (CAA) require EPA to issue a rule specifying the type of actions to be taken by facilities to prevent accidental releases of hazardous chemicals into the atmosphere and to reduce their potential impact on the public and the environment. Part 68 is that rule. \nThe phrase Risk Management Program refers to all of the requirements of Part 68, which must be implemented on an on-going basis. The phrase Risk Management Plan (RMP) refers to this document as well as the registration information submitted to EPA.\n\nThe Plan contains the Policies and Procedures used at the Northampton WWTP to assure continued compliance with the EPA Risk Management Program.  All employees are strongly encouraged to review these Policies and Procedures.  The manual is available for review by any employee at any time.  Any recommendation to improve a document's accuracy or effectiveness in assuring employee, visitor and contractor safety can be directed to management.\n\nThe implementation and management responsibilities for the Plan have to be clearly defined.  The Management Systems section discusses various duties that must be addressed in order to fulfill the intent of the Pl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000021013,
      "SummaryText": "low a standard methodology, such as a What If/Checklist Analysis, and be performed by a cross-functional team with at least one person who is familiar with the process, at least once every five years.  A system for addressing, resolving, documenting and communicating all recommendations in a prompt manner must also be in place.\n\nTypical documentation should include information on how PHA studies were prioritized, employee briefings on the PHA's, a copy of each PHA file index and evidence of how PHA recommendations were completed.  These PHA files should include the pertinent process safety information.\nThe first PHA performed under the RMP program was conducted on November 17, 2000. The results of the PHA were reviewed by the RMPC prior to final approval and incorporation into this plan.  The PHA was subsequently updated in April 2008 by Tighe & Bond personnel, and again in the current document dated February 2011.  The 2011 revised PHA was completed by a team from Kleinfelder/S E A Consultants in collaboration with Northampton operations personnel.  For consistency, the checklist approach developed in the original PHA, and continued in the 2008 revision, has been employed in this PHA as well.\n\nOperating procedures are instructions that outline how to safely operate a process consistent with Process Safety Information.  They must be appropriate, clear, consistent and well communicated.  Procedures must address steps for each operating phase (initial startup, normal operations, temporary operations, emergency shutdown, emergency operation, normal shutdown, startup after a turnaround), operating limits (consequences of deviation, steps to correct or avoid), and safety and health considerations (properties/hazards of chemicals, precautions to avoid exposure, control measures in the event contact occurs, quality control, inventory control, special or unique hazards, safety systems & their function).  Procedures must be accessible and certified to be correct at least ann"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000021013,
      "SummaryText": "gulations require an alarm system; an evacuation procedure; and training for new employees and for employees who are affected by any changes to the plan.\nTypical documentation should include critiques from any drills conducted, including evidence of how any recommendations were implemented, and attendance sheets from any meetings conducted to review the response effort with employees.\n\nThe Northampton Fire Department and Local Emergency Planning Committee (LEPC) Chair were contacted to evaluate municipal response to hazardous materials incidents. An emergency plan with facility hazards diagram has previously been completed and forwarded to the both the LEPC and the Fire Department as part of Tier II reporting.  The public meeting and FBI notification was completed by the facility.  The Northampton Fire Department performs an annual walk through at the facility to ensure familiarity with lay-out and material storage conditions.  Documentation of the site visit is maintained in RMP files."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000021013,
      "SummaryText": "addition, chemical specific safety training was provided for the regulated chemical on November 1, 2000.  This training was attended by the Northampton WWTP's operators.  A training record was completed to identify those employees who attended the training. One new hire has been brought on to the facility since the 2008 update.  The new employee was provided initial training for which documentation is present in the training file.\n\nWritten procedures have been developed for maintaining the ongoing integrity of process equipment.  Mechanical Integrity (MI) applies to pressure vessels and storage tanks; piping systems and their components; relief and vent systems and associated devices; emergency shutdown systems; controls (sensors, alarms, interlocks); and pumps.  Employees involved with MI must be trained in an overview of the process and in specifics of the job task.  Inspection/testing must be performed using generally recognized and accepted good engineering practices, at a frequency consistent with manufacturer's recommendations or good engineering practices (or more frequently if warranted).  Inspections must be documented and include date, person performing test, equipment identifier, test description and results of test or inspection.  Deficiencies outside acceptable limits must be corrected before further use or corrected in a safe and timely manner, provided that the hazards of continued operation are properly addressed.  Employers must certify that the new equipment is fabricated and installed in a suitable manner for the process and in accordance with manufacturer's instructions and design specifications.  Employers must certify that maintenance materials, spare parts and equipment are suitable for the process. Documentation is found primarily in the Training and Maintenance files.  The Training File should contain all maintenance personnel training records; the Maintenance files should contain all inspection records, deficiency reports, etc.\n\nNorthampto"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000021013,
      "SummaryText": "n WWTP certifies that the chlorine system was designed in accordance with recognized engineering standards at the time of original construction and subsequent renovations or modifications.  The chlorine system was inspected during the Process Hazard Analysis.  Northampton WWTP follows the manufacturer's recommendations for maintenance and inspection.\n\nA system is used to properly manage changes to process chemicals, technology, equipment and procedures.  The Management of Change (MOC) form must include the technical basis for the change; impact of the change on employee safety & health; modifications to operating procedures; modifications to Process Safety Information; time period involved; and authorization requirements.  Employees and contractors must be informed of the change prior to implementation.\nTypical documentation should include MOC worksheets (including employee review sheets) and documentation from any training meetings required for a particular MOC.\n\nPre-Startup Safety Review (PSSR) is a review of new or significantly modified facilities prior to introducing a highly hazardous chemical to the process.  The review includes confirmation that construction and equipment are in accordance with design specifications; that safety, operating, maintenance and emergency procedures are in place; that the action items have been addressed; and that training of employees is complete.\nTypical documentation should include any specific training performed for hazard review team members prior to their participation in a preliminary hazard review or pre-startup safety review.  The review documentation is filed in the PSSR File and should include evidence of how recommendations were implemented; these files shall also include any pertinent process safety information.\n\nEmployers must certify that they have evaluated facility compliance with the Risk Management Program at least every 3 years.  Certification involves verification that procedures and practices for Risk Managem"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000021013,
      "SummaryText": "ent Program elements are adequate and are being followed.  The audit must be performed by a team, with at least one person who is knowledgeable in the process.  A report must be generated that documents deficiencies and corrections.\n\nTypical documentation should include completed compliance audits, including evidence of how recommendations were implemented, and attendance sheets from any meetings conducted to review the audit findings with employees.  A compliance audit was performed concurrent with this RMP update in January 2011.  Documentation of audit findings was provided to the management and is maintained in central files.\n\nA thorough investigation of any incident that could or did result in a catastrophic release of highly hazardous chemicals must take place within 48 hours of the incident.  This investigation must identify the chain of events and causes of the incident and include corrective measures that can be developed and implemented.  A team must perform the investigation with at least one person knowledgeable in the process and others who have appropriate knowledge and experience; a representation of the contractor or the chemical supplier must also be part of the team if either were involved in the incident.  A complete incident report must be developed and a system must be in place that addresses and communicates recommendations in a timely manner.\nTypical documentation should include completed Investigation Report Forms, including evidence of how action items were implemented and attendance sheets from any meetings conducted to review the incident with employees.\n\nThis Section outlines how employees participate in the development of the facility's Risk Management Program.  Employers must train their employees and inform them of findings from incident investigations and Process Hazards Analyses and of any relevant safety and health issues.  Employees must have access to all information developed in conformance with the Risk Management Program.\nNorth"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000021013,
      "SummaryText": "ampton WWTP personnel have been involved in many facets of the RMP implementation program including:\nÂ¿\tTraining and education;\nÂ¿\tProcess Hazard Analysis;\nÂ¿\tReview of operating procedures.\n\nEmployers must inform contractors of known potential fire, explosion or toxic release hazards; explain applicable provisions of the emergency action plan; develop/implement safe work practices that control the presence, entrance and exit of contract employees in covered chlorine storage and distribution areas; periodically evaluate contractor safety performance; and maintain a contractor injury and illness log.  This applies to contractors working in or around Risk Management Program-covered processes who perform maintenance or repairs, help with facility turnarounds or major renovations or do specialty work (e.g., chemical suppliers, instrumentation service contractors).  Employers must obtain and evaluate contractor safety performance and programs.\nTypical documentation should include criteria for evaluating contractor safety programs, how the criteria were applied, any on-site monitoring performed while contractors were working and actions taken when contractor deficiencies were found.\n\nThe contractor Pre-Qualification form found in Section 15 was sent to the Northampton WWTP's chlorine supplier, Jones Chemical and its equipment contractor/vendors, Baily-Fisher Porter.\n\nAn emergency action plan for the entire facility is required that satisfies the requirements of OSHA 1910.38 and 1910.120.  The plan must include procedures for handling small releases of hazardous chemicals.  Employees must be aware of the plan and trained in specific procedures.  The regulations require a written plan that addresses emergency escape procedures; procedures for employees who remain to operate critical equipment; procedures to account for all personnel; rescue and medical duties; means of reporting emergencies; and a list of persons or departments who can answer any questions.  Further, the re"
    }
  ]
}