{
  "FacilityID": 1000106229,
  "FacilityName": "C&S Wholesale Grocers - North Hatfield",
  "FacilityStr1": "95 N.Hatfield Road",
  "FacilityStr2": null,
  "FacilityCity": "Hatfield",
  "FacilityState": "MA",
  "FacilityZipCode": "01038",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25015",
  "LEPC": "Hatfield LEPC",
  "FacilityLatDecDegs": "42.397703",
  "FacilityLongDecDegs": "-72.620602",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cswg.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1842467,
  "ParentCompanyName": "C&S Wholesale Grocers, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "C&S Wholesale Grocers, Inc.",
  "OperatorStr1": "7 Corporate Drive",
  "OperatorStr2": "P.O. Box 821",
  "OperatorCity": "Keene",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03431",
  "OperatorZipCodeExt": null,
  "FTE": 608,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155805",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-01-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-07-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-07-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-07-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-07-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.397509,
  "FRS_Long": -72.613546,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000132656,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000106229,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000166158,
          "ProcessID": 1000132656,
          "ChemicalID": 56,
          "Quantity": 28538.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000134088,
          "ProcessID": 1000132656,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000114321,
              "Process_NAICS_ID": 1000134088,
              "SafetyReviewDate": "2021-02-16 00:00:00",
              "PHA_Date": "2023-05-10 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2025-05-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Engine room ammonia detection, cold storage and dock area ammonia detection, vent line sensors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-10-14 00:00:00",
              "TrainingReviewDate": "2023-05-04 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-02-16 00:00:00",
              "EquipmentInspectionDate": "2023-07-21 00:00:00",
              "EquipmentTested": "System weekly mechanical integrity inspection by outside contractor.",
              "ChangeMgmtDate": "2021-04-12 00:00:00",
              "ChangeMgmtReviewDate": "2021-02-16 00:00:00",
              "PreStartupReviewDate": "2021-04-30 00:00:00",
              "ComplianceAuditDate": "2021-09-13 00:00:00",
              "AuditCompletionDate": "2023-09-30 00:00:00",
              "IncidentInvestigationDate": "2021-09-24 00:00:00",
              "InvestigationChangeDate": "2022-09-30 00:00:00",
              "ParticipationPlansReviewDate": "2021-02-16 00:00:00",
              "HotWorkPermitReviewDate": "2021-02-16 00:00:00",
              "ContractorSafetyReviewDate": "2023-04-27 00:00:00",
              "ContractorSafetyEvalDate": "2021-02-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000143341,
                  "PreventionProgram3ID": 1000114321,
                  "ProcessChemicalID": 1000166158
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106229,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Hatfield Fire Department",
    "CoordinatingAgencyPhone": "4132479008",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106229,
      "SummaryText": "RMP Executive Summary\nThis summary is presented for the five year RMP update. The ammonia refrigeration system provides cooling for coolers, high-pressure glycol chiller, and docks and uses a charge of 28,538 pounds of ammonia.\n\nAccidental Release Prevention and Emergency Response Policies\nC&S Wholesale Grocers, Inc. (C&S) is committed to the safety of its employees and neighbors and operates the Facility as a responsible member of the community. Personnel are encouraged to continually identify methods and procedures to reduce the use of and risks associated with hazardous chemicals. This process includes protecting the community, environment, and Facility personnel by implementing technology and procedures designed to reduce the impact of any potential release of toxic chemicals. This commitment to safety is documented in the policy and compliance manuals for the Facility, which are available to all employees.\n\nRegulated Substance\nC&S utilizes anhydrous ammonia within a refrigeration system at the Facility. The facility uses approximately 28,538 pounds of anhydrous ammonia. A charge calculation was performed by American Refrigeration Company, Inc. on April 15, 2016, and the total actual plant charge (based on measured vessel levels) is 28,538 lbs.\n\nOff-site Release Scenarios\nC&S has conducted an OCA based on the EPA document titled \"RMP Offsite Consequence Analysis Guidelines,\" and used the EPA's RMP*Comp Version 1.07 to estimate the distance traveled to a toxic endpoint defined by the EPA regulation. This data were then used to estimate the potential impact caused by a release from each of the regulated substances.\n\nWorst-Case Release Scenarios\nAs required by regulations, scenarios were considered where the entire capacity of the largest vessel for each regulated chemical at the facility was released in 10 minutes. Although these scenarios are highly unlikely in the event of a release, it provides the local responding agencies with a maximum possible impact in the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106229,
      "SummaryText": "event of an accidental release. In considering these releases, the most pessimistic meteorological conditions were used. Passive mitigation measures were taken into account when considering these release scenarios.\n\nAlternative Release Scenarios\nAlternative scenarios were developed to assess what potential impact may occur in the event of a release that is more likely to occur than the worst-case scenarios for each of the regulated chemicals. Several possible release scenarios were considered, and the scenarios with the greatest offsite impact were chosen. In considering the alternative release scenario, the default meteorological conditions for alternative scenarios were used in RMP*Comp. These scenarios represent a more realistic release, and have a downwind distance and impact considerably smaller than the worst-case scenario. No passive or active mitigation measures were taken into account when considering these release scenarios.\n\nGeneral Accidental Release Prevention Programs and Prevention Steps\nAs part of the implementation of the RMP, elements of the prevention programs have been developed to manage process safety issues associated with the facility. Each of the program elements has been developed according to OSHA and EPA regulations in order to ensure safe operating practices and conditions at the C&S facility. Elements of Prevention Program 3 include the following:\n\n-Process Safety Information - information regarding the hazards of anhydrous ammonia, process description, and equipment properties\n-Process Hazard Analysis - a detailed review of the process, and recommendations to improve the safety of the systems at the Facility\n-Operating Procedures - procedures designed to comply with regulations and provide safe practices for the systems at the Facility\n-Training - procedures and logs for personnel training on the covered process\n-Mechanical Integrity - manufacturer recommended maintenance procedures, schedules, and documentation\n-Management of Change"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106229,
      "SummaryText": "- documentation and tracking of changes that effect the process involving the regulated chemical\n-Pre-Startup Review - prior to the startup of a new regulated process or major changes to the existing process, a review will be conducted, as required by PSM and RMP regulations\n-Compliance Audits - documentation of triennial audits of the covered process\n-Incident Investigation - documentation and investigation procedures for determining and mitigating releases\n-Employee Participation - documentation and statement of C&S commitment to providing a safe and open work place\n-Hot Work Permit - procedures for documenting and safely performing work on or near process equipment during normal operations\n-Contractors - policy for contractors and outside vendors that work on or near the regulated process \n\nThese elements are continually updated and reviewed through the Management System at the Facility. The Management System includes planning, organizing, implementing, and controlling different aspects of the plan.\n\nFive Year Accident History\nThere have been no significant releases of ammonia at the Facility in the last five years (July 2018 - July 2023) of ammonia that exceeded the Federal Reportable Quantity of 100 pounds. In addition, there have been no injuries resulting from an ammonia release.\n\nThere was a reportable release which occurred at the facility in 2007, which is outside of the five year limit. The release was caused by a condenser fan failure which increased the pressure in the compressors and caused a relief valve to unseat. The release was an estimated 860 pounds of ammonia. A number of changes have been made under the agreement with the Department of Justice outlined in their Consent Decree, (which was approved by the EPA). These changes are included in the PSM and RMP.\n\nThere was a release which occurred in January 2012 that did not meet or exceed the federal reporting thresholds, nor did it result in any injuries. The incident was reported to the state of M"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106229,
      "SummaryText": "assachusetts Department of Environmental Protection (MassDEP). The release was appropriately investigated and all necessary mechanical changes and employee training was completed.\n\nProcess Description\nThe refrigeration system uses approximately 28,538 pounds of ammonia to provide refrigeration for glycol chilling, dock operations, and cold storage. The refrigeration cycle begins with the transfer of liquid ammonia from the Condensers (4) to the Thermosyphon Receiver.  The Thermosyphon Receiver maintains a reservoir of liquid ammonia for thermosyphon oil cooling of the Compressors and any excess liquid drains to the main storage vessel, the High Pressure Receiver.  The High Pressure Receiver feeds high pressure liquid ammonia to the Banana Rooms' Glycol Chiller in addition to the High and Medium Temperature Pump Recirculators.  Liquid ammonia in the shell of the heat exchanger vaporizes as it removes heat from glycol used in the Banana Room's refrigeration process.  The resultant vapor is drawn directly to the high stage suction manifold.  \n\nIn the event of a high level situation in either one of the Pump Recirculators, excess liquid can be manually transferred to the High Pressure Receiver via a Transfer Drum.  The transfer cycle is initiated when a three-way valve, which vents vapor in the Transfer Drum to the Medium Temperature Pump Recirculator during normal operation, closes the vent line and allows Compressor discharge to pressurize the Transfer Drum before pumping the liquid back to the High Pressure Receiver. A bath of liquid ammonia is maintained in the High Temperature Pump Recirculator so that high pressure liquid ammonia, flowing through coils immersed in the bath, is subcooled before it is fed to the \"A\" Truck Dock Evaporators (AU 61-70).  Suction from the Truck Dock Evaporators is drawn back to the High Temperature Pump Recirculator.  The vessel also pumps liquid ammonia to evaporators located in the \"E\" Box (Processing and Staging) Evaporators (AU 22-2"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106229,
      "SummaryText": "4, AU 22A, 23A, and 24A), three of the six \"F\" Box Evaporators (AU 25-27), and the \"O\" Box (Storage) Evaporators (AU 53-55).  The ammonia, flowing through coils located within the Evaporator units, partially boils as it removes heat from the product and room.  The resultant liquid/vapor mix returns to the High Temperature Pump Recirculator, where the liquid droplets fall to the bottom to be reused in refrigerating the rooms.  Suction is drawn by the High Temperature Compressors.\n\nThe Medium Temperature Pump Recirculator pumps liquid ammonia to the following evaporators:  \"A\" Box (Meat) Evaporators (AU 1-4), \"B\" Box (Fish) Evaporators (AU 5 & 6), \"C\" Box (Pkg Meat/Deli/Dairy) Evaporators (AU 19-34), three of the six \"F\" Box Evaporators (AU 28-30), \"G\" Box (Dry Produce) Evaporators (AU 31-36), \"H\" Box (Wet Produce) Evaporators (AU 37 & 38), \"I & J\" Box (Storage) Evaporators (AU 39 & 40), \"L & M\" Box (Floral) Evaporators (AU 41 & 42), \"K\" Box (Cooler) Evaporators (AU 43 & 44), \"N\" Box (Wet Cooler) Evaporators (AU 45-52), \"B\" Dock (Shipping) Evaporators (AU 71-76), \"C\" Dock (Receiving) Evaporators (AU 77-80), and \"D\" Dock (Rail) Evaporators (AU 81-86).  The ammonia, flowing through coils located within the Evaporator units, partially boils as it removes heat from the product and room.  The resultant liquid/vapor mix from these evaporators returns to the same vessel, where the liquid droplets fall to the bottom to be reused in refrigerating the rooms.  Medium temperature suction is drawn from the top by the Medium Temp Compressors.  \n\nThe compressors maintain the pressure/temperature inside the vessels.  The Medium Temperature Compressors draw vapor from the Medium Temperature Pump Recirculator and the High Temperature Compressors draw vapor from the High Temperature Pump Recirculator.  The Swing Compressor is piped so that it may draw from either the Medium Temperature Pump Recirculator or the High Temperature Pump Recirculator, depending on system demand.  All Compress"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000106229,
      "SummaryText": "ors discharge high pressure ammonia gas to the Condensers, from where the refrigeration process begins again.  High stage discharge is also used in the defrost cycle of the evaporators and to re-heat glycol employed in underground heating.  High pressure liquid ammonia, supplied by the Thermosyphon Receiver, is used to cool Compressor oil.\n\nAmmonia sensors are located in the Engine Room and within each refrigerated space throughout the warehouse.\n\nEmergency Response Program\nC&S has developed an Ammonia Emergency Action Plan (Refrigeration Emergency Response Plan) which includes but is not limited to the following: - emergency response and evacuation procedures -safety and health considerations - notification procedures - local emergency response agencies -environmental offsite consequences"
    }
  ]
}