{
  "FacilityID": 1000068380,
  "FacilityName": "Delaware River Partners LLC",
  "FacilityStr1": "200 N Repauno Ave",
  "FacilityStr2": null,
  "FacilityCity": "Gibbstown",
  "FacilityState": "NJ",
  "FacilityZipCode": "08027",
  "Facility4DigitZipExt": "1096",
  "FacilityCountyFIPS": "34015",
  "LEPC": "Gibbstown Emergency Management",
  "FacilityLatDecDegs": "39.840868",
  "FacilityLongDecDegs": "-075.302593",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 933571957,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 80393730,
  "Company2DUNS": 0,
  "OperatorName": "Delaware River Partners LLC",
  "OperatorStr1": "200 N Repauno Ave",
  "OperatorStr2": null,
  "OperatorCity": "Gibbstown",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08027",
  "OperatorZipCodeExt": "1096",
  "FTE": 7,
  "OtherEPAFacilityID": "560309",
  "EPAFacilityID": "100000163093",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-06-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Gibbstown Facility: EPA Submission (with NO2)",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-03-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-03-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-03-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-03-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 39.84083,
  "FRS_Long": -75.29763,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R03",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085800,
      "AltID": "Butane Cavern / Terminal",
      "FacilityID": 1000068380,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000107127,
          "ProcessID": 1000085800,
          "ChemicalID": 118,
          "Quantity": 43000000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000087001,
          "ProcessID": 1000085800,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000072436,
              "Process_NAICS_ID": 1000087001,
              "SafetyReviewDate": "2017-06-19 00:00:00",
              "PHA_Date": "2017-06-08 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-07-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-06-30 00:00:00",
              "TrainingReviewDate": "2017-05-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Safety training at Delaware Valley Safety Council",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-11-30 00:00:00",
              "EquipmentInspectionDate": "2017-09-01 00:00:00",
              "EquipmentTested": "Flare system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2017-06-17 00:00:00",
              "PreStartupReviewDate": "2017-06-21 00:00:00",
              "ComplianceAuditDate": "2017-06-19 00:00:00",
              "AuditCompletionDate": "2017-09-19 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2017-05-17 00:00:00",
              "HotWorkPermitReviewDate": "2017-06-10 00:00:00",
              "ContractorSafetyReviewDate": "2017-05-17 00:00:00",
              "ContractorSafetyEvalDate": "2018-02-23 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000090055,
                  "PreventionProgram3ID": 1000072436,
                  "ProcessChemicalID": 1000107127
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000068380,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-01-10 00:00:00",
    "ERTrainingDate": "2017-12-05 00:00:00",
    "CoordinatingAgencyName": "Gibbstown VFC",
    "CoordinatingAgencyPhone": "8564236580",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "NJAC 7:31 NJDEP TCPA Program; 29 CFR 1910.119 OSHA PSM, 40 CFR Part 68 EPA RMP"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068380,
      "SummaryText": "Delaware River Partners LLC\n\nRisk Management Program\n\nExecutive Summary\n\n\n\n\n\nDelaware River Partners LLC (DRP) consists of a hard rock storage cavern, and butane loading and unloading in Gibbstown, New Jersey. This cavern was converted from anhydrous ammonia service to butane storage service. A process hazard analysis was performed on the cavern to substantiate the integrity of the cavern and that suitability for butane storage. \n\n\n\nThe cavern has been refurbished to include new wellheads and shaft domes. It was inspected, pressure tested and deemed suitable for normal butane storage service.  New facilities include rail and truck loading/unloading/transloading equipment, vertical cavern turbine line shaft pumps, instrumentation to measure cavern inventory, a water knockout system; and a flare system to minimize and measure butane emissions to the atmosphere. Safety systems and emergency shutdowns are in place and designed to shutdown transfer activity to minimize or prevent the potential for an incidents.\n\n\n\nDRP stores Butane in a quantity that exceeds the threshold quantity and as a result, is subject to and complies with the New Jersey Toxic Catastrophe Prevention Act (TCPA) Rule (N.J.A.C. 7:31), OSHA's process safety management (PSM) regulation (29 CFR 1910.119), and EPA Risk Management Program Rule (40 CFR 68).  Under the Risk Management Program, Butane storage is subject to OSHA PSM Program 3 requirements.  Program 3 requirements include a Hazard Assessment Analysis, a Program 3 Prevention Program and an Emergency Response Program.  \n\n\n\nOne aspect of the RMP is a five-year accident history. DRP has had no recordable incidents to report since beginning operation. \n\n\n\nAnother element of a RMP is the Program 3 Prevention Program, (Subpart D of 40 CFR 68) which includes process safety information, process hazard analysis, operating procedures, training, mechanical integrity, management of change, pre-startup review, compliance audits, incident investigation, emplo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068380,
      "SummaryText": "yee participation, hot work permits, and contractors.\n\n\n\nProcess Safety Information includes drawings, documentation developed during the design, construction and turnover of the Butane system. These details include equipment data, design and operating information, procedures, safety systems, and procedures developed for each element of the program. DRP has a shared drive where the information is stored and available to all appropriate personnel.  \n\n\n\nThese documents include information on the maximum inventory of the EPA regulated chemical, and safe upper and lower operating limits, and SDS (safety data sheet). SDS sheets provide information such as toxicity, permissible exposure limits, physical data, reactivity, corrosivity, thermal and chemical stability and the hazardous effects of inadvertently mixing the substance with other materials.  Each piece of equipment is documented through piping and instrumentation drawings (P&IDs) showing electrical classification, relief system design, design codes and standards employed, and safety systems.  These drawings are located in the facility shared drive, with hard copies located in the Operations building, and the main office, which is accessible to all personnel.  \n\n \n\nProcess hazard analysis (PHA) - A PHA was completed on the design of the system and all recommendations resolved in a timely manner.  The PHA is scheduled to be updated every five (5) years or during the implementation of a major change as defined in the facility Management of change procedures. All PHA's will be retained for the life of the process.   \n\n\n\nTraining is another component of the prevention program.  DRP Operators are contract employees. Site-specific training manuals document their site-specific training and qualifications. Other training and certifications are covered by their contract company and are made available to DRP personnel upon request. \n\n\n\nMechanical Integrity - A Computerized Maintenance Management System contains covered equip"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068380,
      "SummaryText": "ment and a method to document preventive inspection and tests, repair histories and emergency work orders. Written procedures have been developed that include inspection methods and frequencies for covered equipment. \n\n\n\nOperating Procedures-  Procedures include normal operations, startup, shutdown and emergency operations. These procedures are reviewed and certified annually, and made available to all appropriate personnel on the site shared drive.\n\n\n\nManagement of Change (MOC) and Pre-Startup Safety Review-  MOC ensures that the process is consistent for making major or minor changes, and that affected documents are identified during the process.  PSSR is designed to ensure recommendations identified during the management of change process have been addressed prior to startup. A PSSR was also completed during the commissioning of the facility equipment and procedures, prior to the startup of the facility, \n\n \n\nCompliance Audits - At DRP, compliance audits are scheduled annually, prior to the development of the annual report.  Findings of the inspection are documented in a report; corrective actions are taken, and relevant documentation is retained with the audit report. Compliance Audits by outsides agencies will be at the discretion of that requesting agency. \n\n\n\nEmployee Participation Plan-  The written plan of action regarding employee participation is described in the PSM Manual.  DRP has a written employee Participation plan that describes how employees are involved and have access to, each element of the risk management program. Details of the written program and related documentation is available to employees on the site shared drive.\n\n\n\nHot work permits-  A blank hot work permit (flame permit) and subsequent procedures for issuing such a permit are found in the facility shared drive.     \n\n\n\nIncident investigation-  DRP investigates each incident, which resulted in, or could reasonably have resulted in a catastrophic release of a regulated substance.  The "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000068380,
      "SummaryText": "procedure to conduct an incident investigation is found in the DRP shared drive.\n\n\n\nContractors - Contracting companies providing services for maintenance inspection or repair, major renovations or specialty work on site, must provide their technicians or mechanics are qualified for the work for which they are performing. Contractors also go through an onsite safety orientation, with a section focused on the Butane area on site. Documentation is on file for those who are performing routine work on site. \n\n\n\nThe last element of a RMP is Emergency Response Program (Subpart E of 40 CFR 68).  DRP has an Emergency Action Plan that activates the local LEPC, Gibbstown Volunteer Fire Department, through the  911 system. Activation of the County Emergency Responders would be at the discretion of the local LEPC.  Emergency response drills ensure that responsible personnel at DRP are current with appropriate procedures and responses to emergency situations.\n\n\n\nDRP is committed to operating our facility in a safe and responsible manner.  Following the recommended practices and procedures for the facility Risk Management Program provided a reliable foundation for continuous facility improvement.\n\n"
    }
  ]
}