{
  "FacilityID": 1000080176,
  "FacilityName": "Polychemie Inc. - Los Angeles, CA",
  "FacilityStr1": "4690 Worth Street",
  "FacilityStr2": null,
  "FacilityCity": "Los Angeles",
  "FacilityState": "CA",
  "FacilityZipCode": "90063",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.061846",
  "FacilityLongDecDegs": "-118.181777",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 926226507,
  "ParentCompanyName": "SNF Holding Company",
  "Company2Name": null,
  "CompanyDUNS": 878930965,
  "Company2DUNS": 0,
  "OperatorName": "Polychemie Inc.",
  "OperatorStr1": "4690 Worth Street",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90063",
  "OperatorZipCodeExt": null,
  "RMPContact": "Alex Bravo",
  "RMPTitle": "Plant Manager",
  "FTE": 15,
  "OtherEPAFacilityID": "90063HTKPL4690W",
  "EPAFacilityID": "100000113192",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-04-12 00:00:00",
  "SafetyInspectionBy": "LA County Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.06139,
  "FRS_Long": -118.18111,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100102,
      "AltID": "Mannich Process",
      "FacilityID": 1000080176,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101342,
          "ProcessID": 1000100102,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125381,
          "ProcessID": 1000100102,
          "ChemicalID": 133,
          "Quantity": 1000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 133,
            "ChemicalName": "Dimethylamine  [Methanamine, N-methyl-]",
            "CASNumber": "124-40-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625381,
          "ProcessID": 1000100102,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080176,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nPOLYCHEMIE INC. - LOS ANGELES, CALIFORNIA FACILITY\n\n\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\n\n\nOur facility is strongly committed to employee, public, and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances and to protect people, property, and the environment.\n\n\n\n2. The Stationary Source and the Regulated Substances Handled\n\n\n\nOur facility's primary activities encompass the manufacture of Mannich for wastewater treatment.  We have one regulated substance above the RMP threshold quantity present at our facility.  There are no regulated toxic substances on-site above the threshold quantity. The regulated flammable substance is dimethylamine. Dimethylamine is received and stored in a 60 percent solution with water, and it is used as a feedstock in the manufacture of Mannich. The maximum quantity of dimethylamine solution stored on-site is 1,000,000 pounds (620,000 pounds pure dimethylamine).\n\n\n\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\n\n\nOur facility has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. The following sections briefly describe the elements of the accidental release prevention and process safety management programs that are in place at our facility.\n\n\n\nProcess Safety Information (PSI)\n\n\n\nOur facility maintains a detailed record of process safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis (PHA)\n\n\n\nOur facility conducts comprehensive studies to ensure that h"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080176,
      "SummaryText": "azards associated with our processes are identified and controlled effectively.  A HAZOP methodology is used to carry out these analyses. The studies are undertaken by a team of qualified personnel with expertise in engineering, process operations, and environmental, health and safety, and will be revalidated at a regular interval of five years.  Findings related to the hazard analysis are addressed in a timely manner.  Layer of Protection Analysis (LOPA) and the Event Tree method are also performed on critical nodes within the HAZOP.\n\n\n\nOperating Procedures\n\n\n\nFor the purposes of safely conducting activities within our covered processes, we maintain written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is reviewed annually and is readily accessible to workers involved in the processes.\n\n\n\nTraining\n\n\n\nOur facility has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training will be provided at least every three years and more frequently at intervals determined by employee input.\n\n\n\nMechanical Integrity\n\n\n\nOur facility carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\n\n\nWritten procedures are in place to manage changes in process chemicals, technology, equipment, and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080176,
      "SummaryText": "procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification prior to working with the modified process.  In addition, operating procedures and associated PSI are updated as required.\n\n\n\nPre-startup Reviews\n\n\n\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at our facility.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nIncident Investigation\n\n\n\nOur facility promptly investigates incidents that have resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as corrective actions to prevent the release from reoccurring.\n\n\n\nEmployee Participation\n\n\n\nWe believe that process safety management and accident prevention is a team effort. Employees will participate in the elements of PSM and RMP.  In the startup of this plant we included a high percentage of operations staff in the PHA process. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to information created as part of the facility's implementation of the RMP rule.\n\n\n\nContractors\n\n\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Our facility has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of emergency response duti"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080176,
      "SummaryText": "es in the event of a release or incident.\n\n\n\n4. Five-year Accident History\n\n\n\nThe Polychemie Inc. - Los Angeles, California Plant has had no RMP incidents in the past five years. There are no incidents to report.\n\n\n\n5. Emergency Response Plan\n\n\n\nOur facility has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan addresses aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public. The plan is promptly updated to reflect pertinent changes taking place within our processes that would require a modified emergency response.  Emergency responders are trained or drilled on a quarterly basis.\n\n\n\nLos Angeles County Fire Department is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\n\n6. Planned Changes to Improve Safety\n\n \n\nThrough the elements of the Prevention Program (e.g., Process Hazard Analysis, Mechanical Integrity, Management of Change, Compliance Audits, Incident Investigations, Operating Procedure Reviews, etc.), Polychemie routinely evaluates the safety of its processes and implements changes as appropriate which in turn improves process safety.\n\n"
    }
  ]
}