{
  "FacilityID": 1000101609,
  "FacilityName": "NXP Semiconductors - Oak Hill",
  "FacilityStr1": "6501 W William Cannon Dr",
  "FacilityStr2": "MD:OE316",
  "FacilityCity": "Austin",
  "FacilityState": "TX",
  "FacilityZipCode": "78735",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48453",
  "LEPC": "Travis County LEPC",
  "FacilityLatDecDegs": "30.238495",
  "FacilityLongDecDegs": "-97.867348",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 141417928,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "NXP Semiconductor",
  "OperatorStr1": "6501 W William Cannon Dr",
  "OperatorStr2": null,
  "OperatorCity": "Austin",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78735",
  "OperatorZipCodeExt": null,
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000248948",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-09-12 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-09-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-09-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-09-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-09-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000126104,
      "AltID": "hydrogen chloride gas sys",
      "FacilityID": 1000101609,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000157782,
          "ProcessID": 1000126104,
          "ChemicalID": 54,
          "Quantity": 22000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000127513,
          "ProcessID": 1000126104,
          "NAICSCode": "334413",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000108662,
              "Process_NAICS_ID": 1000127513,
              "SafetyReviewDate": "2021-04-15 00:00:00",
              "PHA_Date": "2022-07-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-09-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-09-06 00:00:00",
              "TrainingReviewDate": "2022-09-08 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "No",
              "TR_OtherType": "Online course",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-09-06 00:00:00",
              "EquipmentInspectionDate": "2022-08-19 00:00:00",
              "EquipmentTested": "New system - Covered process equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2021-09-10 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-11-19 00:00:00",
              "HotWorkPermitReviewDate": "2018-04-25 00:00:00",
              "ContractorSafetyReviewDate": "2022-03-03 00:00:00",
              "ContractorSafetyEvalDate": "2022-01-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000136261,
                  "PreventionProgram3ID": 1000108662,
                  "ProcessChemicalID": 1000157782
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000101609,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-07-27 00:00:00",
    "ERTrainingDate": "2022-08-11 00:00:00",
    "CoordinatingAgencyName": "Austin Fire Department",
    "CoordinatingAgencyPhone": "5129740130",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000101609,
      "SummaryText": "retain the two most recent compliance audit reports.\n\n11.\t INCIDENT INVESTIGATION\nNXP will investigate each incident involving a covered process that results in or could have reasonably resulted in a catastrophic release of the aHCl. The minimum primary elements of the incident report shall include the date of the incident, the date the investigation began, the incident description, factors that contributed to the incident, and recommendations resulting from the investigation. Incident Investigation reports related to the Covered Process are retained for a minimum of five years. \n\n12.\t EMPLOYEE PARTICIPATION\nNXP has developed an employee participation plan to provide structure for facilitating employee involvement in the development of required elements of process safety management. The Facility consults with employees and their representatives on the conduct and development of the PHA, audits, incident investigations, and the development of the other elements of the PSM and RMP. NXP provides employees access to PHAs and other information required to be developed under PSM regulations.  \n\n13.\t CONTRACTORS\nNXP has developed a contractor safety program dated 01/31/22. The contractor safety program addresses contractors' employees that perform maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to the covered process.  NXP has developed an EHS Questionnaire (Contractor Company Pre-Qualification Procedure) for contractor companies.\nThe pre-qualification process includes the activities of distributing the NXP EHS Contractor Pre-Qualification Questionnaire to contractor companies, receiving the completed questionnaires, and the review and approval process for the questionnaire. Contractor companies must submit a questionnaire and receive approval from EHS before their personnel work at the NXP Austin sites. \n\n14.\t FIVE-YEAR ACCIDENT HISTORY\nSince the initial development of this RMP, there have been no accidents that meet the criteria for"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000101609,
      "SummaryText": "reporting or inclusion in this plan.  This is a new process in the Facility; therefore, NXP has not had an accidental release from the Covered Process over the last five years.  \n\n15.\t EMERGENCY ACTION PLAN\nNXP has established a written Emergency Response and Contingency Plan that is followed by employees to help safely evacuate and notify appropriate agencies in the event of accidental releases of hazardous substances. The Emergency Action Plan includes the required aspects of emergency response, including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. \nEmergency operation and response procedures are reviewed periodically or when significant changes to the process or procedures are made. The most recent review/update of the Emergency Response and Contingency Plan was completed on April 2, 2022.  \nNXP is coordinating with the following external emergency response groups:\n- Austin Fire Department (AFD)\n- Austin Police Department (APD)\n- Emergency Medical System (EMS)\n- Travis County Sheriff\n\n16.\t PLANNED CHANGES\nAt the time of the RMP Executive Summary\u0092s development, NXP does not have planned changes to the Covered Process to improve safety.  A PHA was completed for the covered process; NXP\u0092s hazard analysis team made the decision to address every action item identified from the analysis sessions. Action items are being addressed with completion dates on or before September 19, 2022."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000101609,
      "SummaryText": "ess equipment examined by these checks includes, among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  \nMaintenance is performed by NXP employees and/or contractors according to manufacturer recommendations and established EHS Critical Maintenance procedures. NXP uses Maintenance Connection software as a database to notify when equipment needs maintenance. Deficiencies will be corrected before further use or in a safe and timely manner to ensure the safe operation of the system. \n\n8.\tMANAGEMENT OF CHANGE (MOC)\nNXP has an established Management of Change program to manage changes to process chemicals, technology, equipment, procedures, and changes in stationary sources that affect a covered process. Process operators, maintenance personnel, or other employees whose tasks are affected by a modification in process conditions are promptly made aware of and offered training to address the modifications. \n\n9.\tPRE-STARTUP SAFETY REVIEW (PSSR)\nNXP has a Pre-startup Safety Review program for the Covered Process.  NXP performs a pre-startup safety review for the covered system during initial startup and acceptance with the vendor and for modifications to the system when the modification is significant enough to require a change in the process safety information. The reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe start-up prior to placing equipment into operation.\n\n10.\t COMPLIANCE AUDITS\nNXP conducts audits on a regular basis to determine whether the provisions set out under the RMP regulation are being implemented, and these audits are carried out at least every three years.  The compliance audit will be conducted by a person who is knowledgeable in the process. As a part of the compliance audit, a written report will be completed with the appropriate responses to each finding addressed and documented. The facility will"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000101609,
      "SummaryText": "ion program that are in place at the Facility. \n\n3.\tPROCESS SAFETY INFORMATION (PSI)\nThe Facility maintains records of its PSI that describes chemical hazards, processes, and equipment covered under the NXP Bulk hydrogen chloride system. \n\n4.\tPROCESS HAZARD ANALYSIS (PHA)\nThe baseline process hazard analysis for the new system was conducted using a \u0093What-if?\u0094 methodology in May 2021, following the requirements under 29 CFR 1910.119(e) and 40 CFR 68.50. The PHA was conducted over several sessions and utilized a team with expertise in engineering and process operations and included personnel from the Facility with direct knowledge of the system design and operation.  Findings and recommendations related to the PHAs are addressed in a timely manner.\n\n5.\tOPERATING PROCEDURES\nNXP maintains written operating procedures to safely conduct activities within its covered process. The covered system is operated and maintained by NXP's subcontractor, EMD Electronics. EMD electronics has developed written procedures for the operations of the covered system. From these operating procedures, EMD Electronics and NXP will implement safe operating procedures for each step of the operating phase, including operational limits, safety and health considerations, and safety systems and their functions. Operating procedures will be reviewed annually or when triggered by a MOC (whichever is sooner). Changes will be approved in accordance with NXP's Management of Change program.\n\n6.\tTRAINING\nNXP has a training program in place to ensure that employees who are tasked with operational processes and procedures are competent.  Refresher training will be conducted every three years or more frequently if deemed necessary to assure understanding of the process and operating procedures.\n\n7.\tMECHANICAL INTEGRITY\nNXP has a preventive maintenance program for the equipment in the covered process.  NXP carries out documented maintenance checks on process equipment to ensure proper operations. Covered proc"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000101609,
      "SummaryText": "RISK MANAGEMENT PLAN (RMP) EXECUTIVE SUMMARY\nNXP Semiconductors (NXP) is required to develop an RMP for the proposed anhydrous hydrogen chloride (aHCl) system located at 6501 W William Cannon Dr., Austin, Texas 78735, referred to as the Facility from this point forward.\nAs required by 40 CFR 68.155, NXP developed this RMP Executive Summary for the Facility.\n\n1.\tACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\nNXP maintains an Emergency Response Plan in its Facility.  For more details about the facility's emergency response program, refer to Section 5 of the facility's RMP/PSM program.\n\n2.\tTHE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\nNXP will have one regulated substance in a covered process at its Facility located in Austin, Texas:  bulk hydrogen chloride storage system (22,000 pounds), hereafter referred to as the Covered Process.  The facility is subject to the Program Level 3 RMP requirements.  [The OSHA Process Safety Management (PSM) also applies to the facility because the hydrogen chloride onsite exceeds the PSM limit of 5,000 pounds.]\nThe bulk hydrogen chloride storage system and the operational devices that use hydrogen chloride: Tube trailer (y-cylinder), bulkguard cabinet, purifier, piping, bulk distribution boxes, Valve Manifold boxes, and a Point of Use (POU) abatement system.\nNXP is completing an Offsite Consequence Analysis (OCA) and is including the Worst-Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures, in the RMP document to be maintained onsite at the Facility. \nThe Emergency Response Plan and the Chemical-Specific Prevention Steps NXP undertakes necessary measures to comply with the EPA`s accidental release prevention requirements included in 40 CFR part 68, and OSHA's emergency planning and response under PSM regulations in 29 CFR 1910.119. \n\nThe following sections briefly describe the elements of the NXP release prevent"
    }
  ]
}