{
  "FacilityID": 1000008973,
  "FacilityName": "Sun Pacific Lerdo Highway Cold Storage facility",
  "FacilityStr1": "33374 Lerdo Highway",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93308",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.500278",
  "FacilityLongDecDegs": "-119.146944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sun Pacific",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sun Pacific",
  "OperatorStr1": "33374 Lerdo Highway",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93308",
  "OperatorZipCodeExt": null,
  "RMPContact": "Roger Hill",
  "RMPTitle": "General Manager",
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000049887",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-04 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.49942,
  "FRS_Long": -119.12383,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010487,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000008973,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000010862,
          "ProcessID": 1000010487,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011950,
          "ProcessID": 1000010487,
          "ChemicalID": 56,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000511950,
          "ProcessID": 1000010487,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008973,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nSun Pacific utilizes anhydrous ammonia in the refrigeration system at their cold storage facility east of Shafter, California.  It is Sun PacificA?s policy to comply with all applicable governmental regulations.  Further, it is Sun PacificA?s objective to be a responsible citizen of the community in all of its business activities.\n\nSun Pacific emphasizes safe and environmentally sound operating practices and procedures through their employee training programs.  In addition to job specific training, operators and maintenance personnel receive training in accident prevention, safety, and first aid.  Additionally, an emergency action plan has been prepared for Sun Pacific and a chain of command to respond to emergencies has been established.\n\nSun Pacific has developed a detailed Compliance Audit Checklist which is used to evaluate compliance with the Process Safety Management (PSM) and 40 CFR Part 68 (RMP regulations).  At least every three years, Sun Pacific audits these programs and any findings of noncompliance are documented and responded to and the deficiencies are corrected.\n\nDescription of the Stationary Source and Regulated Substances \n\nSun Pacific owns and operates a cold storage facility located at 33374 Lerdo Highway.  Shafter is the closest city to the Sun Pacific Lerdo Highway Cold Storage facility.  The plant was constructed in 1988.  The refrigeration system has been upgraded several times, with the last expansion completed prior to September 1, 1992.\n\nAt Sun Pacific, anhydrous ammonia is used in the refrigeration system which provides process cooling for the cold storage facility.  The system consists of a high pressure receiver, six evaporative condensers, four compressors, three recirculation accumulators, and numerous evaporators.  The three recirculation accumulators and evaporator units provide cooling to the cold storage rooms and the pre-cool/degreening rooms.  Flo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008973,
      "SummaryText": "oded evaporators are utilized in the degreening room.  The halls and truck dock areas are cooled by direct expansion evaporators.   \n\nDuring normal operation, the anhydrous ammonia is distributed throughout the refrigeration system.  However, during major maintenance activities, the entire refrigeration system can be A?pumped downA? to evacuate the ammonia from the system and store it in the high pressure receiver.  The maximum quantity of ammonia that can be stored in the high pressure receiver is 20,987 pounds. \n\nFor purposes of the offsite consequence analyses, the RMP regulations define the toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 ppm).  \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nA PSM program, which meets the requirements of the general accidental release prevention program, has been developed at Sun Pacific to address the anhydrous ammonia system.  The PSM program includes the following chemical-specific prevention steps:\n\nA? Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process has been compiled.\n\nA? An initial Process Hazard Analysis (PHA) was performed and will be updated and revalidated at least every five years.\n\nA? Written operating procedures have been developed and implemented, and are reviewed at least annually.\n\nA? Safe work practices, such as lockout/tagout, confined space entry, opening process equipment or piping, and control over entrance into the facility have been developed and implemented.\n\nA? Each employee involved in operating the ammonia system has received initial training and refresher training at least every three years.\n\nA? Written mechanical integrity procedures have been established and implemented.\n\nA? A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system.\n\nA? Pre-startup safety reviews are performed "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008973,
      "SummaryText": "when a modification is made to the ammonia system that is significant enough to require a change in the process safety information.\n\nA? Audits are conducted at least every three years to evaluate compliance with the CalARP regulations.\n\nA? Incident investigation procedures have been established.\n\nA? A written plan of action regarding the implementation of employee participation has been developed and implemented.\n\nA? Hot work permits are issued for all hot work operations conducted on or near the ammonia system.\n\nA? A Contractor Safety Policy has been developed and implemented.\n\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, Sun Pacific has assigned overall responsibility for the RMP elements to the General Manager.  The General Manager has the overall responsibility for the development, implementation, and integration of the RMP elements.\n\nFive-Year Accident History\n\nSun Pacific has not had any accidental releases from the ammonia-based refrigeration system that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\nEmergency Response Program\n\nSun Pacific has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  However, an emergency response program does not need to be developed for the facility since Sun Pacific employees will not respond to accidental releases of ammonia, the facility is included in the community emergency response plan, and appropriate mechanisms are in place to notify emergency responders.\n\nPlanned Changes To Improve Safety\n\nThrough the accidental release prevention program, Sun Pacific regularly evaluates the need for any changes to improve safety.  Currently, Sun Pacific does not have any additional changes pl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008973,
      "SummaryText": "anned to improve safety."
    }
  ]
}