{
  "FacilityID": 1000010448,
  "FacilityName": "Base Metals Refinery",
  "FacilityStr1": "1730 East 1st Avenue South",
  "FacilityStr2": null,
  "FacilityCity": "Columbus",
  "FacilityState": "MT",
  "FacilityZipCode": "59019",
  "Facility4DigitZipExt": "1209",
  "FacilityCountyFIPS": "30095",
  "LEPC": "Stillwater County LEPC",
  "FacilityLatDecDegs": "45.633338",
  "FacilityLongDecDegs": "-109.239731",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.stillwatermining.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 106572233,
  "ParentCompanyName": "Stillwater Mining Company",
  "Company2Name": null,
  "CompanyDUNS": 106572233,
  "Company2DUNS": 106572233,
  "OperatorName": "Stillwater Mining Company",
  "OperatorStr1": "P.O. Box 1209",
  "OperatorStr2": null,
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "MT",
  "OperatorZipCode": "59019",
  "OperatorZipCodeExt": "1209",
  "FTE": 168,
  "OtherEPAFacilityID": "59019STLLW1209L",
  "EPAFacilityID": "100000172252",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-05-27 00:00:00",
  "SafetyInspectionBy": "State Occupational Safety and Health Bureau",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-05-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-06 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-08-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-08-15 00:00:00",
  "DeRegistrationEffectiveDate": "2016-08-01 00:00:00",
  "AnniversaryDate": "2014-08-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 45.63167,
  "FRS_Long": -109.23472,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000012316,
      "AltID": "Se/Te Removal Circuit",
      "FacilityID": 1000010448,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000014204,
          "ProcessID": 1000012316,
          "ChemicalID": 49,
          "Quantity": 8176.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000012703,
          "ProcessID": 1000012316,
          "NAICSCode": "331419",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000010256,
              "Process_NAICS_ID": 1000012703,
              "SafetyReviewDate": "2009-07-01 00:00:00",
              "PHA_Date": "2008-04-29 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-07-24 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "SO2 pressure relief valve changeout-different pressure range and model",
              "OpProceduresReviewDate": "2009-01-28 00:00:00",
              "TrainingReviewDate": "2009-06-09 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-04-30 00:00:00",
              "EquipmentInspectionDate": "2009-08-03 00:00:00",
              "EquipmentTested": "SO2 sensors in covered circuit (BW model number UA-SEP-K2)",
              "ChangeMgmtDate": "2009-05-19 00:00:00",
              "ChangeMgmtReviewDate": "2009-04-07 00:00:00",
              "PreStartupReviewDate": "2009-06-18 00:00:00",
              "ComplianceAuditDate": "2008-12-11 00:00:00",
              "AuditCompletionDate": "2009-12-31 00:00:00",
              "IncidentInvestigationDate": "2008-09-22 00:00:00",
              "InvestigationChangeDate": "2008-09-24 00:00:00",
              "ParticipationPlansReviewDate": "2009-06-09 00:00:00",
              "HotWorkPermitReviewDate": "2009-04-29 00:00:00",
              "ContractorSafetyReviewDate": "2009-06-09 00:00:00",
              "ContractorSafetyEvalDate": "2009-07-13 00:00:00",
              "CBI_Flag": 0,
              "Description": "Se/Te Removal Circuit",
              "_chemicals": [
                {
                  "PrimaryKey": 1000011979,
                  "PreventionProgram3ID": 1000010256,
                  "ProcessChemicalID": 1000014204
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000010448,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-07-01 00:00:00",
    "ERTrainingDate": "2008-11-06 00:00:00",
    "CoordinatingAgencyName": "Stillwater Cnty. DES- (Eric Frank)",
    "CoordinatingAgencyPhone": "4063210689",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000010448,
      "SummaryText": "Executive Summary\n\n1.    Accidental Release Prevention and Emergency Response Policies\nThe Stillwater Mining Company (SMC) Base Metals Refinery (BMR) is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, hazard analysis' and employee training associated with the processes at our facility.  It is our policy to comply with all applicable federal, state, and local regulations as well as implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.\n\nOur emergency response program includes procedures for notification of the local volunteer fire department; notification of any potentially affected neighbors; and notification of local, state and federal agencies.  Safety is an essential part of our operations as demonstrated by the safety devices built-in to the design of this facility, the safe work practice procedures that we use, and the extensive training of our personnel.\n\n2.    The Stationary Source and the Regulated Substance Handled\nThe primary activity at the SMC BMR involves the upgrade of platinum and palladium from a platinum group metals (PGM) matte.  The SMC BMR is located in Columbus, Montana.\n\nSMC uses Sulfur Dioxide, a chemical listed by the RMP rule as a regulated substance which is stored on site above the EPA threshold quantity.  \n\n3.    The General Accidental Release Prevention Program and the chemical Prevention Steps.\nOur facility has taken all of the necessary steps to comply with the accidental release prevention requirements stipulated by the EPA under 40 CFR Part 68 as well as those of OSHA under the PSM standard 29 CFR 1910.119.  Our facility is also subject to EPCRA 302 notification require"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000010448,
      "SummaryText": "ments.  The following sections briefly describe the elements of the release prevention program that are in place at our facility\n\nProcess Safety Information\nThe SMC BMR maintains a detailed compilation of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the covered process.\n\nProcess Hazard Analysis\nThe SMC BMR conducts comprehensive studies to assure that hazards associated with the covered process are identified and controlled.  The methodology used to carry out the hazard analysis on the covered process was a combination of the Hazard and Operability (HAZOP) and What-if/Checklist techniques.  The studies are undertaken by a team of qualified personnel with expertise in engineering and operations.  The studies are lead by personnel with knowledge and expertise in the techniques utilized and are revalidated every five years.  Any findings of the Team are addressed in a timely and efficient manner.\n\nOperating Procedures\nFor the purpose of safely conducting activities within the covered process, the SMC BMR maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, and normal shutdown.  The information is reviewed annually and is readily available to operators working in the covered process.\n\nTraining \nThe SMC BMR has a comprehensive training program in place to assure that employees whose job tasks are affected by a covered process are competent in the operating procedures associated with the process.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nThe SMC BMR carries out highly documented maintenance checks on process equipment within the covered process to assure proper operations.  Process equipment examined include, pressure vessels, storage tanks, piping system and components, relief and vent s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000010448,
      "SummaryText": "ystems, controls, and pumps.  Trained and qualified personnel carry out maintenance operations.  Any equipment deficiencies identified are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at the SMC BMR to manage changes to process chemicals, technology, equipment, and procedures within a covered process.  Process operators, maintenance personnel, and any employees whose job task is affected by the change are promptly made aware of and trained on the change.\n\nPre-startup Safety Reviews\nPre-startup safety reviews related to new covered processes and to modifications in the established covered process are conducted as a regular practice at the SMC BMR.  These reviews are conducted to confirm that construction, equipment, and operating and maintenance procedures are suitable for safe startup of the process prior to placing the equipment into service.\n\nCompliance Audits\nThe SMC BMR will conduct audits on a regular basis to determine whether the provisions set out under the RMP regulation are being implemented.  These audits are carried out at least every three years and any corrective actions required as a result are undertaken in a safe and prompt manner.  Personnel with expertise in auditing are utilized to complete the audit.\n\nIncident Investigation\nIt is SMC BMR policy to investigate any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance within 48 hours of the incident.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent reoccurrence.  All incident investigation reports are retained for five years.\n\nEmployee Participation\nThe SMC BMR truly believes that process safety management and accident prevention is a team effort.  Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, SMC BMR employees have access"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000010448,
      "SummaryText": " to all information created as part of the facilities implementation of the RMP/PSM rule, including information pertaining to the process hazard analysis.\n\nHot Work Permit\nThe SMC BMR has a policy in place to safely conduct cutting, welding, or brazing activities in or adjacent to the covered process.\n\nContractors\nOn occasion, our facility hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The SMC BMR has a strict policy of informing the contractors of known potential hazards related to the contractors' work in the covered area.  All contractors working on the site are required to attend Contractor Safety Training before starting work, where they are informed of all the procedures for emergency response and of the chemical hazards on the site.\n\n4.    Five-year Accident History\nThere have been no accidental releases that have resulted in death, injury, property, or environmental damage.\n\n5.    Emergency Response Plan\nThe SMC BMR maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, and notification of local emergency response agencies and the public.\n\nTo assure proper functioning, the emergency response equipment will be regularly inspected and serviced, and mock emergency drills will be conducted.  \n\nThe Stillwater County Disaster and Emergency Services is the local (county) emergency response committee with which our emergency response plan has been coordinated. The refinery has a representative on this committee.\n\n6.    Planned Changes to Improve Safety\nThere are no improvements planned at this time."
    }
  ]
}