{
  "FacilityID": 1000051319,
  "FacilityName": "Flint Hills Resources Houston Chemical Plant",
  "FacilityStr1": "9822 La Porte Freeway",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77017",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County/Houston LEPC",
  "FacilityLatDecDegs": "29.706022",
  "FacilityLongDecDegs": "-95.251033",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": "www.fhr.com",
  "FacilityEmailAddress": "deanna.altenhoff@kochps.com",
  "FacilityDUNS": 79516796,
  "ParentCompanyName": "Flint Hills Resources Houston Chemical, LLC",
  "Company2Name": null,
  "CompanyDUNS": 56576507,
  "Company2DUNS": 0,
  "OperatorName": "FHR Houston Chemical, LLC",
  "OperatorStr1": "9822 La Porte Freeway",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77017",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard A. Wood",
  "RMPTitle": "Health, Safety and Security Manager",
  "FTE": 100,
  "OtherEPAFacilityID": "77017MBLCH9822L",
  "EPAFacilityID": "100000211825",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O1251",
  "SafetyInspectionDate": "2014-04-25 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-10-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-08-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-08-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-08-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064850,
      "AltID": "Propane Dehydrogenation",
      "FacilityID": 1000051319,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000065973,
          "ProcessID": 1000064850,
          "NAICSCode": "32511",
          "_desc": {
            "NAICS_CODE": "32511",
            "NAICS_DESCRIPTION": "Petrochemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000080238,
          "ProcessID": 1000064850,
          "ChemicalID": 57,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000080239,
          "ProcessID": 1000064850,
          "ChemicalID": 98,
          "Quantity": 820000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000080240,
          "ProcessID": 1000064850,
          "ChemicalID": 129,
          "Quantity": 1400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000580238,
          "ProcessID": 1000064850,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000580239,
          "ProcessID": 1000064850,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000580240,
          "ProcessID": 1000064850,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000051319,
      "SummaryText": "INTRODUCTION  \n\n \n\nFlint Hills Resources (FHR) Houston Chemical, LLC operates the FHR Houston Chemical Plant in Houston, Texas. The plant converts propane into propylene using propane dehydrogenation technology. Located on the Houston Ship channel, the plant is in close proximity to one third of the U.S. propylene consumption and the largest global exchange point of propylene.\n\n \n\nRISK MANAGEMENT PROGRAM Flint Hills Resources Houston Chemical Plant maximum inventory of the RMP regulated flammable substances propane and propylene, and the RMP regulated toxic substance aqueous ammonia (conc. 20% or greater) are above the RMP threshold quantities. Therefore, this site is required to maintain a Risk Management Plan (RMP) (Program Level 3). These RMP regulated substances are consumed, used, or manufactured in the dehydrogenation of propane to propylene. At any one time, the maximum amounts of the RMP regulated substances are: propane - 820,000 lbs., propylene - 1,400,000 lbs., and aqueous ammonia (30%) - 130,000 lbs. In updating its RMP, FHR Houston Chemical Plant has conducted an analysis of potential offsite consequences of accidental releases of both RMP regulated flammable and RMP regulated toxic substances present above threshold quantities. This includes a worst-case and alternative case release scenario for regulated toxic and regulated flammable substances. This RMP update is based on the current operating conditions and process equipment, and uses current census data available for impact to public and environmental receptors.\n\n \n\nPREVENTION PROGRAMS the FHR Houston Chemical Plant is covered by the OSHA PSM rule, and the EPA RMP rule. The site has a number of prevention programs to ensure the safety of its workers and the community it operates in:\n\n\n\nProcess Safety Information - The site maintains safety information including piping and instrument drawings, SDS/HSDS's, maximum inventories of equipment, safe operating limits, and equipment specifications. This inf"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000051319,
      "SummaryText": "ormation allows any employee involved with the process to understand the hazards associated with operating the process.\n\n \n\nHazard Reviews - The site performs process hazard analysis using HAZOP and LOPA methodologies for the covered process within a 5-year time frame, and for changes affecting the process.\n\n \n\nOperating Procedures - The site maintains operating procedures for applicable operating phases, which include safe upper and lower operating limits as well as consequences of deviation.\n\n \n\nMaintenance/Mechanical Integrity - Procedures are in place and are updated to insure the mechanical integrity of process equipment. Employees and contractors are trained in the potential hazards of the process. Testing and inspections are performed in a timely manner and follow RAGAGEP principles.\n\n \n\nWork Permit Safety Procedures - Cold Work, Hot Work, Line Breaking, Confined Space Entry and Soil Excavation/Penetration. These procedures contain a requirement for periodic field audits to verify the practice in the field meets procedure requirements. These procedures also have a review cycle.\n\n \n\nIncident Investigation/Reporting - The site has a process for reporting incidents. Incidents are reviewed with staff and supervisors daily. Root cause investigations are conducted for significant incidents (i.e. OSHA recordable injury, mechanical failures resulting in equipment damage or possible loss of containment of process materials/chemicals) and significant near miss incidents to prevent the incident from reoccurring.\n\n \n\nTraining - Training processes are in place to ensure operations personnel are adequately trained and qualified/certified for the jobs they perform. Periodic refresher training is required. Maintenance of certifications is required.\n\n \n\nInspection - The plant has a Facilities Inspection/Housekeeping Safety Procedure. The procedure contains checklists for various areas, i.e. Process and Storage Areas, Maintenance Shops, Roads and Grounds, Laboratory, Control r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000051319,
      "SummaryText": "oom and Offices. Representatives from the functional groups are required to participate in the inspections. Action items/findings are tracked to completion.\n\n \n\nManagement of Change- The plant has an MOC process that manages changes to the process, equipment, piping, staffing, training, etc. The plant uses a document/information management system to control the MOC documentation, approval, and change implementation process.\n\n \n\nSafety Policy - The plant has a Safety Policy whereby the management states their commitment to providing a safe and healthy workplace. The safety policy also defines the responsibilities of supervisors, company employees and contractors regarding safety performance, behaviors, and non-compliance consequences.\n\n \n\nPre-startup Safety Reviews (PSSRs) - As part of the MOC process, the plant conducts a PSSR for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with the design specifications and all supporting systems are operationally ready. The PSSR review team uses checklists to verify all aspects of readiness. A PSSR also involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\n \n\nCompliance Audits - FHR's policy is to periodically conduct audits to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every three-years or on an as-needed basis to track compliance with PSM and RMP requirements. At a minimum, an audit team composed of personnel knowledgeable in these requirements, auditing techniques and "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000051319,
      "SummaryText": "process unit technology conducts the comprehensive audit. The audit team develops findings in the form of action items that are documented in an audit report and the action items from the audit are placed in the LYNX action item tracking system. Corrective actions taken in response to the audit team's findings are tracked in LYNX. The final resolution of each finding is documented in LYNX, and the two most recent audit reports are retained in the Safety Department with the PSM Group.\n\n \n\nContractors - The plant uses contractors to supplement its workforce as part of routine practices or during periods of increased maintenance or construction activities. Before a contract employer is accepted at FHR, the contract employer is required to provide information pertaining to the contract employer's safety record in industry. This information is used in a screening process for accepting a contract employer to work at the plant as well as to renew and approve continued support from contract employers. Because some contractors work on or near process equipment, the plant has procedures in place designed to oversee and ensure that contractors: - perform work in a safe manner, - have the appropriate knowledge and skills, - are aware of the hazards in their workplace, - understand what they should do in the event of an emergency, - understand and follow site safety rules, and - inform plant personnel of any hazards that they find during their work. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work permitting process prior to beginning work. In addition, plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\n \n\nPlanned improvements to safety processes: - Develop a cross-sectional team to prepare for OSHA application to Voluntary Protection Program - Develop a Process Safety "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000051319,
      "SummaryText": "Hazard Recognition Tool to aid operations personnel in identifying process hazard, leading indicators. - Develop systems and tools to facilitate the use of portable electronic devices in the field. The goal being to improve communication capabilities of those working in the field, connecting them to databases, P&ID's, procedures, technical information, etc. - Revise the life critical safety procedure field auditing process to improve quality, involve personnel from all workgroups and all levels of management. - Revise the safety and housekeeping inspection process to improve quality, involve personnel from all workgroups and all levels of management. - Provide fixed automatic deluge protection for the reactor effluent structure. \n\n \n\nEMERGENCY RESPONSE Emergency response plans are in place to contain or mitigate hazardous substances should an accidental release occur. The emergency response activities are in coordination with the Greater Houston Local Emergency Planning Committee.\n\n \n\nCOMMITMENT TO SAFETY AND OUR COMMUNITY Flint Hills Resources Houston Chemical, LLC is an active member of the Houston Community Advisory Panel (HCAP). The HCAP is comprised of community residents, business people, teachers, etc. The HCAP meets monthly and participating industry representatives provide safety performance information, environmental information, facility operating conditions, business updates, etc. to the HCAP. Participating companies are committed to open, frank dialogue with the community members. Flint Hills Resources Houston Chemical plant follows applicable recommendations of API, as well as generally accepted engineering practices for process equipment and piping mechanical integrity inspections to ensure safety of its personnel and community. Flint Hills Resources integrates environmental, health and safety initiatives into its employee culture through a clear vision for excellence and principles of operation that demand safe and environmentally responsible decisio"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000051319,
      "SummaryText": "ns and actions. That dedication extends outside its facility as well. Flint Hills Resources' commitment to performance and EH&S excellence means working to prevent potential toxic or flammable releases.\n\n\n\n\n\n\n\n"
    }
  ]
}