{
  "FacilityID": 1000025098,
  "FacilityName": "Butterball, LLC",
  "FacilityStr1": "1628 Garner's Chapel Road",
  "FacilityStr2": null,
  "FacilityCity": "Mt. Olive",
  "FacilityState": "NC",
  "FacilityZipCode": "28365",
  "Facility4DigitZipExt": "0589",
  "FacilityCountyFIPS": "37061",
  "LEPC": "Duplin County LEPC",
  "FacilityLatDecDegs": "35.142302",
  "FacilityLongDecDegs": "-077.912458",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.butterball.com",
  "FacilityEmailAddress": "cphillips@butterball.com",
  "FacilityDUNS": 122262280,
  "ParentCompanyName": "Maxwell Farms",
  "Company2Name": "Seaboard Foods",
  "CompanyDUNS": 555944073,
  "Company2DUNS": 0,
  "OperatorName": "Butterball, LLC",
  "OperatorStr1": "P.O. Box 589",
  "OperatorStr2": "1628 Garner's Chapel Road",
  "OperatorCity": "Mt. Olive",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28365",
  "OperatorZipCodeExt": "0589",
  "RMPContact": "Ed Spafford",
  "RMPTitle": "Utilities Manager",
  "FTE": 1500,
  "OtherEPAFacilityID": "NCD122262280",
  "EPAFacilityID": "100000127542",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "578T05",
  "SafetyInspectionDate": "2011-10-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Ammonia Refrigeration",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-12-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-12-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-12-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-12-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 35.14275,
  "FRS_Long": -77.91258,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000030826,
      "AltID": "Refrigeration System 1",
      "FacilityID": 1000025098,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000031128,
          "ProcessID": 1000030826,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000037310,
          "ProcessID": 1000030826,
          "ChemicalID": 56,
          "Quantity": 108058.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000537310,
          "ProcessID": 1000030826,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000030827,
      "AltID": "Refrigeration System 2",
      "FacilityID": 1000025098,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000031129,
          "ProcessID": 1000030827,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000037311,
          "ProcessID": 1000030827,
          "ChemicalID": 56,
          "Quantity": 39719.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000537311,
          "ProcessID": 1000030827,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000025098,
      "SummaryText": "Executive Summary\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nWe at Butterball, LLC of Mt. Olive are committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our refrigeration personnel are at hand to control and mitigate the effects of the release.  We are also coordinated with Pleasant Grove Volunteer Fire Department, Oak Wolfe Volunteer Fire Department, Duplin County LEPC, and State of NC Hazardous Materials Regional Response Team, which provide additional emergency response.\n\n\n\n\n\n2. The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities revolve around the further processing and distribution of poultry products.  \n\n\n\nAnhydrous ammonia is the only regulated substance present at our facility.  The entire ammonia inventory is attributed to its use as a refrigerant within two separate systems.\n\n\n\nThe maximum inventory of ammonia for System #1 at our facility is 108,000 pounds for System 1 and the maximum inventory of ammonia for System 2 is 39,719 pounds.\n\n\n\n\n\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nTo evaluate the worst case and alternative release scenarios for ammonia we have used the methodology given in the Model Risk Management Program and Plan for Ammonia Refrigeration by SAIC.  The following paragraphs provide details of the chosen scenarios.\n\n\n\nThe worst case release scenario submitted for the Program 3 toxic substance as a class involves an unmitigated catastrop"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000025098,
      "SummaryText": "hic release of ammonia used as a refrigerant.  The scenario involves the release of 31,533 pounds of ammonia in a gaseous/liquid form over 10 minutes.  At Class F atmospheric stability and 1.5 m/s wind speed, the maximum distance of 3.1 miles radius is obtained corresponding to a toxic endpoint of 0.14 mg/L.\n\n\n\nOne alternative release scenario has been submitted for the toxic substance present in the Program 3 process.\n\n\n\nThe alternative release scenario for ammonia involves a release from a relief valve failure in the ammonia refrigeration process.  The scenario involves the release of 1,364 lbs of ammonia in a liquid form over 10 minutes.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 0.14 mg/L of ammonia is 0.3 mile radius.  \n\n\n\n\n\n 4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set forth under 40 CFR Part 68 of the EPA.  In addition, our facility is subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification requirements.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\n - Process Safety Information\n\nButterball, LLC of Mt. Olive maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with all the processes.\n\n\n\n - Process Hazard Analysis\n\nThe methodology used to carry out the analysis is What If-Checklist.  The analyses are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\n - Operating Procedures\n\nFor the purposes of safely conducting activities within our cover"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000025098,
      "SummaryText": "ed process, Butterball, LLC of Mt.Olive maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is reviewed and is readily accessible to operators involved with the process.\n\n\n\n - Training\n\nButterball, LLC of Mt. Olive has a training program in place to train employees who are operating the process or are associated with the process.  Refresher training is provided at least every three (3) years and more frequently as needed.\n\n\n\n - Mechanical Integrity\n\nButterball, LLC of Mt. Olive carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and compressors.  Maintenance procedures are carried out by qualified personnel with a background in maintenance practices.  Training is provided to the personnel as needed.  Any equipment deficiencies identified during maintenance checks are corrected in a safe and timely manner.\n\n\n\n - Management of Change\n\nWritten procedures are in place at Butterball, LLC of Mt. Olive to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel and all other employees whose job tasks are affected by a change in a process are promptly made aware of and trained to deal with the changes.\n\n\n\n - Pre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in the established process are conducted as a regular practice at Butterball, LLC of Mt. Olive. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\n - Compliance Audits\n\nButterbal"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000025098,
      "SummaryText": "l, LLC of Mt. Olive conducts audits on a regular basis to determine whether the provisions set out under the RMP Rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\n - Incident Investigation\n\nButterball, LLC of Mt. Olive promptly investigates any incident that could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\n - Employee Participation\n\nButterball, LLC of Mt. Olive truly believes that process safety management and accident prevention is a team effort.  Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information collected as part of the facility's compliance with the RMP Rule including information resulting from process hazard analyses.\n\n\n\n - Contractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Butterball, LLC has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors undergo a Contractor Safety Training class that familiarizes them with all of Butterball, LLC policies and proceedures. Contractors have a refresher to this class every 6 months. Contractors are also informed of all applicable procedures for emergency response to an accidental release of a regulated substance.\n\n\n\n\n\n5. Five-year Accident History\n\nButterball, LLC of Mt. Olive has experienced no releases over the last 5 years. Inspections of equipment, syste"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000025098,
      "SummaryText": "m upgrades and the reviews of standard operating procedures coupled with a sound mechanical integrity program help to reduce the potential for future releases.\n\n\n\n6. Emergency Response Plan\n\nButterball, LLC of Mt. Olive has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\n\n\n7. Planned Changes to Improve Safety\n\nContinued training, a strong mechanical integrity program and program reviews are some of the steps Butterball, LLC of Mt. Olive takes to improve safety at our facility. Butterball, LLC of Mt. Olive continues to look for more inovative and safe ways to manage our systems."
    }
  ]
}