{
  "FacilityID": 1000045461,
  "FacilityName": "BGC Manufacturing Ice Cream",
  "FacilityStr1": "13157 N. HWY 271",
  "FacilityStr2": null,
  "FacilityCity": "Tyler",
  "FacilityState": "TX",
  "FacilityZipCode": "75708",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48423",
  "LEPC": "Smith County LEPC",
  "FacilityLatDecDegs": "32.434653",
  "FacilityLongDecDegs": "-095.183658",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Brookshire Grocery Compnay",
  "Company2Name": null,
  "CompanyDUNS": 8953663,
  "Company2DUNS": 0,
  "OperatorName": "Brookshires Grocery Company",
  "OperatorStr1": "13157 N. HWY 271",
  "OperatorStr2": null,
  "OperatorCity": "Tyler",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75708",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark Bowen",
  "RMPTitle": "Manufacturing Operations Manager",
  "FTE": 110,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000033803",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-11-13 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-09-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-11 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-07-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-07-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.41528,
  "FRS_Long": -95.22976,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000056422,
      "AltID": "3",
      "FacilityID": 1000045461,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000057364,
          "ProcessID": 1000056422,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068791,
          "ProcessID": 1000056422,
          "ChemicalID": 56,
          "Quantity": 24867.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568791,
          "ProcessID": 1000056422,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045461,
      "SummaryText": " BGC Ice Cream Plant is a frozen dessert processing plant owned and operated by Brookshire Grocery Company under the Goldenbrook, Value Time and Food Club labels in Tyler, Texas. BGC Ice Cream uses Anhydrous Ammonia to keep products at federal mandated temperature levels and there is approximately 16,481 pounds of Anhydrous Ammonia on site. BGC Ice Cream has not had a reportable release of Anhydrous Ammonia in more than thirty years. The entire facility is located behind an eight-foot security fence with A?authorized personnelA? access only to and from premises. Armed security personnel guard the entire facility, 24 hours a day, 365 days a year. BGC manufacturing maintenance department has over 100 years of combined experience with Anhydrous Ammonia.\n\n Maintenance personnel responsible for the ammonia system are trained every year in the proper technique of wearing emergency response equipment such as SCBA, Ammonia Respirators, Level A Suits, and other required PPE In Accordance With (IAW) OSHA 1910.134. BGC Ice Cream and Brookshire Grocery Company maintain close ties with the Local Emergency Planning Commission (LEPC), Tyler Fire Department, Winona Fire Department, and their Hazmat Team. Annually BGC Dairy conducts tours for these organizations to maintain familiarity with the facility. The Tyler, and Winona Fire Departments and their Hazmat Team have both recognized the experience that BGC Ice Cream personnel have in respect to Anhydrous Ammonia response and have requested that the Hazmat Team backup BGC Ice Cream personnel in the event of an ammonia release. In addition, all on site partners receive training and conduct rehearsals in emergency evacuation annually. All new partners receive training in emergency evacuation and ammonia awareness during the new partner orientation process.\n\nBGC Ice Cream's ammonia equipment vents to the atmosphere. All piping is routed to the roof so that if there is a Pressure Release Valve (PRV) discharge, the release will be outdo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045461,
      "SummaryText": "ors. All piping from our pressure relief valves are tied into main headers that have been routed to the roof and placed an additional twenty feet in the air IAW ANSI/IIAR 2 1999 7.3.2. An \"Emergency Anhydrous Ammonia Control Box\" is located outside the building, but within our facility, that would allow A?Authorized PersonnelA? to shut down the system in the event of a major release. BGC Ice Cream has implemented and continues to conduct an aggressive, preventative maintenance program, IAW IIAR Bulletin 110, to ensure that all hazards are addressed to reduce the risk of an Anhydrous Ammonia release.\n\nIn the event of a suspected release of Anhydrous Ammonia, BGC Ice Cream has a Spill Prevention Control and Countermeasures and Emergency Response Contingency Plan in place. This plan receives annual updates, or when deemed necessary by Management or the Environmental Health and Safety Coordinator. The plan is designed to protect our partners and our community. BGC Dairy, Supervision, Security, LEPC, Tyler/Winona Fire Department, and their Hazmat Team have access to the Emergency Response Contingency Plan. This plan consist of an emergency notification call down list containing 24 hour contact numbers for all trained responders, the duties for Ammonia Specialist/Responders, contact information for the LEPC, SERC, NRC, TCEQ, and a  MSDS  for Anhydrous Ammonia.\n\nBGC Ice Cream is planning several changes to improve safety. In addition to our annual training requirements, BGC Ice Cream will also conduct internal annual training. Another change to policy is the security guards; they will receive advanced training from an external source on hazmat response. Cross training of maintenance personnel responsible for the ammonia will continue between the facilities. With these changes to improve safety and continuing good engineering practices, BGC Ice Cream will continue to be a safe facility.\n\n"
    }
  ]
}