{
  "FacilityID": 1000104590,
  "FacilityName": "Western Precooling Systems-Commercial Cooler",
  "FacilityStr1": "1001 Commercial Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.190480",
  "FacilityLongDecDegs": "-119.171060",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Western Precooling Systems",
  "Company2Name": null,
  "CompanyDUNS": 81840753,
  "Company2DUNS": null,
  "OperatorName": "Western Precooling Systems",
  "OperatorStr1": "1001 Commercial Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Oxnard",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93030",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000182125",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-07-17 00:00:00",
  "SafetyInspectionBy": "Oxnard Fire/CUPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "RMP Submit Update 06 08 EC update",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-03-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-03-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-03-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-03-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.19048,
  "FRS_Long": -119.17106,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000130394,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000104590,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000163523,
          "ProcessID": 1000130394,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000131854,
          "ProcessID": 1000130394,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000112354,
              "Process_NAICS_ID": 1000131854,
              "SafetyReviewDate": "2023-01-19 00:00:00",
              "PHA_Date": "2023-12-31 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-01-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Error; Forklifts",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Programmable Logic Controller (PLC); Level Controls",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ammonia-Water Diffusion System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Administrative & Maintenance Improvements",
              "OpProceduresReviewDate": "2023-01-16 00:00:00",
              "TrainingReviewDate": "2023-02-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "PHA participation; Online training; Tailgate Safety Meetings",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-03-20 00:00:00",
              "EquipmentInspectionDate": "2023-02-24 00:00:00",
              "EquipmentTested": "IIAR 6 Inspection-R081",
              "ChangeMgmtDate": "2019-03-05 00:00:00",
              "ChangeMgmtReviewDate": "2021-09-10 00:00:00",
              "PreStartupReviewDate": "2019-07-02 00:00:00",
              "ComplianceAuditDate": "2021-09-10 00:00:00",
              "AuditCompletionDate": "2023-03-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-09-10 00:00:00",
              "HotWorkPermitReviewDate": "2021-09-10 00:00:00",
              "ContractorSafetyReviewDate": "2023-03-16 00:00:00",
              "ContractorSafetyEvalDate": "2021-09-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000141178,
                  "PreventionProgram3ID": 1000112354,
                  "ProcessChemicalID": 1000163523
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000104590,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-02-03 00:00:00",
    "ERTrainingDate": "2023-03-06 00:00:00",
    "CoordinatingAgencyName": "Oxnard Fire Dept/CUPA",
    "CoordinatingAgencyPhone": "8053857722",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29 CFR 1910.120(q) First Responder Training, IIAR Inspection Protocols"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000104590,
      "SummaryText": "resentatives have participated in Process Hazard Analysis (PHA) over the years\n\n1.4 Five-Year Accident History\n\nThere have been no qualified accidents.  There is no data to report.\n\n1.5 The Emergency Response Program\n\nThe Emergency Response Program is divided into two elements, as only properly trained and qualified personnel are authorized to respond to emergencies.  Personnel that are not involved in the actual cooling process are trained to notify and evacuate.  Only personnel trained to 29 CFR 1910.120(q) standards and the Oxnard Fire/CUPA would respond to an actual release. Written ammonia emergency action procedures are detailed in the WPS/Commercial “Thirty Minute Plan”.  Available emergency equipment is listed in the facility’s Calif. Hazardous Material Business Plan (HMBP), which also details procedures for non-responding personnel.  Each of these Plans are maintained on-site and updated on a regular basis.  The HMBP is filed with the Oxnard Fire/CUPA.  \n  \n1.6   Planned changes to improve safety\n\nThe primary mechanisms to identify and plan safety improvements include (but are not limited to):\n- Process Hazard Analysis revalidations/updates\n- Compliance Audits\n- Routine inspections and maintenance (Mechanical Integrity Program)\n- IIAR Bulletin 109 Inspections\n- WPS Inspection Protocol\n\nThe programs above may result in recommendations ranging from capital improvements to routine maintenance of the plant.  Where appropriate service calls are established in parallel to identified needs.  Current planned changes to improve safety include recommendations as a result of the Process Hazard Analysis update performed by an experienced team on January 19th, 2023.  The recommendations have been reviewed by Commercial management and a written implementation schedule has been prepared.  Completion is scheduled by December 31, 2023."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000104590,
      "SummaryText": "Investigation, and Contractor’s Safety.  Other safety programs are integrated with the PSM Program, to the extent practicable, appropriate and/or required (such as the California Injury and Illness Prevention Program/IIPP).  Inspections required by the IIPP and other industry standards are performed by qualified personnel.    \n\nChemical-Specific Prevention Steps\n\nIt has become apparent in the industry that a mishap while draining oil from the system is one of the most common incidents to occur, so special self-closing valves were installed as a permissive for oil drain flow.  If a release were to develop during the oil-draining task, the mechanic simply releases the handle of the self-closing valve and flow is terminated.  The facility has installed these types of valves at each oil drain point.\n\nOther Chemical-Specific Prevention Steps:\n-  Fencing and gates to limit access by potential “wrong-do-ers”\n-  The facility is equipped with a Closed-Circuit TV (CCTV) System   \n-  A monitoring system monitors process parameters 24/7/365\n-  Technicians can access system controls remotely\n-  The alarm system including ammonia alarms is continuously monitored via a third-party security company in addition to direct messaging of Technicians\n- The refrigeration system is equipped with an ammonia-water diffusion system.  Pressure Relief Valves (PRVs) are piped into this system to prevent a release to atmosphere in the event of a PRV operating.\n-  A sign-in/sign-out program is established and enforced\n- Staff is trained in hazard communication (discovery and communicating) for un-authorized personnel, suspicious activity, fires, releases or other hazardous/suspicious condition   \n- Staff is trained in fire and accident prevention benefits of good housekeeping. The general appearance of the facility is maintained on a day-to-day basis.\n- WPS/Commercial worked closely with Oxnard Fire/CUPA in the planning and execution of the Plant and the refrigeration system\n- Oxnard Fire/CUPA Rep"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000104590,
      "SummaryText": "piping between the portable components is permanently mounted.  Some of the refrigerating equipment within the refrigerated space is permanently mounted, and some equipment is portable, which is common in the industry.\n   \n1.3 General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nAccidental Release Prevention Program\n\nWPS is the company that operates and maintains the facility’s ammonia refrigerating equipment. WPS has developed comprehensive written procedures for the operation and maintenance of the equipment, including the steps to be taken in the event of a release or threatened release.  The written procedures include necessary safety precautions for Plant operation, from installation and start-up to daily operation, to disassembly and moving of portable equipment.  As equipment maintenance needs are determined, the need is expressed at workload meetings conducted by the WPS Area Manager.  The specific repair task or upgrade for the expressed need is decided by the WPS Area Manager and entered into a computerized service call system. Tasks are tracked through this system. Through this regular routine of inspect, discuss, assign and confirmation of completion, WPS/Commercial Cooler has reduced equipment operational problems and also reduced release potentials.\n\nWPS actively encourages its ammonia technicians to seek Certification through the Refrigerating Engineers and Technicians Association (RETA).    \n\nAs noted above a comprehensive Process Safety Management (PSM) Program has been established. In California the program is in accordance with CCR 8, 5189.  The PSM Program is specifically intended to promote the safe operation of ammonia-handling equipment and process, and to prevent accidental releases via its elements of Process Safety Information, Process Hazard Analysis, Written Operating Procedures, Training, Mechanical Integrity, Management of Change, Pre-startup Safety Reviews, Hot Work Permits, Compliance Audits, Incident"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000104590,
      "SummaryText": "f training and/or responsibility.  \n\nThe facility is supported by Western Precooling Systems (WPS) for refrigeration maintenance needs.  WPS supports HAZWOPER 1910.120 (q) training for key Refrigerating Technicians and management personnel.  These personnel are available to support Oxnard Fire/CUPA and the facility in the event of an emergency.  These personnel are on-call to the facility 24/7/365.  The WPS Oxnard-area office is on-site.  Written procedures that include pre-planning for emergencies have been developed within the facility “Thirty Minute Plan”.    \n\nA relationship with Oxnard Fire/CUPA has been established; emergency response pre-planning is coordinated via regular site visits/inspections and submittal of appropriate EPCRA and other compliance reports.  Compliance reports and submittals are updated in accordance with applicable requirements at pre-determined intervals. \n\n1.2  General Description of the Stationary Source and Regulated Substances\n\nWPS/Commercial was remodeled and expanded in 2002-2003; and provides for the precooling and short-term refrigerated storage of fresh fruits and vegetables (primarily fresh berries). The facility went into operation early in April 2003.  This is a 5-year update (2023) of the Risk Management Plan (RMP) as required by Federal and State Accidental Release Prevention (Fed/ARP and Cal/ARP) RMP Rules.  There has been little change to the facility over the last 5 years.  \n\nThe facility is located in an industrial area of Oxnard.  Anhydrous Ammonia CAS # 7664-41-7 is used as the refrigerant in the refrigerating system.  This is a mechanical vapor compression refrigeration system which was installed according to the codes and standards locally adopted in 2002-2003.  The facility maintains the necessary operating permits from the City of Oxnard and City of Oxnard Fire/CUPA.  \n\nA portion of the refrigeration equipment is portable and is moved on & off-site according to seasonal produce market demand.  The inter-connected"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000104590,
      "SummaryText": "RISK MANAGEMENT PLAN LEVEL III / 5-YEAR UPDATE 2023 \n\n1\tEXECUTIVE SUMMARY\n\t1.1   Accidental Release Prevention and Emergency Response Policies.\n\t1.2   General Description of The Stationary Source And Regulated Substances.\n\t1.3   Summary of The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\t1.4   Summary of The Five-Year Accident History.\n\t1.5   Summary of The Emergency Response Program.\n\t1.6   Planned Changes To Improve Safety.\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\nThe Western Precooling Systems – Commercial Cooler (WPS/Commercial)  Accidental Release Prevention and Emergency Response Policies are simply not to have accidental releases or emergencies.  The Company endeavors to execute this policy through the daily implementation of its Safety Programs.  Company safety programs include but are not limited to a comprehensive Process Safety Management Program (PSM). The PSM Program is an integrated, holistic approach to the safe operation of processes using Regulated Substances.  The PSM Program is specifically designed and intended to prevent accidental releases, and to deal safely with emergencies if and when they do happen.  It is the primary goal of WPS/Commercial to protect its employees, visitors, and neighbors from harm due to Company operations.  \n\nA “Non-Responding Facility” policy has been adopted.  A Hazardous Material Business Plan consistent with Emergency Action Plan requirements has been developed.  The Staff communicate to the Fire Department and evacuate (shelter-in-place or evacuate off site) if there is a release situation or fire; Managers and employees would shepherd visitors (truck drivers receiving product or delivering product) if there is an emergency.  By effectively determining all persons are safe, the Fire Department can more swiftly manage the tactical part of a response.  It is company policy that no one shall respond to an emergency in a way that is beyond their level o"
    }
  ]
}