{
  "FacilityID": 1000063741,
  "FacilityName": "Pennsylvania Grain Processing, LLC",
  "FacilityStr1": "250 Technology Drive",
  "FacilityStr2": null,
  "FacilityCity": "Clearfield",
  "FacilityState": "PA",
  "FacilityZipCode": "16830",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42033",
  "LEPC": "Clearfield County LEPC",
  "FacilityLatDecDegs": "41.028280",
  "FacilityLongDecDegs": "-78.424620",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 884270385,
  "ParentCompanyName": "Zeeland Farm Services, Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pennsylvania Grain Processing,, LLC",
  "OperatorStr1": "250 Technology Drive",
  "OperatorStr2": null,
  "OperatorCity": "Clearfield",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16830",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eric Meeuwsen",
  "RMPTitle": "General Manager",
  "FTE": 68,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000210318",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-09-15 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-07-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-07-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-07-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000079981,
      "AltID": "Denaturant",
      "FacilityID": 1000063741,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000081202,
          "ProcessID": 1000079981,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000099734,
          "ProcessID": 1000079981,
          "ChemicalID": 125,
          "Quantity": 1084200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000599734,
          "ProcessID": 1000079981,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063741,
      "SummaryText": "The Pennsylvania Grain Processing (PGP facility in Clearfield, Pennsylvania is completing this Risk Management Plan (RMP) resubmission to remove anhydrous ammonia from the registered materials in the RMP. The facility previously completed a 5 year resubmit in 2013 for both denatured gasoline and anhydrous ammonia. The facility eliminated the use of anhydrous ammonia from its process at the end of 2016. The facility removed the ammonia from the site and purges the lines and tank in early 2017. \n\n\n\nThe facility still utilizes natural gasoline as an additive, or denaturant, to the fuel grade ethanol to make it unfit for human consumption. The denaturant has a flash point of 6.8 degrees F and a boiling point of 80.6 degrees F so it meets the flammability definition for RMP applicability. The facility stores denaturant in a tank with a gross volume of 188,000 gallons. The natural gasoline is comprised of a mixture of light hydrocarbons with at least 50 percent of the material being pentane. Therefore, pentane was used for worst case and alternate case release scenario modeling. \n\n\n\nThe United States Environmental Protection Agency (USEPA) RMP Rule requires that covered facilities prepare an Executive Summary.  The following pages represent the Executive Summary, summarizing the items required as described in 40 CFR Part 68.155 (a) through (f).\n\n\n\nA?68.155(a) Accidental Release and Emergency Response Policies\n\nPGP has documented emergency response procedures in place, as documented in the facility's Emergency Action Plan.  This plan has been endorsed by PGP staff responsible for the operation and maintenance of the facility. PGP has procedures in place, including both onsite activities and coordination with offsite responders, which must be followed in the event of a release of natural gasoline.  All personnel involved in handling natural gasoline are trained with regard to the properties of the material and safe handling and incipient level release response. \n\n\n\nA?68.155"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063741,
      "SummaryText": "(b) Stationary Source and Regulated Substances Handled\n\n\n\nThe stationary source subject to 40 CFR Part 68 is the Pennsylvania Grain Processing, LLC facility.  The regulated substance handled is natural gasoline, a flammable mixture of light hydrocarbons.\n\n\n\nA?68.155(c) Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nPGP has a documented Prevention Program for the natural gasoline process that documents release prevention measures.  These prevention measures include elements such as Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Mechanical Integrity, Management of Change, Pre-Startup Review, Compliance Audits, Incident Investigation, Employee Participation, Hot Work Permit and Contractors.  \n\n    \n\nPGP employees who are involved in natural gasoline operations and maintenance are trained in specific procedures regarding handling and storage of natural gasoline at the facility.\n\n\n\nA?68.155(d) Five-Year Accident History\n\nThe PGP facility has not had any reportable releases of any regulated substances since operation commenced.\n\n\n\nA?68.155(e) Emergency Response Program\n\nPGP is a non-responding facility, as defined by USEPA (29 CFR Part 40 CFR Part 311).  Therefore, PGP has developed an Emergency Action Plan to ensure employee safety instead of an Emergency Response Program, as allowed by 40 CFR Part 68.90(b). The PGP Emergency Action Plan outlines actions required to respond to a natural gasoline emergency and has coordinated this plan with Clearfield County Emergency Management and the Clearfield Fire Department. Fire Department personnel are the designated first responders in the event of a natural gasoline emergency at the PGP facility.  PGP employees are not designated responders to a release of natural gasoline.  As specified in 40 CFR Part 68.90, PGP's Emergency Action Plan meets the exception listed in 40 CFR Part 68.90(b) and therefore, the facility is not required to have the Emergency Response Pro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063741,
      "SummaryText": "gram of 40 CFR Part 68.95.\n\n\n\nA?68.155(f) Planned Changes to Improve Safety\n\nRecommendations for safety improvements were identified in the most recent compliance audit conducted in July of 2016. Recommended improvements for SOPs and training were made during that audit and the facility is in the process of implementing those recommendations.\n\n"
    }
  ]
}