{
  "FacilityID": 1000028288,
  "FacilityName": "Johnson Controls, Inc. Greenfield",
  "FacilityStr1": "1147 N. Washington Street",
  "FacilityStr2": null,
  "FacilityCity": "Greenfield",
  "FacilityState": "OH",
  "FacilityZipCode": "45123",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39071",
  "LEPC": "Highland County LEPC",
  "FacilityLatDecDegs": "39.355556",
  "FacilityLongDecDegs": "-083.388889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.johnsoncontrols.com",
  "FacilityEmailAddress": "Mary.Kay.Dodero@jci.com",
  "FacilityDUNS": 6556849,
  "ParentCompanyName": "Johnson Controls, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 199558404,
  "Company2DUNS": 0,
  "OperatorName": "Johnson Controls, Inc.",
  "OperatorStr1": "1147 N. Washington Street",
  "OperatorStr2": null,
  "OperatorCity": "Greenfield",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45123",
  "OperatorZipCodeExt": null,
  "RMPContact": "David L Johnson",
  "RMPTitle": "Plant Manager",
  "FTE": 250,
  "OtherEPAFacilityID": "45123JHNSN1147",
  "EPAFacilityID": "100000085169",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0536010034",
  "SafetyInspectionDate": "2015-03-02 00:00:00",
  "SafetyInspectionBy": "NSF-ISR",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-13 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.35556,
  "FRS_Long": -83.38889,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034519,
      "AltID": "auto seating foam",
      "FacilityID": 1000028288,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000034821,
          "ProcessID": 1000034519,
          "NAICSCode": "33636",
          "_desc": {
            "NAICS_CODE": "33636",
            "NAICS_DESCRIPTION": "Motor Vehicle Seating and Interior Trim Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041722,
          "ProcessID": 1000034519,
          "ChemicalID": 77,
          "Quantity": 244000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000541722,
          "ProcessID": 1000034519,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028288,
      "SummaryText": "    1.0   ACCIDENTAL PREVENTION AND EMERGENCY RESPONSE POLICY\n1.1    Johnson Controls Policy on Safety and the Environment \n\nJohnson Controls is committed to full compliance and adherence with all applicable laws and regulations regarding environmental protection, accident prevention and emergency response and the integration of sound environmental practices into business decisions.  \nJohnson Controls:\nA?    Minimizes worker exposure to potential safety hazards through proper design, engineering and\nA?    Administrative controls, preventive maintenance and safe work procedures. Provides and properly maintain machine safeguards, interlocks and\n barriers. Workers are not to be disciplined for raising safety concerns.\nA?    Maintains appropriate emergency plans and response procedures.\nA?    Manages, tracks and reports occupational injuries and illnesses.\nA?    Provides clean toilet facilities, and access to potable water and sanitary food preparation and storage facilities.\nA?    Strives to continuously improve health and safety performance in all of its operations.\nA?    Minimizes adverse effects of our operations on the community and environment, while safeguarding the health and safety of the public.\nA?    Acquires, maintains, and complies with the appropriate environmental permits, registrations, and law.\nA?    Implements programs to conserve water and energy, and reduce waste.\nA?    Identifies and manages potentially hazardous materials used in our operations to ensure safe handling,\nA?    Movement, storage, recycling or reuse, and disposal of such materials.\nA?    Monitors, treats, and controls air emissions, wastewater and waste as required prior to discharge or\nA?    Disposal.\nA?    All manufacturing facilities are expected to adopt a management system compliant with ISO 14001 that promotes continuous improvement and compliance with applicable laws, regulations and contract requirements.\nA?    Johnson Controls is striving to fully achieve these principles throughout its operations worldwide.\nA?    Supervisors are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028288,
      "SummaryText": " responsible for helping their team members comply with this policy.\nA?    Employees are expected to comply with the policy, and submit their questions or concerns to supervisory staff or to members of Human Resources, Legal or other departments as appropriate.\nEmployees are also encouraged to raise any issues and concerns with their supervisor, Human Resources department, a member of the Legal Department or through the use of the 24-hour Integrity Helpline for information. \n\n1.2    Risk Management System\n\nJohnson Controls has developed a management system to implement and maintain compliance with the Accidental Release Prevention (ARP) programs.  This management system identifies lines of responsibility for the entire program and each of its key elements.\nFigure 1-1 identifies the key positions within the corporate structure that will provide this support. \n \n\nFigure 1-1 Risk Management System Organization Chart\n\n    Accidental Release Prevention Program\n               (40 CFR (68))    \n    A?    Environmental Coordinator \n    A?    Process Manager\n            \nOff-Site Hazard Assessment        PSM Program           Emergency Response Program\n\nA?  RMPlan: Environmental Coor.    A?   Environmental Coordinator   A?    Environmental Coordinator\nA?  Highland County LEPC      A?   Process Manager             A?    Process Manager         \n                                A?   Plant Engineer                       \n        \n\n\n \n2.0   PROCESS AND SUBSTANCE SUBJECT TO 40 CFR PART 68\nJohnson Controls in Greenfield Ohio operates a process to manufacture polyurethane foam that uses LUPRANATE&reg;8020 ISOCYANATE, a liquid chemical that contains a toxic substance regulated under EPA's Risk Management Program (40 CFR Part 68), toluene diisocyanate (unspecified isomers, CAS 26471-62-5) referred to here as TDI and is subject to U.S. Environmental Protection Agency (U.S. EPA) regulations governing Accidental Release Prevention (ARP) Requirements: Risk Management Programs under Section 112(r) of the Clean Air Act (40 CFR Part 68), bec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028288,
      "SummaryText": "ause TDI is present in amounts exceeding the 10,000 lb regulated quantity. \nTDI is liquid with a sharp, pungent odor and toxic from acute (short-term) exposures.  The odor threshod for TDI is 0.17 parts per million (ppm).  Acute exposure to high levels of TDI in humans, via inhalation, results in severe irritation of the skin and eyes and affects the respiratory, gastrointestinal, and central nervous systems (CNS).  The toxic endpoint for acute exposures established by EPA for Risk Management Programs is 7 mg/m3 (1 ppmv). \nTDI, which presently is delivered to the plant via tank trucks or railcar tanker.  The railcar and the tank truck share the unloading platform which is used to fill up to six 5,000-gallon storage tanks located inside of the plant, within a specially designed containment room.  The threshold quantity for the Risk Management Plan for TDI is 10,000 lb. With a density of 10.2 lb per gallon the maximum amount of TDI that can be stored at the plant is 306,000 lbs, which corresponds to about 245,000 lb of TDI. \nWhen the truck/railcar arrives it is inspected for any visible signs of damage or leaks.  Appropriate precautions and procedures are implemented if a truck/railcar is found to be deficient.  The railcar/truck is connected to the offloading system with the entire contents transferred into six indoor storage tanks; the railcar/truck and each tank are slightly pressurized with a dry air blanket to prevent moisture buildup in the system.  Due to the continuous operation of foam production, when TDI is required to be transferred to wet system day tank the pump in the storage tank room is activated.  The transfer operation ceases when the day tank sensor indicates that it is full or if filling has not been completed in a specified time (which could indicate a fill problem or leak).\nThe 60-gallon day tanks for each line are located on mezzanines.  Each day tank has a dry air blanket to prevent moisture.  TDI is transferred to the pour head through the \"w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000028288,
      "SummaryText": "et system\", consisting of a conditioning pump, filter and heat exchanger followed by a metering pump (4000 psi) and which sends high pressure TDI through stainless steel piping to the pour heads.  The conditioning pump ensures a constant pressure and flow of TDI to the filter and heat exchanger to the metering pump.  A return line on the exit side of the conditioning pump to the day tank through a constant pressure valve prevents deadheading.  The filter and heat exchanger ensure the purity and appropriate temperature of TDI for foam production.\nA high pressure flow of TDI is received from the wet system to a flexible hose.  The pour head mixes the component raw materials (TDI and polyol / catalyst mixture) to a uniform mixture and transfers the mixture to the molds.  TDI pour head calibration is conducted on a preset schedule and interim adjustments are made as necessary.  To perform the calibration an operator sets the pour head to calibration mode, which injects one chemical at a time.  TDI is poured into a bucket and weighed to determine that the correct quantity of TDI is injected and the TDI is then either returned to the day tank or appropriately disposed. During molding operations once the TDI/polyol mixture is injected into the mold the mold is closed and an exothermic chemical reaction takes place that transforms the mixture to a polyurethane foam product.  Once this reaction takes place TDI is no longer present in quantities exceeding 1% marking the terminal node of the RMP regulated process.\nThe TDI process has numerous safeguards in place that help prevent the release of TDI and prevent on and off-site exposure if a release were to occur.  These include:\nA?    A spill pad, trench and piping system in the rail/truck unloading area that will collect spilled TDI and passively transfer it to a lined holding pond;\nA?    Isocyanate detectors which would set off alarms in the TDI storage room, mezzanine and pour head areas;\nA?    Flow, temperature, timing and pressure "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000028288,
      "SummaryText": "systems with interlocks;\nA?    Requirements that PPE be used by the operator during TDI unloading and system maintenance\nA?    Forced plant air providing protection to workers in the molding area. \nThe U.S. EPA Risk Management Regulation identifies three levels of requirements for industrial processes.  Program 1 can be applied to any process which has not had a \"significant\" release of a regulated substance over the five year period prior to the RMPlan submittal date and for which the worst-case release does not affect \"public receptors\" (e.g., residences, parks and recreation areas, commercial/industrial facilities, hospitals).  Given that the TDI process contains substantial quantities of that if released outdoors could affect public receptors, it does not qualify for Program 1.  Program 2 applies to this facility because it is not subject to OSHA's Process Safety Management (PSM) program.  \nA?\n&#8195;\n\n    \n3.0 OFF-SITE HAZARDS ASSESSMENT\n\nFor the purposes of developing and maintaining adequate RMPlans, the U.S. EPA has defined in its governing rules and guidance a series of modeling methods and assumptions which are to be utilized as administrative guides for planning purposes.  In order to standardize and simplify to a practical level the many factors that can potentially occur in an accidental release situation, some of these assumptions may not take into account the available preventive measures or mitigation methods that would diminish or even eliminate the implied risks that are suggested by \"worst-case\" analyses.  For that reason, both the results for the standardized \"worst-case\" defined by the U.S. EPA methods and an alternative case, which is considered by Johnson Controls to more realistically represent situations that may possibly, but rarely, occur within the lifetime of the facility, are presented and described.  \nNo accidental release of TDI has occurred at the Johnson Controls Greenfield facility which has resulted in reportable on-site injury, off-sit"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000028288,
      "SummaryText": "e injury, emergency response, or damage to property or the environment.  To ensure that mitigation measures and emergency response plans are appropriate, potential release scenarios are considered.  Thus, the sections of the Risk Management Plan which discuss both the worst-case and the alternative case, believed to be somewhat more probable, are meant to provide the data necessary to develop and evaluate possible improvements in the overall safety provided by the programs which constitute the Johnson Controls Risk Management Program.   \nThe RMP regulation defines a worst-case release of a liquid as an instantaneous spill of a single vessel accounting for passive mitigation including physical barriers that prevent the spread of the resulting pool and enclosures which would limit the rate of evaporation.  The temperature of the release is the maximum daily temperature over the past three years or the process temperature, whichever is higher.  The release to the atmosphere is assumed to be at ground level and dispersion conditions are set to atmospheric stability category F (very stable) and a surface (10 m) wind speed of 1.5 m/sec.   \nIn accordance with revised Risk Management Plan requirements promulgated on April 9, 2004 and in deference to the concerns of the Department of Homeland Security, this executive summary does not include a description of the release scenarios and their consequences.  Specific information regarding the off-site hazards assessment for worst-case and alternative releases is included in the RMP data elements.\n \n.\nA?A?A?A?A?A?A?\n4.0   ACCIDENT PREVENTION\n\nThe processes subject to the Risk Management Program 2 requirements to which the Johnson Controls facility is in full compliance.  Johnson Controls. has in-place specific operational programs to address RMP Program Prevention Program requirements. These include: \nA?    Process Safety Information\nA?    Hazard Review\nA?    Operating Procedures\nA?    Training procedures for operators and general safety tra"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000028288,
      "SummaryText": "ining for all employees\nA?    Maintenance Procedures \nA?    Incident Investigation Procedures\nA?    Compliance Audits\nIn addition to these programs, Johnson Controls has designed and constructed the TDI system to meet stringent safety requirements.  \n\n\n5.0   FIVE-YEAR ACCIDENT HISTORY\n\nWithin the past five years there has been no accident at the Johnson Control Greenfield, Ohio facility that qualifies for reporting under the risk management program.  This means that that there has been no incident resulting in the sudden release of TDI that has caused on-site or off-site injury, significant on-site damage or any off-site emergency response or injury.   In conjunction with the current ARP and PSM programs in place at the Johnson Controls facility, there is a standard management practice that requires immediate internal reporting of unusual events, including those in which any abnormal emission of regulated chemicals is observed or suspected.  The incident information is reviewed by supervisory staff and a determination is made as to whether a reportable quantity on any chemical listed as requiring reports to regulatory authorities is involved.  If so, the appropriate authorities are promptly notified.\n \n \n6.0   EMERGENCY RESPONSE PROGRAM\n\nIt is the policy of the Johnson Controls to place the highest priority on employee safety and health and on protection of the community from all plant-induced environmental conditions. Experience has shown that proper planning and an organized approach will reduce the effects of emergency events.  Prompt internal and external communications, emergency equipment, and trained personnel are the key ingredients of this plan.  Johnson Control's policy provides for external communications with local and county-wide response agencies.  The Highland County HAZMAT Team has the lead responsibility in responding to major releases of TDI that would have the potential to affect off-site locations.\n\n \n7.0   PLANNED CHANGES TO IMPROVE SAFETY\n\nJohnson Contr"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000028288,
      "SummaryText": "ols, under the recent RMP program, and earlier Superfund Amendments and Reauthorization Act (SARA) Title III Community Right-to-Know Act compliance programs, has organized its managemeA?nt system to effectively address hazards and potential risks.  Both the advanced planning aspects of process design, operating procedures, emergency preparedA?ness, and the operational elements of system maintenance, safe operating practices and ongoing personnel training are necessary to support a continual improvement in facility safety.  These programs are all documented so that needed information about the safe handling of all chemicals present at the facility is continuously available to employees.   \n \n\n"
    }
  ]
}