{
  "FacilityID": 1000063917,
  "FacilityName": "Chevron Willbridge Terminal",
  "FacilityStr1": "5531 N.W. Doane Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Portland",
  "FacilityState": "OR",
  "FacilityZipCode": "97210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41051",
  "LEPC": "Multnomah Co. Emergency Mgmnt.",
  "FacilityLatDecDegs": "45.564630",
  "FacilityLongDecDegs": "-122.739930",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.chevron.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Chevron Corporation",
  "Company2Name": null,
  "CompanyDUNS": 127164945,
  "Company2DUNS": 0,
  "OperatorName": "Chevron USA Inc.",
  "OperatorStr1": "6001 Bollinger Canyon Rd.",
  "OperatorStr2": null,
  "OperatorCity": "San Ramon",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94583",
  "OperatorZipCodeExt": "2324",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000235836",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "26-2027",
  "SafetyInspectionDate": "2016-07-26 00:00:00",
  "SafetyInspectionBy": "PHMSA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-06-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-06-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "39.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000080160,
      "AltID": "Butane Storage",
      "FacilityID": 1000063917,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000099915,
          "ProcessID": 1000080160,
          "ChemicalID": 118,
          "Quantity": 400000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000081381,
          "ProcessID": 1000080160,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000067433,
              "Process_NAICS_ID": 1000081381,
              "SafetyReviewDate": "2017-05-16 00:00:00",
              "PHA_Date": "2017-04-20 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Fire/Heat Sensors and Remote Monitoring",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-06-05 00:00:00",
              "TrainingReviewDate": "2017-06-08 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-05-16 00:00:00",
              "EquipmentInspectionDate": "2017-05-02 00:00:00",
              "EquipmentTested": "Tank Yard, Tanks: 1, 3, 45, 47, 48, 51, 60, 62, 64, 75 89, 108 and 121. Various pump and pump houses",
              "ChangeMgmtDate": "2017-05-16 00:00:00",
              "ChangeMgmtReviewDate": "2017-05-16 00:00:00",
              "PreStartupReviewDate": "2017-05-26 00:00:00",
              "ComplianceAuditDate": "2016-08-02 00:00:00",
              "AuditCompletionDate": "2017-09-11 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-12-09 00:00:00",
              "HotWorkPermitReviewDate": "2014-09-01 00:00:00",
              "ContractorSafetyReviewDate": "2009-08-01 00:00:00",
              "ContractorSafetyEvalDate": "2017-05-05 00:00:00",
              "CBI_Flag": 0,
              "Description": "PROCESS SAFETY INFORMATION\n\nThe cornerstone of the PSM program is Process Safety Information.  Process Safety Information defines the chemical hazards, equipment, and technology in a given process.  The terminal maintains a variety of technical documents that are used to help maintain safe operation of the butane blending process. These documents address chemical properties and associated hazards, limits for key process parameters including specific chemical inventories, and equipment design basis and configuration information.  Specific individuals are assigned responsibility for maintaining up-to-date process safety information.  Chemical-specific information, including exposure hazards, emergency response and exposure treatment considerations, is provided in material safety data sheets (MSDSs).  The terminal has documented safety-related limits for specific process parameters and ensures that the process is maintained within these limits using process controls, instrumentation monitoring, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).  The terminal also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, etc.  This information, in combination with written procedures and trained personnel, provide a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\n\nPROCESS HAZARD ANALYSIS\n\nThe terminal has a comprehensive program to confirm that hazards associated with the various processes are identified and controlled.  Within this program, processes are systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.  The terminal primarily uses the hazard and operability (HAZOP) analysis technique to perform these evaluations.  HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques.  The analyses are conducted using a team of people who have operating and maintenance experience, as well as expertise in systems control technology and engineering.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\n\n\nThe PHA team findings are reviewed and assigned to individuals and work groups for resolution.  Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team.  This ranking helps ensure that potential accident scenarios assigned the highest risk receive priority attention.  All approved mitigation options being implemented in response to PHA team findings are tracked until they are complete.  The final resolution of each finding is documented and the documentation is retained.  To help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the terminal periodically updates and revalidates the hazard analysis results.  These reviews include not only the original study data, but they include process changes in the last five years that have been made through the MOC process and a review of incidents both in the unit and in other similar units throughout industry.  Periodic reviews are conducted at least every five years until the process is no longer operational.  The results and findings from these updates are to be documented and retained.  \n\n\n\nOPERATING PROCEDURES\n\nThe terminal maintains written procedures that address various modes of process operations, such as (1) process startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, and (5) normal shutdown.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are reviewed and certified annually as current and accurate.  The procedures are maintained current and accurate by revising them as necessary to reflect changes made through the MOC process.  \n\n\n\nTRAINING\n\nTo complement the written procedures for process operations, Chevron and the terminal have implemented a comprehensive training program for all employees involved in operating the butane blending process.  New employees receive basic training in process operations and, after successfully completing this training, are paired with a senior operator to learn process-specific duties and tasks.  Operators are allowed to work independently only after demonstrating, through tests and/or various skill demonstrations, that they possess adequate knowledge to perform the duties and tasks in a safe manner on their own.  In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  All of this training is documented for each operator, including the means used to verify that the operator understood the training.\n\n\n\nMECHANICAL INTEGRITY\n\nThe terminal has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process equipment.\n\n\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their job in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or an MOC team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.  Another integral part of the mechanical integrity program is quality assurance.  The terminal incorporates quality assurance measures into equipment purchases and repairs.  \n\n\n\nMANAGEMENT OF CHANGE\n\nThe terminal has a comprehensive system to manage changes to its processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary additional training on the change.\n\n\n\nPRE-STARTUP REVIEW\n\nThe terminal conducts a pre-startup safety review (PSSR) for any new process or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, such as, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR review team uses checklists to verify all aspects of process startup readiness.  A PSSR involves field verification of the construction and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\n\n\n\n\n\n\nCOMPLIANCE AUDITS\n\nTo verify accident prevention program is functioning properly, the terminal will periodically conduct a compliance audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every three (3) years or more often if facility changes require further review.  The audit team develops findings that are forwarded to terminal management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.  \n\n\n\nINCIDENT INVESTIGATIONS\n\nThe terminal promptly investigates all incidents that result in, or potentially could result in, a fire or explosion, major property damage, environmental release, or personal injury.  All incidents that result in, or could have resulted in, a catastrophic release of a highly hazardous chemical in the workplace must be investigated as promptly as possible, but not later than 48 hours following the incident.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation teams include personnel who are knowledgeable in the process involved in the incident, contract employees if work involved a contractor, and other employees with appropriate knowledge and experience to thoroughly investigate and analyze an incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to terminal management for resolution.  Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least five (5) years so that the reports can be reviewed during future PHAs and PHA revalidations. \n\n\n\nEMPLOYEE PARTICIPATION\n\nThe facility encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from compiling and updating technical documents and chemical information, to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information generated from the terminal accident prevention program.  Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the terminal and addresses each accident prevention program element.  In addition, the terminal has a number of initiatives that address process safety and employee safety issues.  These initiatives include forming committees to promote both process and personal safety.  The committees typically have members from various areas of the terminal, including operations, maintenance, engineering and terminal management. \n\n\n\nHOT WORK PERMITS\n\nThe terminal maintains a Work Permit Program to promote safe work practices for ensuring worker and process safety.  Permits are required before any spark-producing activities (hot work) can be conducted at the facility.  Furthermore, an additional permit is required before entry into a confined space is allowed to ensure that adequate precautions and evacuation measures are in place prior to confined space entry.  \n\n\n\n\n\nVarious other safe work practice policies and procedures are utilized to facilitate safe operations.  Examples of these include, but are not limited to, the following:\n\n?    Control of the entry, presence and exit of support personnel from the process unit;\n\n?    A lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance; and\n\n?    A procedure for safe removal of hazardous materials before process piping or equipment is opened.  \n\nThese and other procedures, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\n\n\nCONTRACTORS\n\nThe terminal utilizes contractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the terminal has procedures in place to ensure that contractors:\n\n\n\n(1)    Perform their work in a safe manner;\n\n(2)    Have the appropriate knowledge and skills to execute their assigned task;\n\n(3)    Are aware of the hazards in their workplace;\n\n(4)    Understand what they should do in the event of an emergency;\n\n(5)    Understand and follow site safety rules; and\n\n(6)    Inform terminal management of any hazards that they find during their work.\n\n\n\nThis is accomplished by providing contractors with each of the following:\n\n\n\n(1)    A process overview;\n\n(2)    Information about safety and health hazards;\n\n(3)    Emergency response plan requirements; and\n\n(4)    Training on safe work practices prior to beginning work.\n\n\n\nTo ensure a safe work environment, the terminal evaluates contractor safety programs and performance during contractor selection.  Additionally, terminal personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\n\n\nEMERGENCY RESPONSE \n\nThe terminal maintains a written Emergency Response Plan (ERP), which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements.  In addition, the terminal has developed procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The ERP is updated when necessary based on modifications made to terminal processes or operations.  The emergency response program changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes.\n\nThe overall emergency response program for the terminal is coordinated with the local fire department and the Local Emergency Planning Committee (LEPC). This coordination includes periodic meetings of the committee, which are attended by local emergency response officials, local government officials, and industry representatives.  The terminal has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, the terminal conducts periodic emergency drills that involve the LEPC and emergency response organizations, and the terminal provides annual refresher training to local emergency responders regarding the hazards of regulated substances at the terminal.\n\n\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000083559,
                  "PreventionProgram3ID": 1000067433,
                  "ProcessChemicalID": 1000099915
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000063917,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2017-05-16 00:00:00",
    "ERTrainingDate": "2017-04-18 00:00:00",
    "CoordinatingAgencyName": "Oregon Department of Env. Quality",
    "CoordinatingAgencyPhone": "5032295370",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063917,
      "SummaryText": "Chevron Downstream & Chemicals - Willbridge Americas Products Terminal\n\nRisk Management Plan - Executive Summary\n\n\n\nThe Chevron Downstream & Chemicals (DS&C) - Willbridge Americas Products Terminal is located at 5531 Northwest Doane Avenue; Portland, Oregon 97210.  The facility seeks to implement a butane blending process and plans to install a single 90,000-gallon pressurized horizontal bullet butane storage vessel.   The facility already has existing pipeline, truck transfer and storage areas. \n\n\n\nThe butane blending process at the terminal will consist of injecting butane into its gasoline immediately prior to truck loading of various gasoline products.  The terminal will receive butane via tanker trucks and will store the butane in the 90,000-gallon pressurized horizontal butane storage vessel.  The butane blending operation and associated butane storage render the terminal subject to 40 CFR 68 requirements.  Moreover, this operation renders the terminal subject to the United States Occupational Safety and Health Administration (OSHA) -  Process Safety Management (PSM) of Highly Hazardous Chemicals, codified in 29 CFR  ?1910.119.  The facility also stores additional flammable substances in pressurized vessels which are covered under the OSHA PSM standard.   Furthermore, the terminal is subject to RMP Prevention Program Level 3 requirements. \n\n\n\nBoth Chevron and the terminal have a long-standing commitment to both worker and public safety, which is demonstrated by efforts set forth in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substance.  However, if a release does occur, trained personnel will evaluate the situation, take actions within the capabilities of the facility and/or notify the necessary outside agencies.  \n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nChevro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063917,
      "SummaryText": "n views the health and safety of its employees and the communities in which it operates as its top priority. On a global scale, Chevron has implemented its Operational Excellence (OE) process that establishes the standards by which all Chevron business units must operate.  Guided by the Chevron OE process, the terminal has implemented a robust OSHA PSM program to protect its people, the local community, and the integrity of process equipment. Refer to Section 7 of this RMP submission for a detailed discussion of the\n\nterminal's OSHA PSM program.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe butane blending process is a new covered process at the facility and there have been no RMP related accidents at the facility that meet the five-year accident history criteria.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe terminal maintains a written Emergency Response Plan (ERP), which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and\n\ndecontamination requirements. In addition, the terminal has developed procedures that address\n\nmaintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The ERP is updated when necessary based on modifications made to terminal processes or operations.  The emergency response program changes are administered through the MOC process, which inclu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063917,
      "SummaryText": "des informing and/or training affected personnel in the changes.  The overall emergency response program for the terminal is coordinated with the local fire department and the Local Emergency Planning Committee (LEPC).  This coordination includes periodic meetings of the\n\ncommittee, which are attended by local emergency response officials, local government officials, and industry representatives.  The terminal has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, the terminal conducts periodic emergency drills that involve the LEPC and emergency response organizations, and the terminal provides annual refresher training to local emergency responders regarding the hazards of regulated substances at the terminal.\n\n"
    }
  ]
}