{
  "FacilityID": 1000019801,
  "FacilityName": "Prometheus Cuervo",
  "FacilityStr1": "6300 Webb Road",
  "FacilityStr2": null,
  "FacilityCity": "Cuervo",
  "FacilityState": "NM",
  "FacilityZipCode": "88417",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35019",
  "LEPC": "Guadalupe LEPC",
  "FacilityLatDecDegs": "35.128162",
  "FacilityLongDecDegs": "-104.490956",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.prometheusenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Prometheus Energy Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 828776612,
  "Company2DUNS": 0,
  "OperatorName": "Prometheus Energy Group, Inc",
  "OperatorStr1": "8511 154th AVE NE",
  "OperatorStr2": null,
  "OperatorCity": "Redmond",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98052",
  "OperatorZipCodeExt": null,
  "RMPContact": "Swati Shastri",
  "RMPTitle": "HSSE Engineer",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000213681",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "NM GCP-4 # 4203",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-01-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-01-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-01-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-01-11 00:00:00",
  "DeRegistrationEffectiveDate": "2011-12-01 00:00:00",
  "AnniversaryDate": "2016-01-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000024182,
      "AltID": null,
      "FacilityID": 1000019801,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000024537,
          "ProcessID": 1000024182,
          "NAICSCode": "42499",
          "_desc": {
            "NAICS_CODE": "42499",
            "NAICS_DESCRIPTION": "Other Miscellaneous Nondurable Goods Merchant Wholesalers"
          }
        },
        {
          "Process_NAICS_ID": 1000024538,
          "ProcessID": 1000024182,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        },
        {
          "Process_NAICS_ID": 1000024539,
          "ProcessID": 1000024182,
          "NAICSCode": "32799",
          "_desc": {
            "NAICS_CODE": "32799",
            "NAICS_DESCRIPTION": "All Other Nonmetallic Mineral Product Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000024623,
          "ProcessID": 1000024182,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000028682,
          "ProcessID": 1000024182,
          "ChemicalID": 93,
          "Quantity": 47250.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000528682,
          "ProcessID": 1000024182,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000019801,
      "SummaryText": "Cuervo LNG Facility Executive Summary\n\nPrometheus Energy Group, Inc (PEG) has prepared this Risk Management Plan to comply with federal Risk Management Program regulations contained in 40 CFR Part 68.\n\nPEG is committed to operating in a manner that is safe for PEG employees, the public, and the environment.  As part of this commitment, PEG has established a system to help ensure safe operation of the processes at its facility in Cuervo, New Mexico. \n\nOne component of this system is a risk management program (RMP) that helps manage the risks at the Cuervo LNG Facility and complies with the requirements of the Environmental Protection Agency's (EPAs) regulation 40 CFR Part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at PEG's Cuervo LNG Facility.  This document is intended to satisfy the RMPlan requirement of the RMP rule and to provide the public with a description of our risk management program.\n\nThe risk management program at the Cuervo LNG Facility consists of three elements:\n\n1.    A hazard assessment to help understand the potential offsite consequences of hypothetical accidental releases and accidents that are more likely to occur at the facility.\n\n2.    A prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance, in our case, Methane.\n\n3.    An emergency response program to help respond to accidental releases of regulated substances from covered processes.\n\nInformation further describing these elements is provided in this RMPlan.\n\nAccidental Release Prevention and Emergency Response Policies\n\nPEG is committed to the safety of employees and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous substances.  The Cuervo LNG Facility implements reasonable controls to prevent"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000019801,
      "SummaryText": " foreseeable releases of hazardous substances.  These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of processes in the LNG facility; and programs to continuously evaluate the hazards at the Cuervo LNG processing facility.\n\nIn the event of an accidental release, PEG controls and contains the release in a manner that will be safe for employees and will help prevent injury to the public or the environment.  Although the local fire department, the Santa Rosa Fire Department, is the designated first responder to the Cuervo LNG Facility, PEG provides response training to its employees, designates an emergency response coordinator to oversee response activities until the fire department takes over, and coordinates response efforts with the local fire department.  The Santa Rosa Fire Department is staffed with certified (volunteers) firemen capable of responding 24 hours per day.  \n\nIn order to effectively implement these policies, PEG has established a management system headed by the Operations Manager to oversee RMP-related activities.\n\nFacility Information and Regulated Substances\nPEG operates a gas to liquid natural gas processing facility that employs approximately 4 full-time workers.  The gas processing produces approximately 10,000 gallons per day of liquefied natural gas (LNG).  The LNG produced at the facility consists of about 98% methane and is stored in a above ground storage tank with a capacity to hold 14,800 gallons.  However, administrative and engineering controls maintain that the maximum amount of LNG in the storage tank at any point is 13,320 gallons.  The LNG from the storage tank is transported off site in tanker trucks that fill up at the LNG Truck Loading station. According to 40 CFR 68, facilities with acutely hazardous materials or flammable materials over the regulatory threshold in a single process are required to prepare a Risk Management Plan (RMP).\n\nTh"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000019801,
      "SummaryText": "e RMP-covered process at the Cuervo LNG Facility is the LNG Storage and Truck Loading process.  The LNG storage tank stores up to but no more than 13,320 gallons of LNG, which equates to approximately 46,620 pounds of methane, a flammable material.  The regulatory threshold for methane is 10,000 pounds.  The LNG Storage and Truck Loading process is a Program Level 3 process.\n\nAccidental Release Prevention Program and Chemical-specific Prevention Steps\n\nAccidental Release Prevention Program\nThe Cuervo LNG Facility complies with both the Federal and State Chemical Accident Prevention Program provisions as well as OSHA's Process Safety Management regulations and as such, has developed procedures and policies that address the following:\n\nA?    Maintaining process safety information to document physical properties of hazardous substances handled at the gas processing facility and the design basis and safe operating parameters for equipment at the facility.\n\nA?    Performing process hazard analyses to help identify potential process hazards and to generate recommendations and action plans to improve safe operations.\n\nA?    Defining safe operating procedures.\n\nA?    Training of workers to safely and effectively perform assigned tasks.\n\nA?    Inspecting and testing to assess equipment mechanical integrity.\n\nA?    Managing change to ensure that change does not negatively affect safe operations.\n\nA?    Performing pre-startup safety reviews of new or modified processes.\n\nA?    Conducting compliance audits to be certain that safety programs are effectively addressing safety issues.\n\nA?    Investigating incidents so that similar accidents can be prevented.\n\nA?    Employee participation to help ensure that safety concerns of employees are addressed.\n\nA?    Using hot work permits to control spark or flame producing activities that could result in fires or explosions.\n\nA?    Using other safe work permits such as Lockout/Tagout and confined space entry permits.\n\nA?    Managing contractor activities to ensure their work i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000019801,
      "SummaryText": "s performed in a safe manner.\n\n\nChemical-specific Prevention Steps\nIn addition to the required prevention program elements, PEG has implemented safety features specific to the hazardous substance at the Cuervo LNG Processing Facility. The facility was designed to include several risk mitigation items which include: \n\nA?    combustible gas and fire detectors strategically placed throughout the facility;\nA?    alarms for temperature, pressure, and flow; \nA?    high-high and low-low interlocks that shut down equipment and isolate gas flow; \nA?    a dike around the storage tank; \nA?    fail-safe valves upon loss of power or air; and\nA?    emergency shut down  and isolation valves.\n\n\nFive-Year Accident History\nPEG Cuervo LNG Facility is a brand new facility, and therefore, does not have any accidents to report.\n\nEmergency Response Program\nPEG has coordinated emergency response procedures with the Santa Rosa Fire Department and also developed a written emergency action plan to help safely respond to a wide range of incidents including the accidental release of hazardous materials.  The emergency action plan includes procedures for:\n\nA?    Informing the Santa Rosa Fire Department and the public about accidental releases that could reasonably result in off-site consequences.\nA?    Providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances.\nA?    Controlling and containing accidental releases of hazardous substances.\n\nPlanned Changes to Improve Safety\nPEG constantly strives to improve the safety of their process at the Cuervo LNG Processing Facility through both the incident investigation program and a program soliciting safety suggestions from everyone involved in operating the process.\n"
    }
  ]
}