{
  "FacilityID": 1000055802,
  "FacilityName": "Dolco Packaging",
  "FacilityStr1": "201 Industrial Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Branchburg",
  "FacilityState": "NJ",
  "FacilityZipCode": "08876",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34035",
  "LEPC": "Branchburg Twp LEPC",
  "FacilityLatDecDegs": "40.602222",
  "FacilityLongDecDegs": "-074.717222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Tekni-Plex, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tekni-Plex, Inc.",
  "OperatorStr1": "460 E. Swedesford Road",
  "OperatorStr2": "Suite 3000",
  "OperatorCity": "Wayne",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19087",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Kratins",
  "RMPTitle": "Plant Manager",
  "FTE": 110,
  "OtherEPAFacilityID": "NJD055932461",
  "EPAFacilityID": "100000054086",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "35873",
  "SafetyInspectionDate": "2012-10-12 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-02-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-02-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-02-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-03-08 00:00:00",
  "DeRegistrationEffectiveDate": "2019-04-22 00:00:00",
  "AnniversaryDate": "2021-02-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.60133,
  "FRS_Long": -74.71646,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000069732,
      "AltID": "Blowing Agent System",
      "FacilityID": 1000055802,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000070914,
          "ProcessID": 1000069732,
          "NAICSCode": "32614",
          "_desc": {
            "NAICS_CODE": "32614",
            "NAICS_DESCRIPTION": "Polystyrene Foam Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000086039,
          "ProcessID": 1000069732,
          "ChemicalID": 111,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 111,
            "ChemicalName": "Difluoroethane  [Ethane, 1,1-difluoro-]",
            "CASNumber": "75-37-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000586039,
          "ProcessID": 1000069732,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000055802,
      "SummaryText": "Background\n\n\n\nThe Tekni-Plex facility in Branchburg, New Jersey produces extruded polystyrene foam products using difluoroethane as the blowing agent.  The facility consists of manufacturing areas, storage warehouses and offices, with a difluoroethane storage tank located outside of the building.  The facility operates as much as 24 hours per day, 365 days per year and employs approximately 130 people.  Our foam products are used as food packaging trays and the like.\n\n\n\nProcess Description\n\n\n\nDifluoroethane is the only material at the facility subject to the United States Environmental Protection Agency's (USEPA) Risk Management Plan (RMP) program.  Difluoroethane is received by Tekni-Plex as a liquid in tank trucks and is unloaded into a storage tank located outside.  The maximum difluoroethane storage quantity is 85% of the tank design capacity to allow room for emergency expansion under emergency situations.  Difluoroethane is pumped through a controlled system into the foam production building.  The difluoroethane is then used to expand melted plastic within extruders to create the desired foam product.  A number of valves, controllers and instruments control and monitor the pressure and flow of difluoroethane throughout the process.\n\n\n\nThe primary hazard associated with the difluoroethane system are releases that could occur outside or inside the extrusion building that could lead to a fire or explosion.  The possible causes of releases include pump failure, failure of piping or tubing, failure of valves or instuments, storage tank leakage or failure of equipment used for tank filling.\n\n\n\nFive Year Accident History\n\n\n\nThe facility has had no accidental releases of difluoroethane in the past five years.\n\n\n\nProgram Level Description\n\n\n\nThe worst-case results categorize this process as a USEPA Program 1 facility, however the facility has filed as a Program 3 facility with the New Jersey Department of Environmental Protection (NJDEP), as required.  NJDEP requires P"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000055802,
      "SummaryText": "rogram 3 submission because the facility is subject to the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standard.\n\n\n\nRelease Prevention Program\n\n\n\nTekni-Plex's Plant Manager has the overall responsibility for ensuring that the facility operates in a safe and reliable manner.  This responsibility includes overseeing the implementation of the RMP.  Tekni-Plex has invested significant manpower and resources to prepare and implement this RMP and the related PSM program to address the potential hazards associated with difluoroethane at the facility.  The facility's RMP/PSM program contains a prevention program that focuses on prevention of releases.  The prevention program includes the use of appropriate equipment design standards, safety valves and instruments, written operating procedures, employee and contractor training, regular equpiment inspection and maintenance and periodic program auditing to reduce the likelihood of difluoroethane releases occurring.  The facility has compiled process safety information and has conducted process hazard analysis (PHA) reviews of the difluoroethane system.  The difluoroethane storage tank was designed and constructed in accordance with the ASME code for pressure vessels.  The difluoroethane system was designed and constructed in accordance with the applicable portions of the NFPA 58 LP-Gas Code and is equipped with a variety of modern safety equipment.\n\n\n\nThis facility has implemented administrative controls and procedures to aid in the prevention of releases from the operation of the difluoroethane system.  Personnel operating and maintaining the difluoroethane system undergo regular training.  The training program includes initial training as well as periodic refresher training and training updates when major process or equipment changes are made.  Written operating procedures are used to standardize the procedures for startup, normal operation, normal shutdown and emergency shutdown.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000055802,
      "SummaryText": "Tank loading is conducted by contract truck drivers certified to handle LP-gases and monitored by trained Tekni-Plex personnel.  The facility conducts regular planned inspection and preventative maintenance of the difluoroethane system equipment.\n\n\n\nRelease Detection and Emergency Response\n\n\n\nThe plant has flammable detectors located throughout the facility.  The detectors are designed to warn an operator of a potential difluoroethane release and automatically shut down the process under certain conditions.  Automatic sprinkler systems are located throughout the building areas where difluoroethane is present and at the difluoroethane storage tank.  The facility has an emergency action plan that addresses emergency response procedures in the event of a tank leak, fire or explosion.  According to the emergency action plan, Tekni-Plex personnel are required to contact the North Branch Volunteer Fire Company or an outside emergency response contractor in the event of any emergency.  The facility has coordinated with the North Branch Volunteer Fire Company and outside emergency response contractor with regard to emergency response on the difluoroethane system.  \n\n\n\nAdditional Steps to Improve Safety\n\n\n\nTekni-Plex has created a culture of continuous improvement of it's safety systems and programs.  We have trained our employees to safely perform their assigned tasks.  We also encourage our employees to suggest changes or improvements that will help to increase the safety of the facility.  We perform inspections and preventative maintenance to minimize the potential for unanticipated failure of our equipment.  Our safety systems and programs are audited, typically by an outside company, at least once per year to evaluate their effectiveness.  In addition, we regularly review and modify, as necessary, elements of our Prevention Program."
    }
  ]
}