{
  "FacilityID": 1000103846,
  "FacilityName": "Sam Brown Sales, LLC - Farmington Plant",
  "FacilityStr1": "33106 W. 8 Mile Rd",
  "FacilityStr2": null,
  "FacilityCity": "Farmington",
  "FacilityState": "MI",
  "FacilityZipCode": "48336",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26125",
  "LEPC": "Oakland County LEPC",
  "FacilityLatDecDegs": "42.441490",
  "FacilityLongDecDegs": "-83.373568",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Sam Brown Sales, LLC",
  "OperatorStr1": "33106 W 8 Mile Road",
  "OperatorStr2": null,
  "OperatorCity": "Farmington",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48336",
  "OperatorZipCodeExt": null,
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000236568",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-10-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-01-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-01-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-01-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-01-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 42.44062,
  "FRS_Long": -83.37351,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000129282,
      "AltID": "Warehousing Of Aerosols",
      "FacilityID": 1000103846,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000162453,
          "ProcessID": 1000129282,
          "ChemicalID": 118,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000162074,
          "ProcessID": 1000129282,
          "ChemicalID": 107,
          "Quantity": 93635.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000162075,
          "ProcessID": 1000129282,
          "ChemicalID": 98,
          "Quantity": 93635.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000162076,
          "ProcessID": 1000129282,
          "ChemicalID": 92,
          "Quantity": 10511.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000130680,
          "ProcessID": 1000129282,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000103846,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-12-28 00:00:00",
    "ERTrainingDate": "2023-01-23 00:00:00",
    "CoordinatingAgencyName": "City Of Farmington Fire Department",
    "CoordinatingAgencyPhone": "2484744700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000103846,
      "SummaryText": "y responders  with the Oakland LEPC to respond to incidents of a larger scale. \n \nThe site continually reviews and, if necessary, improves the safety programs and systems at the facility."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000103846,
      "SummaryText": "vention are operational.  \n \nThe worst-case release scenario was determined by EPA to be a vapor cloud explosion. This scenario assumes that the total quantity of the flammable substance in the site's largest storage vessel (an aerosol container) is released into a vapor cloud, which then explodes.  The endpoint for the impact zone was determined by EPA to be an overpressure level of 1 pound per square inch (psi) from the explosion of the vapor cloud. The results were modeled using an EPA model, RMP*Comp. \n \nThe modeling for the warehouse assumed a release from the largest aerosol container has 300 grams of a flammable mixture (i.e., propellant). This resulted in an endpoint of 0.008 miles (37 feet). Please note that this distance is reported as 0.01 miles in the submittal due to software limitations.  This would not have an off-site impact. These results are very conservative.  EPA's own guidance indicates that EPA considers not only the release of the total quantity of a flammable substance in a vessel into a vapor cloud to be highly unlikely, but also the explosion of a vapor cloud to be an unlikely event.  Further, the guidance states that the endpoint of 1 pound per square inch is intended to be conservative and protective, and does not define a level at which severe injuries of death would be commonly expected. \n \nThere has not been an accident or incident that has met the RMP criteria involving propane, isobutane, or di-methyl ether at the facility during the last five years.  Criteria for RMP reporting are accidents that have resulted in death, injury, significant property damage, evacuation, sheltering in place, or environmental damage.  The warehouse has never had a release that caused off-site injury in its entire history.  \n \nThe warehouse maintains trained responders to handle a variety of emergencies at the site including incipient fires and chemical spills. The site has also made arrangement for assistance from the local fire department and emergenc"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000103846,
      "SummaryText": "Enclosed is The HiTech Industries Risk Management Plan (RMP) submittal for the Farmington, MI Warehouse facility. \n \nIt is the policy of The HiTech Company to conduct its business operation in such a manner as to protect the safety and health of our employees, our customers, the public and the environment. \n \nThe safety and health of employees, customers, the public and the environment is of the highest priority to HiTech Industries.  We will implement programs which help to protect employees, customers, the public and the environment.  We will comply with applicable laws and regulations and implement programs to help ensure compliance. \n \nWe will review all present and planned facilities, processes and products to ensure conformance with the applicable laws and regulations.  We will manufacture products that can be used, handled, stored, distributed and disposed safely with common safety practices and Hi-Tech's safety and health information. \n \nThe facility is a distribution warehouse for aerosol products.  The products may include paint, dye, cleaners, and air fresheners. Propane, isobutane and di-methyl ether (i.e., propellants) are the RMP substances used in the packaging of aerosols.  When the propellants in each aerosol container are added together, the amount stored on-site is in excess of the threshold quantity.  There are no listed toxic substances handled at this site in excess of the threshold quantity. \n \nThe worst case scenario is a hypothetical release of any of the hazardous materials listed under RMP rule as determined by the USEPA. The EPA mandates that companies presume the release of the entire quantity of the substance.  Only passive safety controls, such as those controls in place that do not require action by an employee to initiate, can be considered.  An example of a passive safety control is storage of a limited quantity. The worst case scenario presumes none of the site's mechanical controls or safety systems requiring energy or human inter"
    }
  ]
}