{
  "FacilityID": 1000026358,
  "FacilityName": "Crown Water Treatment Plant",
  "FacilityStr1": "955 Clague Road",
  "FacilityStr2": null,
  "FacilityCity": "Westlake",
  "FacilityState": "OH",
  "FacilityZipCode": "44145",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39035",
  "LEPC": "Cuyahoga County LEPC",
  "FacilityLatDecDegs": "41.474092",
  "FacilityLongDecDegs": "-081.880281",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.clevelandwater.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Cleveland Division of Water",
  "Company2Name": null,
  "CompanyDUNS": 118142876,
  "Company2DUNS": 0,
  "OperatorName": "Cleveland Division of Water",
  "OperatorStr1": "1201 Lakeside Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Cleveland",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44114",
  "OperatorZipCodeExt": null,
  "RMPContact": "Frank J. Petrik",
  "RMPTitle": "Regulatory Compliance Manager",
  "FTE": 41,
  "OtherEPAFacilityID": "OHD986966844",
  "EPAFacilityID": "100000030502",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-09-13 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Water Treatment Plant",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-06-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-05-25 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-05-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-08-19 00:00:00",
  "DeRegistrationEffectiveDate": "2013-06-18 00:00:00",
  "AnniversaryDate": "2017-05-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 41.47234,
  "FRS_Long": -81.88222,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000032266,
      "AltID": "Chlorination System",
      "FacilityID": 1000026358,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000032548,
          "ProcessID": 1000032266,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000039271,
          "ProcessID": 1000032266,
          "ChemicalID": 62,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000539271,
          "ProcessID": 1000032266,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000026358,
      "SummaryText": "CLEVELAND DIVISION OF WATER\n\nCROWN WATER TREATMENT PLANT\n\n2012 RMP EXECUTIVE SUMMARY\n\n\n\n\n\nAccidental Release Prevention and Emergency Response Policies At CWD Facilities\n\n\n\nThe Cleveland Division of Water (CWD) is a municipal water utility that provides for approximately 1.5 million people throughout the greater Cleveland area, producing an average of 240 million gallons per day of high-quality, safe drinking water.  CWD's senior management and their employees undertake a daily mission to provide a reliable supply of high-quality, safe drinking water and efficient cost-effective services consistent with sound environmental and safety practices.  In order to do so, chlorine an extremely hazardous chemical, is used daily at Crown to disinfect the drinking water.  However, through training and standard operating procedures the employees of CWD demonstrate extreme conscientiousness in handling the chlorine.  They are dedicated to preventing accidents, and if necessary, responding to accidental chlorine releases.  In addition, Chlorine has been eliminated at all other plants by CWD and will be eliminated at Crown in 2012 and replaced with sodium hypochlorite which is much safer.\n\n\n\nThe Facility & The Regulated Substance Handled\n\n\n\nThe Crown Water Treatment Plant is one of four CWD water treatment plants and produces approximately 18.5 billion gallons of drinking water each year.  Approximately 500 - 1,000 pounds of chlorine is used each day at the plant as a part of the treatment process.  Chlorine is supplied to the water plant as a toxic gas, liquefied under pressure in one-ton steel containers.  The facility can currently store a maximum of 30 one-ton containers, approximately 60,000 pounds on-site at any one time. To reduce accidental releases, no more than 20,000 pounds is shipped at any one time. \n\n\n\nBoth the Environmental Protection Agency (EPA) and the Occupational Safety and Health Administration (OSHA) lists chlorine as an extremely hazardous chemical, as expos"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000026358,
      "SummaryText": "ure to chlorine can result in serious health effects.  The primary health concern from exposure to chlorine is its toxic effect when inhaled.  At the Crown facility, the chlorination system is a closed system that converts the liquid chlorine into chlorine gas and then injects the gas into water to form chlorine solution.  The chlorine solution can then be added into raw water before it enters the water treatment process.\n\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n\n\nCWD has long understood the hazards of handling chlorine, which if not handled properly, can pose a risk to employees, the environment, and the surrounding community. With the inception of OSHA Process Safety requirements, CWD has worked hard at building what we call a \"Layers of Protection\" approach to safety.  CWD has developed and implemented detailed SOPs for the safe operation of the chlorination system, a comprehensive maintenance program for inspecting, testing, repairing, and replacing chlorine equipment including detection systems, alarms, scrubber system, and emergency equipment.  Additional practices and policies include personnel protection equipment (PPE), employee training, incident reporting and investigation procedures, safe work practices such as hot work permits and lockout/tagout, and a visitor policy to control access to the plant especially to areas where chlorine is stored and/or used.  These programs are in place to reduce the likelihood of an accidental chlorine release. \n\n\n\nIn addition to CWD's well-maintained chlorine equipment and well-trained employees, CWD's management is committed to minimizing the potential for accidental chlorine releases and minimizing the effects of a release if one were to occur.  CWD routinely re-evaluates and updates it's policies, programs, and procedures to ensure that we are providing the safest environment possible for our employees, the community, and the environment. \n\n\n\nFive-Year Accident History\n\n\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000026358,
      "SummaryText": "\nThe Crown Water Treatment Plant has used chlorine to disinfect drinking water for more than 40 years.  In the last five years, the Crown facility did not have an RMP reportable accidental release.  \n\n\n\nEmergency Response Program\n\n\n\nThe Crown Water Treatment Plant has a chlorine-specific Emergency Response Plan which identifies procedures for recognizing emergencies, securing incident areas, and responding to releases and leaks, and emergency evacuation procedures, routes, and safe assembly points.  There are also procedures for accounting for all personnel following an evacuation, emergency first aid for exposure to chlorine, notifying local emergency response agencies and the public, and the duties and responsibilities of facility personnel currently assigned as members of the emergency response team and the chlorine crew.\n\n\n\nAll of the water treatment plant operators are properly trained to respond to and mitigate chlorine incidents that might potentially occur at the plant.  They are trained in hazardous operations response and in the use of Chlorine Institute Emergency B-Kits for one-ton containers.  In addition, the facility is staffed with operators 24 hours a day.  CWD also has a specialized chlorine crew that handles all chlorine equipment maintenance.\n\n\n\nCWD coordinates its Emergency Response Plan with the Westshore Hazardous Materials (HAZMAT) Team and the Cuyahoga County Local Emergency Planning Commission (LEPC).  In conjunction with the establishment of an RMP Program, CWD has established a program to conduct annual chlorine drills and invited Westshore HAZMAT in preparation of a potential response to an accidental release.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nCWD is always looking for ways to reduce employee and community risk and improve safety. This year, the plant will convert from chlorine to sodium hypochlorite for disinfection of the drinking water.  In the interim, CWD will increase the number of hours of safety training and emergency drills"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000026358,
      "SummaryText": " to ensure that all personnel are competent and secure with standard and emergency operation procedures."
    }
  ]
}