{
  "FacilityID": 1000077736,
  "FacilityName": "Hershall B. Norred Water Treatment Plant",
  "FacilityStr1": "251 Water Works Road",
  "FacilityStr2": null,
  "FacilityCity": "Newnan",
  "FacilityState": "GA",
  "FacilityZipCode": "30263",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13077",
  "LEPC": "Coweta County",
  "FacilityLatDecDegs": "33.351306",
  "FacilityLongDecDegs": "-084.803639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.newnanutilities.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 132287483,
  "ParentCompanyName": "Newnan Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dennis McEntire",
  "OperatorStr1": "P.O. Box 578",
  "OperatorStr2": null,
  "OperatorCity": "Newnan",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30264",
  "OperatorZipCodeExt": null,
  "RMPContact": "George Lee",
  "RMPTitle": "Water Plant and Control Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000089986",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-07-24 00:00:00",
  "SafetyInspectionBy": "Water Treatment and Controls",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-04-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.35606,
  "FRS_Long": -84.8135,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000096841,
      "AltID": "Potable Water Treatment",
      "FacilityID": 1000077736,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000098060,
          "ProcessID": 1000096841,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000121196,
          "ProcessID": 1000096841,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000621196,
          "ProcessID": 1000096841,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077736,
      "SummaryText": "INTRODUCTION\n\nEXECUTIVE SUMMARY\n\nThe Federal Register/Vol.61, No. 120/Thursday, June 20, 1996 amended 40 CFR Part 68 to include the U.S. Environmental Protection Agency's (USEPA) Risk Management Program.  This program requires facilities that have a regulated substance above the listed threshold quantities to develop a formal Risk Management Program (RMProgram) and to register and submit a Risk Management Plan (RMPlan).  The City of Newnan is subject to this regulation as the owner and operator of the Hershall B. Norred Water Treatment Plant located at 251 Water Works Road, Newnan, (Coweta County), Georgia.  \n\nA RMProgram has been developed to meet the intent of the regulation for this facility using Program 2.  According to the EPA, Program 2 is considered a default program level because any covered process that is not eligible for Program 1 or assigned to Program 3 is, by default, subject to Program 2 requirements, including a streamlined accident prevention program.  Program 1 facilities include processes which would not affect the public in the case of a worst-case release.  Program 3 facilities includes processes which are not eligible for Program 1 and either subject to OSHA's PSM standard under federal or state OSHA programs or classified in one of ten specific industrial classifications (these include higher-risk, complex chemical processing and petroleum refining operations and not a water treatment plant).  However, the state of Georgia does not have a delegated OSHA program.  Federal OSHA cannot impose its rules on state or local governments.  State and local governments in non-state-plan states are not subject to any OSHA rules and must comply with Program 2.  Information from the Federal Register, AWWA's Compliance Guidance and Model Risk Management Program for Water Treatment Plants, and EPA's Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68) were used as resources for the development of this program. \n\nOVERVIEW OF EPA R"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077736,
      "SummaryText": "ISK MANAGEMENT REGULATIONS\n\nThe EPA Risk Management Program regulations are intended to prevent and minimize the impacts of accidental releases of extremely hazardous substances. These regulations are applicable to the Hershall B. Norred Water Treatment Plant because chlorine stored at the facility is in excess of the EPA RMP threshold amount of 2,500 pounds.\n\nThe Hershall B. Norred Water Treatment Plant RMProgram complies with the intent of the EPA regulations by providing information to the utility employees, local emergency preparedness officials, and the affected public to minimize health and safety impacts.  The program consists of:\n\na.    A management plan.\n\nb.    A hazard assessment.\n\nc.    A prevention program (Program 2).\n\nd.    An emergency response plan.\n\ne.    RMPlan submittal to EPA.\n\nGOALS AND OBJECTIVES\n\nThe mission of the Hershall B. Norred Water Treatment Plant is to maintain public health by providing an adequate supply of safe drinking water, free of disease producing organisms and other health related contaminants.  This process involves the addition of certain chemicals that, if released in an uncontrolled manner, may present a risk to public health.  According to the EPA website (www.epa.gov/enforcement/national-compliance-initiative-reducing-accidental-releases-industrial-and-chemical ), thousands of facilities nationwide make, use, and store extremely hazardous substances.  These same facilities (historically 150 each year) incur catastrophic accidents that result in fatalities and serious injuries, evacuations, and harm to human health and environment.  The Risk Management Program has been created to protect the facility and the surrounding community against a catastrophic accident from occurring.  \n\nState-of-the-art methods for reducing risks associated with utilizing highly mobile toxic chemicals, such as chlorine, have evolved in recent years.  The newer risk management techniques consist of a comprehensive management system designed to promote responsi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077736,
      "SummaryText": "ble and disciplined operation, maintenance, and emergency response.\n\nThe overall goal in developing and maintaining the Hershall B. Norred Water Treatment Plant RMProgram is to reduce the risk to employees and the public of injury or death from the accidental release of chlorine liquid or gas.  The RMProgram is not a substitute for other conventional health and safety programs.\n\nThis document will require periodic updates and modifications.  Changes in key personnel, chlorine vendors, and modifications to the treatment process are among the items that require Plan modifications.  Specific items and their respective timetables for Plan modification are included herein.  \n\nSeveral elements of the Risk Management Program directly or indirectly reference plans and procedures contained within other pre-existing documents (i.e., O&M manuals, general safety guidelines, etc.).  This document provides a system for incorporating those items performed under separate unrelated plans into the Program.  Documentation of work completed under other programs and procedures is required in order to remain in compliance with the RMP regulations. \n\nA thorough review of the Plan is required annually for proper implementation.  \n\n"
    }
  ]
}