{
  "FacilityID": 1000075832,
  "FacilityName": "Antioch Water Treatment Plant",
  "FacilityStr1": "401 Putnam Street",
  "FacilityStr2": "P.O. Box 5007",
  "FacilityCity": "Antioch",
  "FacilityState": "CA",
  "FacilityZipCode": "94531",
  "Facility4DigitZipExt": "5007",
  "FacilityCountyFIPS": "06013",
  "LEPC": null,
  "FacilityLatDecDegs": "37.993833",
  "FacilityLongDecDegs": "-121.807778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.ci.antioch.ca.us",
  "FacilityEmailAddress": "pdreher@ciantioch.ca.us",
  "FacilityDUNS": 556905453,
  "ParentCompanyName": "City of Antioch",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Antioch",
  "OperatorStr1": "401 Putnam Street",
  "OperatorStr2": "P.O. Box 5007",
  "OperatorCity": "Antioch",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94531",
  "OperatorZipCodeExt": "5007",
  "RMPContact": "Tim Coley",
  "RMPTitle": "Water Treatment Superintendent",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000061728",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-08-22 00:00:00",
  "SafetyInspectionBy": "Contra Costa County Health Services",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-03-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-03-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-11-25 00:00:00",
  "DeRegistrationEffectiveDate": "2020-10-20 00:00:00",
  "AnniversaryDate": "2024-03-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.99375,
  "FRS_Long": -121.81031,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000094397,
      "AltID": "chlorine",
      "FacilityID": 1000075832,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000095659,
          "ProcessID": 1000094397,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000118147,
          "ProcessID": 1000094397,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000618147,
          "ProcessID": 1000094397,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000094398,
      "AltID": "anhydrous ammonia",
      "FacilityID": 1000075832,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000095660,
          "ProcessID": 1000094398,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000118148,
          "ProcessID": 1000094398,
          "ChemicalID": 56,
          "Quantity": 5200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000618148,
          "ProcessID": 1000094398,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075832,
      "SummaryText": "RISK MANAGEMENT PLAN\n\n\n\nEXECUTIVE SUMMARY\n\n\n\n\n\nBackground Data\n\n\n\nIn accordance with Title 40 of the Code of Federal Regulations, Chapter 68 (40 CFR 68), promulgated by the Environmental Protection Agency (EPA) and Article 2, Chapter 6.95 of the California Health and Safety Code (HSC), the City of Antioch (City) submits this Risk Management Plan (RMP) for operations at their Water Treatment Plant (WTP) in Antioch, California.  The City provides potable water to their service area, which coincides with the City limits.  The facility is capable of treating 38 million gallons per day (mgd) of water, however it currently averages 13.3 mgd.  \n\n\n\n\n\nAccidental Release Prevention and Emergency Response Policy\n\n\n\nThe City is committed to protecting the health and safety of its employees, the surrounding community, and the environment; therefore, it is the City's policy to manage a safe and healthy workplace, protect the environment and maintain compliance with safety, health, and environmental regulations: both the federal risk management regulations (for quantities in excess of 2,500 pounds), 40 CFR 68, as well as the California Risk Management Regulations (for quantities in excess of 100 pounds), Title 19 CCR Division 2 Chapter 4.5, as well as the California Occupational Safety and Health Administration (Cal/OSHA) Process Safety Management (PSM) regulations, Title 8 CCR 5189. \n\n\n\nThis commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  The City has been proactive in the CalARP program.  We have installed a scrubber to contain and treat any chlorine release, and improved and documented our preventive maintenance program.  We have converted the process from a chlorine-supply system to a "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075832,
      "SummaryText": "vacuum-demand system by replacing piping and installing vacuum regulators for inherently safer operation.  \n\n\n\nThe City is safety conscious.  Historically, we promote safety to ensure that all safety programs will be maintained, keeping the WTP safe for the staff and safe for the surrounding community.  At the WTP we have a Central Safety Committee and a safety coordinator.  They are involved in risk management and the accidental release prevention program as well as general safety at the WTP.  At the monthly Safety Committee meetings, discussion includes accidents and old and new safety issues.  The Safety Committee discusses the issues and recommendations are brought forward.  (Proposed changes to the processes are evaluated in accordance with the Management of Change procedures described in this document.)  Plans and procedures to initiate any safety item are described in a memorandum prepared by the Safety Coordinator.  Employees sign the memorandum to verify that they have been informed of new resolutions that the City has adopted.  Staff and management then implement these safety procedures.\n\n\n\nWe conduct a monthly safety meeting for all staff.  The staff brings up safety concerns at the WTP and also reviews safety topics that the Central Safety Committee has requested be discussed.  Every six months, during the monthly meeting, we also provide training on SCBA and B kits (for control of chlorine cylinder leaks).  Employees who are present initial the safety meeting minutes.  Those who are not present at the meeting will read the literature that is made available from the Safety Committee and sign to verify that they have read the document.  All copies of safety meeting minutes are returned to the Safety Committee and filed at the Maintenance Service Center.  \n\n\n\nIn addition to the Central Safety Committee and monthly safety meetings, other methods used by management to verify and improve safety and environmental programs at the WTP include incident investigat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075832,
      "SummaryText": "ions, ensuring active employee participation in the PSM and RMP process, audits and Management of Change procedures.  These RMP and PSM elements are described in detail in Section 6.  The City's safety and environmental policy is included in the employee safety binders (periodically updated) and available to all employees.  This manual and other records are maintained at the Maintenance Service Center at the WTP.\n\n\n\n\n\nStationary Sources and Regulated Substances\n\n\n\nThe City is subject to Section 112(r) of the Clean Air Act because chlorine, a regulated substance, is present at the facility in amounts greater than 2,500 pounds.  The City is also subject to the state CalARP risk management program because the City maintains greater than 100 pounds of chlorine.  The City is required to treat the water supply so that it meets or exceeds the drinking water quality standards of the California Department of Public Health.  The City uses chlorine (the 112(r) regulated substance) to disinfect the water.  The City's chlorine disinfection process consists of 1 ton chlorine cylinders, chlorinators, a piping system that is all under vacuum, and an emergency scrubber to treat a chlorine release.  Each cylinder contains 2,000 pounds of chlorine.  No more than 14 cylinders are stored on site.  Therefore, the total amount of chlorine stored is a maximum of 28,000 pounds.\n\n\n\nAdditionally, the City is subject to the CalARP program for ammonia as well as chlorine, because the quantity of ammonia on site (maximum of 5,200 pounds) exceeds the state \n\nthreshold of 500 pounds.  The ammonia system includes a 1,200-gallon tank, which is only filled to a maximum of 85 percent or 1,020 gallons.  The City uses ammonia in conjunction with chlorine to produce chloramines, a well-established disinfectant, to avoid the production of trihalomethanes, which have been a concern to the water industry in the last decade.  The ammonia is stored as anhydrous ammonia and introduced into the treatment proces"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000075832,
      "SummaryText": "s prior to the point of disinfection.\n\n\n\nBoth the chlorine and the ammonia systems are described in more detail in Section 6.  The chlorine system is depicted on Figure 6.1-1 while the ammonia system is depicted on Figure 6.1-4.\n\n\n\n\n\nWorst-Case Release Scenario\n\n\n\nAs required by 40 CFR 68 Subpart B and Section 2750.3 of CalARP, the City has evaluated a worst-case scenario (WCS) for chlorine using the parameters specified by the EPA.  The City's WCS is the rupture of a one ton cylinder of chlorine and the loss of the entire contents over a 10 minute period.  The distance to the toxic endpoint was determined using the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance as well as tables in the RMP Guidance for Wastewater Treatment Plants. The following paragraphs provide details of the chosen scenario.\n\n\n\nThe chlorine liquid released is assumed to form a 1-cm deep pool from which evaporation takes place.  The entire pool is estimated to evaporate over 10 minutes.  The released quantity has not been limited by administrative controls.  At Class F atmospheric stability and 1.5 meters per second (m/s) wind speed, the maximum distance of 1.3 miles is obtained corresponding to a toxic endpoint of 3ppm chlorine (0.0087 milligrams chlorine per liter of air (mg/L)).\n\n\n\nThe WCS was developed following EPA regulations and is not considered to be a likely release scenario.  Historically throughout the chlorine industry, the rupture of 1 ton cylinders is rare.  The rupture of a cylinder outside the building would probably only occur during unloading of the cylinder.  This would be a daytime activity.  The meteorological condition required to be used by the EPA is F stability class.  By definition, this stability class only occurs at nighttime.  Therefore, the results of this WCS offsite consequence analysis are extremely conservative.  The estimated population within this distance to the WTP is 29,000 people.  The public receptors wit"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000075832,
      "SummaryText": "hin this vulnerability radius include the schools, general acute care hospitals, long-term health care facilities, and child day care facilities.\n\nThe ammonia process is a Program 2 process.  The WCS for ammonia does not extend as great a distance to the toxic endpoint as chlorine.  \n\n\n\nAlternative Release Scenario\n\n\n\nThe City, considering the history of operations and the City staff's experience as well as the hazards identified in the process hazard analyses (PHAs), developed more realistic release scenarios or alternative release scenarios (ARS) based on their knowledge and judgement.  The PHA was conducted to ensure that the WTP hazards were identified and minimized.  These analyses were conducted under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations Chapter 1910, Section 119 (29 CFR 1910.119), subsequently adopted by California as the Cal/OSHA PSM regulations, T8 CCR 5189.\n\n\n\nThe selected ARS for chlorine involves a vapor release from a break in the flexible 1/2-inch tubing.  Because the system is under vacuum, a break alone would result in only a small release of chlorine gas from the tubing downstream of the regulator and upstream from the break.  However, if the break occurred and was accompanied by failure of the vacuum regulator, a release could occur from a valve.  The opening would be about 1/2 inch and potentially 37 pounds of chlorine per minute could be released.  This scenario would result in the release inside the chlorine building.  \n\n\n\nWe conservatively assume the duration of the release is 30 minutes. The leak detectors would initiate alarms (sirens and lights) and notify an operator.  Automatic controls would activate the emergency scrubber.  The \"Chlorine Leak\" signal is transmitted to the main control room located within 150 feet of the chlorine area. Standby help would arrive within minutes. The 30-minute release duration is conserv"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000075832,
      "SummaryText": "ative because the alarms would notify people on site who could arrive within minutes.  The leak would more likely be 15 minutes, the estimated maximum response time from detection and alarm to securing the leak.  \n\n\n\nThe scrubber manufacturer has demonstrated through tests and calculations included in Appendix C that the efficiency of the chlorine scrubber is greater than 99.99 percent.  To ensure that this efficiency is valid, we calculated the scrubber efficiency for the specifics of the site conditions and the release scenario.  These calculations are also included in Appendix C.\n\n\n\nThe scrubber manufacturer guaranteed that the exhaust Cl2 gas concentration would be less than 3 ppm (0.0087 mg/L) at standard temperature and pressure.  Our calculations considered the total amount of gas escaping from the cylinder into the room, the consequent change in temperature, the variation of the concentration up to the peak concentration in the room assuming complete mixing of room air, the variation in the mass transfer coefficient as a function of the flow rate through the scrubber, and the time it would take for caustic in the scrubber to react with all Cl2 released into the room.  The results of the calculations for the ARS of 37 pounds of Cl2 per minute released for 30 minutes show that the maximum Cl2 concentration in the exhaust will be 2.5 ppm and the maximum mass released will be 0.04 pounds of Cl2.  Within 100 minutes, the Cl2 concentration within the room should be negligible and should not be detectable.  Thus, during the ARS, there will be no exposure off site to concentrations exceeding the toxic endpoint.\n\n\n\nTwo ARSs for anhydrous ammonia are selected.  The CCHS requested that we evaluate the ARS of a 5,200 pound release from the bulk tank.  This is a very unlikely scenario.  We determined that the most credible and useful ARS to responders is the scenario of a 1 inch vapor line failure.  This is the scenario in which the probability of occurrence is higher th"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000075832,
      "SummaryText": "an most scenarios identified in the PHA.  Therefore, both ARS for ammonia are included.\n\n\n\nThe ARS that involves the release of ammonia outside from the bulk storage tank when it is full.  During unloading, the ARS is very improbable because the procedure is supervised and a release would be contained within moments.  Therefore, we have assumed that the release of the entire tank could only occur at night, when the Plant is shut down and unmanned.  For this reason we are using the same nighttime conditions (F stability class and 1.5 m/s wind speed) as required by the EPA for the WCS.  We are also assuming the same release time as the WCS of 10 minutes.  Therefore, this ARS is the same as the WCS.  In this urban topography, at Class F atmospheric stability and 1.5 m/s wind speed, the maximum distance to the toxic endpoint of 0.14 mg/L (200 ppm) is 0.9 miles.  The estimated population within this distance to the WTP is 14,000 people.  The public receptors within this vulnerability radius include the schools, general acute care hospitals, long-term health care facilities, and child day care facilities.\n\n\n\nThe second ARS assumes an ammonia release from a 1-inch vapor line failure.  This results in a release rate of approximately 20 pounds of ammonia per minute.  We conservatively assume that the duration of the release is 40 minutes.  This is the estimated maximum response time from detection to securing the leak.  In this time, approximately 800 pounds of ammonia could be released.  From the EPA's RMP Guidance for Wastewater Treatment Plants Reference Table and/or Equations, the distance to toxic endpoint is 0.044 mile or approximately 230 feet.  The public receptors within this distance to the WTP are some residences to the west, representing a population of 30.\n\n\n\nThe sensitive receptors within the one-mile vulnerability zone from the City WTP are included as Table 4-2.  Graphical results of the WCS and the ARS are presented in Figures 4-1 and 4-2.\n\n\n\n\n\n \n\nGeneral Ac"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000075832,
      "SummaryText": "cidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nOur facility has taken the necessary steps to comply with the accidental release prevention program requirements set forth under 40 CFR part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\n\n\nManagement System\n\n\n\nIn accordance with Section 2735.6 of the CalARP regulation, the City has implemented a management system to plan, organize, implement and control the risk management program elements that are required in the CalARP and the Clean Air Act Amendments Section 112r Chemical Accidental Release Prevention Program.  All records associated with prevention program elements are retained for a minimum of 5 years unless otherwise specified in the CalARP regulation.  Section 5 of this RMP includes an organizational chart and identifies the line of authority and individuals responsible for each risk management program element.  \n\nThe management system ensures that the risk management program elements are integrated and coordinated with other regulatory requirements including OSHA/Cal OSHA's process safety management (PSM) regulation.  Elements common to both programs are updated simultaneously as necessary.  The line of authority and individuals responsible for each risk management program element is the same for each similar component of the PSM element.  \n\nSection 5 describes how management ensures that the CalARP and PSM elements are consistently and accurately implemented.  This includes employee training, mechanical integrity inspections, management of change policies, pre-start-up reviews, compliance audits, incident investigations, employee participation, issuance of hot work permits and contractor management.\n\n\n\n\n\nChemical-Specific Prevention Steps\n\n\n\nThe chemical specific prevention steps are described in detail in Section s 6-7 through 6-13 and Sections 6-16 through 6-20 of this RMP.  \n\n"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000075832,
      "SummaryText": "\n\nProcess Safety Information.  The WTP maintains a record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.  These are described in more detail in Section 6.1.\n\n\n\nProcess Hazard Analysis.  Our facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is a HAZOP study.  Findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 2/27/2018.  The PHA and its results are described in more detail in Section 6.2.\n\n\n\nOperating Procedures.  For the purposes of safely conducting activities within our covered processes, the WTP maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.  These are described in more detail in Section 6.3.\n\n\n\nTraining.  The WTP has a training program in place to ensure that employees who are operating the processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.  The training programs are described in more detail in Section 6.4.\n\n\n\nMechanical Integrity.  The WTP carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes: emergency scrubber, one ton chlorine cylinders, piping systems, relief and vent systems, leak detectors and controls.  Qualified personnel, who have received previous training in maintenance practices, carry out maintenance operations.  Furthermore, these personnel are offered speci"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000075832,
      "SummaryText": "alized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  The mechanical integrity elements are described in more detail in Section 6.5.\n\n\n\nManagement of Change.  Written procedures are in place at the WTP to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of management of change procedures was performed on 1/9/2018.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.  The elements of Management of Change are described in more detail in Section 6.6.\n\n\n\nPre-startup Reviews.  Pre-startup safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at the WTP.  The most recent review was performed on 5/1/2007, when the Ammonia Deluge system was placed into service.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.  These reviews are described in more detail in Section 6.7.\n\n\n\nCompliance Audits.  The WTP conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on 02/26/2018.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  These audits are described in more detail in Section 6.1.\n\n\n\nIncident Investigation.  The WTP promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to p"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000075832,
      "SummaryText": "revent the release from reoccurring.  All reports are retained for a minimum of 5 years.  These are described in more detail in Section 6.9.\n\n\n\nEmployee Participation.  The WTP truly believes that process safety management and accident prevention is a team effort.  Agency employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.  This participation is described in more detail in Section 6.10.\n\n\n\nHot Work Permit Program.  The hot work permit program is beneficial to accidental release prevention because it adds fire prevention and protection measures.  It is critical that pertinent personnel are notified when hot work (i.e., any spark-producing operation including grinding, burning, welding, brazing) is to be performed in a unit and that appropriate safety precautions are taken prior to initiation of the work.  For authorization of the hot work permit, the Plant Superintendent or the Maintenance Supervisor must review the permit content and inspect the work site.  For authorization, they must ensure that the permit content identifies and addresses all hazards and satisfies all of the requirements of 29 CFR 191.252 including site preparation, safety equipment and considerations and training.  All hot work permits are maintained on file at the facility by the Plant Superintendent for a minimum of 1 year following completion of the hot work.  Hot Work permits and procedures are described in more detail in Section 6.11.\n\n\n\nContractors.  On occasion, our agency hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The WTP has a strict policy of informing the contractors"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000075832,
      "SummaryText": " of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.  This practice is described in more detail in Section 6.12.\n\n\n\n\n\nFive-Year Accident History\n\n\n\nThe WTP has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period that caused any onsite death, injury or significant property damage, or known offsite death, injury, property damage, environmental damage, evacuations, or sheltering in place.\n\n\n\n\n\nEmergency Response Plan\n\n\n\nThe WTP maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  More on the emergency response information is provided in Section 7.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nThe City participates in the Contra Costa County Community Awareness and Emergency Response (CAER) Group.  CAER has designed and funded an emergency warning system to provide alert and notification to the community.  This includes sirens and emergency alert receivers for schools, daycare, senior centers, and hospitals throughout the industrial corridor.  Also included is the most advanced technology for emergency notification, such as automated radio, TV, and cable broadcasts for use throughout the County.  The warning system would be used in the event of an off-site release.  The co"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000075832,
      "SummaryText": "mmunity is being educated to shelter-in-place when the sirens sound.\n\n\n\n\n\nContinuous Efforts to Improve Safety\n\n\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  We are pleased with the safety program that we already have implemented.  We plan to continue to improve safety by reviewing, revising, and enhancing our written procedures as well as implementing any action items or planned activities, as a result of a PHA revalidation or a compliance audit.  None of the action items resulting from the PHA in 2018 are critical or essential; rather they represent enhancements or improvements.\n\n\n\n"
    }
  ]
}