{
  "FacilityID": 1000080557,
  "FacilityName": "Elementis Specialities New Martinsville",
  "FacilityStr1": "17595 Energy Road",
  "FacilityStr2": null,
  "FacilityCity": "Proctor",
  "FacilityState": "WV",
  "FacilityZipCode": "26055",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54051",
  "LEPC": "Marshall/Wetzel County LEPC",
  "FacilityLatDecDegs": "39.727876",
  "FacilityLongDecDegs": "-80.829903",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "State Rt 2",
  "FacilityEmailAddress": "Kent.Adamson@elementis.com",
  "FacilityDUNS": 609454954,
  "ParentCompanyName": "Elementis Specialties",
  "Company2Name": "Elementis Group LLC",
  "CompanyDUNS": 378486021,
  "Company2DUNS": null,
  "OperatorName": "Elementis Specialties, Inc",
  "OperatorStr1": "17595 Energy Road",
  "OperatorStr2": null,
  "OperatorCity": "Proctor",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26055",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": "WVR000530907",
  "EPAFacilityID": "100000225525",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-04-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-06-21 12:08:40",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-21 12:08:40",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-21 12:08:40",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 39.727876,
  "FRS_Long": -80.829903,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100634,
      "AltID": "HASE & Dispersants",
      "FacilityID": 1000080557,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000126015,
          "ProcessID": 1000100634,
          "ChemicalID": 57,
          "Quantity": 125000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000126016,
          "ProcessID": 1000100634,
          "ChemicalID": 29,
          "Quantity": 74000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101878,
          "ProcessID": 1000100634,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000084962,
              "Process_NAICS_ID": 1000101878,
              "SafetyReviewDate": "2018-12-17 00:00:00",
              "PHA_Date": "2019-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-12-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Dispersant PHA re validation 12/17/2018",
              "OpProceduresReviewDate": "2018-11-26 00:00:00",
              "TrainingReviewDate": "2014-06-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-07-23 00:00:00",
              "EquipmentInspectionDate": "2014-06-03 00:00:00",
              "EquipmentTested": "05/11/2019",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2019-04-30 00:00:00",
              "PreStartupReviewDate": "2019-04-30 00:00:00",
              "ComplianceAuditDate": "2018-07-24 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-10-22 00:00:00",
              "HotWorkPermitReviewDate": "2018-10-01 00:00:00",
              "ContractorSafetyReviewDate": "2017-07-06 00:00:00",
              "ContractorSafetyEvalDate": "2019-02-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000105843,
                  "PreventionProgram3ID": 1000084962,
                  "ProcessChemicalID": 1000126015
                },
                {
                  "PrimaryKey": 1000105844,
                  "PreventionProgram3ID": 1000084962,
                  "ProcessChemicalID": 1000126016
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080557,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-03-25 00:00:00",
    "ERTrainingDate": "2018-04-10 00:00:00",
    "CoordinatingAgencyName": "Marshall/Wetzel LEPC",
    "CoordinatingAgencyPhone": "3044558200",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080557,
      "SummaryText": "Elementis Specialties New Martinsville (NMV) Executive Summary\r\n\r\nThe Elementis Specialties NMV site is an operation located within a portion of the Covestro New Martinsville, WV Industrial Park pursuant to a lease with Covestro.  In August 2014, the NMV site started up two newly constructed processes, HASE thickeners and Dispersants.  Both processes fall under 29 CFR 1910.119 (PSM) and 40 CFR Part 68 (RMP) regulations. Both processes manufacture products that had been produced by Elementis at other locations and used similar chemistry and unit operations.  Elementis' past experience from these operations were taken into consideration in the design, construction, and operation of the NMV processes.\r\nElementis has implemented a Basic Safety Process standard.  In accordance with this standard, Elementis has developed a Safety Leadership Team which meets monthly to review current health and safety matters, status of open incident investigations, feedback from monthly department safety meetings, progress on completing PHA recommendations, PSSR findings, MOC actions, and internal audit findings. Minutes from these meetings are documented and reviewed periodically by senior management.\r\n\r\nSection 2 & 3:  Toxics Worst Case and Alternative Case Scenarios\r\nThe HASE process consumes a batch quantity of vinyl acetate as a raw material which is a listed Toxic Regulated Substance in Table 1 of §68.130.  The threshold quantity is 15,000 lbs. Current formulation consumes 5530 lbs per batch and estimated maximum inventory will be 74,000 lbs.  The vinyl acetate is received in bulk quantities.  The Toxic Worst Case scenario is assumed to be a simultaneous loss of primary and secondary containment of the 40,000 liter storage tank (74,000 lbs maximum capacity).  The Alternative Case is assumed to be a loss of primary containment of a bulk trailer (39,000 lbs.)  at a fitting on a transfer hose.  \r\n  \r\nThe Dispersants process consumes a batch quantity of 29% ammonium hydroxide as a raw m"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080557,
      "SummaryText": "aterial which is a listed Toxic Regulated Substance in Table 1 of §68.130.  The threshold quantity is 20,000 lbs.  The ammonium hydroxide is received in bulk by tank wagon, with a maximum shipment size of 45,000 lbs., and stored in a 70,000 liter tank (125,000 lbs. maximum capacity).  The Toxic Worst Case scenario is assumed to be a catastrophic failure of the tank and secondary containment.  The Alternative Case is assumed to be a loss of a bulk trailer due to a at a fitting on a transfer hose.\r\n\r\nSection 6:  Five Year Accident History\r\nThere have been no accidents involving these chemicals at the Elementis New Martinsville site.  \r\n\r\nSection 7:  Prevention Program Level 3\r\n7.4 PHA - The original PHA was conducted during the engineering phase of both the HASE and Dispersants processes using ABS Leader software.  The methodologies used were HAZOP and Checklists.  Participants were:  PHA leader, two process engineers responsible for the manufacturing of HASE and Dispersants at other Elementis locations, NMV production engineer, NMV process engineer, Elementis and contracted project engineers, and HSE resource.  All recommendations from the original PHA were addressed by 8/1/2014.  Elementis requires that a PHA be conducted or an existing PHA be reviewed and updated prior to any new equipment being installed or changes to equipment design, specifications (both equipment and process), or operating procedures.  Requirements for conducting a PHA or updating an existing PHA are identified in the management of change (MOC) procedure. \r\n\r\nThe revalidation of the PHA for the Dispersants process was completed on 12/20/2018.  All corrective actions from this PHA will be completed by 12/20/2019.  The HASE PHA will be completed in 2019.  The same methodology was used as the original PHAs.  \r\n\r\n7.5 Operating Procedures - Operating procedures have been developed for both the HASE and Dispersant processes.  The procedures have been developed to meet PSM standards. Any changes to th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080557,
      "SummaryText": "e operating procedures must go through the MOC procedure.\r\n\r\n7.6 Training -NMV plant personnel have gone through extensive training for operating the equipment, as well as procedures specific to manufacturing each product.  In addition  NMV personnel participate in safety training which includes but is not limited to, all required OSHA and PSM training.  \r\n\r\n7.7 Maintenance - NMV has developed a comprehensive mechanical integrity inspection and preventative maintenance program (MI/PM).  The MI/PM program covers pressure vessels, atmospheric storage tanks, pressure relief/vent devices, piping, pumps, high speed rotational equipment, electrical systems, and safety related instrumentation.   Inspection procedures conform with generally accepted good engineering practices and PM programs are in accordance with the manufacturer's recommendations.  \r\n\r\n7.8 MOC - The NMV site utilizes the Elementis corporate MOC database.  This database is a Lotus Notes based network system designed to comply with the PSM standard.  The database provides electronic notification and tracking for approvals and all actions associated with each MOC.  NMV requires that any changes to equipment design, specifications (both equipment and process), or operating procedures must follow the MOC procedure.\r\n\r\n7.9 PSSR - A PSSR was completed prior to the startup of each unit operation within the HASE and Dispersant processes.  The ABS Leader software was utilized to both design and document the PSSR.  NMV requires that PSSR's be conducted anytime new equipment is installed, replaced, or taken out of service and restored to service.  Requirement to conduct a PSSR is identified in the MOC procedure.\r\n\r\n7.10 Compliance Audit - Elementis requires 3 year compliance audits the NMV site.  This audit will utilize trained and experienced auditors to review health, safety, environmental, process safety, and security compliance.  For processes which fall under the PSM and/or RMP standards, a separate audit will b"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080557,
      "SummaryText": "e conducted by a person knowledgeable of each regulation and documented.  Findings, as well as recommended industry best practices, are documented and the NMV site will be responsible for responding to each item.  Progress on completing actions will be tracked via an action management system.   \r\n\r\n7.11 Incident Investigation - NMV utilizes a web based safety management system for documenting and managing all incidents, investigations, corrective actions, and approvals.  The system provides electronic notification and tracking for all corrective actions and approvals for each incident.  It allows for the categorization of incidents (e.g. near miss, safety, environmental, fire, security, etc), as well as, specific details to each incident that can be used to identify specific trends that can then be used to improve the overall EHS performance for each Elementis location. \r\n\r\n7.12 Employee Participation - NMV includes members from its workforce in incident investigations and PHA's.  The participants are listed in the reports.  Requirements for participation are documented in the NMV PSM procedure.  At the plant safety meetings, employees are encouraged to bring any safety concerns, or suggestions.\r\n\r\n7.13 Hot Work Procedure - NMV has a documented procedure that complies with 29 CFR 1910.119 (k) requirements as well the Elementis Policy.\r\n\r\n7.14 Contractor Safety - NMV has a contractor evaluation process that requires a safety performance review amongst other requirements, prior to approval to work at the site.  Prior to work on site contractors are trained according PSM standards 29 CFR 1910.119 (h) and Covestro emergency procedures. \r\n\r\nSection 9:  Emergency Response Plan\r\nAs part of the Elementis lease with Covestro, Covestro has agreed to provide emergency response to the NMV site.  Covestro emergency response team (ERT) is trained (and certified where applicable) to provide HAZMAT response, firefighting response, and medical response.  ERT members divided across a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080557,
      "SummaryText": "ll shifts that receive 16 to 80 hours of on-site training annually with some disciplines receiving off-site training such as firefighting, incident command, and HAZMAT.  Covestro has certified EMT's on site for each shift. A physician is on site one day each week. A  full time nurse is on site during day shift.  The nurse will coordinated with local hospitals if necessary.  The site is equipped with a fire truck. The emergency response team is maintained on all shifts and can be activated either via 2-way radio or by phone.  Covestro has developed a Community Awareness Emergency Response (CAER) plan, as well as, coordinates emergency planning with the LEPC, and local emergency response agencies.  Community warning sirens are maintained by Covestro in local residential areas within 2 miles from the plant. The Covestro emergency response team has incorporated the chemicals used in the NMV processes into its response plan and provided the necessary training to their people. NMV has completed HAZMAT training with 10 employees."
    }
  ]
}