{
  "FacilityID": 1000005794,
  "FacilityName": "Doswell Energy Center",
  "FacilityStr1": "10098 Old Ridge Road",
  "FacilityStr2": null,
  "FacilityCity": "Ashland",
  "FacilityState": "VA",
  "FacilityZipCode": "23005",
  "Facility4DigitZipExt": "7312",
  "FacilityCountyFIPS": "51085",
  "LEPC": "Hanover County LEPC",
  "FacilityLatDecDegs": "37.820051",
  "FacilityLongDecDegs": "-077.446205",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 135474588,
  "ParentCompanyName": "Doswell Limited Partnership",
  "Company2Name": null,
  "CompanyDUNS": 135474588,
  "Company2DUNS": null,
  "OperatorName": "Doswell Limited Partnership",
  "OperatorStr1": "10098 Old Ridge Road",
  "OperatorStr2": null,
  "OperatorCity": "Ashland",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23005",
  "OperatorZipCodeExt": "7312",
  "FTE": 31,
  "OtherEPAFacilityID": "23005DSWLL10098",
  "EPAFacilityID": "100000050464",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "51018",
  "SafetyInspectionDate": "2011-09-28 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-11-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.820051,
  "FRS_Long": -77.446205,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000006838,
      "AltID": "Ammonia",
      "FacilityID": 1000005794,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000007682,
          "ProcessID": 1000006838,
          "ChemicalID": 56,
          "Quantity": 90000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000006966,
          "ProcessID": 1000006838,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000005258,
              "Process_NAICS_ID": 1000006966,
              "SafetyReviewDate": "2008-12-03 00:00:00",
              "PHA_Date": "2008-12-03 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-09-13 00:00:00",
              "TrainingReviewDate": "2012-10-19 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-11-21 00:00:00",
              "EquipmentInspectionDate": "2009-05-27 00:00:00",
              "EquipmentTested": "tank piping and valving",
              "ChangeMgmtDate": "2012-03-09 00:00:00",
              "ChangeMgmtReviewDate": "2011-05-25 00:00:00",
              "PreStartupReviewDate": "2012-03-09 00:00:00",
              "ComplianceAuditDate": "2012-05-29 00:00:00",
              "AuditCompletionDate": "2012-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-06-11 00:00:00",
              "HotWorkPermitReviewDate": "2012-02-27 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2012-03-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000006160,
                  "PreventionProgram3ID": 1000005258,
                  "ProcessChemicalID": 1000007682
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000005794,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-06-13 00:00:00",
    "ERTrainingDate": "2007-12-24 00:00:00",
    "CoordinatingAgencyName": "Hanover County LEPC",
    "CoordinatingAgencyPhone": "8045376195",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Virginia 9 VAC 25-91-170, oil discharge"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000005794,
      "SummaryText": "Accidental Release Prevention and Emergency Response\r\n\r\nAll Doswell Team Members are instilled with the shared values of an injury free workplace and environmental responsibility.  A risk anaylsis is performed before each job or task,  The anaylsis includes both safety and environmental impact.  If a job can not be done safely, it is not done.  If a job is safe but has environmental concerns, it is not done. \r\n\r\nStandard operating procedures and a preventive maintenance program partnered with the shared values are the backbone of Doswell's prevention program.  All production technicians are required to complete a series of Personnel Qualifications Cards (PQC).  Each system of the Facility is covered by a PQC.  The PQC program defines the knowledge and skill an individual must possess to operate or maintain any given system.  In addition to basic system knowledge, an individual must possess knowledge related to safety, emergency, security, integrated plant operations, and environmental impact as applies to that system.\r\n\r\nDoswell utilizes a computer based maintenance system.  Preventive maintenance (PM) work orders are issued on a periodic basis established by equipment manufacturers and equipment history.  PM's are used to maintain plant equipment in a good working order and prevent accidental releases due to normal equipment aging.  The system also issues and tracks corrective work orders.  Premature failures abnormal operating conditions, releases, safety incidents, and re-occurring corrective work orders are tracked using a computer based database, Event Response Tracking System (ERTS).  ERTS drives Team members to analyze each event for root cause and implement countermeasures to prevent repeating events.  ERTS is used to prevent small repeating problems from growing into to future failures. \r\n\r\nWhile Doswell strives to have no emergencies, it is recognized that they are impossible to prevent completely.  Therefore, Doswell has procedures and equipment for respo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000005794,
      "SummaryText": "nding to emergencies in an orderly and safe manner. An integrated contingency plan is utilized to provide a single source for emergency procedures and compliance reporting.  As a part of protecting employee health and safety, Doswell designates itself as a non-responding facility. Facility self-designation as non-responding is recognized by the U.S. Environmental Protection Agency (EPA) and the U.S. Occupational Safety and Health Administration (OSHA). Non-responder status was established as a risk ceiling for employee response.  Under no circumstances shall personnel jeopardize their health and safety or that of others in responding to an emergency. In responding, employees shall not exceed significantly the level of risk to which they normally are exposed and acclimated in their workplace.  \r\n\r\nFacility and Regulated Substance Handled\r\n\r\nDoswell Energy Center is an independent electric power production facility. The Facility consists of two combined cycle units and one peaking unit. Eachcombined cycle unit consists of two combustion turbines, two heat recovery steam generators (HRSGs), one steam turbine, one air-cooled condenser, and their plant support equipment.  The peaking unit is a single simple cycle combustion turbine. The primary fuel is natural gas with light distillate fuel oil as a backup fuel. \r\n\r\nThe Doswell combined cycle units use anhydrous ammonia to control nitrous oxide emissions from the burning of fuel oil and gas for electric power production.  The ammonia is stored as a liquid under pressure, which is vaporized and mixed with air before being injected into the Selective Catalytic Reduction unit on each Heat Recovery Steam Generator (HRSG). The ammonia is stored in two, 10,000-gallon tanks, which have a total capacity of 103,200 pounds of anhydrous ammonia. \r\n\r\nPrevention Program and Chemical-Specific Prevention Steps\r\n\r\nDoswell is a Program 3 facility under the classification system in 40 CFR 69, and it has a prevention program that meets t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000005794,
      "SummaryText": "he regulatory requirements. \r\n  1. Process Safety Information is summarized in Doswell's integrated contingency plan.  The summary discusses ammonia recognition, safety profile, normal handling, emergency handling, first aid, fire fighting, and regulatory information. \r\n  2. The most recent Process Hazard Analysis was completed to comply with 29 CFR 1910.119(e).  The What If method was used by Doswell Team members to review and analyze the ammonia system.\r\n  3. The Facility's Operating Procedures include the Ammonia System Normal Startup, Operations, and Shutdown Operating Procedure, the Ammonia Receiving and Unloading Procedure, and the Ammonia Storage and Supply System Description.  Procedures are reviewed and revised regularly or as a result of the Event Response process.\r\n  4. Training is defined in the Ammonia Safety and Training Program. All personnel who may be involved with the handling or maintenance of anhydrous ammonia product or equipment shall receive safety training.  This training will be conducted and documented before an employee is allowed to work around the anhydrous ammonia product or equipment. \r\n  5. The ammonia system and equipment was designed and constructed according to American Society of Mechanical Engineers (ASME) standards. Maintaining the Mechanical Integrity of the ammonia system is accomplished through Facility procedures and the computer based maintenance system. Preventive maintenance (PM) work orders are issued on a periodic basis established by equipment manufacturers and equipment history. \r\n  6. Management of change is addressed in the Change Management(CM) Process.  All plant design changes are reviewed for safety and environmental impact.  The CM process also defines the documentation required for each change.  The Ammonia Safety and Training Program requires training on procedural and operational changes  \r\n  7. A Pre-startup Review is requirement of the CM process.\r\n  8. Compliance Audits will be conducted and scheduled as"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000005794,
      "SummaryText": "required or as the result of a release or system change.  \r\n  9. Incident Investigation of an incident which resulted in, or could reasonably result in a catastrophic release of ammonia will be conducted by a Significant Event Analysis Team (SEAT).  The SEAT will be assembled and investigate the incident in a timely manner.  The SEAT will issue a report of their findings along with recommended countermeasures before the event is closed.  The Facility's Event Response system is used for tracking and reporting minor releases and safety incidents.\r\n 10. Employee Participation is developed through Doswell System Owner program.  Each Doswell Team member is assigned a system or process.  System owners are involved with all aspects of their system, from Operating Procedures to reviewing proposed physical or control changes. \r\n 11. Doswell has a Hot Work Permit Procedure in compliance with 29 CFR 1910.252(a).\r\n 12. Contractors performing work at the Facility are required to attend a safety orientation before work can begin.  Contractors are required to abide by Doswell safety rules and procedures.\r\n \r\nFive-Year Accident History\r\n\r\nDoswell has had no offsite or significant release of ammonia since beginning its storage and use at in the SCR process.\r\n\r\nEmergency Response Program\r\n\r\nDoswell's integrated contingency plan instructs employees on emergency actions for employee protection and first aid, including for ammonia-related incidents. Doswell employees shall not respond to an occurrence that results or is likely to result in an uncontrolled release of a hazardous substance. In the event of such an occurrence, Doswell shall (1) take measures to protect its employees and (2) call the Hanover County Communications Center for emergency personnel and equipment to respond to the release.  The Doswell non-response policy does not apply to incidental releases of hazardous substances where the substance can be absorbed, neutralized, or otherwise controlled at the time of release b"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000005794,
      "SummaryText": "y employees in the immediate release area.  It also does not apply to responses to releases of hazardous substances where there is no potential safety or health hazard, i.e., no fire, explosion, or chemical exposure.\r\n \r\nDoswell expects employees to take actions to end a leak (e.g., by shutting a valve) or clean up a spill that do not pose an immediate health or safety hazard. Those measures shall be considered incidental emergency responses and employees are allowed such activities.\r\n\r\n The Emergency Plan has instructions for notifying and coordinating with the local agency for response activities, Hanover County, in the event of a significant ammonia release at the Facility.  Hanover County will be immediately notified of any ammonia release that carries over the security fence.  Doswell's integrated plan has been shared with Hanover County officials.  Doswell has conducted ammonia release drills with Hanover and Henrico County response teams. \r\n\r\nPlanned Safety Improvements\r\nNone at this time."
    }
  ]
}