{
  "FacilityID": 1000071296,
  "FacilityName": "Venture Glades",
  "FacilityStr1": "Red Holifield Drive",
  "FacilityStr2": null,
  "FacilityCity": "Laurel",
  "FacilityState": "MS",
  "FacilityZipCode": "39440",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28067",
  "LEPC": "Jones County LEPC",
  "FacilityLatDecDegs": "31.646814",
  "FacilityLongDecDegs": "-89.09497",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.americanmidstream.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "American Midstream Partners, LP",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "American Midstream Partners, LP",
  "OperatorStr1": "2103 CityWest Blvd.",
  "OperatorStr2": "Building #4, Suite 800",
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77402",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000234105",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-05-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-08-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-08-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-08-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-08-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000089294,
      "AltID": "Gas & Liquids Processing",
      "FacilityID": 1000071296,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000111712,
          "ProcessID": 1000089294,
          "ChemicalID": 155,
          "Quantity": 74000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000097365,
              "ProcessChemicalID": 1000111712,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000097366,
              "ProcessChemicalID": 1000111712,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000097367,
              "ProcessChemicalID": 1000111712,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000097368,
              "ProcessChemicalID": 1000111712,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000097369,
              "ProcessChemicalID": 1000111712,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000097370,
              "ProcessChemicalID": 1000111712,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000097371,
              "ProcessChemicalID": 1000111712,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000090519,
          "ProcessID": 1000089294,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000055937,
              "Process_NAICS_ID": 1000090519,
              "SafetyReviewDate": "2018-06-26 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2018-08-10 00:00:00",
              "ChangeCompletionDate": "2018-08-10 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-08-13 00:00:00",
              "TrainingReviewDate": "2018-02-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer Based Training (CBT)",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": "Operating Procedure Review",
              "MaintenanceReviewDate": "2018-04-24 00:00:00",
              "EquipmentInspectionDate": "2018-06-12 00:00:00",
              "EquipmentTested": "Engine Inspection and Maintenance",
              "ComplianceAuditDate": "2018-05-17 00:00:00",
              "AuditCompletionDate": "2018-08-17 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2018-05-17 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000057136,
                  "PreventionProgram2ID": 1000055937,
                  "ProcessChemicalID": 1000111712
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000071296,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-08-07 00:00:00",
    "ERTrainingDate": "2018-02-14 00:00:00",
    "CoordinatingAgencyName": "Jones County Emergency Operation Ce",
    "CoordinatingAgencyPhone": "6014283187",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000071296,
      "SummaryText": "American Midstream Partners, LP\n\nVenture Glades Gas Plant\n\nLaurel, MS\n\nEXECUTIVE SUMMARY\n\n\n\nIntroduction and Policies\n\nVenture Glades Gas Plant, owned and operated by American Midstream Partners, LP (\"American\n\nMidstream\") is committed to safety and environmental excellence. This philosophy involves making each and every employee and contractor accountable for their own safety as well as that of the community around them. As a company, we follow a close adherence to all applicable federal, state and\n\nlocal laws to ensure a safe and healthy environment for all.\n\n\n\nEmployees who enter the Venture Glades facility complete a thorough training, both in the classroom and on-the-job, that enables them to address emergency issues as they arise. This preparation includes standard operational, emergency operational, and release prevention training. In addition, periodic refresher courses help to keep operators' problem-solving abilities up to date and in sync with our recurring safety improvements. Our regular internal audits provide an excellent checks and balances system for monitoring our high standards.\n\n\n\nThe Venture Glades Gas Plant is operated by American Midstream. The plant is a natural gas liquid (NGL) extraction processing facility with NGL mixture and NGL storage and sales to wholesale markets. The facility consists of an NGL storage tank with it's associated pipeline, valves, pumps, and compressors on site. Natural gas liquids and natural gas are the regulated substances handled in this facility. The facility is classified as Program Level 2 under the regulation. The purpose of this Risk Management Plan (RMPlan) is to provide information about our operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans in case an accidental release should occur, our 5-year accident history.  \n\n\n\nPrevention Program\n\nThe following is a summary of the accident prevention program in place at the Venture Glades Gas\n\nPlant. Because"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000071296,
      "SummaryText": " the processes at the plant regulated by the Environmental Protection Agency's (EPA's)\n\nRisk Management Program (RMP).  This summary addresses each of the RMP Level 2 elements and describes the management system in place to implement the accident prevention program.\n\n\n\n\n\n&#8195;\n\nProcess Safety Information: Complete and accurate written process safety information (PSI) concerning process chemicals, process technology, and process equipment is essential to an effective RMP program and to completing and maintaining a Hazard Review. The PSI will be useful to the operators; the team performing the HAZARD REVIEW; those in charge of training; contractors; those in charge of updating the emergency preparedness plans. Process safety information is readily available to all employees. The Venture Glades Gas Plant keeps a variety of technical documents used to help maintain safe operation of the process. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. Chemical-specific information, including exposure hazards and emergency response / exposure treatment considerations, is provided in safety data sheets (SDSs).\n\n\n\nHazard Review: The Venture Glades Gas Plant has a comprehensive program to help ensure hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure adequate controls are in place\n\nto manage these hazards. The facility primarily uses the What-if method analysis technique to perform these evaluations. The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of\n\nthe process, as well as accident prevention and mitigation measures, when deemed necessary.\n\n\n\nPeriodic reviews are conducted at least every 5 years and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000071296,
      "SummaryText": "will be conducted at this frequency until the process is no longer operating.\n\n\n\nOperating Procedures: The Venture Glades Gas Plant maintains written procedures that address various modes of process operations, such as startup, normal operations, temporary operations, emergency shutdown, normal shutdown, and initial startup of a new process. These procedures provide guidance for experienced operators and also provide the basis for training new operators. Operating procedures are periodically reviewed and annually certified as current and accurate. The review and certification process involves both operators and technical staff.\n\n\n\nTraining: In addition to training on operating procedures, the facility has a comprehensive training program for all employees involved in operating the process. New employees receive basic training on the\n\noperating procedures to ensure their skills and knowledge are maintained at an acceptable level. This\n\nrefresher training is conducted at least every 3 years. All of this training is documented for each operator\n\nincluding the means used to verify the operator understood the training.\n\n\n\nContractors: Venture Glades uses contractors to supplement its workforce during periods for increased maintenance or construction activities. Because some contractors work on or near process equipment, the gas plant has procedures in place to ensure contractors (1) perform their work in a safe manner, (2) have appropriate skills, (3) are aware of the hazards of their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site specific safety rules, and (6) inform gas plant personnel of any hazards they encounter during their\n\nwork. This is accomplished by providing contractors with orientation sessions pertaining to these key points.\n\n\n\nMaintenance Program: The Venture Glades facility has well established practices and procedures for maintaining process equipment. The basic aspects of this program include ("
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000071296,
      "SummaryText": "1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting equipment deficiencies when identified, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process.\n\n\n\nSafe Work Practices: American Midstream has long standing safe work practices in place to help ensure worker and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark- producing activities (i.e. hot work),\n\nand (5) a permit and procedure to ensure adequate precautions\n\nare in place before entry into a confined space. These procedures (and others), along with training of\n\naffected personnel, form a system to help ensure operations and maintenance activities are performed\n\nsafely.\n\n\n\nIncident Investigation: The Venture Glades Gas Plant promptly investigates all incidents that resulted in or reasonably could have resulted in, a fire/explosion, major property damage, environmental loss, or personal injury. The goal of each investigation is to gather the facts, determine the root cause, and develop corrective action to prevent the reoccurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to\n\nprevent a reoccurrence, and forwards these results to the business management team for resolution.\n\n\n\nCompliance Audits: To help ensure the accident prevention program is functioning properly, the Glades\n\nCrossing Gas Plant periodically conducts an audit to determine whether procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. Both hourly and "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000071296,
      "SummaryText": "staff personnel participate as audit team members. The audit team develops findings that are forwarded to Venture Glades Gas Plant management for resolution.\n\nCorrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\n\n\nFive-year Accident History\n\nThe Venture Glades Gas Plant has no history of releases of listed Hazardous\n\nSubstances which have resulted in onsite or offsite effects. American Midstream places daily\n\nemphasis on our prevention and safety programs to ensure an incident-free record continues.\n\n\n\nEmergency Response Program\n\nIn the event of an emergency involving our natural gas liquid extraction facility, it is our policy to\n\nfollow our Emergency Action Plan, which is linked with the Jones County Emergency Operations\n\nCenter (EOC) Emergency Response Plan. Activation of this emergency response plan sets in\n\nmotion a pre-planned series of events that notify all area emergency response agencies. Emergency response agencies are notified on the 911 system and directly. All agencies and personnel respond to predetermined staging areas with representatives from each agency reporting to the Central Command\n\nPost (CP). A contingency plan is developed and executed using trained industry\n\npersonnel along with other emergency response personnel from responding agencies, as needed.\n\nEmployees of this facility are issued individual copies of the Emergency Action Plan when initially\n\nhired. All of the operators at this facility have had the appropriate emergency response training as mandated by the OSHA standard.\n\n\n\n"
    }
  ]
}