{
  "FacilityID": 1000105373,
  "FacilityName": "Brooklyn Bedding, LLC",
  "FacilityStr1": "5301 W. Bethany Home Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Glendale",
  "FacilityState": "AZ",
  "FacilityZipCode": "85301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.5226057",
  "FacilityLongDecDegs": "-112.174373",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 963440651,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Brooklyn Bedding, LLC",
  "OperatorStr1": "5301 W. Bethany Home Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Glendale",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85301",
  "OperatorZipCodeExt": null,
  "FTE": 370,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000251032",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-05-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-05-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-05-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-05-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-05-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000131561,
      "AltID": "Flexible Foam Mfg.",
      "FacilityID": 1000105373,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000164987,
          "ProcessID": 1000131561,
          "ChemicalID": 77,
          "Quantity": 198080.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000132994,
          "ProcessID": 1000131561,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000105373,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-04-30 00:00:00",
    "ERTrainingDate": "2023-04-06 00:00:00",
    "CoordinatingAgencyName": "Maricopa County LEPC",
    "CoordinatingAgencyPhone": "6022731411",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000105373,
      "SummaryText": "immediate care and instructions for follow-up medical care when necessary.   The plan addresses training requirements for employees including production employees, supervisors, managers, and operators.  Evacuation drills are an important part of the training.  \nIn Brooklyn Bedding’s Emergency Response policy, employees who have been trained as Hazmat Team/First Responders will respond.  For all other releases Brooklyn Bedding will rely on off-site responders (e.g., the fire department, off-site emergency response contractor to support the efforts of the in-house Hazmat Team). \n\nPLANNED CHANGES TO IMPROVE SAFETY\nBrooklyn Bedding, under the RMP program, as well as the EPCRA Tier II reporting programs, has organized its management system to effectively address all hazards and potential risks.  Both the advanced planning aspects of process design, operating procedures, emergency prepared-ness, and the operational elements of system maintenance, safe operating practices and ongoing personnel training are necessary to support a continual improvement in facility safety.  These programs are all documented so that needed information about the safe handling of all chemicals present at the facility is continuously available to employees and can be readily interpreted by emergency response team staff and the Site Emergency Coordinator when questions arise from public safety officials on potential risks to the community.  These features of the RMP and the integrated risk management program at this site lead to operations that are safe today but will be even safer tomorrow."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000105373,
      "SummaryText": "help facilitate a safe shutdown.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nBrooklyn Bedding management realizes that implementation of appropriate administrative and technological safeguards ensures the safety of the workers and the continued safety of the public.  The safety prevention programs described in the following section represent integrated administrative controls intended to ensure the safety of workers, the public, and the environment.   Those applicable safeguards that are in place and serve to help prevent, detect, or mitigate accidental releases of TDI/MDI are summarized in the Table below:\nRelease Detection/Back Up Power\nProcess Alarms (DOD), Emergency Generator\nRelease Containment & Control\nValves to permit isolation of the process\nAutomated shutdown systems for specific process parameters, high Pressure , high temperature \nDiking\nRedundant Equipment \nRelief Valves\nRelease Mitigation\nProcess Controls for TDI/MDI\nFire Extinguishing systems\nTrained Emergency Response Team\nPPR\nFIVE-YEAR ACCIDENT HISTORY \nBrooklyn Bedding, LLC had no reportable accidental chemical releases in the last five years.\n\nEMERGENCY RESPONSE PROGRAM\nIt is the policy of Brooklyn Bedding to place the highest priority on employee safety and health and on protection of the community from all plant-induced environmental conditions.  An emergency response plan has been developed to provide protection by providing prompt action to control an emergency and minimize the amount of toxic material released and lessen or eliminate the hazards to employees and the community. Prompt internal and external communications, emergency equipment, and trained personnel are the key ingredients of this plan.  Brooklyn Beddings policy provides for external communications with local and county-wide response agencies. \n\nThis plan includes procedures for evacuations, notifying responders and governmental agencies.  The plan also includes first aid procedures for"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000105373,
      "SummaryText": "THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT BROOKLYN BEDDING, LLC \nBrooklyn Bedding, LLC is committed to being a responsible member of the community in which it operates by giving top priority to operating in a safe and environmentally sound manner. Brooklyn Bedding is committed to complying with all the regulatory requirements of the EPA Risk Management Program and the Accidental Release Prevention Program.  Brooklyn Bedding has developed their Risk Management Plan to document policies addressing the implementation of these regulations.  These policies pertain to management systems and emergency response and include the Hazard Assessment (Offsite Consequence Analysis) Report. \n\nA DESCRIPTION OF OUR FACILITY & THE REGULATED SUBSTANCES HANDLED \nThe Brooklyn Bedding facility is a state of the art American-made manufacturer of mattresses, and foam manufacturing (pouring) facility.  The entire facility is fenced and gated.   \nThe chemicals below are used in the foam pouring operation: \n•\tTDI (Voranate T-80) Toluene Diisocyanate CAS-26471-62-5- CAS-584-84-9- CAS-91-08-7 \n•\tMDI (Papi 23 High Airflow Isocyanate) 1016-87-9- 101-68-8\nThe facility has one storage (1) tank (19,808 gallons) of TDI (Voranate T-80), and one (1) storage tank (19,808 gallons) of MDI (Papi 23 High Airflow Isocyanate).  These 2 tanks are stored together in a tank room with a substantial containment area built into the room.  The covered and contained tank truck unloading area is at a slope and has a drain to a 12,896-gallon secondary containment tank. \nThe plant has also installed the latest technology from DOD Technologies, Inc. Innovative Life and Safety Systems, and Services to monitor the air in our foam pouring department.  We have installed 4 air monitors to monitor TDI, and 1 air monitor to monitor CO2 that are attached to our fire alarm system.  \nIn the event of a power loss to the building we have an emergency generator that will power the foam pouring department and"
    }
  ]
}