{
  "FacilityID": 1000060418,
  "FacilityName": "Omaha Steaks \"F\" Street Plant",
  "FacilityStr1": "9203 \"F\" Street",
  "FacilityStr2": null,
  "FacilityCity": "Omaha",
  "FacilityState": "NE",
  "FacilityZipCode": "68127",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31055",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "41.217602",
  "FacilityLongDecDegs": "-096.055991",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.Omahasteaks.com",
  "FacilityEmailAddress": "bethf@omahasteaks.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Omaha Steaks International Inc.",
  "Company2Name": "N/A",
  "CompanyDUNS": 749009692,
  "Company2DUNS": 0,
  "OperatorName": "Omaha Steaks",
  "OperatorStr1": "11030 \"O\" Street",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68137",
  "OperatorZipCodeExt": null,
  "FTE": 220,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155636",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-05-03 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-10-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-10-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-10-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-10-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.21946,
  "FRS_Long": -96.05524,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000075467,
      "AltID": null,
      "FacilityID": 1000060418,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000093321,
          "ProcessID": 1000075467,
          "ChemicalID": 56,
          "Quantity": 21989.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000076649,
          "ProcessID": 1000075467,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000063431,
              "Process_NAICS_ID": 1000076649,
              "SafetyReviewDate": "2016-09-02 00:00:00",
              "PHA_Date": "2016-09-07 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-04-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Detectors in Freezers, Coolers, Processing Areas & Engine Room",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-05-02 00:00:00",
              "TrainingReviewDate": "2016-04-18 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-05-02 00:00:00",
              "EquipmentInspectionDate": "2016-09-10 00:00:00",
              "EquipmentTested": "Flash Gas Eliminator",
              "ChangeMgmtDate": "2016-07-22 00:00:00",
              "ChangeMgmtReviewDate": "2013-02-27 00:00:00",
              "PreStartupReviewDate": "2016-09-10 00:00:00",
              "ComplianceAuditDate": "2016-08-16 00:00:00",
              "AuditCompletionDate": "2017-04-01 00:00:00",
              "IncidentInvestigationDate": "2016-07-22 00:00:00",
              "InvestigationChangeDate": "2016-09-10 00:00:00",
              "ParticipationPlansReviewDate": "2013-10-07 00:00:00",
              "HotWorkPermitReviewDate": "2016-09-16 00:00:00",
              "ContractorSafetyReviewDate": "2016-08-01 00:00:00",
              "ContractorSafetyEvalDate": "2016-07-21 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000077810,
                  "PreventionProgram3ID": 1000063431,
                  "ProcessChemicalID": 1000093321
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000060418,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2016-07-20 00:00:00",
    "ERTrainingDate": "2016-09-16 00:00:00",
    "CoordinatingAgencyName": "Omaha Fire Department",
    "CoordinatingAgencyPhone": "4022225700",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060418,
      "SummaryText": "Omaha Steaks International\n\n9203 F Street\n\nOmaha, NE\n\nRefrigeration System Risk Management Program\n\n\n\nExecutive Summary\n\n\n\nThis is to inform all interested persons that Omaha Steaks International is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals. Omaha Steaks promotes overall plant, worker, and public safety through various programs.  These programs enable our facility to prevent the occurrence and minimize the consequences of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.   Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.  Our safety programs are applied to any activity involving hazardous chemicals including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  \n\n\n\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\n\n\n\nOmaha Steaks International is a meat processing plant located in Omaha, NE.  Anhydrous ammonia is the refrigerant used in the mechanical refrigeration process to keep rooms and products at their proper temperatures.  The ammonia refrigeration system is operated as a two-stage system.  On the low stage portion of the system, low temperature accumulators operate at -30?F and pump liquid to freezer evaporators located in the facility.  The freezers are designed to maintain -10?F room temperatures.  The low temperature ammonia"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060418,
      "SummaryText": " liquid flows through the evaporator coils where it picks up heat from the product, changing the ammonia from a liquid to a vapor.  The low-pressure ammonia vapor is sent from the evaporators to the accumulators via a suction header.\n\n\n\nVapor from the low temperature accumulators is fed to low stage compressors. The compressed vapor from the low stage compressors is sent to high temperature accumulators operating at +10?F.  The high temperature accumulators pump liquid to various cooler, dock and processing evaporators.  The high temperature ammonia liquid flows across the evaporator coils where it picks up heat from the product, changing the ammonia from a liquid to a vapor.  The low-pressure ammonia vapor is sent from the cooler, processing, and dock units to the accumulators via a suction header.\n\n\n\nVapor from the high temperature accumulators is then fed to the high stage compressors.  During the compression phase in the high stage compressors, the temperature of the ammonia vapor will rise as the pressure of the ammonia vapor is increased to approximately 150-180 psig. The high-pressure ammonia vapor flows from the high stage compressors to evaporative condensers where heat is removed, turning the vapor into a high pressure liquid.  The high-pressure liquid is collected in a high-pressure receiver.  The liquid collected in the high-pressure receiver provides liquid make-up for the accumulators.\n\n\n\nThe emergency response plan at Omaha Steaks International requires all associates to be trained in safe evacuation and notification procedures in cases of actual or drill emergencies. Training shall include escape routes, notification of appropriate response agencies, instructions on activating a building fire alarm system and what should be done after evacuating a building. Safety Evacuation Drills are conducted regularly, and periodically in close cooperation with the Special Operation Unit of the Local Fire Department (HAZMAT). \n\n\n\nUpon discovering an emergency sit"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060418,
      "SummaryText": "uation, all employees shall immediately notify their supervisor, the maintenance supervisor or the plant management.  The facility is protected against an Ammonia release emergency by ammonia sensors, which are placed, in the freezers, in the production area and in the coolers. These sensors are tied into SEI's (the Alarm Company) Monitoring Center, and will warn at 25 and activate the alarm at 35 PPM of ammonia. If the ammonia detection system is activated, the building is evacuated and the Maintenance Person on duty will immediately try to determine the location of the release. \n\n\n\nAll employees, visitors, contractors, etc., inside the building, will evacuate the building immediately. Generally, employees will leave the facility through the nearest exit, and proceed to the predetermined assembly point. Once there, a complete headcount will be taken to ensure that all personnel have been evacuated. Employees will receive further instructions from their Supervisor or Manager.\n\n\n\nThe Administrative Coordinator or designated employee will conduct the headcount. If the emergency evacuation of the facility takes place after 3:30 PM, the Warehouse Coordinator will be responsible for the roll call. Facility Management, together with Facility Maintenance, will decide if circumstances require the assistance from the Fire Department. As a general rule if the level of ammonia is over 200 PPM, the Maintenance Supervisor, or designate will call 911.\n\n\n\nLoTemp Employees, the facility's ammonia maintenance contractors, who would be alerted in this situation, would be met by the Maintenance Supervisor, or his designate, outside the building on the front drive. The situation will be evaluated before anyone enters the building. An ammonia detector would be used, to establish the PPM level.\n\n\n\nIn response to an ammonia release, Omaha Steaks International employees will not respond to releases of hazardous chemicals in an offensive manner. The facility does not have any employees trai"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000060418,
      "SummaryText": "ned at the HAZMAT Technicians or First Responders Operations Level.  However, in the case of a minor ammonia release, designated maintenance and/or contract personnel are allowed to isolate or maintain the release.\n\n\n\nOmaha Steaks International has not had any accidental releases to report in the last five years.\n\n\n\nThe release of ammonia is unlikely for the following reasons:    \n\n?    Worst case weather conditions are uncommon,\n\n?    Industry standards for the manufacture and quality control of pressure vessels\n\n?    Ammonia is not corrosive in this service\n\n?    Pressure safety valves limit operating pressure in this vessel\n\n?    The accident prevention program in place at the facility including the mechanical integrity program for regular maintenance, inspection and testing and replacement of equipment, if necessary\n\n?    Installed ammonia sensors in the system to warn of leaks\n\n?    Alarms in place to warn operating personnel of process upsets\n\n?    The emergency action plan and equipment in place at the facility\n\n\n\nOmaha Steaks' planned changes to improve safety include:\n\n?    Review of previous incidents and siting issues in future PHA\n\n?    Completing tracking sheets of various PHA and/or Compliance Audit issues\n\n?    Incorporating safety precautions such as exposure prevention, PPE, addressing hazards, controls and any other safe work practices in the Standard Operating Procedures\n\n?    Revising incident investigation forms\n\n?    Continually communicating with refrigeration contractor as to any incident investigation findings and resolutions\n\n"
    }
  ]
}