{
  "FacilityID": 1000029438,
  "FacilityName": "Nash Finch Company - Cincinnati Ohio Facility",
  "FacilityStr1": "6300 Creek Road",
  "FacilityStr2": null,
  "FacilityCity": "Cincinnati",
  "FacilityState": "OH",
  "FacilityZipCode": "45202",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39061",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "39.262222",
  "FacilityLongDecDegs": "-084.361667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": "www.nashfinch.com",
  "FacilityEmailAddress": "kenneth.ford@nashfinch.com",
  "FacilityDUNS": 5439518,
  "ParentCompanyName": "Nash Finch Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nash Finch Company",
  "OperatorStr1": "7600 France Ave South",
  "OperatorStr2": null,
  "OperatorCity": "Edina",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55435",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tony Sizemore",
  "RMPTitle": "Maintenance Manager",
  "FTE": 126,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000179353",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-05-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-04-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-07-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-07-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-12-01 00:00:00",
  "DeRegistrationEffectiveDate": "2015-03-15 00:00:00",
  "AnniversaryDate": "2017-07-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 39.26222,
  "FRS_Long": -84.36167,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Sold facility",
  "_processes": [
    {
      "ProcessID": 1000035907,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000029438,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000036289,
          "ProcessID": 1000035907,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        },
        {
          "Process_NAICS_ID": 1000036290,
          "ProcessID": 1000035907,
          "NAICSCode": "42441",
          "_desc": {
            "NAICS_CODE": "42441",
            "NAICS_DESCRIPTION": "General Line Grocery Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043471,
          "ProcessID": 1000035907,
          "ChemicalID": 56,
          "Quantity": 16500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000543471,
          "ProcessID": 1000035907,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029438,
      "SummaryText": "The Nash Finch Cincinnati Distribution Center is committed to the protection of its employees and the surrounding community by safely managing all hazardous materials found on the premises. Policies and procedures are in-place to assist the staff with compliance with applicable hazardous materials rules and regulations. The Process Safety Management (PSM) Team at the facility is responsible to ensure appropriate procedures and safety measures are in-place to protect our employees and the surrounding community. The PSM Team is comprised of the Distribution Center Director, Maintenance Manager, and Safety Coordinator with assistance from the Senior Director Facility Services Engineer, Corporate EHS Manager and from the outside refrigeration contractor.\n\n\n\n    The facility is located in a commercial/residential area in Blue Ash a suburb in the northeast part of the City of Cincinnati. The facility consists of a warehouse house/distribution center and a truck maintenance facility.  The area around the facility consists of some commercial businesses and residential properties. The area to the north is predominantly residential in use. Industrial and commercial businesses adjoin the property to the east, south and west. The terrain is mostly flat and is characterized by green grassy areas and paved areas of asphalt and concrete around the facility.  The site has two storm water retention ponds: one located north of the truck shop and the second located north of the main warehouse.\n\n    \n\n    Nash Finch Cincinnati receives and stores grocery product for eventual distribution to Nash Finch and independent grocery stores in the Cincinnati area, southeast and central Ohio as well as nearby states. Grocery products include dry goods, frozen products as well as meat and other perishable items. The facility has a truck shop and fuel island that services and maintains the facility tractor trailers and provides fuel for their operational needs. The facility is connected to city water and s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029438,
      "SummaryText": "ewer services.\n\n    \n\n    Hours of operation are up to 24 hours per day, 7 days per week.  Personnel at the facility include a distribution center director plus administrative staff, warehouse staff and truck drivers. Headcount at the facility is approximately 126 associates (warehouse staff and drivers).\n\n\n\nPart of the facility is a cold storage warehouse for the storage of frozen and perishable food products. The refrigeration for this part of the facility is provided by an ammonia refrigeration system. The system contains approximately 16,500 pounds of anhydrous ammonia. In this system, ammonia is the heat transfer medium that is compressed, cooled through the use of evaporative condensers and distributed to cooling evaporators throughout the ammonia refrigerated parts of the facility to maintain appropriate temperatures for the products stored in each area.\n\n\n\nBecause of the use of hazardous materials on-site, the facility is regulated by federal and state hazardous material rules and regulations. The ammonia, diesel fuel and sulfuric acid (used in powered industrial truck batteries) are regulated under the Emergency Planning and Community Right-to-Know (EPCRA) regulations. The above ground use of petroleum products is regulated under Oil Pollution Prevention requirements (40 CFR Part 112) and as a result, the facility has a Spill Prevention Control and Countermeasure (SPCC) Plan. The Risk Management Plan (RMP) is required under the Chemical Accident Prevention Provisions under the Clean Air Act (40 CFR Part 68).\n\n\n\nFrom an occupational safety and health perspective the facility is covered by the OSHA Process Safety Management standard covering the management and use of the anhydrous ammonia on-site and is required to have an emergency response plan. Other OSHA rules such as lockout tagout, fall protection, confined space; powered industrial trucks, etc. also apply to the facility. \n\n\n\nThe ammonia refrigeration system is the process presenting the most risk to our emp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029438,
      "SummaryText": "loyees and the surrounding community. Safe guards in the form of computer control systems employing sensors and interlocks to shutdown the system in the event of an equipment malfunction or release of ammonia are built into the system. Alarm sensors are placed within the ammonia engine room (processing center) and throughout the facility to alert plant staff of any ammonia releases within the facility. Detailed emergency plans and procedures are in-place to warn our employees and the surrounding community in the event of a release. \n\n\n\nAs of the date of this RMP Plan update, there have been no significant ammonia releases from the facility since Nash Finch acquired the operation in 2002. Incident investigation procedures are in-place to ensure any future release is thoroughly investigated to determine the \"root cause\" of the incident and to ensure appropriate corrective action is implemented quickly and efficiently.\n\n\n\nThe facility has a detailed emergency response program to handle fire, ammonia releases or natural disasters. All employees receive training during new hire orientation sessions and periodic refresher training to ensure they understand the facility emergency response procedures. Attachments to Part 6 of the Process Safety Management Plan provide detailed coverage of potential ammonia release scenarios and the appropriate actions in response to those scenarios. In the event of an ammonia release, the employees are provided information over the facility public address system as to the nature of the release and instructions where they should assemble. Given the safety hazards of ammonia, the safest place maybe within the facility; if evacuation is necessary, the employees are given directions to the appropriate outdoor assembly point based on the direction of the wind. Evacuation drills are periodically held to ensure the employees are familiar with the emergency response procedures.\n\n\n\nAll rescues and emergency response activities are handled by the Blu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029438,
      "SummaryText": "e Ash Fire Department. Nash Finch Cincinnati employees are not trained to respond to ammonia releases and are instructed to evacuate from the affected areas and leave emergency response to the local authorities. The fire department periodically visits the facility to ensure they are familiar with the physical structure and the hazards related to the chemicals used on-site.\n\n\n\n"
    }
  ]
}