{
  "FacilityID": 1000060463,
  "FacilityName": "U.S. Oil Houston North Terminal",
  "FacilityStr1": "12325 North Freeway",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77060",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": null,
  "FacilityLatDecDegs": "29.948538",
  "FacilityLongDecDegs": "-95.417688",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "U.S. Venture, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 23291586,
  "Company2DUNS": 0,
  "OperatorName": "U.S. Venture, Inc.",
  "OperatorStr1": "425 Better Way",
  "OperatorStr2": null,
  "OperatorCity": "Appleton",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54915",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "PSM-RMP Coordinator",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000230163",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-01-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-01-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-01-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-01-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000075567,
      "AltID": "Butane Storage/Blending",
      "FacilityID": 1000060463,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000076749,
          "ProcessID": 1000075567,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000093454,
          "ProcessID": 1000075567,
          "ChemicalID": 118,
          "Quantity": 270000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000593454,
          "ProcessID": 1000075567,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060463,
      "SummaryText": "The U.S. Venture, Inc. - U.S. Oil Houston North Terminal recognizes Safety Management as an essential element in providing a safe and secure place of employment for our associates, the public, and the environment. The corporate core values championed by our President, embraced by our Senior Leadership Team, encouraged by our Managers/Supervisors and pledged to our associates are: a) Caring Relationships, b) Entrepreneurial Spirit, c) Strategic Foresight, and d) High Performance. These four core values support our Safety and Health philosophy and management efforts. Interpersonal communications, problem solving, planning and safety achievement have a direct relationship with the core values when applied to safety training, hazard assessment/investigation, post-accident/incident recovery and generating solutions to potential risk exposures. U.S. Venture integrates Safety expectations as a part of Manager/Supervisors' responsibilities in order to create a meaningful daily presence during all work activity. All departments at the corporate level including Risk Management, Legal, Human Resources, Finance and Operations reinforce strategic safety planning and solid operation level decision-making that will reduce risk exposures.\n\n\n\nThe U.S. Oil Houston North Terminal is located on seven acres in an industrial area in Houston, TX.  The facility is a bulk petroleum terminal that stores refined petroleum products, including denatured ethanol, unleaded gasoline, low sulfur diesel, and fuel additives, in various tanks with capacities ranging from 5,880 to 840,000 gallons.  These products are brought in via truck or pipeline and shipped out via truck.  In addition, the terminal stores butane supplied by truck transports in two 30,000 gallon pressure vessels that is then transferred via piping and associated equipment on site and blended into gasoline.  The quantity of butane that is stored onsite exceeds the 10,000 pound threshold quantity, thus subjecting the facility to RMP r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060463,
      "SummaryText": "equirements.\n\n\n\nThe U.S. Oil Houston North Terminal regulated butane process complies with National Fire Protection Association (NFPA) 58 for Liquefied Petroleum Gas (LPG) Storage and Handling, and it is the facility's policy to adhere to all applicable federal, state, and local laws/codes including Texas Administrative Code for LPG Installations, OSHA's Process Safety Management (PSM) rule, and DOT's Hazardous Materials regulations.  The Railroad Commission of Texas and Houston Fire Department have approved the installation of the system.  If an emergency were to occur, it is the facility's policy to notify the Houston Fire Department by calling 911, which may trigger involvement by Harris County Emergency Management as necessary.  \n\n\n\nU.S. Oil has an outstanding safety record, and to date, has not had an accident involving butane that has resulted in death, injury, property/environmental damage, evacuations or sheltering in place.\n\n\n\nIn the event of an accidental release of butane at the U.S. Oil Houston North Terminal butane system, Terminal Emergency Response Personnel have been trained to immediately activate an emergency shutdown device (ESD) at one of four locations depending on location of the release and is the policy of the terminal to initially contact the Houston Fire Department and request their assistance (via 911).  The facility emergency response plans are coordinated with the Houston Fire Department and Harris County Emergency Management.\n\n\n\nWhen an ESD is activated and the alarm is not acknowledged within 20 seconds, CEC (Terminal Security Company) will be notified and a representative will call the terminal phone in response to confirm whether there is an actual emergency.  If there is no answer at the terminal to confirm whether help is needed, CEC will contact the terminal's on-call number.  CEC will continue calling terminal associates until they are able to speak with somebody in person to communicate the situation (they will not leave a voice"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060463,
      "SummaryText": " message).\n\n\n\nPlanned changes to improve safety include implementing a web based notification system (SmartNotice) to enhance internal and external communication in the event of an emergency.  During an emergency, the notification system can be used to communicate critical information including security threats, fires, and chemical releases to local Houston businesses, the Houston Fire Department, and Harris County Emergency Management.\n\n\n\nThe SmartNotice service will be capable of reaching out to people in minutes.  During an emergency situation, facility trained personnel will be able to send out a notification from the web or call a 24/7 phone number staffed by Emergency Communications Network (ECN), the provider of SmartNotice, who will facilitate sending out the message on U.S. Oil's behalf.  Notifications can be sent via email, text, and/or phone depending on each individual preference.\n\n"
    }
  ]
}