{
  "FacilityID": 1000008089,
  "FacilityName": "Criterion Catalysts &Technologies L.P. - Pittsburg",
  "FacilityStr1": "2840 Willow Pass Road",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "94565",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06013",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "38.028333",
  "FacilityLongDecDegs": "-121.943056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 186283909,
  "ParentCompanyName": "Shell Global Solutions",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dave Olund",
  "OperatorStr1": "P.O. Box 5159",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94565",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff Luengo",
  "RMPTitle": "HSSE Advisor",
  "FTE": 64,
  "OtherEPAFacilityID": "94564CRTRN2850W",
  "EPAFacilityID": "100000111032",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "A0227",
  "SafetyInspectionDate": "2011-07-13 00:00:00",
  "SafetyInspectionBy": "Contra Costa County Health Services - Haz Mat Div",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.02688,
  "FRS_Long": -121.94337,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009337,
      "AltID": "Aqueous Ammonia AST",
      "FacilityID": 1000008089,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000009599,
          "ProcessID": 1000009337,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000010547,
          "ProcessID": 1000009337,
          "ChemicalID": 57,
          "Quantity": 160000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000510547,
          "ProcessID": 1000009337,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008089,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\n\n\nThis document is a modified revision to the Risk Management Plan (RMP) dated June 2006 presented to the Contra Costa County Health Services Department (CCCHSD)  for the Criterion Catalysts and Technologies L.P. (Criterion) facility at 2840 Willow Pass Road in Pittsburg, California.  It fulfills the requirements to submit an RMP under the California Accidental Release Prevention (CalARP) Program.   Criterion qualifies for Program Level 1 under the Environmental Protection Agency (EPA) RMP and CalARP regulations.\n\n\n\nThis revised RMP summarizes the accidental release prevention and emergency response policies at Criterion that minimize the public's exposure to regulated substances used at the facility.  Included is a description of the hypothetical worst-case accidental release of aqueous ammonia (29% maximum concentration) from a 20,500 gallon above-ground storage tank (AST). The process for which aqueous ammonia is used is also presented.  Passive mitigation equipment has been installed around the AST to minimize the surface area for evaporation during a spill.\n\n\n\nVanadium pentoxide, included in the RMP submittal dated June 2006, is no longer used at the Criterion facility in Pittsburg and is excluded in this revised RMP.\n\n\n\n1.1 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \n\n\n\nSince Criterion is ISO 9001 certified, there are several programs in place designed to maintain the safe operation, installation, and modification of process equipment at the facility, and to minimize errors and accidents. Criterion is committed to being a responsible member of the community by operating in a safe and environmentally sound manner. This commitment is documented in the company's policy on health, security, safety and environmental (HSSE) performance.  Included in this policy are the following statements:\n\n\"Criterion and Criterion's parent companies CRI/Criterion and Shell Oil are committed to:   \n\n?    Pursue the goal of no harm to people\n\n?"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008089,
      "SummaryText": "    Protect the environment\n\n?    Manage HSSE matters as any other critical business activity\n\n?    Continuously improve our HSSE Performance\n\n?    Be recognized to be among the best in our industry in HSSE performance\n\n?    Promote a culture in which all CRI/Criterion and Shell Oil employees share these commitments\n\n    We believe that:\n\n?    All occupational illnesses, injuries and environmental incidents are preventable\n\n?    Each individual is personally responsible for their own safety and for following established practices and procedures\n\n?    Line Management is accountable for HSSE performance\"\n\n    \n\n    The HSSE Management System is designed to ensure compliance with the law and to achieve continuous performance improvement.\n\n     \n\n    The HSSE policy is implemented through Criterion's Management System which is designed to identify and manage risk. Although not subject to California's Occupational Safety and Health Administration (OSHA) Process Safety Management requirements, Criterion has developed several similar procedures to protect the health and safety of their workers, the public, and the environment. The following summarizes portions of the Management System that are most closely aligned with OSHA's Process Safety Management requirements:\n\n    \n\n    Management of Change\n\n    \n\n    Criterion has a Management of Change (MOC) procedure requiring a comprehensive review of all proposed process changes. Projects including installation of new equipment must be evaluated by the appropriate department managers (e.g., technical, operations, maintenance, safety, and environmental). Written documentation of department approvals, hazard evaluation, changes in process and instrumentation drawings (P&IDs), and operating procedures are maintained. \n\n    \n\n    Pre-Startup Safety Review\n\n    \n\n    As part of the MOC process, Criterion requires that new or modified equipment meet all design requirements prior to operation. This review includes updating P&IDs, employee/contractor training, documenting operating/maintenance/safe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008089,
      "SummaryText": "ty/emergency procedures, environmental permits, chemical information (including material safety data sheets [MSDS]), and information on technology/equipment.\n\n    \n\n    Contractors\n\n    \n\n    Criterion's contractor management program requires HSSE review of each contractor. All contractors are required to complete training on the hazards and emergency response activities at the facility prior to starting work. Contractor activities are monitored to verify safe work practices and appropriate training. \n\n    \n\n    Safety Work Permits/Hot Work Permits/Confined Space Permits \n\n    \n\n    All equipment installation and maintenance work requires use of a work permit process, including issuance of safety work permits for general work, hot work permits, and confined space permits when applicable. Each Safety Work Permit identifies the work to be performed, equipment involved, precautions to be taken, dates, and authorized signatures. For Hot Work Permits, fire prevention measures are also included. Criterion staffs a confined space rescue team, which must be present during confined space entries. Copies of all permits are maintained.\n\n    \n\n    Training\n\n    \n\nTo ensure that processes are operated by competent individuals, training is a key component of Criterion's Management System. Initial training is given to employees at the time of hire. Subsequent training is given when there has been a change to relevant systems. On-the-job-training qualification is required for each operator. \n\n    \n\n    Incident Investigation\n\n    \n\n    Each HSSE incident or near miss incident involving an RMP/CalARP material is analyzed and evaluated to determine the underlying cause(s). A Root Cause Analysis (RCA) is conducted and appropriate corrective actions to prevent recurrence are determined.  Risk analysis is used to prioritize established actions and records are maintained to track these actions to completion.\n\n    \n\n    Process Safety Information\n\n    \n\n    Criterion maintains copies of all MSDS for all raw materials and substances used at the "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008089,
      "SummaryText": "facility. A list of maximum inventory and largest container s for all regulated substances is maintained. MSDS and inventory data is updated as necessary. MSDS's are maintained electronically on the network drive to allow access to all employees and also with two hard copies (Guard Shack and HSSE Department). Inventory information (i.e., Business Plan) is maintained at the HSSE department. \n\n    \n\n    Process Hazard Review\n\n    \n\n    As part of the Management of Change procedures at the facility, safety and operating hazards are evaluated for new or modified equipment. Appropriate personnel involved with the equipment operation, maintenance and safety participate in the hazard review. The review is designed to identify the hazards of the process, possible equipment failures, and safeguards to prevent failures or errors. Results of the hazard review, along with any design changes, are incorporated into the project.\n\n    \n\n    Operating Procedures\n\n    \n\n    Written procedures for aqueous ammonia and other bulk liquids are located in the H2 Plant Operating Procedures. Procedures include handling, off-loading, and tank line-up for ammonia service.\n\n    \n\n    Maintenance\n\n    \n\n    Criterion has a preventive maintenance/inspection program established for process equipment and tanks. Ultrasonic thickness (UT) testing is conducted on the aqueous ammonia tank. The passive mitigation vapor suppression balls are evaluated annually and replaced if necessary. Criterion's maintenance department conducts preventive maintenance to assure mechanical integrity of the aqueous ammonia tank & associated pumps. \n\n    \n\n    Compliance Audits\n\n    \n\n    Criterion's Management System includes a compliance auditing component made up of internal compliance audits as well as external assessments by Criterion's parent companies (CRI/Criterion and Shell). HSSE performance compliance issues are documented and require prompt follow up with action plans to prevent reoccurrence.\n\n    \n\n    Emergency Procedures\n\n    \n\n    Emergency procedures have been esta"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000008089,
      "SummaryText": "blished at the Criterion facility. These include response and management of any accidental release and/or injury that may pose an impact to the community. These procedures are included in the Hazardous Material Business Plan (HMBP) submission annually. Emergency response activities for RMP/CalARP and other hazardous materials are coordinated with the Contra Costa County Hazardous Material Team or the San Ramon Valley Hazardous Material Team. Emergency response activities for medical, rescue and other emergencies are coordinated with Contra Costa Fire, located two blocks from the facility.\n\n    \n\n    1.2 DESCRIPTION OF FACILITY \n\n    \n\nCriterion's Pittsburg facility manufactures a variety of catalysts for the oil manufacturing industry. Products manufactured are dry solids, containing alumina oxide, and other metals. The primary products are hydrotreating catalysts, an aluminum oxide based catalyst for petroleum refineries. Aqueous ammonia is the only regulated compound used above threshold quantities and is subject to EPA's RMP and CalARP programs.\n\n    \n\n    1.3 DESCRIPTION OF CHEMICAL USAGE \n\n\n\n    Figure 1 is a simplified block diagram illustrating the equipment connected in the aqueous ammonia process. One 21,300-gallon aqueous ammonia storage tank is located onsite.  There is an independent high level alarm set at 20,500 gallons, which will prevent more than 20,500 gallons being loaded into the tank. A maximum of 20,500 gallons (160,000 pounds) of 29% aqueous ammonia may be stored at ambient conditions and is used in two operations: manufacture of hydrotreating catalyst and air pollution control.\n\n    \n\n    Manufacture of Hydrotreating Catalyst\n\n    \n\n    Aqueous ammonia is used as a process material during the manufacture of hydrotreating catalyst and is pumped as a liquid into mixing equipment and blending tanks. Generally, the manufacture of hydrotreating catalysts can be described as the following process: \n\n    \n\n&#8195;\n\n1.    Raw materials (including aqueous ammonia) are mixed in a tank.\n\n"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000008089,
      "SummaryText": "2.    The reaction creates an intermediate product which is removed, dried in an oven, and subsequently dried in a kiln.\n\n3.    The intermediate product is infused with a metal salt solution (including aqueous ammonia), kiln dried, screened, and packaged.\n\n    \n\n    Air Pollution Control\n\n\n\n    Criterion also uses aqueous ammonia to reduce air emissions in selective catalytic reduction (SCR) air pollution abatement equipment. Criterion operates two SCR systems to reduce emission of nitrogen oxides (NOx). In these operations, aqueous ammonia is pumped to an ammonia skid at each SCR, filtered, vaporized, and subsequently injected into the process gas stream to convert NOx into nitrogen and water prior to discharge to the atmosphere. The ammonia is consumed in the process. \n\n    \n\n    1.4 THE WORST-CASE RELEASE SCENARIO\n\n    \n\n    Criterion's offsite consequence analysis (presented in the June 2006 RMP submittal) utilizes the EPA's 1996 RMP Offsite Consequence Analysis Guidance, and computer dispersion modeling to estimate impacts of potential worst-case scenario (WCS) from the aqueous ammonia and vanadium pentoxide processes. Vanadium pentoxide is no longer used at the facility and no changes have been made in aqueous ammonia storage and use.  Therefore, results from the June 2006 dispersion modeling submittal regarding aqueous ammonia are presented herein.  The Off Site Consequence Analysis from the June 2006 RMP submittal (reflecting aqueous ammonia only) is included in Appendix A.\n\n    \n\n    Aqueous Ammonia Process\n\n    \n\n    The WCS associated with the Criterion's aqueous ammonia process is the catastrophic failure of the aqueous ammonia storage tank resulting in the release of 20,500 gallons of 29% concentrated aqueous ammonia solution over a 10-minute period. In reality, this event is extremely unlikely since Criterion has many control measures in place preventing this type of event. The aqueous ammonia storage tank is located inside a concrete containment area, and any release would be contained wit"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000008089,
      "SummaryText": "hin the 800 square foot (ft2) diked area. In addition, the containment area is filled with small polypropylene balls that would float on top of the liquid surface, reducing the exposed surface area for evaporation by 90%, and resulting in an effective surface area for evaporation of 80 ft2.  \n\n    \n\n    According to EPA's 1996 RMP Offsite Consequence Analysis Guidance, using urban conditions and default values for 30% aqueous ammonia solution, the  distance to the toxic endpoint of 0.14 milligrams per liter (mg/L) (200 parts per million [ppm], ERPG-2 for ammonia) for the WCS is 0.06 miles (317 feet). This distance from the aqueous ammonia storage tank is within the property boundary, and there are no public receptors within 317 feet of the tank. The Criterion facility has not had an aqueous ammonia release meeting the accident history criteria for five years and emergency response procedures have been coordinated with local emergency planning and response organizations. Therefore, Criterion's aqueous ammonia process qualifies for Program Level 1 under the EPA RMP and CalARP regulations.\n\n    \n\n    1.5 THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS \n\n    \n\nCriterion management realizes the importance of establishing administrative and technological safeguards to ensure the safety of workers and the continued safety of public receptors. There are no current recommendations planned for implementation in this RMP plan. Section 1.8; Planned Changes to Improve Safety remains as a place holder for future ideas and plans. The safeguards shown in Table 1 include all the implement ideas for both administrative and technological safeguards that prevent, detect, or mitigate releases of aqueous ammonia.  \n\n\n\n1.6 THE FIVE-YEAR ACCIDENT HISTORY \n\n    \n\n    Criterion has not had any accidental releases involving aqueous ammonia or other extremely hazardous substances that resulted in deaths, injuries, or significant property damage onsite, or known offsite deat"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000008089,
      "SummaryText": "hs, injuries, evacuations, sheltering in place, property damage, or environmental damage. Criterion reviewed incident investigations from June 2006, the date of the previous RMP submittal. This five-year accident history review satisfies the requirements of Section 2750.9 of the CalARP regulation. The purpose of conducting an accidental release review is to promote an informed community while also documenting that accidental releases are investigated and concrete changes are made to protect against reoccurrence.\n\n    \n\n    Criterion has established procedures to investigate accidents and recommend changes to operations to minimize the likelihood that a similar accident might occur again. Although not required under Program Level 1 of the CalARP regulations, Criterion has voluntarily adopted many of the procedural requirements required for a Level 3 facility. These procedural requirements are highlighted under Section 1.1, Accidental Release Prevention and Emergency Response Policies at Criterion. \n\n    \n\n    1.7 THE EMERGENCY RESPONSE PROGRAM\n\n    \n\n    Criterion's emergency response program was developed to comply with Title 19 of California Code of Regulations (T19 CCR?2731, AB2185 Business Plan) and emergency action plan requirements under Title 8 of California Code of Regulations (T8 CCR?3220, HAZWOPER standard). Criterion has coordinated emergency response plans with local officials and satisfies the requirements of Section 2735.4(c)(3) of the CalARP regulation. \n\n    \n\n    Criterion has developed the emergency response program to minimize the effects of accidental releases of hazardous compounds to employees. Computer dispersion modeling, along with using the EPA's RMP Offsite Consequence Analysis Guidance document, has demonstrated that worst-case releases of aqueous ammonia would not impact any public receptor.  The site does not maintain an active hazardous material response team. Any Criterion employees associated with a large scale emergency response with contractors or outside "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000008089,
      "SummaryText": "agencies are only for administrative and coordination of the response and are considered a non-responders. Large scale emergency response scenarios involving aqueous ammonia (or any other hazardous material) are coordinated with Contra Costa County Health Services Hazardous Materials personnel and/or outside emergency response contractors. For very small spills that do not put employees or the community at risk, Criterion's personnel will use proper personal safety equipment as required by the material's MSDS.\n\n    \n\n    Criterion's emergency action plan contains detailed spill, injury, fire, and other emergency response procedures   as well as the performance of emergency training, evacuation, and notification.. The emergency action plan includes instructions and lists the telephone numbers of agencies and individuals that are to be contacted in the event of an emergency situation (e.g., fire, hazardous material spill, injury). The agencies and individuals to be contacted include emergency responders (e.g., Fire Department/Haz Mat Team), internal plant contacts (e.g., Plant Manager), and those required to request public notification sirens according to the following protocol:\n\n    \n\n1.    The Day Supervisor or Team Lead will determine the level of the incident.\n\na.    If the incident is a Level 2, the Day Supervisor or Team Lead will notify the Plant Manager or Operations Manager or HSSE to determine whether to sound the siren and/or order a SIP depending upon wind direction and the type of release and whether the downwind public could be impacted.\n\nb.    If the incident is a Level 3, the Day Supervisor or Team Lead will notify the Plant Manager or Operations Manager or HSSE that they will be notifying CCHS to sound the siren. \n\nc.    The Day Supervisor or Team Lead will then call CCHS and advise them to sound the alarm/SIP..\n\n2.    The operations supervisor will update CCHS at least once per hour for levels 2 (which required sounding the alarm or a SIP), or 3 until plant management arriv"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000008089,
      "SummaryText": "es.\n\n3.    If a unified incident command is created, they will take the lead communication with CCHS.\n\n4.    If no unified incident command is created, the Day Supervisor or Team Lead will have responsibility to communicate with CCHS.                                                                                                                                           \n\n    \n\n    \"Emergency Response Notification Forms\" are completed when notifying an agency and document when the telephone calls were placed and the name and position of the person contacted. All completed notification forms are maintained.\n\n    \n\n    CCCHSD performs a triennial audit of the RMP/CalARP programs, as well as periodic unannounced inspections of all areas in their jurisdiction (including RMP/CalARP) as the local CUPA. The Fire Department conducts annual inspections of Criterion's processes. Criterion has discussed the details of hazardous materials maintained onsite and mitigating measures available with CCCHSD personnel and the Fire Department. The emergency response program is reviewed annually to ensure that it remains accurate and current.  Employees are trained on the emergency response program when initially hired, after changes to the emergency response plan, and when employees' responsibilities are changed. Facility personnel are trained on safety issues and appropriate material handling procedures. \n\n    \n\n1.8 PLANNED CHANGES TO IMPROVE SAFETY \n\n    \n\n    Although facilities with Program Level 1 processes are not required to develop additional safety measures to prevent offsite impacts from accidental releases, Criterion is continually evaluating potential improvements to worker safety that could minimize a potential release of a hazardous material. Recommendations for improvement routinely come from safety meetings, equipment inspections, technology improvements and employee suggestions. There are no current planned changes to the ammonia system and Table 1 incorporates all the implemented ideas from pre"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000008089,
      "SummaryText": "vious plans. \n\n\n\n\n\n\n\n"
    }
  ]
}