{
  "FacilityID": 1000002615,
  "FacilityName": "Baker Petrolite Corporation - Barnsdall, OK",
  "FacilityStr1": "800 S. Birch Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "Barnsdall",
  "FacilityState": "OK",
  "FacilityZipCode": "74002",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40113",
  "LEPC": "Osage County LEPC",
  "FacilityLatDecDegs": "36.555565",
  "FacilityLongDecDegs": "-96.160423",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 72415037,
  "ParentCompanyName": "Baker Hughes",
  "Company2Name": null,
  "CompanyDUNS": 174987909,
  "Company2DUNS": 174987909,
  "OperatorName": "Baker Petrolite Corporation",
  "OperatorStr1": "P.O. Box 669",
  "OperatorStr2": null,
  "OperatorCity": "Barnsdall",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74002",
  "OperatorZipCodeExt": null,
  "FTE": 101,
  "OtherEPAFacilityID": "74002PTRLTBIRCH",
  "EPAFacilityID": "100000052113",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "98-107-TV",
  "SafetyInspectionDate": "2009-01-07 00:00:00",
  "SafetyInspectionBy": "Starr Tech Insurance Company",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-07-22 10:17:55",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.550658,
  "FRS_Long": -96.156243,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000003308,
      "AltID": "Ethylene-Polywax Prod.",
      "FacilityID": 1000002615,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000003590,
          "ProcessID": 1000003308,
          "ChemicalID": 95,
          "Quantity": 240000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000003591,
          "ProcessID": 1000003308,
          "ChemicalID": 129,
          "Quantity": 60000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000003409,
          "ProcessID": 1000003308,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000002194,
              "Process_NAICS_ID": 1000003409,
              "SafetyReviewDate": "2009-04-06 00:00:00",
              "PHA_Date": "2009-04-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-06-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Flamable vapor monitors",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-04-06 00:00:00",
              "TrainingReviewDate": "2009-04-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Training Within Industry (TWI)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-10-19 00:00:00",
              "EquipmentInspectionDate": "2009-04-17 00:00:00",
              "EquipmentTested": "Safety Relief Valves from Storage Vessels and Process Vessels",
              "ChangeMgmtDate": "2009-04-20 00:00:00",
              "ChangeMgmtReviewDate": "2009-02-18 00:00:00",
              "PreStartupReviewDate": "2009-03-22 00:00:00",
              "ComplianceAuditDate": "2007-07-21 00:00:00",
              "AuditCompletionDate": "2009-12-30 00:00:00",
              "IncidentInvestigationDate": "2009-05-06 00:00:00",
              "InvestigationChangeDate": "2009-05-10 00:00:00",
              "ParticipationPlansReviewDate": "2006-06-26 00:00:00",
              "HotWorkPermitReviewDate": "2009-05-01 00:00:00",
              "ContractorSafetyReviewDate": "2009-04-21 00:00:00",
              "ContractorSafetyEvalDate": "2006-06-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000002541,
                  "PreventionProgram3ID": 1000002194,
                  "ProcessChemicalID": 1000003590
                },
                {
                  "PrimaryKey": 1000002542,
                  "PreventionProgram3ID": 1000002194,
                  "ProcessChemicalID": 1000003591
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000002615,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-04-20 00:00:00",
    "ERTrainingDate": "2009-04-23 00:00:00",
    "CoordinatingAgencyName": "Barnsdall Fire Department",
    "CoordinatingAgencyPhone": "9188472255",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000002615,
      "SummaryText": "Executive Summary\n\nThe Baker Petrolite Corporation (BPC) facility located in Barnsdall, Oklahoma is subject to the U.S. Environmental Protection Agency's (USEPA's) Risk Management Program (RMP) for Accidental Release [40 CFR 68] because its ethylene polywax (EP) production process contains more than the threshold quantities (10,000 lbs each) of ethylene (CAS No. 74-85-1) and propylene (CAS No. 115-07-1). Ethylene and propylene are both flammable substances which are gases at ambient conditions, but are carefully stored under pressure as liquids at BPC. These monomers are the primary raw materials that are polymerized into the facility's final products (synthetic waxes). The final product, a synthetic wax (EP), is neither flammable nor toxic.\n\nA maximum inventory of 60,000 lbs of propylene can be on site at any one time in a single pressure vessel storage tank with dedicated piping to the EP process. Ethylene is stored in two large tanks and can be delivered to the process as a gas after passing through vaporizers in the feed system. A maximum of 240,000 lbs of ethylene can be in the process at anyone time, with up to 120,000 lbs present in a single storage tank.\n\nThe BPC facility utilizes standard operating procedures, training, administrative and engineering controls, and other safety practices to assure that ethylene and propylene are handled in a safe manner. There has not been a fire, explosion, or release event at the EP plant in the last five years which has impacted people or property in the City of Barnsdall. Details of the facility's extensive prevention program are summarized in Section 3.0.\n\n\nSafety Systems\n\nIn order to prevent potential releases and to reduce the severity of a release, should one occur, the EP process at the Barnsdall facility was designed with various safety systems, including process controls, process instrumentation, mitigation systems, and process area detectors.\n\nProcess controls and instrumentation include:\n\nVents, check valves, re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000002615,
      "SummaryText": "lief devices, and other manual and automatic shut-offs;\nProcess indicators and alarms throughout the process, many of which are interlocked with the shut-off valves;\nAn emergency air supply, emergency power, and back-up pumps; and\nA grounded electrical system, including, in some cases, spark/ explosion proof electrical equipment.\n\nMitigation systems include:\n\nExcess flow devices, quench and purge systems, and a fire -sprinkler system; and\nFire and blast walls in certain areas.\n\nIn addition, flammable vapor monitors are installed in critical locations in the process to detect even small releases and quickly respond to them.\n\nPrevention Program\n\nThe facility has carefully considered the potential for accidental releases of ethylene and propylene, such as the occurrence of the worst case and alternative case release scenarios described in Sections 4.0 and 5.0. To help minimize the probability and severity of a release, a prevention program for ethylene, propylene, and other chemicals used in the EP process was developed to satisfy the Occupational Safety & Health Administration (OSHA) Rule for Process Safety Management (PSM) of Highly Hazardous Chemicals [29 CFR 1910.119]. The key components of the prevention program are summarized below:\n\nThe development, documentation, and operator availability of critical process safety information regarding the hazards of the chemicals involved the design basis of the system, and the equipment. This information is used to fully understand and safely operate the process.\n\nThe development of an extensive employee participation program, which includes employees from all levels of the organization and from all areas within the plant (i.e., production and maintenance). This program also ensures that employees that are most knowledgeable about the EP plant process are able to effectively, and regularly recommend changes or improvements which enhance operating safety.\n\nThe performance of formal PHA on the various EP plant process systems"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000002615,
      "SummaryText": "using the \"HAZOP\" technique. A team with expertise in engineering, operations & maintenance, and safety evaluated the EP plant processes in depth and developed recommendations to improve the safety and operability of the system. The PHA addressed: (1) process hazards; (2) previous incidents; (3) engineering and administrative controls applicable to the process; (4) the consequence of control failure; (5) facility siting; (6) human factors; and (7) the qualitative evaluation of possible safety & health effects of control system failures. The PHAs resulted in procedures and/ or hardware recommendations to improve safety and operation of the system. Many of these recommendations have already been resolved. The PHAs are updated and revalidated every five years.\n\nWritten operating procedures (OPs) are used to provide the basis for proper and safe operation of the EP plant. The OPs include procedures for normal operations, start-up, shutdown, emergency operations, and emergency shutdown. They also include safe operating limits for temperature and pressure, consequences of operating outside these limits, and a description of safety systems and how they operate.\n\nEP plant operators receive refresher training at least every three years. The training content is based on the process safety information and OPs. The training program ensures that the operators understand the nature and causes of problems arising from the system operations and serves to increase awareness with respect to the hazards particular to the EP plant process.\n\nFormal authorization systems (i.e., management of change procedures and pre-start up safety review) are in-place to ensure that system changes or expansions are as safe as the original design and that an independent recheck confirms that the changes are consistent with the engineering design and in a condition to be safety operated prior to start-up.\n\nEvents that might (or did) cause an accidental or unexpected release are subjected to a formal inve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000002615,
      "SummaryText": "stigation. The objective of the investigation is to correct deficiencies in such a way as to prevent reoccurrence.\n\nContractors that are hired to work on or adjacent to the EP plant process are pre-qualified based on their knowledge of the system, understanding of the applicable codes and standards, and their demonstrated ability to work safely. In addition, these contractors are periodically evaluated to ensure that they continue to work safely.\n\nPrior to the performance of any \"hot work\" (i.e., spark- or flame- producing work such as welding, cutting, brazing, or grinding), unit supervisors must approve the work by executing a written Hot Work Authorization Permit to verify that the precautions to prevent fire have been implemented.\n\nPeriodic walk-throughs to find unusual or increasing vibration, incipient leaks, or other indications of potential upsets or failures that could lead to a release. All pressure relief valves are inspected and repaired or replaced periodically based on schedules developed by manufacturer recommendations or industry standards.  Mechanical ingrity inspections are conducted for major power equipment including, but not limited too, pumps, fans, bearings, -couplings, shaft seals, and mountings.  In addition, a regular inspection and calibration of temperature and pressure instruments, sensors, switches, and shutdown devices that have safety implications are conducted.\n\nAdherence to fire codes in preparation for fire, storms, or events which could impact the EP plant process.  Planning with the local fire department to ensure a rapid response to potential incidents with the system or external events such as floods or tornadoes.\n\nPrevention program compliance audits performed every three years to verify that appropriate management systems are in-place and are being properly implemented. Any deficiency found in an audit is corrected.  In addition, Process Safety Management (PSM) audits are conducted every 3 years.\n\nFive-Year Accident History"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000002615,
      "SummaryText": "There have been no accidental releases of ethylene or propylene at the BPC facility in the last five years that have resulted in death, injury, or significant property damage on-site or off-site death, injury, evacuation, sheltering in-place, property damage, or environmental damage.\n\nEmergency Response Program\n\nThe BPC Barnsdall, Oklahoma facility has implemented a detailed Emergency Response Plan (ERP). The ERP is intended to address all emergencies at the facility, in addition to incidents related to the release of ethylene or propylene. Moreover, the BPC facility has a trained emergency response team for handling releases of hazardous substances in accordance with OSHA 29 CFR 1910.120, Hazardous Waste Operations and Emergency Response. The facility also has a fire brigade and equipment to respond to internal fires. The hazardous materials technicians have received at least 24 hours of initial training, an 8-hour refresher, and have sufficient competency to implement the ERP and its procedures.\n\nThe ERP includes awareness and response training for employees, coordination with the local fire department, coordination with the Local Emergency Planning Committee (LEPC), and evacuation of the facility and surrounding area. The Plan details what personal protective equipment and spill response equipment is available; identifies specific individuals, their 24-hour telephone numbers, and their responsibilities; identifies procedures for emergency medical care; and refers to their pertinent elements of the management system (i.e., standard operating procedures and process safety information).\n\nPlanned Changes to Improve Safety.\n\nBPC Barnsdall and the BPC Corporate Office continually strives to improve procedures and equipment to ensure safety for our employees and our communities.  BPC Barnsdall will enhance and continually improve upon its process safety management and mechanical integrity program to eliminate potential hazards."
    }
  ]
}