{
  "FacilityID": 1000000450,
  "FacilityName": "Merchants Terminal Corporation-Baltimore",
  "FacilityStr1": "501 North Kresson Street",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21224",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24005",
  "LEPC": "Baltimore City Fire Dept.",
  "FacilityLatDecDegs": "39.295833",
  "FacilityLongDecDegs": "-076.561111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Hoffberger Holdings, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6950257,
  "Company2DUNS": 0,
  "OperatorName": "Merchants Terminal Corporation",
  "OperatorStr1": "501 North Kresson",
  "OperatorStr2": null,
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21224",
  "OperatorZipCodeExt": null,
  "RMPContact": "Curt Edmisten",
  "RMPTitle": "Director of Engineering",
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000040341",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-05-16 00:00:00",
  "SafetyInspectionBy": "Traveler's Insurance Company",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-04-18 00:00:00",
  "DeRegistrationEffectiveDate": "2014-04-11 00:00:00",
  "AnniversaryDate": "2014-05-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.29795,
  "FRS_Long": -76.56014,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility went out of business/sold on 06/15/2012.",
  "_processes": [
    {
      "ProcessID": 1000000568,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 1000000450,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000000597,
          "ProcessID": 1000000568,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000589,
          "ProcessID": 1000000568,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000500589,
          "ProcessID": 1000000568,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000450,
      "SummaryText": "See Attachment\nMerchants Terminal Corporation\nRisk Management Program\nExecutive Summary \n\n1. General accidental release and prevention policy of Merchants Terminal\n\nIn this frozen food distribution center we utilize anhydrous ammonia as a refrigerant. Anhydrous ammonia is considered hazardous by the Environmental Protection Agency. The same properties that make ammonia a valuable refrigerant also makes its necessary to observe certain safety precautions during its use to prevent exposure to our workers, the surrounding community and the environment. It is our policy at Merchants Terminal Corporation to implement the requirements of the Risk Management Program by managing and operating this facility in full compliance with all applicable federal and state regulations. The objective is to minimize the risk of an accidental ammonia release. Safety depends directly on our proper handling of ammonia. Our plant personnel have been trained on the equipment operating procedures and various safety devices that are incorporated in our facility to prevent the possibility of accidental releases.\n\n2.   Stationary source and regulated substance handles.\n\nMerchants Terminal Corporation, 501 N. Kresson Street, Baltimore, Maryland is responsible for the storage and distribution of various frozen food products. Merchants Terminal is located in an industrial area of suburban Baltimore. In addition to our facility the surrounding community houses other commercial businesses as well as residential areas. There are approximately 22 employees at this facility which includes hourly and salary personnel. This facility receives and prepares shipment of frozen and refrigerated food products via tractor trailers approximately 10 hours a day, five days a week.\n\nThe potentially hazardous chemical used at this facility is Anhydrous Ammonia. Ammonia in a liquid or vapor can be found in process equipment though out, piping and vessels throughout the facility. \n\nThe potential hazards that could lead"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000450,
      "SummaryText": " to an accidental release of ammonia include, but are not limited to, equipment failure, damage to piping, damage to equipment, human error, etc.\n\nAlthough ammonia is a colorless, tasteless liquid, its dominant characteristic is it's pungent, distinct order. Persons exposed to ammonia will not voluntarily stay in areas of even small concentrations, although these levels would not normally result in any health risks. Risks for accidental exposure to ammonia in a vapor state are irritation to the eyes, nose, throat. The extent of irritation is dependent of level of concentration and duration of exposure. Ammonia is classified nonflammable by the DOT. Ammonia will burn, but only a a very narrow concentration level, when accompanied with a constant ignition source.\n\nThe normal inventory of level of ammonia used at this facility is 18,000 pounds.\n\n\n\n3. The following administrative and engineering controls are in place at this facility. These controls are designed to eliminate, or reduce the possibility of an ammonia release.\n\n* Electronic ammonia detectors in compressor, vessel, and warehouse areas. Alarms tie into ADT security system Computer system activates a local audible alarm indicating an ammonia leak in the monitored areas. ADT notifies designated facility personnel, via phone and pager, of a potential problem detected in the system.\n\n* High level switches are configured to all high and low temp vessels, which shut down compressor operation and liquid make-up solenoids in the event of a high liquid condition.\n\n* All compressor are configured with pre-alarms and safety cutout on all critical system pressures and temp.\n\n* Safety relief valves are present on all vessels , compressors, condensers, oil separators to prevent over- pressurization\n\n* Periodic maintenance program is established to ensure the process equipment  in maintain in optimum mechanical and operational condition.\n\n* Emergency shutdown procedures are in place to activate the shut down in the event o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000450,
      "SummaryText": "f an emergency.\n\n4. Five- year accident history\n\n None \n\n5. Emergency Response Program\n\nThe purpose of the Merchants Terminal Emergency Action Plan is to:\n\n     1. Minimize exposure to our employees and the surrounding community in the event of a    ammonia release or spill. \n\n      2. Assure the safe emergency evacuation of the facility.\n\n      3. Provide for prompt medical medical attention \n\n      \nOur EAP currently meets OSHA 29 CFR 1910.38 compliance. "
    }
  ]
}