{
  "FacilityID": 1000019118,
  "FacilityName": "Poet Biorefining - Portland",
  "FacilityStr1": "1542 South 200 West",
  "FacilityStr2": null,
  "FacilityCity": "Portland",
  "FacilityState": "IN",
  "FacilityZipCode": "47371",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18075",
  "LEPC": "Jay County LEPC",
  "FacilityLatDecDegs": "40.414240",
  "FacilityLongDecDegs": "-085.027030",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.poet.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "POET Biorefining - Portland",
  "OperatorStr1": "1542 South 200 West",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "47371",
  "OperatorZipCodeExt": null,
  "RMPContact": "Matt Tomano",
  "RMPTitle": "General Manager",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200043",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-12-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-01-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-01-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-01-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000023326,
      "AltID": "Ethanol Denaturant System",
      "FacilityID": 1000019118,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000023628,
          "ProcessID": 1000023326,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000027680,
          "ProcessID": 1000023326,
          "ChemicalID": 125,
          "Quantity": 2380000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000527680,
          "ProcessID": 1000023326,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000019118,
      "SummaryText": "Facility Description\nThe Poet Biorefining-Portland facility (PBP) is located approximately three miles southwest of Portland, Indiana.  The main product of the Poet Biorefining-Portland facility is denatured ethanol for use as motor vehicle fuel.  Production at the facility was initiated in September 2007.  PBP produces ethanol using the dry mill method.  Corn meal is mixed with water and digestive enzymes to produce starch.  Secondary enzymes are added to convert the liquefied starch to fermentable sugars.  Yeast is added to the mash to ferment the sugars to ethanol.\n\nThe fermented mash (beer) contains about 20% alcohol and is distilled, then passed through a dehydration system to produce 200-proof anhydrous ethanol.  After final dehydration, the ethanol is collected in two 2,000,000-gallon storage tank to await addition of a denaturant (natural gas condensate, NGC) to make the ethanol unfit for human consumption, per federal and state requirements.  The NGC denaturant is normally stored in Tank No. 805, which has a capacity of 126,900 gallons (approximately 800,000 pounds)or alternately in tank No. 802, with a capacity of 250,000 gallons (approximately 1,580,000 pounds). NGC is blended with the ethanol via inline blending and then shipped directly from the facility in tank trucks and rail cars.\n\nChemicals Regulated Under the EPA Chemical Accident Prevention Program\nThe NGC denaturant is the only CAPP/RMP regulated chemical which exceeds the CAPP quantity thresholds for applicability of the regulation.  The CAPP/RMP regulated process consists of the NGC denaturant storage tank and the associated blending/transfer equipment and piping.  The denaturant is added to the ethanol to a concentration of 2% to 5%.  The greatest CAPP regulated quantity of denaturant in a tank, vessel or piping system is the quantity in the alternate denaturant storage tank (No. 802), located in the center containment area of the tank farm.  \n\nEmergency Response Policy and Program\nPoet Bioref"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000019118,
      "SummaryText": "ining - Portland is committed to the protection of it employees, the surrounding community and the environment from hazardous substances used in the ethanol fuel production process.  In the event of an emergency, the PBP Emergency Coordinator will direct internal response activities to the extent they are within the qualifications and capabilities of company personnel, taking reasonable precautions to prevent or minimize the extent of release or the co-mingling of materials.  There is no facility emergency response team.  Employees within their designated work areas will respond to small releases, if such response does not pose a danger to their health or safety.  In the event of a larger release, it is the policy of PBP to notify the Portland Fire Department and evacuate all employees at the facility.\n\nAccidental Release Prevention Program, and Chemical-Specific Prevention Steps\nPoet Biorefining-Portland is also committed to protection of the environment through the combined use of inspection, maintenance, employee training and response preparation.  Public access to the facility from the highway is restricted by a gate.  Much of the property is fenced, limiting vehicle access.  The plant is fully lighted. Personnel are typically on-site 24 hours a day, 7 days a week.  There is a multi-camera video surveillance system installed at the property, and a general computer based alarm system.   The alarm system includes monitoring of the storage tanks and denaturant blending system (level control and overfill monitors).  The alarm system is monitored in the control room for abnormal conditions, which trigger visual control panel alarm lights and audible alarms.  All of the facility storage tanks have secondary storage containment and are included in the facility Spill Prevention Control and Countermeasure (SPCC) Plan.\n\nFive-Year Accident History\nThe facility has an excellent record with regard to minimizing recordable and reportable accidents.  There have been no acciden"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000019118,
      "SummaryText": "ts since startup of the facility which require inclusion in the five-year accident history required by Subpart B of the CAPP/RMP regulation. \n\nPlanned Changes to Improve Safety\nThe Poet Biorefining-Portland management team is committed to an on-going system of reviewing changes in available technologies and any previous plant incidents to identify opportunities to improve plant safety.  A new computer based maintenance software (Maximo) is being implemented which will include automatic scheduling, work order generation and tracking for all preventative maintenance inspections and tests."
    }
  ]
}