{
  "FacilityID": 1000100855,
  "FacilityName": "West Virginia American Water - New River WTP",
  "FacilityStr1": "300 Bachman Road",
  "FacilityStr2": null,
  "FacilityCity": "Beckwith",
  "FacilityState": "WV",
  "FacilityZipCode": "25840",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54019",
  "LEPC": "Fayette County LEPC",
  "FacilityLatDecDegs": "38.1061",
  "FacilityLongDecDegs": "-081.11174",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "wvawater.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7944622,
  "ParentCompanyName": "American Water Works Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "WV American Water",
  "OperatorStr1": "300 Bachman Road",
  "OperatorStr2": null,
  "OperatorCity": "Beckwith",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "25840",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000175785",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-08-09 00:00:00",
  "SafetyInspectionBy": "WV Bureau for Public Health",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-05-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-05-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-05-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-05-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 38.10973,
  "FRS_Long": -81.11912,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000124902,
      "AltID": "Potable Water Treatment",
      "FacilityID": 1000100855,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000156116,
          "ProcessID": 1000124902,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000126311,
          "ProcessID": 1000124902,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000107636,
              "Process_NAICS_ID": 1000126311,
              "SafetyReviewDate": "2022-02-04 00:00:00",
              "PHA_Date": "2020-12-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Chemical delivery and loss of vacuum pressure",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Audible and visual alarms",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Added thermometer to chlorine storage area",
              "OpProceduresReviewDate": "2022-02-04 00:00:00",
              "TrainingReviewDate": "2022-02-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "hands-on",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-02-04 00:00:00",
              "EquipmentInspectionDate": "2022-04-25 00:00:00",
              "EquipmentTested": "Post chlorinator #1",
              "ChangeMgmtDate": "2022-02-07 00:00:00",
              "ChangeMgmtReviewDate": "2016-04-18 00:00:00",
              "PreStartupReviewDate": "2001-04-16 00:00:00",
              "ComplianceAuditDate": "2020-12-04 00:00:00",
              "AuditCompletionDate": "2020-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2022-03-30 00:00:00",
              "HotWorkPermitReviewDate": "2022-02-07 00:00:00",
              "ContractorSafetyReviewDate": "2022-04-18 00:00:00",
              "ContractorSafetyEvalDate": "2020-12-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000134863,
                  "PreventionProgram3ID": 1000107636,
                  "ProcessChemicalID": 1000156116
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000100855,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-08-04 00:00:00",
    "ERTrainingDate": "2022-02-21 00:00:00",
    "CoordinatingAgencyName": "Fayette Co. OES E911 center",
    "CoordinatingAgencyPhone": "3045743590",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000100855,
      "SummaryText": "kers, and to reduce the threat to nearby members of the community.  It is WVAW policy to adhere to all applicable Federal and State rules and regulations.  Safety depends on the manner in which chlorine is handled and used, combined with the safety devices inherent in the design along with operating procedures and the training of our personnel.\r\nThe facility's emergency action plan is based upon OSHA 1910.38 (Employee Emergency Plans) and experience obtained from community emergency response drills.  The facility's emergency response plan is reviewed annually and audited once every 3 years.\r\n\r\nThe Risk Management Plan must be updated and resubmitted every 5 years and within 30 days of any change that requires changing the process hazard analysis, the Offsite Consequence Analysis, or the EPA RMP Prevention Program. If a new regulated chemical is introduced above a threshold quantity, a revised submittal is required no later than the date the chemical is first present. If the inventory of chemicals drops below the EPA RMP thresholds, a revised RMP registration indicating the change must be submitted within 6 months."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000100855,
      "SummaryText": "taken in accordance with EPA's simplified approach for the partial containment of chlorine vapor by the room/building enclosure, which mitigates the release. Such building confinement reduces the release rate of chlorine vapor directly to the outdoors. According to the software modeling, since this facility is located in a rural area, the toxic cloud potentially formed by the evaporating chlorine should not reach nearby public receptors based upon the calculated distance of <0.1 miles to off-site end points.\r\n \r\nAs in the WCS, we have taken a very conservative approach to determining the ARS endpoint distance off-site. Therefore, in determining the ARS endpoint distance we have not taken credit for active mitigation provided by engineered safeguards that include chlorine monitors/detectors that automatically activate. The chlorine leak detection system is calibrated to initiate alarms at 0.1 ppm, which is lower than industry recommended settings. Some of our additional engineering safeguards are outlined in the following section of this summary and include isolation valves. Isolation valves are provided in the downstream chlorine feed system to isolate downstream chlorine sources.  As stated in the description of the WCS, numerous administrative controls are in place to prevent a release of this type and to provide effective emergency response should one occur.\r\n\r\nWe are using this information to help us ensure that our site/facility emergency response plan and the community emergency response plan address all reasonable contingency cases.\r\n\r\nI.6\tExecutive Summary\r\nAt the New River Water Treatment Plant facility, WVAW handles chlorine for the purpose of disinfecting and treating drinking water.  OSHA and EPA consider chlorine as a hazardous chemical.  The hazards of this chemical make it necessary to observe certain safety precautions in the use and handling to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-wor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000100855,
      "SummaryText": "latest off-site analysis can be found in the attachments section of this document.\r\n\r\nI.5.1 Worst-case Release Scenario for Chlorine\r\n\r\nThe worst-case scenario at our water treatment facility involves a failure of a single one (1) ton cylinder holding approximately 2,000 lbs of liquefied chlorine gas under pressure, resulting in a release with vaporization of approximately 500 pounds of chlorine gas. In this scenario, the chlorine is released as a vaporizing liquid inside a completely enclosed chlorine storage room in our water Chemical Feed building. The containment provided by the building mitigates the release. Such building confinement reduces the release rate of chlorine vapor directly to the outdoors. According to the software modeling, since this facility is located in a rural area, the toxic cloud potentially formed by the evaporating chlorine should not reach nearby public receptors based upon the calculated distance of 0.5 miles to off-site end points.\r\nAccess to the chlorine storage room is electronically controlled and monitored to prevent unauthorized access. WVAW also utilizes the SCADA system to monitor and remotely control the chlorine feed system. \r\n\r\nNumerous administrative controls are in place to prevent a release of this type. Controls include container design, storage, operation, maintenance and inspection; container repair and emergency response equipment; and personnel training conducted in accordance with regulatory requirements, chlorine industry standards and practices, local standard operating procedures, and our company's corporate policies and procedures, which are strictly enforced at the water treatment Plant.\r\n\r\n\r\nI.5.2 Alternative Release Scenario for Chlorine\r\n\r\nOur alternative release scenario for chlorine involves a chlorine release of \tapproximately 317 lbs through the failure of a cylinder valve. Though it would be unlikely, a failure of this device could permit the container to release a small amount of chlorine gas. Credit is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000100855,
      "SummaryText": "effective date for the OSHA Process Safety Management standard was May 26, 1992.\r\nThis facility is also regulated under the U.S. Environmental Protection Agency's (EPA) Risk Management Program rules (40 CFR 68) as a result of managing chemicals in excess of its Risk Management Program threshold quantity.  Under the EPA rule, chlorine is classified as a regulated substance with a threshold quantity of 2,500 pounds.  The effective date for the EPA rule was June 21, 1999.\r\nAs the major elements of the OSHA and EPA regulations are very similar, WVAW has taken the approach of developing a combined program that accommodates both the OSHA and EPA requirements in an integrated manner. This document provides the program management procedures.\r\nI.4\t5 Year Accident History - 40 CFR 68.42\r\nAs of March 2022, the West Virginia American Water New River Water Treatment Plant has had no reportable releases of chlorine.\r\nI.5\tOff-Site Consequence Analysis - 40 CFR 68.39\r\nThe Risk Management Program rule requires facilities to assess a range of potential releases including the worst-case release for every extremely hazardous chemical and more likely release scenarios.  The assessment includes dispersion modeling of worst-case and alternate case release scenarios, identification of all potentially affected populations, and identification of potential environmental damage.  \r\nFor toxic substances, which are normally gases at ambient temperature and handled as liquids under pressure, the worst-case release is defined as the release of the contents of the largest single vessel within 10 minutes as gas.    Additionally, an alternative release that is defined as a scenario that is more likely to occur than the worst-case release scenario. \r\nWVAW has opted to utilize the Environmental Protection Agency's RMP*Comp software to calculate the end-points of the worst case and alternative-case release scenarios.  These scenarios were based on a leak at the respective gas cylinders.  A copy of the"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000100855,
      "SummaryText": "WEST VIRGINIA-AMERCIAN WATER COMPANY\r\nNEW RIVER REGIONAL WATER TREATMENT PLANT \r\nRisk Management Plan Executive Summary\r\n\r\nI.\tPSM/RMP PROGRAM OVERVIEW\r\n\r\nI.1\tRMP Management System\r\n\r\nThe West Virginia American Water (WVAW) New River Water Treatment Plant has developed a Risk management Plan (RMP) as required by the United States Environmental Protection Agency (USEPA) as defined in 40 CFR 68.10.   The Production Supervisor oversees the overall responsibility for the compliance of the New River Water Treatment Plant's RMP.  The assigned Operational Risk Management/Health & Safety personnel for West Virginia American Water will also provide support for the elements of the program.  Additional West Virginia American Water personnel will be assigned to assist in the compliance of the program as needed.\r\n\r\nI.2\tFacility Description\r\nThe New River Water Treatment Plant has a design capacity of 4.0 MGD.  It is a surface water treatment plan with its source water being the New River.  The facility is located in Fayette County in the State of West Virginia.  The chemical treatment process utilizes the following chemicals: polyaluminum chloride, chlorine, fluoride, potassium permanganate, corrosion inhibitor, powered activated carbon, and non-ionic polymer. \r\nI.3\tProgram Information\r\nWVAW operates the New River Water Treatment Plant which is regulated under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) rule (29 CFR 1910.119) and the Environmental Protection Agency (EPA) Risk Management Plan (RMP) rule (40 CFR Part 68).  The facility is subject to the OSHA and EPA standards because the chlorination process contains a regulated chemical in excess of the OSHA threshold quantity.  Under OSHA Process Safety Management, chlorine is classified as a highly hazardous chemical (HHC) with a threshold quantity of 1,500 pounds, OSHA standard requires regulated facilities to develop comprehensive management programs and emergency action plans.  The"
    }
  ]
}