{
  "FacilityID": 1000106063,
  "FacilityName": "Green Bay - Nouryon USA, LLC.",
  "FacilityStr1": "1701 Cornell Road",
  "FacilityStr2": null,
  "FacilityCity": "Green Bay",
  "FacilityState": "WI",
  "FacilityZipCode": "54313",
  "Facility4DigitZipExt": "8934",
  "FacilityCountyFIPS": "55009",
  "LEPC": "Brown County LEPC",
  "FacilityLatDecDegs": "44.587805",
  "FacilityLongDecDegs": "-088.071068",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 126271391,
  "ParentCompanyName": "Nouryon Chemicals LLC",
  "Company2Name": null,
  "CompanyDUNS": 62999347,
  "Company2DUNS": null,
  "OperatorName": "Nouryon",
  "OperatorStr1": "1701 Cornell Road",
  "OperatorStr2": null,
  "OperatorCity": "Green Bay",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54313",
  "OperatorZipCodeExt": null,
  "FTE": 47,
  "OtherEPAFacilityID": "WID988621348",
  "EPAFacilityID": "100000095121",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "405120210-ROPB",
  "SafetyInspectionDate": "2023-05-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-07-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-07-31 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-07-31 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-07-31 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 44.588889,
  "FRS_Long": -88.072778,
  "FRS_Description": "PLANT ENTRANCE (PERSONNEL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000132473,
      "AltID": "Expancel",
      "FacilityID": 1000106063,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000165917,
          "ProcessID": 1000132473,
          "ChemicalID": 115,
          "Quantity": 259400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000165916,
          "ProcessID": 1000132473,
          "ChemicalID": 107,
          "Quantity": 58992.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000165915,
          "ProcessID": 1000132473,
          "ChemicalID": 25,
          "Quantity": 337307.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000165914,
          "ProcessID": 1000132473,
          "ChemicalID": 36,
          "Quantity": 132277.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000133906,
          "ProcessID": 1000132473,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000114133,
              "Process_NAICS_ID": 1000133906,
              "SafetyReviewDate": "2023-06-23 00:00:00",
              "PHA_Date": "2022-10-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-07-10 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-06-22 00:00:00",
              "TrainingReviewDate": "2023-06-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Third party certified trainer.",
              "MaintenanceReviewDate": "2023-06-23 00:00:00",
              "EquipmentInspectionDate": "2022-10-01 00:00:00",
              "EquipmentTested": "Acrylonitrile Tank",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2023-03-23 00:00:00",
              "PreStartupReviewDate": "2023-06-23 00:00:00",
              "ComplianceAuditDate": "2023-06-23 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-01-13 00:00:00",
              "HotWorkPermitReviewDate": "2022-09-08 00:00:00",
              "ContractorSafetyReviewDate": "2023-06-23 00:00:00",
              "ContractorSafetyEvalDate": "2023-07-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000143152,
                  "PreventionProgram3ID": 1000114133,
                  "ProcessChemicalID": 1000165914
                },
                {
                  "PrimaryKey": 1000143151,
                  "PreventionProgram3ID": 1000114133,
                  "ProcessChemicalID": 1000165915
                },
                {
                  "PrimaryKey": 1000143153,
                  "PreventionProgram3ID": 1000114133,
                  "ProcessChemicalID": 1000165916
                },
                {
                  "PrimaryKey": 1000143154,
                  "PreventionProgram3ID": 1000114133,
                  "ProcessChemicalID": 1000165917
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106063,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-09-26 00:00:00",
    "ERTrainingDate": "2023-06-14 00:00:00",
    "CoordinatingAgencyName": "Howard Fire Department",
    "CoordinatingAgencyPhone": "9204344640",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 9,
      "FacilityID": 1000106063,
      "SummaryText": "facility.\n\nPlanned Changes to Improve Safety\n\nGiven that this is a prescriptive RMP, as the process is not installed, planned improvements and safeguards are outlined in the PHA."
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000106063,
      "SummaryText": "ndividual elements of the Nouryon prevention program work together to help prevent accidental chemical releases.\n\nFive-Year Accident History\n\nThe Nouryon Green Bay facility has no history of RMP accidents from covered processes.\n\nEmergency Response Program\n\nIt is a policy of the Nouryon Green Bay facility that a safe working environment be provided for each employee or contractor and that site operations be conducted such that a safe living environment is maintained for the residents of the community of Howard. The company conducts all of its normal and emergency operations with safety as the highest priority. This plan is in place to fulfill these policy goals. This plan is designed to provide guidance for situations including, but not limited to, the following instances:\n• Fire\n• Natural Disasters\n• Explosion\n• Bomb & Security Threats\n• Chemical & Hazardous Waste Releases\n• Medical Emergency\n• Environmental Hazards\n• Contractor Guidelines/Training\n\nThe Emergency Response plan, except as it applies to contractors, provides a non-detailed outline to be followed during specific emergencies and situations. The Emergency Response plan highlights general emergency situations and provides guidelines as to the actions that should be taken by designated response personnel. The Emergency Response plan depends extensively upon the designated response personnel acting in a reasonable and timely manner when making decisions concerning an emergency situation. This written Emergency Response plan is to be used in conjunction with the entire contents of this binder. It is organized to minimize duplication and provide accurate information and practical field use.\n\nNouryon involves and informs the community of Howard of its emergency response planning by providing Howard Fire Department, as the primary responder, with an updated copy of the ERP Binder. The Brown County Emergency Management keeps an updated copy of the Scanning, Analysis, Response and Assessment (SARA) plan for this"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000106063,
      "SummaryText": "e, nature, and location of their work. Contractors’ selection considers the existence and effectiveness of their safety programs and performance. Contractors undergo orientations where they are made aware of basic plant rules and safety policies, workplace hazards in the area they will work, safe work practices applicable to the jobs, and basic emergency response procedures. During this initial orientation, contract employees are instructed to report any hazards their work may create or that they discover during the course of their work. Contractors are periodically evaluated to ensure they are fulfilling their safety obligations.\n\nEmployee Participation\n\nThe employees and management work together to manage process safety and accident prevention efforts. Employees participate in safety action committee meetings and the decision making dialog in those meetings. Employees also hold and participate in their own subcommittee meetings and make recommendations to this steering group. Employees participate in process hazard reviews and in the development of operating procedures. They assist in updating and verifying technical documents and chemical information. Employees have access to all information created as part of this facility's accident prevention program. Employees are involved in developing and carrying out training, incident investigations, managements of change, process hazard analyses, and pre-startup safety reviews.\n\nPrevention Program\n\nNouryon has implemented the following prevention program release mitigation steps:\n• High level probes with alarms\n• Flow controllers with automatic shutoffs\n• Pressure relief devices on piping, tanks, and reactor vessels\n• Check valves to prevent reverse flow through piping\n• High temperature and pressure warning systems on the reactor vessels\n• Safety Instrumented Systems are included in the process\n• Short stop to inject inhibitor into the tank if there is a deviation to prevent polymerization and further explosion\n\nThese i"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000106063,
      "SummaryText": "A PSSR involves field verification of equipment fabrication and installation, and serves to assure that other accident prevention program requirements are properly implemented.\n\nCompliance Audits\n\nTo assure that the goals of the accident prevention programs are met, program performance is periodically evaluated in the form of compliance audits. An audit team reviews records and documents to determine the degree of program compliance. Compliance audits will be conducted at least every 3 years. Audit team findings are documented and presented to plant management for resolution. Corrective actions taken in response to audit findings are tracked until they are complete. The two most recent audit reports are retained.\n\nIncident Investigation\n\nAll incidents that result in, or could have reasonably resulted in, a release of a hazardous material, a fire or explosion in a covered process area, major property damage, adverse environmental impact, or serious personal injury be reported and promptly investigated. By investigating accidents and near misses, important lessons are learned. Corrective actions can then be implemented to prevent similar events in the future. Incident investigations are documented, and recommendations tracked to their completion. Incident investigation reports are retained for at least 5 years to facilitate their use during PHA updates and revalidation.\n\nHot Work Permit\n\nNouryon has a written Hot Work Policy. The policy is followed by having all non-routine or work without a Standard Operating Procedure (SOP) go through the facility’s Permit-to-Work Process. In this permit process the job is reviewed to see if hot work is required. If yes, then the Permit-to-Work incorporates the use of the Hot Work Permit Section.\n\nContractors\n\nThe Nouryon Green Bay facility employs contractors to perform special construction projects or supplement the maintenance workforce when needed. All contractors receive some level of orientation training depending on the scop"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000106063,
      "SummaryText": "nt, or a management team will determine what and prescribe how the equipment may continue safely in operation.\n\nAs part of the mechanical integrity program, quality assurance measures are incorporated into equipment purchases and repairs. This helps to ensure that new equipment is suitable for its intended use and that proper material and spare parts are used when repairs are made.\n\nManagement of Change\n\nThe site's management of change program is intended to review and evaluate changes to process chemistry, operating conditions or limits, equipment, and procedures before changes are made so as to prevent unexpected adverse impacts. The management of change program uses a quantitative risk assessment to determine the significance of the change. This risk level assessment determines the levels of authorization required to approve the action. Design review checklists are used to evaluate different types of changes to prevent new hazards being created or equipment changes that are not suited to the service as it exists in the process. Another feature of the management of change program is that it verifies and documents that procedures, records, and equipment information are updated and that personnel affected by the change are informed of and trained in the change.\n\nPre-Startup Safety Review\n\nNouryon Green Bay facility personnel perform pre-startup safety reviews for facility modifications beyond replacements of equipment in kind on covered processes. This includes significant changes in process equipment or procedures or upon completing the construction of new process facilities. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment in service. This review provides additional verification that construction is in accordance with design specification and that systems are operationally ready. Applicable checklists are used to verify various aspects of readiness."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106063,
      "SummaryText": "e performed.\n\nTraining\n\nTraining is an essential part of the skills development program used for qualifying employees involved in operating a process. New employees receive initial training in plant rules and safety policies, process overviews, chemical and process hazards, safe work practices, and basic emergency response procedures. Following classroom orientation, the new employee begins coworker training with an experienced operator and a review of operating procedures applicable to their job. At the conclusion of this coworker-training period, the new employee is evaluated to ensure he possesses the skills and knowledge necessary to safely do their job. To supplement and reinforce job knowledge and skills, all employees undergo refresher training at regular intervals. Refresher training frequency ranges from each year to once every three years. Training is documented and understanding is verified using oral and written tests, performance observation, and other means that objectively demonstrate understanding.\n\nMechanical Integrity\nThe Nouryon Green Bay facility assures the mechanical integrity of critical operations equipment such as pressure vessels, storage tanks, piping systems, relief and vent systems, controls, pumps, and safety systems through its mechanical integrity program. The basic aspects of the program include: (1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process.\n\nMaintenance personnel receive training in (1) overviews of the process and its hazards, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and 5) safe work practices to help ensure that they perform their jobs in a safe manner. Equipment deficiencies, once identified, are corrected prior to further operation of the equipme"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106063,
      "SummaryText": "dged necessary.\n\nThe site management team reviews the PHA team's findings and recommendations. The management team establishes priorities for implementation of PHA recommendations based on a relative risk ranking assigned by the team. This ranking helps ensure that potential accident scenarios with the highest risk receive more immediate attention. All approved mitigation options in response to PHA team findings are tracked until they are completed. The final resolution of each finding is documented and retained.\n\nThe Nouryon Green Bay facility periodically updates and revalidates the hazard analysis studies using experience gained to improve process safety. These periodic reviews are conducted at least every 5 years for covered processes and will be conducted at this frequency until the process is no longer operating. Findings and recommendations from these updates are documented and retained. Recommendations made by the team updating or revalidating the PHA are again reviewed and resolved by management review with final resolution being documented and retained.\n\nOperating Procedures\n\nThe Nouryon Green Bay facility maintains written procedures that address various modes of process operations, such as (1) initial startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) startup following maintenance activities or following an emergency shutdown. Operating procedures are used as a reference by experienced operators and a training resource in training new operators. These procedures are periodically reviewed and certified as current and accurate. Operating procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process. When creating or reviewing operating procedures, a team of personnel review and comment on the draft’s accuracy and completeness. Procedures are available to operators and other personnel in work areas where process operations ar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106063,
      "SummaryText": "chemicals. For specific covered process areas, there are documented safety-related limits for specific process parameters (e.g., temperatures, pressures). Operators ensure that the process is maintained within these limits using reliable process controls and monitoring instruments, emergency relief systems and two stage scrubber system, trained personnel, and protective instrument systems (e.g., emergency shutdown systems).\n\nTechnical documents that provide information about the design and construction of process equipment are maintained digitally within the Green Bay plant's intranet. Hard copy back-up of key critical information is maintained in Operations, HSES, and Engineering. This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nProcess Hazard Analysis\n\nThe Nouryon Green Bay facility has a comprehensive program to help ensure that hazards and risks associated with the various processes are identified and controlled. Within this program, each new and altered process is systematically examined to identify hazards and ensure adequate controls are in place to manage these hazards.\n\nMethodologies used to perform these evaluations include the hazard and operability study (HAZOP) and layer of protection analysis (LOPA). These analyses are conducted using cross-functional teams with operations and engineering expertise. Team members identify and evaluate hazard scenarios, ranking each scenario's risk level with respect to event likelihood and severity. The team also evaluates prevention and mitigation measures and makes appropriate recommendations for additional prevention and/or mitigation measures if they are ju"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106063,
      "SummaryText": "ion of a potential worst-case scenario results in a scenario that is not generally considered credible. The alternative release scenarios represent more credible events. The Nouryon Green Bay facility RMP includes both worst-case and alternative release scenarios for flammable and toxic chemicals present on the site.\n\nAccidental Release Prevention and Emergency Response Policies\nA combination of engineering and administrative controls makes the occurrence of a methacrylonitirle, acrylonitrile, isobutane or isopentane release highly unlikely. Control measures in place significantly reduce the possibility of smaller, less serious releases. Process equipment design considers the consequences of a variety of process scenarios and incorporates safeguards to prevent or minimize the effect of deviations in normal operating conditions. Process equipment including vessels, piping, pumps, control systems, and safety systems are inspected and maintained in accordance with a mechanical integrity program. Trained personnel perform critical operations in accordance with standard operating procedures.\n\nProcess Information\n\nNouryon keeps up to date process information as noted in the following sections.\n\nProcess Safety Information\nTechnical information on process equipment, technology, and chemicals is maintained and used to ensure safe operation of the covered processes. These documents address chemical properties and their associated hazards, limits for critical process parameters and specific chemical inventories, and equipment design and configuration details. Specific departments are assigned responsibility for maintaining up-to-date process safety information.\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety data sheets (SDSs). This information is supplemented by documents that specifically address known corrosion concerns and other known hazards associated with the inadvertent mixing of"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106063,
      "SummaryText": "Introduction and Policies\n\nThe Nouryon Green Bay facility is committed to being a responsible member of the community in which it operates by giving top priority to operating in a safe and environmentally sound manner. Nouryon Green Bay personnel work continuously to identify methods to reduce the use of hazardous materials and to reduce the risk to the community and environment through implementation of new technology and procedures. This commitment to safe and environmentally sound operations are values Nouryon holds at its core. They are documented in policy and compliance manuals, and in the mission statement, which are available to all employees.\n\nStationary Source and Regulated Substances\n\nMethacrylonitrile (MAN)\nThere is one MAN storage tank as well as a MAN tank truck unloading operation present at the facility. The operating conditions for the storage tank are 1 psig and 59 °F. The MAN storage tank can contain up to 132,277 lb of MAN.\n\nAcrylonitrile (ACN)\nThere is one ACN storage tank as well as an ACN railcar unloading operation present at the facility. The operating conditions for the storage tank are 15 psig and 61 °F. The ACN storage tank can contain up to 337,307 lb of ACN.\n\nIsobutane (iC4)\nThere is one iC4 storage tank as well as an iC4 tank truck unloading operation present at the facility. The operating conditions for the storage tank are 30 psig and 59 °F. The iC4 storage tank can contain up to 58,992 lb of iC4.\n\nIsopentane (iC5)\nThere is one iC5 storage tank as well as an iC5 tank truck unloading operation present at the facility. The operating conditions for the storage tank are 15 psig and 68 °F. The iC5 storage tank can contain up to 259,400 lb of iC5.\n\nOffsite Consequence Analysis Reporting\nThe EPA RMP rule requires that Nouryon provide information to the EPA and emergency responders about the worst-case and the alternative release scenarios considered for the RMP regulated chemicals at the Nouryon Green Bay facility. Note that the RMP definit"
    }
  ]
}