{
  "FacilityID": 1000042329,
  "FacilityName": "George's, Processing Plant",
  "FacilityStr1": "1306 N. Kansas",
  "FacilityStr2": null,
  "FacilityCity": "Springdale",
  "FacilityState": "AR",
  "FacilityZipCode": "72762",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05143",
  "LEPC": "Washington LEPC",
  "FacilityLatDecDegs": "36.197500",
  "FacilityLongDecDegs": "-094.139083",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.georgesinc.com",
  "FacilityEmailAddress": "gregg.smith@georgesinc.com",
  "FacilityDUNS": 103649281,
  "ParentCompanyName": "George's Processing",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "George's Processing",
  "OperatorStr1": "P.O. Drawer 2030",
  "OperatorStr2": null,
  "OperatorCity": "Springdale",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72764",
  "OperatorZipCodeExt": null,
  "FTE": 930,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000157607",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-05-18 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-12-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-10-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-10-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.19772,
  "FRS_Long": -94.14029,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058014,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000042329,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000070880,
          "ProcessID": 1000058014,
          "ChemicalID": 56,
          "Quantity": 42000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000058940,
          "ProcessID": 1000058014,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000048326,
              "Process_NAICS_ID": 1000058940,
              "SafetyReviewDate": "2013-10-10 00:00:00",
              "PHA_Date": "2013-11-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-03-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Sabotage",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-04-17 00:00:00",
              "TrainingReviewDate": "2014-05-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Training Modules(IIAR)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-04-17 00:00:00",
              "EquipmentInspectionDate": "2014-03-17 00:00:00",
              "EquipmentTested": "Valves, Piping, Tanks, Seals, and Emergency Backup Equipment",
              "ChangeMgmtDate": "2014-01-20 00:00:00",
              "ChangeMgmtReviewDate": "2013-10-15 00:00:00",
              "PreStartupReviewDate": "2009-12-23 00:00:00",
              "ComplianceAuditDate": "2012-12-06 00:00:00",
              "AuditCompletionDate": "2014-04-16 00:00:00",
              "IncidentInvestigationDate": "2014-01-13 00:00:00",
              "InvestigationChangeDate": "2015-03-30 00:00:00",
              "ParticipationPlansReviewDate": "2014-02-25 00:00:00",
              "HotWorkPermitReviewDate": "2013-09-10 00:00:00",
              "ContractorSafetyReviewDate": "2014-05-05 00:00:00",
              "ContractorSafetyEvalDate": "2014-01-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000058796,
                  "PreventionProgram3ID": 1000048326,
                  "ProcessChemicalID": 1000070880
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000042329,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-12-10 00:00:00",
    "ERTrainingDate": "2014-04-03 00:00:00",
    "CoordinatingAgencyName": "Sprindale Fire Department",
    "CoordinatingAgencyPhone": "4797514510",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042329,
      "SummaryText": "George's, Inc. General Executive Summary for Manufacturing Facilities\r\n\r\n1.\tAccidental Release Prevention and Emergency Response Policies\r\nWe at George's, Inc. Processing Plant are strongly committed to employee, public and environmental safety.  Our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance demonstrates this commitment, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\r\n\r\n2.\tThe Stationary Source and the Regulated Substances Handled\r\nOur facility's primary activities encompass Poultry processing.  We have one regulated substance present at our facility.  This substance is Ammonia (anhydrous)is used for refrigeration.  The maximum inventory of Ammonia (anhydrous) at our facility is 42000.00 lbs.\r\n\r\n3.\tThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\r\nTo perform the required off site consequence analysis for our facility, we have used RMP Comp Ver 1.07.  The following paragraphs provide details of the chosen scenarios.\r\n\r\nThe worst-case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from the largest vessel on site.  In this scenario 12000 lb. of Ammonia (anhydrous) is released. That release would come from the main ammonia receiver or adjacent piping. Ammonia vapor would escape to the atmosphere at a pressure of 150 to 160 psig. The toxic endpoint is estimated at 0.5 miles using \"EPA's RMP Comp\" utility. \r\n\r\nThe alternative release scenario for Ammonia (anhydrous) involves a release from Processing.  The scenario involves the release of 100 lb. of Toxic liquid, and is assumed to be released to form a 1 cm deep pool from which evaporation takes place.  The entire"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042329,
      "SummaryText": "pool is estimated to have evaporated after 1 minute.  The release is also assumed to be controlled by emergency shutdown system(s).  These active mitigation systems have the effect of reducing the amount of ammonia lost.  Under neutral weather conditions, the maximum distance to the toxic endpoint of 300 ppm of Ammonia (anhydrous) is approximately 0.1 miles.\r\n\r\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1998 Edition.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\r\n\r\nProcess Safety Information\r\nGeorge's, Inc. Processing Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\r\n\r\nProcess Hazard Analysis\r\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses are \"what if\" scenarios and HAZOP.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of once per year.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 11/19/2013.\r\n\r\nOperating Procedures\r\nFor the purposes of safely conducting activities within our covered processes, George's, Inc. Processing Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a tu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042329,
      "SummaryText": "rnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\r\n\r\nTraining\r\nGeorge's, Inc. Processing Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.\r\n\r\nMechanical Integrity\r\nGeorge's, Inc. Processing Plant carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\nWritten procedures are in place at George's, Inc. Processing Plant to manage changes in process chemicals, technology, equipment and procedures. The most recent Management of Change update was 1/20/2014. \r\n\r\nStandard Operating Procedures\r\nWritten procedures are maintained for each component and for a number of tasks. The most recent review/revision of maintenance procedures was performed on 05/09/2014.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\nPre-startup Reviews\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at George's, Inc. Processing Plant.  The most recent review was performed on 05/10/2014.  These reviews are conducted to confirm that construction, equ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000042329,
      "SummaryText": "ipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\nGeorge's, Inc. Processing Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on 12/06/12 by Garden City Ammonia Program. Corrective actions required as a result of audits are undertaken in a safe and prompt manner.\r\n\r\nIncident Investigation\r\nGeorge's, Inc. Processing Plant promptly investigates any chemical process incident that has resulted in, or could reasonably result in a release of a regulated substance, employee injury, or product contamination.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\r\n\r\nEmployee Participation\r\nGeorge's, Inc. Processing Plant truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\r\n\r\nContractors\r\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  George's, Inc. Processing Plant has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\n\r\n5.\tFive-year Accident History\r\nGeorge's, Inc. P"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000042329,
      "SummaryText": "rocessing Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release involving Injury, evacuation, or a reportable quantity of ammonia lost in the past five years. More than fourteen years have passed since the last such incident at this location.\r\n\r\n6.\tEmergency Response Plan\r\nGeorge's, Inc. Processing Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\r\n\r\nWashington Co.  is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\r\n\r\n7.\tPlanned Changes to Improve Safety\r\nOur company has state of the art equipment to prevent the accidental release of any toxic substance. An updated Process Hazard Analysis, and a Mechanical Integrity Audit have been performed within the past year and each of these has resulted in recommendations for change. These changes have have been prioritized and are being documented in our corrective action and Management of Change procedures."
    }
  ]
}