{
  "FacilityID": 1000017536,
  "FacilityName": "Harcros Chemicals Inc. - Vicksburg",
  "FacilityStr1": "4280 Rifle Range Road",
  "FacilityStr2": null,
  "FacilityCity": "Vicksburg",
  "FacilityState": "MS",
  "FacilityZipCode": "39180",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28149",
  "LEPC": "Warren County LEPC",
  "FacilityLatDecDegs": "32.299167",
  "FacilityLongDecDegs": "-090.900556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "harcros.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Harcros Chemicals Inc.",
  "Company2Name": null,
  "CompanyDUNS": 194128765,
  "Company2DUNS": 194128765,
  "OperatorName": "Harcros Mississippi LLC",
  "OperatorStr1": "P.O. Box 2930",
  "OperatorStr2": null,
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66110",
  "OperatorZipCodeExt": "2930",
  "RMPContact": "Rick Hesketh",
  "RMPTitle": "Engineering & Environmental Manager",
  "FTE": 15,
  "OtherEPAFacilityID": "MSR000103366",
  "EPAFacilityID": "100000196995",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-08-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-03-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-10-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-10-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-10-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000021664,
      "AltID": "Storage",
      "FacilityID": 1000017536,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000021966,
          "ProcessID": 1000021664,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000025608,
          "ProcessID": 1000021664,
          "ChemicalID": 62,
          "Quantity": 350000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000025609,
          "ProcessID": 1000021664,
          "ChemicalID": 49,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000525608,
          "ProcessID": 1000021664,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000525609,
          "ProcessID": 1000021664,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000017536,
      "SummaryText": "EXECUTIVE SUMMARY - VICKSBURG\n\n\n1. Accidental release prevention and emergency response policies\n\nAt this distribution facility, we store chlorine and sulfur dioxide, which are considered hazardous by the EPA.  The same properties that make chlorine and sulfur dioxide valuable as commodity chemicals also make it necessary to observe certain safety precautions to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as that of our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and State rules and regulations.  Safety depends upon the manner in which we handle chlorine and sulfur dioxide, and the training of our personnel.\n\nThis relatively new facility at Vicksburg replaced our former facility in Jackson, Mississippi.  The new facility is much larger, and more remote from population centers and other potential public receptors.\n\nOur emergency response program is based upon The Chlorine Institute's Pamphlet 64, Emergency Response Plans for Chlorine Facilities.  The emergency response plan includes procedures for notification of the local fire authority and notification of our immediate neighbors.  \n\n2. The stationary source and regulated substances handled\n\nOne of the primary purposes of this facility will be to store chlorine and sulfur dioxide for distribution to our customers which include water treatment facilities and general industry.  Chlorine and sulfur dioxide are received in Department of Transportation (DOT) approved 150 pound cylinders and ton containers and are shipped in the same packages.  Chlorine and sulfur dioxide are not used, manufactured, or repackaged at this facility.  Access to the site is restricted to Harcros employees, and authorized contractors and visitors.  The storage of chlorine and sulfur dioxide containers is subject to RMP Program Level 2.  \n\n\n3. The general accidental release prevention program and the specific preven"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000017536,
      "SummaryText": "tion steps\n\nThis distribution facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility is operated in accordance with recommendations from The Chlorine Institute and with the Responsible Distribution Process of the National Association of Chemical Distributors.\n\nA summary of our Prevention Program\n\nSAFETY INFORMATION - Our facilities maintain current copies of Material Safety Data Sheets for all hazardous chemicals stored including Chlorine and Sulfur Dioxide.  In addition, this facility has current copies of all relevant Chlorine Institute pamphlets.  Much of the information in these pamphlets is applicable to the storage of sulfur dioxide also.\n\nHAZARD REVIEW - A hazard review is conducted for the chlorine and sulfur dioxide container storage process at least every 5 years.  We primarily use a checklist prepared by the Chlorine Institute which is relevant to our operations.  At least one hourly employee (warehouse personnel or driver) takes part in this review.  Corrective or preventative actions discovered during these reviews are documented and addressed in a timely manner.\n\nOPERATING PROCEDURES - We have Standard Operating Procedures covering all aspects of storage and movement of containers.\n\nTRAINING - All new drivers and warehouse personnel attend a 5 or 3 day training workshop covering a variety of safety, environmental, and regulatory topics.  Workers at facilities that store chlorine and sulfur dioxide receive additional training on the hazards, health effects, and operating procedures specific to those chemicals.  Refresher training is conducted at least every 3 years.\n\nMAINTENANCE - Container storage is the only process for RMP chemicals at this facility.  We perform a visual inspection of containers when received and before loading for delivery to customers.  In addition, we perform daily inspections and routine maintenance on the forklift trucks used to move containers.\n\nINCIDE"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000017536,
      "SummaryText": "NT INVESTIGATION - We have an Incident Investigation SOP which requires operation managers to document and investigate incidents involving injuries and environmental releases, as well as \"near-misses\" that could have lead to injuries and releases.  These reports are reviewed by Corporate safety personnel and are shared with all facilities within the company.  Corrective actions proposed as a result of these investigations are addressed in a timely manner.\n\nCOMPLIANCE AUDIT - A compliance audit is conducted at least every 3 years to assure the documentation and procedures fully comply with the RMP regulations.  Deficiencies discovered during audits are corrected in a timely manner.\n\n\n4. Five year accident history\n\nSince this facility began operations in 2006, we have had no accidental releases that have resulted in deaths, injuries or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\n\n5. The emergency response program\n\nThis facility's emergency response program is based upon The Chlorine Institute's Pamphlet 64, Emergency Response Plans for Chlorine Facilities.  This plan is reviewed annually and updated when required.  All response team members attend annual refresher training including the use of response equipment on simulated leaks.  We work closely with our suppliers, customers, public responders, and The Chlorine Institute to continuously improve our emergency response capabilities.  \n\nOur response program is for chlorine and sulfur dioxide leaks only.  We will not respond to other types of emergencies but will assist trained public and private emergency response personnel if required.\n\n\n6. Planned changes to improve safety\n\nThis facility was constructed in the 1950's and grew into a comprehensive chemical plant.  It shut down in 2002.  In 2006, Harcros Chemicals leased a portion of the site and converted it into a chemical distribution facility.  We continue to p"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000017536,
      "SummaryText": "articipate in The Chlorine Institute and the National Association of Chemical Distributor programs, and to continue to improve our operations in accordance with Responsible Distribution Guidelines.  \n\nThis relatively new facility has made many changes to increase efficiency, and to improve safety and security.  It is a significant improvement over our former inner city location in Jackson. \n\nThere are no other specific safety improvements planned at this time but we anticipate making additional security improvements as we develop our Security Plan in accordance with Department of Homeland Security requirements.  \n"
    }
  ]
}