{
  "FacilityID": 1000033537,
  "FacilityName": "Quigg Branch Water Pollution Control Plant",
  "FacilityStr1": "2440 Tatum Road",
  "FacilityStr2": null,
  "FacilityCity": "Conyers",
  "FacilityState": "GA",
  "FacilityZipCode": "30013",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13247",
  "LEPC": "Georgia Title III LEPC",
  "FacilityLatDecDegs": "33.676667",
  "FacilityLongDecDegs": "-083.960833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.esginc.net",
  "FacilityEmailAddress": "ebiskis@esginc.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Rockdale County, Georgia",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Rockdale County",
  "OperatorStr1": "958 Milstead Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Conyers",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30012",
  "OperatorZipCodeExt": null,
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000049672",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-04-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-02-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-03-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-03-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-03-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.67708,
  "FRS_Long": -83.95667,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040904,
      "AltID": "Chlorination Process",
      "FacilityID": 1000033537,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000049128,
          "ProcessID": 1000040904,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000041346,
          "ProcessID": 1000040904,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000035736,
              "Process_NAICS_ID": 1000041346,
              "SafetyReviewDate": "2013-03-15 00:00:00",
              "PHA_Date": "2013-03-13 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-03-16 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-02-04 00:00:00",
              "TrainingReviewDate": "2015-02-04 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-02-04 00:00:00",
              "EquipmentInspectionDate": "2015-02-04 00:00:00",
              "EquipmentTested": "chlorine alarm system - tested monthly",
              "ChangeMgmtDate": "2011-05-04 00:00:00",
              "ChangeMgmtReviewDate": "2015-02-04 00:00:00",
              "PreStartupReviewDate": "2015-02-04 00:00:00",
              "ComplianceAuditDate": "2015-02-04 00:00:00",
              "AuditCompletionDate": "2015-02-04 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-02-04 00:00:00",
              "HotWorkPermitReviewDate": "2015-02-04 00:00:00",
              "ContractorSafetyReviewDate": "2015-02-04 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "This prevention program applies to the chlorine storage and chlorination process.  The Quigg Branch Water Pollution Control Plant is owned by Rockdale County and operated by ESG Operations, Inc.  Therefore, the RMP Program 3 prevention program is implemented.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000042200,
                  "PreventionProgram3ID": 1000035736,
                  "ProcessChemicalID": 1000049128
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000033537,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2015-02-04 00:00:00",
    "ERTrainingDate": "2015-02-04 00:00:00",
    "CoordinatingAgencyName": "Rockdale County Fire Department",
    "CoordinatingAgencyPhone": "7709291150",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033537,
      "SummaryText": "This executive summary provides a brief overview of the Risk Management Program (RMP) and the associated policies at the Quigg Branch Water Pollution Control Plant (Quigg Branch WPCP), owned by Rockdale County and operated by ESG Operations, Inc.\n\n\n\n1.0    Accidental Release Prevention and Emergency Response Policies\n\n\n\nESG Operations, Inc. believes it is important to provide a safe workplace to its employees and minimize the impact of its operations on the surrounding community and the environment.  Accordingly, ESG has developed proactive safety and environmental programs, which rely upon active employee participation and management leadership and support.  This same proactive philosophy was employed in the development and implementation of the Quigg Branch WPCP RMP for the chlorine system.  ESG Operations, Inc. has determined that the OSHA Process Safety Management standard also applies to the chlorine storage and chlorination process and therefore has prepared this RMP to comply with the RMP Program 3 requirements.  By doing so, ESG affirms its proactive safety and environmental philosophy and acknowledges the inherent value of full RMP compliance.\n\n\n\nThe RMP prevention program is arguably the most important element of the rule.  Its program elements require the active participation of facility employees and management in conducting activities aimed at preventing accidental releases of chlorine, a regulated chemical under the RMP regulation.  If prevention activities could be completely successful, there would be no need for emergency response activities, since no releases would occur.  Accordingly, a well-developed and properly implemented prevention program will lower the possibility of an accidental release and minimize the consequences of a release should one occur.\n\n\n\nESG Operations, Inc. takes an active role in preventing accidental releases by ensuring that its employees are well-informed regarding the hazards associated with chlorine at the Quigg Branch WPC"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033537,
      "SummaryText": "P and actively participate in process hazard analysis.  The chlorine storage and chlorination process has not changed since the time of the first RMP submission in June 1999.  The employees that work on the chlorine system are properly trained in the safe operation and handling of the chlorine system.  Refresher training is provided to the employees periodically.  They are aided in this work by standard operating procedures.\n\n\n\nESG Operations, Inc. management understands its duty to provide a safe working environment and to take measures to prevent accidents which may have an effect on the surrounding community.  Additionally, ESG Operations, Inc. has established procedures for emergency notification and response. \n\n\n\n2.0 Stationary Source and Regulated Substances\n\n\n\nThe Quigg Branch WPCP owned by Rockdale County is located in Conyers, Georgia.  The 6 MGD facility treats wastewater through a series of physical and chemical treatment operations.  Incoming wastewater initially passes through automated bar screens before being treated in a three-channel orbal activated sludge basin.  Clarification is accomplished in biological clarifiers for final solids precipitation.  Final effluent is disinfected by chlorination prior to discharge to the Yellow River.  Solids are digested aerobically and de-watered by gravity and belt filter press prior to landfill.\n\n\n\nThe Quigg Branch WPCP utilizes chlorine as a disinfectant in the treatment of wastewater.  Because of the volume of chlorine, the Quigg Branch WPCP is regulated under the RMP rule due to the volume of chlorine stored and used at the facility.   As required by the RMP Regulation, ESG Operations, Inc. has updated the Offsite Consequence Analysis.\n\n\n\n3.0     General Accidental Release Prevention Program and Chemical-specific Prevention \n\nSteps\n\n\n\nThe prevention program and chemical-specific prevention steps are described in detail in the Quigg Branch WPCP RMP manual.  The prevention program includes the following elements:\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033537,
      "SummaryText": "\n\n\n3.1    Process safety information, which includes information pertaining to the hazards of chlorine in the process, process technology and process equipment\n\n3.2    Process hazard analysis (PHA), which includes a systematic evaluation of the hazards of the chlorine process, identification of previous process incidents, engineering and administrative controls, consequences of failure of the engineering and administrative controls, facility siting, human factors, and possible safety and health effects of failure of controls.  PHA was revalidated in 2007, 2011 and again in 2013.\n\n3.3    Operating procedures, which include steps for each operating phase, operating limits, safety and health considerations and safety systems and their functions.  The operating procedures were reviewed 2008, 2009, 2011, 2013 and 2015.\n\n3.4    Training for each Quigg Branch WPCP employee involved in operating the chlorine system.\n\n3.5    Mechanical integrity procedures to maintain the on-going integrity of the chlorine process equipment.\n\n3.6    Management of change procedure to manage changes (other than replacements in kind) to the chlorine system.  The management of change procedures were reviewed in January 2007, 2011, 2013 and 2015.\n\n3.7    Pre-startup safety review for additions or significant modifications to the chlorine process or any new regulated chemical process.\n\n3.8    Compliance audits at least every three years from 1999 to evaluate compliance. \n\n3.9    Incident investigation, to be conducted and documented for each incident that resulted in, or could have reasonably resulted in a catastrophic release of chlorine from the facility.\n\n3.10    Employee participation in the development and implementation of the facility RMP and employee access to RMP information.\n\n3.11    Hot Work prohibition policy on or near the chlorine system when chlorine in present in the affected section of the process.  The Hot Work Procedures were reviewed in 2007, 2011, 2013 and 2015.\n\n3.12    Contractor management program, to ensure "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033537,
      "SummaryText": "appropriate evaluation and selection of qualified contractors for work on or near the chlorine system, proper notification of contractors regarding known chlorine system hazards and the Quigg Branch WPCP emergency evacuation plan, limited access to the chlorine process and evaluation of contractor performance.\n\n\n\nIn addition to these elements, the chlorine storage area at the Quigg Branch WPCP is equipped with a chlorine leak detector as is the operators area entrance door which continuously monitors the air for chlorine gas.  If the chlorine sensor detects a specified level of chlorine, audio and visual alarms will be activated and a high rate ventilation system can be activated.  The ventilation system withdraws chlorine and air from a low elevation in the chlorine storage room to an outdoor location.  Additionally, there is a windsock on top of both chlorine storage building and the administrative building designed to aid employees in easily identifying wind direction and potentially plume migration. The alarm system is maintained and tested on a regular basis to ensure proper operation should there be a chlorine release.  Management of Change procedures will be used for the upgrades to the chlorine system.\n\n\n\n4.0    Five Year Accident History\n\n\n\nThere have been no accidental releases of chlorine.\n\n\n\n5.0    Emergency Response Program\n\n\n\nThe facility has established and maintains an Emergency Response Program that is coordinated with local response agencies, including the Rockdale Fire Department.  The program is described in detail in the manual and meets the requirements of 40 CFR 68.95, which includes facility notification to emergency responders and evacuation procedures.  The goals of the program are to protect onsite employees from the hazardous effects of chlorine release and to minimize the effects of such releases on the general public.  This program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\n\n\n6.0    Planned changes for Improv"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000033537,
      "SummaryText": "ed Safety\n\n\n\nIdeas for changes to improve safety are actively sought from employees.  Employee participation meetings which focus on safety issues are held regularly at the Quigg Branch WPCP.  Employees are encouraged and trained to recognize hazards and to present ideas to eliminate them or to minimize the potential consequences of such hazards.\n\n\n\nAs part of the development of the Quigg Branch WPCP program, the PHA was revalidated with key employees to meet the prevention program requirements.  As the equipment and the process has remained the same from the time the first PHA was performed in 1999, the PHA review/revalidation conducted did not result in many new findings or recommendations.  The recommendations from the PHA's conducted in 1999, 2004 and in 2007, 2011, 2013 were reviewed, the findings of subsequent compliance audits were reviewed for completion as well. All item have been closed.\n\n"
    }
  ]
}