{
  "FacilityID": 1000075233,
  "FacilityName": "Reddy Ice-Gainesville (451)",
  "FacilityStr1": "624 Moreno Street SW",
  "FacilityStr2": null,
  "FacilityCity": "Gainesville",
  "FacilityState": "GA",
  "FacilityZipCode": "30501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13139",
  "LEPC": "Hall County LEPC",
  "FacilityLatDecDegs": "34.286807",
  "FacilityLongDecDegs": "-083.821251",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.reddyice.com",
  "FacilityEmailAddress": "information@reddyice.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Reddy Ice Corporation",
  "Company2Name": null,
  "CompanyDUNS": 364514133,
  "Company2DUNS": 0,
  "OperatorName": "Reddy Ice Corporation",
  "OperatorStr1": "5720 LBJ Freeway",
  "OperatorStr2": "Suite 200",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75240",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000194988",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-08-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Gainesville (327) Resub (PHA) (1/5/09)",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-01-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-01-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-01-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-01-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000093683,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000075233,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000117212,
          "ProcessID": 1000093683,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000094943,
          "ProcessID": 1000093683,
          "NAICSCode": "312113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000079793,
              "Process_NAICS_ID": 1000094943,
              "SafetyReviewDate": "2018-03-14 00:00:00",
              "PHA_Date": "2016-03-02 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-03-02 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Water filled diffusion tank.",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-03-21 00:00:00",
              "TrainingReviewDate": "2018-04-26 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-03-14 00:00:00",
              "EquipmentInspectionDate": "2019-01-07 00:00:00",
              "EquipmentTested": "Daily Equipment Observation",
              "ChangeMgmtDate": "2018-09-20 00:00:00",
              "ChangeMgmtReviewDate": "2018-03-14 00:00:00",
              "PreStartupReviewDate": "2007-12-08 00:00:00",
              "ComplianceAuditDate": "2018-03-14 00:00:00",
              "AuditCompletionDate": "2019-03-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-03-14 00:00:00",
              "HotWorkPermitReviewDate": "2018-03-14 00:00:00",
              "ContractorSafetyReviewDate": "2018-03-14 00:00:00",
              "ContractorSafetyEvalDate": "2018-03-14 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Reddy Ice #451 facility, located in Gainesville, Georgia, has developed a Combined Process Safety Management/Risk Management (PSM/RMP) Program to address the accident prevention program requirements of both the OSHA and EPA regulations. The purpose of the PSM/RMP Program is to make safe operations and accident prevention systematic throughout the facility. The PSM/RMP Program contains thirteen elements, tied together by a management system to ensure development, implementation, and integration of the Program requirements. These thirteen elements consist of the following:  Employee Participation, Process Safety Information, Process Hazard Analysis, Pre-Startup Safety Review Program, Standard Operating Procedures, Training, Management of Change, Mechanical Integrity, Hot Work Permits, Contractor Qualifications, Incident Investigation, Compliance Audits, Emergency Planning and Response, and Trade Secrets.\n\n\n\nReddy Ice corporate and Reddy Ice-Gainesville management are committed to operating safe and compliant facilities for the protection of its employees, the public, and the environment. The facility has multiple safeguards pertinent to the anhydrous ammonia process. These include exhaust purge fans, controls that shut down the compressors if operating limits are exceeded, and the capability of shutting down the entire system if required. Ammonia detection units are installed to notify employees in the event of an ammonia leak.\n\n\n\nThe company has also developed an emergency action plan that includes procedures for notification of emergency authorities/agencies and the public, evacuation of personnel, and first responder duties by trained refrigeration personnel.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000099072,
                  "PreventionProgram3ID": 1000079793,
                  "ProcessChemicalID": 1000117212
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000075233,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Hall County Fire Service",
    "CoordinatingAgencyPhone": "7705316838",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075233,
      "SummaryText": "PROCESS SUMMARY\n\nReddy Ice-Gainesville (451), located at 624 Moreno Street SW, Gainesville, Georgia, is a manufacturer of ice for wholesale and retail distribution.  The facility is capable of producing up to 324 tons of ice per day and utilizes anhydrous ammonia (NH3) as the refrigerant for their ice manufacturing process and refrigerated storage.\n\n\n\nThe refrigeration system design is a closed-circuit direct ammonia process.  The system has numerous protective controls including motor overload, high discharge temperature, high discharge pressure, low suction pressure, low oil differential on all compressors, level control switches on all applicable vessels and approved pressure safety relief valves on all applicable equipment that discharge into a common header, which vents into a water-filled diffusion tank located outside the facility.\n\n\n\nThe system consists of two thermosyphon cooled rotary screw compressor packages, one water cooled reciprocating compressor package, two induced draft evaporative condensers, one thermosyphon receiver vessel, one controlled-pressure receiver vessel, six 50-ton tube ice machines, two liquid ammonia pump recirculator packages, four air-cooling axial fan evaporators, and a plate heat exchanger water chiller system.  A Programmable Logic Controller (PLC) monitors the system and controls system operations.  \n\n\n\nAn outside supplier delivers anhydrous ammonia to replenish the ammonia in the system as required.\n\n\n\nAnhydrous ammonia, when properly used, has proven to be a safe and reliable refrigerant.  The sharp odor of ammonia provides its own warning agent.  Practically all accidents involving anhydrous ammonia can be avoided through employee training, an increased knowledge base of the equipment, and the development, maintenance and implementation of effective operating and maintenance procedures for all ammonia equipment.\n\n\n\nThe Reddy Ice-Gainesville facility is committed to operating a safe and compliant ammonia refrigeration system"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075233,
      "SummaryText": " for the protection of its employees, the general public and the environment.  The facility has multiple safeguards pertinent to the ammonia process.  These include an ammonia detection and alarm system, continuous and automatic exhaust purge fans, controls which shut down the compressors if operating limits are exceeded, and the capability of shutting down the entire system remotely if required.  Administrative controls are in place that limits the storage vessels to their intended operating levels.\n\n\n\nThe company has developed an emergency action plan that includes notification of emergency authorities/agencies and the public, evacuation of personnel, and first responder duties by trained facility refrigeration personnel.\n\n\n\nRISK MANAGEMENT PREVENTION PROGRAM 3\n\nBased on the Reddy Ice-Gainesville facility's ammonia inventory, location, and requirement to meet OSHA PSM standards, it has been determined the facility is subject to the Prevention Program 3 requirements. This accident prevention program is a way to make safe operations and accident prevention systematic throughout the facility. Reddy Ice corporate management and Reddy Ice-Gainesville management are committed to operating a safe and compliant facility for the protection of its employees, the public, and the environment. A Combined Process Safety Management/Risk Management (PSM/RMP) Program has been developed to meet the accidental release prevention requirements of both EPA's Risk Management Program (40 CFR Part 68) and OSHA's Process Safety Management Standard (29 CFR 1910.119) under the Clean Air Act. The Combined PSM/RMP Program contains fourteen elements, establishing requirements for employee participation, process safety information, process hazard analysis, pre-startup safety review, operating procedures, training, management of change, mechanical integrity, hot work permits, contractors, incident investigation, compliance audits, emergency planning and response, and trade secrets. These elements"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075233,
      "SummaryText": " are tied together by a management system to ensure plant-wide development, implementation, and integration of all the Program requirements.\n\n\n\nMANAGEMENT SYSTEM\n\nA management system has been developed to oversee the implementation of the PSM/RMP Program elements. The Plant Manager has been identified as PSM/RMP Program Coordinator, with overall responsibility for developing, implementing, and integrating the Program requirements. Under the PSM/RMP Program, various responsibilities have been assigned to other individuals. The MP&V Supervisor is responsible for portions of the program closely tied to the refrigeration equipment and operation. Monthly safety meetings are conducted to present various safety topics and discussions and to address any safety issues brought up by employees during the month. \n\n\n\nHAZARD ASSESSMENT\n\nAs required by the Risk Management Program regulations, the Reddy Ice-Gainesville facility has conducted a hazard assessment including offsite consequence analyses (OCAs) for potential accidental releases of anhydrous ammonia. The OCAs describe the potential offsite exposure to surrounding areas from an accidental release. A worst-case release scenario and alternative release scenarios were developed and calculated using the EPA RMP*Comp modeling program, and the potentially affected offsite population and facilities were identified. \n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Reddy Ice-Gainesville facility has not had any releases that would require reporting as part of a five-year accident history.\n\n\n\nEMERGENCY PLANNING AND RESPONSE\n\nThe Reddy Ice-Gainesville facility operates under an Emergency Action Plan (EAP) that includes procedures for: notifying plant personnel, the public, and local emergency responders; emergency evacuation/response procedures; use of emergency alarms and equipment; employee training in evacuation and response procedures; first aid for ammonia exposure; and periodic review and updating of the emergency action plan. The plan is "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000075233,
      "SummaryText": "reviewed regularly for verification of data, and revised and updated as necessary to reflect changes in facility operations and personnel.\n\n\n\nAs required, the facility has coordinated emergency response activities with the Hall County LEPC and Gainesville Fire Department, and has appropriate mechanisms in place to notify emergency responders if needed. The ammonia inventory is verified and reported annually to the state and local authorities, and the plant is incorporated into the community emergency response plan developed under 42 USC.\n\n\n\nPLANNED CHANGES\n\nThe Reddy Ice-Gainesville facility is a modern refrigeration facility design to codes and standards applicable at the time of construction. No significant changes are planned to the facility or operations. Reddy Ice facilities operate an ongoing program of preventive and predictive maintenance to identify and implement changes that may result in improved safety and operations. \n\n"
    }
  ]
}