{
  "FacilityID": 1000012845,
  "FacilityName": "Varnco, Inc.",
  "FacilityStr1": "8 Washington Street",
  "FacilityStr2": null,
  "FacilityCity": "Ehrhardt",
  "FacilityState": "SC",
  "FacilityZipCode": "29081",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45009",
  "LEPC": "Ehrhardt Fire Department",
  "FacilityLatDecDegs": "33.055750",
  "FacilityLongDecDegs": "-081.010170",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "G. D. Varn",
  "OperatorStr1": "8 Washington Street",
  "OperatorStr2": null,
  "OperatorCity": "Ehrhardt",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29081",
  "OperatorZipCodeExt": null,
  "RMPContact": "G. D. Varn",
  "RMPTitle": "Vice President",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000161914",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-11-14 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-03-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-03-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-03-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-04-30 00:00:00",
  "DeRegistrationEffectiveDate": "2013-04-24 00:00:00",
  "AnniversaryDate": "2015-03-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.1052,
  "FRS_Long": -81.0226,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016021,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000012845,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000016401,
          "ProcessID": 1000016021,
          "NAICSCode": "11115",
          "_desc": {
            "NAICS_CODE": "11115",
            "NAICS_DESCRIPTION": "Corn Farming"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000018960,
          "ProcessID": 1000016021,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000518960,
          "ProcessID": 1000016021,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012845,
      "SummaryText": "1.  Facility Policy:  The owners, management, and employees at Varnco are committed to the prevention of any accidental releases of anhydrous ammonia.  If an accidental release should occur, the facility is prepared to work with the local fire company, or other authorities, to mitigate any release and minimize the impace of the release to people and the environment.\n2.  Facility Information:  The primary activity at the facility is the storage and blending of fertilizers for sale to farmers.  Anhydrous ammonia is received, stored, and distributed for direct application.  The maximum quantity stored would be 23,800 gallons in three storage tanks.  The maximum quantity handled would be the unloading of a tanker truck holding 40,000 pounds.  Anhydrous ammonia is CAS # 7664-41-7, NAICS #424910, Program Level 2.  We are covered by EPCRA section 302.  Our last safety inspection was 1/09/04 by the plant manager and the vice-president.  We are located at 8 Washington Street, Ehrhardt, South Carolina, 29081, Bamberg County, Lat 33.099229, Long. -81-017389.  Our business phone number is 803-267-3882.  The plant manager and Vice-President is G. D. Varn III, home phone number 803-267-8325.  He is the person responsible for the implementation of this plan and is our emergency contact.\n3.  The worst-case scenario and the alternative release scenario are as follows:\nA.  The worse-case release scenario would be the release of the total contents of a storage tank released as a gas over 10 minutes.  The maximum quantity released would be 47,666 pounds, which represents the volume of the largest storage tank at 85% capacity as limited by design standards.  The distance to the endpoint is .76 miles.  The residential population of this distance would be approximately 108 people.  This would include residences and commercial, office, and industrial areas.\nB.  The alternative release scenario is a transfer hose failure.  The distance to the endpoint is .33 miles with a release of 7127 pou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012845,
      "SummaryText": "nds in two minutes.  The residential population of this distance would be approximately 54 people.  This would include residences and commercial, office, or industrial areas.\n** The model used to compute these two scenarios was reference tables and equations contained in the Fertilizer Institute manual and based on their equations using a Degadis Model.\n4.  The Five Year Accident History of our company is as follows:  There have been no accidental releases of anhydrous ammonia in the past five years on site that have caused any deaths, injuries, or property damage at the facility nor to our knowledge have resulted in off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n5.  The Accidental Release Prevention Program:  The date of the most recent review of the safety information was 01/09/04.  This is also the date of completion of the most recent hazard review.  The major hazards identified that could occur are toxic release, over-pressurization, overfilling, and equipment failure.  Process controls in use are relief valves, check valves, manual shutoffs, interlocks, and excess flow devices.  The only change since the last hazard review update is a reduction in inventory.  The type of training provided is on the job and competency testing is done by demonstration and observation.  The equipment inspected on January 9 was hoses and valves.  We visually checked float gauges for level in tank to be sure tank is not filled over 85% of tank's capacity so safety pop-off valves will work properly.  We physically  checked valves for cracks or leaks.  We checked all fittings and hose connections for leaks.  We visually checked the expiration dates on hoses and one hose will need to be replaced due to expiration date.  We checked the breaker box to make sure electricity was off going to the pump.  No problems were found with valves, shutoffs, flow devices, or tanks.  The hose will be replaced by April 21, 2004.\n6.  The Emergency"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012845,
      "SummaryText": " Response Program:  The facility has a written emergency response plan that includes procedures for informing the public and local agencies responsible for responding to accidental releases.  The plan includes information on emergency health care and is filed in the EPA/DHEC notebook in the main office.\n7.  Planned changes to improve safety:  Safety improvement is an on-going process at the facility.  Periodic evaluations are performed to assess the maintenance of safe conditions.  There are no additional specific anhydrous ammonia safety recommendations for implementation at this time.  By insuring the safety of all employees at the facility, we are also insuring the safety of the public in general."
    }
  ]
}