{
  "FacilityID": 1000069897,
  "FacilityName": "Sioux River Ethanol LLC dbaPOET Biorefining-Hudson",
  "FacilityStr1": "29619 Spur Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Hudson",
  "FacilityState": "SD",
  "FacilityZipCode": "57034",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46083",
  "LEPC": "Lincoln County LEPC",
  "FacilityLatDecDegs": "43.096842",
  "FacilityLongDecDegs": "-096.477478",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.poet.com",
  "FacilityEmailAddress": "hudson@poet.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "POET Biorefining Hudson",
  "OperatorStr1": "29619 Spur Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Hudson",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57034",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeremy Halgerson",
  "RMPTitle": "General Manager",
  "FTE": 49,
  "OtherEPAFacilityID": "57034SXRVR29619",
  "EPAFacilityID": "100000186158",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "28.0501-44",
  "SafetyInspectionDate": "2017-09-21 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-05-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-05-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-05-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-05-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000087554,
      "AltID": "Ethanol Denaturing",
      "FacilityID": 1000069897,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000088776,
          "ProcessID": 1000087554,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000109282,
          "ProcessID": 1000087554,
          "ChemicalID": 125,
          "Quantity": 411390.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000609282,
          "ProcessID": 1000087554,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000069897,
      "SummaryText": "Facility Description\n\nThe Sioux River Ethanol, LLC facility (d/b/a POET Biorefining-Hudson) is located approximately 2.5 miles southwest of Hudson, South Dakota.  POET Biorefining-Hudson's main product is denatured ethanol for use as motor vehicle fuel.  The facility also produces vegetable (corn) oil and dried distillers grain.  Ethanol production at the facility was initiated in March 2004. POET Biorefining-Hudson produces ethanol using the dry mill method. Corn flour is mixed with water and pumped to a fermentation vessel.  A patented enzyme is then added to break the starch into fermentable sugars. Yeast is added to the mash to ferment the sugars to ethanol.  The fermented mash (beer) contains about 20% alcohol by volume and is distilled, then passed through a dehydration system to produce 200-proof anhydrous ethanol. After final dehydration, the ethanol is collected in two 2,000,000-gallon storage tanks.  During product load-out a denaturant (natural gas condensate, NGC) is added to make the ethanol unfit for human consumption, per federal and state requirements. NGC is blended in-line with the ethanol and transferred to vehicles for transport off-site. The denatured ethanol motor fuel may be shipped from the facility in tank trucks or rail cars.\n\n\n\nChemicals Regulated Under EPA's Chemical Accident Prevention Program\n\nThe NGC denaturant is the only CAPP/RMP regulated chemical which exceeds the CAPP quantity hresholds for applicability of the regulation. The CAPP/RMP regulated process consists of the NGC denaturant storage tank and the associated transfer/blending equipment and piping. The denaturant is added to the ethanol to a concentration of 2% to 5%. The greatest CAPP regulated quantity of denaturant in a tank, vessel or piping system is the quantity in Tank 805, the denaturant storage tank, located in the center containment area of the tank farm.  Line 1.17(c)of this submission is the total quantity (shell capacity) of Tank 805.  As recommended by U.S. EPA"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000069897,
      "SummaryText": "'s RMP Information Office on June 10,  2013, Line 4.4 of the Worst Case Scenario submission is taken as QR (Eq. D-1; Risk Management Program Guidance for Off Site Consequence Analysis, EPA 550-B-99-009, March, 2009.), i.e., pounds released per minute and multiplied times ten minutes to reflect the quantity that is estimated to evaporate and participate in an un-contained vapor cloud explosion.   Similarly, line 5.4 of the Alternative Case Scenario submission is taken as QR for one minute to reflect the quantity that is estimated to evaporate and participate in an un-contained vapor cloud fire.  Details of the calculation methodology are in Appendix D of the POET Biorefining-Hudson Desktop Risk Management Plan.     \n\n\n\nAccidental Release Prevention and Emergency Response Policy\n\nPOET Biorefining-Hudson is committed to the protection of it employees, the surrounding community and the environment from industrial materials used in the ethanol fuel production process. The company has developed an Emergency Action Plan (EAP) as per 29 CFR 1910.38(a).  In the event of a chemical emergency, POET Biorefining-Hudson's Emergency Coordinator will direct internal response activities to the extent they are within the qualifications and capabilities of company personnel, taking reasonable precautions to prevent or minimize the extent of release or the co-mingling of materials. There is no facility emergency response team. Employees within their designated work areas will respond to small releases, if such response does not pose a danger to their health or safety. In the event of a larger release, it is the policy of POET Biorefining-Hudson to notify the Hudson Fire Department, evacuate all employees at the facility, and provide technical and logistics support to the Fire Department Incident Commander.\n\n\n\nAccidental Release Prevention Program, and Chemical-Specific Prevention Steps\n\nPOET Biorefining-Hudson is committed to protection of the environment through the combined use of in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000069897,
      "SummaryText": "spection, maintenance, passive mitigation, employee training and response preparation.  Computer based maintenance software (Maximo) is utilized to implement automatic scheduling and work order generation for covered process  preventative maintenance inspections and tests.  Public access to the facility from the highway is restricted by a gate. Much of the property is fenced, limiting vehicle access. The plant is fully lighted. Personnel are typically on-site 24 hours a day, 7 days a week. There is a multi-camera video surveillance system installed at the property, and a general computer based alarm system. The alarm system includes monitoring of the storage tanks and denaturant blending system (level control and overfill monitors). The alarm system is monitored in the control room for abnormal conditions, which trigger visual control panel alarm lights, audible alarms and/or interlocks. The covered process  storage tanks have secondary containment and are included in the facility Spill Prevention Control and Countermeasure (SPCC) Plan.\n\n\n\nFive-Year Accident History\n\nThe facility has an excellent record with regard to minimizing recordable and reportable accidents. There have been no accidents since startup of the facility which require inclusion in the five-year accident history required by Subpart B of the CAPP/RMP regulation.\n\n\n\nPlanned Changes to Improve Safety\n\nThere are no current design projects or equipment procurements planned in this category at the time of this submission; however, POET Biorefining-Hudson's management and operations team is committed to an on-going system of production process review, evaluation of improvements in available technology (including safety features), SPOT (Safety Procedure Observation Tool or equivalent) checks by trained personnel, analysis of previous plant incidents (including near misses), and Prevention Program compliance audits, to identify opportunities to improve plant safety.  \n\n"
    }
  ]
}