{
  "FacilityID": 1000041227,
  "FacilityName": "Ponderay Newsprint Company",
  "FacilityStr1": "422767 SR20",
  "FacilityStr2": null,
  "FacilityCity": "Usk",
  "FacilityState": "WA",
  "FacilityZipCode": "99180",
  "Facility4DigitZipExt": "9771",
  "FacilityCountyFIPS": "53051",
  "LEPC": "Pend Oreille County LEPC",
  "FacilityLatDecDegs": "48.291667",
  "FacilityLongDecDegs": "-117.270833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 187311345,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ponderay Newsprint Company",
  "OperatorStr1": "422767 SR20",
  "OperatorStr2": null,
  "OperatorCity": "Usk",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99180",
  "OperatorZipCodeExt": "9771",
  "RMPContact": "Myron Johnson",
  "RMPTitle": "General Manager",
  "FTE": 156,
  "OtherEPAFacilityID": "WAD982657975",
  "EPAFacilityID": "100000056388",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "08-AQE-253",
  "SafetyInspectionDate": "2014-02-26 00:00:00",
  "SafetyInspectionBy": "US Department of Homeland Security",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-07 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 48.30889,
  "FRS_Long": -117.26028,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000050721,
      "AltID": "Sulfur Dioxide",
      "FacilityID": 1000041227,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000051183,
          "ProcessID": 1000050721,
          "NAICSCode": "322122",
          "_desc": {
            "NAICS_CODE": "322122",
            "NAICS_DESCRIPTION": "Newsprint Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000061474,
          "ProcessID": 1000050721,
          "ChemicalID": 49,
          "Quantity": 170000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000561474,
          "ProcessID": 1000050721,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041227,
      "SummaryText": "Ponderay Newsprint Company (PNC) owns and operates a newsprint mill, at 422767 SR 20 in Pend Oreille County at Usk, Washington.  Production facilities include a chip unloading and handling facility, a 600 T/D thermo-mechanical pulp mill, a 120 T/D waste paper recycling facility, and one paper machine capable of producing approximately 740 T/D of standard newsprint.  Auxiliary facilities include primary and secondary effluent treatment, a propane-fired steam boiler rated at 180,000 lbs./hour, and a fluidized bed boiler rated at 40,000 lbs./hour.\n\n\n\nPNC is committed to protecting people and the environment.  The company has formulated value statements to guide business decisions.  \"We value the safety and health of each team member.\" \"We value being environmentally responsible.\" and \"We value our reputation and having a positive impact in the community.\" are three of those statements.  PNC has implemented an environmental management system certified to the ISO 14001 standard.  The policy is to use current best management practices to minimize the possibility of an accidental release of a hazardous material.  In the event of an accidental release, active mitigation would take place immediately by a trained emergency response team that is maintained on-site 24 hours/day seven days/week.\n\n\n\nPNC has only one substance (Sulfur Dioxide, Anhydrous) regulated under the Risk Management Planning Standard (40 CFR 68 section 112(r)).  \n\nSulfur Dioxide is typically delivered by railcar and unloaded to the process.  This chemical is used to generate a brightening agent used in the pulping process.\n\n\n\nWe have had no reportable releases in the last five years, but in the unlikely event of an accidental release, our on-site Emergency Response team will respond immediately to the area to conduct active mitigation procedures.  PNC's Emergency Response team is also trained in industrial fire fighting, confined space rescue, high angle rescue, and medical response.  The team conducts rout"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041227,
      "SummaryText": "ine drills on responding to many types of emergency situations including Sulfur Dioxide release scenarios.  The team also participates in regularly scheduled joint training drills with local emergency response agencies.  Many members of the team are also members of their local volunteer fire departments.\n\n\n\nAlthough there are contingency plans in place should an emergency situation arise, the prevention of releases of hazardous substances to the environment is of the utmost importance.  PNC has many processes designed and implemented to prevent emergency situations from occurring, including:\n\n\n\n- An area Process team actually \"owns\" the Sulfur Dioxide system.  This team is made up of operators, a manager, electrical & instrumentation technicians, and mechanical maintenance technicians.  They have identified the critical equipment and maintain written preventive maintenance plans for that equipment.  The team also maintains detailed operating procedures and rigorous training and certification standards for all operators.  This ensures the personnel operating the Sulfur Dioxide process are fully qualified.\n\n\n\n- The higher risk tasks of connecting, disconnecting, and energizing SO2 unloading lines are strictly controlled through the detailed operating instructions, periodic training and auditing.\n\n\n\n- Preventive maintenance activities are scheduled and monitored through a computerized work order system.  These activities ensure the mechanical integrity of the Sulfur Dioxide system as well as the calibration of critical instrumentation.\n\n\n\n- The Sulfur Dioxide system is inspected daily by a certified operator.  An additional safety inspection of the Sulfur Dioxide system is done every six weeks by a team of operators, managers, and maintenance personnel as part of the mill safety inspection program.\n\n\n\n- A change management system ensures any change to the Sulfur Dioxide process is thoroughly researched and documented.  Training on process changes is an important part o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041227,
      "SummaryText": "f this system.\n\n\n\n- All Sulfur Dioxide lines, including unloading hoses, are purged with dry air and the Sulfur Dioxide is neutralized in a caustic tank prior to opening any piping.  All piping system pressure relief devices exhaust to this same tank.  This minimizes the occurrence of any incidental releases to the environment.\n\n\n\nPonderay Newsprint Company believes the safety of employees, the public, and the protection of the environment is very important.  Safety and environmental aspects are considered in all decisions.  Improvement in performance is \"built in\" to Ponderay Newsprint management systems.\n\n"
    }
  ]
}