{
  "FacilityID": 1000045044,
  "FacilityName": "Valley City Water Treatment Plant, Noth Dakota",
  "FacilityStr1": "840 3rd Ave. N.E.",
  "FacilityStr2": null,
  "FacilityCity": "Valley City",
  "FacilityState": "ND",
  "FacilityZipCode": "58072",
  "Facility4DigitZipExt": "0390",
  "FacilityCountyFIPS": "38003",
  "LEPC": "Barnes County LEPC",
  "FacilityLatDecDegs": "46.931556",
  "FacilityLongDecDegs": "-98.000139",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G7",
  "LatLongDescription": "PG",
  "FacilityURL": "www.valleycity.govoffice.com",
  "FacilityEmailAddress": "whesch@vallecity.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Not applicable",
  "Company2Name": "Not applicable",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Valley City",
  "OperatorStr1": "P.O. Box 240",
  "OperatorStr2": null,
  "OperatorCity": "Valley City",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58072",
  "OperatorZipCodeExt": "0390",
  "RMPContact": "Wade A. Hesch",
  "RMPTitle": "WTP Superintendent",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184338",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-05-21 00:00:00",
  "SafetyInspectionBy": " N.D. State Health Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 46.93156,
  "FRS_Long": -98.00014,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": null,
  "HorizontalAccMeasure": "1.",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055756,
      "AltID": null,
      "FacilityID": 1000045044,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056698,
          "ProcessID": 1000055756,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068039,
          "ProcessID": 1000055756,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568039,
          "ProcessID": 1000055756,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045044,
      "SummaryText": "Executive Summary\n\nChlorine Safety\n\nThe Valley City Water Treatment Plant incorporates several safety measures into their risk management program.  The most critical pertains to the chlorine gas that is stored in the plant in a single 2000-pound cylinder.  When the risk management plan is completed, the plant will be able to have two cylinders on site.  \n\nThe plant has an alarm system that detects chlorine gas at a concentration of seven parts per million.  When chlorine gas is detected, a buzzer, which can be heard throughout the building, is activated along with red lights at both the front and rear entrances of the building.  In the event that a leak occurred when no one was at the plant, these lights would warn operators before entering the building.\n\nThe plant also has an alarm test kit.  This allows the operators to produce a small amount of chlorine gas that can be sprayed on the sensor of the alarm.  This indicates to the operators whether or not the alarm is able to detect chlorine at the proper levels.\n\nA self-contained breathing apparatus is available, to be used to enter the plant during an alarm situation.  The plant also has a half-face respirator to quickly enter and exit an area that contains chlorine gas.  \n\nThe chlorine room where the cylinder is kept is sealed off.  In the event that a leak was to occur there, the chlorine gas would be contained within that room.  This room is also equipped with an air exchanger and an exhaust fan to the outside.  \n\nA lavatory that is adjacent to the chlorine room contains a Chlorine Institute Emergency Kit of Type B.  In the event that a chlorine cylinder was to develop a leak at a spigot, this kit could be used to seal it quickly.\n\nChlorine Handling\n\nWhen cylinders are delivered to the plant, a dolly is wheeled from the chlorine room out to the parking lot.  The truck sets the chlorine cylinder on the dolly, which is then pulled back into the chlorine room via a winch.  Changing from an empty cylinder to a full "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045044,
      "SummaryText": "one is done with two operators at hand as a precautionary measure.  However, in the event that a cylinder runs dry on the weekend, with only one operator on shift, the tank is switched by one operator.  This is not a favorable situation, and when two chlorine cylinders are allowed on site, the empty tank could be left until two operators are available to change it. \n\n\n\n\n\nGeneral Safety\n\nGeneral plant safety includes the implementation of eye wash stations and a shower.  In addition, operators review safety data sheets and MSDS sheets for chemicals that they handle.  Safety meetings are held weekly at which general safety tapes are shown and discussed.  These tapes are then kept on file at city hall where they can be easily referenced.  \n\nRisk Management Plan Need\n\n Completing a risk management plan for Valley CityA?s water treatment facility will enable them to increase the amount of chlorine that is kept on site.  At the current time without a risk management plan, only 2,500 pounds of chlorine can be kept on site.  The chlorine comes in 2,000-pound cylinders; this means that the operators must wait until the cylinder on site is down to 500 pounds before they can install a new cylinder.  Having such a small amount of chlorine on site could potentially lead to a tank running out before the new tank arrives, leaving the plant unable to chlorinate water, and essentially shutting it down.\n\nBy implementing a risk management plan; the water treatment plant could keep 4,000 pounds of chlorine on site.  This would alleviate the concern of potentially running out.  \n"
    }
  ]
}