{
  "FacilityID": 1000093084,
  "FacilityName": "Brick Township Municipal Utilities Authority",
  "FacilityStr1": "1551 Highway 88 West",
  "FacilityStr2": null,
  "FacilityCity": "Brick",
  "FacilityState": "NJ",
  "FacilityZipCode": "08724",
  "Facility4DigitZipExt": "2399",
  "FacilityCountyFIPS": "34029",
  "LEPC": "Brick Township  OEM",
  "FacilityLatDecDegs": "40.076785",
  "FacilityLongDecDegs": "-074.141692",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.brickmua.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brick Township Mun. Util. Auth.",
  "OperatorStr1": "1551 Highway 88 West",
  "OperatorStr2": null,
  "OperatorCity": "Brick",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08724",
  "OperatorZipCodeExt": "2399",
  "RMPContact": "Joseph Maggio, P.E.",
  "RMPTitle": "Director of Water Quality",
  "FTE": 147,
  "OtherEPAFacilityID": "NJD982720179",
  "EPAFacilityID": "100000069748",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-08-25 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-10-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-10-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-10-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-10-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 40.07667,
  "FRS_Long": -74.14222,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "1200",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115514,
      "AltID": "Chlorination System",
      "FacilityID": 1000093084,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000116965,
          "ProcessID": 1000115514,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144434,
          "ProcessID": 1000115514,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000644434,
          "ProcessID": 1000115514,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093084,
      "SummaryText": "Brick Township Municipal Utilities Authority (BTMUA) has developed and implemented an accidental release prevention program for the hazardous substance identified below.\n\n\n\nLOCATION: Main Facility - Chlorination Process Hazardous Substance:\n\n\n\nCHLORINE STORAGE AND SUPPLY: Chlorine cylinders are connected to vacuum regulators, rotometers and water vacuum ejectors. The system is completely under vacuum. If the vacuum is lost for any reason, a spring loaded valve on each of the regulators immediately closes to stop the flow of chlorine gas. The chlorine storage system is monitored by two independent leak detection systems. An active mitigation system, consisting of a chlorine emergency gas scrubber, is incorporated to control chlorine gas releases to the environment from the chlorine room. \n\n \n\nListed below is a brief description of BTMUA's risk management program as it pertains to the location detailed above.\n\n\n\nMANAGEMENT SYSTEM\n\n1. The goal of BTMUA's Risk Management Program (RMP) is to reduce the risk to employees and the public of injury or death from accidental release of chlorine. BTMUA's delineation of this RMP element details responsibilities which involve Directors and Supervisors.\n\n\n\nPROCESS SAFETY INFORMATION\n\n2. BTMUA's RMP includes chlorine information on its toxicity, physical data, permissible exposure limits, reactivity data, corrosivity data, and thermal and chemical stability data. Information concerning the chlorination process chemistry, maximum inventory, safe upper and lower limits for temperature, pressures and flows or compositions, evaluation of consequences of deviations, piping and instrumentation diagram, materials of construction, electrical classification, ventilation system design, design codes and standards, safety systems, electrical one-line diagram, site plan, fire and sewer water system piping diagrams and external forces and events data are included in this element. The Director of Water Quality has overall responsibility for maint"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093084,
      "SummaryText": "aining and implementing this RMP element in conjunction with the Water Treatment Plant Operations and Maintenance Supervisor and the Director of Compliance & Technology.\n\n\n\nPROCESS HAZARD ANALYSIS (PHA)\n\n3. BTMUA has conducted Chlorination Process Hazard Analysis to identify, evaluate and control the risk associated with the hazards of the chlorination process. Process Hazard Analysis Documentation includes analysis reports, dispersion modeling reports, action timetables and a record of meetings held in which process hazard analysis results are communicated. The Director of Water Quality implements the PHA planning in coordination with the Water Treatment Plant Operations and Maintenance Supervisor and the Director of Compliance & Technology. These PHA's are conducted and thoroughly reviewed and revalidated at least every five (5) years following the completion of the initial report by an in-house hazard analysis team.  The PHA alternate scenario analysis incorporated the Authority's chlorine gas scrubber as an active mitigation method.  The scrubber resulted in no off-site impacts, based on the scrubber's design discharge specifications of less than 1 ppm of chlorine gas released to the atmosphere.   It is noted that the PHA alternate scenario data entered in Section 3 does not allow chlorine release rates and distance to endpoint below 0.1 lbs/minute and 0.01 miles, respectively.  The actual mitigated chlorine release rate is 0.0000207 pounds/minute.  The actual distance to endpoint is 0.006 miles, although 0.01 miles is still within the property limits. \n\n\n\nSTANDARD OPERATING PROCEDURES (SOP'S)\n\n4. The purpose of this RMP element is to ensure that BTMUA maintains up-to-date accurate, written SOP's that provide clear instructions for our chlorination system. All procedures will contain simplified operating instructions as well as any attachments. These procedures are reviewed annually to certify that they accurately reflect current operating practice. Any revision"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093084,
      "SummaryText": "s to SOP's that include changes in our process chemical, technology and equipment and facility changes will be addressed in our management of change. The Water Treatment Plant Operations and Maintenance Supervisor has overall responsibility for implementing this element in coordination with the Director of Compliance & Technology.\n\n\n\nEXTRAORDINARILY HAZARDOUS SUBSTANCE (EHS) OPERATOR TRAINING\n\n5. The purpose of this RMP element is to ensure that BTMUA employees who work on or near the chlorination system process are adequately trained and understand the inherent process hazards and what appropriate response actions to take in case of an accidental chlorine release. This training consists of classroom and hands-on formats. Refresher training is given periodically throughout the year based on regulatory requirements and operational need basis. Training records are monitored and maintained by the Compliance & Safety Office. The Director of Water Quality, the Director of Compliance & Technology, and Water Treatment Plant Operations and Maintenance Supervisor share overall responsibility for developing and maintaining this RMP Element.\n\n\n\nMECHANICAL INTEGRITY/PREVENTATIVE MAINTENANCE (P/M)\n\n6. The purpose of this RMP element is to ensure the continued integrity of all the chlorination process equipment. The BTMUA PM Program identifies the direct and indirect EHS equipment as well as establishing, following and maintaining maintenance, inspection and testing schedules for this equipment. BTMUA maintains a comprehensive asset management program and capital improvement plan to promote responsible maintenance, investment and rehabilitation to the Authority's water system.  BTMUA enforces strict adherence to best management practices with reference to good housekeeping, preventative maintenance, and routine condition inspection. The Water Treatment Plant Operations and Maintenance Supervisor has the overall responsibility for implementing this RMP Element.  \n\n\n\nMANAGEMENT OF "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093084,
      "SummaryText": "CHANGE\n\n7. The purpose of this RMP is to ensure that BTMUA's chlorination process system changes are properly reviewed against original system design specifications. This is to determine that these changes can be accomplished safely and the chlorination system is ready to operate safely in accordance with original system design intent following the implementation of the change. Included in this element is document review, PHA development, employee training and record keeping. The Water Treatment Plant Operations and Maintenance Supervisor has the overall responsibility for this element in coordination with the the Director of Compliance & Technology.\n\n\n\nPRE-STARTUP SAFETY REVIEW (PSSR)\n\n8. Should any new processes regulated under OSHA Process Safety Management and EPA/TCPA RMP regulations be introduced into BTMUA operations, a PSSR will be performed to ensure that this Authority is ready to safely operate these new procedures or to assure that everyone can successfully and safely carry out any modification to the main facility chlorination process. The Director of Engineering is responsible for administering this RMP element in coordination with the Director of Water Quality, Water Treatment Plant Operations and Maintenance Supervisor, the Director of Compliance & Technology.\n\n\n\nCOMPLIANCE AUDITS\n\n9. The purpose of this RMP element is to ensure audits are performed to evaluate that BTMUA's chlorination process safety and risk management programs, and their implementation for compliance with the OSHA Process Safety Management and EPA/TCPA Risk Management Program Regulations. This audit is completed annually under the direction of the Director of Water Quality in coordination with the Water Treatment Plant Operations and Maintenance Supervisor, and the Director of Compliance & Technology.\n\n\n\nACCIDENT INVESTIGATION\n\n10. All chlorine leak accidents or potentially catastrophic events at the Authority will be promptly investigated. The purpose of the accident investigatio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093084,
      "SummaryText": "n element is to identify the underlying causes of an accident and to implement corrective actions to prevent the accident from reoccurring. The Water Treatment Plant Operations and Maintenance Supervisor is responsible for initiating this RMP element and ensures that any resulting corrective actions are addressed and documented.\n\n\n\nEMPLOYEE PARTICIPATION PLAN\n\n11. BTMUA recognizes that it is essential to involve its employees in the development and implementation of an OSHA PSM and EPA/TCPA RMP. The purpose of this plan is to define how employees will be involved. In each element of the RMP the Director of Water Quality has overall responsibility for maintaining and implementing this plan.  \n\n                                                       \n\nHOT WORK PERMIT\n\n12. The purpose of this element is to ensure that a hot work permit is issued for all hot work operations conducted near the main facility chlorination system processes. Hot work is defined as any work that many generate a source of ignition and includes but is not limited to welding, torch cutting, and use of spark producing equipment. The Water Treatment Plant Operations and Maintenance Supervisor is responsible for hot work permit procedures.\n\n\n\nCONTRACTOR SAFETY\n\n13. The purpose of this element is to ensure that only contractors with good health and safety programs are selected to perform work on and around the main facility chlorination process, and that the contractors and the process are properly prepared to safely complete the work. The Director and Supervisor in charge of employing the contractor and the Director of Compliance & Technology share jointly in the implementation of this RMP element.\n\n\n\nEMERGENCY PLANNING AND RESPONSE\n\n14. The purpose of this element is to ensure that BTMUA maintains up-to-date and complete written emergency action plans (EAP's) and effective response capabilities for the main facility chlorination process. Comprehensive emergency action plans, when combined with emer"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000093084,
      "SummaryText": "gency response training and drills, can effectively minimize the impact of an accidental release by ensuring proper and quick facility response.\n\nBTMUA's Emergency Response Program was designed and updated according to the EPA's Integrated Contingency Plan Guidance. This ER Plan defines the response organization, coordination with Brick Township and Ocean County Office of Emergency Management Offices, equipment, response procedures, training, notification procedures and drills. The Director of Water Quality and the Director of Compliance & Technology will be responsible for implementing and maintaining the procedures in this RMP element. The ER Plan is updated according to recommendations resulting from system deficiencies uncovered by the periodic drills or incidents. All incidents are investigated to determine root cause and system deficiency correction. BTMUA has experienced no reportable accidents in the past five years. Additionally, operator refresher and system update training are conducted in compliance with our operator training program. The preventive maintenance program conducts scheduled system inspections and maintenance to assure the proper operation of process and leak detection devices. Management of change is monitored by the Director of Water Quality to assure that this program stays current and implemented according to industry accepted standards for design and operation.\n\n\n\nThe chlorination system is currently state of the art for design and operation. An Inherently safer technology (IST) review was initially conducted in 2008 and updated in 2012, 2017 & 2021 to identify alternatives to minimize the potential for a chlorine release. As discussed above, the Authority installed a chlorine gas scrubber which was officially brought on line in September 2021. \n\n\n\nBTMUA has completed a vulnerability assessment in accordance with the Bioterrorism Act of 2002 and subsequently completed a Risk and Resilience Assessment in accordance with the America's Wat"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000093084,
      "SummaryText": "er Infrastructure Act of 2018. These assessments were conducted by consultants specializing in water utilities security and applicable Authority representatives including staff from the water treatment facility. Selected recommendations have been incorporated to protect personnel, property and the integrity of the chlorination system.  BTMUA also periodically evaluates the physical security and resilience items outlined in these assessments and actively incorporates relevant improvements in the capital improvement plan. \n\n\n\nANNUAL REPORTS\n\n15. The purpose of this element is to ensure that BTMUA submits an annual report to the NJDEP reflecting the risk management activities for the 12 month period ending on the anniversary date within 90 days of the anniversary date. Annual reports are required to be submitted to the NJDEP on all TCPA RMP regulated processes, the main chlorination facility being that process for the BTMUA. The Director of Compliance & Technology is responsible for completing this report with assistance from the Director of Water Quality.\n\n\n\nTEMPORARY DISCONTINUANCE OF EHS USE, STORAGE AND HANDLING\n\n16. The purpose of this element is to ensure that if BTMUA temporarily discontinues using, storing, handling and generating chlorine in the covered process (main facility chlorination process) or temporarily stores it at less than threshold quantity (1,000 lbs.), it shall continue activities required by the TCPA RMP regulation until the date a consent agreement or consent agreement addendum, that is signed by BTMUA, is signed by the NJDEP. The Director of Water Quality, Water Treatment Plant Operation and Maintenance Supervisor, and the Director of Compliance & Technology will be responsible for implementing this element.\n\n\n\nNEW COVERED PROCESSES\n\n17. The purpose of the element is to ensure that if BTMUA constructs or add a new EHS service that falls under Program 3, the necessary approvals and documentation are completed prior to any EHS startup. The Dire"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000093084,
      "SummaryText": "ctor of Water Quality, Water Treatment Plant Operation and Maintenance Supervisor, and the Director of Compliance & Technology will be responsible for implementing this element."
    }
  ]
}