{
  "FacilityID": 1000023736,
  "FacilityName": "HWRT Terminal - N  Little Rock, LLC",
  "FacilityStr1": "2626 Central Airport Road",
  "FacilityStr2": null,
  "FacilityCity": "North Little Rock",
  "FacilityState": "AR",
  "FacilityZipCode": "72117",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05119",
  "LEPC": "North Little Rock LEPC",
  "FacilityLatDecDegs": "34.776389",
  "FacilityLongDecDegs": "-092.176278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "jdonahue@piasa-hwrt.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "HWRT Terminal-N Little Rock, LLC",
  "OperatorStr1": "2626 Central Airport Road",
  "OperatorStr2": null,
  "OperatorCity": "North Little Rock",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72117",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Leslie",
  "RMPTitle": "Terminal Manager",
  "FTE": 2,
  "OtherEPAFacilityID": "ARD000719997",
  "EPAFacilityID": "100000196977",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-03-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-09-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-09-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-09-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-09-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000028974,
      "AltID": "ButaneUnloading/Injection",
      "FacilityID": 1000023736,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000029273,
          "ProcessID": 1000028974,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034697,
          "ProcessID": 1000028974,
          "ChemicalID": 118,
          "Quantity": 144300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000534697,
          "ProcessID": 1000028974,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023736,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1.0    FACILITY DESCRIPTION\n\nThe HWRT Terminal - N Little Rock, LLC (HWRT) facility is a terminal for the storage and distribution of various fuels.  Petroleum products (i.e., gasoline and diesel) are received by pipeline.  Transport trucks deliver ethanol and other additives to the facility.  Transport trucks then deliver the products to the facilityA?s customers.  HWRT has a 30,000-gallon butane storage tank and a butane injection process at the facility.  Butane has been identified by the U.S. Environmental Protection Agency as a regulated substance subject to section 112 (r) of the Clean Air Act, which requires the preparation of this Risk Management Plan (RMP).  HWRT is also subject to the OSHA process safety management standard and hence, it is subject to the requirements of a Program Level 3 Risk Management Plan.\n\nThe initial construction of the terminal facility was completed in 1965, which included construction of Tanks NLR-201 through NLR-204.  Additional tanks were constructed later.  HWRT purchased the terminal from Crown Central Petroleum Corporation in 2004.\n\nThe facility is located at 2626 Central Airport Road in North Little Rock, Arkansas.  The immediate vicinity is sparsely populated in an industrial area near Interstate Highway 40.  The facility has fourteen fuel and additive storage tanks having capacities ranging from 200 gallons to 3.528 million gallons.  Each of these tanks is provided with adequate secondary containment except for butane storage tank for which secondary containment is not necessary as butane is gas at ambient conditions.  \n\n2.0    PREVENTION PROGRAM\n\nIt is HWRT's policy to adhere to all applicable federal, state, and local rules and regulations.  The owners and management of this facility regard employee and public safety as a very serious matter and have taken many precautions to maintain a safe working and public environment.  Some of these precautions include:\n\n------    Generating a Facility Response Plan (FRP);"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023736,
      "SummaryText": "\n------    Generating a Spill, Prevention, Control and Countermeasure (SPCC) Plan;\n------    Instituting safe operating procedures;\n------    Training employees in safety programs and procedures; and,\n------    Coordinating with the Local Emergency Planning Committee (LEPC).\n\nThe FRP includes information regarding emergency response, hazard identification, various discharge scenarios, descriptions of periodic drills and exercises, and describes employee training.  The SPCC Plan includes similar information as well as facility inspection forms.  Employees are typically provided with emergency response training, on-the-job training, spill prevention and spill response training, and other supplemental training.\n\n3.0    PROCESS DESCRIPTION\n\nThe butane injection process at the facility is fairly simple.  Liquified butane gas is  delivered in tank trucks and pumped into the butane tank.  Butane is stored under ambient temperatures which can exceed 100 degrees F in the summer.  Butane is injected into gasoline by pumping it into the pipeline as the gasoline is being delivered to HWRT.  HWRT also has the capability to bypass the storage tank and inject the butane directly from the delivery truck into the gasoline pipeline.\n\n4.0    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThis facility has a strong commitment to the safe handling of butane and other flammable materials and to minimizing the probability of an accidental release.  This is achieved through a combination of safety equipment, personnel training, and operating procedures.  The safety equipment includes excess flow valves, pressure relief valves, and emergency shut-off valves.  The butane tank and supporting equipment was installed and tested in September, 2006.  An inspector from the Liquified Petroleum Gas Board inspected the process, pressure-tested the tank, and approved the installation on September 18, 2006, prior to HWRT initiating the butane process at this facility.\n\n5.0    FIVE-YEAR ACCIDENT HISTORY\n\nThis facility has n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000023736,
      "SummaryText": "ot had a reportable release of butane or any regulated substance as defined in 40 CFR 68.3 and 68.130 (or an OSHA highly hazardous chemical as defined in 40 CFR 29.1910(b)) within the last five years.\n\n6.0    EMERGENCY RESPONSE PROGRAM\n\nThe facility has a comprehensive emergency response program, a Facility Response Plan, and a Spill, Prevention, Control and Countermeasure (SPCC) Plan.  The Facility Response Plan contains specific actions to be taken in response to an accidental release of butane, procedures to inform the public and health care information.  All employees working with butane are trained in handling flammable materials and are provided with annual refresher training.  This plan has been coordinated with the Pulaski County and North Little Rock LEPCs.  The telephone number for the North Little Rock LEPC is 501-340-5365.\n\n7.0    PLANNED CHANGES TO IMPROVE SAFETY\n\nLast PHA conducted on 9/30/2010 had recommended a security review of the facility. This review was conducted on 12/10/2010. Even though the security was deemed adequate, a closed-circuit TV camera will be installed near the butane storage tank. Anticipated date for the camera installation is by 12/31/2011.\n\n"
    }
  ]
}