{
  "FacilityID": 1000072493,
  "FacilityName": "Campo Viejo Plant",
  "FacilityStr1": "1548 County Road 165",
  "FacilityStr2": null,
  "FacilityCity": "Plains",
  "FacilityState": "TX",
  "FacilityZipCode": "79355",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48501",
  "LEPC": "Yoakum County LEPC",
  "FacilityLatDecDegs": "33.1756",
  "FacilityLongDecDegs": "-103.0046",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.stakeholdermidstream.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Stakeholder Midstream, LLC",
  "Company2Name": null,
  "CompanyDUNS": 80576235,
  "Company2DUNS": 80597481,
  "OperatorName": "Stakeholder Midstream, LLC",
  "OperatorStr1": "401 E Sonterra Blvd",
  "OperatorStr2": null,
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78258",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000239565",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-08-15 15:21:56",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-05 08:05:27",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-11-05 08:05:27",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 33.149918,
  "FRS_Long": -102.991166,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000090859,
      "AltID": "Natural Gas Processing",
      "FacilityID": 1000072493,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000113609,
          "ProcessID": 1000090859,
          "ChemicalID": 98,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000113608,
          "ProcessID": 1000090859,
          "ChemicalID": 155,
          "Quantity": 670000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000099468,
              "ProcessChemicalID": 1000113608,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000099469,
              "ProcessChemicalID": 1000113608,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000099467,
              "ProcessChemicalID": 1000113608,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000099470,
              "ProcessChemicalID": 1000113608,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000092100,
          "ProcessID": 1000090859,
          "NAICSCode": "21113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000077094,
              "Process_NAICS_ID": 1000092100,
              "SafetyReviewDate": "2018-07-30 00:00:00",
              "PHA_Date": "2018-03-29 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-10-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-10-22 00:00:00",
              "TrainingReviewDate": "2018-09-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-09-24 00:00:00",
              "EquipmentInspectionDate": "2018-10-22 00:00:00",
              "EquipmentTested": "P-1766 & 1767",
              "ChangeMgmtDate": "2018-09-06 00:00:00",
              "ChangeMgmtReviewDate": "2018-09-06 00:00:00",
              "PreStartupReviewDate": "2018-10-29 00:00:00",
              "ComplianceAuditDate": "2018-10-22 00:00:00",
              "AuditCompletionDate": "2018-10-22 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-09-06 00:00:00",
              "HotWorkPermitReviewDate": "2018-09-27 00:00:00",
              "ContractorSafetyReviewDate": "2018-10-22 00:00:00",
              "ContractorSafetyEvalDate": "2018-09-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000096932,
                  "PreventionProgram3ID": 1000077094,
                  "ProcessChemicalID": 1000113608
                },
                {
                  "PrimaryKey": 1000096933,
                  "PreventionProgram3ID": 1000077094,
                  "ProcessChemicalID": 1000113609
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000072493,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-10-02 00:00:00",
    "ERTrainingDate": "2018-10-11 00:00:00",
    "CoordinatingAgencyName": "Plains Fire Department",
    "CoordinatingAgencyPhone": "8064562288",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000072493,
      "SummaryText": "valuations. The studies were undertaken by a team of qualified personnel with expertise in engineering and process operations and will be revalidated at regular intervals of no more than 5 years. All findings related to the hazard analysis are addressed in a timely manner.  The latest PHA was conducted on March 3rd, 2018.\r\n\r\n- Operating Procedures - For the purposes of safely conducting activities within the covered process, Campo Viejo site maintains written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent with the process safety. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes. Safe work practices have been developed to provide for the control of hazards during operations such as lockout/tag out; confined space entry; opening process equipment or piping; and control over entrance into a stationary source by maintenance, contractor, laboratory, or other support personnel. These safe work practices apply to employees and contractor employees.\r\n\r\n- Training - A training program is in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Initial training on gas plant operations is provided, and refresher training will be conducted at least every three years or more frequently as needed. Employee training is documented and records of training will be maintained onsite for at least three years. \r\n\r\n- Mechanical Integrity - Written procedures are in place for maintaining the on-going integrity of process equipment, which incorporates training for process maintenance activities, inspection and testing, corrective action for equipment deficiencies, and the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000072493,
      "SummaryText": "application of quality assurance measures.  Documented maintenance checks are carried out on process equipment to ensure proper installation and operation.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified and trained personnel carry out maintenance operations at the site.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  The plant also incorporates quality assurance measures to ensure that equipment and parts are suitable for the process application for which they will be used.\r\n\r\n-Management of Change - Written procedures are in place to manage changes in process chemicals, technology, equipment and procedures.  These procedures are updated as needed.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\n-Pre-startup Reviews - Pre-startup safety reviews related to new processes and to modifications in established processes will be conducted as a regular practice at the Campo Viejo site.  These reviews are conducted to confirm that construction and equipment is in accordance with design specifications, and safety, operating, maintenance, and emergency procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\n-Compliance Audits - Regularly scheduled audits will be conducted to determine whether the provisions set out under the RMP rule are being implemented.  These audits will be carried out by at least one person knowledgeable in the process and conducted at least once every three years.  Audit findings will be documented in a report and corrective actions required from the audits will be undertaken in a safe and prompt manner and documented.\r\n\r\n-Incident Investigation - An"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072493,
      "SummaryText": "Stakeholder Midstream, LLC (Stakeholder), owns and operates a Natural Gas processing facility (Campo Viejo) located in Yoakum County, Texas.  The facility includes front-end liquids handling, an amine treater and acid gas injection well, a cryogenic processing plant with the capacity to process 60 million cubic feet per day, and a nitrogen rejection unit. \r\nA.\tACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\r\nIt is Stakeholder's policy to adhere to all Federal and State rules and regulations.  The Campo Viejo site has established a commitment to worker and public safety as well as the environment. This commitment is demonstrated by a Prevention Program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at the facility. It is Stakeholder's policy to implement appropriate controls to prevent possible releases of regulated substances. If a release does occur, Stakeholder has a comprehensive Emergency Response Plan (ERP) in which a Management Team is form that has an Incident Commander to facilitate the response and ensure overall safety during mitigation measures. The ERP details the steps to take in case of an accidental release as well as the reporting guidelines to State agencies and LECP.   Stakeholder has also coordinated response with Plains Fire Department.  The most recent review of the ERP was done on October 2, 2018.\r\nThe stationary source and regulated substances handled:\r\nThe Campo Viejo site includes front-end liquids handling, an amine treater and acid gas injection well, a cryogenic processing plant with the capacity to process 60 million cubic feet per day, and a nitrogen rejection unit. Residue gas from the process is compressed for sales and natural gas liquids are pumped to a pipeline sales point. The Campo Viejo Gas Processing Facility handles Hydrogen Sulfide (H2S), a Toxic chemical (listed on EPA Risk Management Program Regulation 40 CFR 68 Table 1)."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072493,
      "SummaryText": "There is 15,000 ppm H2S in the inlet gas stream and 150,000 ppm in the Acid Gas stream; however, the estimated amount handled at the site is less than the threshold quantity of 10,000 lbs (as listed in 40 CFR Part 68 Table 1).  Utilities will include dehydrator regeneration, refrigeration, heat medium oil, fuel gas, emergency flares, instrument air, and drains. Pressure relief devices with heavier than air mixtures are routed to the flare for safe disposal.\r\nThe Campo Viejo Gas Processing Facility does handle Regulated Flammable Substances that meet the criteria for the National Fire Protection Association's (NFPA) 4 rating and are handled in quantities that exceed EPA's threshold of 10,000 pounds.  \r\n\r\nB.\tOFFSITE CONSEQUENCE ANALYSIS\r\nSince there are no toxic chemicals handled above the threshold quantities at the Campo Viejo facility, the Offsite Consequence Analysis was carried out only for the flammable mixtures. \r\na.\tWorst Case Scenario:\r\nThe off-site consequence analysis assumes that the vessel with the largest amount of flammable mixture (Product Surge Tank (PV-1422) had a catastrophic failure resulting in a vapor cloud explosion (VCE).  RMP*Comp&trade; was used to calculate the distances to 1 psi of overpressure endpoint.  As described in the EPA Risk Management Program Guidance for Offsite Consequence Analysis, the worst-case scenario was carried out based on the predominant regulated flammable component of the mixture, which in this case is ethane. Meteorological conditions for worst-case scenarios are defined in 40 CFR §68.22(b) as atmospheric stability class F (stable atmosphere) and wind speed of 1.5 m/s (3.4 mi/h).\r\nThe entire weight of the mixture is used to calculate the distance to the 1 psi overpressure endpoint. The scenario involved an uncontrolled release of 130,078 lb.  RMP Comp was used to predict a distance of 0.4 miles to the 1 psi endpoint.  \r\n\r\nb.\tAlternative Case scenarios:\r\nThe alternative-case scenario considered was a 1 inch hole or p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072493,
      "SummaryText": "uncture on Product Surge Tank (PV-1422) resulting in vapor cloud fire. Since ethane and propane have the same LFL (36 mg/L), propane was selected as the predominant regulated component of the mixture as it resulted in a greater distance to LFL endpoint. RMP Comp &trade; was used to predict a distance of 0.2 miles to LFL endpoint, with a wind speed of 3 m/s and a stability class D with ambient air temperature (77°F).  Meteorological conditions were given in the RMP*Comp program and followed the methodology described in section 10 of the EPA Risk Management Program Guidance for Offsite Consequence Analysis for rural areas.\r\n\r\nC.\tGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM:\r\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements, which are set out under 40 Code of Federal Regulations (CFR) Part 68 of the EPA. The Campo Viejo site is a PSM-covered facility and, as such, it has a viable process safety program. Workers and their representatives are consulted and have access to information regarding all PSM elements. Complete and accurate information on the process technology, process equipment, and hazardous characteristics and physical properties of all chemicals and intermediates for all covered processes is maintained. \r\n\r\n- Process Safety Information - Campo Viejo site maintains a detailed record of process safety information that describes the hazards of regulated substances, operating parameters and equipment designs associated with all processes. Much of this information was compiled during the preparation of the Process Hazard Analysis (PHA). Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety data sheets (SDS's).\r\n\r\n- Process Hazard Analysis - The facility conducts comprehensive studies to ensure that hazards associated with the processes are identified and controlled efficiently. The HAZOP method is used to perform these e"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000072493,
      "SummaryText": "procedures insisted on by Stakeholder, and familiarized with the Hot Work Permit Policy and the Lock Out/Tag Out Procedures used at the Campo Viejo site.  Contractors are informed of all the procedures for emergency actions should an accidental release of a regulated substance occur, and this information includes evacuation routes and assembly points.  Stakeholder will document that the contractor has received and understands the training.\r\n\r\n-Chemical Specific Prevention Steps - The processes at Campo Viejo site have hazards that must be managed to ensure continued safe operation.  Safety features applicable to prevention of accidental releases of regulated substances at the facility are in place to help prevent potential accidental scenarios that could be caused by equipment failures and human error.  \r\n\r\nD.\tFIVE-YEAR ACCIDENT HISTORY  \r\nThe Campo Viejo site is a new facility and has not had any accidental release as provided in 40 CFR §68.42 that reached beyond the property line or resulted in deaths on site, injuries or significant property damage on site, or any offsite deaths, injuries, evacuations, sheltering-in-place, property damage or environmental damage since it started operations. \r\n\r\nE.\tEMERGENCY RESPONSE PROGRAM \r\nThe facility has a written Emergency Response Plan (ERP) to deal with accidental releases of regulated substances which is in place to protect worker and public safety, as well as the environment.  The Plan includes the designation of an Incident management Team that will facilitate the response and ensure overall safety during mitigation measurements.  The Plan describes actions to be taken including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.  Employees receive training in emergency procedures.  To ensure proper functioning, the emergency response equipment is regularly inspected and serviced.  In addition, the Plan is promptly updated to reflect any pertinent ch"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000072493,
      "SummaryText": "anges taking place within the processes that would require a modified emergency response.  The emergency response activities have been coordinated with the Plains Fire Department.  The most recent review of the ERP was done on October 2, 2018.\r\n\r\nF.\tPLANNED CHANGES TO IMPROVE SAFETY \r\nThe Campo Viejo site is committed to continuously improve the safe handling of the flammable mixtures in the process by implementing preventative maintenance programs, inspection programs, and employee training in the safe operation of the equipment; as well as periodic safety reviews and the incident investigation program."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000072493,
      "SummaryText": "y incident that results in, or could reasonably result in, a catastrophic release of a regulated substance will be promptly investigated.  An incident investigation will be initiated as promptly as possible, and will involve at least one person knowledgeable of the process involved.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  A report will be prepared at the conclusion of the investigation and will include any resolutions and corrective action. \r\n\r\n-Employee Participation - Stakeholder believes that PSM and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\r\n\r\n-Hot Work Permit - Hot work permits for hot work operations conducted on or near a covered process will be issued by facility safety leaders.  The permit shall document that the fire prevention and protection requirements have been implemented prior to beginning the hot work operations; it shall indicate the date(s) authorized for hot work; and identify the object on which hot work is to be performed.  The permit will be kept on file until completion of the hot work operations.\r\n\r\n-Contractors - Stakeholder hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Before any contractors are allowed to work on the Campo Viejo site, they undergo an orientation conducted by the PSM team.  During this orientation contractors are made aware of the known potential hazards related the contractor's work, the hazards of regulated substances, the safe work"
    }
  ]
}