{
  "FacilityID": 1000080140,
  "FacilityName": "Ashland Neal Plant",
  "FacilityStr1": "100 Big Sandy River Road",
  "FacilityStr2": null,
  "FacilityCity": "Kenova",
  "FacilityState": "WV",
  "FacilityZipCode": "25530",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54099",
  "LEPC": "Cabell/Wayne County LEPC",
  "FacilityLatDecDegs": "38.367444",
  "FacilityLongDecDegs": "-082.593500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "WWW.ASHLAND.COM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5003264,
  "ParentCompanyName": "Ashland LLC",
  "Company2Name": null,
  "CompanyDUNS": 5003264,
  "Company2DUNS": 5003264,
  "OperatorName": "Ashland LLC",
  "OperatorStr1": "100 Big Sandy River Road",
  "OperatorStr2": null,
  "OperatorCity": "Kenova",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "25530",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Dunsmore",
  "RMPTitle": "Plant Manager",
  "FTE": 46,
  "OtherEPAFacilityID": "25530SHLNDBIGSA",
  "EPAFacilityID": "100000040476",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "R30-09900009-17",
  "SafetyInspectionDate": "1998-01-30 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.36744,
  "FRS_Long": -82.5935,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100057,
      "AltID": "Butane Process",
      "FacilityID": 1000080140,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101297,
          "ProcessID": 1000100057,
          "NAICSCode": "32519",
          "_desc": {
            "NAICS_CODE": "32519",
            "NAICS_DESCRIPTION": "Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125327,
          "ProcessID": 1000100057,
          "ChemicalID": 118,
          "Quantity": 500000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625327,
          "ProcessID": 1000100057,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080140,
      "SummaryText": "The Ashland Neal Plant relies on numerous policies and programs to ensure early identification of and proper response to potential emergencies, including :\n\n\n\n     Training and drills in emergency preparedness, hazardous materials training, disaster response and control, first-aid, and fire-  and-rescue techniques;\n\n\n\n     Frequent auditing of all preparedness programs, safety training and education;\n\n\n\n     Regular review, follow-up, and maintenance of all company operations and equipment.\n\n\n\nOur facility regularly coordinates with local fire departments and emergency responders through tours, inspections and joint emergency drills.  Some of our employees are members of the Local Emergency Planning Committees, area volunteer fire departments, and local emergency response units.  Our facility has written emergency preparedness plans that are updated regularly.  \n\n\n\nOur facility participates in the local CAP and actively works with our neighbors to stay informed and maintain our commitment to safety.  Ashland makes every effort to support our communities through sponsorship of local activities and participation in local organizations. \n\n\n\nA description of your facility and the regulated substances handled:\n\n\n\nThis facility produces maleic anhydride by the oxidation of butane and air in the presence of a catalyst.  Butane is the single regulated substance handled above the regulatory threshold quantity.  The facility receives truck deliveries of butane into three (3) storage tanks.\n\n\n\nFor more information contact the Plant Manager.\n\n\n\nThe worst-case release scenario:\n\n\n\nThe USEPA RMP regulations require the worst-case release scenario to assume that the entire contents of the largest vessel are released.  This event is highly unlikely and has never occurred at our facility.  The USEPA also requires the worst case scenario for butane to be a vapor cloud explosion of the released material.  Vapor cloud explosions are extremely rare events, even when large quantities of "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080140,
      "SummaryText": "flammable materials are released.  Based on our analysis using USEPA approved methods, the worst-case release scenario for butane could potentially affect offsite receptors.  In the worst case analysis, a restricted volume was considered as an administrative control.\n\n\n\nThe alternative release scenario:\n\n\n\nThe USEPA RMP regulations require an analysis of the alternative-case release scenario.   The alternative-case release scenario represents an accidental release that is more reasonable than the worst-case but is still highly unlikely to occur.  Based on our analysis using USEPA-approved methods, the alternative case release scenario for butane could possibly impact offsite public receptors.  In the alternative-case analysis, a restricted volume was considered as an administrative control and an excess flow valve was considered as an active mitigation measure. \n\n\n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\n\n\nThis facility is operated in strict accordance with the USEPA prevention program requirements.  A written management system is in place with operating and maintenance procedures for the covered process.  These procedures ensure rigorous training for operations employees, numerous management checks and balances and strict attention to changes in the operations; with a through review and examination of potential incidents that could lead to an accidental release.  Ashland maintains an 24 hour emergency reporting system that can speedily coordinate emergency responders with top management and quickly communicate key first aid or medical information to local health care providers.  This facility has emergency medical treatment information readily available for use in the event of an emergency.\n\n\n\nFive-year accident history:\n\n\n\nDuring the past five years, we have not had a release of the regulated substance that resulted in or could have resulted in an off-site impact.\n\n\n\nThe emergency response program:\n\n\n\nOur employee"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080140,
      "SummaryText": "s do not respond to accidental chemical releases of the regulated substance, but rely on local emergency responders.  Our employees regularly undergo training in defensive emergency response activities.  Our facility regularly invites the local fire department and emergency responders to tour and inspect our plants, gain familiarity with our operations, and participate in joint emergency drills.  Our facility has written emergency preparedness plans that are updated regularly. \n\n\n\nPlanned changes to improve safety:\n\n\n\nOur facility continually evaluates and implements employee suggestions and recommendations resulting from process hazard analyses and operating occurrences.  We make changes to improve safety based on comments and information developed within our organization and the industry.  Toward continuous improvement, we are looking at ways to minimize risk through process improvement and  process design."
    }
  ]
}