{
  "FacilityID": 1000063037,
  "FacilityName": "Carpenter Company Lakeland 60",
  "FacilityStr1": "5150 Frontage Rd South",
  "FacilityStr2": null,
  "FacilityCity": "Lakeland",
  "FacilityState": "FL",
  "FacilityZipCode": "33815",
  "Facility4DigitZipExt": "0901",
  "FacilityCountyFIPS": "12105",
  "LEPC": "District 7 LEPC",
  "FacilityLatDecDegs": "28.034884",
  "FacilityLongDecDegs": "-082.050368",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "cnovotny@carpenter.com",
  "FacilityDUNS": 3109444,
  "ParentCompanyName": "Carpenter Company",
  "Company2Name": null,
  "CompanyDUNS": 3109444,
  "Company2DUNS": 3109444,
  "OperatorName": "Carpenter Company",
  "OperatorStr1": "5016 Monument Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Richmond",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23230",
  "OperatorZipCodeExt": null,
  "RMPContact": "Clinton Novotny",
  "RMPTitle": "Division Manager",
  "FTE": 143,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000157475",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1050192-017-AV",
  "SafetyInspectionDate": "2017-02-09 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-04-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-04-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-04-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-04-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 28.03643,
  "FRS_Long": -82.04885,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000079102,
      "AltID": "Urethane Manufacturing",
      "FacilityID": 1000063037,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000080260,
          "ProcessID": 1000079102,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098527,
          "ProcessID": 1000079102,
          "ChemicalID": 77,
          "Quantity": 937716.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598527,
          "ProcessID": 1000079102,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063037,
      "SummaryText": "1.    ACCIDENTAL RELEASE PREVENTION & EMERGENCY RESPONSE\n\n\n\nThe Carpenter Co., both Corporate and Lakeland Division, is committed to comply fully with federal, state, and local rules and regulations regarding the proper handling, use, storage, and emergency response preparedness to prevent accidental releases of chemicals, toxic or otherwise.  Furthermore Carpenter Co. is committed to protecting the health and welfare of its employees, the surrounding community, and the environment.  To achieve this goal procedures, policies, preventative maintenance, and training are provided.  Accidental release prevention begins with the safety devices inherent in the design of the facility, safe handling procedures, and checklists used, as well as training imparted to our personnel.  In addition, regular audits and inspections are conducted to ensure our personnel are aware of the safety requirements and are implementing proper procedures. \n\n\n\nThe Lakeland Division of Carpenter Co. utilizes an Integrated Contingency Plan (ICP) based on the requirements of  OSHA's Hazardous Waste and Emergency Response Operations regulation (29 CFR 1910.120) as well as state and local regulations to manage emergency response activities at the facility.  The Contingency Plan for the Lakeland Division includes procedures for proper notification of the local fire department, the police department, and the local hospital when and if such notifications become necessary.  The implementation of the ICP at the facility is directly related to the degree of training given to the Carpenter Co. employees in regard to chemical releases and emergencies; fire evacuation; and preparation for response to the effect of natural disasters.  The Lakeland Division's attention to Accidental Release Prevention is evidenced by the facility not having a release of toluene diisocyanate during the previous five years.  \n\n\n\n2.    FACILITY DESCRIPTION & REGULATED SUBSTANCES HANDLED\n\n\n\nThe Carpenter Co., Lakeland Division, is locate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063037,
      "SummaryText": "d at 5150 Frontage Road South in Lakeland, Florida.  The area around the facility is comprised of other industrial plants.  The Carpenter Co., Lakeland Division, employs approximately 143 full time employees.  The facility manufactures polyurethane foam products for use in carpet cushioning, bedding, and furniture applications.  The polyurethane foam manufacturing process utilizes toluene diisocyanate (TDI) [unspecific isomers], CAS# 2647-62-5, as a reactant to produce foam.  The Carpenter Co., Lakeland facility has a total TDI storage capacity of approximately 937,716 pounds.  The facility maintains a maximum of three railcars each with approximately 190,000 pounds, one internal TDI storage tank with a capacity of 313,013 pounds, one prepolymer mixing tank with a capacity of 76,040 pounds and one prepolymer day tank with a capacity of 27,391 pounds.  The mixture in the prepolymer mixing tank and day tank consists of 50 percent TDI.  All process tanks are located inside the building within concrete containments.  The railcars are located outside the building at the railcar unloading station.  The unloading station has stationary drip pans installed to minimize incidental releases.  TDI is pumped to the pouring mixing head where it is mixed with other reactants to produce a continuous slab of flexible polyurethane foam.  The foam is cut into 100 foot slabs and then stacked in the slab room to cure.\n\n\n\n3.    WORST CASE RELEASE SCENARIO\n\n\n\nAssessment and modeling was conducted for a worst case release scenario of TDI from the Carpenter Lakeland facility.  The worst case scenario was assumed to be a rupture of a TDI railcar releasing the entire contents (190,000 lbs) into an undiked area (urban topography).  Using weather data for the Lakeland region obtained from www.wunderground.com, the maximum daily temperature recorded for the past three years was 96?F.  The release rate was conservatively corrected to 102 ?F, yielding a release rate of 2.3 lbs/min using Equation 3-11"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063037,
      "SummaryText": " from RMP Guidance for OCA.  The estimated duration of the release is 82,672 minutes using Equation 3-5.  The distance to the toxic endpoint of the release was calculated using the EPA's RMP*Comp software.  The toxic endpoint was estimated to be a distance of 0.7 miles extending from the most likely location of a hypothetical release.  This distance was used to trace an area that would potentially be impacted as a results of a worst case release of TDI.  This area was visualized using the EPA's MARPLOT software, which suggested 74 housing units are within the potentially affected area. Additionally, there are approximately 30 off-site industrial businesses would be impacted.  However, there are no environmental receptors that would be affected by a worst case release. \n\n\n\n4.    ALTERNATIVE CASE RELEASE SCENARIO\n\n\n\nThe alternate release scenario is a leak from an unloading hose connecting the tank car to bulk storage system inside the facility.  An estimated 10 gallons, or 100 lbs of TDI, is spilled into an undiked area (urban topography) before the flow of product is stopped.  The calculated release rate at ambient temperature (25 ?C) using Equation 7-8 from RMP Guidance for OCA is 0.00058 lbs/min.  The corrected release rate at 102 ?F (a conservative approximation for the highest temperature within the last three years in the Lakeland area obtained from www.wunderground.com) using Equation 3-11 is 0.0021 lbs/min.  The estimated duration of release is 47,619 minutes using Equation 3-5. The distance to the toxic endpoint of the release of this magnitude was calculated using the EPA's RMP*Comp software.  The toxic endpoint was estimated to be a distance of 0.1 miles extending from the most likely location of a hypothetical release.  Based on the calculated endpoint distance of 0.1 miles from the point of release, a release of this magnitude would not impact any off-site residential or industrial receptors.\n\n\n\n\n\n\n\n5.    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM & CHEMICA"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000063037,
      "SummaryText": "L SPECIFIC PREVENTION STEPS\n\n\n\nThe Carpenter Co. has implemented the RMP Program Level 2 Prevention Program, as described in the RMP regulations, at the facility which include the following elements:  TDI Safety Information, Health Guidelines & Material Safety Data Sheets, Hazard  Review utilizing \"What if Checklists\", Standard Operating Procedures (TDI Unloading, Transfer Pump Operating and Shutdown, Recirculation Pump Operating & Shutdown, metering Pump Operating & Shutdown, Maintenance Procedures and Pourline Operating Procedures), Employee training, TDI Preventive Maintenance Plan & Checklist, RMP Compliance Audits, and a TDI Incident Investigation.\n\n\n\n      6.  FIVE YEAR ACCIDENT HISTORY\n\n\n\nOver the previous five years the Carpenter Co., Lakeland Division, has not had any incidents involving TDI.\n\n\n\n7.    EMERGENCY RESPONSE PROGRAM\n\n\n\nThe Carpenter Co., Lakeland Division, utilizes an Integrated Contingency Plan (ICP) to outline the emergency response activities for each class of incident that may occur at the facility.  The facility has made all required notifications to the Polk County LEPC regarding the types of materials stored at the facility and their volumes.  The Lakeland Regional Medical Center, Lakeland Police Department, and Lakeland Fire Department have all been given copies of Carpenter Company Lakeland Division's emergency response plan.  Carpenter Co. has an Emergency Response Service Agreement with American Compliance Technologies to provide remediation services in the event of a TDI release should occur.  Carpenter Co. maintains a trained Emergency Response Technician Level III Hazwoper Response team capable of actively controlling a release of TDI.  Carpenter Co. has signed an agreement with Shaw Environmental Services to provide U.S. facilities with Emergency Response capabilities in the event of a major environmental incident.  All Carpenter Co. operations and support personnel have received training in TDI hazard recognition and awareness as we"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000063037,
      "SummaryText": "ll as a thorough review of MSDS sheets.  The facility conducts emergency response and spill response drills on a regular basis.\n\n\n\n8.  PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Carpenter Co., Lakeland Division, operates with an attention to employee awareness and emphasizes ongoing training of all personnel.  Additionally, employees receive Emergency Response Technician Level III HAZWOPER training annually.  A TDI unloading checklist has been implemented to ensure equipment is in satisfactory condition prior to use.  A mountable drain blocker has been placed next to the tank truck unloading area.  The operator must now place this drain blocker above the storm drain next to the truck unloading area prior to each truck unload to prevent possible leakage or spills into the storm drain as a result of leakage from the piping connections.  Continuous improvements are performed as new technology and processes become available.  Carpenter is committed to providing a safe and environmentally responsible working condition for all employees and the surrounding community.\n\n"
    }
  ]
}