{
  "FacilityID": 1000018239,
  "FacilityName": "BC Systems Salinas",
  "FacilityStr1": "1341 Merril St",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": null,
  "FacilityLatDecDegs": "36.385421",
  "FacilityLongDecDegs": "-121.380222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 154483457,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Jaime Britt",
  "OperatorStr1": "950 E. Blanco Rd",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "FTE": 55,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000213244",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-12-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-11-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-11-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-11-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-11-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.647132,
  "FRS_Long": -121.634386,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000022391,
      "AltID": "Produce Cooler",
      "FacilityID": 1000018239,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000026502,
          "ProcessID": 1000022391,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000022680,
          "ProcessID": 1000022391,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000018935,
              "Process_NAICS_ID": 1000022680,
              "SafetyReviewDate": "2010-06-23 00:00:00",
              "PHA_Date": "2009-06-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Power Failure",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Pressure relief valves connected to diffusion tanks",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-06-23 00:00:00",
              "TrainingReviewDate": "2010-06-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-06-23 00:00:00",
              "EquipmentInspectionDate": "2010-06-23 00:00:00",
              "EquipmentTested": "6/23/10",
              "ChangeMgmtDate": "2007-10-01 00:00:00",
              "ChangeMgmtReviewDate": "2010-06-23 00:00:00",
              "PreStartupReviewDate": "2009-03-01 00:00:00",
              "ComplianceAuditDate": "2010-06-23 00:00:00",
              "AuditCompletionDate": "2010-06-23 00:00:00",
              "IncidentInvestigationDate": "2008-06-04 00:00:00",
              "InvestigationChangeDate": "2008-06-04 00:00:00",
              "ParticipationPlansReviewDate": "2010-06-23 00:00:00",
              "HotWorkPermitReviewDate": "2010-06-11 00:00:00",
              "ContractorSafetyReviewDate": "2010-06-11 00:00:00",
              "ContractorSafetyEvalDate": "0010-06-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000022459,
                  "PreventionProgram3ID": 1000018935,
                  "ProcessChemicalID": 1000026502
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000018239,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-10-13 00:00:00",
    "ERTrainingDate": "2010-06-23 00:00:00",
    "CoordinatingAgencyName": "Salinas Fire Dept",
    "CoordinatingAgencyPhone": "8316332578",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000018239,
      "SummaryText": "Executive Summary\nAccidental Release Prevention and Emergency Response Policies\nBC Systems is committed to maintaining a safe work environment. The Plant Engineer for the BC Systems BC Salinas site ensures that safe practices are followed in operations involving hazardous materials. This site has established emergency procedures for ammonia releases. The BC Systems BC Salinas emergency personnel will coordinate with the local Fire Department to ensure rapid and appropriate response to hazardous material emergencies, which include response to emergencies related to the ammonia refrigeration system covered by this RMP/PSM Program. The site has written evacuation, reporting, and response procedures in place to protect BC Systems employees, the public, and the environment in the event of an ammonia release. \nStationary Source and Regulated Substance\nThe BC Systems facility covered by this RMP is to be located at 1341 Merrill Street in Salinas, California. This location will be a produce storage facility (lettuce and spinach) until it is ready for distribution to other locations. \nThe regulated substance is Anhydrous Ammonia. One new stationary Ammonia refrigeration system and 3 portable Ammonia refrigeration systems will be used to store produce at various temperatures. The old stationary system described in the previous submission will be removed. These systems are not interconnected. The stationary refrigeration system will have approximately 8,000 pounds of Anhydrous Ammonia. The portable systems will contain approximately 9,000 pounds of Ammonia. Due to the close proximately of the portable and the new stationary Ammonia system, the local Administering Agency, Monterey County Environmental Health Department, has determined that this system should comply with Program Level 3 requirements. BC Systems has previously submitted an RMP/PSM Program on the old stationary and portable systems at this site and this submission is included in Attachment 3.\nRelease Scenarios1\nWo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000018239,
      "SummaryText": "e, or off-site environmental damage, evacuations, or sheltering in place have occurred from the new stationary system. This site has had one release during the last 5 years. A pipe failure during the change out of a pressure relief valve on an evaporative condenser on a portable unit that is used at this site occurred on 6/04/08 for a total of 72 lbs. Follow up including improved maintenance procedures where implemented following this event. \nEmergency Response Program\nThis facility has established emergency procedures and coordinates with the local Fire Department to ensure rapid and appropriate response to hazardous material emergencies, which include response to emergencies related to the ammonia refrigeration system covered by this RMP/PSM Program. \nThe Emergency Response procedures are accessible at the site, and copies are maintained in the BC Salinas Plant Engineer's files. The document describes response procedures for various emergency scenarios, including the mitigation of hazardous material releases, agency notification procedures in the event of a hazardous material release, and emergency equipment available at the site. \nPlanned Changes to Improve Safety\nBased on the process hazard analysis study conducted for the system, which are contained in a separate document, the following consolidated lists of actions were identified to ensure safe operation of the stationary ammonia refrigeration system.\n#\tRecommended Follow Up Actions\tPHA Table\nItem #\tIndividual Assignee\tDue Date /\nStatus\n1.\t\tInvestigate the installation of NH3 sensors for machinery area.\tNode 1,2,3,4, 5, Sitting Issue.\t\tCarlos Malverez\t\t5/31/09\n2.\t\tInstall cement block barrier to prevent potential vehicular damage to engine area.\tNode 1,2,3,4, 5, Sitting Issue., 9,\n21,\n28, 34,\tCarlos Malverez\t5/31/09\n3.\t\tInstall fence around refrigeration engine yard.\tNode 1,2,3, Sitting Issue., 9,\n21,\n28, 34,\tCarlos Malverez\t5/31/09\n4.\t\t\tDevelop and implement a PM system to monitor for trapped liquid or air i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000018239,
      "SummaryText": "n piping system.\t\t22,\tCarlos Malverez\t5/31/09\n5.\t\tDevelop and implement a PM system for all piping, valves, compressors, low-pressure receiver, high-pressure receiver, condenser, and cooling coils system. Include routine daily inspections of this equipment. Include oil and filter change out for compressors. Include compressor oil certified by supplier. Include inspection for the presence of combustible materials in daily inspections. \tNode 3 Previous Incidents Near Misses.9,\n10, 11, 14, 17, 21, 32, 33, 34, 38,\nNode 7, General What If,\tCarlos Malverez\t5/31/09\n6.\t\tDevelop and implement operating procedure for oil pot drainage\t5, 7,\tCarlos Malverez\t5/31/09\n7.\t\tDevelop and implement a 5 year replacement program for pressure relief valves \t5, 19, 22, 30,\tCarlos Malverez\t5/31/09\n8.\t\tInsure that training for emergency response personnel is current and completed as required.\t9\tCarlos Malverez\t5/31/09\n9.\t\tImplement operator training and certification program.\t21, 28, 32, 34, 35,\tCarlos Malverez\t5/31/09\n10.\t\tDevelop and implement a process for conducting daily and monthly inspections, monitoring, and maintenance of condenser. Include water level and air flow checks.\tNode 3, Sitting Issues,\n22, 24, 25, 28, 29,\tCarlos Malverez\t5/31/09\n11.\t\tImplement a water treatment service on condenser\t22,\tCarlos Malverez\t5/31/09\n12.\t\tInsure that emergency procedures include provisions for waste water discharges.\t25,\tCarlos Malverez\t5/31/09\n13.\t\tDevelop and implement a safe NH3 loading procedure.\t32,\tCarlos Malverez\t5/31/09\n14.\t\tImplement daily visual inspection of water level in diffusion tank.\tNode 5, Previous Incidents and Near Misses, 35,\tCarlos Malverez\t5/31/09\n15.\t\tInsure that Hot work permit program has been implemented. \tNode 7,\tCarlos Malverez\t5/31/09"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000018239,
      "SummaryText": "rst-Case Release Scenario\nIn this worst-case release scenario, the total Anhydrous Ammonia in the new stationary refrigeration system of approximately 8,000 pounds is assumed to be released within 10 minutes from the high-pressure receiver resulting from a breach of containment. The worst-case release rate would therefore be approximately 800 pounds of Ammonia per minute. \nThe release rate is calculated as follows: \nQR = Q/10\nWhere: QR = Release rate (lbs/min)\n Q = Quantity released (lbs)\nUsing the scenario criteria:\nQR = 8000 lbs / 10 min = 800 lbs/min\nNo passive mitigation measures were considered to limit the off-site consequence distance for this scenario since the largest vessel is outdoors. The estimated distance to the toxic endpoint for the worst-case release scenario would be 0.5 mile based on R*Comp Software (Version 1.07). \nAlternative Release Scenario\nThe alternative release scenario was derived from the results of the Process Hazard Analysis (PHA) study conducted at the Chiquita Brands Salinas corporate office in January 2009. The scenario chosen is a release from a leaking flange or valve on the roof from the new stationary system. The  of the opening is Â¼-inch (). The discharge is determined by the  of the hole and the pressure inside the pipe These release parameters were determined by consulting the table in Exhibit E-4 Release Rates and Distances to Toxic Endpoint for Leaks of Anhydrous Ammonia (Alternative Release Scenario) APPENDIX E: Supplemental Risk Management Program Guidance for Ammonia Refrigeration Facilities Since the discharge location is outdoors (i.e., mounted on the roof), no mitigation measures were considered. Based on discussions with the PHA team, a release rate of 100 pounds of ammonia per minute for 80 minutes is estimated.\nThe release rate is calculated as follows: \nQR = Q/10\nWhere: QR = Release rate (lbs/min)\n Q = Quantity released (lbs)\nUsing the scenario criteria:\nQR = 8000 lbs / 80 min = 100 lbs/min\nThe distance to the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000018239,
      "SummaryText": "toxic endpoint for this alternative release scenario would be 0.1 mile.\nReleases from pressure relief valves are mitigated by the design of the system. Discharges are piped to a diffusion tank, which is d to contain the total ammonia charge to the system. (Approximately 8500 gallons of water). Therefore, a vapor release from a pressure relief valve alternative scenario was not considered.\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\nPrevention of accidental ammonia releases at BC Systems is accomplished through sound industry practice in the original system design and construction, the specification and review of system modifications prior to their occurrence, and the regular operation, maintenance and monitoring of the system. This includes:\nÂ¿\tCompliance with industry standards and codes in effect at the time of initial construction of the system, as well as in the event of system modifications through a management of change process.\nÂ¿\tPerformance of a Process Hazard Analysis (PHA) at least once every five years using accurate process safety information.\nÂ¿\tImplementation of operating, maintenance and monitoring procedures. \nÂ¿\tTraining of system operations and maintenance personnel, as well as ongoing training of the on-site Chemical Response Team. \nÂ¿\tPerformance of preventive and corrective maintenance according to system component manufacturer recommendations and pursuant to hot work permit program requirements to ensure mechanical integrity.\nÂ¿\tApplication of established auditing, inspection, and pre-start-up review protocols.\nÂ¿\tUse of qualified contractors for work on the system.\nThe detailed Prevention Program for this system is contained in a supporting document, which is to be maintained at by the site by the Plant Engineer.\nFive Year Accident History\nThis is a new installation of a stationary ammonia refrigeration system. Therefore, no ammonia releases resulting in on-site or off-site injuries, deaths, or property damag"
    }
  ]
}