{
  "FacilityID": 1000014577,
  "FacilityName": "Decatur Energy Center, LLC",
  "FacilityStr1": "2024 Highway 20 West",
  "FacilityStr2": null,
  "FacilityCity": "Decatur",
  "FacilityState": "AL",
  "FacilityZipCode": "35601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01103",
  "LEPC": "Morgan County LEPC",
  "FacilityLatDecDegs": "34.626864",
  "FacilityLongDecDegs": "-087.022204",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.calpine.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Calpine Corporation",
  "Company2Name": null,
  "CompanyDUNS": 112710876,
  "Company2DUNS": 0,
  "OperatorName": "Decatur Energy Center, LLC",
  "OperatorStr1": "717 Texas Avenue, Suite 1000",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": "AL0073989",
  "EPAFacilityID": "100000178265",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "712-0079-x001",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.62931,
  "FRS_Long": -87.02147,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018286,
      "AltID": "Anhydrous Ammonina",
      "FacilityID": 1000014577,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021697,
          "ProcessID": 1000018286,
          "ChemicalID": 56,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000018608,
          "ProcessID": 1000018286,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000015038,
              "Process_NAICS_ID": 1000018608,
              "SafetyReviewDate": "2009-10-31 00:00:00",
              "PHA_Date": "2009-12-15 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-10-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-06-23 00:00:00",
              "TrainingReviewDate": "2006-12-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-06-01 00:00:00",
              "EquipmentInspectionDate": "2010-06-01 00:00:00",
              "EquipmentTested": "Tank, piping, valves and pumps",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-05-21 00:00:00",
              "PreStartupReviewDate": "2007-04-17 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2004-01-14 00:00:00",
              "InvestigationChangeDate": "2004-01-31 00:00:00",
              "ParticipationPlansReviewDate": "2002-01-16 00:00:00",
              "HotWorkPermitReviewDate": "2007-02-10 00:00:00",
              "ContractorSafetyReviewDate": "2007-02-10 00:00:00",
              "ContractorSafetyEvalDate": "2007-02-07 00:00:00",
              "CBI_Flag": 0,
              "Description": "Anhydrous ammonia system for air pollution control",
              "_chemicals": [
                {
                  "PrimaryKey": 1000018022,
                  "PreventionProgram3ID": 1000015038,
                  "ProcessChemicalID": 1000021697
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000014577,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Decatur Fire and Rescue",
    "CoordinatingAgencyPhone": "2563517952",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014577,
      "SummaryText": "Calpine Corporation is committed to proactively protecting human health, safety and the environment.  We operate our business in a manner that consciously safeguards our employees, customers and the communities in which we do business.  In striving for responsible environmental, health & safety (EH&S) stewardship, Calpine pledges to:\n*  Diligently develop, construct and operate our facilities in an environmentally responsible manner that promotes pollution prevention and places the highest priority on health and safety.\n*  Operate facilities that meet or exceed all applicable federal, state and local EH&S rules, regulations, ordinances and statues as well as recognized industry guidelines and standards.\n*  Continually measure, evaluate and improve our EH&S performance.\n*  Promote EH&S awareness that fosters a caring, ownership-driven culture among employees, contractors and vendors.\n\nDescription of the Stationary Source and Regulated Substances\nThe Decatur Energy Center (DEC), located in Decatur, Alabama, is a gas-fired combustion turbine power plant that produces electricity.  As a means of reducing nitrogen oxide emissions from the three gas-fired combustion turbines, anhydrous ammonia is injected into the turbine exhaust streams.  Anhydrous ammonia is stored on-site in two dedicated, specially designed storage tanks.  The storage capacity of each tank exceeds the threshold quantity for RMP applicability.  There are no other toxic or flammable substances on-site that exceed RMP thresholds.\n\nAccidental Release Prevention Program\nDEC is subject to OSHA's PSM standard and Program 3 of EPA's RMP rule.  The accidental release prevention program at DEC includes:\n\nEmployee Participation\nAll DEC employees are actively encouraged to participate in the accidental release prevention program.  Each employee is urged to participate in the continual upgrading and maintaining of all health and safety programs.  Employee involvement is achieved through direct participation on a v"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014577,
      "SummaryText": "oluntary basis, active consultation with affected employees, and representative participation in the process hazard analysis.  Employees have access to all information required under the PSM and RMP regulations.\n\nProcess Safety Information\nDEC maintains a variety of technical documents to ensure that process hazards are understood and that the plant is operated and maintained in a safe manner.  These documents include information concerning the hazards of anhydrous ammonia, process technology, and process equipment.  This information is updated when changes in the process occur.  Information concerning the hazards of ammonia includes toxicity information, permissible exposure limits, physical, reactivity, corrosivity, and  thermal and stability data.\n\nInformation concerning the process technology includes process flow information, maximum intended inventory information, safe upper and lower process limits, and consequences of deviating from safe limits.\n\nInformation concerning the process equipment includes the materials of construction, piping specifications, piping and instrument diagrams, relief design calculations and design basis, design codes and standards employed, safety systems.\n\nProcess Hazard Analysis (PHA)\nDEC has a comprehensive PHA program to ensure that hazards associated with the ammonia process are systematically identified and controlled.  The analysis is conducted in accordance with regulatory requirements, generally accepted industry standards, and guidance from safety organizations such as the Center for Chemical Process Safety.  The plant has a system in place to ensure that PHA recommendations are resolved in a timely manner.\n\nOperating Procedures\nDEC maintains written operating procedures that address the various modes of process operations, including initial startup, normal startups and shutdowns, emergency shutdowns, emergency operations, normal operations and temporary operations.  The procedures also discuss safe upper and lower process l"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014577,
      "SummaryText": "imits, consequences of deviation from the safe limits, and methods to return the process to safe operations.  The procedures are readily available to operations, maintenance and engineering personnel, and are reviewed and certified annually.\n\nTraining\nAll operations personnel of the DEC are initially trained in an overview of the ammonia process and the procedures to safely operate the process.  Operations personnel will receive refresher training every three years.\n\nContractors\nDEC uses contractors during periods of increased maintenance or construction activities and for routine maintenance and upkeep.  DEC has procedures in place to ensure that contractors are aware of the hazards of the process, understand what to do in the event of an emergency, understand site safety rules, and inform plant personnel of any hazards encountered during their work.  Calpine also pre-qualifies contractors based on their safety record, and evaluates contractor safety programs and performance.\n\nPre-Startup Safety Reviews (PSSR)\nDEC conducts a pre-startup safety review for any new facility or significant facility modification.  The purpose of the PSSR is to ensure that safety systems, procedures, training, and equipment are prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with design specifications and that all supporting systems are operationally ready.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accidental release prevention programs are properly implemented.\n\nMechanical Integrity\nDEC has implemented practices and procedures to maintain pressure vessels, piping systems, relief systems, controls, pumps and emergency shutdown systems, in a safe operating condition.  The program includes:  (1) the development of a maintenance schedule for equipment in the ammonia process and critical safety equipment, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014577,
      "SummaryText": "(2) developing written maintenance procedures, (3) conducting maintenance training, (4) performing and documenting inspections, (5) correcting identified equipment deficiencies, and (6) applying quality assurance measures to ensure replacement equipment meets the required specifications.  \n\nHot Work Permits\nDEC has a hot work permit program in place to ensure worker and process safety.  The hot work permit program is designed to control spark-producing activities and to ensure that adequate precautions are in place before work begins in the process area.  These procedures (and others), along with training of affected personnel, form a system to help ensure that maintenance activities are performed safely.\n\nManagement of Change\nDEC has a system in place to ensure that safety concerns associated with changes to the ammonia process and procedures, are reviewed and addressed prior to the change.  The changes are reviewed to ensure that adequate controls are in place to manage any new hazards as well as to verify that existing controls have not been compromised by the change.  The system requires that process safety information and operating procedures are updated and that operations and maintenance personnel are trained before the change is implemented.\n\nIncident Investigation\nDEC promptly investigates all incidents that resulted in, or could reasonably be expected to result in, the release of ammonia.  The findings of the investigation, along with any corrective actions taken to prevent recurrence of the incident, are  reviewed with all affected personnel (including contractors). \n\nCompliance Audits\nTo ensure that the accidental release prevention program is functioning properly, DEC will conduct a compliance audit every three years.  The facility will quickly resolve any deficiencies noted by the audit team, and will review the audit report and corrective actions taken with all affected personnel.\n\nAdditional Safety Systems\nDEC has additional systems in place to preve"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000014577,
      "SummaryText": "nt accidental releases of ammonia, as well as systems to lessen the impact of accidental releases.  These systems include:\n*  Redundant instrumentation to monitor critical process parameters\n*  Redundant critical equipment\n*  Automated shutdown systems\n*  Pressure relief valves\n*  Water deluge system to wash ammonia vapors out of the air\n\nFive Year Accident History\nThere have been no RMP reportable accidents at the plant.\n\nEmergency Response Program\nDEC maintains a written emergency response program.  The program addresses all aspects of emergency response, including proper first aid and medical treatment for exposures, spill response measures, evacuation plans and personnel head count, notification of emergency response agencies and the public in the event of a release.  The emergency response program is coordinated with the Morgan County Local Emergency Planning Committee."
    }
  ]
}