{
  "FacilityID": 1000006845,
  "FacilityName": "International Paper Riverdale Mill",
  "FacilityStr1": "601 County Road 78",
  "FacilityStr2": null,
  "FacilityCity": "Selma",
  "FacilityState": "AL",
  "FacilityZipCode": "36703",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01047",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.426722",
  "FacilityLongDecDegs": "-086.870694",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "ST",
  "FacilityURL": "http://www.internationalpaper.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1385988,
  "ParentCompanyName": "International Paper",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "International Paper",
  "OperatorStr1": "601 County Road 78",
  "OperatorStr2": null,
  "OperatorCity": "Selma",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36703",
  "OperatorZipCodeExt": null,
  "RMPContact": "Donnie Parrish",
  "RMPTitle": "Environmental Engineer",
  "FTE": 719,
  "OtherEPAFacilityID": "ALD000645457",
  "EPAFacilityID": "100000113584",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "104-0003",
  "SafetyInspectionDate": "2009-03-09 00:00:00",
  "SafetyInspectionBy": "DOT",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.42672,
  "FRS_Long": -86.87069,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000008030,
      "AltID": "Chlorine Dioxide",
      "FacilityID": 1000006845,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000008216,
          "ProcessID": 1000008030,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        },
        {
          "Process_NAICS_ID": 1000008217,
          "ProcessID": 1000008030,
          "NAICSCode": "32212",
          "_desc": {
            "NAICS_CODE": "32212",
            "NAICS_DESCRIPTION": "Paper Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008980,
          "ProcessID": 1000008030,
          "ChemicalID": 71,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508980,
          "ProcessID": 1000008030,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000006845,
      "SummaryText": "International PaperA?s Riverdale Mill is an integrated Kraft pulp and paper mill located approximately 10 miles east of Selma in rural Dallas County, Alabama.  The original mill was built in the mid-60s by Hammermill Paper Company on a 2,900-acre site.  International Paper acquired the facility in 1986.  Having undergone several major expansions over the years, the Riverdale Mill developed into a world class leader in the manufacture of pulp and paper.  Today, the mill produces virgin and recycled grades of white reprographic paper (copy paper) and offset paper sold in rolls.  Approximately 719 people are employed at the mill, making it Dallas CountyA?s largest employer.\n\nIn the paper making process, the mill receives about 5,000 tons of tree length wood per day.  These trees are chipped by species (hardwood and softwood) and cooked in one of 10 batch digesters.  The resulting brown pulp is then processed (washed and bleached) in one of two pulp mills.   Riverdale also has a deink plant that produces recycled fiber used in making recycled grades of paper.  The bleached pulp and deink fiber is made into approximately 1,800 tons per day of copy paper on two large state-of-the-art paper machines.  The paper is cut to size, packaged and shipped by truck and rail to destinations throughout the US.  In addition to the paper making operations, the mill has critical infrastructure support that includes power generation and chemical recovery operations.  RiverdaleA?s power plant can generate enough electricity to power a city with 38,000 homes.  The mill is also focused on conservation, deriving 75 percent of its energy needs from renewable fuels (black liquor and waste wood fuel) and greatly reducing its dependence on oil and natural gas.  \n\nInternational Paper is committed to operating and maintaining each of its business sites in complete compliance with all applicable environmental laws, regulations and permits.  Our Corporate EHS Policy (EHS Policy #10000) objective sta"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000006845,
      "SummaryText": "tes A?An essential part of our business strategy is to make products in a safe and healthful work place, to manage natural resources wisely, and to continually improve our environmental performance.  We are committed to removing the conditions and behaviors that cause personal injury or environmental impact.A?  Under this policy, International Paper is committed to complying with all applicable environmental, health and safety laws and regulations, creating an accident and injury-free workplace, and emphasizing the prevention of pollution, elimination of process excursions and continual improvement through employee diligence as the best practicable means to improve the environmental performance of our operations.  Business site managers are specifically assigned the task of certifying compliance with all environmental, health and safety rules and regulations, maintaining an accident and injury-free workplace, continually improving EHS programs and developing annual objectives that support these goals.\n\nA bleaching agent is required to convert brown pulp mentioned above to a white or bleached pulp required to make paper acceptable to the consumer.  This is accomplished through the use of chlorine dioxide.  As part of our commitment to environmental stewardship, in the 1990A?s, International Paper converted the pulp bleaching process from elemental chlorine (i.e., chlorine gas, or Cl2) to the more environmentally friendly chlorine dioxide (ClO2).   The Riverdale Mill has two ClO2 generators that create chlorine dioxide solution at 9.5 grams per liter (g/L) to 10.5 g/L.  The U.S. EPA Risk Management Program (RMP) regulates ClO2 when it is stored in solutions above 10 g/L (i.e., one weight percent) with a total mass of ClO2 greater than or equal to 1,000 pounds (lbs).  Even though the ClO2 generated is often below the regulated threshold of 10 g/L, International Paper took a conservative position and entered the program in good faith to ensure compliance and protection "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000006845,
      "SummaryText": "of public health and the environment.  The generated ClO2 is stored in three tanks prior to being used in the bleaching process.  Because the Riverdale Mill is a pulp and paper mill, and because the worst-case modeling impacts predict the potential for offsite consequences, Program 3 of the RMP is applicable.  Program 3 requires both a worst-case modeling analysis and an alternative modeling analysis.  Both analyses are included in the plan.\n\nAs an example of our commitment to safety, the Riverdale mill maintains the highly coveted A?StarA? status in OSHAA?s Voluntary Protection Program (VPP).  The VPP promotes effective programs for worksite-based safety and health.  In the VPP, management, labor and OSHA establish cooperative relationships at workplaces that have implemented a comprehensive safety and health management system.   Approval into VPP is OSHAA?s official recognition of the outstanding efforts of employers and employees who have achieved exemplary occupational safety and health.  Entire industries benefit as VPP sites evolve into models of excellence and influence practices industry-wide.  \n\nThe Riverdale Mill also complies with the requirements of OSHAA?s Process Safety Management (PSM) for ClO2.  The PSM Standard requires employers to develop a comprehensive program to identify and evaluate the potential hazards associated with the use of certain highly hazardous chemicals, and to identify and implement measures for prevention of chemical releases that could occur as a result of failure in process, procedure or equipment.  There have not been any ClO2 accidents at the Riverdale Mill since the inception of the Risk Management Program in 1999.\n\nThe Riverdale Mill is prepared to respond to both fire and hazardous material (hazmat) emergencies.  Approximately 50 mill employees are trained annually in fire fighting and as Hazmat Technicians.  They are very well equipped to handle any foreseeable catastrophe.  Their equipment includes a hazmat response vehi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000006845,
      "SummaryText": "cle equipped with an incident command center, air compressor for filling breathing air bottles, fire hoses, nozzles, foam educators, fire fighting gear, level A and B hazmat suits, SCBAA?s, rescue equipment, equipment designed to repair/plug leaks, medical supplies, etc.  As backup, the mill has a written agreement for fire emergencies with the Selma Fire Department.  The Prattville Fire Department has agreed to assist with a hazmat emergency if requested.  Both Selma and Prattville fire departments have copies of the mill's emergency response plan.  In addition to the off-site training mentioned above, all fire brigade members participate in drills monthly.  Everyone in the mill, including contractors, participate in millwide evacuations 4 times per year.\n\nInternational Paper takes many preventive actions through programs such as process safety management and emergency response to minimize the possibility of an accident and the potential impact if an accident does occur.  While the possibility of an accident does exist, the potential for a serious accident is quite low.   The Riverdale Mill is well prepared to handle any foreseeable incident.\n"
    }
  ]
}