{
  "FacilityID": 1000013736,
  "FacilityName": "PAINESVILLE WATER TREATMENT PLANT",
  "FacilityStr1": "9565 Headlands Road",
  "FacilityStr2": null,
  "FacilityCity": "Mentor",
  "FacilityState": "OH",
  "FacilityZipCode": "44060",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39085",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "41.764722",
  "FacilityLongDecDegs": "-081.298056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "IP",
  "FacilityURL": "www.painesville.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "CITY OF PAINESVILLE",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Daniel McGannon",
  "OperatorStr1": "7 Richmond Street",
  "OperatorStr2": null,
  "OperatorCity": "Painesville",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44077",
  "OperatorZipCodeExt": "0601",
  "RMPContact": "Daniel McGannon",
  "RMPTitle": "Water Department Superintendent",
  "FTE": 12,
  "OtherEPAFacilityID": "PWSID:4301611",
  "EPAFacilityID": "100000083321",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-05-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-05-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-05-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-05-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-05-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.7519,
  "FRS_Long": -81.29563,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017102,
      "AltID": "Chlorine Feed System",
      "FacilityID": 1000013736,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017496,
          "ProcessID": 1000017102,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020334,
          "ProcessID": 1000017102,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000520334,
          "ProcessID": 1000017102,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013736,
      "SummaryText": "PAINESVILLE WATER PLANT EXECUTIVE SUMMARY\n\nAccidental release prevention and emergency response policies at the Painesville Water Treatment Plant:\n\n     The management at the Painesville facility has a very serious and committed approach to chemical safety. They have monthly mandatory safety meetings for all employees in which chemical safety and operational procedures are key issues. Signs are posted to remind all plant employees of the hazards associated with chlorine as well as the necessary procedures in the event of an emergency situation.( Posted MSDS )\n\nRegulated Substances handled at the Painesville Water Plant:\n\n     The Painesville Water Plant treats 7.5 million gallons of water per day (MGD) for the surrounding community, servicing approximately 24,000 people. Disinfecting the water supply is accomplished through the use of chlorine gas. The disinfection process requires approximately 150 pounds of chlorine per day. The Painesville plant has storage capacity for 15 one-ton chlorine cylinders and typically stores nine (9) full cylinders on-site. \n\nWorst-case Release and Alternative Release Scenarios:\n\n     The worst case scenario is failure of a one-ton chlorine cylinder. This scenario involves compromising a one-ton cylinder by severe impact. This can occur while lifting the cylinder from the ground level storage area to the chlorine feed room by hoist and monorail. The facility is located in a populated area and a chlorine plume could reach residents in the nearby area. \n     The alternative release scenario is a hose or valve failure during the switchover of one of the chlorine cylinders. This can occur if the operator, while switching the cylinder, is not careful to properly seat the vacuum regulator on the one-ton chlorine cylinder. The alternative release scenario would most likely remain on site within the chlorine feed room. Both scenarios were evaluated using the modeling program RMP* COMP.\n\nGeneral Accidental Release Prevention Program and Chemic"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013736,
      "SummaryText": "al Prevention Steps.\n\n     As part of the Painesville Water Plant accidental release prevention program, the plant requires that three men be involved in the switching or moving of chlorine cylinders. This dramatically decreases the possibility that a person could become overcome by chlorine gas without the awareness of others. Each member has a air pack on them for emergency rescue or removal. \n     Maintenance is performed on a regular basis on the chlorine feed system. The vacuum regulators that are installed on the chlorine cylinders have semi annual maintenance performed on them. In addition to the maintenance, there are spare parts along with replacement regulators on hand at the site. \n\nFive Year History:\n\n     There have been zero (0) accidental releases of chlorine in the last five years. Todays date April 23,2010.\n\nEmergency Response Program:\n\n     The Painesville Water plant has adopted an in-house training procedure through the experience of the senior employees. Training involves demonstrating the procedures for switching a chlorine cylinder and how to properly operate the chlorine disinfection system. Switching a chlorine cylinder follows a step-by-step method that has been developed at the plant. Additional training comes from the chlorine vendors that come to the facility to show how to repair chlorine leaks or change chlorine cylinders. \n \n     The Painesville plant has a chlorine alert system installed in the chlorine room. The alert system consists of a chlorine level detector that will alert plant employees when an abnormally high level of chlorine gas is present. In addition to detection, the plant has exhaust fans in place for evacuation the air in the chlorine room if there is a chlorine leak. Self contained breathing apparatus is located outside of the chlorine room. \n     In addition to these safety devices, the plant has a procedural plan in the event of a chlorine leak. The plan contains the procedures for handling a leak that occurs at th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013736,
      "SummaryText": "e plant (alternative release scenario) along with a release that may affect any public receptors (worst case scenario). This will involve alerting the local emergency planning commission (LEPC) along with the local fire department (Mentor Fire Department) and performing an evacuation of the plant personnel. \n     Schematics of the faculty, including the layout of the chemical storage area, are filed with the LEPC and the Mentor Fire Department. All exit signs are clearly marked for evacuation. Public awareness has been addressed via a Right to Know presentation hosted by Lake County LEPC.\n\nPlans Changed to Improve Safety:\n\n     The Painesville Water Plant has recently completed a new contingency plan (May 21, 2009) to provide response options under multiple event scenarios. The chlorine facility was evaluated for compliance with current design requirements. The City of Painesville has a complete emergency response program for disasters that include the chlorine issues at the water plant.\n\nDaniel McGannon\nDivision Superintendent\nCity of Painesville\nApril 23, 2010 \n\n\n"
    }
  ]
}