{
  "FacilityID": 1000061219,
  "FacilityName": "HONEYWELL METROPOLIS WORKS",
  "FacilityStr1": "2768 N. U.S. 45 ROAD",
  "FacilityStr2": null,
  "FacilityCity": "METROPOLIS",
  "FacilityState": "IL",
  "FacilityZipCode": "62960",
  "Facility4DigitZipExt": "0430",
  "FacilityCountyFIPS": "17127",
  "LEPC": "Massac County LEPC",
  "FacilityLatDecDegs": "37.171278",
  "FacilityLongDecDegs": "-088.756667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G7",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6278170,
  "ParentCompanyName": "HONEYWELL INTERNATIONAL, INC.",
  "Company2Name": null,
  "CompanyDUNS": 139691877,
  "Company2DUNS": 0,
  "OperatorName": "HONEYWELL INTERNATIONAL INC.",
  "OperatorStr1": "115 TABOR RD.",
  "OperatorStr2": null,
  "OperatorCity": "MORRIS PLAINS",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07950",
  "OperatorZipCodeExt": null,
  "RMPContact": "MARK WOLF",
  "RMPTitle": "NUCLEAR COMPLIANCE DIRECTOR",
  "FTE": 280,
  "OtherEPAFacilityID": "62960LLDSCUSH",
  "EPAFacilityID": "100000053381",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "127854AAD",
  "SafetyInspectionDate": "2016-08-18 00:00:00",
  "SafetyInspectionBy": "NRC",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-11-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-11-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-11-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-03-05 00:00:00",
  "DeRegistrationEffectiveDate": "2018-02-02 00:00:00",
  "AnniversaryDate": "2021-11-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.16106,
  "FRS_Long": -88.67815,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "7.5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000076467,
      "AltID": "ANHYDROUS HF EQUIPMENT",
      "FacilityID": 1000061219,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000077649,
          "ProcessID": 1000076467,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094755,
          "ProcessID": 1000076467,
          "ChemicalID": 55,
          "Quantity": 2700000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000594755,
          "ProcessID": 1000076467,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000076469,
      "AltID": "29% AQUEOUS NH3",
      "FacilityID": 1000061219,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000077651,
          "ProcessID": 1000076469,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094757,
          "ProcessID": 1000076469,
          "ChemicalID": 57,
          "Quantity": 99461.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000594757,
          "ProcessID": 1000076469,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061219,
      "SummaryText": "RMP*Submit Executive Summary\n\nHoneywell Metropolis Works plant\n\nAbout Honeywell\n\n \n\nThe Honeywell Metropolis Works (MTW) is a manufacturing facility located in Metropolis, Illinois. It is part of the Performance Materials and Technology (PMT) business group of Honeywell International Inc.\n\n\n\nHoneywell is a diversified technology and manufacturing leader, serving customers worldwide with aerospace products and services; control technologies for buildings, homes and industry; automotive products; turbochargers; and specialty materials. Headquartered in Morris Plains, N.J., Honeywell's shares are traded on the New York, London, Chicago and Pacific Stock Exchanges.\n\n \n\nHoneywell PMT, also based in Morris Plains, N.J., is a Honeywell business group and a global leader in providing high-performance specialty materials such as fluorocarbons, specialty films, advanced fibers, customized research chemicals and intermediates.\n\n \n\nHoneywell PMT Responsible Care &#61650; Commitment\n\n \n\nMTW received initial RCS 14001 certification in May 2009. At Honeywell PMT, we are committed to the safety of our employees, the quality of our products, and being responsible stewards for the protection of our environment, the communities in which we operate, and our customers. We are a member company of the American Chemistry Council, and Responsible Care &#61650; is the foundation for sustainability in our business. Our Responsible Care &#61650; Management System is used to support our full commitment to comply with legal and other Health, Safety and Environmental (HS&E) requirements to which we subscribe and to drive continual improvement in these areas.\n\n \n\nWe achieve global operational excellence and reliability through the integration of Responsible Care &#61650; principles into the way we operate and work with our commercial partners, from our contractors and other suppliers to our customers. We conduct thorough product risk assessments prior to commercialization and we apply necessary re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061219,
      "SummaryText": "sources and best practices in the development and handling of chemical products and materials. We promote process safety through our management systems for the design, construction, installation and maintenance of our facilities. We use quantitative and qualitative methodologies to evaluate enterprise risk and develop risk mitigation measures. As we strive toward environmental excellence and the prevention of pollution, we protect individual and public safety by manufacturing, transporting and storing our materials in a secure manner.\n\n \n\nWe invest in and improve the compliance processes for our products, processes and services using quantifiable goals to drive sustained safety and environmental excellence. We continue to see marked improvement in our safety and environmental performance and we will achieve and maintain HS&E third party certification at the business and operational levels of the organization wherever this commitment has been made.\n\n \n\nAs responsible corporate citizens, we continue to renew our commitment to the public through outreach activities, and by proactively communicating with our surrounding communities.\n\n \n\nHoneywell Metropolis Works Facility\n\n \n\nMTW is an inorganic chemical manufacturing facility that specializes in the fluorination of uranium ore to produce uranium hexafluoride (UF6). The chemical manufacturing facility has 251 employees as of November 1, 2016. UF6 is the first stage of the uranium enrichment process for nuclear energy.  From MTW, UF6 is sent to an enrichment facility and then to a fuel fabrication facility before it can be used as fuel in a nuclear power production capacity.\n\n \n\nOne of the materials used by the facility is anhydrous hydrogen fluoride (AHF), which is on the RMP Rule's list of regulated substances. MTW 's storage and use of Anhydrous Hydrogen Fluoride exceeds the specified threshold of 1000 lbs., as defined by the EPA's RMP Rule.\n\n \n\nAqueous ammonia (AqNH3, 29% Conc), which is on the RMP Rules list of regu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061219,
      "SummaryText": "lated substances, is also used at the MTW.  MTW's storage and use of Anhydrous Ammonia exceeds the specified threshold of 20,000 lbs., as defined by the EPA's RMP Rule.\n\n \n\nIn accordance with the requirements of the RMP Rule, a description of the following six elements is provided for MTW:\n\n \n\n1) Accidental Release Prevention and Emergency Response Policies:\n\n \n\nIt is the policy of MTW to operate a safe and environmentally sound facility by identifying and controlling health, safety, and environmental risks related to its operations; by designing its processes to protect people, property and the environment; by conducting and continually reviewing and improving programs for safety, health and environmental excellence; and by establishing processes to assure that all laws and regulations applicable to its operations and products are known and observed. The accidental release prevention and emergency response policy associated specifically with the plant's use of anhydrous hydrogen fluoride and aqueous ammonia involves the integration of safety devices and technologies inherent in the design of the process, safe operational procedures and management practices, operator training, the preparation and testing of site emergency response plans, the maintenance of onsite emergency response equipment and a professionally trained Emergency Response Team, coordinating our efforts and resources with local emergency response services, and communicating with the community.\n\n \n\n2) Description of the Facility and the Regulated Substance Handled:\n\n \n\nMTW produces uranium hexafluoride, which is sold to offsite customers. The facility operates continuously to produce uranium hexafluoride. In the production process, MTW uses the following chemicals that EPA has identified as having the potential to cause significant offsite consequences in the event of an accidental release.\n\n \n\n- Anhydrous Hydrogen Fluoride (AHF)\n\nAnhydrous hydrogen fluoride is stored in railroad tank cars and is fed "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061219,
      "SummaryText": "directly to the production facility.  Each tank car has an inventory of approximately 176,000 lbs.  Two tank cars may be connected to the system, but generally only one is actively supplying anhydrous hydrogen fluoride at any one time.  Only 7 tank cars can be within the plant fence line at any one time.  An additional 8 tank cars may be positioned outside the plant on the railroad spur.  Anhydrous hydrogen fluoride is used in the manufacture of fluorine gas and the conversion of uranium dioxide (UO2) to uranium tetrafluoride (UF4).\n\n \n\n- Aqueous Ammonia (AqNH3, 29% Conc)\n\nAqueous ammonia is stored in the tank farm facilities in a storage vessel.  The storage tank can hold an administrative maximum inventory of 99,461 lbs of AqNH3.  Aqueous ammonia is used in the Wet Process operational area as a reactant for recovering uranium from scrubbing solutions in order to feed the material back into the UF6 process.\n\n  \n\n3) The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps:\n\n \n\nThe general accident prevention for a Program 3 RMP facility is very comprehensive, consisting of twelve elements. These elements are part of Occupational Safety and Health Act - Process Safety Management Regulations (OSHA 1910.119). The general accident prevention elements are as follows.\n\n- Process Safety Information\n\n- Process Hazard Analysis\n\n- Operating Procedures\n\n- Training\n\n- Mechanical Integrity\n\n- Management of Change\n\n- Pre-Startup Review\n\n- Compliance Audits\n\n- Incident Investigation\n\n- Employee Participation\n\n- Hot Work Permits\n\n- Contractors\n\n \n\nMTW uses its Management of Change (MOC) process to assure plant compliance with many of the elements of OSHA 1910.119. Any plant process change requires the written approval of Safety, Occupational Health, Environmental, Health Physics, Production, and Maintenance organizations including upper management. During the MOC review of a process change, actions required for compliance with regulatory requirements"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000061219,
      "SummaryText": " and plant policy are shown on the review form. These actions are completed before the change can be made.\n\n \n\nA plant team consisting of both management and employees conducts in-depth incident investigations. The Life Critical permit program is also the responsibility of both management and employees. A trained in-plant auditor conducts compliance audits. Contractors receive extensive training concerning plant hazards and the plant rules and procedures that have been developed to ensure a safe workplace. Finally, mechanical integrity is enhanced by periodic inspections of critical equipment.\n\n \n\nThe chemical specific accident prevention/mitigation measures are shown below.\n\n \n\nAnhydrous Hydrofluoric Acid\n\n- Automatic shut-off valves on HF tank car unloading\n\n- Foundation improvements to improve earthquake resistance for HF unloading areas\n\n- Seismically triggered shutdown system\n\n- Use of procedure check lists for operation of HF unloading\n\n- Fence line HF detectors and alarm\n\n- Periodic inspection of nitrogen pressure regulators and relief valves in HF system\n\n- Periodic inspection and/or replacement of unloading hoses\n\n- Monthly audit of unloading operations by area foreman\n\n- Emergency repair kits for leaking tank cars\n\n- Pipeline color coding and labeling\n\n- Motion detection kill switches for HF tank car unloading\n\n- Break-away hose couplings\n\n- Six water mitigation spray towers located at the tank farm and chemical unloading areas\n\n- Water mitigation spray rings at each of the plant HF vaporizer areas\n\n- Water mitigation spray rings at each of the HF unloading platforms\n\n- Flow switch on scrubber (unloading) pump that activates automatic shut-off valves\n\n- Pressure switch on unloading line/hose activates automatic shut-off valves\n\n- Alarm on HF scrubber make-up water\n\n- Installation of strap for west HF tank car to prevent rollover into building during seismic events\n\n- Installation of liquid level switch in HF unloading scrubber vent line that activates auto"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000061219,
      "SummaryText": "matic shut-off valve \n\n \n\nAqueous Ammonia\n\n- Automatic shut-off valves on aqueous ammonia unloading valves \n\n- Foundation improvements to improve earthquake resistance at ammonia storage tanks\n\n- Seismically triggered shutdown system\n\n- Tornado/high winds protective cage around relief valves and associated piping\n\n- Use of procedure check lists for aqueous ammonia storage\n\n- Periodic inspection and/or replacement of unloading hoses\n\n- Monthly audit of unloading operations by area foreman\n\n- Pipeline color coding and labeling\n\n- Six water mitigation spray towers located at the tank farm and chemical unloading areas \n\n \n\nSome prevention/mitigation measures that have been taken in the last five years:\n\n- Performed PHA HAZOP analyses of highly hazardous chemical systems (previous analyses used What-If)\n\n- Purchased new emergency response vehicle and trailer\n\n- Completed seismic structural upgrades to process buildings and pipe racks \n\n- Installed seismically triggered emergency shutdown system\n\n- Installed seismic/emergency shut-off valves in AHF and AqNH3 unloading and storage systems\n\n- Installed seismic/emergency shut-off valves on the HF vaporizers\n\n- Installed seismic/emergency shut-off valves in UF6 distillation system columns and vessels\n\n- Installed seismic/emergency shut-off valves on all cold traps in uranium fluorination systems\n\n- Installed seismic/emergency shut-off valve on the natural gas service line\n\n- Installed tornado/high wind protective cage around AqNH3 tank relief valves\n\n- Installed tornado/high wind protective barriers on the process building to protect UF6 vessels and associated piping\n\n- Installed liquid hydrogen storage tank and system to replace consumption of anhydrous ammonia\n\n- Converted anhydrous ammonia consumption in the Wet Process operations area to aqueous ammonia consumption\n\n- Installed expansion pots on the AHF supply line to prevent potential liquid thermal expansion incidents\n\n \n\n4) The Five Year Accident History:\n\n \n\nThere are"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000061219,
      "SummaryText": " no reportable incidents within the last five years that meet the reporting requirements for RMP.\n\n \n\n5) The Emergency Response Plan:\n\n \n\nThe Emergency Response Plan (ERP) describes measures developed and implemented at MTW for recognizing and responding to emergency conditions that may arise at the plant. These measures have been developed to minimize hazards to human health or the environment from events that may arise during facility operations, including fires, explosions, or any unplanned sudden or non-sudden release of hazardous materials to air, soil, or surface water. MTW's ERP has been developed to facilitate the rapid, orderly assembly of plant personnel and to activate trained Emergency Response personnel to assist in personnel rescue and controlling and containing an emergency condition on-site.\n\n \n\nThe provisions of the ERP and its supporting procedures have been developed to provide an appropriate means of detection and response for multiple industrial incidents and natural disasters, including those described in the MTW Risk Management Plan and the Honeywell Safety Demonstration Report for Renewal of Source Materials License SUB-526. This plan is intended to be fully consistent with the multiple regulatory requirements that apply to activities at the plant, including 10 CFR 40.31(j) and 29 CFR 1910.120(q). The MTW maintains a separate RCRA Contingency Plan that has been developed to implement the requirements of 40 CFR 264 and related regulations. The provisions of the RCRA Contingency Plan augment and complement the provisions of the ERP.\n\n \n\nThe ERP addresses the following subjects:\n\n- Pre-emergency planning and coordination with outside agencies\n\n- Personnel roles, lines of authority, training and communication\n\n- Emergency prevention, recognition, and classification\n\n- Safe distances and places of refuge\n\n- Site security and control\n\n- Evacuation routes and procedures\n\n- Decontamination\n\n- Emergency medical treatment and first aid\n\n- Emergency ale"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000061219,
      "SummaryText": "rting and response procedures\n\n- Personal protective equipment and emergency equipment\n\n- Critique, debrief, and follow-up procedures\n\n \n\nNotification of Public Officials:\n\nUpon declaration of an Alert or Site Area Emergency, the Incident Commander, or designee, completes a checklist that establishes the pertinent information to be communicated to the local emergency services office.\n\nThe pertinent information includes the following:\n\n- Facility identification\n\n- Name of person reporting\n\n- Classification of emergency\n\n- Description of event and facility conditions\n\n- Status and magnitude of any radioactive or hazardous material releases\n\n- Status and nature of any injuries\n\n- Recommended protective actions for employees and members of the public\n\n- Any offsite support requested\n\n \n\nThe required information is communicated to the local emergency services (911) and the Massac County EMA Coordinator via phone by calling on a dedicated unlisted number or 911, or by a backup radio system. Follow-up communications are made to the Illinois Emergency Management Agency Communication Center and to the NRC Operations Center. The notification to the NRCOC includes verification that the local and state officials have been notified of the event.\n\n \n\n6) Planned Changes to Improve Safety:\n\n \n\nNone at this time."
    }
  ]
}