{
  "FacilityID": 1000080239,
  "FacilityName": "OSI Industries, LLC - West Chicago Facility",
  "FacilityStr1": "711 Industrial Drive",
  "FacilityStr2": null,
  "FacilityCity": "West Chicago",
  "FacilityState": "IL",
  "FacilityZipCode": "60185",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17043",
  "LEPC": "Dupage County LEPC",
  "FacilityLatDecDegs": "41.8950000",
  "FacilityLongDecDegs": "-088.231944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9786229,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "OSI Industries, LLC - West Chicago",
  "OperatorStr1": "711 Industrial Drive",
  "OperatorStr2": null,
  "OperatorCity": "West Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60185",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Lynch",
  "RMPTitle": "Plant Manager",
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000110658",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-10-31 00:00:00",
  "SafetyInspectionBy": "FM Global Insurance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-09-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-09-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-09-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-09-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.89417,
  "FRS_Long": -88.2341,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100176,
      "AltID": "Process-storage refrigera",
      "FacilityID": 1000080239,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101418,
          "ProcessID": 1000100176,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125470,
          "ProcessID": 1000100176,
          "ChemicalID": 56,
          "Quantity": 29500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625470,
          "ProcessID": 1000100176,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080239,
      "SummaryText": "    \n\nI.    Introduction\n\nA Risk Management Program has been implemented at the OSI Industries, LLC - West Chicago facility (OSI), for the reduction of accidental releases of hazardous materials. This Program summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to site personnel, contractors, visitors, and the community and environment at large of hazardous chemical releases. The Risk Management Plan (RMP) is organized to correspond with specific U.S. Environmental Protection Agency (EPA) RMP, Program 3 of 40 CFR 68, definitions and requirements of Subpart G, including: \n\n?    Introduction;\n\n?    OSI's policies to protect health, environment, and safety;\n\n?    Facility identification and regulated substances covered processes;\n\n?    Hazard Assessment;\n\n?    Prevention Program;\n\n?    Five-Year Accident History;\n\n?    Emergency Response Plan; \n\n?    Emergency Communications;\n\n?    Spill Reporting / Environmental Release Procedures;\n\n?    Planned changes to improve safety; and\n\n?    Management Program\n\n\n\nII.    OSI's Policies To Protect Health, Environment, and Safety\n\nRisk management and safety are important concerns at OSI; this updated RMP formalizes and documents these activities. OSI is committed to conducting its operations in a safe and responsible manner and to reducing risks to human health and to the environment. It is OSI policy to comply with all applicable federal, state, and local rules and regulations.\n\n\n\nThis RMP has identified potential hazards and has taken steps to design and maintain a safe facility in order to prevent releases, and minimize the consequences of accidental releases, which could occur. RMP addresses potentially catastrophic chemical releases that could result in immediate harm and acute health effects to offsite receptors (public and environmental). The RMP includes the Facility's Emergency Response Plan (ERP) that contains procedures, which are designed to maximize the safety of all employees, contractors, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080239,
      "SummaryText": "and visitors in the event of an emergency and also guard against environmental consequences.\n\n\n\n\n\n\n\nIII.    Facility Identification\n\nThe OSI facility is located at 711 Industrial Drive in West Chicago, Illinois. The facility processes ground beef specialties. The NAICS code for the processes at the facility is 311612.  Many areas of the plant are refrigerated to maintain temperature in the production and storage areas.\n\n\n\nOSI West Chicago Plant is a food processing facility that runs a continuous operation. OSI utilizes a regulated substance, anhydrous ammonia, for refrigeration. Two closed loop refrigeration systems are required to freeze the produced product and maintain the facility's temperature. OSI has a total of 29,500 pounds of Anhydrous Ammonia onsite. One closed loop system for product freezing contains 15,700 pounds and the other closed loop system for maintaining plant temperature contains 13,800 pounds. \n\n\n\nAn aerial photo identifying the site location is included as Appendix A.\n\n\n\nIV.    Hazard Assessment - Worst Case Scenario (WCS)\n\nAppendix B consists of the RMP*Submit Printout and contains additional information on the worst-case scenario.  Appendix C consists of the offsite consequence analysis data and maps for the worst case release scenario. \n\n\n\nV.    Hazard Assessment - Alternative Release Scenario (ARS)\n\nAppendix B consists of the RMP*Submit Printout and contains additional information on the alternate scenario.  Appendix D consists of the offsite consequence analysis data and maps for the alternative release scenario.\n\n\n\nVI.    General Accidental Release Prevention Program\n\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the OSHA Process Safety Management (PSM) standard (29 CFR 1910.119) and the EPA Risk Management Program. This prevention program covers those processes that handle ammonia above the threshold quantity for both PSM and RMP rules. An audit of the PSM program was conducted in August of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080239,
      "SummaryText": " 2018 and the next audit will take place on, or before, August of 2021 in compliance with the requirement to conduct PSM audits every three years.  The elements of the PSM / Program 3 prevention program and a brief description are listed below.\n\n\n\n\n\n \n\n \n\n\n\n?    Employee Participation - OSI has developed a site-specific employee participation plan that ensures employees and their representatives are consulted when conducting and developing process hazard analyses and other information required to be developed under the PSM/RMP regulation.  In addition, the employee participation program ensures employees and their representatives have access to process hazard analyses and all other information required to be developed under PSM/RMP.  Employees at OSI have assisted in developing the initial PHA and have assisted in revalidating the PHA every five years. In addition, employees have assisted in the development of other PSM/RMP information such as the development of operating and preventative maintenance procedures and management of change.\n\n?    Process Safety Information - OSI has developed a site-specific PSI program that ensures information pertaining to the hazards, technology, and equipment of the process are properly developed and maintained. Process safety information for the ammonia process has been compiled and was last reviewed as of February 21, 2019.\n\n?    Process Hazard Review - OSI has developed a site-specific PHA program that ensures a PHA is conducted initially, at a minimum of every five (5) years, and whenever a change is significant enough to require a change in PSI.  In addition, this program has been established to ensure PHAs are conducted in accordance with OSHA and EPA regulations and to ensure findings and recommendations of PHAs are properly documented. The last PHA revalidation was completed on February 21, 2019.\n\n?    Operating Procedures - OSI has developed a site-specific procedure that ensures operating procedures provide clear instruction for diffe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080239,
      "SummaryText": "rent phases of process operations and ensures they are properly maintained.  Annually, the operating procedures are reviewed and certified as accurate. The Standard Operating Procedures were last reviewed on October 31, 2018. \n\n?    Training - OSI has developed a site-specific training procedure that ensures employees operating the ammonia process have the knowledge to safely operate the process, are aware of the potential hazards of the process, and understand the causes of process problems.\n\n?    Management of Change - OSI has developed a site-specific management of change procedure that ensures changes (except for replacement in kind) to the ammonia process, such as additions of new equipment or changes in operating, maintenance, or other procedures are documented. \n\n \n\n?    Pre-Startup Review - OSI has developed a site-specific pre-startup safety review procedure that ensures a safety review is performed when modifications to the ammonia process are significant enough to require a change in PSI.\n\n?    Mechanical Integrity - OSI has developed a site-specific mechanical integrity procedure that ensures written preventative maintenance procedures are developed and maintained, preventative maintenance tests and inspections are properly documented, and employees maintaining the process receive adequate training.  Preventative maintenance procedures have been established within the written operating procedures. In addition, a preventative maintenance database application has been established to assist in documenting and tracking preventative maintenance activities.\n\n?    Contractor Qualifications - OSI has developed a site-specific contractor qualification procedure that ensures all contract employers' safety performance and programs are evaluated, a contract employee injury and illness log is maintained, information of potential hazards are communicated between OSI and the contract employer, and required training and information is communicated, such as the provisions of the emerge"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080239,
      "SummaryText": "ncy action plan and control over entrance into process areas.\n\n?    Incident Investigation - OSI has developed a site-specific incident investigation procedure that ensures each incident that either results in a release or could have resulted in a release of anhydrous ammonia is investigated, within 48 hours, by a team of at least one person knowledgeable in the process.  This procedure also makes provisions to ensure a report is prepared at the conclusion of the investigation and findings are promptly addressed. \n\n?    Compliance Audit - The facility has updated a site-specific compliance audit program to ensure compliance audits are conducted at a minimum of every three years. The most recent compliance audit was completed on August 9, 2018 and the next compliance audit will be conducted no later than August 9, 2021.\n\n?    Hot Work Permits - OSI has implemented the hot work program and developed a best management practice for hot work and permits.\n\n\n\nVII.    Five-Year Accident History\n\nThe OSI facility has not had an accidental anhydrous ammonia release, which resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\n \n\n\n\nVIII.    Emergency Action Program\n\nOSI has an Emergency Action Plan (EAP), which was last reviewed on August 9, 2018, to ensure that in the event of an emergency the facility personnel are aware of the appropriate actions to take and authorities to contact in order to mitigate the effects of a release. Response activities will be coordinated with the DuPage County Local Emergency Planning Committee (LEPC), and the West Chicago Fire Department. This coordination effort includes providing the fire departments with site diagrams and hazardous material information, meeting with fire department personnel to discuss facility operations/processes, and periodic on-site inspections by fire department personnel.\n\n\n\nThe facility"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000080239,
      "SummaryText": " maintains an EAP on file at the plant. According to the EAP, facility employees are responsible for investigating and assisting the fire department (if necessary) with response to accidental releases of ammonia. The plan includes annual training of all employees on evacuation procedures and emergency notification procedures. The plan also includes annual training for emergency action team members. It identifies the Emergency Action Coordinators, Evacuation Coordinators and alternates. OSI coordinates with the Wets Chicago Fire Department on emergency response activities. \n\n\n\nThe facility has a windsock present onsite (located on the top of the building over the engine room) for use in determining wind direction in the event of an ammonia release.\n\n\n\nEmployees receive HAZWOPER training through classroom instruction and drills. HAZWOPER training includes the first responder awareness level, the first responder operations level and hazardous materials technician training.  The facility's Plant Engineer also receives incident commander training. Responder HAZWOPER training includes procedures for using and maintaining emergency response equipment as required.\n\n\n\nThe facility's Onsite Incident Commander, Emergency Response Coordinator (Plant Engineer), or designee is responsible for notifying emergency response contractors and local, state and federal agencies of releases. The Emergency Response Coordinator (Plant Engineer) is also responsible for submitting written communication concerning releases to local, state and federal agencies. The facility does not have an on-site HAZMAT team that will respond to large ammonia releases.\n\n\n\nThe facility's Evacuation Coordinator (Safety Director) is responsible for coordinating site evacuation in the event of a release that requires evacuation.\n\n\n\nThe facility's Emergency Action Plan is maintained onsite as part of the Risk Management Program. \n\n\n\nThe current Safety Data Sheet (SDS) for anhydrous ammonia is included in Appendix "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000080239,
      "SummaryText": "E. \n\n\n\nIX.    Emergency Communications\n\nThe telephone numbers of agencies and plant personnel that may be contacted in case of an emergency are included in the facility's Emergency Action Plan.  \n\n\n\nX.    Planned Changes to Improve Safety\n\nChemical safety is an important part of OSI's operations. OSI recently conducted an audit of their Process Safety Management Program and has dutifully implemented the recommendations from that audit. Continuous improvement in safety is an important goal for OSI. In addition to the facility EAP, the plant is included in a community emergency response plan developed by the DuPage County Local Emergency Planning Committee. \n\n\n\nXI.    Management Program\n\nOSI has developed a management system to oversee the implementation of the risk management program elements.  This includes assigning a qualified person (or position) to have overall responsibility for the development, implementation, and integration of the risk management program elements.  If any portion of the program is delegated to others, the names or positions of those individuals need to be documented and the lines of authority defined through an organization chart or similar document.  Brian Lynch, Plant Manager, is responsible for overall implementation of the Risk Management Program, while Andrew Godek, Facilities Manager has responsibilities for the daily upkeep of the PSM / RMP Programs.\n\n\n\n"
    }
  ]
}