{
  "FacilityID": 1000002089,
  "FacilityName": "Atlanta-Fulton County Water Treatment Plant",
  "FacilityStr1": "9750 Spruill Road",
  "FacilityStr2": null,
  "FacilityCity": "Johns Creek",
  "FacilityState": "GA",
  "FacilityZipCode": "30022",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13121",
  "LEPC": "Fulton County, Georgia LEPC",
  "FacilityLatDecDegs": "34.0195780",
  "FacilityLongDecDegs": "-084.221976",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.veoliawaterna.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Atlanta ~ Fulton County Water Resources Commission",
  "Company2Name": "Veolia Water North America",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Atlanta ~ Fulton County WRC",
  "OperatorStr1": "9750 Spruill Road",
  "OperatorStr2": null,
  "OperatorCity": "Johns Creek",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30022",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kathy Crews",
  "RMPTitle": "General Manager",
  "FTE": 27,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000004504",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-03-30 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-03-07 00:00:00",
  "DeRegistrationEffectiveDate": "2011-12-02 00:00:00",
  "AnniversaryDate": "2014-06-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.01905,
  "FRS_Long": -84.22155,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002733,
      "AltID": "Chlorine System",
      "FacilityID": 1000002089,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000002838,
          "ProcessID": 1000002733,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002968,
          "ProcessID": 1000002733,
          "ChemicalID": 62,
          "Quantity": 64000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000502968,
          "ProcessID": 1000002733,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000002089,
      "SummaryText": "1. PURPOSE\n\nChlorine is used as a disinfectant in the water treatment plant. The finished water is disinfected by chlorine before distribution. The raw intake water feed from the Chattahoochee River may also be disinfected with chlorine prior to processing of the water. \n\n\n2. STORAGE\n\nChlorine is delivered to the treatment plant in one-ton containers.  A maximum of 32 one-ton containers of liquid chlorine can be stored on site in the chlorine storage room. \n\n\n3. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE FACILITY\n\nThe Atlanta Fulton County Water Treatment Plant (AFC-WTP) Risk Management Program (RMP) includes the following key elements to mitigate the effects of potential chlorine release hazards. \n\nA? Operator training\nA? Preventive maintenance program\nA? Process specific safety equipment\nA? Safe and effective standard operating procedures, written with operator participation\nA? Hazard review of equipment and procedures\nA? Auditing and inspection programs\nA? Comprehensive management program\n\nFurther, AFC-WTP has an active environmental, health and safety program with the following elements specifically supporting the safe handling of chlorine and the chlorination process.\n\nA? Respiratory protection (SCBA) program\nA? Chlorine detectors\nA? Chemical right to know program\nA? Personal protective equipment program\n\n4. DESCRIPTION OF THE FACILITY AND THE REGULATED SUBSTANCES HANDLED\n\nThe Atlanta-Fulton County Water Treatment Plant (AFC-WTP) provides water to North Fulton County including North Atlanta. Processing of the water begins as water from the Chattahoochee River enters the chemical building directly from the river intake or the plant's reservoir. The raw water can be pretreated with a number of chemicals including lime, alum, polymers, powdered activated carbon, chlorine and potassium permanganate, some of which will help remove tiny solid materials suspended in the water. After a preflash mix, multiple stages of flocculation cause the sm"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000002089,
      "SummaryText": "all particles to clump together. In sedimentation basins, these larger particles are removed by plate settlers. Next, the water moves onto dual-media filters which take out any tiny remaining solids. After filtration, several other chemicals, including chlorine for disinfection, are added to the water which is then stored in underground clearwells ready for distribution. Chlorine is the only substance handled at the facility that is regulated by 40 CFR Part 68 Accidental Release Prevention Requirements: Risk Management Program under Clean Air Act Section 112(r)(7).\n\n\n5. WORST-CASE RELEASE SCENARIO\n\nThe worst-case release scenario as postulated in the regulation (40 CFR 68.25) is the release of the greatest quantity (of chlorine) in a single vessel. The entire contents of this vessel are assumed to be released as a gas over a 10-minute period.  The largest single vessel at the treatment plant is a one-ton container; therefore, 2,000 pounds of liquid chlorine will be released as a gas over a 10-minute period.  A release of this magnitude would only be possible if the shell of the container failed and the liquid chlorine formed a pool and vaporized over a 10-minute period. The likelihood of this type of catastrophic release is very minimal. According to EPA's look-up tables in EPA-550-B-98-010, Exhibit 4-3, using the rural site option, the distance to the endpoint is 3.0 miles.\n\n\nThe meteorological conditions associated with the worst-case release scenario, as prescribed in the regulation, is a wind speed of 1.5 meters per second (3.36 miles per hour) and very stable atmospheric conditions. These stable atmospheric conditions will limit the mixing of the chlorine gas with the ambient air as the gas travels downwind from the point of release.  The cloud formed by the chlorine release will grow in size and decrease in concentration as it travels downwind.\n\n\n6. ALTERNATIVE-CASE RELEASE SCENARIO\n\nThe alternate release scenario is one that is more likely to occur than the w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000002089,
      "SummaryText": "orst case release scenario.  For this scenario, it was assumed that the pigtail is sheared off and mitigation occurs in one hour. The pigtail connects the 1-ton container to the manifold.  This assumption is based on the alternate release scenarios listed in Edition 3 of The Chlorine Institute Pamphlet No. 74 - Estimating the Area Affected by a Chlorine Release, Section 4.5.6, April 1998.  The entire contents of the 1-ton container (2,000 pounds) is released over a one-hour period (36 lb/min.).  For this scenario, the meteorological conditions prescribed in the regulation are neutral atmospheric stability conditions and a wind speed of 3 meters per second (6.7 miles per hour). According to EPA's look-up tables in EPA-550-B-98-010, Exhibit 4-12, using rural site, the distance to the endpoint is 0.3 miles.   \n\n\n7. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe facility complies with EPA's accident prevention rule and all applicable state and local codes and regulations. The chlorine system is designed, installed, and maintained in accordance with applicable codes and state law. \n\nThe treatment plant maintains two sets of Self-Contained Breathing Apparatus (SCBA) and The Chlorine Institute's Emergency Kit \"B\" for one-ton containers.  This equipment is stored in a room that is adjacent to the room that houses the ton containers. AFC-WTP personnel receive training on the use of the breathing apparatus and the emergency kit.  The kit contains the necessary tools and other equipment to contain valve leaks and repair small holes in a ton container, and capping devices for the fusible plugs in the ton containers.  Ton containers are equipped with fusible metal pressure relief devices.  Most ton containers have six fusible metal plugs, three in each end.  The fusible metal is designed to melt between 158 degF and 165 degF to relieve pressure and prevent rupture of the container in case of fire or other exposure to high temperature.  "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000002089,
      "SummaryText": "\n\nChlorine gas is heavier than air and will settle to the lowest elevation when released.  The chlorine storage area is equipped with an exhaust fan that is mounted near the floor on an outside wall.  There are also air intake vents located near the floor so that the chlorine gas will be vented outside the building.  The fan can be activated by a switch located outside the building and also by a switch inside the building.  Two exit doors are provided in the chlorine storage room.  \n\n\n8. FIVE-YEAR ACCIDENT HISTORY\n\nWe have never had an accident involving chlorine that required hospitalization or care by a physician, or that caused deaths, injuries, property or environmental damage, evacuations, or shelterings in place. \n\n\n9. EMERGENCY RESPONSE PROGRAM\n\nThe AFC-WTP has a site specific Emergency Response Plan (ERP) that outlines employee procedures in the event of an emergency.  An emergency classification system using four levels is used. Level 1 is for normal trouble that can be readily handled with routine operations and maintenance procedures. Level 2 is for an Alert (minor emergency), Level 3 is for a Major Emergency and Level 4 is for a disaster. These levels are explained in detail, with examples, in the facility's ERP manual. Emergency response drills, drill evaluations, and facility tours are conducted annually. The facility is presently working with a verbal agreement between the General Manager and the local fire department for chemical spills, fires, and chlorine emergencies. The fire department makes an annual visit to the facility to evaluate any changes and to familiarize new fire department personnel with the facility. A plant layout has also been given to the fire department.\n\n\n10. PLANNED CHANGES TO IMPROVE SAFETY\n\nThe Atlanta-Fulton County Water Resources Commission(AFCWRC) recently approved a plan to replace the Chlorine feed system at the facilty with a Sodium Hypochlorite feed system. The project is scheduled to begin construction in early 2010, "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000002089,
      "SummaryText": "with an estimated time of completion of 18 months from the start of construction. At the conclusion of the construction and subsequent process testing periods, the faciltiy will withdraw its participation in the RMP program."
    }
  ]
}