{
  "FacilityID": 1000056821,
  "FacilityName": "Port Reading Complex",
  "FacilityStr1": "750 Cliff Road",
  "FacilityStr2": null,
  "FacilityCity": "Port Reading",
  "FacilityState": "NJ",
  "FacilityZipCode": "07064",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34023",
  "LEPC": "Woodbridge Twp OEM",
  "FacilityLatDecDegs": "40.565556",
  "FacilityLongDecDegs": "-074.250000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.buckeye.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 189601131,
  "ParentCompanyName": "Buckeye Port Reading Terminal LLC",
  "Company2Name": null,
  "CompanyDUNS": 189601131,
  "Company2DUNS": 0,
  "OperatorName": "Buckeye Port Reading Terminal LLC",
  "OperatorStr1": "750 Cliff Road",
  "OperatorStr2": null,
  "OperatorCity": "Port Reading",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07064",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joseph Votta",
  "RMPTitle": "Director Field Ops., NE District",
  "FTE": 37,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000137041",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "17996",
  "SafetyInspectionDate": "2016-02-23 00:00:00",
  "SafetyInspectionBy": "DCA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-12-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-12-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-12-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-12-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 40.55911,
  "FRS_Long": -74.24011,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000070961,
      "AltID": "Butane Storage & Handling",
      "FacilityID": 1000056821,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000072174,
          "ProcessID": 1000070961,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000087691,
          "ProcessID": 1000070961,
          "ChemicalID": 118,
          "Quantity": 6400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000587691,
          "ProcessID": 1000070961,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056821,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RELEASE POLICIES\n\n\n\nThe Buckeye Port Reading Terminal, LLC - Port Reading Complex is located at 750 Cliff Road in Port Reading, New Jersey.  The facility is located on approximately 210 acres in a mixed industrial/commercial area with nearest residences to the west.  The complex is currently operated as a Terminal.  As of February 2013, the Port Reading Refinery ceased operations and the only active process unit from the former Refinery is the Butane Loading and Storage Tanks.\n\n\n\nBuckeye Port Reading Terminal, LLC - Port Reading Complex in Port Reading, New Jersey is committed to operating and maintaining processes in a safe, reliable and environmentally sound manner.  Buckeye believes that excellent performance in health, safety, and the environment goes hand in hand with operating reliably, and that outstanding HES performance is of paramount importance.\n\n\n\nThe Port Reading Complex is designed, operated and maintained in a manner that protects the environment, as well as the health and safety of our employees, contractors and the community.  Buckeye promotes health, safety, and the environment through programs of awareness, compliance, prevention and protection.  These programs include a combination of accidental release prevention and emergency response planning.  This document provides a brief overview of the comprehensive risk management activities that Buckeye has designed and implemented, including:\n\n\n\nA.    A description of the facility and the use of regulated substances.\n\nB.    An overview of the accidental release prevention programs.\n\nC.    A five-year accident history for accidental releases of regulated chemicals.\n\nD.    An overview of the emergency response program.\n\nE.    An overview of planned changes to improve safety.\n\n\n\nA.    STATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nThe primary function of the Port Reading Complex, located in Port Reading, New Jersey is to act as a bulk storage fuel terminal.  The butane storage pro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056821,
      "SummaryText": "cess has been classified as Program level 3.  By virtue of the flammable effects associated with butane, it is necessary to observe certain safety precautions in handling butane to prevent unnecessary human exposure, to reduce the threat to employee health, and to minimize the threat and impact to nearby members of the community.  Buckeye Port Reading Terminal, LLC is strongly committed to employee, public, and environmental safety and health.  Safety at the Facility depends upon the manner in which butane is handled as well as the various safety devices incorporated into the design of the process.  Furthermore, comprehensive training is provided to employees, which reinforces the safety policies and procedures of the Port Reading Complex.\n\n\n\nB.    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION MEASURES\n\n\n\nThe accidental release prevention programs and emergency planning and response programs help us effectively manage the hazards posed by our regulated substances to our employees, the public, and the environment.  The covered process is regulated by the EPA RMP regulation 40 CFR Part 68 and NJDEP TCPA Title 7, Chapter 31, as well as the OSHA Process Safety Management standard 29 CFR 1910.119.  The following accident prevention program elements are in place at the Port Reading Complex:\n\n\n\n1)    Employee Participation\n\n2)    Process Safety Information\n\n3)    Process Hazard Analysis (PHA) with Risk Assessments\n\n4)    Standard Operating Procedures\n\n5)    EHS Operator Training\n\n6)    Contractors\n\n7)    Pre-Startup Safety Review\n\n8)    Mechanical Integrity with Preventive Maintenance\n\n9)    Work Permits\n\n10)    Management of Change\n\n11)    EHS Accident or Potential Catastrophic Event Investigation\n\n12)    Emergency Response\n\n13)    Compliance Audits\n\n14)    Trade Secrets\n\n\n\nThese fourteen (14) individual elements of the prevention program work together to prevent accidental chemical releases.  The company and our employees are committed to the standards required by these management p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056821,
      "SummaryText": "rograms.  In addition to the above elements, we also have specific prevention measures that are employed as part of our operating procedures and engineering and administrative controls to help contain/control a release, quickly detect a release, and reduce the consequences of a release.  If a release does occur, a Facility Response Plan (FRP) is in place for the Facility and response activities are coordinated with the Port Reading Fire Department and Woodbridge Office of Emergency Management.\n\n\n\nC.    FIVE YEAR ACCIDENT HISTORY\n\n\n\nDuring the past five years, the facility did not experience any accidents resulting in on-site or off-site fatalities, serious injuries, evacuations, sheltering in place, significant property damage or environmental damage.\n\n\n\nD.    EMERGENCY RESPONSE PROGRAM\n\n\n\nResponse actions are coordinated with the Port Reading Fire Department.  A Facility Response Plan (FRP) is in place to inform employees what to do in case of a release, fire, and to notify emergency responders when there is a need for a response.\n\n\n\nBuckeye Port Reading Complex complies with the U.S. Environmental Protection Agency's (EPA) Accident Prevention Rules (40 CFR Part 68 Subpart D) NJDEP TCPA Title 7, Chapter 31, the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard and associated 14 elements (29 CFR Part 1910.119), and all applicable state and local laws and regulations.\n\n\n\nIn the event of an emergency involving the Port Reading Complex, it is the policy of the Facility to initially contact the Port Reading Fire Department and request their assistance.  The Facility maintains a trained (annual) incipient fire capability.  The Facility's emergency response plans are coordinated with the Port Reading Fire Department and Woodbridge Office of Emergency Management.\n\n\n\nE.    PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nWe a continually striving to make the Buckeye Port Reading Complex the safest and most reliable workplace possible for our employees"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000056821,
      "SummaryText": ", our neighbors and our community.\n\n\n\nIn an effort to improve and promote system safety, Buckeye looks for, and seeks employee input, on process safety improvements.  The Port Reading Fire Department is contacted regarding participation in site emergency response drills.  Additionally, Buckeye will work cooperatively with the community to address any concerns.\n\n"
    }
  ]
}