{
  "FacilityID": 1000040674,
  "FacilityName": "Big River Resources Galva, LLC",
  "FacilityStr1": "1100 SE 2nd Street",
  "FacilityStr2": null,
  "FacilityCity": "Galva",
  "FacilityState": "IL",
  "FacilityZipCode": "61434",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17073",
  "LEPC": "Henry County LEPC",
  "FacilityLatDecDegs": "41.170558",
  "FacilityLongDecDegs": "-090.024634",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 610247681,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jim Leiting",
  "OperatorStr1": "211 N. Gear Avenue",
  "OperatorStr2": "Suite 200",
  "OperatorCity": "West Burlington",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52655",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Schasel",
  "RMPTitle": "Environmental/Technical Manager",
  "FTE": 52,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000206323",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-01-31 00:00:00",
  "SafetyInspectionBy": "ERI Solutions, Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-07-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000050129,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000040674,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000050592,
          "ProcessID": 1000050129,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000060654,
          "ProcessID": 1000050129,
          "ChemicalID": 56,
          "Quantity": 97200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000560654,
          "ProcessID": 1000050129,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000050130,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000040674,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000050593,
          "ProcessID": 1000050130,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000060655,
          "ProcessID": 1000050130,
          "ChemicalID": 155,
          "Quantity": 1052800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000052249,
              "ProcessChemicalID": 1000060655,
              "ChemicalID": 119,
              "_chemical": {
                "ChemicalID": 119,
                "ChemicalName": "1-Butene",
                "CASNumber": "106-98-9",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000052250,
              "ProcessChemicalID": 1000060655,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000052251,
              "ProcessChemicalID": 1000060655,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000052252,
              "ProcessChemicalID": 1000060655,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000052253,
              "ProcessChemicalID": 1000060655,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000560655,
          "ProcessID": 1000050130,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000040674,
      "SummaryText": "RISK MANAGEMENT PLAN EXECUTIVE SUMMARY\n\nBig River Resources Galva, LLC\n\n\n\nBig River Resources Galva, LLC (BRR Galva) is submitting this correction based on suggestions from a recent RMP audit conducted at a sister facility. \n\n\n\nACCIDENTIAL RELEASE PREVENTION AND RESPONSE POLICIES:\n\nBRR Galva has an ongoing commitment to the health and safety of onsite employees and the surrounding community.  This commitment is demonstrated in the resources invested in accident prevention, such as personnel training for the proper operation and maintenance of plant equipment and preventative maintenance programs.\n\n\n\nBRR Galva has emergency response policies in place that are addressed in the facility's Health and Safety Plan; Industrial Storm Water Pollution Prevention Plan; Spill Prevention, Controls, and Countermeasures Plan; Facility Response Plan; and Emergency Action Plan. Most of the listed Plans require a minimum of annual training in order to keep employees educated on emergency response procedures in place at the facility. All new employees are required to undergo training on emergency response procedures prior to initiating responsibilities onsite.\n\n\n\nBRR Galva's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, plant personnel will respond to contain the release as necessary.\n\n\n\nDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES:\n\nBRR Galva ethanol plant is located in Galva, Henry County, Illinois. The facility operates 24 hours per day, 7 days per week for the purpose of manufacturing fuel grade ethanol from corn.  The regulated substances under the RMP program are Anhydrous Ammonia and  a flammable mixture - natural gasoline (denaturant).\n\n\n\nWORS CASE AND ALTERNATIVE CASE SCENARIOS:\n\nWorst Case Scenarios:\n\n1.  Anhydrous Ammonia:  Anhydrous ammonia is stored as a gas liquefied by pressure in an aboveground steel tank. The worst case scenario used is a release of the entire content"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000040674,
      "SummaryText": "s of the storage vessel, creating a vapor cloud. RMP Comp was used to determine the worst case distance to endpoint; the model results were 5.6 miles radius. The ammonia tank sits on a concrete pad, passive mitigation was not included as part of this scenario.  Population data was obtained using Circular Area Profiling System (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals) was obtained using Google Earth.  The South Edwards River, Edwards River, Goose Creek, Indian Creek, Fitch Creek and Mud Run are located within the worst case distance to endpoint for ammonia.  \n\n\n\n2. Flammable Mixture (Denaturant): The flammable mixture stored onsite is natural gasoline, typically referred to as denaturant. Natural gasoline is used onsite to denature ethanol prior to shipment offsite. Denaturant is stored in an aboveground steel tank in the facility tank farm. The tank is located in a diked containment structure that contains an impermeable liner with gravel overlay. A worst case MSDS was used to determine RMP applicability. The worst case scenario used is the release of the entire contents of the denaturant tank, causing a vapor cloud explosion. RMP Comp was used to determine the worst case distance to endpoint; the model results were 0.6 mile radius. Of the entire tank contents, only a portion was used in the RMP Comp model due to the breakdown of regulated constituents under CAA Section 112(r). Population data was obtained using Circular Area Profiling System (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals) was obtained using Google Earth.  No environmental receptors are affected by a worst case release of denaturant.  \n\n\n\nAlternative Scenario:\n\n1.  Anhydrous Ammonia: The alternative scenario used for anhydrous ammonia is a release due to a rupture disk/relief valve failure from the ammonia piping system. This scenario is considered the most likely cause of an ammonia r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000040674,
      "SummaryText": "elease onsite. The alternative duration is assumed to be 30 minutes with an atmospheric stability of D and a wind speed of 3.0 m/sec. The facility control room is manned 24 hours/day and would be alerted of the relief valve failure at the ammonia tank within minutes. The emergency shutdown system installed at the facility has been considered in this scenario as active mitigation. RMP Comp was used to determine the alternative distance to endpoint; the model results were 0.3 miles. Population data was obtained using Circular Area Profiling System (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals) was obtained using Google Earth. No environmental receptors are affected by an alternate release of anhydrous ammonia.  \n\n\n\n2.  Flammable Mixture (Denaturant): The alternative scenario used for the flammable mixture is the release of natural gasoline due to a tanker truck loadout spill, causing a vapor cloud fire. The endpoint used was an over pressurization of 1 PSI, a worst case option. Denaturant deliveries at the facility typically occur during normal business hours with a facility staff member overseeing loadout operations - therefore a release at the loadout area could be ceased within minutes by manual overrides. The loadout area also has a catchment basin with underground piping to secondary containment of the tank farm. For this scenario, passive and active mitigation was not considered, as the mitigation strategies currently in place would not contain a vapor cloud fire. RMP Comp was used to determine the alternative distance to end point; the model results were 0.2 miles. Of the entire tanker contents only a portion was used in the RMP Comp model due to the breakdown of regulated constituents under CAA Section 112(r). Population data was obtained using Circular Area Profiling System (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals) was obtained using Google Ear"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000040674,
      "SummaryText": "th.  No environmental receptors are affected by an alternate release of denaturant.  \n\n\n\nThe BRR Galva facility qualifies as a Program 3 for anhydrous ammonia, the facility includes the flammable mixture as a Program 3 for RMP/PSM purposes for consistency throughout the facility. \n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\n\nPlease review the first section of this Executive Summary for the general accidental release prevention program information.\n\n\n\nBRR Galva's maintenance department performs regular preventative maintenance inspections, as required by the manufacturer's recommendations and/or State and Federal regulations.  Monthly visual inspections are performed and quarterly leak detection monitoring is performed and reports filed per IEPA requirements.\n\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\nThere have been no reportable accidents associated with RMP covered processes at the BRR Galva facility.\n\n\n\nEMERGENCY RESPONSE PROGRAM:\n\nBRR Galva ethanol plant has several safety programs in place at the facility that incorporate emergency response, including a Health and Safety Plan AND Facility Response Plan.  BRR Galva has evacuation and response procedures for fires, explosions, spills, etc. outlined in the facility Emergency Action Plan. The Plans listed as part of this Executive Summary have been prepared in accordance with the applicable regulations, as necessary.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nBRR Galva provides safety training to its employees and contractors on an annual basis. Any changes to improve safety will be implemented immediately upon discovery of needed changes.\n\n"
    }
  ]
}