{
  "FacilityID": 1000106446,
  "FacilityName": "LyondellBasell Acetyls LLC (formerly Millennium)",
  "FacilityStr1": "1515 Miller Cut-Off Road",
  "FacilityStr2": null,
  "FacilityCity": "LaPorte",
  "FacilityState": "TX",
  "FacilityZipCode": "77571",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "La Porte LEPC",
  "FacilityLatDecDegs": "29.713889",
  "FacilityLongDecDegs": "-095.068333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78818024,
  "ParentCompanyName": "LyondellBasell Industries",
  "Company2Name": null,
  "CompanyDUNS": 78818893,
  "Company2DUNS": null,
  "OperatorName": "LyondellBasell Industries",
  "OperatorStr1": "1515 Miller Cut-Off Road",
  "OperatorStr2": "PO Drawer D (77536-1900)",
  "OperatorCity": "LaPorte",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77571",
  "OperatorZipCodeExt": null,
  "FTE": 539,
  "OtherEPAFacilityID": "TXD058276130",
  "EPAFacilityID": "100000158553",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O1375",
  "SafetyInspectionDate": "2022-01-31 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-08-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-08-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-08-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 29.712222,
  "FRS_Long": -95.066667,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000132933,
      "AltID": "VAM UNIT",
      "FacilityID": 1000106446,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000166620,
          "ProcessID": 1000132933,
          "ChemicalID": 155,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000149370,
              "ProcessChemicalID": 1000166620,
              "ChemicalID": 95
            }
          ]
        },
        {
          "ProcessChemicalID": 1000166615,
          "ProcessID": 1000132933,
          "ChemicalID": 98,
          "Quantity": 19000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000166616,
          "ProcessID": 1000132933,
          "ChemicalID": 29,
          "Quantity": 67000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000134386,
          "ProcessID": 1000132933,
          "NAICSCode": "32511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000114621,
              "Process_NAICS_ID": 1000134386,
              "SafetyReviewDate": "2023-05-23 00:00:00",
              "PHA_Date": "2022-04-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2026-03-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "waste water treatment",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "tank level sensors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-05-30 00:00:00",
              "TrainingReviewDate": "2023-06-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "E-Learning",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-07-13 00:00:00",
              "EquipmentInspectionDate": "2023-04-26 00:00:00",
              "EquipmentTested": "Tank 13V605 VA Product Tank",
              "ChangeMgmtDate": "2023-06-27 00:00:00",
              "ChangeMgmtReviewDate": "2023-01-10 00:00:00",
              "PreStartupReviewDate": "2023-06-19 00:00:00",
              "ComplianceAuditDate": "2021-04-12 00:00:00",
              "AuditCompletionDate": "2023-02-10 00:00:00",
              "IncidentInvestigationDate": "2022-12-15 00:00:00",
              "InvestigationChangeDate": "2024-01-15 00:00:00",
              "ParticipationPlansReviewDate": "2022-01-27 00:00:00",
              "HotWorkPermitReviewDate": "2022-06-16 00:00:00",
              "ContractorSafetyReviewDate": "2023-06-25 00:00:00",
              "ContractorSafetyEvalDate": "2022-07-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000143818,
                  "PreventionProgram3ID": 1000114621,
                  "ProcessChemicalID": 1000166620
                },
                {
                  "PrimaryKey": 1000143840,
                  "PreventionProgram3ID": 1000114621,
                  "ProcessChemicalID": 1000166616
                },
                {
                  "PrimaryKey": 1000143841,
                  "PreventionProgram3ID": 1000114621,
                  "ProcessChemicalID": 1000166615
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106446,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-08-10 00:00:00",
    "ERTrainingDate": "2023-02-15 00:00:00",
    "CoordinatingAgencyName": "LaPorte LEPC",
    "CoordinatingAgencyPhone": "2816399258",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106446,
      "SummaryText": "Response Program.\nMembers of the Emergency Response Team (ERT) undergo training that includes classroom and on-the-job training as well as regular emergency drills. A highly trained and confident ERT can limit damage during an emergency event, but more importantly prompt emergency response can prevent more serious accidents from occurring. Our teams regularly attend some of the best training programs available, in particular, the programs conducted at Texas A&M University.\n\nPlanned changes to improve safety [40 CFR 68.155(f)]:\nThe plant continuously evaluates hazards and implements action items to address deficiencies identified through the PSM/RMP program such as from PHAs, compliance audits, and MOCs.\n\nLyondellBasell Acetyls has completed this report to provide the public with information about our activities at this facility.  We believe that the many controls instituted to maintain a safe operation, and our commitment to continuous improvement that an incident affecting our employees or the surrounding area is unlikely to occur."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106446,
      "SummaryText": "f a hot work permit for hot work operations conducted on or near the covered process.\n\nContractors\nOur company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. LyondellBasell Acetyls informs the contractors of known potential hazards related to contractors work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur. Contractor post evaluations are also conducted to ensure compliance with LyondellBasell Acetyls safety and health procedures.\n\nThe five-year accident history [40 CFR 68.155(d)]:\nThere have been no accidental releases in the past five years that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage.\n\nThe emergency response program [40 CFR 68.155(e)]:\nLyondellBasell Acetyls has developed a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes emergency response activities such as providing adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. To ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the emergency response plan is promptly updated to reflect changes taking place within our processes that would require a modified emergency response. The La Porte Police Department is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated.\n\nLyondellBasell Acetyls has gone above and beyond the normal safety requirements to provide employees with a safe working environment. One program that enhances our ability to respond to emergencies is our Emergency"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106446,
      "SummaryText": "s identified by the maintenance checks or inspections are corrected in a safe and timely manner.\n\nManagement of Change\nThe Management of Change process in place at LyondellBasell Acetyls controls changes to process chemicals, equipment, technology, personnel, and procedures. Reviews are conducted prior to implementation to ensure that the change does not have adverse impact on safety, health or the environment. The Management of Change process includes notification or training of affected personnel.\n\nPre-Startup Safety Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at LyondellBasell Acetyls. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nLyondellBasell Acetyls conducts compliance audits at least every three years to determine whether the provisions set out under the RMP rule are being implemented. Corrective actions required as a result of the audits are addressed in a prompt manner.\n\nIncident Investigation\nLyondellBasell Acetyls investigates incidents that have resulted in, or could have reasonably resulted in, significant release of a regulated substance. These investigations identify the immediate and underlying cause(s) as well as any corrective actions to prevent the release from reoccurring.\n\nEmployee Participation\nCompany employees and contractors are encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to information created as part of the facility's implementation to the RMP rule including process safety information and process hazard analyses results. Employees participate on investigation teams, safety teams, and audit teams.\n\nSafe Work Practices (Hot Work)\nLyondellBasell Acetyls has a hot work permit that requires issuance o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106446,
      "SummaryText": "ntains process safety information that includes information pertaining to the hazards of the regulated substances used or produced by the process, information pertaining to the technology of the process, and information pertaining to the equipment in the process.\n\nProcess Hazard Analysis\nLyondellBasell Acetyls conducts Process Hazard Analysis (PHA) to ensure that hazards associated with the process are identified and mitigated. The studies are undertaken by a team of personnel with expertise in engineering and process operations and are revalidated at least every five years. Findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nLyondellBasell Acetyls maintains written operating procedures for the purposes of safely conducting activities within our covered processes. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. Operating procedures are regularly reviewed and are readily accessible to operators involved with the processes.\n\nTraining\nLyondellBasell Acetyls has a training program in place to ensure employees that are operating processes are knowledgeable in the operating procedures associated with these processes. New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently. Refresher training is provided at least every three years or more frequently as needed.\n\nMechanical Integrity\nLyondellBasell Acetyls carries out documented maintenance checks and inspections on process equipment to ensure its integrity. Examples of process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by trained and qualified personnel Equipment deficiencie"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106446,
      "SummaryText": "This is an executive summary of the policies, procedures, and activities for compliance with the EPA's Accidental Release Prevention Requirements - Risk Management Program pursuant to Title 40 Part 68 of the Code of Federal Regulations (40 CFR 68) for the LyondellBasell facility in LaPorte, Texas.\n\nThe accidental release prevention and emergency response policies at the stationary source [40 CFR 68.155(a)]:\nLyondellBasell Acetyls is committed to employee and public safety and to protecting the environment. This commitment is inherent to our accidental release prevention program which includes conducting process hazard analysis, management of change, pre-startup safety reviews, operating procedures, mechanical integrity, and training. Safeguards are in place to prevent releases of regulated substances. If a release of a regulated substance were to occur, our trained emergency response personnel will be engaged to control and mitigate the effects of the release. LyondellBasell Acetyls also coordinates with Channel Industries Mutual Aid (CIMA) which provides additional emergency response expertise.\n\nThe stationary source and regulated substances handled [40 CFR 68.155(b)]:\nLyondellBasell Acetyls' primary activities encompass Vinyl Acetate Monomer and Acetic Acid. There are three RMP-regulated substances present at LyondellBasell Acetyls in quantities greater than or equal to their threshold quantities (as listed below):\nEthylene in a flammable mixture\nPropane\nVinyl Acetate Monomer\n\nThe general accidental release prevention program and chemical-specific prevention steps [40 CFR 68.155(c)]:\nLyondellBasell Acetyls has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68. The facility is also subject to the OSHA Process Safety Management standard under 29 CFR 1910.119. Below is a brief description of the elements involved in our release prevention program:\n\nProcess Safety Information\nLyondellBasell Acetyls mai"
    }
  ]
}