{
  "FacilityID": 1000094409,
  "FacilityName": "Sanger Poultry",
  "FacilityStr1": "1078 North Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sanger",
  "FacilityState": "CA",
  "FacilityZipCode": "93657",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": null,
  "FacilityLatDecDegs": "36.695562",
  "FacilityLongDecDegs": "-119.552638",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sanger Poultry",
  "OperatorStr1": "1078 North Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Sanger",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93657",
  "OperatorZipCodeExt": null,
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000187184",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-09-28 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-07-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-07-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-07-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000117180,
      "AltID": "Refrigeration System",
      "FacilityID": 1000094409,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000146562,
          "ProcessID": 1000117180,
          "ChemicalID": 56,
          "Quantity": 38000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000118580,
          "ProcessID": 1000117180,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000100253,
              "Process_NAICS_ID": 1000118580,
              "SafetyReviewDate": "2020-12-10 00:00:00",
              "PHA_Date": "2020-08-18 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-08-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-09-09 00:00:00",
              "TrainingReviewDate": "2021-06-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-06-28 00:00:00",
              "EquipmentInspectionDate": "2021-06-25 00:00:00",
              "EquipmentTested": "Monthly Evap Checklist",
              "ChangeMgmtDate": "2021-01-20 00:00:00",
              "ChangeMgmtReviewDate": "2021-06-28 00:00:00",
              "PreStartupReviewDate": "2021-01-20 00:00:00",
              "ComplianceAuditDate": "2018-09-20 00:00:00",
              "AuditCompletionDate": "2020-03-20 00:00:00",
              "IncidentInvestigationDate": "2018-08-28 00:00:00",
              "InvestigationChangeDate": "2018-09-20 00:00:00",
              "ParticipationPlansReviewDate": "2021-06-28 00:00:00",
              "HotWorkPermitReviewDate": "2021-06-28 00:00:00",
              "ContractorSafetyReviewDate": "2021-06-28 00:00:00",
              "ContractorSafetyEvalDate": "2021-03-10 00:00:00",
              "CBI_Flag": 0,
              "Description": "Sanger Poultry has prepared a unified Risk & Process Safety Management Program. The program is in compliance with Californias Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5 Program Level 3 Elements. At the Federal level, Title 40 CFR Part 68), and California OSHAs Process Safety Management (PSM) of Acutely Hazardous Materials standard (in California CCR Title 8, Section 5189, Process Safety Management of Acutely Hazardous Materials, and Federally Title 29 Code of Federal Regulations (CFR) 1910.119). This program has been prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs.,which is contained in our refrigeration system.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000125730,
                  "PreventionProgram3ID": 1000100253,
                  "ProcessChemicalID": 1000146562
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000094409,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fresno County Environmental Health",
    "CoordinatingAgencyPhone": "5596003271",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094409,
      "SummaryText": "This program is intended to meet the spirit and intent of the following regulations:\n\n- California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\n\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\n- California Process Safety Management (PSM) Program, Title 8 CCR ?5189\n\n- Federal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\n\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Pitman Farms - Sanger Poultry has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1 Pitman Farms - Sanger Poultry, Risk and Process Safety Management Program\n\nThis is to inform all interested persons, including employees, that Pitman Farms - Sanger Poultry has updated their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following processes which have the presence of hazardous chemicals above threshold quantities: \n\n\n\nAmmonia Refrigeration System - Anhydrous Ammonia - 38,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses and physical property damage.\n\n\n\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n1. Prepared a unified program based on the PSM plan to meet CalARP and RMP obligations as well\n\n2. Organized the program so that it meshes closely with general b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094409,
      "SummaryText": "usiness practices\n\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures and practices that will help our employees and neighbors protect themselves.\n\n\n\n1.2 Process Descriptions\n\n\n\nFacility Overview\n\n\n\nSanger Poultry operates a processing plant and freezer for poultry products that utilizes an ammonia refrigeration system to provide refrigeration capacity to the following areas:\n\n(1) Palletizing Room\n\n(2) Loading Docks (East and West)\n\n(2) Freezers (East and West)\n\n(2) Air Chill Rooms (1st Floor and 2nd Floor)\n\n(1) 70?F 1st Processing Room\n\n(1) 43?F 2nd Processing Room\n\n(1) Turkey Room\n\n(4) Blast Cells \n\n(2) Coolers (East and West)\n\n(1) Turkey Grinding Room\n\n(2) Shell and Tube Water Chillers\n\n(1) Ice Maker\n\n\n\nFacility Location\n\n\n\nSanger Poultry is located at 1078 North Avenue, Sanger, CA 93657. The latitude and longitude of the high pressure receiver is 36.694960, -119.552544. The facility is located within the city limits of Sanger CA which is located approximately 12 miles east of state highway 99. \n\n\n\nAccording to FEMA Flood Map Service, the facility is located in \"a special flood hazard area\". The elevation of the machinery room was designed with the flood hazards in mind.\n\nSanger Poultry is not located in an Alquist-Priolo Fault Zone as defined by the California Department of Conservation. In addition, a review of United States Geological Survey (USGS) fault maps revealed that there are no faults in close proximity to the site. The USGS 2018 One-Year Model revealed that Sanger Poultry has a 1-2% chance of experiencing \"potentially minor-damage\" due to ground shaking in 2018.\n\n\n\nDescription of Covered Process\n\n\n\nAll control valve groups are mounted on the roof to provide easy access. The refrigeration machinery is contained within the refrigeration machinery room, above the refrigeration machinery room, and various locations througho"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094409,
      "SummaryText": "ut the facility. \n\n\n\nProcess Chemistry\n\nThe refrigeration system employed at Sanger Poultry is configured for a combination of flooded and pumped overfeed operation. The function and thermodynamics of each major component type in the system is summarized below:\n\n\n\nHigh Pressure Receiver\n\nThe purpose of the high pressure receiver is to provide a safe location to add and store high pressure liquid ammonia in the refrigeration system. The high pressure receiver receives high pressure liquid from the condensers and thermosyphon vessel and supplies high pressure liquid to each flooded zone of refrigeration and liquid recirculator. The high pressure receiver is also used to provide storage for ammonia not being used in the process at any given moment. The high pressure receiver is equipped with two (2) main liquid feed shut-off valves (king valves) that are clearly labeled and can be used to stop the flow of ammonia throughout the system. Under normal conditions, the high pressure receiver contains high pressure liquid and vapor ammonia.\n\n\n\nFlooded Accumulator\n\nThe purpose of each flooded accumulator is to provide a supply of low pressure liquid ammonia to the shell and tube heat exchangers, ice maker or air handling unit. Each accumulator is equipped with an expansion valve which expands the high pressure liquid into a low temperature and pressure liquid as it enters the vessel. The flooded accumulators supply, by gravity, low pressure liquid to the associated heat exchangers. Liquid and vapor returned from the heat exchangers are separated inside the flooded accumulators to allow only the vapor to be returned to the suction accumulator or recirculators. Under normal conditions, the flooded accumulators contain low pressure liquid and vapor ammonia.\n\n\n\nSubcooler\n\nThe subcooler receives and subcools liquid from the high pressure receiver in order to supply lower pressure liquid to the flooded accumulators and recirculators. The subcooler is equipped with an expansion valv"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094409,
      "SummaryText": "e which expands high pressure liquid into a low temperature and pressure liquid as it enters the vessel. A second supply of high pressure liquid is piped from the high pressure receiver and into spiral piping inside the subcooler. The low pressure liquid in the vessel absorbs heat from the high pressure liquid in the spiral piping. The subcooled high pressure liquid exits the subcooler and is combined with the high pressure liquid supply to the zones of refrigeration and recirculators. Under normal conditions, the subcooler contains low and high pressure liquid and vapor.\n\n\n\nHigh Temperature Recirculator (+10?F)\n\nThe purpose of the high temperature recirculators is to provide a supply of low pressure liquid that can be used in high temperature evaporators throughout the facility. The high temperature recirculators receive liquid from the high pressure receiver and supply, by gravity, low pressure liquid to the ammonia pumps mounted underneath the vessels. Liquid and vapor returned from the evaporators is separated inside the recirculators to allow only the vapor to be piped to the suction of each high stage compressor. The high temperature recirculators are equipped with a high level float switch that is wired to shut down the compressors in the event of a high level situation. This prevents liquid ammonia from entering the compressors. Under normal conditions, the high temperature recirculators contain low pressure liquid and vapor ammonia.\n\n\n\nLow Temperature Recirculator (-20?F)\n\nThe purpose of the low temperature recirculator is to provide a supply of low pressure liquid that can be used in low temperature evaporators throughout the facility. The low temperature recirculator receives liquid from the intercooler and supplies, by gravity, low pressure liquid to the ammonia pumps mounted underneath the vessel. Liquid and vapor returned from the evaporators is separated inside the recirculator to allow only the vapor to be piped to the suction of each low stage compr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000094409,
      "SummaryText": "essor. The low temperature recirculator is equipped with a high level float switch that is wired to shut down the compressors in the event of a high level situation. This prevents liquid ammonia from entering the compressors. Under normal conditions, the low temperature recirculator contains low pressure liquid and vapor ammonia.\n\n\n\nOil Pots\n\nThe purpose of the oil pots is to provide a safe location to drain oil from the refrigeration system. The oil pots receive liquid ammonia and oil from the recirculators and vent ammonia vapor back to the recirculators. The oil pots are equipped with spring-return oil drain valves which are used to drain oil from the system as needed. Under normal conditions, the oil pots contain low pressure liquid ammonia, low pressure vapor ammonia, and refrigerant oil.\n\n\n\nAir Handling Units \n\nThe purpose of the air handling units is to remove heat from the air in order to maintain a predetermined space temperature. The air handling units receive liquid from accumulators which flows through a set of continuous coils inside the unit. Fans inside the unit pull outside air through the coils and into the refrigerated areas in the facility. As the air blows across the coils, the liquid refrigerant absorbs a great deal of heat from the air and evaporates. Once the liquid has evaporated to form low temperature and pressure vapor, it returns to the accumulators. Under normal conditions, the air handling units contain low pressure liquid and vapor ammonia.\n\n\n\nAir-Cooling Evaporators (Pumped Overfeed)\n\nThe purpose of the air-cooling evaporators is to remove heat from the air in order to maintain a predetermined space temperature. The air-cooling evaporators receive liquid from the recirculators. The evaporators contain a set of continuous coils through which the low pressure liquid flows. Due to the low pressures and temperatures maintained in the evaporator, the liquid refrigerant absorbs a great deal of heat from the surrounding area and evaporates. "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000094409,
      "SummaryText": "To increase the rate of heat removed, the evaporators use an electric fan to move warm air over the coils of cold liquid ammonia. Once the liquid has evaporated to form low temperature and pressure vapor, it returns to the supplying vessel. Under normal conditions, the air-cooling evaporators contain low pressure liquid and vapor ammonia.\n\n\n\nRed Water and Paw Chillers (S&T HX)\n\nThe purpose of the Red Water and Paw Chillers is to remove heat from the liquid being pumped through it. The Red Water and Paw Chillers receive liquid from flooded accumulators where it is contained within the shell of the heat exchanger and surrounds the tubes containing chilled liquid. Low pressure liquid ammonia and vapor exits the shell and tube heat exchanger and is returned to the flooded accumulator. Under normal conditions, the Red Water and Paw Chillers contain low pressure liquid and vapor ammonia.\n\n\n\nIce Maker \n\nThe purpose of the ice maker is to freeze water and create flake ice. The ice maker receives liquid from a flooded accumulator where it enters a cooling jacket inside the tank. The liquid in the jacket absorbs heat from the water flowing across the inside surface of the jacket, creating a layer of ice. The ice is then scraped off of the jacket surface and exits the ice maker. Low pressure liquid and vapor exits the ice maker and is returned to the flooded accumulator. Under normal conditions, the ice maker contains low pressure liquid and vapor ammonia.\n\n\n\nSuction Accumulator\n\nThe purpose of the suction accumulator is to prevent liquid from entering the compressors. The suction accumulator receives vapor from the flooded accumulators and separates any residual liquid from the vapor to allow only the vapor to be piped to the suction of each compressor. Liquid in the suction accumulator drains by gravity into the liquid transfer vessel. The suction accumulator is equipped with a high level float switch that is wired to shut down the compressors in the event of a high level si"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000094409,
      "SummaryText": "tuation. This prevents liquid ammonia from entering the compressors. Under normal conditions, the suction accumulator contains low pressure vapor ammonia.\n\n\n\nTransfer Vessel\n\nThe purpose of the transfer vessel is to transfer liquid from the low side of the refrigeration system back to the high pressure receiver. The transfer vessel receives liquid from the main suction accumulator. Once the liquid level in the transfer vessel reaches the float switch, the three way solenoid valve is energized for a period of time causing the transfer vessel to become subject to high pressure and allowing the liquid to drain by gravity into the high pressure receiver. Under normal conditions the transfer vessel can contain either high or low pressure liquid and vapor.\n\n\n\nCompressors\n\nThe purpose of the compressors is to raise the temperature and pressure of the low pressure gas in order to reject the heat absorbed in the evaporator to the atmosphere. The compressors receive low pressure vapor from the suction accumulator and recirculators and discharge high pressure vapor to the evaporative condensers. The compressors are equipped with high discharge pressure cutouts to shut the equipment off if the pressure exceeds the setpoint. Under normal conditions, the compressors contain both high and low pressure vapor ammonia.\n\n\n\nEvaporative Condensers\n\nThe purpose of the evaporative condensers is to reject the heat absorbed in the evaporators to the atmosphere. The evaporative condensers receive high pressure, superheated vapor from the compressors and supply high pressure liquid to the high pressure receiver and thermosyphon vessel. The condensers use air and water to cool the warm ammonia as it passes through a series of tubes within the condenser. As the cooling medium of air and water draws the heat from the vapor, the refrigerant condenses into a liquid and flows to the high pressure receiver/thermosyphon vessel. Under normal conditions, the evaporative condensers contain high pressure"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000094409,
      "SummaryText": " liquid and vapor ammonia.\n\n\n\nThermosyphon Vessel\n\nThe purpose of the thermosyphon vessel is to provide a supply of liquid ammonia necessary to cool the oil in the compressors. The thermosyphon vessel receives high pressure liquid from the condensers and supplies high pressure liquid to the thermosyphon oil cooler on each screw compressor. Excess liquid in the thermosyphon vessel is piped to the  high pressure receiver. High pressure ammonia vapor formed in each oil cooler is returned to the thermosyphon vessel. Under normal conditions, the thermosyphon vessel contains high pressure liquid and vapor ammonia.\n\n\n\nOil Cooler\n\nThe purpose of the oil coolers is to remove heat from the oil being circulated through them. The oil coolers receive liquid from the thermosyphon vessel. High pressure liquid and vapor exits the oil coolers and is returned to the thermosyphon vessel. Under normal conditions, the oil coolers contain high pressure liquid and vapor ammonia.\n\n\n\nAuto-Purger\n\nThe purpose of the auto-purger is to remove non-condensable gases from the system without requiring the system to be manually opened. The auto-purger consists of the following components: water bubbler, foul gas line, liquid line, suction line, water line, drain line, and remote purge point solenoid valves. The auto-purger removes non-condensable gases by refrigerating the foul gas so that the ammonia vapor condenses to liquid and can be returned to the system. The non-condensable gases are removed from the system through the water bubbler. Under normal conditions, the auto-purger contains small quantities of ammonia and water. \n\n\n\nSafety Systems\n\n\n\nAmmonia Detection\n\nThe machinery room is equipped with two (2) ammonia detectors. A Calibration Technologies GG-NH3 detector provides low concentration detection and alerts refrigeration personnel by cell phone notification at 25 ppm and audible/visual alarm to plant personnel if the ammonia concentration exceeds 50 ppm. Audible/visual alarms are availa"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000094409,
      "SummaryText": "ble outside and inside the machinery room. If the concentration reaches 150 ppm, the emergency ventilation system will be activated. A Calibration Technologies GG-NH3-2% detector provides high concentration detection and will shut the system down if the concentration exceeds 7,500 ppm. \n\n\n\nEmergency Pressure Control System\n\nThe emergency pressure control system was installed in accordance with ANSI/IIAR 2 and the Fire Code at the time of construction.\n\nThe Emergency Pressure Control System (EPCS) operates a follows: \n\nEPCS is activated at not greater than 90% pressure relief valve setting (e.g. 270 psig or less) [ANSI/IIAR 2-2008 Appendix K.4.5.3] \n\nUpon activation, all compressors are stopped by a means that is independent of all other safety controls [ANSI/IIAR 2-2008 Appendix K.4.5.6] \n\nUpon activation, cross-over valve is opened [ANSI/IIAR 2-2008 Appendix K.4.5.6] \n\nUpon activation, a signal is provided to personnel responsible for refrigeration system maintenance [ANSI/IIAR 2-2008 Appendix K.4.5.7] \n\nEPCS remains active until manually reset [ANSI/IIAR 2-2008 Appendix K.4.5.8]\n\nEPCS crossover isolation valves are locked open [ANSI/IIAR 2-2008 Appendix K.4.4.2] \n\nThe emergency pressure control system is seldom used in a refrigeration system, but has been installed for rare emergency situations.\n\n\n\nPressure Relief Valve\n\nAll ASME pressure vessels and positive displacement compressors are equipped with relief valves designed to relieve pressure and protect the equipment from rupturing. Details regarding the relief valves are summarized below:\n\nEach relief valve has a set pressure equal to or less than the MAWP of the equipment that the relief valve protects;\n\nEach relief valve has a capacity which meets or exceeds the requirement of ANSI/IIAR 2-2014 Addendum A ?15.3.8;\n\nAll relief valves are connected to a common manifold which terminates into the ammonia diffusion tank; \n\nThe relief valve discharge termination pipe is equipped with a vent line sensor which will no"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000094409,
      "SummaryText": "tify plant personnel if a release occurs.\n\n\n\nDiffusion Tank\n\nThe diffusion tank is a static water filled system to neutralize an ammonia release from a pressure relief valve. The ammonia diffusion tank is 7.25' dia. x 18' high (5,558 gallon capacity). At a water level of 16'-6\", the tank contains 5,095 gallons of water which exceeds the quantity recommended by ANSI/IIAR 2-2014 Addendum A ?15.5.3 which is based on 1 gallon of water per pound of ammonia released through the largest relief valve in the system in 60 minutes. Periodic inspection of the diffusion tank water level and pH validates its ability to provide passive protection. When an ammonia release to the diffusion tank does occur, the relief vent sensor mounted in the tank discharge vent will alarm and then clear if the release stops. Water pH must be lowered to acceptable levels by chemical treatment after a release event. A vacuum break in the relief vent line prevents a vacuum from pulling water out of the tank and into relief vent piping.\n\n\n\nScrew Compressor Safety Devices\n\nEach screw compressor is provided with Frick Quantum HD compressor control panels which include monitoring, alarm through the Refrigeration Control System, and auto shutdown on all critical levels. Each screw compressor has numerous safety devices to protect the compressor and the associated equipment. The following list summarizes the safety devices built into each screw compressor package:\n\nHigh Discharge Pressure Cutout - The high discharge pressure cutout, will shut down the compressor if the discharge pressure equals or exceeds the setpoint.\n\nLow Suction Pressure Cutout - The low suction pressure cutout will shut down the compressor if the suction pressure is equal to or less than the setpoint.\n\nOil Pressure Cutout - The oil pressure cutout will shut down the compressor if the oil pressure equals or deviates below the setpoint.\n\nHigh Oil Temperature Cutout - The high oil temperature cutout will shut down the compressor if the oi"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000094409,
      "SummaryText": "l temperature equals or exceeds the setpoint.\n\nLow Oil Temperature Cutout - The low oil temperature cutout will shut down the compressor if the oil temperature equals or falls below the setpoint.\n\nDischarge Temperature Cutout - The high discharge temperature cutout will shut down the compressor if the discharge temperature equals or exceeds the setpoint.\n\nAuxiliary Alarm - The auxiliary alarm may be configured for either an alarm (AL) or shutdown (SH) and with either a normally closed (NC) or normally open (NO) contact.\n\nLow Motor Amps - If the micro detects that the motor current is at 20% FLA or below (adjustable set point) for 2 minutes, then a \"Low Motor Amp Cutout\" will occur. The default for the set point is 20% with a range from 0% to 100%. If a set point of 0% is entered, this will disable this feature.\n\n\n\nHigh Level Float Switch\n\nThe main suction accumulator and recirculators are all equipped with a high level float switch that is wired to shut down the compressors in the event of a high level situation. This prevents liquid ammonia from entering the compressors.\n\n\n\nMain Liquid Feed Shut-Off Valves (King Valves)\n\nThe high pressure receiver is equipped with two (2) main liquid feed shut-off valves (King Valves 1 and 2) and one auto king valve. The two main king valves are clearly labeled and can be used to stop the flow of ammonia throughout the system. \n\nKing Valve 1 corresponds to Valve 003 on the P&IDs, King Valve 2 corresponds to Valve 005, and the auto king valve corresponds to Valve 002. It should be noted that the potential exists for trapping liquid ammonia in the event that Valve 001 is closed while the auto king valve is de-energized. To prevent trapping liquid, ensure Valve 003 is closed in the event that King Valve 1 must be manually closed. \n\n\n\nEmergency Refrigeration Switches (E-Stops)\n\nThe three principal entrances to the mechanical room doors are each equipped with an emergency refrigeration switch that controls power to the refrigeration mac"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000094409,
      "SummaryText": "hinery inside the machinery room. Each switch can be activated in an emergency using the hammer next to the switch to break the switch glass.\n\n\n\nProcess Classification\n\n\n\nThe ammonia refrigeration system at Sanger Poultry consists of vessels, equipment, and valves which are interconnected by piping. As such, the refrigeration system at Sanger Poultry is treated as a single process.\n\n\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n\n\n1.3.1 General \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meetings we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nPitman Farms - Sanger Poultry has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \n\n\n\n1.3.2 Anhydrous Ammonia\n\nThe ammonia refrigeration process at the Pitman Farms - Sanger Poultry facility is an integral part of the overall business and operates most of the year. The ammonia process contains a total charge of approximately 38,000 (LBS). It is extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\n\n\nOur refrigeration personnel monitor the ammonia refrigeration process and keep an active log book of all procedures and transactions that pertain to ammonia. In addition, the process is checked frequently by one of the outside refrigeration contractors that we use. These contractors also assist in performing the annual mechanical integrity inspection of our ammonia equipment. \n\n\n\n1.4 Five Year Accident History\n\n\n\nPitman Farms - Sanger Poultry"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000094409,
      "SummaryText": " does not have any accidental releases within the last five (5) years.\n\n\n\n1.5 Emergency Action and Response Plan\n\nPitman Farms - Sanger Poultry's emergency action and response program has been developed to satisfy the following requirements:\n\nCalifornia \"Emergency Action Plan\" - Title 8 CCR ?3220\n\nFederal \"Emergency Action Plan\" - Title 29 CFR ?1910.38\n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\n\n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nPitman Farms - Sanger Poultry has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, Pitman Farms - Sanger Poultry continually strives to improve in all areas, including safety.\n\n\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved Pitman Farms - Sanger Poultry's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Pitman Farms - Sanger Poultry's management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nPitman Farms - Sanger Poultry has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter."
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000094409,
      "SummaryText": "\n\n\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Pitman Farms - Sanger Poultry has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\n\n\n\nFor the future, Pitman Farms - Sanger Poultry now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for Pitman Farms - Sanger Poultry employees, but allows for feedback and continual improvement. Through the RMP-PSM program Pitman Farms - Sanger Poultry will continue to maintain overall plant worker and public safety.\n\n"
    }
  ]
}