{
  "FacilityID": 1000011089,
  "FacilityName": "ELMIRA WATER BOARD FILTRATION PLANT",
  "FacilityStr1": "1 Fountain Drive",
  "FacilityStr2": null,
  "FacilityCity": "Elmira",
  "FacilityState": "NY",
  "FacilityZipCode": "14905",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36015",
  "LEPC": "Chemung County LEPC",
  "FacilityLatDecDegs": "42.10000",
  "FacilityLongDecDegs": "-076.83566",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.elmirawaterboard.org",
  "FacilityEmailAddress": "waterinfo@elmirawaterboard.org",
  "FacilityDUNS": 45604741,
  "ParentCompanyName": "ELMIRA WATER BOARD",
  "Company2Name": null,
  "CompanyDUNS": 45604741,
  "Company2DUNS": 45604741,
  "OperatorName": "ELMIRA WATER BOARD",
  "OperatorStr1": "261 W. Water Street",
  "OperatorStr2": null,
  "OperatorCity": "Elmira",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14901",
  "OperatorZipCodeExt": null,
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000117624",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-02-09 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-09-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-09-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-09-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-09-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.10107,
  "FRS_Long": -76.8357,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013199,
      "AltID": "water disinfection",
      "FacilityID": 1000011089,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015215,
          "ProcessID": 1000013199,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000013567,
          "ProcessID": 1000013199,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000010951,
              "Process_NAICS_ID": 1000013567,
              "SafetyReviewDate": "2009-06-22 00:00:00",
              "PHA_Date": "2012-03-23 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-03-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": "Test chlorine scrubber prior to chlorine tank changeout.",
              "OpProceduresReviewDate": "2014-09-22 00:00:00",
              "TrainingReviewDate": "2014-03-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Mock chlorine drill/Respirator training with fire dept/ Hazmat training with decon suits and scba equipment.",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Hands on with scba equipment",
              "MaintenanceReviewDate": "2014-09-25 00:00:00",
              "EquipmentInspectionDate": "2014-09-08 00:00:00",
              "EquipmentTested": "chlorinators, ejectors,vacuum regulators, scrubber",
              "ChangeMgmtDate": "2004-03-04 00:00:00",
              "ChangeMgmtReviewDate": "2004-06-01 00:00:00",
              "PreStartupReviewDate": "2004-06-03 00:00:00",
              "ComplianceAuditDate": "2012-04-09 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2004-06-01 00:00:00",
              "HotWorkPermitReviewDate": "2004-06-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2004-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000012741,
                  "PreventionProgram3ID": 1000010951,
                  "ProcessChemicalID": 1000015215
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000011089,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-06-28 00:00:00",
    "ERTrainingDate": "2009-09-15 00:00:00",
    "CoordinatingAgencyName": "Elmira Fire Department/Hazmat team",
    "CoordinatingAgencyPhone": "6077375708",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011089,
      "SummaryText": "ecords are maintained at our facility. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n- Management of Change procedures are in place for process, instrumentation, equipment or chemical modifications to the chlorination system. Prior to implementing any change in the chlorination process, our RMP team members will identify, review and authorize such changes. Operating procedures are revised to contain the new operating parameters. Process operators, maintenance personnel or any other employee whose job tasks are affected by the change are promptly made aware of and provided training on the modification.\r\n- Prior to a startup of a changed process, all employees involved with operating and maintaining this process are informed and trained. These reviews are conducted to confirm that the procedures are suitable for the safe startup prior to placing the equipment into operation. Operating procedures are then revised to reflect all changes.\r\n- Compliance audits are performed on a regular basis by our RMP team to determine whether the RMP requirements are being met. The audit procedures include a checklist and visual inspection of the chlorination equipment and procedures. Any corrective actions needed are documented and followed up to ensure compliance. \r\n- Incident investigations are promptly conducted by the Chief operator to identify the underlying cause of the incident and to implement corrective measures to prevent a future occurrence. The investigation includes a description of the incident as well as a list of recommendations and commentary by affected personnel. All incident reports are maintained for a minimum of five years.\r\n- Elmira Water Board operating, maintenance and safety employees are involved in the Risk Management Program and receive appropriate training on a regular basis.  Employees are encouraged to express their views concerning accident prevention issues and to recommend improvements. We"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011089,
      "SummaryText": "empha the following prevention elements to our employees: High level of training, preventative maintenance and testing and effective operating procedures prepared with the participation of all involved employees. Employees are also trained in the toxic properties of chlorine and elementary first aid.\r\n- Contractors are hired periodically to conduct work on or adjacent to the chlorination equipment. Prior to starting work, the Elmira Water Board informs the contractor of all potential hazards they may be exposed to as well as the emergency equipment and procedures in place. They are also advised of their responsibilities to maintain safe work practices. \r\n\r\n4. Five-Year Accident History\r\nThe Elmira Water Board has had an excellent record of preventing accidental releases over the last five years. Due to our stringent release prevention policies, there has been no accidental release during this period. \r\n\r\n5. Emergency Response Plan\r\nThe Elmira Water Board has an Emergency Response Committee that has prepared a comprehensive written Emergency Response Plan to deal with an accidental chlorine release. The plan includes all aspects of the emergency response depending on the seriousness of the leak and the probability of in-house control. In the event of a major leak, the operator on duty will immediately call 911 to alert the Elmira Fire Department /  Hazmat team. The response team will be dispatched to the scene where they will take command of the situation. First aid and medical treatment, evacuations, notification to the public and local emergency response agencies will commence. The Elmira Water Board and the Elmira Fire Department Hazmat team have conducted joint chlorine disaster drills on a bi-annual basis since 1999. The Elmira Water Board's facility contains safety and mitigation equipment including sensors, chlorine scrubber and SCBA units.\r\n\r\n6.Planned Changes to Improve Safety\r\n- Chlorine operating procedures will be revised to require a third employee to o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011089,
      "SummaryText": "bserve the chlorine tank switchover from an outside area. This procedure was last updated on 3/23/12.\r\n- We plan on installing an audio alarm to alert personnel when the Chlorine Scrubber is activated. A visual alarm on SCADA was operational by 3/23/12.\r\n- The chlorine B kit will be inspected for replacement parts on a regular basis.\r\n- Future safety meeting drill at our facility will place more emphasis on the chlorination process and the inherent dangers.\r\n- Our staff will look into installing an additional camera in our CCTV system to monitor the chlorine storage room. Completed 6/22/09.\r\n- We will investigate installing new digital chlorine scales to connect to our SCADA system.\r\n- A chlorine release drill is planned for the fall of 2004 with the County EMS and the Elmira Fire Department.  \r\n- The Elmira Water Board staff will study alternatives to the present disinfection process to determine if we can convert from chlorine gas without adversely affecting water quality in the distribution system. A review of our experience with liquid chlorine in our reservoirs indicates a conversion from chlorine gas is not viable at this time. \r\n- Our chlorine vendor has been contacted and will comply with our request to inspect the chlorine tank valves prior to shipment to our facility to ensure their operability."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011089,
      "SummaryText": "Risk Management Plan\r\nExecutive Summary for the Elmira Water Board\r\n\r\n\r\n1. Accidental Release Prevention and Emergency Response\r\n \tThe Elmira Water Board's management staff and employees are committed to the safety of all employees, the public and the environment.\r\nOur accidental release prevention program is reviewed on a regular basis by a team of employees qualified in the areas of operations, maintenance, engineering and emergency response.  All elements of the Risk Management Program are updated and implemented on a regular basis. This program covers areas of design, operating procedures, equipment maintenance, operator training and emergency response. \r\nWe have conducted emergency response training that is tailored to fit the degree of hazard at our facility. Training is conducted both internally and in co-operation with the Elmira Fire Departments' HAZMAT team. This training has been in the form of a mock chlorine release drill in which our employees and the emergency responders simulate actions taken to mitigate a chlorine gas release and subsequent decontamination. \r\nIt is the policy of the Elmira Water Board to establish appropriate controls to minimize the potential for an accidental release and to regularly train employees to respond to a release should one occur. The Elmira Water Board has accountability and responsibility for the overall program.\r\n\r\n2. The Stationary Source and Regulated Substances Handled\r\nOur Water Filtration Plant uses chlorine (liquefied under pressure) to disinfect and provide potable drinking water to our community at an average daily production rate of 7 MGD. \r\nChlorine is delivered to our plant in one ton containers; the maximum amount on hand at any time is 8,000 lbs.  Chlorine tanks are stored in an assigned room with appropriate sensors and neutralizing equipment in place. \r\n\r\n3. Accident Release Prevention Program\r\nOur facility has taken the necessary steps to comply with the accidental release prevention requirement"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011089,
      "SummaryText": "s of 40 CFR part 68 of the EPA. The processes at our facility are subject to OSHA PSM standards under CFR 1910.120. We are also subject to the Clean Water Act Regulations 40 CFR 112 and State EPCRA Rules and Laws.\r\nOur prevention program encompasses the following elements:\r\n- Process Hazard Analyses are conducted routinely by a qualified team of employees with education and expertise specific to our chlorination process. This team uses checklist and what-if scenarios to ensure all hazards associated with the process are identified and controlled to minimize risk. All findings from the process hazard analysis are documented and team members are assigned specific tasks to address all action items.\r\n- Operating Procedures are documented and reviewed for content and accuracy by management and plant operators routinely. Our plant operators undergo on the job training, which addresses various modes of operation. Written procedures are also posted in the process area for easy access. These procedures are clearly written for properly conducting all activities associated with the operation, maintenance and inspection of the chlorination system.\r\n- Process Safety Information is documented and maintained at our facility. This information regarding the chlorine system is compiled in sufficient detail to enable employees to identify and understand the potential hazards of our chlorination process.\r\n- Operator training is provided to increase awareness of process hazards associated with the chlorination system. This training is provided regularly or whenever a process change is made to ensure operator competence in all operating procedures.\r\n- All equipment used in the process is regularly maintained in order to minimize the risk of a chlorine release. Preventative maintenance and equipment inspections are performed by manufacturer technicians as well as qualified employees in accordance with the manufacturers' recommendations. All maintenance and inspections are documented and r"
    }
  ]
}