{
  "FacilityID": 1000081509,
  "FacilityName": "Nouryon Houston Plant",
  "FacilityStr1": "15200 Almeda Road",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77053",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Fort Bend LEPC",
  "FacilityLatDecDegs": "29.583889",
  "FacilityLongDecDegs": "-095.433889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.nouryon.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39059985,
  "ParentCompanyName": "Nouryon",
  "Company2Name": null,
  "CompanyDUNS": 183977487,
  "Company2DUNS": null,
  "OperatorName": "Nouryon",
  "OperatorStr1": "15200 Almeda Road",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77053",
  "OperatorZipCodeExt": null,
  "FTE": 146,
  "OtherEPAFacilityID": "77053WTCRG15200",
  "EPAFacilityID": "100000048566",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O1328",
  "SafetyInspectionDate": "2019-01-28 00:00:00",
  "SafetyInspectionBy": "Texas Commission on Environmental Quality",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-09-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-07-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 29.583889,
  "FRS_Long": -95.433889,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101865,
      "AltID": "Oxylation",
      "FacilityID": 1000081509,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127718,
          "ProcessID": 1000101865,
          "ChemicalID": 9,
          "Quantity": 3400000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000127719,
          "ProcessID": 1000101865,
          "ChemicalID": 12,
          "Quantity": 680000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000103147,
          "ProcessID": 1000101865,
          "NAICSCode": "32599",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000086048,
              "Process_NAICS_ID": 1000103147,
              "SafetyReviewDate": "2018-11-29 00:00:00",
              "PHA_Date": "2019-02-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "LOPA",
              "PHACompletionDate": "2020-03-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "BLEVE",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Annual replacement of oxide pumps.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "ERP and plant evacuation.  1st call notification system for community.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Motion sensor around railcar area.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Addition of railcar area dike to PM program.",
              "OpProceduresReviewDate": "2018-02-16 00:00:00",
              "TrainingReviewDate": "2018-09-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-09-19 00:00:00",
              "EquipmentInspectionDate": "2019-01-29 00:00:00",
              "EquipmentTested": "PV-0331 V600 vent to V008 control valve.",
              "ChangeMgmtDate": "2019-02-01 00:00:00",
              "ChangeMgmtReviewDate": "2018-09-27 00:00:00",
              "PreStartupReviewDate": "2018-09-27 00:00:00",
              "ComplianceAuditDate": "2018-08-22 00:00:00",
              "AuditCompletionDate": "2019-05-01 00:00:00",
              "IncidentInvestigationDate": "2019-02-08 00:00:00",
              "InvestigationChangeDate": "2019-02-08 00:00:00",
              "ParticipationPlansReviewDate": "2016-04-25 00:00:00",
              "HotWorkPermitReviewDate": "2018-12-17 00:00:00",
              "ContractorSafetyReviewDate": "2019-02-01 00:00:00",
              "ContractorSafetyEvalDate": "2017-06-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000107389,
                  "PreventionProgram3ID": 1000086048,
                  "ProcessChemicalID": 1000127719
                },
                {
                  "PrimaryKey": 1000107388,
                  "PreventionProgram3ID": 1000086048,
                  "ProcessChemicalID": 1000127718
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000081509,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-05-17 00:00:00",
    "ERTrainingDate": "2019-01-02 00:00:00",
    "CoordinatingAgencyName": "Fort Bend LEPC",
    "CoordinatingAgencyPhone": "2813426185",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000081509,
      "SummaryText": ", as it relates to the community emergency response, include but are not limited to, the following:\r\n\r\n¿\tNouryon maintains an emergency response team whose members are specifically trained and equipped to respond to emergencies such as leaks, spills, fires, etc.\r\n¿\tResponse is coordinated with emergency response agencies in the community.\r\n¿\tNouryon maintains a community emergency notification plan.\r\n¿\tEmergency response personnel are regularly trained to comply with federal, state, and local requirements.\r\n¿\tAn automated community telephone emergency notification system is available to provide concise emergency information to neighbors if an event that could affect them were to occur.\r\n\t\r\n7.  Planned Changes to Improve Safety\r\nCompliance with the RMP Prevention Program forms the framework for continuous safety improvement plans, which fall into three primary areas:\r\n\r\n¿\tProcess Hazard Analysis: Identification of potential hazards, and prompt implementation of corrective action are done in accordance with applicable regulations and as a matter of company policy.\r\n¿\tIncident Investigation: Prompt, thorough investigation of all significant incidents and near-misses are conducted and findings are shared across the company.\r\n¿\tBenchmarking: The facility continually evaluates its safety program and processes against the best in the world, with the goal of continual improvement.\r\n\r\nThe plant has received recognition by OSHA under the Voluntary Protection Program (VPP), including its process safety programs. As part of ongoing efforts to improve safety at the facility, several RMP regulated chemicals at the facility have been removed or substituted for safer chemicals. As a result of this, the number of RMP covered chemicals in use at the facility has decreased from five to two."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000081509,
      "SummaryText": "nt Investigation:\r\nThe facility requires reporting and investigation of incidents that result in, or could reasonably have resulted in, a fire, explosion, or toxic release. Any high priority recommendations resulting from the incident investigation are addressed promptly, and other recommendations are tracked until resolved. A file is maintained to record the incident history for review and for consideration in the next process hazard analysis. \r\n\r\nNo RMP reportable incidents were found to have occurred in the last five years at the facility.\r\n\r\nAudits:\r\nPSM/RMP audits are conducted every three years, and reports are written to document any gaps identified. The status of audit recommendations is tracked until resolution.\r\n\r\n5.  Five-Year Accident History\r\n\tEPA requires that all incidents involving regulated chemicals that resulted in any off-site impact or significant on-site impact be reported in the EPA RMP submittal document. Within the last five years, since July 5, 2014, there were no releases of hazardous materials that met the criteria for an RMP accident.\r\n\t \r\n6.  Emergency Response Program\r\nThe facility conducts emergency response preparedness activities and coordinates emergency response actions necessary with the local fire department and local emergency planning committee (LEPC). As appropriate, the police, local hospitals, and other coordinating agencies also continue to be involved in emergency response for the facility.  \r\n\t\r\n\tThe plant manager is responsible for coordinating the emergency actions.  A written and specific Emergency Response Plan coordinated with local officials is in place for the facility.  The Emergency Response Program provides the essential planning for effectively protecting workers, the public, and the environment during emergency situations.\r\n\t\r\nNouryon maintains a comprehensive site emergency response plan. Employees train regularly on the plan as they prepare for a plant-wide drill. Key elements of the emergency response plan"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081509,
      "SummaryText": "s. Operator refresher training is conducted as needed but at least every 3-years.\r\n\r\nContractors:\r\nThe facility uses contractors to supplement its work force during periods of increased construction or maintenance activities. Before being hired, a contractor's safety performance is reviewed, and prior to being allowed to work in the plant, the contractor is given safety training to help assure that site specific safety procedures are followed. A permit system is in place, which requires that contractors obtain written approval to begin a work task. The Houston Nouryon plant requires its contractors to complete safety training conducted by the Houston Area Safety Council.\r\n\r\nPre-Startup Safety Review (PSSR):\r\nThe facility conducts a PSSR before new or modified processes are started up, to verify sure that the new or modified facilities and the associated procedures are safe for operation.\r\n\r\nMechanical Integrity:\r\nThe facility has an ongoing system to test, inspect and maintain the process equipment in good working order, as needed for safe operation.  New equipment and installations are inspected before first use (PSSR) to ensure that they were constructed properly and are safe to operate. Mechanical integrity program test, inspection and repair priorities are established around equipment identified as safety critical.\r\n\r\nSafe Work Practices:\r\nThe facility has permit systems in place to make sure that hazardous activities such as hot work, confined space entry, and energy isolation are performed safely, by requiring that knowledgeable persons from operations and maintenance provide written permission before such work can be performed.\r\n\r\nManagement of Change:\r\nThe facility has procedures in place to identify safety and health impacts of a change to procedures and equipment. Operations and engineering management personnel assure that changes are not authorized until the safety and health impact(s) are mitigated and the necessary safety requirements are met.\r\n\r\nIncide"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081509,
      "SummaryText": "ontainment events do not occur from process equipment.\r\n¿\tMinimizing the possibility of a release of ethylene oxide and propylene oxide, using shutdown interlocks installed on process equipment.\r\n¿\tReducing the severity of fires and releases with automatic sprinkler and manual deluge systems.\r\n\r\nEmployee Participation:\r\nNouryon encourages and insists upon employee participation in Process Safety Management (PSM). Knowledgeable operators write or review operating procedures and are included in process hazard analyses. Employees attend monthly safety meetings that begin with a safety topic to increase safety awareness and employee involvement. Operators are assigned to project teams to review and comment on new designs, to train on new processes and to train others on major process changes prior to implementation.\r\n\r\nProcess Safety Information:\r\nThe facility maintains updated information regarding its chemical hazards, processes, procedures, and equipment, which is used by employees as needed to help them do their jobs safely.\r\n\r\n\r\nProcess Hazard Analysis:\r\nNew and existing processes, and any changes to existing processes, are examined using OSHA PSM recognized process hazard analysis (PHA). The methodology used is designed to help knowledgeable employees recognize process hazards.  Recommended actions from PHAs are tracked until resolution.\r\n\r\nOperating Procedures:\r\nThe facility maintains written procedures for the process that address normal operations as well as emergency and abnormal operations.\r\n\r\nTraining:\r\nSafety training is conducted monthly and a new topic is introduced each month. The safety topics are posted on a safety calendar, which is available to employees. Initial training is provided to new employees. Experienced operators train new employees on operating procedures and use direct observation to determine that the new employee is qualified for that job.  Written tests are also used to verify that employees understand the training and operating manual"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081509,
      "SummaryText": "ner that the small releases associated with normal operation and maintenance will be minimized to the extent possible.\r\n¿\tCorrecting findings identified in regular audits of the facility.\r\nNouryon is committed to environment, worker, and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our processes. However, if a release does occur, trained Nouryon personnel will respond, to control and contain the incident. Details on the emergency response program are outlined in Section 6.\r\n\t\r\nIn the event of a significant accidental release, Nouryon personnel will respond by shutting down operations, and/or by applying water mitigation to absorb and dilute the release of water-soluble chemicals. As necessary, onsite personnel will be evacuated and the local emergency planning committee (LEPC), fire department and police will be notified to help handle the emergency and warn the public. Additionally, the facility has an automated system in place to contact potentially affected members of the community by telephone to provide communication of a potential chemical hazard.\r\n\r\n4.  Prevention Program\r\nThe Nouryon Houston facility is operating under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program.  Ongoing analysis of the potential hazards of the process, detailed training of employees and emphasis on safety has contributed to process safety.  The facility has had no RMP chemical release accidents over the last five years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases, as part of a detailed prevention program.  A few examples of the prevention features implemented at this facility include:\r\n\r\n¿\tProviding preventive maintenance and testing of vessels through the Mechanical Integrity program to ensure that loss of c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081509,
      "SummaryText": "lation process, the facility uses two EPA RMP covered chemicals - ethylene oxide and propylene oxide - in quantities greater than the threshold quantity of 10,000 lbs. The Houston facility does not have any EPA RMP-regulated flammable chemicals. The facility is subject to the OSHA Process Safety Management Standard, 29 CFR 1910.119, and regulated under EPA Risk Management Program 40 CFR Part 68 - Program Level 3 requirements.\r\n\r\nThe hazards of the process operated at the Nouryon Houston facility are managed through safety programs developed at the facility. For ethylene oxide (EO) and propylene oxide (PO), numerous process controls such as sensors, alarms and interlocks detect and prevent hazardous upset conditions. Automatic shut-off valves prevent EO/PO from being added unless the process conditions are safe. Leak sensors provide alarms if leaks are detected and deluge systems are provided for tank, unloading, and reactor areas to absorb leaks. Dikes are provided for the storage tanks. All of the vessels are protected with self-closing relief valves, and all of the vessels are maintained under an inert atmosphere. The EO/PO suppliers have well developed product stewardship programs and periodically visit the facility to provide assistance in the safe handling of oxides and special training materials towards that goal.\r\n\r\nSeveral regulated chemicals-sulfur dioxide, isopropylamine and ammonia-were discontinued at the facility in a effort to make the process inherently safer by utilizing alternate process chemistry. \r\n\r\n3.  Accidental Release Prevention and Emergency Response Policies\r\nThe accidental release prevention and emergency response programs in place at the facility are part of the high standards adopted by Nouryon.  These standards include:\r\n\r\n¿\tOperating in compliance with required environmental permits and regulations. \r\n¿\tOperating and maintaining the assets such that unintentional releases are minimized.\r\n¿\tOperating and maintaining assets in such a man"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081509,
      "SummaryText": "Risk Management Plan Executive Summary\r\nThis section provides the Executive Summary which gives an overview of each of the components of the Risk Management Program, including but not limited to:\r\n\r\n¿\tA narrative on the accidental release prevention and emergency response policies as required by 40 CFR 68.155(a);\r\n¿\tA description of the stationary source and regulated substances handled as required by 40 CFR 68.155(b);\r\n¿\tA section on general accidental release prevention and chemical-specific prevention steps as required by 40 CFR 68.155(c);\r\n¿\tFive-Year Accident History of the facility as required by 40 CFR 68.155(d);\r\n¿\tA description of the emergency response program as required by 40 CFR 68.155(e); and\r\n¿\tA discussion of planned changes to improve safety as required by 40 CFR 68.155(f).  \r\n\r\nIt should be noted that the Executive Summary no longer includes a discussion of the Worst-Case and Alternative Release Scenarios reported to the EPA due to regulations promulgated on April 9, 2004.\r\n\r\nThe Executive Summary, as provided by Nouryon and included in RMP*eSubmit, is shown in Section 1 through 7.\r\n\r\n1.  Introduction and Policies\r\nNouryon is committed to operating in a manner that is safe for their employees, contractors, the public and the environment. As part of this commitment, Nouryon has established a system to help assure the safe operation of chemical processes at the facility. One part of this system is a Risk Management Program (RMP) that is required by the EPA's Chemical Accident Prevention Provisions in Title 40 of the Code of Federal Regulations, Part 68. One of the requirements of the regulations is to submit a Risk Management Plan (RMP) which descriptions the risk management programs at the facility for review by the EPA and the public.\r\n\r\n2.  Stationary Source and Regulated Substances\r\nThe Nouryon Houston plant stores regulated substances for use in oxylation, which chemically transforms those substances into less hazardous products. \r\n\r\nFor the oxy"
    }
  ]
}