{
  "FacilityID": 1000079907,
  "FacilityName": "New Orleans Cold Storage",
  "FacilityStr1": "3411 S. Jourdan Road",
  "FacilityStr2": null,
  "FacilityCity": "New Orleans",
  "FacilityState": "LA",
  "FacilityZipCode": "70126",
  "Facility4DigitZipExt": "5049",
  "FacilityCountyFIPS": "22071",
  "LEPC": "Orleans Parish LEPC",
  "FacilityLatDecDegs": "29.996921",
  "FacilityLongDecDegs": "-090.014436",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": "www.nocs.com",
  "FacilityEmailAddress": "thenry@cecinet.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mark Blanchard",
  "OperatorStr1": "3411 Jourdan road",
  "OperatorStr2": null,
  "OperatorCity": "New Orleans",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70126",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Enos",
  "RMPTitle": "Director of Safety",
  "FTE": 42,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000188879",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-05-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-07-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-10 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-07-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099757,
      "AltID": "NOCS",
      "FacilityID": 1000079907,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100996,
          "ProcessID": 1000099757,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124983,
          "ProcessID": 1000099757,
          "ChemicalID": 56,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624983,
          "ProcessID": 1000099757,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079907,
      "SummaryText": "Executive Summary\n\n\n\nA.  Describe Accidental Release Prevention and Emergency Policies\n\n\n\n\n\nAt NOCS our safety objectives will be met as well as adherence to all applicable federal, state and local regulations and standards.  This means all employees must be fully supportive of our Safety and Health Programs for it to be truly effective.\n\n\n\nAccidental Release Prevention and Emergency Policies are designed to comply with OSHA's Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, 29 CFR 1910.119) and EPA's Risk Management Program (RMP) for Chemical Accidental Release Prevention, 40 CFR Part 68 regulation.\n\n\n\nThe purpose of the accidental release prevention and emergency action program is to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\n\n\n\nSafety requires the full diligence of each and every employee.  This safety awareness must exist in everyone's actions, thinking and planning.  Each employee must not only prevent obvious unsafe acts, but also must anticipate and eliminate potential hazards to him or her and co-workers.\n\n\n\nIt is NOCS's policy that all tasks and assignments will be performed in a safe and efficient manner, assuring the maximum opportunity for an accident-free workplace.\n\n\n\nB.  Stationary Source and Regulated Substances Handled\n\n\n\nNew Orleans Cold Storage is a refrigerated warehouse for the storage of perishable foods.  This facility operates an ammonia refrigeration system to provide cooling and freezing capabilities.  The amount of anhydrous ammonia (CAS #7662-41-7) contained in this system is in excess of 10,000 pounds.  The ammonia inventory of this system is approximately 50,000 lbs.  Since ammonia releases from this system could pose a risk to onsite personnel,as "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079907,
      "SummaryText": "well as offsite to the environment and the public sector, it is regulated under the OSHA PSM standard (29 CFR 1910.119) as well as subject to the Program 3 requirements of the EPA's RMP regulation.\n\n\n\nThe closed loop ammonia refrigeration system at the facility provides (3) major suction pressures (temperatures) for use in the preservation and process freezing of perishable food products.  Through the use of single stage compression the refrigeration system provides refrigerant temperatures of -25F. -35F and +11.5F.\n\n\n\nThe higher pressure portions of the system include the condenser, located on the roof, along with refrigerant vent lines where any leaks can dissipate to the air where consumed as it goes through a natural biodegrading process.  Normal safeties include: high pressure cut-outs, relief valves, deluge system and ventilating systems for machine room areas.\n\n\n\nC.  Summary of Worst-Case and Alternative Release Scenarios\n\n\n\nThe Worst Case Release Scenario is determined to be a catastrophic release from the High Pressure Receiver V-1 Vessel. A worst-case release from this vessel includes an estimated 10,929 pounds of ammonia.  For this Worst Case Release Scenario, the distance from source to toxic endpoint is 2.4 miles.\n\n\n\nThe worst-case release scenario is unlikely for the following reasons:\n\n\n\nIndustry standards were followed for the manufacture and quality control of these vessels;\n\nPressure safety valves limit operating pressures in these vessels and vessels have design margins of safety of about 4 to 1. Active mitigation would be the Emergency Shutdown System which permits system to equalize to 50-60 psig\n\n\n\n\n\nAlternative Release Scenario Analysis\n\n\n\nAn Alternative Release Scenario is chosen as a pipe failure.  The potential for a pipe failure is possible given the extensive ammonia piping system extending throughout the Facility and, as such, represents a more realistic event than the catastrophic failure of a vessel.\n\n\n\nBased on ALOHA calculation it is"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079907,
      "SummaryText": " assumed the failure of a 2-inch pipe elbow due to line connected to the V-1 (at #150) Receiver after impact by fork truck.  Using EPA-suggested meteorological parameters for alternative scenarios and following a 10 minute release, the distance from release point to the toxic endpoint is 0.25 miles. \n\n\n\n The Alternative Release Scenario is unlikely for the following reasons:\n\n\n\nThe high pressure liquid lines are located in enclosed areas that could help to contain such a release;\n\nIndustry standards were followed for the manufacture and quality control of these lines;\n\nAmmonia is not corrosive in this service. Trained and certified fork truck operators. Limited fork truck traffic allowed in engine room. \n\n\n\nD.  Description of the Accidental Release Prevention Program\n\n\n\nThe prevention program (OSHA Process Safety Management CFR 1910.119) consists of the following elements; these programs are current under reevaluation and restructure.\n\nEmployee Participation\n\nProcess Safety Information\n\nProcess Hazard Analysis\n\nOperating Procedures\n\nTraining\n\nContractors\n\nPre-startup Safety Review\n\nMechanical Integrity\n\nHot Work Permit\n\nManagement of Change\n\nIncident Investigation\n\nCompliance Audits\n\n\n\nE.  Five-Year Accident History\n\n\n\nThere have been no reportable incidents in the past five years.\n\n\n\nF.  Description of the Emergency Response Program\n\n\n\nThis facility will call in local emergency personnel in the event of a significant ammonia release.  The facility is included in the community Emergency Response Program coordinated by the Orleans Parish, Louisiana LEPC, 317 Decatur St., New Orleans, LA 70130, 1-504-565-7800. The current EAP is under review and revision.\n\n\n\nG.  Planned Changes to Improve Safety\n\n\n\nAn active PSM team provides routine over-site of the PSM program to assure policy and procedures are reviewed, maintained and updated as needed to improve the PSM program, and thus improve safety.\n\n"
    }
  ]
}