{
  "FacilityID": 1000076043,
  "FacilityName": "Phil Tollefson Water Treatment Plant at the Mesa",
  "FacilityStr1": "2715 Mesa Road",
  "FacilityStr2": null,
  "FacilityCity": "Colorado Springs",
  "FacilityState": "CO",
  "FacilityZipCode": "80904",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08041",
  "LEPC": "Colorado Springs LEPC",
  "FacilityLatDecDegs": "38.871115",
  "FacilityLongDecDegs": "-104.862805",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "ST",
  "FacilityURL": "http://www.csu.org",
  "FacilityEmailAddress": "rsebastiancoleman@csu.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Colorado Springs Utilities",
  "Company2Name": null,
  "CompanyDUNS": 127711760,
  "Company2DUNS": 127711760,
  "OperatorName": "Colorado Springs Utilities",
  "OperatorStr1": "PO Box 1103, Mail Code 0940",
  "OperatorStr2": null,
  "OperatorCity": "Colorado Springs",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80947",
  "OperatorZipCodeExt": "0940",
  "RMPContact": "Bryan Babcock",
  "RMPTitle": "Gen Mgr-Water Sys Ops",
  "FTE": 12,
  "OtherEPAFacilityID": "COD980956171",
  "EPAFacilityID": "100000033572",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-01-18 00:00:00",
  "SafetyInspectionBy": "Colorado Springs Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-09-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-09-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-09-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.8711,
  "FRS_Long": -104.86388,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000094601,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 1000076043,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000095863,
          "ProcessID": 1000094601,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000118371,
          "ProcessID": 1000094601,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000618371,
          "ProcessID": 1000094601,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000076043,
      "SummaryText": "This executive summary provides a brief overview of the Risk Management Program (RMP) and the associated policies at the Mesa Water Treatment Plant (Mesa), one of several facilities owned and operated by the Colorado Springs Utilities.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLCIES\n\nColorado Springs Utilities has determined that this facility is required to comply with RMP Program Level 2.  Colorado Springs Utilities believes that it is important to provide a safe workplace to its employees and minimize the impact of its operations on the surrounding community and the environment.  Accordingly, Colorado Springs Utilities has developed proactive safety and environmental programs, which are reliant upon active employee participation and management leadership and support.  This same proactive philosophy was employed in the development and implementation of the Mesa RMP for the chlorine system.\n\n\n\nThe RMP prevention program is arguably the most important element of the rule.  Its program elements require the active participation of facility employees and management in conducting activities aimed at preventing accidental releases of regulated chemicals.  If prevention activities could be completely successful, there would be no need for emergency response activities, since no releases would occur.  Accordingly, a well-developed and properly-implemented prevention program will lower the possibility of an accidental release and minimize the consequences of a release should one occur.\n\n\n\nColorado Springs Utilities takes an active role in preventing accidental releases at all of its facilities by ensuring that its employees are well-informed regarding the hazards associated with the regulated processes (e.g., chlorine at the Mesa) and actively participated in a comprehensive hazard review.  The system employees are properly trained in the safe operation of the covered processes and the safe handling of treatment chemicals.  They are aided in this work by com"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000076043,
      "SummaryText": "plete, understandable system operating procedures.\n\n\n\nColorado Springs Utilities management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in the Mesa RMP procedures and policies.\n\n\n\nAs for emergency response, Colorado Springs Utilities has established and maintains emergency procedures.  These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nMesa is located at 2715 Mesa Road in Colorado Springs, El Paso County, Colorado.  Mesa is a surface water treatment plant consisting of the following processes:  pre-chlorination, coagulation, flocculation, sedimentation, filtration, post-chlorination, and stabilization.  Pre-chlorination uses an initial dose of chlorine to disinfect the incoming water and to maintain a chlorine residual throughout the treatment process.  Post-chlorination is required to boost the chlorine level to maintain disinfection throughout the distribution system.  Due to the amount of chlorine located at the Mesa, it is regulated under Program 2 of the RMP rule.\n\n\n\nCustomers served and flow rate at the Mesa WTP is dependent on water sources, source availability, source quality and customer demand.  The Water Services Division, Water Systems Operations department of Colorado Springs Utilities operates Mesa.\n\n\n\nPREVENTION STEPS FOR CHLORINE\n\nThe prevention program and chemical-specific prevention steps are described in detail in the Mesa RMP manual.  The prevention program includes the following elements:\n\n\n\n-Safety information, which includes information pertaining to the hazards of chlorine in the process, process technology, and process equipment\n\n-Hazard review, which includes a systematic evaluation (by an employee team) of:  the hazards of the chlorine process, id"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000076043,
      "SummaryText": "entification of previous process incidents, engineering and administrative controls, consequences of failure of the engineering and administrative controls, facility location, human factors, and possible safety and health effects of failure of controls\n\n-Operating procedures, which include steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions\n\n-Training for each Mesa employee involved in operating the chlorine system\n\n-Computerized maintenance program including schedules and job plans to maintain the on-going integrity of the chlorine process equipment\n\n-Compliance audits at least every three years from 1999 to evaluate Mesa RMP compliance\n\n-Incident investigation, to be conducted and documented for each incident that resulted in, or could have reasonably resulted in, a catastrophic release of chlorine from Mesa.\n\n\n\nIn addition to these elements, the chlorine storage facility at Mesa is equipped with a chemical scrubber and automatic shutoff. Robo Actuators will close the chlorine tank valve if an ambient atmospheric concentration of greater than 10ppm of chlorine is detected. In the event of a release of chlorine in the storage room, the normal ventilation system shuts down and the chlorine-contaminated air is sent to the scrubber for neutralization.  The scrubber is maintained and tested on a regular basis to ensure proper operation during a chlorine release event.\n\n\n\nACCIDENT HISTORY\n\nWithin the five-year period prior to the submittal of this RMP, there were no accidental releases of chlorine meeting the requirements of 40 CFR 68.42.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThis facility is included in the Colorado Springs LEPC Emergency Response Program.  In addition, Mesa has established and maintains emergency procedures, which includes an evacuation and notification plan.  The goals of the established procedures are to protect onsite employees from the hazardous effects of chemical releases and to min"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000076043,
      "SummaryText": "imize the effects of releases on the general public.  The procedures are routinely reviewed and updated to reflect personnel and regulatory changes.  Colorado Springs Utilities works closely with the Colorado Springs LEPC and other local industries and agencies to coordinate local response activities.\n\n\n\nPLANNED CHANGES FOR IMPROVED SAFETY\n\nIdeas for changes to improve safety are actively sought from employees.  Employee meetings that focus on safety issues are held regularly at Mesa.  Employees are encouraged and trained to recognize hazards and to present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\n"
    }
  ]
}