{
  "FacilityID": 1000011752,
  "FacilityName": "Belmont Rail Siding Storage Facility",
  "FacilityStr1": "Intersection Hwy 27 and Black Road",
  "FacilityStr2": null,
  "FacilityCity": "Belmont",
  "FacilityState": "WA",
  "FacilityZipCode": "99104",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53075",
  "LEPC": "Whitman County LEPC",
  "FacilityLatDecDegs": "47.08890",
  "FacilityLongDecDegs": "-117.16280",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.canexus.ca",
  "FacilityEmailAddress": "Marty.Cove@canexus.ca",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Washington Idaho Railway",
  "Company2Name": "Canexus U.S. Inc.",
  "CompanyDUNS": 0,
  "Company2DUNS": 803513964,
  "OperatorName": "Canexus U.S. Inc.",
  "OperatorStr1": "Suite 300, 450 Gears Road",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77067",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Bourgeois",
  "RMPTitle": "Vice President, Sales & Marketing",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000209856",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-11-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-11-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-11-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-03-12 00:00:00",
  "DeRegistrationEffectiveDate": "2014-05-30 00:00:00",
  "AnniversaryDate": "2014-11-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000014146,
      "AltID": "Chlorine Storage Siding",
      "FacilityID": 1000011752,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000014487,
          "ProcessID": 1000014146,
          "NAICSCode": "48821",
          "_desc": {
            "NAICS_CODE": "48821",
            "NAICS_DESCRIPTION": "Support Activities for Rail Transportation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000016271,
          "ProcessID": 1000014146,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000516271,
          "ProcessID": 1000014146,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011752,
      "SummaryText": "Executive Summary\n\nThe accidental release prevention and emergency response policies: \nThis facility will comply with Canadian Standards Association, American Association of Railways (AAR) and the Federal Railway Administration (FRA) standards regarding the design and maintenance of chlorine railway tank cars, and it is our policy to adhere to all applicable federal, state, and local laws.  We will maintain security staff on-site at all times to monitor and patrol the site, and control access by the train crews that are responsible for moving the tank cars. If an emergency were to occur, it is our policy to notify the Whitman County Sheriff's Dispatch to provide first response capability and site control.  Canexus U.S Inc. has a relationship with NRC Environmental Services (NRC), an emergency response contractor with offices in Spokane, Seattle and Pasco, WA who would respond initially to any incident on behalf of Canexus.  NRC advises it could have personnel on-site within 2 hours of call-out.  In addition, the Canadian affiliate of Canexus maintains a fully trained and equipped Emergency Response Team (CHLOREP) in North Vancouver which provides mutual aid response to any Chlorine Institute member in Washington State.  Members from our team could respond to any incident requiring detailed Technical Advice, rail car leak repair and/or product transfer capabilities.  \n\nA description of the facility and the regulated substances handled:\nThis facility is a railway siding providing bulk storage of liquid chlorine tank cars. The facility is owned by the Washington Idaho Railway and is located at the Belmont Railway Station in the Palouse River valley in a rural area approximately 5 miles southeast of Oakesdale, WA. All movements of rail cars will be handled by Washington Idaho Railway personnel. The facility will be fenced with a six-foot chain link fence topped with razor wire. There will be no flammable material stored at the site and vegetation will be controlled to m"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011752,
      "SummaryText": "inimize the chance of fire on the site. The facility will be designed to store up to 70 loaded and/or empty rail cars at any one time. Each chlorine rail car can hold up to 180,000 lbs of liquid chlorine. \n\nThe worst-case and alternative release scenarios:\nOur worst-case scenario is failure of one tank car resulting in a toxic gas release. The resulting distance to the endpoint extends offsite, and public receptors are within the distance to the endpoint. Our alternative release scenario is a release of chlorine gas from the relief valve due to high ambient temperatures or failure of the relief valve leading to a 60 minute release. The resulting distance to the endpoint extends offsite, and public receptors are within the distance to the endpoint. \nThe general accidental release prevention program and chemical-specific prevention steps:\nCanexus U.S. Inc. and its Canadian Affiliate, Canexus Chemicals Canada LP, are international suppliers of liquid chlorine to industry. As members of the Canadian Chemical ProducersA? Association, the American Chemistry Council and the Chlorine Institute, Canexus is required to meet the requirements of the Responsible CareA? program. This program requires all facilities to comply with or exceed all applicable state and local codes and regulations to ensure the risks to people, property and the environment are managed to an acceptable level. The prevention program that is in place at the North Vancouver facility will be similarly applied at this rail siding storage location. In addition, the facility will comply with the requirements developed by the Department of Homeland security as part of its Chemical Security Assessment Tool Top Screen.\n\nFive-year accident history:\nIn the past five years, Canexus has not had an accident in North America involving chlorine tank cars that caused death, injury, property or environmental damage, evacuation, or sheltering in place. \n\nThe emergency response program:\nIn the event of an emergency involvin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011752,
      "SummaryText": "g the tank cars stored at the Belmont, WA siding, it is our policy to notify the Whitman County Sheriff's Dispatch and request that they respond to the emergency as a first responder and to ensure site access control.  Canexus has a relationship with NRC, an emergency response contractor with offices in Spokane, Seattle and Pasco, WA who would respond initially to any incident on CanexusA? behalf.  NRC advises it could have personnel on-site within 2 hours of call-out.  In addition, Canexus Chemicals Canada LP maintains a fully trained and equipped Emergency Response Team (CHLOREP) in North Vancouver which provides mutual aid response to any Chlorine Institute member in Washington State.  Members from our team could respond to any incident requiring detailed Technical Advice, rail car leak repair and/or product transfer capabilities.\n\nPlanned changes to improve safety:\nThe complete storage siding will be fenced prior to shipping tank cars to the site. In addition, railway employees and security personnel will be trained in the hazards associated with shipping liquid chlorine by rail tank car.\n\n\n"
    }
  ]
}