{
  "FacilityID": 1000043135,
  "FacilityName": "Baker Petrlolite Corporation - Rayne Blend Plant",
  "FacilityStr1": "135 Industrial Drive",
  "FacilityStr2": null,
  "FacilityCity": "Rayne",
  "FacilityState": "LA",
  "FacilityZipCode": "70578",
  "Facility4DigitZipExt": "4020",
  "FacilityCountyFIPS": "22001",
  "LEPC": "Acadia Parish LEPC",
  "FacilityLatDecDegs": "30.230833",
  "FacilityLongDecDegs": "-092.306667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.bakerhughes.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 88918305,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 174987909,
  "Company2DUNS": 174987909,
  "OperatorName": "Baker Petrolite Corporation",
  "OperatorStr1": "135 Industrial Drive",
  "OperatorStr2": null,
  "OperatorCity": "Rayne",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70578",
  "OperatorZipCodeExt": "4020",
  "FTE": 28,
  "OtherEPAFacilityID": "70578BKRPT135in",
  "EPAFacilityID": "100000100446",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-02-14 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-28 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-05-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-03-11 00:00:00",
  "DeRegistrationEffectiveDate": "2019-02-07 00:00:00",
  "AnniversaryDate": "2019-05-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.230833,
  "FRS_Long": -92.306667,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053187,
      "AltID": "Acrolein Storage",
      "FacilityID": 1000043135,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064550,
          "ProcessID": 1000053187,
          "ChemicalID": 22,
          "Quantity": 50000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000053947,
          "ProcessID": 1000053187,
          "NAICSCode": "213112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000044706,
              "Process_NAICS_ID": 1000053947,
              "SafetyReviewDate": "2014-05-20 00:00:00",
              "PHA_Date": "2014-05-09 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-04-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Vapor suppression through the use of foam",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "SOP Update - Checklist Procedures Improved for loading/unloading, addition of manually operated sump",
              "OpProceduresReviewDate": "2014-05-20 00:00:00",
              "TrainingReviewDate": "2014-04-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-04-01 00:00:00",
              "EquipmentInspectionDate": "2014-05-28 00:00:00",
              "EquipmentTested": "Forklifts and Trucks are inspected daily, wire rope slings are inspected prior to use, general plant inspection performed daily, emergency response system (deluge) monthly, acrolein sensors quarterly",
              "ChangeMgmtDate": "2013-06-13 00:00:00",
              "ChangeMgmtReviewDate": "2013-12-23 00:00:00",
              "PreStartupReviewDate": "2014-04-01 00:00:00",
              "ComplianceAuditDate": "2012-07-19 00:00:00",
              "AuditCompletionDate": "2013-09-30 00:00:00",
              "IncidentInvestigationDate": "2005-12-09 00:00:00",
              "InvestigationChangeDate": "2006-01-10 00:00:00",
              "ParticipationPlansReviewDate": "2014-04-01 00:00:00",
              "HotWorkPermitReviewDate": "2014-04-01 00:00:00",
              "ContractorSafetyReviewDate": "2014-04-01 00:00:00",
              "ContractorSafetyEvalDate": "2014-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000053771,
                  "PreventionProgram3ID": 1000044706,
                  "ProcessChemicalID": 1000064550
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000053949,
          "ProcessID": 1000053187,
          "NAICSCode": "325998",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043135,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-01-13 00:00:00",
    "ERTrainingDate": "2014-04-07 00:00:00",
    "CoordinatingAgencyName": "Rayne Fire Department",
    "CoordinatingAgencyPhone": "3373342345",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043135,
      "SummaryText": "ch as Environmental Awareness. Plant assigned drivers also attend defensive driving classes taught by a certified instructor through Smith Driving Systems, plus small vehicle Driving Safety. First Aid/CPR training is provided bi-annually by qualified First Aid Instructors.  \r\n\r\nMechanical Integrity\r\nBaker Petrolite's employees perform documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; pressure vessels, piping systems, relief and vent systems, excess flow valves and lifting devices. Maintenance operations are conducted by qualified personnel who have received previous training in safe and effective maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner\r\n\r\n\r\nManagement of Change\r\nWritten procedures are in place at our facility to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\nPre-startup Reviews\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at all Baker Petrolite locations. These reviews are conducted at each site to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\nBaker Petrolite's corporate EHS/Q&RA Department conducts audits on a regular basis to determine whether the provisions set out under the PSM and RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are addressed in a safe and prompt m"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043135,
      "SummaryText": "General Executive Summary for Baker Petrolite Corporation Rayne, Louisiana\r\n27833 LAOEQ Facility ID Number\r\n\r\n1. Accidental Release Prevention and Emergency Response Policies\r\nAs employees of Baker Petrolite Corporation, we are strongly committed to safety, for ourselves, our neighbors, and the environment. We strive daily to operate our facility and handle our products in the safest manner possible, consistent with prudent environmental, health, and safety practices. It is our policy to implement appropriate controls wherever possible in order to prevent the unwanted release of any regulated substance. We have a comprehensive accidental release prevention program in place that covers the key elements of design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. In the unlikely event that a release ever does occur our trained employees shall work under the Incident Command System structure with the Rayne fire department and other emergency response personnel to control and minimize the effects of any release. As members of CMA and SOCMA, we believe in Responsible Care, which includes the CAER code, Community Awareness and Emergency Response. So, even though not required by any regulation, we installed a state of the art emergency response system (monitoring & mitigation)to protect our community in the event of a release. This emergency response system safeguards the acrolein storage area, and includes a containment wall, chemical detectors, a deluge system, plus foam and neutralizer which would deactivate or minimize any release.\r\n\r\n2. The Stationary Source and the Regulated Substances Handled \r\nOur facility is a small blend plant, which produces and distributes oilfield production chemicals. We store one (1) regulated substance at our facility. This substance is Acrolein [2-Propenal], which is used as a biocide, or as a hydrogen sulfide scavenger/antifoulant in the treatment of produced oil field wa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043135,
      "SummaryText": "ter.\r\n\r\n\r\n3. General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. Our facility is subject to the OSHA PSM standard under 29 CFR 1910.119. Our facility is also subject to EPCRA Section 302 notification requirements. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\r\n\r\nProcess Safety Information\r\nThe safety coordinator at the plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\r\n\r\nProcess Hazard Analysis\r\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The primary methodology used to carry out these analyses is HAZOP. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at least every five years. Any findings related to the hazard analysis are addressed in a timely manner.\r\n\r\nOperating Procedures\r\nFor the purposes of safely conducting activities within our covered processes, we maintain written operating procedures. These procedures address unloading, transport, storage, and loading of acrolein cylinders and skids. The information is reviewed regularly and is readily accessible to operators involved in the processes.\r\n\r\nTraining\r\nBaker Petrolite Corporation has a comprehensive training program in place to ensure that employees are competent in the operating procedures associated with various plant processes. Refresher training is provided at least every year and more frequently as needed. Training provided to employees at the Rayne facility includes required core safety training as defined by OSHA, plus additional training su"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043135,
      "SummaryText": "anner.\r\n\r\nIncident Investigation\r\nQualified Baker Petrolite employees promptly investigate any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are conducted by teams at several levels of the organization as directed by the Vice President of Oilfield operations. The investigations are designed to identify the root causes of incidents, and identify corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\r\n\r\nEmployee Participation\r\nBaker Petrolite Corporation truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\r\n\r\nContractors\r\nIf necessary, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, we conduct a thorough evaluation of their safety performance. Only those who meet strict acceptance criteria are authorized to enter the facility. The Rayne facility routinely informs the contractors of known potential hazards related the contractor's work and plant processes. Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\n4. Five-year Accident History\r\nThe Rayne blending facility has an excellent safety record over the last 5 years, with no reportable quantity accidental releases occurring during this period. It is our policy to strive for continuous improvement in our operations, and this has led to more stringent release prevention policies, and more elaborate emergency response plans. Because of this, we strive to prevent"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043135,
      "SummaryText": "a releases from ever occurring. However, we are realistic enough to plan our emergency response for even the most unexpected release scenario. Therefore, we expect to be able to control and minimize a release, should one ever occur.\r\n\r\n5. Emergency Response Plan\r\nBaker Petrolite's Rayne facility has a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\r\n\r\n6. Planned Changes to Improve Safety\r\nOur systems are focused on continual improvement in the prevention of accidents and pollution, effective communications and training, and accountability throughout the organization. In line with our goal of continuous improvement, we plan to build on our existing good relationships with our close industrial neighbors, and the community."
    }
  ]
}