{
  "FacilityID": 1000055638,
  "FacilityName": "Sunoco Logistics Baltimore MD Terminal",
  "FacilityStr1": "2155 Northbridge Ave",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21226",
  "Facility4DigitZipExt": "1522",
  "FacilityCountyFIPS": "24005",
  "LEPC": "Baltimore City",
  "FacilityLatDecDegs": "39.229467",
  "FacilityLongDecDegs": "-076.570038",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sunocologistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sunoco Partners Marketing and Terminals, LP",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "La Grange Acquisitions, LLC",
  "OperatorStr1": "800 E. Sonterra Boulevard",
  "OperatorStr2": "Suite 400",
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78258",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Frost",
  "RMPTitle": "Manager, Northeast Terminals",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000209605",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "24-510-00703",
  "SafetyInspectionDate": "2014-01-24 00:00:00",
  "SafetyInspectionBy": "US Coast Guard",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-06-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-02-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-02-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-02-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000069546,
      "AltID": "Pentane Blending System",
      "FacilityID": 1000055638,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000070728,
          "ProcessID": 1000069546,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000085815,
          "ProcessID": 1000069546,
          "ChemicalID": 125,
          "Quantity": 380000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000585815,
          "ProcessID": 1000069546,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000055638,
      "SummaryText": "The previously operated Butane Blending System (originally operated as butane) is being modified and updated to a Pentane Blending system the resubmission is to capture changes from that transition.  The Sunoco Logistics Baltimore MD Terminal complies with the National Fire Protection Association #30 (2012 edition) for Flammable Liquid Storage, and it is this Facility's policy to notify the Baltimore City Fire Department and Baltimore City LEPC via the \"911\" service in the event of an emergency, and follow all additional response procedures set forth in the Facility's Integrated Contingency Plan, as appropriate.  Medical emergencies will require notification of the the local Emergency Management Services (Medic-5 and Medic-9) and Harbor Hospital via 911.  The Facility currently maintains a trained incipient stage fire and emergency response team to respond to small or initial stages of an emergency.  Sunoco Logistics Baltimore MD Terminal transfers/stores refined product (regular/premium gasoline) and handles product additives, including the pentane blending system (direct injection into refined product pipelines to the truck loading rack).  The Risk Management Program covers the pentane blending system including the associated piping, 1 x 84,000 gallon vessel, the blending skid, and the truck off-loading station product connection point.  The Facility's worst case scenario is the catastrophic failure of the blending system's 84,000 gallon pentane vessel when filled to the greatest amount allowed (fill shut-off device at 85% with an alarm at 80%) resulting in a vapor cloud explosion.  This is the recommended scenario based on the EPA Guidance Document.  The Facility's alternate scenario (unlikely) resulting in a substantive release based on discussion with Sunoco and terminal personnel capable of off-site effects is a Vapor Cloud Explosion (VCE) of a 10 minute release resulting in an explosion.  Other alternatives considered included pump failure, liquid pentane pip"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000055638,
      "SummaryText": "e failure, and a truck pull-away incident.  These scenarios were considered highly unlikely and did not result in off-site impacts.\n\n\n\nThe Sunoco Logistics Baltimore MD Terminal complies with the U.S. Environmental Protection Agency's Accident Prevention Rules (40 CFR Part 68) and the U.S. Department of Labor - Occupational Safety and Health Administration (OSHA) Process Safety Regulations (29 CFR Part 1910 .119).  The pentane blending system is designed, constructed, and maintained to meet or exceed the NFPA #30 requirements for Flammable Liquid Storage.  To this date, this Facility has never had an accident involving the pentane blending system (existing process) or previous butane process (originally installed as butane in 2009) resulting in deaths, injuries, property/environmental damage, evacuations or sheltering-in-place.  In the event of an emergency involving the Baltimore Terminal pentane blending system, it is the policy of the Facility to initially contact the Baltimore City Fire Department and HazMat-1 and request their assistance.  The Facility maintains a trained (annually) incipient fire and emergency response team, as referenced above.  The Facility's emergency response plans are coordinated with the Baltimore City Fire Department and the Baltimore City LEPC.  The Baltimore City Fire Department also maintains a full hazardous material response team, is aware of the Facility's pentane blending system access via Northbridge Avenue, and sources (hydrants available adjacent to and within the Terminal).  Sunoco Logistics Baltimore MD Terminal maintains a vegetation control program to minimize plant growth within 10 feet of the system.\n\n"
    }
  ]
}