{
  "FacilityID": 1000077757,
  "FacilityName": "Winchester Power Park",
  "FacilityStr1": "1260 Farm to Market Road 448",
  "FacilityStr2": null,
  "FacilityCity": "Winchester",
  "FacilityState": "TX",
  "FacilityZipCode": "78945",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48149",
  "LEPC": "Fayette County LEPC",
  "FacilityLatDecDegs": "30.024550",
  "FacilityLongDecDegs": "-096.993260",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lcra.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Lower Colorado River Authority",
  "Company2Name": null,
  "CompanyDUNS": 43226885,
  "Company2DUNS": 0,
  "OperatorName": "Lower Colorado River Authority",
  "OperatorStr1": "PO Box E",
  "OperatorStr2": null,
  "OperatorCity": "Bastrop",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78602",
  "OperatorZipCodeExt": null,
  "RMPContact": "JIm Willey",
  "RMPTitle": "Plant Director, Power Plant Gas",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000207251",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-3026",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-11-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000096867,
      "AltID": "Ammonia storage tank",
      "FacilityID": 1000077757,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000098086,
          "ProcessID": 1000096867,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000121239,
          "ProcessID": 1000096867,
          "ChemicalID": 56,
          "Quantity": 35200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000621239,
          "ProcessID": 1000096867,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077757,
      "SummaryText": "The Lower Colorado River Authority (LCRA) has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as mandatory technical and safety training for all facility personnel and considering safety in the design, installation, operation, and maintenance of our processes. It is the policy of LCRA to implement reasonable controls to prevent releases of regulated substances.\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\nThe Winchester Power Park (WPP), located in Fayette County, Texas, consists of four simple cycle natural gas-fired combustion turbines. These turbines are used primarily during peak electricity demand. This remote peaking facility is normally unoccupied and is operated by employees located\n\n at LCRA's Lost Pines Power Park (LPPP). As a means of reducing nitrogen oxide emissions from \n\nthe four gas-fired combustion turbines, aqueous ammonia is injected into the turbine exhaust streams. The ammonia concentration used in this process is less than 20 percent, which is below the threshold concentration in ? 68.130.  \n\n\n\nThe site also includes an anhydrous ammonia based inlet air chilling system to improve turbine efficiency. The chiller has a potential storage capacity above the threshold quantity of substances in \n\n? 68.130.  Equipment configuration and Administrative controls limit the quantity of anhydrous ammonia contained within the chiller. Real time monitoring of plant processes provide indication of chiller status.  A summary of the Program 2 Prevention Program is provided below.\n\n\n\nAccidental Release Prevention Program\n\nThe Winchester Power Park is subject to EPA's RMP rule codified at 40 CFR Part 68, Subpart C\n\nProgram 2 Prevention Program. The accidental release prevention program at Winchester includes:\n\n\n\nSafety Information\n\nWPP has compiled and maintains safety information related to anhydrous ammonia. These technical documents ensure that th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077757,
      "SummaryText": "e process hazards are understood and that the chiller is operated and maintained in a safe manner. These documents include Safety Data Sheets (SDS), maximum storage capacity in individual vessels, safe upper and lower operating limits, codes and standards used to design, build, and maintain the chiller, and process equipment knowledge. This information is updated when changes are made to processes.\n\n\n\nHazard Review\n\nWPP has a comprehensive program to ensure that the hazards associated with the regulated process are systematically identified and controlled. This review includes operational processes and opportunities for equipment malfunction or human error that could cause an anhydrous ammonia release and safeguards that will control the hazards or prevent the malfunction or error. In addition, ammonia sensors, alarms, and strobe lights are installed at key locations on the chiller to detect and report leaks.\n\n\n\nOperating Procedures\n\nWPP maintains operating procedures that address the various modes of process operations, including; initial startup, routine startup and shutdown, emergency shutdown, emergency operation, routine operation, and temporary operation. The procedures also detail safe upper and lower process limits, consequences of deviation from safe limits, and how to return the process to safe operation. The procedures are readily available to all LPPP personnel, and are reviewed on a recurring basis.\n\n\n\nTraining\n\nOperations and maintenance personnel assigned to work at WPP are located at the Lost Pines Power Park (LPPP) and visit WPP periodically to check its operation and to assist with maintenance. These personnel are trained in an overview of the anhydrous ammonia delivery/evacuation process, anhydrous ammonia houses within the chiller, operation of the chiller, and the procedures to safely operate the chiller. \n\n\n\nWholesale Power Services utilizes LCRA's Public Safety Department and LCRA Safety Program to identify employee training requirements and d"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077757,
      "SummaryText": "evelop training program objectives.  Plant Environmental Support maintains training documentation and schedules training via the LCRA Learning Management System (LMS)  \n\n\n\nEmergency Response exercises are conducted by LCRA Public Safety personnel and involve LCRA's contracted Emergency Response vendor, LPPP employees, local emergency response personnel from the Winchester volunteer fire department and appropriate mutual aid entities.\n\n\n\nMaintenance\n\nProcedures for maintaining the mechanical integrity of the chiller process equipment, including ammonia tanks, compressors, motors, lube oil systems, and isolation valves are available. Maintenance procedures follow a schedule that matches the manufacturer's recommendation or as operating experience indicates is necessary.  Chiller maintenance is completed in conjunction with an outside contracted vendor with specific anhydrous ammonia experience.  LPPP Maintenance personnel participate in the chiller maintenance activities and have received training in the process hazards and how to correct unsafe conditions if possible.\n\n\n\nCompliance Audits\n\nThe risk management plan is reviewed and certified by the Plant Director to ensure that employees are implementing it properly. \n\nA compliance audit checklist has been prepared listing elements of the chiller system and appropriate documentation to be audited, the action taken, and the date each audit finding was resolved. The audit team includes representatives from Plant Operations, Plant Maintenance, Plant Environmental Support, Plant Engineering, and Safety that are knowledgeable in the chiller system and process.  The audit team shall walk through the facility and check relevant items. The checklist will include the following as a minimum:\n\n\n\n?    Confirmation with LCRA Safety that a current SDS is available to employees \n\n?    Visual verification of the condition of tanks, piping, pressure relief valves, compressors, emergency shut-off valves, gauges, pumps, and hoses \n\n?    Verificat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000077757,
      "SummaryText": "ion of employee training records\n\n?    Review of appropriate Safety and maintenance procedures\n\n?    Inspection of Safety equipment required\n\n\n\n       Written records of compliance audit findings are kept on file for at least five years.\n\n\n\nIncident Investigation\n\nEmployees will promptly report all incidents including but not limited to those that have resulted in, or could reasonably be expected to result in, the catastrophic release of anhydrous ammonia. Based upon the severity of the incident, an investigation will be conducted.  The investigative team will include a representative from Plant Operations, Plant Maintenance, Plant Environmental Support, Plant Engineering, and Safety as a minimum.  The findings of the investigation, along with any corrective actions taken to prevent recurrence of the incident, will be documented by Plant Environmental Support and reviewed with the Plant Director.  Plant Environmental Support and or Plant Safety shall also review the findings and any corrective actions with all plant personnel, including contractors as appropriate. Investigation documentation shall be retained by Plant Environmental Support as part of the facility RMP for at least five years.  The investigation will be also be summarized in the Enviance Environmental Management system for review by Environmental Affairs and Legal Services.\n\n\n\nFor any accidental release meeting the five-year accident history reporting criteria of ?68.42,\n\nPlant Environmental Support in conjunction with Environmental Affairs and Legal Services shall \n\nsubmit the data required under ??68.168, 68.170(j), and 68.175(l) with respect to that accident within \n\nsix months of the release or by the time the RMP is updated under ?68.190, whichever is earlier.\n\n\n\n"
    }
  ]
}