{
  "FacilityID": 1000011452,
  "FacilityName": "Naval Activity Puerto Rico",
  "FacilityStr1": "NAPR Officer in Charge",
  "FacilityStr2": "Building 31 Forrestal Drive",
  "FacilityCity": "Ceiba",
  "FacilityState": "PR",
  "FacilityZipCode": "00735",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72037",
  "LEPC": "Humacao LEPC, PR",
  "FacilityLatDecDegs": "18.224889",
  "FacilityLongDecDegs": "-065.650194",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "U. S. Navy",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mr. James E. Anderson, Director",
  "OperatorStr1": "BRAC Program Management Office SE",
  "OperatorStr2": "4130 Faber Place Drive, Suite 202",
  "OperatorCity": "North Charleston",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29405",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark E. Davidson",
  "RMPTitle": "BRAC Environmental Coordinator",
  "FTE": 259,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127463",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "19-0397-0012-0",
  "SafetyInspectionDate": "2003-10-03 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-11-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-11-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-11-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-04-25 00:00:00",
  "DeRegistrationEffectiveDate": "2012-01-25 00:00:00",
  "AnniversaryDate": "2014-11-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 18.22333,
  "FRS_Long": -65.60944,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Transferred ownership & operation to the local redevelopment authority",
  "_processes": [
    {
      "ProcessID": 1000013671,
      "AltID": "Potable Water Treatment",
      "FacilityID": 1000011452,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000014031,
          "ProcessID": 1000013671,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015694,
          "ProcessID": 1000013671,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515694,
          "ProcessID": 1000013671,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011452,
      "SummaryText": "Facility Overview\n\nFormer Naval Station Roosevelt Roads (NAVSTA RR) ceased operation on March 31, 2004.  Naval Activity Puerto Rico (NAPR) was created to provide oversight during the final disposal of the property and ensure compliance with applicable regulations.  Operations still being carried out are those necessary to maintain the property and provide utilities to personnel and agencies still on board NAPR.\n\nRMP Program Applicability\n\nAn evaluation of facility chemical use and inventory indicated RMProgram applicability was limited to the Potable Water Treatment plant (Building 88) located along Langley Road near the water storage reservoir in the geographic center of NAPR.  The Potable Water Treatment Plant receives raw water from Rio Blanco River in Naguabo via a 27 -inch pipe.  The Potable Water Treatment Plant treats the raw water for use at NAPR in accordance with current drinking water standards.  The Potable Water Treatment Plant still maintains inventory in excess of the 112r threshold quantity for the listed chemicals, and thus is subject to the RMP regulations.\n\nRMP Program Eligibility\n\nAn eligibility analysis for the Potable Water Treatment Plant indicated the Potable Water Treatment Plant has not had an accidental release in the past five years and the worst-case release scenario (WRS) from the off-site consequence analysis (OCA) includes public receptors within the distance to toxic endpoint.  Based on this information the Potable Water Treatment Plant is a Program 3 facility. A Program 3 RMP Program includes the following elements:\n\nRisk Management Plan\nHazard Assessment (Off-Site Consequence Analysis),\nAccident Prevention Program (including Process Hazard Analysis), and\nEmergency Response Program\n\nHazard Assessment\n\nAs part of the RMP Program, a Hazard Assessment of potential accidental release scenarios for the Potable Water Treatment Plant must be conducted.  The goal of the Hazard Assessment is to complete an OCA, which includes assessment of t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011452,
      "SummaryText": "he WRS as defined by the established parameters in the RMP Program regulation followed by the consideration of a more likely alternative release scenario (ARS).  The Hazard Assessment requires that the WRS and ARS consider the effects of a release down to a toxic endpoint.  Toxic endpoints have been established in the RMProgram regulation for each listed substance. The RMP* Comp tables, developed by the EPA were used for modeling the WCS and the ARS.  Specific information pertaining to the OCA are not included per EPA guidance.\n\nAccidental Release History\n\nThere have been no known 112r-regulated chemical releases in the past five years from the Potable Water Treatment Plant. \n\nPrevention Program\n\nThe Prevention component of the RMP Program requires the facility to compile and maintain process safety information (PSI) for regulated substances and processes, complete a process hazard analysis (PHA) for the applicable substances and processes, develop operating procedures, provide employee training on the operating procedures, develop maintenance procedures for the process equipment, establish routine compliance audits for the facility, and incorporate an incident investigation protocol. All information required by the Prevention Program must be maintained continuously and requires immediate updates if a major change occurs.\n\nPSI\n\nThe required PSI for the Potable Water Treatment Plant was compiled including a material safety data sheet (MSDS) for the regulated chemicals, maximum inventory at the Potable Water Treatment Plant, safe temperatures and pressures, process equipment specifications, and process design codes.  Information was obtained from facility interviews and applicable chemical manufacturers.  This safety information is in a format which can be readily updated when necessary.\n\nPHA\n\nThe PHA for the disinfection system was completed to determine possible hazards or upset conditions which could result in a release. The review identified hazards associated wit"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011452,
      "SummaryText": "h the process, possible equipment malfunctions, human errors, and safeguards/monitoring. Equipment information (specifications, manuals, etc.), operating procedures, and service information were thoroughly evaluated during the PHA.\n\nSeveral system safeguards have been implemented with the design of the system, which would prevent a release.  If vacuum is lost in the system, chemical flow is shut off.  A mesh filter prevents foreign particles from entering the regulator and causing it to stick open. Alarms have been installed to warn if inadequate or excessive vacuum conditions exist in the regulator. Also, there are two gas detection and alarm systems. One monitors the feed room, and the other monitors the storage area.\n\nAccident Prevention Procedures\n\nAs required by the RMP Program regulation, the facility developed and implemented an accident prevention program.  This program included operating and maintenance procedures, operator training, compliance audits, and incident investigation.  Standard operating and maintenance procedures for the Potable Water Treatment Plant have been implemented for handling, monitoring, and controlling the disinfection system by the operator for the plant.  The operating procedures include procedures for initial start-up, normal operations, temporary operations, emergency shutdown and emergency operations, and equipment Inspections.\n\nEmergency Response\n\nNAPR currently has an Integrated Contingency Plan (ICP) that addresses the area contained within the property limits of the government-owned and leased lands (Including the Potable Water Treatment Plant) within its boundaries and any waters flowing through, past, or from those lands.  The ICP includes the procedures for informing the public and emergency response agencies about accidental releases, documentation or proper first-aid and emergency medical treatment necessary to treat accidental human exposure, and procedures and measures for emergency response for both oil and hazardous"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011452,
      "SummaryText": " substance spills.\n\nRMP Program Management\n\nNAPR has developed a management structure to oversee the continuous implementation of the RMP Program elements. The system designates a qualified individual with the overall responsibility for the development, implementation, and integration of the RMP elements.  The RMP management structure continues to monitor RMP compliance during the decommissioning of the base until final disposition.\n"
    }
  ]
}