{
  "FacilityID": 1000029558,
  "FacilityName": "Waldron, Arkansas Water Treatment Plant",
  "FacilityStr1": "P.O. Box 1678",
  "FacilityStr2": "106 East Water Street",
  "FacilityCity": "Waldron",
  "FacilityState": "AR",
  "FacilityZipCode": "72958",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05127",
  "LEPC": "Scott County LEPC",
  "FacilityLatDecDegs": "34.922500",
  "FacilityLongDecDegs": "-094.194167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Waldron, Arkansas",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Waldron, Arkansas",
  "OperatorStr1": "P.O. Box 310",
  "OperatorStr2": "370 Featherston Street",
  "OperatorCity": "Waldron",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72958",
  "OperatorZipCodeExt": null,
  "RMPContact": "Don Owens",
  "RMPTitle": "Mayor",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000113888",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-03-22 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.9225,
  "FRS_Long": -94.09417,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036068,
      "AltID": "Chlorine",
      "FacilityID": 1000029558,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000036450,
          "ProcessID": 1000036068,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043653,
          "ProcessID": 1000036068,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000543653,
          "ProcessID": 1000036068,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029558,
      "SummaryText": "The City of Waldron, Arkansas, owns and operates a potable water treatment plant that uses chlorine gas as a disinfectant. Chlorine is one of the regulated substances listed in the federal regulations (40 CFR Part 68) and is the reason this Risk Management Plan has been developed. The City of Waldron is committed to operating a safe facility both for its employees and the public at large.\n\n\n\nThe cylinders containing the liquid chlorine are stored in a small metal-framed building located separately but nearby the main operations building. There is space for as many as six one-ton containers in and outside of the building. There are usually only two full containers in the building and connected to the system at any one time. It is common to have one reserve container for each container in service. It is common for the Waldron Water Department to have four full or at least partially full one-ton containers on site. This represents as much as 8,000 pounds of chlorine.\n\n\n\nThe chlorine building is located near the entrance of the plant site but is separated from public roads by a lockable chain link fence with barbed wire at the top. When the chlorine containers arrive by truck at the site, they are removed and placed inside the building. Empty containers are removed from the building and placed on the truck.\n\n\n\nThe worst-case release scenario envisions the accidental release of the entire 2,000-pound contents of one of the containers within a 10 minute period. This could occur as a catastrophic failure of the container due to corrosion, impact or construction defects. The container could be dropped while being lifted and transported into the building. If that occurred while it was located outdoors, there would be no passive mitigation measures (such as dikes, berms or other enclosures) available to contain the spilled liquid chlorine. The worst-case scenario does have an off site impact. It is estimated that the distance to the toxic endpoint of the gas cloud emanating f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029558,
      "SummaryText": "rom this accidental liquid release could be a 1.3-mile radius from the plant site. Portions of the City of Waldron are within this radius.\n\n\n\nAlternative release scenario #1 is deemed to be more probable than the worst-case scenario but less onerous. This scenario envisions the release of approximately 1,735 pounds of chlorine as a gas. This could occur when the ton container is in active use. At this time it is operating in the gas feed mode which is the typical way that the system operates at Waldron. In this scenario the maximum average sustained release rate is 347 pounds per minute for 5 minutes. This could occur due to a bad connection or a valve failure. Gas could be released through the 3/4-inch diameter valve body opening. If this occurred the only passive mitigation measure currently available to contain the gas release would be the building itself and that presumes the doors to the building are closed. The only active mitigation measure that is in place is the gas pressure-reducing valve with automatic switchover vacuum regulator. This valve functions to reduce the pressure of the gas flowing out of the container. The vacuum regulator serves to further reduce the gas pressure to a vacuum. Loss of vacuum for any reason such as a break in the downstream gas tubing causes the regulator to shut off the gas supply. It requires mechanical input (springs) in order to function. This alternative release scenario likewise has an off site impact. In this case, the distance to the toxic endpoint of the gas cloud is estimated at 0.30-mile radius from the plant site. The City of Waldron does not fall into this circle; however, there are inhabited residential and commercial buildings within it.\n\n\n\nAlternative release scenario #2 envisions the accidental release of the entire 2,000-pound contents of one of the containers within a 10 minute period while located inside the container building. This could occur as a catastrophic failure of the container due to corrosion, imp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029558,
      "SummaryText": "act or construction defects. The container could be dropped while being lifted inside the building. If that occurred while it was located indoors, there would be passive mitigation measures (enclosures) available to contain the spilled chlorine. This alternative release scenario has an off site impact. It is estimated that the distance to the toxic endpoint of the gas cloud emanating from this accidental liquid release could be a 0.20-mile radius from the plant site. The City of Waldron does not fall into this circle; however, there are inhabited residential within it.\n\n\n\nAlternative release scenario #3 envisions the release of the entire 2,000-pound contents of one of the containers. This could occur when the ton container is in active use. At this time it is operating in the gas feed mode which is the typical way that the system operates at Waldron. In this scenario the maximum average sustained release rate is 185 pounds per minute for 60 minutes. This could occur if the transfer hose (tubing) came completely off the cylinder. Gas could be released through the 3/8-inch diameter opening. If this occurred the only passive mitigation measure currently available to contain the gas release would be the building itself and that presumes the doors to the building are closed. This alternative release scenario likewise has an off site impact. In this case, the distance to the toxic endpoint of the gas cloud is estimated at 0.20-mile radius from the plant site. The City of Waldron does not fall into this circle; however, there are inhabited residential within it.\n\n\n\nAlternative release scenario #4 envisions the release of the entire 2,000-pound contents of one of the containers. This could occur when the ton container is in active use. At this time it is operating in the gas feed mode which is the typical way that the system operates at Waldron. In this scenario the maximum average sustained release rate is 50 pounds per minute for 60 minutes. This could occur due to a bad"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029558,
      "SummaryText": " connection or transfer hose (tubing) failure. Gas could be released through the 3/8-inch diameter tubing. If this occurred the only passive mitigation measure currently available to contain the gas release would be the building itself and that presumes the doors to the building are closed. This alternative release scenario likewise has an off site impact. In this case, the distance to the toxic endpoint of the gas cloud is estimated at 0.10-mile radius from the plant site. The City of Waldron does not fall into this circle; however, there are inhabited residential within it.\n\n\n\nAs a first step in the general accident release prevention program, the Waldron Water Department?s policy is to inventory no more chlorine at the plant than is absolutely necessary to meet the goal of producing a potable and bacteriologically safe drinking water for its customers. The Water Department recognizes the need to strike a balance between this goal and the goal of minimizing risk to the public due to accidental chlorine gas release. However, the inventory must not be so reduced as to run out of the key component necessary to properly disinfect drinking water.\n\n\n\nThe next step is to reinforce and strengthen existing Water Department policy to safely handle chlorine containers and all the system components necessary to transmit to its application points within the treatment plant. The prevention program is reviewed and edited to incorporate hazard analysis techniques. These shall be based upon the recognized industry standards and state and federal rules and regulations that apply to the use of chlorine in water treatment plant applications. These include but are not limited to the Chlorine Institute pamphlets, American Water Works Association publications, equipment manufacturer?s printed instructions, and the Arkansas Department of Health and Human Services? Rules and Regulations Pertaining to Public Work Supply.\n\n\n\nOperating procedures are continually reviewed to assure that adequ"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000029558,
      "SummaryText": "ate supplies of replacement parts and tools are available, that personal protection equipment is on hand and in a ready for use condition, and that gas detection, alarm, ventilation and container handling equipment are functioning properly.\n\n\n\nPersonnel training is an ongoing program at the Waldron Water Department. Several of the operators have already obtained their completed licenses and others are working towards that goal. The training program includes certification in the use of self-contained breathing apparatus, confined space entry, and other safety measures.\n\n\n\nThere has been no accidental release incidents in the past five years.\n\n\n\nThe emergency response program at Waldron consists of coordination of plant operators with the city fire department and county sheriff personnel by telephone and radio. Evacuation of the plant site and nearby public can be achieved through these coordination efforts. A public notification system does not currently exist. However, city officials are discussing the implementation a electronic warning system with pole mounted horn enunciators located at various points throughout the affected area or perhaps the use of a warning message interrupt system on the local cable TV provider. Such systems are and can be used for tornado alerts as well.\n\n\n\nCertification programs in the proper methods of container change out, use of self-contained breathing apparatus and general waterworks operation have been in place and will continue to be updated and revised. First Aid and C.P.R. training are included. A program to include safety and emergency response drills has been instituted. An organization chart depicting who does what, when, and how has been developed. People are assigned to a position in this organized chart so they know their role."
    }
  ]
}