{
  "FacilityID": 1000099222,
  "FacilityName": "NE Nitro Geneva LLC",
  "FacilityStr1": "2240 R Street",
  "FacilityStr2": null,
  "FacilityCity": "Geneva",
  "FacilityState": "NE",
  "FacilityZipCode": "68361",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31059",
  "LEPC": "Homestead LEPC",
  "FacilityLatDecDegs": "40.53892",
  "FacilityLongDecDegs": "-97.58003",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "https://rmrholdings.com/nebraska-nitrogen/",
  "FacilityEmailAddress": "info@geneva.nenitro.com",
  "FacilityDUNS": 118063658,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Heidi Kelly",
  "OperatorStr1": "2240 R Street",
  "OperatorStr2": null,
  "OperatorCity": "Geneva",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68361",
  "OperatorZipCodeExt": null,
  "RMPContact": "Amber Hoban",
  "RMPTitle": "Plant Manager",
  "FTE": 34,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000234043",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-12-09 00:00:00",
  "SafetyInspectionBy": "Insurance Risk Audit - Liberty Special Market",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-02-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2022-02-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-02-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000122774,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000099222,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000124182,
          "ProcessID": 1000122774,
          "NAICSCode": "325311",
          "_desc": {
            "NAICS_CODE": "325311",
            "NAICS_DESCRIPTION": "Nitrogenous Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000153531,
          "ProcessID": 1000122774,
          "ChemicalID": 56,
          "Quantity": 40000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000653531,
          "ProcessID": 1000122774,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000099222,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n1. Facility Policy.\n\n\n\nIf an accidental release should occur, the facility is prepared to work with the local fire department, Fillmore County Emergency Management, and/or other authorities, to mitigate and minimize the impacts of the release to the public and the environment.\n\n\n\n2. Facility Information.\n\n\n\nThe primary activity at the facility is the production of anhydrous ammonia as an agricultural product. The ammonia production process uses natural gas and ambient air as production inputs. The natural gas and ambient air react to produce anhydrous ammonia.\n\n\n\n3. Five-Year Accident History.\n\n\n\nThe facility had four accidental releases of ammonia.  The releases took place on March 14, 2018, August 30, 2018, December 1, 2018, and February 9, 2020.  With all of the releases the proper agencies were notified as soon as possible.\n\n\n\n4. Emergency Response.\n\n\n\nThe emergency response program established by NE Nitro Geneva does allow for personnel to respond to accidental releases of regulated substance, unless the release is too large and beyond the site's response team's capability.  If NE Nitro Geneva is unable to respond to an emergency, they have identified resources to mitigate, control, and dispose of a release.  The local emergency response agency (Fillmore County Emergency Management) will be relied upon to inform the public about the release. NE Nitro Geneva has developed an Emergency Action Plan outlining actions taken in the event of an accidental release of regulated substances as well as in the event of natural disasters. The Emergency Action Plan is provided below for reference.\n\n\n\n5. Accidental Release Prevention Program.\n\n\n\nNE Nitro Geneva has implemented environmental, emergency, and safety programs. Equipment maintenance checks are completed that assist in the ability for NE Nitro Geneva staff to respond to emergencies. Spill Prevention, Control, and Countermeasure (SPCC) and Storm Water Pollution Prevention (SWPPP) plans have been "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000099222,
      "SummaryText": "prepared and implemented. Updates will be completed as needed to ensure compliance and effectiveness. NE Nitro Geneva has developed a Prevention Program in accordance with the requirements of 40 CFR Part 68 for a Program Level 3 facility. \n\n\n\nThe facility conducts monthly, quarterly, semi-annual, and annual training as part of normal activities. Training consists of regulated safety requirements. A Process Safety Management (PSM) program has been implemented. Anhydrous ammonia is a PSD-applicable chemical on site. Safety inspections are completed regularly with in-house and outside expertise as necessary. Periodic reviews are completed on plans and procedures, with scheduling for additional training as part of the review process. \n\n\n\n6. Planned Changes to Improve Safety.\n\n\n\nRoutine evaluations are completed to assess equipment conditions at the facility. NE Nitro Geneva has a Mechanical integrity written plan to confirm chemical storage tanks are in proper working condition. \n\n\n\n\n\nEMERGENCY ACTION PLAN\n\n\n\n1. Policy Statement. \n\n\n\nNE Nitro Geneva believes that employees are its most important asset, and that their safety and health are among its greatest responsibilities. This Emergency Action Plan was created in compliance with OSHA standard, Title 29 CFR 1910.38 (a) and posted for all NE Nitro Geneva employees.\n\n\n\n2. Purpose.\n\n\n\nThis Emergency Action Plan is intended to ensure the proper response to foreseeable emergencies and where necessary, ensure the orderly evacuation of employees from work locations to a safe area away from conditions that could be immediately dangerous to life and health.\n\n\n\n3. Responsibility and Authority.\n\n\n\nA Program Coordinator is assigned by the Chief Executive Officer to oversee:\n\n(a) The development, implementation, and ongoing improvement of the Emergency Action Plan,\n\n(b) Development and posting of the Emergency Action Plan posters and site exit diagram,\n\n(c) All emergency equipment is inspected at various intervals to ensure proper"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000099222,
      "SummaryText": " operation of all emergency equipment, and\n\n(d) Quarterly drills of the emergency action plan.\n\n\n\nThe following procedures will be followed by all visitors/contractors entering the facility:\n\n\n\n(a) Monday through Friday between 7 a.m. and 5 p.m. (Normal office hours) - all visitors and contractors will sign-in and out at the administrative office. In the event work schedule starts or continues past normal offices hours, sign-in and out will be completed at the control room.\n\n(b) Monday through Friday between 5 p.m. and 7 a.m. - all visitors and contractors will sign-in and out at the control room.\n\n(c) Saturday and Sunday - all visitors and contractors will sign-in and out at the control room.\n\n(d) Contractors on site are required to supply company name and total contractor personnel on site.\n\n(e) Contractors, not accompanied by NE Nitro Geneva personnel, may be provided a radio to communicate with NE Nitro Geneva personnel. This will be determined during project planning, pre-job briefing, or heightened security risk.\n\n(f) If an evacuation is required: \n\n   (i)A pre-assigned Control room operator will collect the sign-in ledger located in the Control Room. \n\n   (ii) A pre-assigned NE Nitro Geneva employee in the Administrative Office will collect the sign-in ledger located in the Administrative Office.\n\n   (iii) A role call will occur. \n\n   (iv) In the event a person is presumed to be missing, attempts will be made through radio communication. If attempts to communicate with missing people are unsuccessful, NE Nitro Geneva personnel will wait for emergency services to arrive before re-entering the facility.\n\n\n\n\n\nEMERGENCY RESPONSE INFORMATION\n\n\n\n1. Facility Information\n\n\n\nNE Nitro Geneva\n\n2240 R Street\n\nGeneva, Nebraska 68361\n\n\n\nCounty: Fillmore County\n\n\n\nNE Nitro Geneva Phone Number for Emergency Response Personnel: (402) 802-0385\n\n\n\nRisk Management Plan Manager: Amber Hoban\n\n\n\nFire protection equipment contractor: Ahern\n\n\n\nFire protection equipment contractor pho"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000099222,
      "SummaryText": "ne number: (563) 388-0600 (Ahern in Davenport, IA)\n\n\n\n2. Spill Response Notifications\n\n\n\nNebraska Department of Environmental and Energy (NDEE)\n\nMonday through Friday (8 a.m. through 5 p.m.), non-holidays\n\nPhone number: 402-471-2186\n\n\n\n\n\nNebraska State Patrol Dispatch\n\nAfter hours, Weekends, and Holidays\n\nPhone number: 402-471-4545\n\n\n\nNotifications to the NDEE or Nebraska State Patrol Dispatch must be made if any of the following occur:\n\n(a) Acute emergencies, such as spills or releases of petroleum products or hazardous substances.\n\n(b) Any oil release that impacts or threatens waters of the state or threatens the public health.\n\n(c) Any release of oil upon the surface of the land in a quantity that exceeds 25 gallons. This notification must be made immediately (verbal) and a written notification must be made within 15 days of discharge or as requested by the NDEE.\n\n\n\nNE Nitro Geneva will refer to Nebraska Title 126 for additional requirements pertaining to notification of spills.\n\n\n\n\n\nNational Response Center\n\n(24-hour phone number) 1-800-424-8802\n\n\n\nNotifications to the National Response Center must be made immediately for each instance of a discharge reaching navigable waters.\n\n\n\n\n\nEPA Region 7 Hotline\n\n(24-hour phone number) 1-913-281-0991\n\n\n\nImmediately call the EPA Region 7 Hotline for each instance of a discharge reaching navigable waters.\n\n\n\n\n\nEPA Region 7 Regional Administrator\n\nMonday through Friday (8 a.m. through 4:30 p.m.)\n\n913-551-7003\n\n\n\nA single discharge of 1,000 gallons or more, or two or more discharges of 42 gallons or more over a 12-month period requires written notification to the EPA Region 7 Regional Administrator with 60 days of discharge.\n\n\n\n\n\nOther Emergency Contacts:\n\n\n\nGeneva Hospital\n\n402-759-3167\n\n\n\n\n\nFillmore County Emergency Management (Local Emergency Planning Committee - LEPC)\n\nJean Engle\n\n(Office) 402-759-4932 \n\n(Cell) 402-759-1170\n\n(Email) fcema@fillmore.nacone.org\n\n\n\n\n\nNebraska Emergency Management will contact SERC if addition"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000099222,
      "SummaryText": "al emergency response services are necessary.\n\nLincoln, Nebraska\n\n(Monday thru Friday, 8 a.m. to 5 p.m.) 402-471-7421\n\n(All other times) 1-877-297-2368\n\n\n\n\n\nNebraska State Fire Marshal Office\n\nMike Peters\n\n402-631-7814\n\n\n\n\n\nWeather Report - Used to identify potential precipitation, temperatures, and wind conditions that might impact emergency response.\n\nHastings NWS Dial-a-forecast\n\n402-462-4287\n\n\n\n\n\nLocal Radio - KTMX York 104.9 FM - To report emergency information to the public\n\n402-362-5869\n\n\n\nLocal Radio - KGMT Fairbury 99.5 FM  - To report emergency information to the public\n\n(402) 729-3382\n\n\n\nContact Nebraska Emergency Management to request assistance with traffic control/rerouting on nearby highways if necessary in an emergency.\n\n(Monday thru Friday, 8 a.m. to 5 p.m.) 402-471-7421\n\n(All other times) 1-877-297-2368\n\n\n\n\n\n\n\n"
    }
  ]
}