{
  "FacilityID": 1000078826,
  "FacilityName": "Airgas USA, LLC",
  "FacilityStr1": "4646 Linden Rd",
  "FacilityStr2": null,
  "FacilityCity": "Rockford",
  "FacilityState": "IL",
  "FacilityZipCode": "61109",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17201",
  "LEPC": null,
  "FacilityLatDecDegs": "42.217575",
  "FacilityLongDecDegs": "-89.023700",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 44673148,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Rick Keefer",
  "OperatorStr1": "4646 Linden Rd",
  "OperatorStr2": null,
  "OperatorCity": "Rockford",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61109",
  "OperatorZipCodeExt": null,
  "FTE": 62,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000239271",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-08-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-08-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-08-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-08-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 42.21667,
  "FRS_Long": -89.02616,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2.64",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000098317,
      "AltID": "Propane Filling",
      "FacilityID": 1000078826,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000123336,
          "ProcessID": 1000098317,
          "ChemicalID": 98,
          "Quantity": 250000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000099559,
          "ProcessID": 1000098317,
          "NAICSCode": "42469",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000083409,
              "Process_NAICS_ID": 1000099559,
              "SafetyReviewDate": "2023-08-08 00:00:00",
              "PHA_Date": "2021-04-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-12-29 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-07-11 00:00:00",
              "TrainingReviewDate": "2023-07-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-08-08 00:00:00",
              "EquipmentInspectionDate": "2023-08-11 00:00:00",
              "EquipmentTested": "Propane pump",
              "ChangeMgmtDate": "2022-08-01 00:00:00",
              "ChangeMgmtReviewDate": "2022-08-01 00:00:00",
              "PreStartupReviewDate": "2022-08-01 00:00:00",
              "ComplianceAuditDate": "2023-08-08 00:00:00",
              "AuditCompletionDate": "2023-10-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-07-27 00:00:00",
              "HotWorkPermitReviewDate": "2023-05-16 00:00:00",
              "ContractorSafetyReviewDate": "2023-05-31 00:00:00",
              "ContractorSafetyEvalDate": "2023-05-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000103877,
                  "PreventionProgram3ID": 1000083409,
                  "ProcessChemicalID": 1000123336
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000078826,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Rockford Fire Department",
    "CoordinatingAgencyPhone": "8159875655",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000078826,
      "SummaryText": "opane occur that will have off-site consequences Airgas\nwill contact the Rockford Fire Department and local support authorities, who will coordinate action\nfor the affected community.\n\nPlanned Changes to Improve Safety\nSafety is an inherent part of the culture at Airgas and enhancements in safety and operations are\nactively discussed and supported. The Rockford propane fill facility continues to review its\nprocesses for possibilities of improvement to the covered propane process, operational methods,\nand new technology to lower risk."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000078826,
      "SummaryText": "five years to be reviewed during future PHA's and\nrevalidations.\n\nHazardous Work Permit System (HWP)\nAirgas has a hazardous work permit system in place to help ensure worker and process safety. This\nsystem is comprised of a group of corporate procedures, standards and forms under the life safety\nprogram. Procedures in place include: (1) energy control; (2) safe work; (3) hot work; (4) confined\nspace entry. Plant personnel are trained on these safe work practices to ensure that operations and\nmaintenance activities are performed professionally and safely.\n\nContractors (CON)\nAirgas uses contractors to supplement its own workforce when maintenance activities exceed the\ncapabilities or time available for their own employee/operators. Contractors are made aware of the\npotential dangers involved with a system covered by PSM/RMP. Procedures are in place to make\nsure that contractors: (1) perform their work in a safe manner, (2) have the appropriate knowledge\nand skills, (3) are aware of the hazards in their workplace, and (4) understand what they should do in\nthe event of an emergency, prior to their beginning work. Periodically contractors are evaluated to\nensure that both their safety performance and training required for work on the propane system\nmeets Airgas's safety standards.\n\nFive-Year Accident History (AH)\nThe Rockford propane filling facility has had no accident resulting in either on or off site effects in\nthe last five (5) years for the covered propane process.\n\nEmergency Response Program Information (ERP)\nThe Rockford propane filling facility has developed a written emergency action plan. The plan\noutlines action to be taken at the plant for handling small releases, and if larger the communication\nto emergency responders, local response agencies, and outside agency notification procedures in\nthe event of a propane release. The emergency plan provides for the evacuation of Rockford\nfacility personnel and visitors. Should an emergency involving the release of pr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078826,
      "SummaryText": "MOC requirements.\n\nPre-startup Safety Reviews (PSSR)\nAirgas ensures the safety of new/modified facilities or processes before placing those facilities or\nprocesses into service through the use of pre-startup safety reviews (PSSR's). PSSR's are intended\nto ensure safety through confirmation that: (1) construction and equipment are in accordance with\ndesign specifications; (2) safety, operating, maintenance and emergency procedures are in place\nand adequate; (3) PHA's have been performed and recommendations resolved before startup of\nnew plants or processes; (4) MOC requirements have been satisfied for modified facilities; and (5)\ntraining has been completed and documented for affected operator/employees.\n\nCompliance Audits (CA)\nTo help ensure the accident prevention program is functioning properly, Airgas conducts an audit to\ndetermine whether the procedures and practices required by the accidental release prevention\nprogram are being implemented. Compliance audits are conducted at least every three years.\nResolutions to recommendations are documented, tracked and closed. Once the resolutions have\nbeen completed, changes are communicated to operating, maintenance and other employees\nwhose work assignments are in the covered process and who may be affected by the\nrecommendations or actions. Training and communication is documented.\n\nIncident Investigation (II)\nAirgas defines management systems and establishes the requirements for communicating,\ninvestigating and reporting of incidents at all facilities through the use of an Incident Investigation\nand reporting procedure. Airgas documents incident and subsequent investigation, follow up\nactions, and closure in an electronic document control system. The Facility Manager is responsible\nfor maintaining a log and tracking incidents and corrective actions through completion. Results of\nfindings and corrective actions are shared with employee/operators who could be affected by the\nfindings. Reports are retained for at least"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078826,
      "SummaryText": "rating procedures, health and safety\nconsideration, use of safety procedures and equipment, incident investigation and emergency\nresponse. In addition, all operators are required to attend refresher training at least every three\nyears. Training is documented and tracked in a local facility matrix and electronically in the Airgas\nUniversity training system.\n\nMechanical Integrity (MI)\nAirgas has established mechanical integrity (MI) practices and procedures, based on preventative\nphilosophy, to maintain pressure vessels, piping systems, relief valves and vent systems, controls\nand interlocks, pumps and compressors, and emergency shutdown systems in a safe operating\ncondition. The basic aspects of this program include: (1) conducting training, (2) developing written\nprocedures, (3) performing inspections and tests; (4) correcting identified deficiencies, and (5)\napplying quality assurance measures. In combination, these written activities form a system that\nmaintains the mechanical integrity of the process equipment. The MI program assists with the\nverification and suitability of new and existing process equipment and, as well as quality control of\nspare parts and modifications to existing process equipment.\n\nManagement of Change (MOC)\nAirgas' management of change (MOC) procedure has established the requirements for ensuring\nproposed process or equipment changes or changes indirectly affecting processes are evaluated,\napproved and documented prior to implementation through the use of a management of change\nprocess. The MOC procedure outlines the requirements for documenting, evaluating the impact,\nand approving planned deviations from procedure. All MOC's are submitted, reviewed by subjective\nmatter specialist (such as Engineering, Risk Management, Operations, Health and Safety),\napproved, tracked and closed using an electronic approval and tracking system. Upon closure,\npersonnel whose assigned job functions are impacted by the MOC, are briefed and /or trained in the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078826,
      "SummaryText": "ry five years or\nas required by Management Of Change (MOC). The PHA team consists of members with the\nappropriate experience to define the hazards and mitigating controls of the process and also\nrepresents a cross-section of the employees working in the process. For future PHA reviews, local\nand corporate management will review the PHA team findings and develop a resolution action plan\nfor each item, which will be documented, tracked and ultimately closed in the Airgas action item\ndatabase tracking system. Facility Manager is responsible for prioritizing and tracking\nimplementation of the action plan to closure.\n\nOperating Procedures (OP)\nAirgas maintains controlled written procedures that address various modes of liquefied and gaseous\npropane process operations, such as: (1) unit initial startup; (2) unit normal operations; (3) unit emergency shutdown; (4) unit normal shutdown and; (5) unit startup after turnaround or emergency shutdown. Additionally, the emergency shutdown procedure includes conditions that will prompt a shutdown and identifies\nqualified and responsible operators to complete the steps in a safe and timely manner. Operation under temporary or emergency procedures require and MOC, should the need arise. \nAirgas operating procedures have safe operating limits identified along with consequences of unsafe\ndeviation. Procedures further provide steps for operators to take that will correct or avoid an unsafe\ndeviation. Airgas procedures are used by experienced operators and provide a basis for consistent\ntraining of new operators. These procedures are reviewed and annually certified as current and\naccurate.\n\nTraining (TN)\nAirgas has implemented a training program for all employee/operators involved in the propane \ncovered process. All employees receive a combination of classroom, computer-based (CBT) and\nhands-on training that addresses such topics as: general orientation, facility rules and practices,\nprocess safety information, normal and emergency ope"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078826,
      "SummaryText": "or propane process equipment, check valves on propane delivery lines and pressure safety valves for the process piping and vessels. (3) Facility and Environment - Rockford, IL plant emergency action plan.\n\nEmployee Participation (EP)\nAirgas has developed a written plan of action and Rockford employee/operators are expected to\nparticipate in the accidental release prevention program (RMP/PSM). Employees are trained on\nand provided access to the Propane process safety information. Specific actions an\nemployee can be involved in the accident prevention program are documented in the Employee\nParticipation plan. Forms of participation include being part of a PHA, a PSSR, and/or being\ninvolved in incident investigation. Employees participate in monthly safety meetings where process\nsafety issues are discussed and corrective actions are developed, and they are involved in the\nreview of the covered process operating procedures annually to ensure they are current, accurate\nand recommend any necessary changes.\n\nProcess Safety Information (PSI)\nAirgas keeps a variety of technical documents onsite and in the company's electronic document\ncontrol system that are used to help maintain safe operation of its processes. These documents\naddress chemical properties and associated hazards, equipment design/configuration information,\nspecific chemical inventories and operation limits for key process parameters - all key information for\noperating the process safely. Process operators are trained to operate the process using process\ncontrols and instrumentation within these safe operating limits.\nThe Facility Manager is responsible for maintaining up-to-date process safety information.\n\nProcess Hazard Analysis (PHA)\nAirgas has a risk management program to help ensure that hazards associated with the various\nprocesses are identified and controlled. The covered process underwent an initial process hazard\nanalysis (PHA) and will continue to undergo periodic review/re-validations at least eve"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078826,
      "SummaryText": "Executive Summary:\nAirgas USA, LLC operates a propane storage/filling facility with 62 employees in Rockford, IL. The facility is manned 17 hours per day. The Rockford propane process receives product by propane transport truck that is stored onsite in two (2) bulk storage vessels (108,000 lbs / 30,000 gallons each) before being transferred into gas cylinders then distributed to customers. Cylinders containing between 20 and 100 lbs of propane are filled on a daily basis. Each is weighed after filling, increasing operational safety.\n\nRegulated Chemical:\nPropane stored and transferred on site is listed as a highly hazardous chemical under the EPA Risk Management Plan (RMP), and OSHA Process Safety Management (PSM) regulations. The Airgas Rockford, IL onsite inventory of propane is in excess of 10,000 pounds making the propane process and its connected equipment a PSM/RMP covered process.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps:\nThe highly flammable and hazardous nature of propane in the process makes it necessary for Airgas to observe certain safety precautions to prevent unnecessary human and environmental exposure and to reduce the potential threat to personnel and nearby members of the community. Airgas' policy is to comply with all applicable federal and state rules and regulations. This Executive Summary sets forth some of the management systems in place to implement the accidental release and prevention program. Airgas has also implemented specific chemical prevention steps to help prevent potential accident scenarios that could be caused by equipment failures and human errors. The following examples of the types of safety features in place: (1) Release Mitigation - Emergency stop buttons to isolate propane sources; personal protective equipment (protective outerwear clothing, intrinsically safe devices, safety glasses, shoes, etc.) (2) System Integrity - Automatic control and manual valves that provides isolation f"
    }
  ]
}