{
  "FacilityID": 1000097006,
  "FacilityName": "Jody Fresh Cooling Company",
  "FacilityStr1": "4731 Avenue 400",
  "FacilityStr2": null,
  "FacilityCity": "Dinuba",
  "FacilityState": "CA",
  "FacilityZipCode": "93618",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "36.516473",
  "FacilityLongDecDegs": "-119.468180",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jody Fresh Cooling Company",
  "OperatorStr1": "4731 Avenue 400",
  "OperatorStr2": null,
  "OperatorCity": "Dinuba",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93618",
  "OperatorZipCodeExt": null,
  "RMPContact": "Hovel Salinas",
  "RMPTitle": "Safety Manager",
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120326",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-12-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-11-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-11-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-11-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-11-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.5",
  "FRS_Lat": 36.51742,
  "FRS_Long": -119.4738,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000120236,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000097006,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000121609,
          "ProcessID": 1000120236,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000150498,
          "ProcessID": 1000120236,
          "ChemicalID": 56,
          "Quantity": 25000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000650498,
          "ProcessID": 1000120236,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000097006,
      "SummaryText": "1. Executive Summary\n\n\n\nThis program is intended to meet the spirit and intent of the following regulations:\n\n- California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\n\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\n- California Process Safety Management (PSM) Program, Title 8 CCR ?5189\n\n- Federal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\n\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Jody Fresh has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1 Jody Fresh, Risk and Process Safety Management Program\n\nThis is to inform all interested persons, including employees, that Jody Fresh has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following process which have the presence of hazardous chemicals above threshold quantities: \n\n\n\nProcess Name           | Process Chemical          | Process Quantity(lbs.)\n\nAmmonia Refrigeration    Anhydrous Ammonia           25,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses, and physical property damage.\n\n\n\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n1. Prepared a unified program based on the PSM regulation to meet CalARP and RMP obligations as well\n\n2. O"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000097006,
      "SummaryText": "rganized the program so that it meshes closely with general business practices\n\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures, and practices that will help our employees and neighbors protect themselves.\n\n\n\n1.2 Process Descriptions\n\n\n\n1.2.1 Facility Overview\n\n\n\nJody Fresh operates a commercial cold storage for a variety of fruit in Dinuba, CA. The facility has an ammonia refrigeration system that provides refrigeration capacity to the following:\n\n(2) Degreening Rooms\n\n(2) Hydrocoolers\n\n(1) Palletizing Room\n\n(3) Precools\n\n(5) Storage Rooms\n\n\n\n1.2.2 Facility Location\n\n\n\nJody Fresh is located at 4731 Avenue 400, Dinuba, CA 93618. The latitude and longitude of the high pressure receiver is 36.516485, -119.468203. The facility is located approximately 3 miles east of state highway 99 in a rural area surrounded primarily by agriculture land.\n\n\n\nFlood Hazards\n\nAccording to FEMA Flood Map Service, the facility is located in \"an area of minimal flood hazard\".\n\n\n\nSeismic Susceptibility\n\nJody Fresh is not located in an Alquist-Priolo Fault Zone as defined by the California Department of Conservation. In addition, a review of United States Geological Survey (USGS) fault maps revealed that there are no faults in close proximity to the site. The USGS 2018 One-Year Model revealed that Jody Fresh has a 1-2% chance of experiencing \"potentially minor-damage\" due to ground shaking in 2018.\n\n\n\n1.2.3 Description of Covered Process\n\n\n\nFlooded System\n\nSelect refrigerated areas are equipped with air-cooling evaporators and accumulators as required for flooded operation.\n\n\n\nPumped Overfeed System\n\nSelect refrigerated areas are equipped with air-cooling evaporators which are supplied from a recirculator as required for pumped overfeed operation.\n\n\n\nMost control valve groups are located on the roof/in the center hall (catwalk) to provide easy access. The r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000097006,
      "SummaryText": "efrigeration machinery is contained within or directly above the machinery room. A partial list of system components includes: \n\n\n\nMachinery Room\n\n(2) Reciprocating compressors\n\n(2) Screw compressors\n\n(4) Oil separators\n\n(1) High pressure receiver\n\n(1) Liquid transfer vessel\n\n(1) Main suction accumulator\n\nCondenser Area\n\n(2) Evaporative condensers\n\nRecirculator Area\n\n(1) Recirculator\n\n(2) Ammonia pumps\n\nCherry Line Hydrocooler\n\n(1) Accumulator\n\n(3) Water-cooling evaporators (bare coils)\n\nHydrocooler Area\n\n(2) Accumulators\n\n(4) Water-cooling evaporators (bare coils)\n\nPrecool 1\n\n(1) Accumulator\n\n(2) Air-cooling evaporators (bunker-mounted, spiral fin)\n\nPrecool 2\n\n(1) Accumulator\n\n(2) Air-cooling evaporators (bunker-mounted, spiral fin)\n\nPrecool/Storage Room 3\n\n(1) Accumulator\n\n(4) Air-cooling evaporators (bunker-mounted, spiral fin)\n\nStorage Room 1\n\n(1) Accumulator\n\n(2) Air-cooling evaporators (bunker-mounted, spiral fin)\n\nStorage Room 2\n\n(1) Accumulator\n\n(4) Air-cooling evaporators (bunker-mounted, spiral fin)\n\nStorage Room 4\n\n(2) Accumulators\n\n(4) Air-cooling evaporators (bunker-mounted, spiral fin)\n\nStorage Room 5\n\n(2) Accumulators\n\n(4) Air-cooling evaporators (ceiling-suspended)\n\nPalletizing Room\n\n(6) Air-cooling evaporators (ceiling-suspended)\n\nDegreening Room 1-3\n\n(2) DX air-cooling evaporator (ceiling-suspended)\n\nDegreening Room 4\n\n(1) DX air-cooling evaporator (ceiling-suspended)\n\n\n\nProcess Classification\n\nThe ammonia refrigeration system at Jody Fresh consists of vessels, equipment, and valves which are interconnected by piping. As such, the refrigeration system at Jody Fresh is treated as a single process.\n\n\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n\n\n1.3.1 General\n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nJody "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000097006,
      "SummaryText": "Fresh has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \n\n\n\n1.3.2 Anhydrous Ammonia\n\n\n\nThe ammonia refrigeration process at the Jody Fresh facility is an integral part of the overall business and operates most of the year. It is extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\n\n\nOur refrigeration personnel monitor the ammonia refrigeration process and keep an active log book of all procedures and transactions that pertain to ammonia. In addition, the process is checked frequently by one of the outside refrigeration contractors that we use. These contractors also assist in performing the annual mechanical integrity inspection of our ammonia equipment. \n\n\n\n1.4 Five Year Accident History\n\n\n\nJody Fresh has had no accidental release within the last five (5) years.\n\n\n\n1.5 Emergency Action and Response Plan\n\n\n\nJody Fresh's emergency action and response program has been developed to satisfy the following requirements:\n\n- Cal/OSHA's Emergency Action Plan - Title 8 CCR ?3220\n\n- U.S. Occupational Safety and Health Administration's (OSHA) Emergency Action Plans - Title 29 CFR ?1910.38\n\n- Cal/OSHA's Process Safety Management [Emergency Response Program Requirements] - Title 8 CCR ?5189(n)\n\n- U.S. Occupational Safety and Health Administration's (OSHA) Process Safety Management [Emergency Planning and Response Requirements]- Title 29 CFR ?1910.119(n)\n\n- California Accidental Release Prevention (CalARP) Program [Emergency Response Program Requirements] - Title 19 CCR, Division 2, Chapter 4.5 ?2765.1-2765.2\n\n- USEPA Risk Management Program [Emergency Response Program Requi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000097006,
      "SummaryText": "rements] - Title 40 CFR ?68.95\n\n- California Hazardous Materials Business Plan (HMBP) [Emergency Response Plans and Procedures] - Title 19 CCR, Division 2, Chapter 4 ?2731\n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\n\n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nJody Fresh has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, Jody Fresh continually strives to improve in all areas, including safety.\n\n\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved Jody Fresh's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Jody Fresh's management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nJody Fresh has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\n\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Jody Fresh has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\n\n\n\nFor the future, Jody Fresh now thinks of the RMP-PSM program as a "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000097006,
      "SummaryText": "\"living document\". It is an interactive framework that guides safe action for Jody Fresh employees, but allows for feedback and continual improvement. Through the RMP-PSM program Jody Fresh will continue to maintain overall plant worker and public safety.\n\n"
    }
  ]
}