{
  "FacilityID": 1000072741,
  "FacilityName": "Sargento Foods, Inc.",
  "FacilityStr1": "460 South 8th Street",
  "FacilityStr2": null,
  "FacilityCity": "Hilbert",
  "FacilityState": "WI",
  "FacilityZipCode": "54129",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55015",
  "LEPC": "Calumet County",
  "FacilityLatDecDegs": "44.133056",
  "FacilityLongDecDegs": "-088.162500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.sargento.com",
  "FacilityEmailAddress": "Ask_Us@sargento.com",
  "FacilityDUNS": 118322457,
  "ParentCompanyName": "Sargento Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 23218233,
  "Company2DUNS": 0,
  "OperatorName": "Sargento Foods, Inc.",
  "OperatorStr1": "One Persnickety Place",
  "OperatorStr2": null,
  "OperatorCity": "Plymouth",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53073",
  "OperatorZipCodeExt": null,
  "RMPContact": "Allen Kellar",
  "RMPTitle": "Facilities Engineer",
  "FTE": 386,
  "OtherEPAFacilityID": "WID988618260",
  "EPAFacilityID": "100000204236",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-06-18 00:00:00",
  "SafetyInspectionBy": "3rd party PSM compliance firm",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Hilbert, Wisconsin",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-10-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-10-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-10-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-10-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000090998,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000072741,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000092240,
          "ProcessID": 1000090998,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000113788,
          "ProcessID": 1000090998,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000613788,
          "ProcessID": 1000090998,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072741,
      "SummaryText": "Sargento Foods, Inc., in Hilbert, Wisconsin is a dairy processing plant situated on a 24.4-acre parcel of land. The facility was constructed in 1979. A building addition completed in 2008 included the facility's first ammonia refrigeration system. A major building addition completed in 2016 added the north production building. An expansion to the north building was completed in 2018 with a subsequent expansion to the south in 2020.  The facility occupies about 284,551 square feet. The property is located on the southern outskirts of the Village of Hilbert. Adjacent properties to the east and south are farmland. Residential properties are located to the north. A mixture of residential and commercial (St. Vincent De Paul and General Telephone) are located to the west, across STH 32/57.\n\n\n\nSargento Foods is committed to protecting the health and well being of their employees, the environment, and the community. Employee training programs are in place, including ammonia awareness training for all employees. The emergency response teams participate in regularly scheduled response training and ammonia refrigeration maintenance personnel are trained for operation of the ammonia system. The facility has a chemical labeling program and a spill prevention plan. Outside contractors must follow written contractor policies. Hot work permits are required. \n\n\n\nThe ammonia refrigeration system was designed and installed in accordance with Wisconsin Administrative Code Chapter COMM 45 (replaced by Chapter SPS 345: Mechanical Refrigeration System in December 2011) and ASHRAE and IIAR standards. The system is a basic two-stage mechanical refrigeration system utilizing ammonia as the refrigerant. The inventory of ammonia within the refrigeration system at any time is greater than 10,000 pounds. A current ammonia inventory is available in the PSM Plan - Process Safety Information Chapter. The facility is equipped with alarm and ammonia detection systems, which continually monitor the re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072741,
      "SummaryText": "frigeration system. Also, Sargento maintenance employees perform system \"walk-throughs\" and check operating conditions on each working day. \n\n\n\nThe worst-case scenario used for this stationary source is the release of the total quantity of ammonia contained within the largest vessel of the refrigeration system, as mandated in EPA's Appendix E: Supplemental Risk Management Program Guidance for Ammonia Refrigeration Facilities (RMP Guidance, Appendix E). The release quantity, 14,361 pounds, is the maximum amount the vessel can hold, and is assumed to be completely released from the vessel over a period of 10 minutes. The normal amount of ammonia in the largest vessel is 3,376 pounds. The wind speed is assumed to be 1.5 meters per second with an F stability class. The toxic endpoint for ammonia is 200 ppm. The mitigation effects of the building were used in the estimate because the ventilation system adequate according to RMP Guidance, Appendix E. In the unlikely event of a release of 15,044 pounds of ammonia, considering the passive mitigation effects of the building, the distance to the toxic end point could be up to 0.9 miles. \n\n\n\nSeveral additional release scenarios were evaluated for this ammonia system. These alternate scenarios represent conditions which are more likely to occur that the worst case scenario. The scenario resulting in the greatest offsite impact is damage to a 3/4-inch diameter pipe containing liquid ammonia, resulting in a ?-inch hole and causing ammonia to release under pressure. The release has a toxic endpoint distance up to 0.2 miles. \n\n\n\nIf an emergency were to occur, the local fire and hazardous response team would be notified and the emergency response procedures would be followed. Sargento Foods - Hilbert also has retained Bassett Mechanical (Kaukauna, Wisconsin) to respond to a release or emergency situation. The facility has an Emergency Action Plan, and employees have been trained how to use the plan. Emergency drills covering various"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072741,
      "SummaryText": " types of emergencies are carried out several times each year. Sargento strives to have at least one drill each year that involves an ammonia-related emergency. The local response teams are invited to visit the facility on a regular basis. The facility has an Emergency Response Team who have been trained in Emergency Action Plan procedures and in coordination with outside response personnel. \n\n\n\nThe ammonia system at Sargento Foods-Hilbert facility is covered by the Occupational Safety and Health Administration (OSHA) Process Safety Management Plan (PSM) which requires the facility to manage system operations and develop emergency response and accident prevention programs. Sargento Foods has developed and implemented a PSM program for the Hilbert facility, in conjunction with the addition of ammonia to the facility. The PSM will be audited every three years. Process Hazard Analysis (PHA) will be conducted every five years, or when a major change is made to the ammonia system. \n\n\n\nIn the past five years, Sargento Foods-Hilbert has had no accidental releases that resulted in deaths, injuries, or significant property damage on site. In the past five years, there have been no accidental releases that resulted in offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. \n\n\n\nPlanned changes to improve safety include implementation of a web-based PSM/RMP software management tool to facilitate comprehensive, centralized management of all PSM/RMP elements and tracking capabilities. \n\n\n\n"
    }
  ]
}