{
  "FacilityID": 1000011682,
  "FacilityName": "GateFront, LLC - Corpus Christi, Texas",
  "FacilityStr1": "7002 Marvin L. Berry Road",
  "FacilityStr2": null,
  "FacilityCity": "Corpus Christi",
  "FacilityState": "TX",
  "FacilityZipCode": "78409",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48355",
  "LEPC": "Nueces County LEPC",
  "FacilityLatDecDegs": "27.828361",
  "FacilityLongDecDegs": "-097.499722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 830669920,
  "ParentCompanyName": "Helena Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 7036759,
  "Company2DUNS": 0,
  "OperatorName": "GateFront, LLC",
  "OperatorStr1": "P.O. Box 10739",
  "OperatorStr2": null,
  "OperatorCity": "Corpus Christi",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78460",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff Holley",
  "RMPTitle": "Terminal Manager",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000208839",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-11-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-11-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-11-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-11-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000014048,
      "AltID": "Railcar Storage",
      "FacilityID": 1000011682,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000014409,
          "ProcessID": 1000014048,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000016173,
          "ProcessID": 1000014048,
          "ChemicalID": 56,
          "Quantity": 1651040.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000516173,
          "ProcessID": 1000014048,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000014049,
      "AltID": "Fertilizer Reacting",
      "FacilityID": 1000011682,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000014410,
          "ProcessID": 1000014049,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000016174,
          "ProcessID": 1000014049,
          "ChemicalID": 56,
          "Quantity": 1651040.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000516174,
          "ProcessID": 1000014049,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011682,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe GateFront, LLC (GateFront) Corpus Christi Facility has submitted this electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68.  This electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Corpus Christi Bulk Terminal Facility located at 7002 Marvin L. Berry Road, Corpus Christi, Texas 78409.  The electronic RMP summarizes the policies and procedures implemented by the Corpus Christi Facility to minimize the likelihood of an accident. The electronic RMP also summarizes the actions that the Corpus Christi facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner. \n\nPURPOSE OF RMP\n\nGateFront has updated this RMP to increase inventory from 30,000-gallon railcars to 34,000-gallon railcars, and separate the single covered process and make it two covered processes; a temporary ammonia storage process and a temporary Fertilizer reacting process.  GateFront is resubmitting this RMP as a 5-Year update.  As part of the update, GateFront updated the off-site consequence analysis for the worst case and the alternative case release scenarios.  The prior worst case OCA consisted of a release from a single 30,000-gallon insulated railcar.  This worst case OCA consists of a release from a single 34,000-gallon insulated railcar.\n\nFACILITY\n\nThe Corpus Christi Bulk Terminal Facility is an agricultural chemical blending and distribution facility.  This facility was recently constructed and began operations in July 2009.  Anhydrous ammonia is transported to the Facility via railcar or possibly commercial truck.   Anhydrous ammonia is stored in the transportation container until it is reacted with phosphoric acid in a mobile pipe reactor and then diluted with water.  GateFront does not own or operate the rea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011682,
      "SummaryText": "cting process.  The reacting process and ancillary railcar unloading procedures are performed by an Independent Fertilizer Reacting Contractor (IFRC).  After the reacting process is complete, any residual anhydrous ammonia is stored in the transportation containers until the transportation company removes the container from the GateFront Facility.\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\nWorst case and alternative case offsite consequence analyses were completed for both the ammonia storage process and the reacting process.  The worst case release scenario is the same for the both the ammonia storage and the reacting process.  The worst case scenario release for the GateFront Facility assumes that all the contents of the largest single vessel (a single railcar) are released.  The release was modeled as if the railcar was punctured on the side at the ground level. The resulting release of ammonia was modeled as a ground level horizontal jet.\n\nThe alternative (or more likely to occur) scenarios are different for the two processes.  The ammonia storage alternative consequence analysis assumed that a vapor valve is leaking or is not fully closed.  (The scenario actually assumes the valve is only 50% closed.)  The reacting process alternative consequence analysis assumes that a 3-inch liquid transfer line is severed during the reacting process.  \n\nACCIDENT PREVENTION PROGRAM\n\nThe Terminal Manager implements the risk management planning process at this GateFront facility.  The Terminal Manager is assisted by other GateFront staff, as directed.  The ammonia storage prevention program is implemented by GateFront employees.  GateFront employees inspect the markings on transportation containers to ensure that the containers are operated within the U.S. DOT required inspection requirements and they inspect the Bill of Lading to ensure that the railcars are not overfilled.  GateFront employees also inspect the railcars for leaking valves and fittings and they conduct daily inspections o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011682,
      "SummaryText": "f the railcar storage area for audio, visual, or olfactory indications of leaks.\n\nThe reacting process prevention program is implemented by the IFRC because GateFront does not own or operate the reacting process.  GateFront requires the IFRC to certify its compliance with a Process Safety Management Plan and it spot checks some aspects of the contractorA?s PSM documentation (e.g. maintenance, training records) to ensure that the Contractor is complying with its PSM Plan.  \n\nEMERGENCY RESPONSE PROGRAM\n\nGateFront, LLCA?s Corpus Christi Facility is a non-responding facility.  GateFront has coordinated emergency response activities with its local emergency response agency and local fire department.  GateFront has a written Contingency Plan that includes procedures to notify local emergency response agencies in event of a significant ammonia release.  GateFront employees will not, under any circumstance, serve as first responders to a significant release of ammonia.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no on-site deaths, injuries or significant property damage; or of-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Corpus Christi Facility.\n\n\n\nCONCLUSION\n\nThe Risk Management Plan implemented by GateFront at the Corpus Christi Facility complies with the requirements of the Clean Air Act, Section 112(r).  The RMP will be updated as the Corpus Christi Facility adds, deletes or changes processes.  The Emergency Response Program has been coordinated with the Nueces County LEPC.\n\nNOTE: Sections 4, 5, 6 and 8 of the standard RMP produced by EPAA?s RMP Submit Program are not applicable to the Corpus Christi Facility.\n"
    }
  ]
}