{
  "FacilityID": 1000064181,
  "FacilityName": "Cebro Frozen Foods",
  "FacilityStr1": "2100 Orestimba Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Newman",
  "FacilityState": "CA",
  "FacilityZipCode": "95360",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.317778",
  "FacilityLongDecDegs": "-121.057500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 808969125,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Patrick Cerruti",
  "OperatorStr1": "2100 Orestimba Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Newman",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95360",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Gillenwater",
  "RMPTitle": "CalARP Administrator/Safety Manager",
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000123902",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-11-09 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-06-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-06-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-06-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-06-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.31834,
  "FRS_Long": -121.05742,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000080519,
      "AltID": "Processing refrigeration",
      "FacilityID": 1000064181,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000081761,
          "ProcessID": 1000080519,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000100347,
          "ProcessID": 1000080519,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000600347,
          "ProcessID": 1000080519,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000080520,
      "AltID": "Warehouse refrigeration",
      "FacilityID": 1000064181,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000081762,
          "ProcessID": 1000080520,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000100348,
          "ProcessID": 1000080520,
          "ChemicalID": 56,
          "Quantity": 7500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000600348,
          "ProcessID": 1000080520,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000064181,
      "SummaryText": "                                               CEBRO FROZEN FOODS\n\n                                          RISK MANAGEMENT PROGRAM (RMP)\n\n                                      AND PROCESS SAFETY MANAGEMENT PROGRAM\n\n\n\n                                      Anhydrous Ammonia Refrigeration System\n\n\n\n                                               EXECUTIVE SUMMARY\n\n                                                Revised June 2017\n\n\n\n\n\n\n\nCebro Frozen Foods (Cebro) prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with state and federal regulations. The state risk management regulations, also referred to as the California Accidental Release Prevention (CalARP) program, are codified in California Code of Regulations (CCR), Title 19, Section 2745, et. seq. The Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances. The federal regulations are codified in the Code of Federal Regulations (CFR), Title 40, Section 68. Finally, both the California Occupational Safety and Health Administration (CalOSHA) and the federal Occupational Safety and Health Administration (OSHA) regulate facilities with certain acutely hazardous materials under the PSM standards as defined in CCR, Title 8, Section 5189 and CFR Title 29, Part 1910, Section 119, respectively.\n\n\n\nAccidental Response Program and Emergency Response Policies\n\nCebro prepared the RMP/PSM program to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia handling systems and practices at the facility. Many state-of-the-art safety features were incorporated into the ammonia refrigeration system at the facility as part of the original system construction. In the unlikely event that a chemical release does occur at the facility, Cebro personnel are trained in the appropriate response measures, relying on emergency services provided by the Newman fire department and th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000064181,
      "SummaryText": "e Stanislaus County Hazardous Materials Response team. Cebro will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP/PSM program.\n\n\n\nStationary Source and Regulated Substance\n\nCebro is located at 2100 Orestimba Road in Newman, California. The facility is approximately 2 miles west of Highway 33, which runs north and south through Newman. The area is zoned for agricultural and industrial use. Cebro is a family owned business that produces frozen vegetables. Cebro constructed the main processing facility in 1993 with all new refrigeration system components. A new cold storage warehouse was constructed in 2008 with new and refurbished refrigeration system components.\n\n\n\nAnhydrous ammonia is used in the facility's two refrigeration systems: the process system and the warehouse system. The process refrigeration system, which is a closed system, contains approximately 17,000 pounds of anhydrous ammonia. The process system provides cooling to the cold storage rooms, a quick freezer, and a plate chiller. The cold rooms are used to store fresh and frozen vegetables. The quick freezer is used for initial vegetable freezing. The plate pre-chiller provides cold water for cleaning and cooling the fresh vegetables. A second refrigeration system, the warehouse system, was constructed in 2008 to provide cooling to a cold storage warehouse built next to the processing facility. The warehouse system has an original charge of 7,500 pounds of ammonia, but is designed to expand to 12,000 pounds of ammonia at a later date.\n\n\n\nThe quantity of ammonia in the process system means that the system falls under the OSHA PSM regulations and as a result, falls under the Program Level 3 regulations of the RMP/CalARP regulations. While the quantity of ammonia in the warehouse system would normally qualify the warehouse system as an EPA Program Level 2 system, Cebro treats both systems as Program Level 3 processes.\n\n\n\nThe RMP regulati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000064181,
      "SummaryText": "ons require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling systems covered by the RMP. Program 3 facilities (and Program 2 facilities) are required to evaluate a Worst-Case Release Scenario (release parameters are defined by the regulations) and an Alternative Release Scenario. The regulations define a Worst-Case Release Scenario as \"...the greatest amount held in a single vessel...released as a gas over 10 minutes.\" An alternative release scenario is identified as a release that is more likely to occur at the facility.\n\n\n\nThis facility has prepared Worst-Case and Alternative Release Scenarios. These are not summarized herein as recommended by EPA, but are presented in the RMP.\n\n\n\nRelease Prevention Program\n\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility. Cebro has incorporated many safety features in the ammonia refrigeration systems to prevent system failures and to mitigate potential releases. The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion. The Cebro ammonia systems are continuously monitored by automated control systems that shutdown components if deviations from normal operating conditions occur. Further, the systems are equipped with pressure relief valves (PRVs) on all pressure vessels and most, if not all, additional locations within the ammonia system where ammonia could become trapped.\n\n\n\nOther safety features at the facility include: \n\n?    emergency shutdown systems\n\n?    component specific safety shutdowns\n\n?    an ammonia leak detection system in all process and warehouse areas that contain ammonia equipment\n\n?    ammonia fire dump systems that can be used to relieve pressure in vessels in either system\n\n?    ammonia pipes are color-coded\n\n?    warehouse system PRVs v"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000064181,
      "SummaryText": "ent to a manifold connected to a water diffusion tank\n\n\n\nIn addition to the physical features of the ammonia refrigeration systems at the facility, Cebro has extensive administrative controls in place to maintain safe operation of the systems. Administrative controls include, but are not limited to, formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lockout/tagout program, a contractor safety program, incident investigation program, mechanical integrity program, management of change program, pre start-up safety review program and an RMP/PSM auditing and inspection program. Written standard operating procedures (SOPs) have been prepared for the ammonia systems at the facility. The SOPs will provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\n\n\n\nCebro is committed to maintaining the mechanical integrity of the ammonia refrigeration systems. A preventive maintenance system is utilized to manage the maintenance of the refrigeration systems. Preventive maintenance at the facility includes shift, daily, weekly, and periodic inspection; calibration; testing; and overhaul of ammonia system equipment. The system is used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating parameters.\n\n\n\nFive-Year Accident History\n\nThe CalARP regulations require a review of the 5-year accident history at the regulated facility. The history must include \"all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\" (19 CCR 2750.9) Cebro assured no reportable release of ammonia had occurred during the past 5 years.\n\n\n\nEmergency Response Program\n\nCebro has written an Emergency Action Plan (E"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000064181,
      "SummaryText": "AP) that covers accidental ammonia releases. Cebro will rely on outside responders from the Newman Fire Department and the Stanislaus County HazMat Team for mitigation of releases. The EAP details the steps for required notification of outside agencies and the public and states that the Cebro Emergency Coordinator will be in charge until such time as an outside responding agency assumes that role. Cebro management will oversee evacuation and remain in control until Newman Fire Department arrives, then Incident Command will be assumed by the senior Newman Fire Department official at the scene. The Newman Fire Department Incident Commander will be responsible for issuing notices for public evacuation and/or sheltering in place, if necessary. Cebro management will be responsible for making initial contact with Newman Fire Department via 9-1-1; Stanislaus County Environmental Management Department; CalOES, federal NRC, and any other agencies that need to be contacted. Cebro will rely on community responders for medical assistance as necessary. Responsibility for cleanup after the release is spelled out in the EAP.\n\n\n\nPlanned Changes to Improve Safety\n\nChanges to improve safety at the facility are ongoing. All of the mitigation measures suggested by the process hazard analysis revalidation team in 2005 have been implemented. A separate process hazard analysis for the warehouse system was held in July 2008. Both PHAs were re-validated in September 2016. The new suggested measures from the 2016 re-validation are being implemented. \n\n\n\nCebro will respond to all suggested mitigation measures promptly. Cebro has established completion schedules for proposed actions. Management responses and support will be consistent with Cebro's commitment to safe and environmentally responsible operations.\n\n\n\nCebro recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility. As such, this document and re"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000064181,
      "SummaryText": "lated attachments and program elements will evolve as Cebro continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community. Cebro will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the RMP/PSM, related attachments, and program elements will be incorporated consistent with Cebro's internal review practices, and Cebro will maintain the most current versions onsite. Thus, the most current version RMP/PSM and related documents and elements maintained onsite may vary slightly from the information in submittals made to EPA and other regulatory agencies.\n\n"
    }
  ]
}