{
  "FacilityID": 1000068698,
  "FacilityName": "PLM Operations, LLC.",
  "FacilityStr1": "2068 Lapham Dr",
  "FacilityStr2": null,
  "FacilityCity": "Modesto",
  "FacilityState": "CA",
  "FacilityZipCode": "95354",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.636831",
  "FacilityLongDecDegs": "-120.960056",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 121754314,
  "ParentCompanyName": "Tropicale Foods, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "PLM Operations, LLC",
  "OperatorStr1": "2068 Lapham Drive",
  "OperatorStr2": null,
  "OperatorCity": "Modesto",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95354",
  "OperatorZipCodeExt": null,
  "FTE": 95,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000238227",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-06-18 00:00:00",
  "SafetyInspectionBy": "Stanislaus County Dept. Env. Resources",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-05-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-04-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-04-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-04-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000086154,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000068698,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000107562,
          "ProcessID": 1000086154,
          "ChemicalID": 56,
          "Quantity": 11100.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000087376,
          "ProcessID": 1000086154,
          "NAICSCode": "31152",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000072792,
              "Process_NAICS_ID": 1000087376,
              "SafetyReviewDate": "2017-11-09 00:00:00",
              "PHA_Date": "2017-11-09 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Human factors, disgruntled employee",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Emergency Pressure Control System, Ammonia diffusion tank",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Process Engineering study found ammonia inventory to be greater than 10,000 lbs.",
              "OpProceduresReviewDate": "2018-03-15 00:00:00",
              "TrainingReviewDate": "2018-03-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-03-15 00:00:00",
              "EquipmentInspectionDate": "2017-11-14 00:00:00",
              "EquipmentTested": "Mechanical Integrity Inspection of process equipment",
              "ChangeMgmtDate": "2018-03-16 00:00:00",
              "ChangeMgmtReviewDate": "2018-03-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2017-08-28 00:00:00",
              "AuditCompletionDate": "2019-02-27 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2017-08-28 00:00:00",
              "HotWorkPermitReviewDate": "2018-03-21 00:00:00",
              "ContractorSafetyReviewDate": "2018-03-21 00:00:00",
              "ContractorSafetyEvalDate": "2018-03-21 00:00:00",
              "CBI_Flag": 0,
              "Description": "PLM Operations,LLC. dba Paleteria La Michoacana (La Michoacana) manages its ammonia refrigeration process according to manufacturers recommendations, industry best practice and Recognized and Generally Accepted Good Engineering Practices (RAGAGEP). The prevention program elements implemented by La Michoacana are designed to prevent releases of Acutely Hazardous Substances (anhydrous ammonia) from being released from the refrigeration process which could result in harm to employees, neighbors and the environment.  ",
              "_chemicals": [
                {
                  "PrimaryKey": 1000090471,
                  "PreventionProgram3ID": 1000072792,
                  "ProcessChemicalID": 1000107562
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000068698,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-03-01 00:00:00",
    "ERTrainingDate": "2017-09-15 00:00:00",
    "CoordinatingAgencyName": "Stanislaus Co HazMat Station 4",
    "CoordinatingAgencyPhone": "2095729554",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "8 CCR 5189, 29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068698,
      "SummaryText": "PLM Operations, LLC dba Paleteria La Michoacana, Modesto, California Facility (La Michoacana) is located at 2068 Lapham Drive, Modesto, California, approximately 50 yards south of State Highway 132 (Yosemite Boulevard) and is approximately 300 yards west of Mitchell Road. The Facility produces and stores ice cream products. Anhydrous ammonia is used in the refrigeration systems at the Facility. La Michoacana has developed a California Accidental Release Prevention (CalARP) Program in general accordance with the requirements of California Health & Safety Code, Title 19, Division 2, Chapter 4, and Federal EPA requirements, 40 CFR Part 68 Risk Management Plan (RMP), and federal OSHA Process Safety Management (PSM) 29 CFR 1910.119 and California OSHA 8 CCR 5189 to enhance already existing anhydrous ammonia safety and emergency action programs. Paleteria La Michoacana was purchased by PLM Operations, LLC in 2017. A new management team was hired after the company transfer to PLM Operations, LLC. La Michoacana has been committed to worker and public safety through investment in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the ammonia refrigeration systems. La Michoacana policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. La Michoacana will rely on support services provided by the local fire department and the Stanislaus County Hazardous Materials Response team in the unlikely event that a chemical release does occur at the Facility.\n\n\n\nProcess Descriptions\n\nLa Michoacana has two anhydrous ammonia refrigeration systems at the Facility. The two ammonia refrigeration systems are identified as follows: The Versaline System and the Plant System, which is a remodeled and expanded two-pressure system that will serve a majority of the Facility's cooling needs. The Versaline System and the Plant System are shown separately in the CalARP Registration Form. Howe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068698,
      "SummaryText": "ver, the two systems are treated as one process in this submission. An ammonia leak detection system and an ammonia diffusion tank are ancillary systems that support the process.\n\n\n\nThe Versaline System, has been reduced in charge size to 1,500 pounds of ammonia and only serves a brine cooling system. The recirculator package, high pressure receiver, two Vilter compressors and all evaporator coolers from Freezers 1 & 2 and the +34-degree cold box that were originally a part of this system have either been removed or disconnected from the Versaline System and connected to Plant System.\n\n\n\nThe Versaline System is composed of the following key components:\n\n&#159;    1 Condenser\n\n&#159;    1 Control Pressure Receiver\n\n&#159;    1 Oil Pot\n\n&#159;    1 FES Compressor \n\n&#159;    1 Chiller Evaporator w/Accumulator Vessel\n\n&#159;    1 Liquid Transfer Vessel\n\n\n\nThe Versaline System operation cycle begins at the control-pressure receiver where liquid ammonia is fed to the chiller evaporator. At this point, the ammonia flashes down to saturation temperature, then is pumped from the chiller evaporator where it absorbs heat from the brine. Vapor is returned to the compressor and compressed and the pressure is increased to condensing pressure. The superheated compressor discharge travels through the evaporative condenser where the ammonia gas gives up its heat and is condensed to a liquid and returned to the control-pressure receiver to begin the cycle once again.\n\n \n\nThe Plant System has two different operating pressures with an estimated charge of 13,300 pounds. One pressure is referred to as the medium temperature at +20 degrees F, which serves both air handlers on the roof and the +34-degree cold box. The second operating pressure (-50 degrees F) serves the two (-15 degrees) freezers for product storage, four ice cream freezers, and one spiral quick freeze tunnel. The Plant System is composed of the following key components:\n\n&#159;    1- Condenser BAC Model VC2-887\n\n&#159;    1- High Pressure Recei"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068698,
      "SummaryText": "ver 60\" x 12'\n\n&#159;    1- Oil Pot 8.625\" x 36\"\n\n&#159;    1- 600 HP Compressor [low temp] Model N250-VMD-Y\n\n&#159;    1- 250 HP FES Retrofit SN 95118101, 2/27/94 (glycol system)\n\n&#159;    4- Cherry Burrell Ice Cream Freezers\n\n&#159;    1- Air Handler Versaline Room (North) Accuair Model #AA-20-99\n\n&#159;    1- Air Handler Vitaline Room (South) Accuair Model #AA-05-95\n\n&#159;    1- Diffusion Tank 10' x 20' 10,184 Gallons\n\n&#159;    1- Dual Temp Screw Compressor Package 200 HP/300 HP Model #420B-200/175-300 HP\n\n&#159;    1- Spiral Freezer with 4 Evaporator Coils\n\n&#159;    1- Medium Temp Recirculator (Existing) 42\" x 10'\n\n&#159;    1- Low Temp Recirculator (New) Morfab Model #MRP-54V 54\" x 12'\n\n&#159;    1- Evaporator Coil +34 Degree Cold Box EV-8 Krack\n\n&#159;    2- Ammonia Pumps (low temp) Teikoku #R42-316F4AM-0506TI-E\n\n&#159;    1- Ammonia Pump (medium temp) Cornell with Baldor motor #A15087G-55\n\n\n\nThe Plant System operating cycle begins with the high-pressure receiver where the liquid is fed into the medium-temperature recirculator. At this point, the ammonia flashes down to saturation temperature, then is pumped to the low-temperature recirculator, and the +34 degrees cold box evaporator coil, two air handlers on the roof, and four Cherry Burrell Freezers where it absorbs heat. Vapor is returned to the compressor where it is compressed and the pressure is increased to condensing pressure. The superheated compressor discharge travels through the evaporative condenser where the ammonia gas gives up its heat and is condensed to a liquid and returned to the high-pressure receiver to begin the cycle once again.\n\n\n\nLiquid ammonia from the medium-temperature recirculator is fed into the low-temperature recirculator by a solenoid valve controlled by a level controller. Within the low-temperature recirculator at this point, the ammonia flashes down to a colder saturation temperature, then is pumped to the spiral freezer, and the two  15-degree storage freezers where it absorbs heat. Vapor is returned to the co"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000068698,
      "SummaryText": "mpressor where it is compressed and the pressure is increased to condensing pressure. The superheated compressor discharge travels through the evaporative condenser where the ammonia gas gives up its heat and is condensed to a liquid and returned to the high-pressure receiver to begin the cycle once again.\n\n\n\nHazard Assessment Summary\n\nThe CalARP and federal RMP regulations require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling systems covered by the CalARP/RMP Programs. Facilities are required to evaluate a worst-case release scenario (release parameters are defined by the regulations) and an alternative release scenario. The regulations define a worst-case release scenario as \"...the greatest amount held in a single vessel...released as a gas over 10 minutes.\" An alternative release scenario is identified as a release that is more likely to occur at the Facility. An alternative release scenario must be evaluated for each covered process. Therefore, since the two systems are considered to be one process, only one alternative release scenario is required. This Facility has prepared worst-case and alternative release scenarios. These are not summarized herein as recommended by EPA, but are presented in the CalARP/RMP Program.\n\n\n\nFive-Year Accident History\n\nThere have been no reportable releases of ammonia at the La Michoacana Facility in the past 5 years. \n\n\n\nPrevention Program Elements \n\nAs part of the implementation of this CalARP/RMP Program, key Prevention Program elements were implemented by La Michoacana to manage process safety issues associated with the use of ammonia for refrigeration. In addition, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed. The CalARP/RMP Prevention Program elements include the following:\n\n&#159;    Management System\n\n&#159;    Offsite Consequence Analysis\n\n&#159;    Five Year Accident History\n\n&#159"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000068698,
      "SummaryText": ";    Process Safety Information\n\n&#159;    Process Hazard Analysis\n\n&#159;    Operating Procedures\n\n&#159;    Training Programs\n\n&#159;    Mechanical Integrity\n\n&#159;    Management of Change\n\n&#159;    Pre-startup Safety Review\n\n&#159;    Compliance Audits\n\n&#159;    Incident Investigation\n\n&#159;    Employee Participation\n\n&#159;    Hot Work Permits\n\n&#159;    Contractor Safety\n\n&#159;    Emergency Planning and Response\n\n&#159;    Trade Secrets (if applicable)\n\n\n\nEmergency Action (Response) Program \n\nLa Michoacana does not have trained emergency response personnel onsite and will rely on support services provided by the local fire department and the Stanislaus County Hazardous Materials Response team in the unlikely event that a chemical release does occur at the Facility. As part of the implementation of this CalARP/RMP/PSM Program, an Emergency Evacuation Plan was created as an emergency action plan for the La Michoacana facilities; the employees' first-response will be to evacuate the buildings. \n\n\n\nPlanned Changes to Improve Safety\n\nLa Michoacana performed a Hazard Review/Process Hazard Analysis (PHA) in July 2009, 2015 and as a due diligence effort in 2017 after a change of ownership, and prepared a list of suggested safety improvements and mitigation measures. La Michoacana will respond to all suggested mitigation measures promptly and has established completion schedules for proposed actions in accordance to the 2 ?-year time frame set forth in the January 1, 2015, CalARP guidelines or as negotiated with a representative of Stanislaus County Department of Environmental Resources (DER).\n\nAny outstanding recommendations from these studies will have been implemented or are under consideration for implementation.\n\n\n\nManagement responses and support will be consistent with La Michoacana's commitment to safe and environmentally responsible operations.\n\n\n\nLa Michoacana recognizes that the CalARP/RMP/PSM Program is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling op"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000068698,
      "SummaryText": "erations at its Facility. As such, this document and related attachments and program elements will evolve as La Michoacana continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community. La Michoacana will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the CalARP/RMP/PSM Programs, related attachments, and program elements will be incorporated consistent with La Michoacana's internal review practices, and La Michoacana will maintain the most current versions onsite. Thus, the most current version of the CalARP/RMP/PSM Programs and related documents and elements maintained onsite may vary slightly from the information in submittals made to regulatory agencies.\n\n\n\n"
    }
  ]
}