{
  "FacilityID": 1000045944,
  "FacilityName": "Target FDC T-3893",
  "FacilityStr1": "6111 W. Washington Street",
  "FacilityStr2": null,
  "FacilityCity": "Phoenix",
  "FacilityState": "AZ",
  "FacilityZipCode": "85043",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.446944",
  "FacilityLongDecDegs": "-112.194722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "safety@target.com",
  "FacilityDUNS": 6961411,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Target Corporation",
  "OperatorStr1": "1000 Nicollet Mall TPN-1300",
  "OperatorStr2": "Attn: Risk Management",
  "OperatorCity": "Minneapolis",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55403",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000188968",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-04-02 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-08-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-08-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-08-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-08-14 00:00:00",
  "DeRegistrationEffectiveDate": "2016-09-26 00:00:00",
  "AnniversaryDate": "2019-08-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 33.446944,
  "FRS_Long": -112.194722,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 1000057115,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000045944,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000069779,
          "ProcessID": 1000057115,
          "ChemicalID": 56,
          "Quantity": 23920.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000058058,
          "ProcessID": 1000057115,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000047604,
              "Process_NAICS_ID": 1000058058,
              "SafetyReviewDate": "2012-08-30 00:00:00",
              "PHA_Date": "2012-09-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-04-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Isolation Valves, Dilution Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-07-30 00:00:00",
              "TrainingReviewDate": "2012-05-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Industrial Refrigeration Consortium",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-09-11 00:00:00",
              "EquipmentInspectionDate": "2012-04-27 00:00:00",
              "EquipmentTested": "Compressor, Dilution Tank",
              "ChangeMgmtDate": "2012-08-14 00:00:00",
              "ChangeMgmtReviewDate": "2012-07-30 00:00:00",
              "PreStartupReviewDate": "2012-05-06 00:00:00",
              "ComplianceAuditDate": "2012-07-30 00:00:00",
              "AuditCompletionDate": "2012-11-01 00:00:00",
              "IncidentInvestigationDate": "2012-08-01 00:00:00",
              "InvestigationChangeDate": "2012-08-28 00:00:00",
              "ParticipationPlansReviewDate": "2012-07-30 00:00:00",
              "HotWorkPermitReviewDate": "2012-09-20 00:00:00",
              "ContractorSafetyReviewDate": "2012-07-30 00:00:00",
              "ContractorSafetyEvalDate": "2012-09-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000057928,
                  "PreventionProgram3ID": 1000047604,
                  "ProcessChemicalID": 1000069779
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000045944,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-08-01 00:00:00",
    "ERTrainingDate": "2012-08-01 00:00:00",
    "CoordinatingAgencyName": "Phoenix Fire Department",
    "CoordinatingAgencyPhone": "6025346559",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 1000045944,
      "SummaryText": "an accidental release of ammonia occur.\r\n\r\n4. Five-year Accident History\r\n\r\nThis is the initial RMP submittal after the change in operating entities.     \r\n\r\n5. Emergency Action Plan\r\n\r\nAn Emergency Action Plan PSM Guideline is in place to identify specific procedures implemented in the event of various emergencies, including an ammonia release.  The Emergency Action Plan addresses adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  \r\n\r\n6. Planned Changes to Improve Safety\r\nMany elements of the Process Safety Management have been utilized as part of the facility's transition process and the operational transition.  As identified in this document, mechanical integrity checklists, outstanding construction issues, missing information, and process hazard analysis recommendations have been generated to minimize the risk of injury or accidental release.\r\nIt is intended that the new PSM and RMP programs implemented for the facility drive a proactive approach that improves safety and refrigerant release prevention, utilizing constant review processes of operations and activities, to assure a safe environment for team members and the community of Phoenix."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045944,
      "SummaryText": "icability of the previous operator's Process Safety Management Plan (PSM) and Risk Management Plan (RMP) documentation.  Target found it to be incomplete, inadequate and not appropriate for compliance of the new operating entities. SUPERVALU in partnership with Target established new PSM and RMP programs for the facility. Upon announcement of the dissolution of partnership with SUPERVALU in July 2011, a team of Target team members specializing in PSM and refrigeration reviewed the existing program and outlined a number of improvements to be completed by both Target and SUPERVALU team members. Target assumed building operations on September 18, 2011 under a new Process Safety Management Plan in accordance to all federal, local, and state regulations.\r\n\r\nOn August 15, 2014, Target ceased distribution operations within the cold storage facility. Alarm systems and security remain in place. Daily refrigeration operations and mechanical integrity operations are conducted by a third party refrigeration vendor, APEX. Target continues oversight of all PSM and emergency response.\r\n\r\n1. Accidental Release Prevention and Emergency Response Policies\r\nTarget recognizes that accidents involving the ammonia refrigeration system and other equipment is an ever present risk to the health of team members and the community. Target is committed to safety at every level.  Target's prevention solutions include both technology as well as an active business unit that is qualified to monitor and manage the refrigeration and PSM program. \r\nThe revised Process Safety Management (PSM) program and Risk Management Plan (RMP)are living documents, defining the administrative and operational processes to be utilized during and after the facility's turnover, September 18, 2011.  Target also reserves the right to modify and adapt its PSM and RMP plans as appropriate to address changes in our business processes, as well as things deemed ineffective. The overall intent of these programs is to minimize or"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045944,
      "SummaryText": "eliminate the following potential threats for achieving a safe work place and zero refrigerant releases:\r\n-\tHuman error in operating or maintaining ammonia refrigeration systems. \r\n-\tHuman error when working around or near ammonia refrigeration system components.\r\n-\tLack of knowledge regarding ammonia refrigeration systems and their inherent hazards.\r\n-\tInappropriate response to incidents involving ammonia refrigeration systems.\r\n-\tUnanticipated mechanical failures associated with refrigeration system components.\r\n-\tUnsafe situations inadvertently created by multiple changes over time to ammonia refrigeration systems and other facility equipment or operations which may impact the refrigeration systems.\r\n\r\nThe PSM Program serves as a reference manual to provide building team members specific procedures for implementing the program.  In general, element guidelines describe the following:\r\n-\tFunctions of individual elements.\r\n-\tRepeatable processes to be followed.\r\n-\tUtilization of employee resources.\r\n-\tContingency plans for emergencies.\r\n-\tMeasures to be used for evaluating the effectiveness of the program.\r\n-\tMethod to evaluate risk associated with ammonia refrigeration systems.\r\n-\tMaintenance and update of PSM elements.\r\n-\tProvisions for feedback and continuous improvement.\r\nThe program is complex and has been developed by integrating facility safety programs with maintenance management, facility operations, and human resources management.\r\nAt the Phoenix Food Distribution Center T-3893, Target is committed to employee, public, and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program, covering design, installation, operating procedures, maintenance, and employee training associated with our regulated process.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, Target has proactively partnered with Phoenix Fire"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000045944,
      "SummaryText": "out by previous facility operator, SUPERVALU in April 2011.\r\n\r\nIncident Investigation:\r\nNew Incident Investigation PSM Guideline is in place describing processes to promptly investigate any incident that has resulted in, or could reasonably result in, an unintentional release of ammonia.  These investigations are to identify situations leading to incidents, as well as corrective actions implemented to prevent reoccurring and future releases, with reports retained for a minimum of five (5) years.\r\n \r\nEmployee Participation:\r\nAn Employee (team member) Participation PSM Guideline is in place to describe team member utilization in the development and implementation of the facility's PSM and RMP programs.  In addition, the guideline identifies new team member orientation; training and communication processes to be followed for educating team members about the hazards associated with anhydrous ammonia and safety programs in place to mitigate risks of injury and accidental release.  This includes processes for making all PSM and RMP information related to implementation, including Process Hazard Analyses (PHA) information available to team members.\r\nTeam members are encouraged to report unsafe conditions, express their views concerning accident prevention issues and to recommend improvements. \r\n\r\nContractors:\r\nA Contractors PSM Guideline is in place for contractors utilized to conduct specialized maintenance and/or construction activities related to the ammonia refrigeration system.  \r\nThe new Contractors Guideline mandates a pre-qualification process which includes evaluation of contractor safety records, documented understanding of the facility's work rules, and commitment to ongoing training of their employees, as related to the hazards associated with ammonia refrigeration systems.  Target is committed to continually informing contractors regarding known potential hazards related to work with ammonia systems and the facilities procedures for emergency response should"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045944,
      "SummaryText": "Department to insure that properly trained and equipped hazmat responders are available to control and mitigate the effects of a release.   We also will coordinate such events with Maricopa County Local Emergency Planning Committee for additional support.\r\n\r\n2. Stationary Source and Regulated Substances Handled\r\nThis facility is a refrigerated warehouse facility.  The vast majority of products stored are refrigerated foods for human consumption and inherently pose no known environmental or safety risks.  The RMP regulated substance present at the facility is anhydrous ammonia, utilized as refrigerant in closed-loop refrigeration systems.  The facility is serviced by 2 independent refrigeration systems, a Perishable Building system, total charge inventory of 9,920 lbs and the Freezer Building system, total charge inventory of 12,000 pounds.  The refrigeration systems do not interconnect nor are their major storage vessels rest in close proximity to one another.  As a result, it is unlikely that the charge of both systems could be discharged without a disaster scenario which would encompass the entire site such as a natural disaster or well planned act of aggression.\r\nIn a worst case release scenario involving the entire site, release of total charge from both refrigeration systems needs to be considered for the purposes of this RMP.  The combined total inventory of anhydrous ammonia is 21,920 pounds.  \r\nDue to the  and characteristics of the building's ammonia systems as well as Process Safety Management (PSM) applicability, this building is covered under Program 3 of the RMP regulations.\r\n\r\n3. General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\nNecessary processes to comply with the accidental release prevention requirements set out under 40 CFR Part 68 has been implemented and is ongoing.  The facility is also subject to OSHA's PSM standard under 29 CFR 1910.119, as well as the EPCRA Section 302 and 311/312 notification/reporting r"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000045944,
      "SummaryText": "ce in all relevant operating procedures.  Refresher training specified to take place at a minimum every three (3) years and more frequently as needed.\r\n\r\nMechanical Integrity:\r\nThe Mechanical Integrity PSM Guideline is in place.  Maintenance operations are being carried out by qualified personnel with previous training in ammonia refrigeration system maintenance practices.  \r\n\r\nAny equipment deficiencies identified by ongoing maintenance checks are corrected in a safe and timely manner.\r\nA checklist of pre-existing Mechanical Integrity issues, not addressed as part of the building owner renovations, has been compiled and planning for corrective actions is in process. \r\n\r\nManagement of Change:\r\nThe Management of Change PSM Guideline is in place.  The guideline defines procedures that are in place to manage changes in ammonia systems technology, equipment, and procedures.  Process operators, maintenance personnel, or any other employee whose job tasks are affected by an ammonia systems modification are promptly made aware of and offered training to deal with the modification\r\n\r\nPre-Startup Reviews:\r\nThe Pre-Startup Review PSM Guideline is in place, which stipulates that Pre-start up safety reviews are conducted any time the ammonia refrigeration system or any of its components are opened to atmosphere for repairs, tie-ins, or modifications.  These reviews are conducted to confirm that construction is complete, documentations still accurate, operating procedures in place, training is complete and safety pre-cautions are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits:\r\nA Compliance Audit PSM Guideline is in place specifying the process and frequency for evaluation of PSM and RMP program effectiveness.  These audits are to be carried out at least every three (3) years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  \r\nThe last known and documented compliance audit carried"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045944,
      "SummaryText": "Target Food Distribution Center T-3893\r\nPhoenix, Arizona  85043\r\nRisk Management Plan for Anhydrous Ammonia (21,920 LBS) \r\n\r\nExecutive Summary\r\n\r\nThis facility, located at 6111 West Washington Street, Phoenix, Arizona is a leased refrigerated warehousing facility owned by KTR Arizona LLC and operated by Target Corporation for the storage and distribution of perishable and frozen food products.  Target assumed a partnership with SUPERVALU in March 2007 during which time SUPERVALU was responsible for day to day activities of the building. On September 18, 2011 Target assumed control of operations and is responsible for the daily maintenance and operations of the building.\r\nThe facility was built in 3 phases, 1977, 1983 and 1995 for Fry's Foods Inc, a division of the Kroger Company.  The facility was most recently operated by Atlas Cold Storage Holdings until May 2006.  The facility was then bought under a purchase option from Dillon Real Estate Company (a subsidiary of the Kroger Companies) by Atlas Cold Storage Holdings on May 12, 2006 and sold on the same day to KTR Arizona LLC. KTR initiated and contracted for a number of renovation projects impacting facility refrigeration systems between September 2006 and March 2007 as part of a lease agreement with Target Corporation to prepare the facility for current operations.  These projects included the following:\r\n-\tRenovation of the Perishable Building Engine Room. \r\n-\tModifications to refrigeration piping and evaporators north of Perishable Building Engine Room.\r\n-\tModifications to refrigeration piping and evaporators south of Perishable Building Engine Room. \r\n-\tRemoval of ice making equipment from the Freezer Building.\r\n-\tReplacement of the Freezer Building refrigeration system evaporative condensers.\r\n-\tMajor Compressor overhauls and repairs for the Freezer Building refrigeration system.\r\n\r\nDuring the time starting approximately November 2006, when KTR Arizona LLC was renovating the facility, Target audited the appl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000045944,
      "SummaryText": "equirements.  The following sections briefly describe elements and status for accidental release prevention programs in place at the facility.\r\n\r\nProcess Safety Information (PSI):\r\nThe Process Safety Information Guideline and inventory list of necessary documents are in place.  Available PSI documentation from previous operators and construction documents were consolidated along with P&IDs, 4 generations of construction drawing and specifications, ammonia safety data, and equipment manuals.  All documentation can be found at the building in the care of the Senior Facility Operations Group Leader.   This information will be revised as the ammonia refrigeration system is updated or altered.  This data contains detailed safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the ammonia refrigeration system.\r\n\r\nProcess Hazard Analysis (PHA):\r\nThe Process Hazard Analysis PSM Guideline and full PHA study has been completed as part of operational transition from SUPERVALU to Target. The methodology used was the What If Scenarios.  Representatives from both Target and SUPERVALU, with expertise in refrigeration engineering and operations participated in the studies.\r\nThe adopted PHA Guideline calls for studies to be reevaluated at a minimum of every five (5) years and any findings related to process hazard analysis studies to be addressed in a timely manner.  \r\n\r\nOperating Procedures:\r\nAn Operating Procedures PSM Guideline is in place which defines the processes for drafting, validating, and maintaining written operating procedures, including annual reviews.  Safe Operating Procedures are in place that addresses necessary modes of operation including startup, normal operations, emergency operations, normal shutdown, emergency shutdown, and pump out.\r\n\r\nTraining -\r\nNew Training PSM Guideline was adopted, which defines training programs for employees working with the ammonia refrigeration systems to increase competen"
    }
  ]
}