{
  "FacilityID": 1000036339,
  "FacilityName": "East Bank Wastewater Treatment Plant",
  "FacilityStr1": "6501 Florida Avenue",
  "FacilityStr2": null,
  "FacilityCity": "New Orleans",
  "FacilityState": "LA",
  "FacilityZipCode": "70117",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22071",
  "LEPC": "New Orleans Office of Emergenc",
  "FacilityLatDecDegs": "29.976667",
  "FacilityLongDecDegs": "-089.997222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.swbnola.org",
  "FacilityEmailAddress": "awilson2@swbno.org",
  "FacilityDUNS": null,
  "ParentCompanyName": "Sewerage & Water Board of New Orleans",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Sewerage & Water Board of New Orl",
  "OperatorStr1": "625 St. Joseph Street",
  "OperatorStr2": null,
  "OperatorCity": "New Orleans",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70165",
  "OperatorZipCodeExt": null,
  "FTE": 31,
  "OtherEPAFacilityID": "LAR000054866",
  "EPAFacilityID": "100000031725",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-07-18 00:00:00",
  "SafetyInspectionBy": "Olin Chlor Alkali Products",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-09-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-09-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-09-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-11-07 00:00:00",
  "DeRegistrationEffectiveDate": "2017-10-13 00:00:00",
  "AnniversaryDate": "2018-09-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 29.97413,
  "FRS_Long": -89.99982,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044527,
      "AltID": "Sewage Treatment Facilit",
      "FacilityID": 1000036339,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000053773,
          "ProcessID": 1000044527,
          "ChemicalID": 62,
          "Quantity": 225000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000044949,
          "ProcessID": 1000044527,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000038737,
              "Process_NAICS_ID": 1000044949,
              "SafetyReviewDate": "2013-08-14 00:00:00",
              "PHA_Date": "2013-08-14 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Change in chlorine container from 55-ton rail car to 90-ton rail car",
              "OpProceduresReviewDate": "2013-09-09 00:00:00",
              "TrainingReviewDate": "2013-09-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-08-13 00:00:00",
              "EquipmentInspectionDate": "2013-06-28 00:00:00",
              "EquipmentTested": "Chlorine Sensors",
              "ChangeMgmtDate": "2013-09-16 00:00:00",
              "ChangeMgmtReviewDate": "2013-09-09 00:00:00",
              "PreStartupReviewDate": "2013-09-09 00:00:00",
              "ComplianceAuditDate": "2013-08-20 00:00:00",
              "AuditCompletionDate": "2013-09-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-08-13 00:00:00",
              "HotWorkPermitReviewDate": "2013-08-13 00:00:00",
              "ContractorSafetyReviewDate": "2013-08-13 00:00:00",
              "ContractorSafetyEvalDate": "2013-08-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000046061,
                  "PreventionProgram3ID": 1000038737,
                  "ProcessChemicalID": 1000053773
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000036339,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-08-20 00:00:00",
    "ERTrainingDate": "2013-09-11 00:00:00",
    "CoordinatingAgencyName": "NOFD, Hazardous Materials Unit",
    "CoordinatingAgencyPhone": "5042829181",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036339,
      "SummaryText": "Introduction\r\n\r\nThe Sewerage and Water Board of New Orleans (S&WB), in conjunction with its private operator, Veolia Water South (VWS), has complied with the requirements of Section 112 (r) of the 1990 Clean Air Act Amendments for the S&WB East Bank Sewage Treatment Plant (EBSTP). These requirements included the original creation of a Risk Management Plan (RMP) which was submitted by June 1999 to the United States Environmental Protection Agency (EPA). An updated RMP is required to be submitted prior to June 18, 2014.\r\n\r\nThis Executive Summary reflects the update to the RMP for the EBSTP, conducted in the third quarter of 2013. The update serves to provide resubmission due to the change in the chlorine storage container from 55-ton rail car to 90-ton rail car. This resubmission is being conducted to meet requirements of revised PHA/Hazard Review due to revised OCA due to change in the storage container as required by 40 CFR 68.190(b)(6).  This resubmission provides update to the Hazard Assessment, Process Hazards analysis, review and/or revisions to operating procedures, maintenance procedures, equipment inspections, management of change procedures, pre-startup review, compliance audit, employee participation plan, hot work permit procedures and contractor safety performance.  These procedures include the requirements that emergency response contacts are verified every thirty days and that reportable accidents shall be sufficient cause to resubmit another RMP update within six months of the incident. A general summary of the findings of the RMP update follows.\r\n\r\nAccidental Release Prevention Policies\r\n\r\nBoth the S&WB and VWS are committed to the safe operation of the EBSTP. The EBSTP utilizes chlorine gas at this facility in sufficient quantities to warrant submission of a RMP. The practices of the operators of the EBSTP include provisions that address all aspects of the Accidental Release Prevention Program prescribed by EPA. To facilitate protection of its employ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036339,
      "SummaryText": "ees and the public, there are chlorine gas sensor alarms at the storage area and within the chlorinator room that will alert operators of a leak. Also, routine review of standard operating procedures and mechanical integrity programs help to confirm that the chlorine system is operated and maintained in a safe manner. VWS provides regularly updated formal training for all operators and maintenance personnel focusing on chlorine safety. The Hazardous Material (HAZMAT) Team of the New Orleans Fire Department (NOFD) is the first responder and conducts site visits of the plant to familiarize themselves with the chlorine system. \r\n\r\nEmergency Response Policy\r\n\r\nOperators at the EBSTP will not respond to leaks beyond their ability to control the release through the use of valves. In the event of such a release, plant personnel will evacuate the plant with the exception of the plant manager or chief operator who will remain on-site to activate the City of New Orleans emergency system. In accordance with the EBSTP Emergency Response Plan, it is anticipated that the first responders will be the NOFD. They will establish a safe perimeter and begin public notification until the HAZMAT Team of the NOFD arrives to contain the release. Built into the EBSTP Emergency Response Plan are mechanisms to notify the St. Bernard Parish Fire Department and schools located within the radius defined under the release scenarios. This EBSTP is included in the Local Emergency Planning CommitteeA¿s community emergency response plan.\r\n\r\nFacility Description\r\n\r\nThe EBSTP is a 122 million gallons per day pure oxygen activated sludge wastewater treatment plant that serves the entire East Bank of Orleans Parish. Treated effluent from the plant is discharged to the Mississippi River. Disinfection of the effluent is accomplished by injecting chlorine into the effluent channel. Chlorine is stored in a 90-ton rail car, supplying approximately a 60 day supply of chlorine, while achieving redundancy and ad"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036339,
      "SummaryText": "equacy of inventory to ensure chlorine usage is not interrupted.  On September 16, 2013, the facility received a 90-ton rail car.  A 90-ton rail car will be scheduled to arrive when the existing rail car is equal to or less than 25% full, 45,000 pounds.  This will ensure the amount of chlorine stored on site will not exceed 225,000 pounds.   The plant is owned by the S&WB and is operated and maintained by a private contractor, VWS. Located on the East Bank of the Mississippi River in Orleans Parish, the facility is close to the St. Bernard Parish line and an closed landfill to the east and is surrounded by undeveloped wetlands on the north and west sides. A residential neighborhood lies to the south. To minimize the threat of flooding from storm surges, the entire plant is protected by a levee over 8 feet high.  The only entrance road into the plant is from the south, however emergency pedestrian exits leading over the levee exist at each of the cardinal compass points. Plant access is monitored and restricted to business purposes. The EBSTP incinerates its sludge on site prior to land disposal at an offsite landfill.\r\n\r\nWorst Case Release Scenario\r\n\r\nA worst case release scenario was developed for this update. Based on this review, the worse case scenario changed from the 2004 update.  The change from a 55-ton rail car to a 90-ton rail car increased the toxic endpoint from 9.9 miles to 14.0 miles.  \r\n\r\nAlternative Release Scenario\r\n\r\nAn alternative case release scenario was also developed for this update. Based on this review, no changes were made to the alternate case release scenario from the 2004 update.\r\n\r\nThe Five-Year Accident History\r\n\r\nThere have been no accidents, as defined in 40 CFR 68.42, at the EBSTP in the last five (5) years.  New policies have been developed by VWS that will cause a resubmission of the RMP within six months of the occurrence of a reportable chlorine release.\r\n\r\nThe Prevention Program\r\n\r\nThe EBSTP is subject to the OSHA Process Safet"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036339,
      "SummaryText": "y Management (PSM) rule. The PSM incorporates several elements that aid in operating a safe plant and in reducing the possibility for offsite releases. Among the critical elements that have been recently reviewed and updated are the Standard Operating Procedures (SOPs), Mechanical Integrity Program, and Training Program. These three programs have a significant impact in the continued safe operation of the chlorine system.\r\n\r\nThe Emergency Response Program\r\n\r\nAs described above, personnel at the EBSTP will not act as responders to uncontrollable releases of chlorine. Rather, the EBSTP Emergency Action Plan will be implemented which notifies the City's HAZMAT Team who will contain chlorine releases beyond the ability of plant personnel. The EBSTP is included in the emergency response plan by the City of New Orleans Office of Emergency Preparedness. New policies have been developed by VWS that will cause a correction submission for the RMP for any emergency contact phone numbers that change, to be provided within 30 days of the contact change. \r\n\r\nPlanned Changes to Improve Safety\r\n\r\nThe EBSTP currently utilizes gaseous chlorine as a disinfectant. Recognizing the obvious safety hazards and accidental release consequences based on long years of experience in working with gaseous chlorine and as identified by the RMP, the S&WB has investigated a number of possible solutions to these problems.\r\n\r\nAt the time the original RMP was developed, the S&WB did not have specific first-hand knowledge of, or experience with alternative disinfection processes, their operation or use histories. In fact, many processes now becoming more commonplace were refined and made more practical as a result of RMP requirements. Since the initial RMP was developed the S&WB has investigated a number of commercially available on-site gaseous chlorine and sodium hypochlorite generation processes, from large to small volume generation. These were compared to the cost and practicality of providing encl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036339,
      "SummaryText": "osures and vapor scrubbers for on-site gaseous chlorine storage and use. \r\n\r\nThe S&WB is also reviewing the possibility of the installation of a ferrate system as provided by Ferrate Treatment Technologies, LLC as an alternate form of disinfection.  Ferrate provides disinfection and there is scientific evidence that ferrate can effectively oxidize and remove disrupting chemicals (EDCs) and pharmeceuticals and personal care products (PPCPs) from wastewater.  This will be used as an alternative method of disinfection for the pilot project assoicated with the discharge to the wetland assimilation project.  \r\n\r\nAt this time, the S&WB EBSTP will continue to use gaseous chlorine as the primary disinfectant."
    }
  ]
}