{
  "FacilityID": 1000061678,
  "FacilityName": "Monogram Prepared Meats",
  "FacilityStr1": "1231 870th Street",
  "FacilityStr2": null,
  "FacilityCity": "Harlan",
  "FacilityState": "IA",
  "FacilityZipCode": "51537",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19165",
  "LEPC": "Shelby County LEPC",
  "FacilityLatDecDegs": "41.625215",
  "FacilityLongDecDegs": "-95.332714",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.monogramfoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79204254,
  "ParentCompanyName": "Monogram Food Solutions",
  "Company2Name": null,
  "CompanyDUNS": 781012005,
  "Company2DUNS": 0,
  "OperatorName": "Monogram Prepared Meats",
  "OperatorStr1": "1231 870th Street",
  "OperatorStr2": null,
  "OperatorCity": "Harlan",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51537",
  "OperatorZipCodeExt": null,
  "RMPContact": "Paul Simpson",
  "RMPTitle": "Environmental Compliance Manager",
  "FTE": 260,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000215359",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-12-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-01-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-01-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-01-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-01-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000077246,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000061678,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000078428,
          "ProcessID": 1000077246,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000095916,
          "ProcessID": 1000077246,
          "ChemicalID": 56,
          "Quantity": 11735.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000595916,
          "ProcessID": 1000077246,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061678,
      "SummaryText": "Monogram Prepared Meats\n\nRefrigeration System Risk Management Program\n\n\n\nExecutive Summary\n\n\n\nThis is to inform all interested persons, including employees that Monogram Prepared Meats is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals, In this way we promote overall plant, worker, and public safety.  These programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.   Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.  Our safety programs are applied to any activity involving hazardous chemicals including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.  \n\n\n\n    Our safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\n\n\n\n    Monogram Prepared Meats is a bacon processing and cooking facility located in Harlan, Iowa.  The facility operates an ammonia refrigeration system to provide cooling and freezing capabilities.  The system is operated as a single stage system divided up into two operating temperatures, -13?F for the low side and +20?F on the high side.  The low side heat loads i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061678,
      "SummaryText": "n the plant originate from freezers and blast chiller. The high side heat loads originate from coolers, chillers, process coolers, and dock cooling.  Pumped liquid flows from the low and high side recirculator vessels then through the coils in the air units where it picks up heat, changing the ammonia from a liquid to a vapor.  The recirculated ammonia vapor is sent from the plant to the recirculators via a common suction header.  High side ammonia gas from the high side recirculator is then fed to the high stage compressors.  Low side ammonia gas from the low side recirculator is fed to the low stage compressors.  During the compression phase in the high and low stage compressors, the temperature of the ammonia gas will rise as the pressure of the ammonia vapor is increased to approximately 150-180 psig. The high-pressure ammonia vapor flows from the high and low stage compressors to a evaporative condensers where heat is removed, turning the gas into a high pressure liquid.  The high-pressure liquid is collected in the high-pressure receiver.  The liquid collected in the high-pressure receivers provides liquid make-up for the recirculator.\n\n\n\n\n\nThe emergency action plan at Monogram Prepared Meats requires all associates to be trained in safe evacuation and notification procedures in cases of actual or drill emergencies. Training shall include escape routes, notification of appropriate response agencies, instructions on activating a building fire alarm system and what should be done after evacuating a building. To aid in the training process evacuation drills are conducted at the facility.  In the case of an emergency, Aaron Long is the maintenance manager and is the Primary Emergency Response Coordinator (ERC). The alternate ERCs are Vic Lovejoy, the Plant Manager and Tony Goetz, Purchasing/Scheduling Director.  Arrangements have been made to coordinate Monogram Prepared Meats  Emergency Action Plan and applicable emergency services with the following local agenci"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061678,
      "SummaryText": "es:\n\n\n\nShelby County LEPC \n\n(712)-755-5160\n\n\n\nHarlan Police Department\n\n(712)-755-5354\n\n\n\nHarlan Fire and Rescue\n\n(712)-755-5151\n\n\n\nUpon discovering an emergency situation, all employees shall immediately notify their lead person, supervisor, the Human Resources Department, the security guard or the Maintenance Department using the Air Horns, phone, PA system, or wireless phones. The lead person or supervisor of the affected area, Human Resources, security guard or maintenance personnel are to contact the Primary ERC. If the Primary ERC is not available, the alternate ERC shall be notified next.  The ERC will determine if evacuation of the plant is the safest course of action and should activate the evacuation alarm if necessary.  If the emergency involves the release of ammonia and a decision is made to evacuate the plant, first determine the assembly area.  The location of the assembly area will be based on the current wind direction and will be upwind of the release area.   An announcement will be made over the PA system informing employees that they are to evacuate the building and where to assemble.  If your immediate contact options cannot be reached, dial 911.  In the event of an evacuation, all employees should proceed to the designated assembly area and await further instructions from their evacuation supervisor. Facility map identifying exit doors, evacuation routes and assembly areas are posted at various locations throughout the facility.  Once everyone has evacuated the facility and arrived at their designated meeting area, a head count must be conducted by the evacuation coordinators to account for missing people, including visitors and/or contractors in his/her area.  A daily crew/employee list shall be maintained for each department within the facility. Ten minutes will be allowed for critical unit operators to shutdown their equipment and reach the designated meeting location before attendance will be reported.  \n\n\n\nMonogram Prepared Meats has not h"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061678,
      "SummaryText": "ad any accidental releases to report since the commissioning of the plant in 2004.\n\n\n\n"
    }
  ]
}