{
  "FacilityID": 1000120073,
  "FacilityName": "Pactiv - Corsicana",
  "FacilityStr1": "4501 E. Highway 31",
  "FacilityStr2": null,
  "FacilityCity": "Corsicana",
  "FacilityState": "TX",
  "FacilityZipCode": "75109",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48349",
  "LEPC": "Navarro County LEPC",
  "FacilityLatDecDegs": "32.104722",
  "FacilityLongDecDegs": "-096.389167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.pactivevergreen.com",
  "FacilityEmailAddress": "charles.howell@pactivevergreen.com",
  "FacilityDUNS": 5211768,
  "ParentCompanyName": "Pactiv LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Pactiv LLC",
  "OperatorStr1": "4501 E. Highway 31",
  "OperatorStr2": null,
  "OperatorCity": "Corsicana",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75109",
  "OperatorZipCodeExt": null,
  "FTE": 525,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000026722",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0-01067",
  "SafetyInspectionDate": "2022-12-08 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2025-03-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2025-03-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2025-03-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2030-03-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 32.103596,
  "FRS_Long": -96.386833,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000149826,
      "AltID": "Blowing Agent Storage",
      "FacilityID": 1000120073,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000187228,
          "ProcessID": 1000149826,
          "ChemicalID": 107,
          "Quantity": 100000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000151418,
          "ProcessID": 1000149826,
          "NAICSCode": "32614",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000127967,
              "Process_NAICS_ID": 1000151418,
              "SafetyReviewDate": "2022-12-07 00:00:00",
              "PHA_Date": "2020-03-10 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-06-16 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Security Gates, Map, checklist",
              "OpProceduresReviewDate": "2022-11-14 00:00:00",
              "TrainingReviewDate": "2022-01-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-03-04 00:00:00",
              "EquipmentInspectionDate": "2022-12-27 00:00:00",
              "EquipmentTested": "weekly visual inspection of entire blowing agent system",
              "ChangeMgmtDate": "2019-12-04 00:00:00",
              "ChangeMgmtReviewDate": "2022-03-02 00:00:00",
              "PreStartupReviewDate": "2022-12-27 00:00:00",
              "ComplianceAuditDate": "2022-12-07 00:00:00",
              "AuditCompletionDate": "2023-03-01 00:00:00",
              "IncidentInvestigationDate": "2019-12-04 00:00:00",
              "InvestigationChangeDate": "2020-06-01 00:00:00",
              "ParticipationPlansReviewDate": "2022-12-07 00:00:00",
              "HotWorkPermitReviewDate": "2022-03-02 00:00:00",
              "ContractorSafetyReviewDate": "2022-12-21 00:00:00",
              "ContractorSafetyEvalDate": "2022-12-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000160286,
                  "PreventionProgram3ID": 1000127967,
                  "ProcessChemicalID": 1000187228
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000120073,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-01-03 00:00:00",
    "ERTrainingDate": "2022-02-28 00:00:00",
    "CoordinatingAgencyName": "City of Corsicana Fire Department",
    "CoordinatingAgencyPhone": "9036544952",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": "No full time LEPC for Navarro County  Local response is Fire Dept.",
    "LocalResponseAgencyCoordination": "Yes",
    "LocalResponseAgencyCoordinationDate": "2024-11-14 00:00:00",
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000120073,
      "SummaryText": "Executive Summary\r\nPactiv Corporation.\r\nRisk Management Plan\r\nCorsicana, TX\r\n\r\n1. Accidental Release Prevention and Emergency Response Policies\r\nWe at Pactiv are strongly committed to employee, public and environmental safety.  This commitment is inherent in a comprehensive accidental release prevention program that covers areas such as design, installation, operation, and maintenance of the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances and to train employees regarding the safe operation of  processes involving regulated substances.  Although such an event is unlikely, employees are trained to react to unplanned releases of regulated substances.  In addition, the plant has coordinated with local and other emergency response organizations which provide highly trained emergency response personnel to help control and lessen the effects of any unplanned release.\r\n\r\n2.The Stationary Source and the Regulated Substances \r\nThe primary manufacturing activity at this plant involves the production of plastic consumer products such as trays that you might find meat or poultry on in a supermarket and foam cups.  We have two substances present at our facility which are regulated by United States Environmental Protection Agency (USEPA) under the Risk Management Program.  These substances are isobutane and pentane; and are referenced in this document by the term \"regulated substance\".  The regulated substances at our facility are used as a foaming agents in the production of polystyrene foam.  These products are also often referred to as \"blowing agents\" or \"expansion agents\" .\r\nThe maximum inventory of the blowing agents exceeds the 10,000 pound threshold for RMP.  Written procedures and high-level alarms prevent overfilling the storage tank.\r\n\r\n3.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\r\nOur facility has taken all the necessary steps to compl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000120073,
      "SummaryText": "y with the accidental release prevention requirements set out under EPA 40 CFR Part 68.  This facility was designed and constructed in accordance with NFPA-58 Standard.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  We also have an air operating permit under Title V of the Clean Air Act. The following sections briefly describe the elements of the release prevention program that are in place at our stationary source.\r\n\r\nProcess Safety Information\r\nPactiv maintains a detailed record of safety information that describes the chemical hazards, operating guidelines and equipment designs associated with the covered process.\r\n\r\nProcess Hazard Analysis\r\nOur facility conducts extensive studies to ensure that hazards associated with our covered process are identified and controlled efficiently.  The approach used to carry out these analyses is a HAZOP process.  The studies are undertaken by a team of qualified personnel with expertise in engineering, process operations and safety and are revalidated at a regular interval of approximately every 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.\r\n\r\nOperating Procedures\r\nFor the purposes of safely conducting activities within our covered process, Pactiv maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily available to operators involved in the processes.\r\n\r\nTraining\r\nPactiv utilizes a detailed training program to ensure that employees who are operating processes using regulated substances are skilled in the handling, operation, and maintenance procedures associated with these covered processes.  Refresher training is provided at least every three years and more frequently as needed.\r\n\r\nMechanical"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000120073,
      "SummaryText": "Integrity\r\nPactiv carries out routine, periodic maintenance inspections and preventive maintenance on covered process equipment to ensure proper operations.  Covered process equipment examined during inspections include but are not limited to pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with training in maintenance practices.  These personnel are provided specialized training as needed.  Any equipment deficiencies identified by the maintenance inspections  are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\nWritten procedures at Pactiv are in place to manage changes in process chemicals, technology, equipment and procedures.  Covered process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of changes and provided training, as needed, to deal with these changes.\r\n\r\nPre-startup Safety Reviews\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Pactiv.  These reviews are conducted to confirm that equipment and procedures are complete and suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\nPactiv conducts audits on a regular basis to determine whether the requirements set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\r\n\r\nIncident Investigation\r\nPactiv promptly investigates any incident that results in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the circumstances leading to the incident as well as any corrective actions to prevent a potential release from re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000120073,
      "SummaryText": "occurring.  Reports are kept for a minimum of 5 years.\r\n\r\nEmployee Participation\r\nPactiv truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  Many employees participate in safety initiatives within the plant.  In addition, our employees have access to all information created as part of our facilities implementation of the RMP rule, including information resulting from process hazard analyses, in particular.\r\n\r\nHot Work \r\nThe facility maintains a hot work program and issues a hot work permit for hot work conducted on or near the covered process.  Hot work is performed by qualified personnel who complete each permit and fulfill its requirements prior to the start of a hot work operation.  These permits are kept on file until the conclusion of the hot work operation.    \r\n\r\nContractors\r\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of the contractor¿s safety performance and program is carried out.  Pactiv has a strict policy of informing contractors of known potential hazards related to the contractors work and the covered process.  Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance occur.\r\n                                                                                                                                                                  \r\n4.  Five-year Accident History\r\nPactiv has an excellent record of preventing accidental releases over the last 5 years.  There has been no accidental release during this period.\r\n\r\n5.  Emergency Response Plan\r\nPactiv's primary emergency response asset is the local Fire Department.  Pactiv has developed a written emergency action plan to deal with minor fires and inci"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000120073,
      "SummaryText": "dental releases of hazardous materials.  The plan includes limited emergency response activities, mainly focusing on prompt notification of local emergency response agencies and the public; emergency evacuations, if necessary; adequate first aid and medical treatment should any be necessary.  Releases of regulated substances are only responded to by on-site Pactiv personnel if incidental.  The plan is promptly updated to reflect any pertinent changes taking place within our covered process.   In addition, emergency response equipment (fire extinguishers, etc) is regularly inspected and serviced. \r\n\r\n6.  Planned Changes to Improve Safety\r\nThis facility has a good safety record.  Our facility demonstrates exemplary occupational safety and health programs and practices which encompass employee involvement, recognition for safe work and continuous hazard identification activities.  To enhance our continuous improvement in occupational safety and health, we conduct general safety meetings and monthly safety committee meetings"
    }
  ]
}