{
  "FacilityID": 1000068604,
  "FacilityName": "Moorhead Water Plant",
  "FacilityStr1": "307 Highway 75 North",
  "FacilityStr2": null,
  "FacilityCity": "Moorhead",
  "FacilityState": "MN",
  "FacilityZipCode": "56560",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27027",
  "LEPC": null,
  "FacilityLatDecDegs": "46.878023",
  "FacilityLongDecDegs": "-096.744574",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "LF",
  "FacilityURL": "www.mpsutility.com",
  "FacilityEmailAddress": "mps@mpsutility.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Moorhead Public Service",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Moorhead Public Service",
  "OperatorStr1": "500 Center Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Moorhead",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56561",
  "OperatorZipCodeExt": "0779",
  "RMPContact": "Kris Knutson",
  "RMPTitle": "Water Division Manager",
  "FTE": 45,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000039424",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-06-05 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-03-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-03-17 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-03-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-03-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 46.87516,
  "FRS_Long": -96.77246,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "100",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000086039,
      "AltID": null,
      "FacilityID": 1000068604,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000087241,
          "ProcessID": 1000086039,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000107391,
          "ProcessID": 1000086039,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000607391,
          "ProcessID": 1000086039,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068604,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThis executive summary is a brief overview of the RMP and the associated policies at the Moorhead Water Treatment Plant, owned and operated by Moorhead Public Service.  It contains all of the information required by Section 68.155 2017.\n\n\n\nRELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe accidental release prevention policies are represented in Sections 2 through 13 of this document. The emergency response policy is represented in Sections 14.  MPS takes an active role in preventing accidental releases at this facility by ensuring that its employees are properly trained in the safe operation and maintenance of processes subject to the Part 68 rule.  They are also trained in the safe handling of all chemicals regulated by the rule.\n\n\n\nIn addition to ensure its employees are adequately trained, MPS works to prevent accidents by providing and revising written procedures for operating its covered processes, as needed, under the rule. Although these procedures in and of themselves should prevent accidental releases, MPS maintains and follows a policy of compliance audits, the goals of which are to determine if existing procedures are adequate and, if they are, to ensure that they are followed.\n\n\n\nMPS has also developed and maintained a risk management policy that contains general safety rules.  The general safety rules fall under Minnesota's Chapter 182 Occupational Safety and Health Act.  The safety and health program is required to meet Minnesota's A Workplace Accident and Incident Reduction (AWAIR) Program. This program covers topics such as personal protection equipment, hazard communications, confined space, respiratory protection, excavation and trenching, lock-out/tag-out, and bloodborne disease exposure control.  Although these general rules do not specifically address the covered processes and their regulated substances, compliance with the general rules will significantly reduce the potential for accidental release of these substan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068604,
      "SummaryText": "ces.  The manuals for this program are available to all MPS employees in the control room of the Moorhead Water Treatment Plant. \n\n\n\nAs for emergency response, Moorhead Public Service's procedure for a release is to notify the Moorhead Fire Department. The City of Moorhead Fire Department and the City of Fargo, North Dakota Fire Department jointly operate and maintain a HAZMAT team. Moorhead Public Service has established and maintained procedures for emergency evacuation of employees and accounting for them. These procedures will enable the HAZMAT team to perform their duties more efficiently. The procedures are reviewed with employees on an annual basis and revised to accommodate changes in staffing when they occur.\n\n\n\nMoorhead Public Service's procedure for a release is to notify the Moorhead Fire Department. The Moorhead Fire Department operates and maintains a HAZMAT Team. MPS has established and maintained procedures for emergency evacuation and roll call of employees. These procedures enable the Moorhead HAZMAT Team to perform their duties more efficiently. The procedures are reviewed with employees on an annual basis and revised to accomodate changes in staffing when they occur.\n\n\n\nMoorhead Public Service modeled two release scenarios in 2012, and updated in early 2018: a worst case release scenario and an alternate case release scenario. In the worst case release scenario, EPA defined parameters were used with the local three-year maximum temperature and average relative humidity. The radius of the modeled chlorine plume was updated to 2.1 miles and had a potential population impact of 31,774 65,176 in Moorhead and surrounding communities. In the alternate release scenario, a leaky ton cylinder on a delivery truck was modeled. This release reached approximately 155 yards.  The residential population impacted was zero, but employees at the site would be affected.   \n\n\n\nMoorhead Public Service management understands its duty to provide a safe working environm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068604,
      "SummaryText": "ent at this facility and to take measures to prevent accidents that may have an effect on the surrounding communities. This understanding is reflected in procedures described and referenced in this document.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nThe Moorhead WTP treats surface water from the Red River of the North and ground water from the Moorhead and Buffalo Aquifers to provide drinking water to the cities of Moorhead and Dilworth. Water is treated through a series of physical and chemical treatment operations including lime softening, ozone disinfection and recarbonation, filtration, and secondary disinfection using monochloramines. The MWTP design capacity is 16 million gallons per day.\n\n\n\nThe regulated substance stored, handled, and used at this facility is chlorine, which is stored onsite in one-ton containers and is used to disinfect treated water. The maximum intended inventory of chlorine is four (4) one-ton cylinders, or 8,000 pounds of chlorine on site.  All of the containers are stored inside of a temperature controlled building.\n\n\n\nRELEASE PREVENTION PROGRAM FOR COVERED CHEMICALS\n\n\n\nThe prevention program and chemical-specific prevention steps are described in detail in Section 2 through Section 13 of this document.  In accordance with the Part 68 rule, the prevention program contains the following sections:\n\n\n\n  >Employee Participation (Section 2)\n\n  >Process Safety Information (Section 3)\n\n  >Process Hazard Analysis (Section 4)\n\n  >Standard Operating Procedures (Section 5) \n\n  >Personnel Training (Section 6)\n\n  >Contractor Safety (Section 7)\n\n  >Pre-Startup Safety Review (Section 8)\n\n  >Mechanical Integrity (Section 9)\n\n  >Hot Work Permits (Section 10)\n\n  >Management of Change (Section 11)\n\n  >Incident Investigation (Section 12)\n\n  >Compliance Audits (Section 13)\n\n\n\nThe prevention program elements that are most critical in preventing accidental releases in this facility include employee training, both formal and on-the-job; written operatin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000068604,
      "SummaryText": "g procedures for all to use who operate or maintain the covered processes; and a process equipment preventive maintenance program.\n\n\n\nShould the prevention program fail to prevent a release, the MWTP is equipped with engineering controls designed to minimize the effect of the release to the surrounding communities.  The chlorine containers are kept inside of a building to mitigate the effects of the release.  More importantly, MWTP has installed a scrubber capable of neutralizing one ton of chlorine, the amount stored in the largest single container on-site.  The scrubber is maintained twice monthly to ensure proper operation in case it would be needed during a chlorine release. In addition, an automatic Halogen Valve shutdown system for the online ton cylinder tank valves is installed. If a leak is detected by online monitors, the shutdown system is activated and will close the cylinder valves, reducing the impact of a leak. The MWTP also has a 1.3 MW natural gas generator for back-up power for the chlorine scrubber that was installed in 2015 as part of the High Service Pumping Station Project.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThere have been no accidental releases of regulated substances from this facility during the past five years.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThis facility has established and maintains an emergency evacuation procedure for employees. The emergency response to a chlorine release is coordinated by local response agencies, such as the Moorhead Fire Department. which is part of the local HAZMAT team along with the City of Fargo, North Dakota. There are no employees at Moorhead Public Service either trained or designated as emergency responders for the chlorine system. The Emergency Planning and Response documentation kept by the facility is described in detail in Section 14 of this document.  The goals of the program are to protect onsite employees from the hazardous effects of a release. The overall prevention program and onsite safety equipme"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000068604,
      "SummaryText": "nt are designed to minimize the effects of releases on the general public. The program is routinely reviewed and updated to reflect personnel and regulatory changes.  A copy of the facility OSHA PSM and EPA RMP program is located at the Moorhead Fire Department for review.\n\n\n\nPLANNED CHANGES TO IMPROVED SAFETY\n\n\n\nIdeas for changes to improve safety are actively sought from employees. Employee safety meetings that focus on chlorine safety issues are held regularly at this facility. Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\n \n\nIn 2012, pressurized piping and V-notch chlorinators were replaced with flexible and rigid PVC tubing, Hydro-Omni Valves and vacuum regulators. The new system components feed chlorine gas via vacuum directly from the tank valve to the Hydro-Omni Valve where it is mixed into utility water solution and fed into the water supply for disinfection. Removing pressurized piping along with other safeguards such as chlorine gas detectors, automatic shutoff valves, and a chlorine scrubber reduce the risks associated with chlorine gas. Staff is continuously evaluating options for improving chlorine safety. \n\n\n\nDuring the development of this RMP document, hazard reviews were conducted with key employees to meet the prevention program requirements. During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases. Each recommendation was considered and evaluated for implementation.  \n\n\n\n\n\n"
    }
  ]
}