{
  "FacilityID": 1000087266,
  "FacilityName": "Tate & Lyle, Lafayette South",
  "FacilityStr1": "3300 U.S. 52 South",
  "FacilityStr2": null,
  "FacilityCity": "Lafayette",
  "FacilityState": "IN",
  "FacilityZipCode": "47905",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18157",
  "LEPC": "Tippecanoe County LEPC",
  "FacilityLatDecDegs": "40.376870",
  "FacilityLongDecDegs": "-86.844203",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.tateandlyle.com",
  "FacilityEmailAddress": "travis.montoya@tateandlyle.com",
  "FacilityDUNS": 40286080,
  "ParentCompanyName": "Tate & Lyle Ingredients",
  "Company2Name": "A.E. Staley Manufacturing Company",
  "CompanyDUNS": 122320559,
  "Company2DUNS": null,
  "OperatorName": "Tate & Lyle  Ingredients",
  "OperatorStr1": "2200 East Eldorado Street",
  "OperatorStr2": null,
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62521",
  "OperatorZipCodeExt": "1578",
  "FTE": 225,
  "OtherEPAFacilityID": "47905STLYM3300",
  "EPAFacilityID": "100000135668",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "157-40694-00033",
  "SafetyInspectionDate": "2018-06-28 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-05-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-05-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-05-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-10-07 00:00:00",
  "DeRegistrationEffectiveDate": "2020-09-22 00:00:00",
  "AnniversaryDate": "2025-05-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.376319,
  "FRS_Long": -86.843695,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "300",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000108873,
      "AltID": "steephouse Sulfur Dioxide",
      "FacilityID": 1000087266,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000136055,
          "ProcessID": 1000108873,
          "ChemicalID": 49,
          "Quantity": 192698.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000110146,
          "ProcessID": 1000108873,
          "NAICSCode": "311221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000092398,
              "Process_NAICS_ID": 1000110146,
              "SafetyReviewDate": "2019-08-19 00:00:00",
              "PHA_Date": "2016-06-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "video camera monitors tank",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-02-21 00:00:00",
              "TrainingReviewDate": "2019-06-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "vendor  training information",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-02-28 00:00:00",
              "EquipmentInspectionDate": "2019-02-28 00:00:00",
              "EquipmentTested": "tank and all related piping",
              "ChangeMgmtDate": "2018-09-13 00:00:00",
              "ChangeMgmtReviewDate": "2019-06-28 00:00:00",
              "PreStartupReviewDate": "2018-09-12 00:00:00",
              "ComplianceAuditDate": "2018-08-21 00:00:00",
              "AuditCompletionDate": "2019-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-07-23 00:00:00",
              "HotWorkPermitReviewDate": "2018-02-01 00:00:00",
              "ContractorSafetyReviewDate": "2019-12-01 00:00:00",
              "ContractorSafetyEvalDate": "2020-03-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000114796,
                  "PreventionProgram3ID": 1000092398,
                  "ProcessChemicalID": 1000136055
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000087266,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-04-01 00:00:00",
    "ERTrainingDate": "2020-02-10 00:00:00",
    "CoordinatingAgencyName": "Lafayette Fire Department",
    "CoordinatingAgencyPhone": "7654764400",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000087266,
      "SummaryText": "Executive Summary, Updated 4-1-20: Tate & Lyle, Lafayette South\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\nWe at Tate & Lyle are strongly committed to employee, public, and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\r\nOur facility's primary activities encompass the manufacture of sweeteners for food and industrial use. We have one regulated substance at our facility: Sulfur Dioxide (anhydrous). Sulfur Dioxide (anhydrous) is used to control microbial growth during the corn steeping process and also weakens the starch-gluten bonds so the separation process following steeping is more efficient.\r\nThe maximum inventory (tank capacity) of Sulfur Dioxide at our facility is 192,698 pounds. \r\n\r\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA and the OSHA PSM Rule. This facility was designed and constructed in accordance with NFPA-30 Standard, applicable ANSI standards and ASME standards for pressure vessels. All chemical storage systems were designed and are maintained in conformance with chemical supplier recommendations. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\r\n\r\nTHE WORST CASE SCENARIO AND THE ALTERNATE RELEASE SCENARIOS-\r\nTo evaluate the worst-case scenario and the alternate release scenarios we have used EPA's RMP*Comp program.\r\n\r\nPROCESS SAFETY INFORMATION- Tate & Lyle maintains a record of safety in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000087266,
      "SummaryText": "formation that describes the chemical hazards, operating parameters, and equipment design associated with all processes.\r\n\r\nPROCESS HAZARD ANALYSIS- Our facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The most recent methodology used to carry out these analyses is the HazOp  and the What If /Checklist Combined. The studies are undertaken by a team of qualified personnel with expertise in engineering, maintenance, and process operations, and are revalidated at regular intervals. Any findings related to the hazard analysis are addressed in a timely manner. \r\nOPERATING PROCEDURES- For the purpose of safely conducting activities within our covered processes, Tate & Lyle maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operation, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a maintenance shutdown. The information is regularly reviewed and is readily accessible to operators involved in the process.\r\n\r\nTRAINING- Tate & Lyle has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided as needed. \r\n\r\nMECHANICAL INTEGRITY- Tate & Lyle carries out documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Qualified personnel carry out maintenance operations with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by maintenance checks are corrected in a safe and timely manner.\r\n\r\nMANAGEMENT OF CHANGE- Written procedures are in pl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000087266,
      "SummaryText": "ace at Tate & Lyle to manage changes in process chemicals, technology, equipment, and procedures. Process operators, maintenance personnel, or any other employee whose job task are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\n\r\nPRE-START UP REVIEW\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as regular practice. These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe start-up prior to placing equipment in operation.\r\n\r\nCOMPLIANCE AUDITS- Tate & Lyle receives audits on a regular basis to determine whether the provisions set out under the Process Safety Management (PSM) standard and RMP rule are being implemented. These audits are carried out at least every three years and any corrective action required as a result of the audits are undertaken in a safe and prompt manner.\r\n\r\nINCIDENT INVESTIGATION- Tate & Lyle promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\r\n\r\nEMPLOYEE PARTICIPATION- Tate & Lyle truly believes that process safety management and accident prevention are a team effort. Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazards analysis.\r\n\r\nCONTRACTORS- Our company hires contractors to conduct specialized and routine maintenance and construction activities. Long-term relationships have been establi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000087266,
      "SummaryText": "shed with the contractors that work on a routine basis. All contract personnel are required to have site-specific training. The contractor training must be documented before a contract worker is allowed on the job site. The contractor safety representative meets with a Tate & Lyle representative regularly. The contractor notifies Tate & Lyle about any incident that results in a near miss, accident, or injury of contract personnel. Tate & Lyle keeps copies of the entire meeting notes and incident investigation reports to document past safety performance. Tate & Lyle has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\nTate & Lyle has an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, there has been no accidental release during this period.\r\n\r\nEMERGENCY RESPONSE PLAN\r\nTate & Lyle has a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public as well as post-incident decontamination of affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require modified emergency response.\r\n\r\nTippecanoe County Emergency Planning Committee is the Local Emergency Planning Committee with which our emergency plan has been coordinated and verified.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nTate & Lyle has recently modified the organizational structure of our Safety and Environmental team"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000087266,
      "SummaryText": "s. We are in the process of developing facility EHS teams to enhance our safety and environmental management systems. We are currently hiring additional resources to focus on Process Safety Management and Safety Engineering programs within our facility.  Overall, these organizational changes should have a positive impact on the safety and environmental programs at our facility."
    }
  ]
}