{
  "FacilityID": 1000048997,
  "FacilityName": "Rhode Island Terminal",
  "FacilityStr1": "14 Moscrip Avenue",
  "FacilityStr2": null,
  "FacilityCity": "North Kingstown",
  "FacilityState": "RI",
  "FacilityZipCode": "02852",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "44009",
  "LEPC": null,
  "FacilityLatDecDegs": "41.36083",
  "FacilityLongDecDegs": "-71.854270",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 39949222,
  "Company2DUNS": null,
  "OperatorName": "Crestwood Services",
  "OperatorStr1": "801 Cherry Street",
  "OperatorStr2": "Suite 3800 Unit 20",
  "OperatorCity": "Fort Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76102",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000228103",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-05-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-03-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-03-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-03-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 41.603368,
  "FRS_Long": -71.431299,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000061436,
      "AltID": "LPG Transloading/Storage",
      "FacilityID": 1000048997,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000075366,
          "ProcessID": 1000061436,
          "ChemicalID": 155,
          "Quantity": 1449000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000065561,
              "ProcessChemicalID": 1000075366,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000065562,
              "ProcessChemicalID": 1000075366,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000062618,
          "ProcessID": 1000061436,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000051088,
              "Process_NAICS_ID": 1000062618,
              "SafetyReviewDate": "2014-12-05 00:00:00",
              "PHA_Date": "2014-10-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-04-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Factors, Siting",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-02-17 00:00:00",
              "TrainingReviewDate": "2015-02-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "CBT",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-02-17 00:00:00",
              "EquipmentInspectionDate": "2015-02-17 00:00:00",
              "EquipmentTested": "Compressor",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2015-02-17 00:00:00",
              "PreStartupReviewDate": "2014-12-05 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-02-17 00:00:00",
              "HotWorkPermitReviewDate": "2015-02-17 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2015-02-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000062405,
                  "PreventionProgram3ID": 1000051088,
                  "ProcessChemicalID": 1000075366
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000048997,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-02-17 00:00:00",
    "ERTrainingDate": "2015-03-09 00:00:00",
    "CoordinatingAgencyName": "North Kingstown Fire Dept.",
    "CoordinatingAgencyPhone": "4012943346",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048997,
      "SummaryText": "t will be completed by a team including at least one operator. The Terminal Supervisor is responsible for maintaining the records on site and implementing the procedure.\r\n\r\nRelease Scenarios\r\nThe worst case scenario involved the release of the total contents of one railcar. There are no environmentally sensitive areas within the distance to the endpoint.\r\nThe alternate release scenario involved a release from a pipe. There are no environmentally sensitive areas within the distance to the endpoint."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048997,
      "SummaryText": "Facility Overview\r\nThe Crestwood Davisville, RI facility is a new, startup operation.  The facility has been used for similar operations by a different company in the past. \r\n\r\nThe operation involves staging railcars containing LPG on a rail siding within the fenced facility. A maximum of five railcars can be staged on the property. The cars are disconnected from the locomotive, and the locomotive leaves the property. The cars are unloaded into the storage tanks, then transferred into tank trucks, which then transport the product to customers. \r\n\r\nThere are five full time equivalent employees at this facility. Employees present on site are operational personnel. There are no maintenance personnel routinely on site. There are no contractors routinely present on site.\r\n\r\nEmergency Contacts\r\nThere is one Crestwood employee who serves as the primary emergency contact during off hours: the Senior Environmental, Safety, and Regulatory Advisor. He can be reached 24 hours per day.\r\nEmergency planning has started with the local fire department and Office of Emergency Management.\r\nAn environmental cleanup company is under contract to provide additional assistance in the event of an emergency.\r\n\r\nEmployee Participation Plan\r\nThe written employee participation plan outlines the various ways that employees are involved in the overall risk management plan. There is a copy of the written plan in the office. The Terminal Supervisor is charged with implementing the plan. The employees are not covered by a collective bargaining agreement. An e-mail is sent to the employees as a reminder twice per year asking them for their suggestions and input for the risk management program. Additionally, the Terminal Supervisor maintains an open door policy, and the operators may make suggestions at any time. There is a daily \"tool box\" meeting covering environmental, safety, and health issues at which any questions or suggestions regarding risk management can be raised.\r\n\r\nProcess Safety Informat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048997,
      "SummaryText": "ion\r\nThe required Process Safety Information has been accumulated by the Engineering Department, is stored on site, and is available to employees. The process safety information was also available during the completion of the process hazard analysis. The Terminal Supervisor is responsible for maintaining the process safety information.\r\n\r\nProcess Hazard Analysis\r\nThe initial process hazard analysis was completed on October 24, 2014. It was conducted on site, and was led by a safety and health consultant with experience in the HAZOP technique used, a Crestwood facility operator, and the Crestwood Senior Environmental Safety and Regulatory Advisor. The Crestwood employees are familiar with the operator, and have experience working at similar operations. The PHA and list of recommendations are stored on site. The Terminal Supervisor is responsible for resolving the recommendations.\r\n\r\nOperating Procedures\r\nComprehensive operating procedures have been developed by a team of Crestwood employees. The procedures include all of the operations covered by the regulation. These operating procedures are the first version as this operation is a new startup. There is a procedure outlining how the operating procedures will be reviewed annually to ensure they are current and updated as necessary to reflect current conditions. The written operating procedures are maintained on site, and the Terminal Supervisor has the responsibility of maintaining them.\r\n\r\nTraining\r\nEmployees have been trained and tested as required by the training procedure. Training was performed in the classroom, CBT, and on the job format. Testing includes written tests, oral exams, and demonstration. Successful completion of the training program and passing the exams results in certification. The training program and associated documentation are kept on site, and the Terminal Supervisor has the responsibility of ensuring compliance with the training program.\r\n\r\nContractors\r\nContractors working on the regulated"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048997,
      "SummaryText": "equipment are not expected. However, if it would be necessary, there is a comprehensive contractor program. The program includes:  procedures for selecting contractors based on their safety and health performance and safety and health systems;  a background check of both the contractor company as well as the individual contractor employee(s) that will work at the facility; an annual training program covering applicable risk management program training, as well as safety and health and emergency information; an annual  written test with a required minimum passing score of 80%; and a contractor auditing procedure to ensure contractors are working in compliance with Crestwood requirements while on site. The Environmental safety and Regulatory Group is responsible for selecting contractors to work on site and ensure the background checks are completed. That information is forwarded to the Terminal Supervisor and kept on site along with the other contractor information.\r\n\r\nPre-Startup Safety Review\r\nThe Pre-Startup Safety Review was completed on December 5, 2014 by a team including external safety and health consultants, operators, and the Senior Environmental Safety and Regulatory Advisor. The PSSR is kept on site, and the Terminal Supervisor is responsible for maintaining records including resolution of the action items.\r\n\r\nMechanical Integrity\r\nA mechanical integrity program has developed to ensure equipment is inspected and maintained properly. Personnel charged with inspecting and maintaining the regulated equipment has been trained. The mechanical integrity information is kept on site, and the Terminal Supervisor is responsible for implementation of the program.\r\n\r\nSafe Work Practices\r\nCrestwood has long maintained a corporate safety manual that includes written safe work practices. The applicable safe work practices applicable to this facility include hot work and lockout/tagout. There are no plans to break into piping or enter confined spaces at this time, so tho"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048997,
      "SummaryText": "se programs are not included in the safe work practices. If this were to change in the future, the programs will be added and employees trained. The written safe work practices are kept on site, and the Terminal Supervisor is responsible for their implementation.\r\n\r\nManagement of Change\r\nThere is a written management of change process, which fully defines the scope of what changes are covered and the process necessary to approve implementation of those changes. A comprehensive risk evaluation checklist is included as part of the procedure and approval by the Terminal Supervisor, operator, and Senior Environmental Safety and Regulatory Advisor are required before the change can be made. As this is a new facility, the management of change process has not been used.  All management of change documentation is maintained on site, and the Terminal Supervisor ensure compliance with the procedure.\r\n\r\nIncident Investigation\r\nThere is a written incident investigation procedure and investigation form. Incidents are investigated by a team including the Terminal Supervisor and operator, plus anyone involved and any witnesses. Specialists or subject matter experts can be added to the team if necessary. As this is a new facility, there have not been any incidents requiring investigation. The Terminal Supervisor has the responsibility for ensuring investigations are completed and maintain the records on site.\r\n\r\nEmergency Response\r\nOn site employees are trained to the basic first aid/CPR, incipient firefighting, and HAZMAT Awareness level. Crestwood has met with and coordinated emergency preparedness and response operations with the local fire department and office of emergency management. The Terminal Supervisor maintains the written plan and records on site.\r\n\r\nCompliance Audits\r\nAs this is a new facility, no previous compliance audits have been completed. There is a written procedure outlining out the audit will be completed in three years as required by the regulation. The audi"
    }
  ]
}