{
  "FacilityID": 1000026703,
  "FacilityName": "Tahoe-Truckee Sanitation Agency",
  "FacilityStr1": "13720 Butterfield Drive",
  "FacilityStr2": null,
  "FacilityCity": "Truckee",
  "FacilityState": "CA",
  "FacilityZipCode": "96161",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06057",
  "LEPC": "Nevada County Env Health Dept",
  "FacilityLatDecDegs": "39.337778",
  "FacilityLongDecDegs": "-120.128611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.ttsa.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 86122249,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "LaRue Griffin, General Manager",
  "OperatorStr1": "13720 Butterfield Drive",
  "OperatorStr2": null,
  "OperatorCity": "Truckee",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "96161",
  "OperatorZipCodeExt": null,
  "FTE": 54,
  "OtherEPAFacilityID": " CAL000003215",
  "EPAFacilityID": "100000055682",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "96-73-13",
  "SafetyInspectionDate": "2009-01-15 00:00:00",
  "SafetyInspectionBy": "Nevada County Environmental Health Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "chlorine",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-05-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-03-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-03-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-03-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 39.32737,
  "FRS_Long": -120.12679,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000032708,
      "AltID": "Chlorine above threshold",
      "FacilityID": 1000026703,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000039732,
          "ProcessID": 1000032708,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000032950,
          "ProcessID": 1000032708,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000028480,
              "Process_NAICS_ID": 1000032950,
              "SafetyReviewDate": "2011-03-31 00:00:00",
              "PHA_Date": "2011-03-31 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": "Global Nodal Analysis with Guide Words.",
              "PHACompletionDate": "2011-05-05 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "airplane crash, vehicle accident, lightning, train wreck, digester gas explosion, oxygen tank rupture, power failure, excessive snow, high winds, sabotage, disgruntled employees",
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "enclosed building, fusible plugs, vacuum regulator, remote monitoring, remote control of shutoff systems",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "chlorination process enclosed in building equipped with auto initiated neutralizing scrubber and automatic container valve closure system.",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Detector on scrubber exhaust, physical inspections, Standard Operating Procedures.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Update SOP, revise preventive maintenance schedule.",
              "OpProceduresReviewDate": "2015-04-30 00:00:00",
              "TrainingReviewDate": "2015-04-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Hazwopper Technician Level, Incident Commander, Chlorine Repair Kit B, Emergency Response Program, and SOP training.",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-05-20 00:00:00",
              "EquipmentInspectionDate": "2015-04-29 00:00:00",
              "EquipmentTested": "Tested Chlor-Alert leak detectors, scrubber, and automatic valve closure system",
              "ChangeMgmtDate": "2015-03-03 00:00:00",
              "ChangeMgmtReviewDate": "2013-05-20 00:00:00",
              "PreStartupReviewDate": "2015-03-03 00:00:00",
              "ComplianceAuditDate": "2013-05-20 00:00:00",
              "AuditCompletionDate": "2013-10-03 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-05-20 00:00:00",
              "HotWorkPermitReviewDate": "2013-05-20 00:00:00",
              "ContractorSafetyReviewDate": "2013-05-20 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Chlorine above threshold quantities is stored in an enclosed building equipped with auto-initiated neutralizing scrubber and automatic container valve closure system.  Chlorine Facility is operated under PSM program, including the emergency response elements.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000034150,
                  "PreventionProgram3ID": 1000028480,
                  "ProcessChemicalID": 1000039732
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000026703,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-11-05 00:00:00",
    "ERTrainingDate": "2014-11-18 00:00:00",
    "CoordinatingAgencyName": "Nev. Co. E.H. & Truckee Fire Dist.",
    "CoordinatingAgencyPhone": "5302651452",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "California Accidental Release Prevention Program Regulations, Rules and Regulations of the Northern Sierra Air Quality Management District, AB 2588 Air Toxic Hot Spots Information and Assessment Act"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000026703,
      "SummaryText": "Executive Summary\n\nIntroduction\n\nThe Tahoe-Truckee Sanitation Agency (T-TSA) is a regional water reclamation facility located in Martis Valley, approximately three miles east of downtown Truckee, California.  The physical address of the facility is 13720 Butterfield Drive, Truckee, California.  T-TSA was formed in 1972 to provide tertiary wastewater treatment for Tahoe City Public Utility District, North Tahoe Public Utility District, Squaw Valley Public Service District, Alpine Springs County Water District, and Truckee Sanitary District.  The regional water reclamation plant became operational in 1978, was expanded in 1982, and expanded again in 2006.  The current capacity of the treatment system is 9.6 million gallons per day of raw sewage.  The plant operates continuously and is attended 24 hours per day.\n\nT-TSA owns and operates a chlorine process that is subject to Program 3 of the federal Chemical Accident Prevention Provisions (RMP Rule) and the California Accidental Release Prevention (CalARP) Program because: (1) chlorine is on the list of regulated toxic substances (40 CFR ?68.130) and the maximum inventory (32,000 lbs.) exceeds the 2,500 pound threshold quantity, (2) T-TSA's chlorine process does not meet eligibility requirements for Program 1, and (3) T-TSA's chlorine process is subject to the federal and state Occupational Safety and Health Administration (OSHA) process safety management (PSM) standards.  The Program 3 requirements include: (1) developing and implementing a management system, (2) conducting hazard assessments, (3) developing and implementing the Program 3 Prevention Program, (4) developing and implementing an emergency response program, (5) documenting and submitting a 5-year accident history; and (6) submitting the Risk Management Plan (RMP).\n\n\n\nAccidental Release Prevention and Emergency Response Policies of T-TSA\n\nThe Tahoe-Truckee Sanitation Agency is committed to the safe operation of the water reclamation facility and is dedicate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000026703,
      "SummaryText": "d to the effective management of chemical hazards and potential risks to employees, the public, and the environment.\n\nThe total liquid chlorine inventory stored in T-TSA's chlorine facility is in excess of the threshold quantity of 2,500 pounds established in 40 CFR ?68.130 and 1,500 pounds established in 29 CFR ?1910.119.  T-TSA has developed, implemented, and integrated the provisions of the RMP Rule, CalARP Program, and PSM Program.  The PSM Program includes the following elements:\n\n?    Process Safety Information,\n\n?    Process Hazard Analysis (PHA),\n\n?    Operating Procedures,\n\n?    Training,\n\n?    Contractors,\n\n?    Pre-Startup Safety Review,\n\n?    Mechanical Integrity,\n\n?    Hot Work Permit,\n\n?    Management of Change,\n\n?    Incident Investigation,\n\n?    Emergency Planning and Response,\n\n?    Injury & Illness Prevention Program, and\n\n?    Employee Participation.\n\nAn original Process Hazard Analysis (PHA) involving a Hazard and Operability Study (HazOp) and What-If Analysis was conducted with design engineers, operations staff, management personnel, and maintenance staff prior to the design of the chlorine process.  Subsequent PHA Revalidation Reports were completed in July 2001, April 2006, and March 2011.  Release prevention measures were implemented during the design and construction of the facility, thus ensuring that all safety and health precautions were integrated into the system prior to operation.\n\nT-TSA submitted an original RMP in June 1999.  This RMP superseded the Risk Management and Prevention Plan (RMPP) approved in 1996.  Other safety and health programs employed at T-TSA related to management of hazardous materials/waste include the Hazardous Materials Business Plan (Business Plan); the Spill Prevention, Control, and Countermeasure (SPCC) Plan; and the hazardous waste manifests for the California EPA, Department of Toxic Substances Control (EPA ID No: CAL000003215).  \n\nT-TSA's Business Plan is administered by the Nevada County Environmental Health Department, T-TSA's Certified Unif"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000026703,
      "SummaryText": "ied Permitting Authority (CUPA).  T-TSA's Business Plan is a working document and includes the following elements:\n\n?    Consolidated Contingency Plan,\n\n?    Facility Maps,\n\n?    Emergency Response Plan,\n\n?    Mitigation Measures,\n\n?    Evacuation Plan,\n\n?    Training Plans and Procedures,\n\n?    Hazardous Materials Inventory Statement,\n\n?    Material Safety Data Sheets (MSDS), and\n\n?    Pre-Response Plans.\n\n\n\nRegulated Substances Handled at T-TSA\n\nChlorine is the only regulated substance present at T-TSA's facility that is above the threshold quantity pursuant to Section 112 (r) (5) of the Clean Air Act, as amended, and listed in 40 CFR ?68.130.  The maximum compressed liquid chlorine inventory at T TSA is 32,000 pounds, or sixteen one-ton containers, that are arranged as follows: four one-ton containers on-line, four one-ton containers in standby mode, and eight one-ton containers in storage.  A common delivery manifold serves the on-line containers.  \n\nPressurized chlorine is reduced to vacuum pressure via vacuum regulators in the chlorine storage area.  Four chlorinators are used to meter the chlorine to downstream ejectors which feed a bank of chlorine solution lines.  The primary use of the chlorine solution is for injection into the plant's effluent flow for disinfection.  Chlorine solution is injected into the plant effluent 24 hours per day, 7 days per week.  Chlorine solution can also be used to pre-chlorinate raw sewage, chlorinate filters, breakpoint chlorinate for ammonia removal, and chlorinate the biological treatment process.  The maximum injection capacity is 3,200 pounds of chlorine per day.  Typically, only 500 to 1,000 pounds per day are used.  \n\nThe chlorine handling facility at T-TSA is a fully contained facility.  All storage and use of the one-ton chlorine containers is done within the container storage room.  The chlorine building is equipped with two chlorine leak detectors that sense chlorine at concentrations as low as one part per million (ppm).  Upon detection of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000026703,
      "SummaryText": "chlorine, the detectors activate two visual beacons located on the west and north sides of the chlorine building, one annunciator light and an audible alarm in the AWT building control room, and a plant-wide audible chlorine leak alarm.  Simultaneously, the leak detectors initiate the shutdown of all ventilation fans, the shutdown of the chlorine solution pump, the initiation of the chlorine scrubber system, and the activation of the chlorine container automatic valve closure system. This chlorine leak prevention system ensures minimal risk of offsite consequences from a chlorine leak at the facility.  The chlorine building is also equipped with an additional multi-probe chlorine detector that senses chlorine concentrations in four locations within the building and transmits this information to the plant's Supervisory Control and Data Acquisition (SCADA) system.\n\nAs required for the purposes of the RMP Rule and the CalARP Program, a worst-case release scenario and an alternative-case release scenario were evaluated.  Pursuant to EPA's recommendations, a description of the release scenarios is not provided because of potential security risks.\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Measures\n\nAs stated above, T-TSA is subject to the EPA-regulated RMP Rule, the Nevada County Environmental Health Department-regulated CalARP program, and the CalOSHA-regulated PSM Program.  These regulations help ensure that T-TSA maintains process safety and risk prevention programs for chlorine handling, storage, and use.  The procedural elements of these programs require that T-TSA develop administrative controls and implement mitigation systems to prevent accidental releases of chlorine.  The accidental release prevention measures include, but are not limited to, the following elements:\n\n1.    Collection and dissemination of process safety information for chlorine.\n\n2.    Employee and contractor training on the administrative controls integrated int"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000026703,
      "SummaryText": "o the standard operating procedures for the chlorine facility.\n\n3.    Process Hazard Analyses for the chlorine system to identify potential hazards and mitigation measures to minimize risk.\n\n4.    Implementation of safe, written standard operating procedures for start-ups, normal operations, temporary operations, and emergency operations.\n\n5.    Implementation of written maintenance procedures for vessels, pumps, piping, and control equipment, including inspection and testing of all equipment on a routine basis.\n\n6.    Management and staff commitment to review all elements of the RMP Rule, CalARP Program, and PSM Program prior to any process modifications.\n\n7.    Management and staff commitment that all elements of the RMP, CalARP, and PSM Programs are in place and personnel are trained prior to starting up the chlorine process after a process modification.\n\n8.    Periodic audits (every three years) to ensure compliance with all elements of the RMP Rule, CalARP Program, and PSM Program.\n\n9.    Management and staff commitment to conduct a thorough investigation of any incident that may result from the operation or maintenance of the chlorine facility.\n\n\n\nFive-Year Accident History\n\nT-TSA has not experienced any accidental releases of chlorine in the last five years.\n\n\n\nEmergency Response Program\n\nT-TSA is committed to remain current on the review and revision of all elements of the RMP Rule, CalARP Program, PSM Program, Business Plan, and SPCC Plan.  T-TSA's Business Plan in place at the facility includes a thorough Emergency Response Program.  All employees at T-TSA are trained yearly on the Emergency Response Program.  This training ensures that the employees are prepared for the hazards existing at T-TSA, the mitigation measures necessary to minimize a release, the evacuation plan, and public notification procedures.  T TSA's Emergency Response Team trains more frequently to ensure adequate preparedness in the event of an emergency.  T-TSA implements its Emergency Response Program, ev"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000026703,
      "SummaryText": "acuation procedures, and public notification procedures in conjunction with the Truckee Fire Protection Agency, the Nevada County Environmental Health Department, and the Northern Sierra Air Quality Management District.\n\n\n\nPlanned Changes to Improve Safety\n\nThere are no planned changes to improve safety at this time.  All safety improvements identified in the most recent PHA and compliance audit were implemented.  Occasionally, Standard Operating Procedures (SOPs) for the chlorine system are modified to improve safety.  Other future events to improve safety at T-TSA   would include training, installation of new mitigation or control equipment or technology, organizational changes, etc.\n\n"
    }
  ]
}