{
  "FacilityID": 1000045070,
  "FacilityName": "Growers Ice Company",
  "FacilityStr1": "1060 Growers",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.652778",
  "FacilityLongDecDegs": "-121.627778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "dstephens1@growersice.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dennis Stphens",
  "OperatorStr1": "1060 Growers",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dennis Stephens",
  "RMPTitle": "General Manager",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000166438",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-09-20 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.65356,
  "FRS_Long": -121.63015,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055791,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 1000045070,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056732,
          "ProcessID": 1000055791,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        },
        {
          "Process_NAICS_ID": 1000056733,
          "ProcessID": 1000055791,
          "NAICSCode": "312113",
          "_desc": {
            "NAICS_CODE": "312113",
            "NAICS_DESCRIPTION": "Ice Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068095,
          "ProcessID": 1000055791,
          "ChemicalID": 56,
          "Quantity": 140000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568095,
          "ProcessID": 1000055791,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045070,
      "SummaryText": "GROWERS ICE COMPANY\n\n1060 Growers Street\n\nSalinas, CA 93901\n\n\n\n                    \n\nA.    EXECUTIVE SUMMARY\n\n[40 CFR 68.155/CALARP ARTICLE 3, 2745.3]\n\n\n\n1.    Release Prevention and Emergency Response Policy\n\nGrowers Ice Co. utilizes inspection procedures to review refrigeration equipment prior to start-up and during operations.  These procedures identify potential sources of release and equipment corrections required to prevent these releases.  Onsite personnel and certified contractors review the equipment and procedures as required.\n\n\n\nOn-site personnel provide initial emergency response.  On-site personnel will make a preliminary assessment in the event of a release and will provide first response.   First response may include emergency equipment shutdown, system isolation, or controlled operation such as a pump-down to prevent or reduce off-site release.  No emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel.  Local fire and police departments with mutual aide response will provide emergency response for a major release event.  The refrigeration contractors would also be on call to provide emergency response.\n\n\n\nEmergency response training will be conducted yearly for the current employees and as required for new employees.  Records will be kept of all training performed at the site for a minimum of five (5) years.\n\nAnnually all of the Refrigeration Technicians are Medically Evaluated, SCBA Fit Tested and continually receive updated training.\n\n\n\n2.    Description of Source and Substance Handled\n\nGrowers Ice is located at 1060 Growers St., Salinas CA. The facility covers approximately 30 acres and utilizes Anhydrous Ammonia as a refrigerant in their operations.  There is approximately 140,000 pounds of Anhydrous Ammonia in the system.\n\nThe ammonia refrigeration system is used for ice production, agricultural product pre-cooling and storage.  The original facility was built in 1936.  The original facility consisted of a c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045070,
      "SummaryText": "ompressor room and a condenser system.  In addition to these components the refrigeration system now supports 22 cold rooms, 6 refrigerated shipping docks, 16 pressure coolers, 1 hydro-cooler, 7 hydro-vacs, 1 vacuum cooler, 5 or more ice generators, 1 or more self-contained ice generator trailer(s) and 2 or more high-side refrigeration trailers.  \n\n\n\nThe refrigeration system at this facility is a single stage vapor compression cycle.  In general, the process chemistry for a single- stage system is shown in Section 2760.1 PSI Technological Information. Located in the General Binder.\n\n\n\nThe refrigeration system consists of the following equipment:\n\n\n\nA?    Nine fixed compressors (main engine room)    \n\nA?    Three low pressure knock-out accumulators\n\nA?    Eleven liquid refrigerant recirculation accumulators\n\nA?    Nine fixed evaporative condensers (main condenser system)\n\nA?    Three trailer mounted compressors\n\nA?    Three trailer mounted condensers\n\nA?    One hundred and five evaporators\n\nA?    Twenty six ammonia pumps\n\nA?    Seventeen water pumps\n\nA?    Nine oil separators\n\nA?    Five ice makers\n\nA?    One or more portable self-contains ice makers (SCATs)\n\nA?    Three emergency system kill switches (main engine room)\n\nA?    Thirty two pressure cooler tunnels\n\nA?    Five portable HydroVacs (seasonal)\n\nA?    Two fixed HydroVacs\n\nA?    One fixed vacuum tube\n\n\n\nThis RMP Document consists of 1 General Binder and 9 additional site-specific facility address binders.\n\nThe Ammonia Refrigeration Safety Inspection  (IIAR) Checklists are located in each site-specific facility address binder, which describe equipment details.  A set of site-specific system drawings is located in each address binder in the P&ID Section.  Included in this section are the plan drawings, Location Map, Site Plan, and equipment layout.\n\n\n\nThe substance handled at Growers Ice Company, Anhydrous Ammonia (Nh3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue.  The gas is pungent and may cause suffocation, as"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045070,
      "SummaryText": " shortness of breath and labored breathing can develop if inhaled.  Prolonged inhalation of high concentrations may cause bronchitis and/or pneumonia, with some residual reduction in pulmonary functions.  Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn.  A Material Safety Data sheet (MSDS) for ammonia is included in and located Appendix D of the General Binder; the MSDS details the chemical properties and health hazards of Anhydrous Ammonia.\n\n\n\n3.  Accidental Release Prevention Program\n\nGrowers Ice Company Maintains an accidental release prevention program designed to eliminate or minimize ammonia releases.  The program includes equipment monitoring, regular inspections and maintenance, and log keeping of operating conditions, scheduled maintenance, emergency response, and operator training.\n\n\n\nThe ammonia refrigeration system has specific measures in place to prevent an accidental release.  Operators and Technicians are trained for safe operation and maintenance of the refrigeration system.  An alarm and detection system monitors the cold rooms for unsafe ammonia concentration levels and for operating conditions outside of safety set points.  Monitoring is done 24 hours a day.  Relief valves are installed to protect both high and low sides from an overpressure situation.  Relief valves are currently piped outside of an enclosed structure to a point at lest 6A? above the roof of the structure or to a water diffusion tank.  Compressors are controlled by microprocessor control panels that will automatically shut them down if pressure or temperature set points are exceeded.  The entire facility is monitored and controlled by an Andover control system.  This control system provides real time monitoring, reports, alarms, failure notices and system fault paging.  Additional information about the ammonia detection system and sensor locations can be obtained from the site-specific address b"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045070,
      "SummaryText": "inders under Detection, Monitoring and Auto Control System.\n\nA thorough review of the system including a A?What ifA? Process Hazard Analysis (PHA) was performed for the facility and is included in each site-specific address binder under the section Hazard Operability Analysis. Equipment corrections and updates were made for those items determined to have the highest potential for off-site releases.\n\n\n\nAs required in the General Binder section under Updates, refrigeration equipment will be inspected and reviewed periodically and as equipment becomes operational on-site.  This RMP, which includes accident prevention procedures for the ammonia system is maintained on-site.\n\n\n\n4.  Five-Year Accident History [40 CFR 68.42/CALARP 2750.9]\n\n\n\nNo Accidents\n\n\n\n5.  Emergency Response Program\n\n\n\nThe facility has implemented the State and County mandated Emergency Response Plan (Business Response Plan).  This plan outlines procedures for emergency ammonia release response.  See Emergency Response plan.\n\n\n\n6.  Planned Changes to Improve System Safety\n\n\n\nGrowers Ice Company continuously strives to improve and upgrade the refrigeration system on this facility.  Refrigerant pumps with shaft seals that pose a potential refrigerant leak are systematically being replaced with seal-less pumps.   Condensing capacity has been increased to lower high side pressures.   The monitoring and control system is in a constant upgrade mode adding components and improving the system to provide better control.\n\n\n\n"
    }
  ]
}