{
  "FacilityID": 1000093046,
  "FacilityName": "Columbus Chemical Industries, Inc.",
  "FacilityStr1": "N4335 Temkin Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Columbus",
  "FacilityState": "WI",
  "FacilityZipCode": "53925",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55027",
  "LEPC": "Dodge County LEPC",
  "FacilityLatDecDegs": "43.352038",
  "FacilityLongDecDegs": "-088.999619",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": "N4335 TEMKIN ROAD",
  "FacilityEmailAddress": "dhatfield@columbuschemical.com",
  "FacilityDUNS": 46841458,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Columbus Chemical Industries, Inc.",
  "OperatorStr1": "N4335 Temkin Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53925",
  "OperatorZipCodeExt": null,
  "FTE": 56,
  "OtherEPAFacilityID": "53925CLMBSN4335",
  "EPAFacilityID": "100000041769",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-10-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-04-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-04-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-04-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-04-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.35205,
  "FRS_Long": -88.9994,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ZIP+4 CENTROID",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115467,
      "AltID": "storage",
      "FacilityID": 1000093046,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144391,
          "ProcessID": 1000115467,
          "ChemicalID": 53,
          "Quantity": 16650.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000116917,
          "ProcessID": 1000115467,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000098799,
              "Process_NAICS_ID": 1000116917,
              "SafetyReviewDate": "2021-04-07 00:00:00",
              "PHA_Date": "2020-10-22 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-05-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "vessel is on load cells with remote readout",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "scrubbers; drainage, sump, collection tanks",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "load cells with remote readout; security cameras",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "evaluation of remotely operated main shutoff valve at the bottom of the vessel",
              "OpProceduresReviewDate": "2020-11-18 00:00:00",
              "TrainingReviewDate": "2020-11-18 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "online",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": "discussions as a group; applicable online training",
              "MaintenanceReviewDate": "2020-11-24 00:00:00",
              "EquipmentInspectionDate": "2021-04-08 00:00:00",
              "EquipmentTested": "entire system",
              "ChangeMgmtDate": "2016-01-20 00:00:00",
              "ChangeMgmtReviewDate": "2020-11-23 00:00:00",
              "PreStartupReviewDate": "2021-03-20 00:00:00",
              "ComplianceAuditDate": "2021-04-08 00:00:00",
              "AuditCompletionDate": "2021-04-08 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-03-24 00:00:00",
              "HotWorkPermitReviewDate": "2021-04-08 00:00:00",
              "ContractorSafetyReviewDate": "2019-12-02 00:00:00",
              "ContractorSafetyEvalDate": "2019-12-02 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000123838,
                  "PreventionProgram3ID": 1000098799,
                  "ProcessChemicalID": 1000144391
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000093046,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2020-12-21 00:00:00",
    "ERTrainingDate": "2021-03-24 00:00:00",
    "CoordinatingAgencyName": "Dodge County Emergency Management",
    "CoordinatingAgencyPhone": "9203863993",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "various other EHSS requirements"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093046,
      "SummaryText": "Columbus Chemical Industries, Inc. (CCI) formulates, blends, packages, and distributes a wide variety of chemicals for many different industrial, commercial, and educational applications.  CCI has been in business for over 40 years, and is pleased to have many long-term customers and employees.  CCI managers have long industry experience with chemicals.  CCI has long been certified to the quality standards of ISO 9001, most recently in March, 2021.  CCI has also long been verified to the comprehensive Responsible Distribution program of the National Association of Chemical Distributors (NACD).  The NACD Verification cycle is three years.  CCI was most recently Verified in October, 2017.  Re-Verification was scheduled for 2020, but, because of the pandemic, NACD determined to extend the current Verification cycle until 2021.  CCI is therefore currently scheduled for Re-Verification in June, 2021. In addition to ISO and NACD, CCI fully complies with the requirements of DHS/CISA/CFATS.\n\n\n\nCCI's #1 priority is safety and safe environment.  This commitment, signed by CCI's President and CEO, is posted in CCI facilities.      \n\n\n\nAccidental release of chemicals is mitigated by ongoing employee training, strict inventory practices, established standard operating procedures, detailed maintenance practices, and systems to control and contain processes. Emergency response activities are addressed in multiple documents, both developed by the facility and developed jointly with cooperating agencies.  These activities are reinforced by ongoing training, by the related day-to-day experience entailed in basic CCI operations, and by the many inspections and audits to which CCI is subjected by local, state, and federal government agencies, insurance companies, and customers.                                                                                                                                                                           \n\n\n\nCCI maintains a Hazmat Team of 12 emp"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093046,
      "SummaryText": "loyees, including participation from all operating departments and all employee levels.  Every Hazmat Team member has received a minimum of 24 hours of specialized training in accordance with 29 CFR 1910.120(q); most members maintain 40 hours of training.  Training is provided by outside experts, online courses, and in-house classroom sessions, supplemented with hands-on experience.  The Hazmat Team can deal with all but certain significant incidents, after which outside assistance would be sought from pre-established sources. The 5-year incident history contains no incidents for which outside assistance was needed. \n\n\n\nThe entire CCI production/warehouse/office facility is served with a ESFR sprinkler system.  The flammables area has a AR-AFFF foam system.  The fire suppression system includes an on-site 190,000 gallon fire water reservoir and a large emergency generator for the facility's fire pump.  Warehouses are completely contained, designed to hold both the stored chemicals and fire suppression system water.  Flammables storage areas are served with floor trenches leading to double wall underground concrete holding tanks.  Production areas are served with floor trenches leading to collection sumps and the wastewater neutralization system.  Storm drains are completely separate, and are covered in a WDNR \"No Exposure\" certification. \n\n\n\nThe CCI facility is approximately 1 mile from the Columbus Fire Department, the Lifestar ambulance service, and the Columbus Police Department.  The hospital, emergency room, and clinic of Prairie Ridge Health are two miles away.  Dodge County Emergency Management is in the vicinity, as are the resources of Madison and the surrounding area. \n\n\n\nThe process that is the subject of this RMP is a nominal 5400 gallon dedicated 37% hydrochloric acid tank located in a concrete containment inside the production building.  The tank is normally empty.  Approximately every 1-2 weeks the facility receives a tank truck of 45,000 pounds of 37"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093046,
      "SummaryText": "% hydrochloric acid.  CCI packages the 37% hydrochloric acid into intermediate bulk containers (IBCs), 55-gallon drums (drums), and other containers of various sizes in a specially designed acid/base packaging room. The flow of the 37% hydrochloric acid from the tank truck to the packaging stations in the facility's dedicated acid room is through the dedicated 37% hydrochloric acid tank.  The usual sequence of packaging the 37% hydrochloric acid is to connect the tank truck to the interior dedicated hydrochloric acid piping leading to the hydrochloric acid tank, and then to begin unloading the 37% hydrochloric acid into the tank.  While unloading of the tank truck continues, the 37% hydrochloric acid is pumped from the tank, which serves as a flow-through process vessel, to the packaging stations in the dedicated acid/base room.  Packaging proceeds while the remaining contents of the tank truck flow through the tank.  Depending on the details of the packaging orders, the tank truck is usually emptied in from 2-6 hours.  The tank is usually empty at the end of the initial and any subsequent packaging runs, in part because each tank truck load of 37% hydrochloric acid constitutes a separate lot, and mixing of different lots needs to be avoided.\n\n\n\nBecause of certain recently changed conditions, including transportation challenges, severe hotter/colder weather, COVID-19, component supply challenges, and personnel considerations, a somewhat different procedure may sometimes be necessary.  The entire contents of the tank truck may need to be unloaded into the tank before any packing occurs.  If that happens, and assuming that the tank truck contained a full load, the tank would contain more than the RMP threshold quantity 37% hydrochloric acid.  Packing of the hydrochloric acid would occur as soon as possible, but under some circumstances the material could remain in the tank for 1-2 days before packing of the lot was complete. Therefore, while previously the tank functi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093046,
      "SummaryText": "oned solely as a flow-through process vessel, given that the tank may now contain a RMP threshold quantity of 37% hydrochloric acid, albeit only sometimes and for a relatively short time period, we are now regarding it as a storage tank for RMP purposes during those periods.  Thus, although CCI submitted a previous RMP document for the hydrochloric acid tank as a Predictive Filing, we are now submitting this RMP document regarding the tank as other than a flow-through process vessel.  \n\n  \n\nThe tank has a nominal capacity of 5400 gallons.  It is vented through a wet scrubber to control any emissions. \n\nA 45,000 pound load of 37% hydrochloric acid is nominally 4536 gallons.  Since lots of product are not mixed, the maximum quantity in the tank would be 4536 gallons.  The tank is located in a concrete containment, inside the production building.  The containment has a holding capacity of approximately 43,040 gallons. Spilled material flows to a sump, from where it is pumped to either a 5000 gallon neutralization tank or a 2500 gallon emergency tank, both of which are also located in the containment.                                                                                                  \n\n\n\nMost CCI employees, including most of the Hazmat Team members, live in the Columbus area.  In July, 2014 CCI hosted a regional emergency response exercise with 14 participating agencies and 2 TV stations.  The scenario included a tornado causing injuries, structural damage, and spills of 37% hydrochloric acid both inside and outside the building.  A detailed report was prepared under the auspices of Wisconsin Emergency Management.  \n\n                                                                                                                   Until the pandemic CCI conducted facility tours and presentations for local school chemistry groups and, owing to the sophistication of the CCI fire suppression systems and the frequent inspections by the Columbus Fire Department, "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093046,
      "SummaryText": "has hosted area fire departments as part of their training programs, especially for the volunteer fire fighters.  CCI has supported local causes, and has been repeatedly visited by elected representatives."
    }
  ]
}