{
  "FacilityID": 1000020163,
  "FacilityName": "Seminole Gas Processing Plant",
  "FacilityStr1": "3.5 Miles North, State Hwy. 214",
  "FacilityStr2": null,
  "FacilityCity": "Seminole",
  "FacilityState": "TX",
  "FacilityZipCode": "79360",
  "Facility4DigitZipExt": "1570",
  "FacilityCountyFIPS": "48165",
  "LEPC": "Gaines County LEPC",
  "FacilityLatDecDegs": "32.753333",
  "FacilityLongDecDegs": "-102.684167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.hess.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 877444547,
  "ParentCompanyName": "Hess Corporation",
  "Company2Name": null,
  "CompanyDUNS": 6979785,
  "Company2DUNS": 0,
  "OperatorName": "Hess Corporation",
  "OperatorStr1": "P.O. Box 1570",
  "OperatorStr2": null,
  "OperatorCity": "Seminole",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79360",
  "OperatorZipCodeExt": "1570",
  "RMPContact": "Brent Lohnes",
  "RMPTitle": "Plant Manager",
  "FTE": 55,
  "OtherEPAFacilityID": "TXD982549958",
  "EPAFacilityID": "100000090572",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00627",
  "SafetyInspectionDate": "2010-04-01 00:00:00",
  "SafetyInspectionBy": "Texas Railroad Commision",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-01-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-01-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-01-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-01-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.69187,
  "FRS_Long": -102.70844,
  "FRS_Description": "OTHER",
  "FRS_Method": "ZIP CODE-CENTROID",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000024515,
      "AltID": "Ryan Holmes Units",
      "FacilityID": 1000020163,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000024877,
          "ProcessID": 1000024515,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000029101,
          "ProcessID": 1000024515,
          "ChemicalID": 129,
          "Quantity": 728226.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000029102,
          "ProcessID": 1000024515,
          "ChemicalID": 155,
          "Quantity": 2225638.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 102619,
              "ProcessChemicalID": 1000029102,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 102620,
              "ProcessChemicalID": 1000029102,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 102621,
              "ProcessChemicalID": 1000029102,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 102622,
              "ProcessChemicalID": 1000029102,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 102623,
              "ProcessChemicalID": 1000029102,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 102624,
              "ProcessChemicalID": 1000029102,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 102625,
              "ProcessChemicalID": 1000029102,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000529101,
          "ProcessID": 1000024515,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000529102,
          "ProcessID": 1000024515,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000020163,
      "SummaryText": "Hess Corporation\nUnited States Onshore Production\nSeminole Gas Processing Plant\n\nUnited States Environmental Protection Agency A? Risk Management Program\n\n\n\nEXECUTIVE SUMMARY\n\nCERTIFICATION LETTER\n\nBased on the criteria in 40 CFR 68.10, the distance to the specified endpoint for the worst-case accidental release scenario for the following process is less than the distance to the nearest public receptor. The Seminole Gas Processing Plant identified potential candidates for worst-case scenarios and utilized the services of the Baker Engineering & Risk Consultants, Inc. of San Antonio, Texas to perform consequence analyses using the commercially available DNV Technica PHAST dispersion program and the Baker-Strehlow methodology for RMP radius of exposure for a 1-psi overpressure. According to the analyses, the maximum end point for a 1-psi vapor cloud explosion (VCE) is 724 feet (0.14 miles) from the center of the explosion, resulting from the instantaneous release of the inventory contained  in the Propylene Accumulator storage tank when filled to the greatest amount allowed (80% at 60 degrees F). The maximum distance beyond the plant property boundary is 250 feet, which enters into the Amerada Hess Seminole District pipe yard. Since the plant is located in a sparsely populated area, this worst-case release would not affect any public or environmental receptor beyond property owned and occupied by Amerada Hess Corporation.\n\nWithin the past five years, the process has had no accidental release that caused offsite impacts provided in the Risk Management Program rule (40 CFR 68.10(b)(1)). No additional measures beyond those stated in the Planned Changes to Improve Safety section of the Executive Summary are necessary to prevent offsite impacts from accidental releases. In the event of fire, explosion, or a release of a regulated substance from the process, entry within the distance to the specified endpoints may pose a danger to public emergency responders. Therefore, pub"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000020163,
      "SummaryText": "lic emergency responders should not enter this area except as arranged with the emergency contact indicated in the RMP. The undersigned certifies that, to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n.\nBrent Lohnes\nPlant Manager\nJanuary 26, 2010\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Seminole Gas Processing plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the investment of significant resources in accident prevention, such as personnel training, mechanical inspection, process control systems and by recognition of safety as a primary factor in the design, installation, operation and maintenance of our processes. However, if an accidental release does occur, trained plant personnel will respond to control and contain the release.\n\nTo prevent accidental releases, the Seminole Gas Processing plant achieves control of hazardous materials by:\nA?    A commitment to OSHAA?s PSM and HAZWOPER standards, EPAA?s RMP, DOTA?s Pipeline Safety and Texas Railroad Commission Rule 36 A? Hydrogen sulfide safety regulations which promote and require adherence to process safety activities designed to prevent accidental releases.\nA?    Development and use of Amerada Hess Corporation and Seminole Gas Processing Plant safety, operating, maintenance, emergency response, engineering design and construction policies, procedures and practices designed to prevent accidents and potential releases.\nA?    Knowledge of and adherence to applicable industry recognized standards, specifications and recommended practices that address and provide guidance for the proper design, construction and operation of facilities containing hazardous materials.\nA?    A comprehensive equipment inspection and testing program.\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Seminole Gas Processing Plant, located 3.5 miles North on state highway"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000020163,
      "SummaryText": " 214, Seminole, Gaines County, Texas operates a variety of processes, some of which produce petroleum products (e.g., natural gas and natural gas liquids) from an inlet gas stream which is principally carbon dioxide. The plant processes or stores regulated flammables, such as Methane, Natural Gas Liquids and Propylene.  In 2005 the facility conducted process design and hazards reviews for the Yates Fuel Gas Unit to process natural gas and extract the associated liquids. The gas is used to supplement the plantA?s fuel gas system, while the liquids will be sold via an existing sales pipeline.\nIn addition, the plant produces and contains as by-products of processing, Hydrogen Sulfide (H2S) and Sulfur Dioxide (SO2) at levels below the listed RMP threshold quantities. \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nProcesses at the plant that are regulated by the Environmental Protection AgencyA?s (EPAA?s) Risk Management Program (RMP) regulation are also subject to the Occupational Safety & Health AdministrationA?s (OSHAA?s) Process Safety Management (PSM) standard. The Seminole Gas Processing Plant adheres to all applicable federal and state regulatory statutes. \n\n\nFIVE YEAR ACCIDENT HISTORY\n\nWithin the past five years, the Seminole Gas Processing Plant has had no accidental release that caused off site impacts as defined by the Risk Management Program rule (40 CFR 68.10(b)(1).  Within the past 5 years the plant has not experienced an incident involving regulated flammables that caused deaths, injuries, property or environmental damage, evacuations or sheltering in place.\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Seminole Gas Processing Plant maintains a written emergency response program, which is designed to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is involved.  The procedure addre"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000020163,
      "SummaryText": "sses emergency response, proper first aid and medical treatment, evacuation plans, accounting for personnel, notification of local emergency response agencies and the public. In addition, the plant has procedures that address maintenance, inspection and testing and instructions in the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to gas plant processes or other plant facilities.  \n\nWORST CASE RELEASE SCENARIO\n\nThe Seminole Gas Processing Plant identified potential candidates for worst case scenarios and utilized the services of the Baker Engineering & Risk Consultants, Inc of San Antonio, Texas to perform consequence analyses using the DNV Technica PHAST dispersion program and the Baker-Strehlow program for RMP radius of exposure for a 1-psi overpressure.  According to the analyses, the greatest maximum end point for a 1-psi vapor cloud explosion (VCE) is 724 feet (0.14 miles) from the center of the explosion, resulting from the instantaneous release of the inventory contained in the Propylene Accumulator storage tank when filled to the greatest amount allowed (80% at 60F). The maximum distance beyond the plant property boundary is 250 feet, which enters into the Amerada Hess Seminole District pipe yard. Since the plant is located in a sparsely populated area, this worst-case release would not affect any public or environmental receptor beyond property owned and occupied by Amerada Hess. \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Seminole Gas Processing Plant conducts ongoing efforts to reduce risk through the Risk Management Program and Process Safety Management. These include recommendations from process hazards analyses, employee suggestions, and recommendations from incident investigations, recommendations from compliance audits and review of the preventative maintenance and me"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000020163,
      "SummaryText": "chanical integrity program information."
    }
  ]
}