{
  "FacilityID": 1000076426,
  "FacilityName": "DuPont - Spruance",
  "FacilityStr1": "5401 Jefferson Davis Highway",
  "FacilityStr2": null,
  "FacilityCity": "Richmond",
  "FacilityState": "VA",
  "FacilityZipCode": "23234",
  "Facility4DigitZipExt": "2257",
  "FacilityCountyFIPS": "51041",
  "LEPC": "Chesterfield County LEPC",
  "FacilityLatDecDegs": "37.451917",
  "FacilityLongDecDegs": "-077.433361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dupont.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "DuPont Specialty Products USA, LLC",
  "Company2Name": null,
  "CompanyDUNS": 116841945,
  "Company2DUNS": 0,
  "OperatorName": "DuPont Specialty Products USA, LLC",
  "OperatorStr1": "5401 Jefferson Davis Highway",
  "OperatorStr2": null,
  "OperatorCity": "Richmond",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23234",
  "OperatorZipCodeExt": "2257",
  "RMPContact": null,
  "RMPTitle": "Process Safety Management Leader",
  "FTE": 1750,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000075937",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "PRO50397",
  "SafetyInspectionDate": "2019-02-21 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-03-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 1,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-03-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-03-11 00:00:00",
  "CBIFlag": 1,
  "CBIUnsanitizedVersionFlag": 1,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 37.45111,
  "FRS_Long": -77.43389,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000095003,
      "AltID": "Plastics Material and Res",
      "FacilityID": 1000076426,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000096265,
          "ProcessID": 1000095003,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000118833,
          "ProcessID": 1000095003,
          "ChemicalID": 4,
          "Quantity": 1100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 4,
            "ChemicalName": "Chloroform  [Methane, trichloro-]",
            "CASNumber": "67-66-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000618833,
          "ProcessID": 1000095003,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000095004,
      "AltID": "CBI Flammable Substance",
      "FacilityID": 1000076426,
      "ProgramLevel": 3,
      "CBI_Flag": 1,
      "_naics": [
        {
          "Process_NAICS_ID": 1000096266,
          "ProcessID": 1000095004,
          "NAICSCode": "31323",
          "_desc": {
            "NAICS_CODE": "31323",
            "NAICS_DESCRIPTION": "Nonwoven Fabric Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000118834,
          "ProcessID": 1000095004,
          "ChemicalID": 156,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 156,
            "ChemicalName": "CBI Flammable Substance",
            "CASNumber": "00-00-00",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 1,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000618834,
          "ProcessID": 1000095004,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000076426,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies at the Spruance DuPont Site:\n\n\n\nThe Spruance site's overall approach to chemical safety is through adherence to OSHA, EPA and corporate requirements.  The site conducts 1st party audits, and the Corporation conducts independent 2nd party audits to confirm site compliance.  All RMP chemicals in this submittal are covered by OSHA's 1910.119, or by the EPA's RMP, or both.    Leadership for the corporation requires compliance with these programs and laws.  Where deviations are found, actions are developed and tracked to correct deficiencies.\n\n\n\nFacility and the Regulated Substances Handled:\n\n\n\nThe Spruance Facility is located just south of Richmond, Virginia in Chesterfield County.  The site is just under 500 acres.  There are 5 products made on the location that fall under the generic item of Plastics and Resins in the NAICS codes.  The regulated substances used are Chloroform (approximately 1,100,000 lbs), and CBI Flammable (approximately 180,000 lbs).\n\n\n\nThe General Accidental Release Prevention Program and Chemical Specific Prevention Steps:\n\n\n\nFor all EPA regulated Toxics and Flammables, OSHA's PSM requirement along with corporate requirements are strictly followed.  DuPont is committed to personal Safety, Process Safety, and the Environment.  The Process Safety Management system has been in place since 1992, and has been continuously improved.  The site's PSM program starts with a Process Technology package, which covers the chemical, electrical and mechanical hazards, equipment design basis, distributive control system interlocks and safety relief devices.  When changes to the process are required, they are evaluated through a Management of Change process.  PHA's are conducted at a minimum of every 5 years and for several phases of new projects. They are also conducted on processes that have been idled or removed.  Each hazards analysis looks at the process hazards, inherently safer processes, and the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000076426,
      "SummaryText": "role of human factors. Operating Procedures and Safe Work Practices are considered critical in safely operating our chemical processes.  These procedures are reviewed, revised, and maintained in an accurate and up to date status.  Training is conducted for new employees, current employees and management. The training program is monitored through progression testing and job cycle checks. Management of Change for Personnel ensures that employees are properly trained prior to assuming new assignments. A comprehensive Mechanical Integrity and Quality Assurance program ensures the reliability of our assets. Contractor safety performance is tracked and monitored at the corporate, business, and site level to ensure that contractors are knowledgeable.  The site has established high expectations on the reporting of incidents and near misses.   Serious incidents require a full investigation and a root cause failure analysis to determine the cause and prevent recurrence.  The site works closely with the Chesterfield Emergency Planning Commission to provide information on hazard assessments, prevention programs, drills and significant changes. Emergency Planning includes site preparation and drills to maintain readiness. The site has a primary and backup emergency operations center for handling emergencies.\n\n \n\nThe Five Year Accident History\n\n\n\nDuPont Spruance has not had any accidental releases from any of our covered processes resulting in deaths, injuries, or significant property damage on site or off site in the previous five years.\n\n\n\nThe Emergency Response Program:\n\n\n\nAppropriate information is incorporated into the Emergency Plan. The site trains and staffs an emergency services team that provides 24-hour coverage. The team has fire, HAZMAT, confined space and medical response capability.  Training for the emergency services team meets NFPA, OSHA and State requirements. In addition to the site plan, each manufacturing unit has emergency response plans to manage emergenci"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000076426,
      "SummaryText": "es.   Site drills are held 4 times a year, followed by critiques identifying improvement opportunities.  Site personnel are notified of emergency situations by a site alarm system, which has battery backup for loss of power. \n\n\n\nGeneral Notes Supporting Information in this Submittal:\n\n\n\nWorst Case Toxics: In the 1999 Submittal, 2 operations that use Chloroform were identified as the Worst Case, with the other as the Alternate Worst Case.  Since these 2 operations are at opposite ends of the site, and affect different population centers, we concluded it best to submit 2 Worst Cases. In addition, we include an Alternate Worst Case of a Chloroform unloading hose failure. The 2017 submittal reviewed the Worst Case and Alternate Worst Cases provided in the 1999, 2004, and 2009 submittals for accuracy. Public Receptors were added to each case based on an evaluation using VBMP Most Recent Imagery WGS Web Mercator (VGIN) to include residences, schools, public recreational facilities and major industrial areas. The worst case and alternative worst case scenarios were reviewed for this resubmittal.  It was determined that the basis of these scenarios has not changed since the previous submittal of 2017.\n\n\n\nThe site is claiming a CBI substance for its Worst and Alternate Worst Case Flammable for business confidential reasons.  DuPont claimed, and was granted, CBI protection from the EPA on May 6, 1993.  A paper copy of the submittal with the name of the CBI substance was provided at that time.\n\n\n\nThe site's RMP registration continues to include one toxic substance (chloroform) and one flammable substance (CBI Flammable) under Prevention Program Level 3.\n\n"
    }
  ]
}