{
  "FacilityID": 1000027059,
  "FacilityName": "Mesa Cold Storage",
  "FacilityStr1": "700 S. Raymond Ave",
  "FacilityStr2": null,
  "FacilityCity": "Fullerton",
  "FacilityState": "CA",
  "FacilityZipCode": "92631",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06059",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.864009",
  "FacilityLongDecDegs": "-117.905634",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "sperry@mesacold.com",
  "FacilityDUNS": 58149378,
  "ParentCompanyName": "Mesa Cold Storage",
  "Company2Name": null,
  "CompanyDUNS": 58149378,
  "Company2DUNS": null,
  "OperatorName": "Mesa Cold Storage",
  "OperatorStr1": "9602 W. Buckeye Road",
  "OperatorStr2": null,
  "OperatorCity": "Tolleson",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85353",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000160014",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-22 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-03-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-03-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-03-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-03-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.864009,
  "FRS_Long": -117.905634,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000033102,
      "AltID": "nh3 system",
      "FacilityID": 1000027059,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000040089,
          "ProcessID": 1000033102,
          "ChemicalID": 56,
          "Quantity": 24107.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000033362,
          "ProcessID": 1000033102,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000028892,
              "Process_NAICS_ID": 1000033362,
              "SafetyReviewDate": "2012-02-24 00:00:00",
              "PHA_Date": "2008-07-29 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-06-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-02-24 00:00:00",
              "TrainingReviewDate": "2012-02-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Reta Self Study",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-02-24 00:00:00",
              "EquipmentInspectionDate": "2009-01-29 00:00:00",
              "EquipmentTested": "Condenser #2",
              "ChangeMgmtDate": "2003-12-17 00:00:00",
              "ChangeMgmtReviewDate": "2004-12-17 00:00:00",
              "PreStartupReviewDate": "2003-12-17 00:00:00",
              "ComplianceAuditDate": "2011-02-09 00:00:00",
              "AuditCompletionDate": "2013-02-09 00:00:00",
              "IncidentInvestigationDate": "2005-06-14 00:00:00",
              "InvestigationChangeDate": "2005-06-14 00:00:00",
              "ParticipationPlansReviewDate": "2012-02-24 00:00:00",
              "HotWorkPermitReviewDate": "2012-02-24 00:00:00",
              "ContractorSafetyReviewDate": "2003-12-01 00:00:00",
              "ContractorSafetyEvalDate": "2012-02-24 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000034541,
                  "PreventionProgram3ID": 1000028892,
                  "ProcessChemicalID": 1000040089
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000027059,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fullerton Fire Dept.",
    "CoordinatingAgencyPhone": "7147386500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000027059,
      "SummaryText": "This Executive Summary contains Mesa Cold Storage's administrative and operational programs to prevent ammonia-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is ammonia.  The following topics are addressed in this Executive Summary:\r\n\r\n¿\tAccidental Release Prevention and Emergency Response Policies\r\n¿\tStationary Source and Regulated Substance\r\n¿\tAccidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n¿\tFive Year Accident History\r\n¿\tEmergency Response Program\r\n¿\tPlanned Changes to Improve Safety\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nThe facility uses ammonia as a refrigerant within a closed system.  Ammonia is a hazardous substance that must be handled properly in order to prevent accidental releases and injuries.  It is the policy of Mesa Cold Storage to conduct all operations (including the ammonia refrigeration system) in a safe manner.  This policy extends to all employees and contractors at the facility.  Mesa Cold Storage implements this policy towards chemical and general safety through on going employee participation, training, written operating procedures, maintenance, inspections, safety committee meetings, and safety reviews/evaluations.  These programs are in effect at the facility to prevent the accidental release of ammonia.  In the event of an ammonia accident, the facility has an Emergency Action Plan to notify the appropriate authorities and safely evacuate the facility.\r\n\r\nMesa Cold Storage abides by the emergency action procedures and policies detailed in the Emergency Planning and Response section of the PSM document.  This plan was designed to meet the following objectives:\r\n\r\n1.)\tTo save lives.\r\n2.)\tTo minimize and avoid injuries.\r\n3.)\tTo protect the environment.\r\n4.)\tTo minimize property damage.\r\n\r\nThe facility occupants plan to evacuate during an ammonia emergency situation.  The plan provides the response organization, notificatio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000027059,
      "SummaryText": "n procedures and first aid which will be implemented to effectively handle emergency situations that may arise at the facility. \r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nMesa Cold Storage is the owner of the facility and is currently leasing the building to Mesa Cold Storage.  The facility is located at 700 S. Raymond Ave. in Fullerton, California approximately 0.75 miles north of the Highway 91 near the intersection of Raymond Avenue and Kimberly Avenue.  Immediately surrounding the facility is a mix of industrial, commercial, and residential areas.    \r\n\r\nThere are two independent refrigeration systems (Upper Warehouse and Lower Warehouse) employed at the facility, and each system uses ammonia for cold storage warehousing.  The ammonia refrigeration system located at the Upper Warehouse has a system charge of 24,107 pounds, while the system located at the Lower Warehouse has an inventory of 8,940 pounds.  Each system is a closed-loop system - no emissions or releases are typical or expected.\r\n\r\nFor both systems, liquid ammonia flows from the High Pressure Receiver through the Intercooler, where its pressure and temperature are reduced before reaching the Low Pressure Accumulators, which supply liquid to the evaporators.  As liquid ammonia flows through the evaporators, heat is absorbed from the surrounding air, and the ammonia boils.  The compressors in the system pull the low pressure liquid/vapor ammonia from the evaporators into a Suction Accumulator where the liquid ammonia is trapped to prevent liquid carry-over of ammonia to the Compressors.  The ammonia vapor passes through the Suction Accumulator into the Low Stage (Booster) Compressors, and is then discharged to the Intercooler to be desuperheated and transferred to the High Stage Compressors.  The high pressure ammonia vapor discharged from the High Stage Compressors is liquefied in the Condensers, and the recycled liquid ammonia flows back into the High Pressure Receiver.\r\n\r\nAll ASME vessels are"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000027059,
      "SummaryText": "equipped with pressure relief valves, which are set to actuate at either 150 or 250 psig to relieve high pressure to the atmosphere via a common header.\r\n\r\nThe Plant Superintendent is on-site during daytime working hours, Monday to Friday, and conducts daily inspections of the systems.  During off hours, the Plant Superintendent can be notified should the system experience abnormal conditions.  \r\n\r\nThe majority of the ammonia refrigeration equipment is located inside the Engine Rooms, except for the Condensers, which are located on their respective Engine Room Roof.  The evaporators and freezers are located in the cold storage rooms.  Access to the Engine Rooms is limited to authorized personnel and the doors are secured unless the room is occupied.  \r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThe Mesa Cold Storage facility has many safety features, including those implemented on the ammonia refrigeration systems.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with the California Emergency Management Agency's California Accidental Release Prevention (CalARP) program.\r\n\r\nThe majority of the ammonia equipment is maintained inside the Engine Rooms, with the exception of the Condensers located on their respective Engine Room Roof, and the freezers and evaporators located in the cold storage rooms.  The facility and the Engine Rooms are secured at all times.\r\n\r\nThe ammonia refrigeration system employed by Mesa Cold Storage is equipped with various system controls and status indicators intended to minimize potential ammonia related accidents and to allow facility personnel to monitor system operations.  This monitoring system is comprised of liquid level controls, pressure and temperature controls and indicators, as well as other system safeguards and methods for allowing facility personnel to effectively monitor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000027059,
      "SummaryText": "and control refrigeration operations. \r\n\r\nSafety features include relief valves on vessels maintaining a liquid level (to protect vessel integrity) which relieve to the atmosphere on high pressure events, ammonia leak detectors in the Engine Rooms and cold storage areas, and automatic shut down systems that prevent equipment damage and ammonia releases.  \r\n\r\nThe maintenance of the ammonia refrigeration systems is contracted out to a professional refrigeration firm.  This ensures that the system is maintained properly by refrigeration experts and according to industry standards.  The refrigeration contractor is available 24 hours per day.  In addition, visual inspections of the ammonia systems are conducted on weekdays (Monday - Friday) by the Plant Superintendent.\r\n\r\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted and repaired immediately.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nThere have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material in the past five years (March 2005 - March 2010).  In addition, there have been no injuries resulting from an ammonia release, nor any releases or near misses that warranted an internal incident investigation.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe facility has established an action plan in the event of an emergency which could include an ammonia release, blackout, fire, earthquake, etc.  The facility does not offensively respond to releases of ammonia; therefore, the action plan is similar to that of a fire - evacuate the building and not"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000027059,
      "SummaryText": "ify the appropriate responders.  The facility's procedures include contacting the local professional emergency responders (i.e. Fire Department and/or the Haz Mat Team) and the Refrigeration Contractor to assist with response activities.\r\n\r\nMesa Cold Storage maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated as needed to ensure compliance with the CalARP regulations.  Facility personnel receive training regarding the emergency procedures on a seasonal basis. In the event that an ammonia leak is discovered, the person nearest to the leak will alert any personnel in the immediate area who are unaware of the danger.  The Plant Superintendent will determine what procedures and personnel are necessary to remedy the problem.  Emergency agencies will also be notified as necessary as outlined in the Emergency Action Plan.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Process Hazards Analysis study (performed on July 29, 2008), including a Hazard and Operability (HAZOP) study, provided mitigation measures to improve safety at the Mesa Cold Storage facility located at 700 S. Raymond Avenue in Fullerton, California. The Mesa Cold Storage safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\r\n\r\n1. Continue to train all employees in the facility safety plan/programs.\r\n2. Continue to have employee involvement in safety plan development.\r\n3. Continue employee involvement through safety team participation.\r\n4. Continue internal and external safety audits/inspections and implement changes as needed.\r\n\r\nDATA ELEMEN"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000027059,
      "SummaryText": "T NOTES \r\n\r\nMesa Cold Storage is a non-responding facility; therefore, the answers to items 9.2 and 9.4 are no and 9.5 and 9.6 have been left blank. The Emergency Action Plan outlines evacuation routes, notification procedures, and reporting procedures in the event of an emergency which could include fire, ammonia release, blackout, and earthquake."
    }
  ]
}