{
  "FacilityID": 1000023463,
  "FacilityName": "Lineage Logistics  Sprigfield",
  "FacilityStr1": "1985 Airpark Drive",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "OH",
  "FacilityZipCode": "45502",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39023",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "39.839238",
  "FacilityLongDecDegs": "-083.853364",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.lineagelogistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4286407,
  "ParentCompanyName": "Lineage Logistics LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Millard Refigerated Services LLC",
  "OperatorStr1": "13030 Pierce Street",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68144",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "plant engineer",
  "FTE": 48,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000186611",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-04-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Springfield, OH",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-01-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-01-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-01-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000028675,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000023463,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000028959,
          "ProcessID": 1000028675,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034381,
          "ProcessID": 1000028675,
          "ChemicalID": 56,
          "Quantity": 18300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000534381,
          "ProcessID": 1000028675,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023463,
      "SummaryText": "Millard Refrigerated Services, Inc. is proud to inform all interested parties that our company is complying with OSHA's Process Safety Management Standard (PSM), Title 29 Code of Federal Regulations 1910.119, and EPA's Risk Management Program regulations (RMP), Title 40 CFR Part 68.  In addition to other federal, state and local codes applicable to our facility and process. We continue this process to deal with the risks involved with the storage, handling, and use of Anhydrous Ammonia in our facility.\n\n\n\nOur goal is to promote overall worker, public, and plant safety.\n\n\n\nThe Millard Refrigerated Services, Inc. facility is located at 1985 Airpark Drive, Springfield, Ohio.  We distribute some of the finest pork products in the world.  The facility includes piping, finished goods refrigerated storage and distribution, an Ammonia refrigeration engine room and miscellaneous utilities. \n\n\n\nThe refrigeration system required for our production process necessitates the submission of this Risk Management Plan.  The refrigeration system contains approximately 18,300 pounds of anhydrous ammonia.  This surpasses the threshold quantity of 10,000 pounds outlined in Process Safety Management and Risk Management Program regulations.\n\n\n\nMillard Refrigerated Services, Inc. has implemented numerous policies and procedures to enable our facility to prevent the occurrence, and minimize the consequences of significant releases of Anhydrous Ammonia, fires, explosions, and other types of catastrophic accidents.  Overall these programs prevent accidental fatalities, injuries, and illnesses and avoid property as well as environmental damage.\n\n\n\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices that govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary. \n\n\n\nMillard Refrigerated Services, Inc. has organized the information following the Process Safety Management Guidelines. The polices"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023463,
      "SummaryText": " pertaining to the process are incorporated into a complete library, some sets of reference manuals, such as Operation and Maintenance manuals.\n\n\n\nThe PSM/RMP Library incorporates mainly policies including:\n\n\n\nEmployee Participation Guidelines: This policy outlines the commitment between management and employees to establish a program for a successful (safe) program.\n\n\n\nProcess Safety Information: This includes information on the ammonia inventory at the facility, applicable codes, design standards, and information pertaining to the hazards of ammonia (referenced from the IIAR ammonia Data Book).\n\n\n\nProcess Hazard Analysis Program: This program outlines a thorough, orderly, systematic approach for identifying, evaluating, and controlling potential hazards within a process involving potentially hazardous chemicals such as ammonia.\n\n\n\nOperating Procedures: develop, implement, and maintain clearly written, detailed procedures, guidelines, rules, and practices for the safe operation of the ammonia refrigeration process during all operating phases. The operating procedures provide all employees involved in the operation and maintenance of the ammonia refrigeration process with the written information and precautions necessary to safety perform their tasks in a consistent manner.\n\n\n\nContractor Qualification Guidelines: This guideline has been established to verify that the contractors working in the facility are qualified to work on the system, trained in the hazards associated with their work, and made aware of the hazards presented by the facility to the employees of the contractor.\n\n\n\nManagement of Change and Pre-Startup Safety Review Programs: These programs have been developed to monitor and provide a \"checks and balances\" system to monitor changes in the facility and to verify that changes are safe and consistent with company policy.\n\n\n\nMechanical Integrity Program: To prevent or minimize the consequences of catastrophic releases of ammonia, it is important to ensur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000023463,
      "SummaryText": "e process equipment is maintained properly. The purpose of an MI program is to maintain process equipment so that a catastrophic release of ammonia is avoided or properly contained. The emphasis should be on preventive maintenance rather than breakdown maintenance.\n\n\n\nMany more specific programs and policies (Hot Work, Confined Space, Lockout / Tagout, Employee training, etc..) have been developed. For information specific to these see the Risk and Reliability Manager.\n\n\n\nProcess Hazard Analysis Re-validation was completed in September 2010..  The PHA highlighted some deficiencies in the system. These items were addressed as part of the continuous improvement of the facility. These items were addressed on the basis of priority (Injuries to personnel). A PSM compliance audit was completed in May of 2011.\n\n\n\nMillard Refrigerated services, Inc. also incorporates additional safety items such as tagging of all ammonia system valves and components. \n\n\n\nDESCRIPTION OF THE REFRIGERATION SYSTEM\n\n\n\nMillard Refrigerated Services, Inc. in Springfield, Ohio is a meat based distribution facility.  The facility incorporates a standard evaporation and compression ammonia refrigeration system.  \n\n\n\n\n\nSUMMARY OF THE FIVE-YEAR ACCIDENT HISTORY\n\n\n\nMillard Refrigerated Services, Inc. had no reportable releases of over 100 pounds in the last 5 years.\n\n\n\nDESCRIPTION OF THE EMERGENCY RESPONSE PLAN\n\n\n\nIn the event that an ammonia leak is detected employees are to notify the highest ranking supervisor onsite.  The supervisor takes an ammonia level reading using a detection device.  If the supervisor determines that the ammonia level is above 25 ppm an evacuation of the exposure area is ordered.\n\n\n\nThe Supervisor determines if the leak is serious enough that outside assistance is needed.  If outside assistance is needed the local HAZMAT organization is contacted. The Maintenance Manager then takes appropriate procedures, such as Emergency Shutdown Standard Operating Procedures, to control the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000023463,
      "SummaryText": " leak with personal protective devices in place.\n\n\n\nOnce the Incident Commander arrives on scene, a report is given and the Incident Commander takes control of the situation.\n\n\n\nMillard Refrigerated Services, Inc. is committed to continuous improvement of our policies, procedures, and facility. New technology, training techniques, and equipment are continuously being added to our system as they become availabl\n\n"
    }
  ]
}