{
  "FacilityID": 1000079727,
  "FacilityName": "City of Fargo Water Treatment Plant",
  "FacilityStr1": "435 14th Avenue South",
  "FacilityStr2": null,
  "FacilityCity": "Fargo",
  "FacilityState": "ND",
  "FacilityZipCode": "58103",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38017",
  "LEPC": "Cass County (LEPC)",
  "FacilityLatDecDegs": "46.859806",
  "FacilityLongDecDegs": "-096.786528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://fargond.gov",
  "FacilityEmailAddress": "bward@fargond.gov",
  "FacilityDUNS": 70265871,
  "ParentCompanyName": "City of Fargo",
  "Company2Name": null,
  "CompanyDUNS": 70265871,
  "Company2DUNS": 0,
  "OperatorName": "City of Fargo",
  "OperatorStr1": "435 14th Avenue South",
  "OperatorStr2": null,
  "OperatorCity": "Fargo",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58103",
  "OperatorZipCodeExt": null,
  "RMPContact": "Troy B. Hall",
  "RMPTitle": "Water Utility Director",
  "FTE": 32,
  "OtherEPAFacilityID": "ND0000051",
  "EPAFacilityID": "100000034401",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-09-26 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 46.85991,
  "FRS_Long": -96.78809,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "1",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099495,
      "AltID": "Chlorine storage & feed",
      "FacilityID": 1000079727,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100732,
          "ProcessID": 1000099495,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124684,
          "ProcessID": 1000099495,
          "ChemicalID": 62,
          "Quantity": 46000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624684,
          "ProcessID": 1000099495,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079727,
      "SummaryText": "Release Prevention and Emergency Response Policies\n\nThe City of Fargo (City) takes an active role in preventing accidental releases at its water treatment facility by ensuring that its employees are properly trained in the safe operation and maintenance of processes subject to the Part 68 rule.  This training included the safe handling of regulated substances under the rule.  The City has also developed and maintained a risk management policy that contains general safety rules.  Though these rules do not specifically address the covered processes and their regulated substances, compliance with the general rules significantly reduces the potential for accidental releases of the regulated substances.  This facility complies with industry-standard practices for water treatment plants that use chlorine in bulk.\n\nAs for emergency response, the City has established and maintains procedures for emergency notification and response.   These are reviewed with employees on a periodic basis and revised to accommodate changes in staffing when they occur.  In general, the City would deal only with releases of a small amount of a regulated substance.  If the release is determined to be large of if the chemical is released outdoors or has migrated outdoors from a release indoors, the City would immediately notify City of Fargo Fire Department.\n\nFor releases that are judged to require the expertise and resources of an established hazardous materials (HAZMAT) team, the facility would call on the services of the North Dakota Southeast Regional Response Team staffed the by City of Fargo Fire Department.   The City also has a mutual aid agreement with the City of Moorhead, Minnesota and their hazardous material team.\n\nCity management understands its duty to provide a safe working environment at this facility and to take measures to prevent accidents that may impact the surrounding community.  This understanding is reflected in the procedures described and referenced in this document.\n\n\n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079727,
      "SummaryText": "\nFacility and Regulated Substance\n\nThe City of Fargo WTP treats surface water from the Red and Sheyenne rivers to provide drinking water to the community.   It does this through a series of physical and chemical treatment operations that include two treatment facilities.   The lime softening treatment facility includes pretreatment, rapid mix, flocculation and sedimentation, primary and secondary softening, ozone disinfection, and final media filtration.  The membrane softening treatment facility includes pretreatment, rapid mix, flocculation and sedimentation, ultrafiltration, reverse osmosis softening, ozone disinfection, and GAC filtration.\n\nThe treated water, now ready for use by the public, is transferred to a large reservoir and pumped into the distribution system.  The design capacity of the treatment plant is 45 million gallons per day.\n\nThe regulated substances stored, handled, and used at this facility are anhydrous ammonia and chlorine.   The anhydrous ammonia is stored in one 2000-gallon tank with a maximum capacity of 9100 lbs. and is below the EPA RMP threshold regulatory quantity of 10,000 lbs.    The chlorine is stored in one-ton containers with a maximum intended inventory of 23 containers (46,000 lbs.) on-site and is above the threshold regulatory quantity of 2,500 lbs.   Accordingly, the RMP will only address chlorine. \n\n\n\nAccidental Release Prevention Program\n\nThe facility's prevention program for chlorine complies with EPA's 40 CRF part 68 rule for program 2 processes.   To maintain this compliance, the City has in place many procedural and technological safeguards.  The procedural safeguards include an employee-training program ad operating and maintenance procedures for those employees involved in the covered processes.  The technological safeguards include controls, sensors, alarms, and industry-standard systems.  All of these serve to prevent unintended releases of chlorine.\n\nShould the prevention program fail to prevent a release, the WTP i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079727,
      "SummaryText": "s equipped with engineering controls designed to minimize the effect of the release on the surrounding community.   For chlorine, the storage containers are kept inside of a building to mitigate the effects of a release.   The plant also has a scrubber capable of neutralizing one ton of chlorine, the amount stored in the largest single container onsite.  The scrubber is maintained on a regular basis to ensure proper operation if needed during a chlorine release. \n\n\n\nFive-year Accident History\n\nWithin the last five years, this facility has not had an accident involving chlorine that caused deaths, injuries, property or environmental damage, evacuations, or sheltering in place.\n\n\n\nEmergency Response Program\n\nThis facility has established and maintains an emergency action plan that is coordinated with local response agencies, such as the North Dakota Southeast Regional Response Team (staffed by City of Fargo Fire Department).  The goals of the plan are to protect onsite employees from the hazardous effects of the releases and to minimize the effects of the releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.   It is also submitted to the Fire Department for review and comment.\n\nCity employees handle incidental releases of chlorine and are trained and equipped to do so.\n\n\n\nPlanned Changes to Improve Safety\n\nIdeas for changes to improve safety are actively sought from the employees.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.   The City has purchased a new city-wide web-based training system that allows specific and user created training and safety information.   This will allow improvements in the safety and training for regulated processes.   \n\nDuring the review of the risk management plan, hazard reviews were conducted with key employees to meet the prevention program requirements.  During"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079727,
      "SummaryText": " these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been or is being considered and evaluated for implementation.   This evaluation process will provide all affected employees with a heightened awareness of safety issues related to the covered processes. \n\n"
    }
  ]
}