{
  "FacilityID": 1000080058,
  "FacilityName": "Water Reclamation Plant",
  "FacilityStr1": "1603 Crossley Road",
  "FacilityStr2": null,
  "FacilityCity": "Palm Springs",
  "FacilityState": "CA",
  "FacilityZipCode": "92264",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.803781",
  "FacilityLongDecDegs": "-116.487822",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dwa.org",
  "FacilityEmailAddress": "desertwater@dwa.org",
  "FacilityDUNS": 58228479,
  "ParentCompanyName": "Desert Water Agency",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Desert Water Agency",
  "OperatorStr1": "1200 S Gene Autry Trail",
  "OperatorStr2": null,
  "OperatorCity": "Palm Springs",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92264",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eddie Gonzalez",
  "RMPTitle": "Facilities & Safety Officer",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000147478",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-04-12 00:00:00",
  "SafetyInspectionBy": "ACWA/JPIA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.7974,
  "FRS_Long": -116.5186,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099930,
      "AltID": "Chlorination System",
      "FacilityID": 1000080058,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101173,
          "ProcessID": 1000099930,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125191,
          "ProcessID": 1000099930,
          "ChemicalID": 62,
          "Quantity": 27000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625191,
          "ProcessID": 1000099930,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080058,
      "SummaryText": "The Desert Water Agency's Risk Management Program was developed to comply with the requirements of OSHA's Process Safety Management Program (PSM), US EPA's Risk Management Program, and California's Accidental Release Prevention (CalARP) Program for Desert Water Agency facility subject to these regulations.  The purpose of this program is to reduce or eliminate the possibility of accidental release of substances regulated under these guidelines.                    \n\nIn Desert Water Agency's daily operation, chlorine gas is used for the disinfection of potable and reclaimed water.  Currently chlorine gas is stored and used at the Agency's Wastewater Reclamation Facility in quantities greater than the process threshold limits specified under OSHA PSM, US EPA RMP, and CalARP regulations.  The regulations require that a Risk Management Program be developed and submitted for any processes that includes the use of quantities of regulated substances greater than the process threshold limits.                    \n\nDesert Water Agency currently uses the Reclamation Facility as a chlorine gas storage and chlorination facility.  Vessels stored at the facility include 150-lb. cylinders and one-ton containers.  Maximum intended chlorine gas inventory calculations performed in the RMP show the maximum intended inventory of chlorine gas stored at the Reclamation Facilities to be 27,000 lbs.  This amount is greater than the EPA's RMP Threshold Limit of 2,500 lbs. and OSHA's PSM Threshold limit of 1,500 lbs., and therefore falls under these regulations.                    \n\nSince this facility falls under OSHA's PSM regulations and there is a potential for chlorine gas to reach offsite receptors, the Chlorination Process at the Reclamation Facility falls under Program Level 3 of the RMP's regulations.                    \n\nIn accordance with regulatory requirements, the Agency reviewed the accident history at the Reclamation Facility for the past five years.  The Agency has not experienced an accident resulting from an accidental release of chl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080058,
      "SummaryText": "orine gas, as defined under the EPA RMP Regulations at this Facility in the past five years.                    \n\nTherefore, no accident history exists.                    \n\nAn Offsite Consequence Analysis was performed during the program development.  A worst-case release scenario and alternate-case release scenarios were performed to assess the possible effects of an accidental release.                    \n\nThe RMP was prepared in accordance with regulation requirements and includes EPA Program 3 Prevention Elements.  These prevention elements are outlined in the regulations and were developed and adopted by the Agency for the facility to reduce or eliminate the possibility of the occurrence of an accidental release of chlorine gas.                    \n\nA listing of some of the elements included in the Agency's Program is as follows: \n\n-    Executive Summary                    '\n\n-    Management System \n\n-    Process Safety Information                    \n\n-    Process Hazards Analysis Revalidation \n\n-    Operating Procedures                    \n\n-    Training \n\n-    Mechanical Integrity    \n\n-    Management of Change \n\n-    Pre-Startup Safety Review \n\n-    Compliance Audits \n\n-    Incident Investigation \n\n-    Employee Participation \n\n-    Hot Work Permit \n\n-    Contractors    \n\n-    Emergency Planning and Response \n\n-    Trade Secrets                    \n\nThe Agency has also developed an Emergency Response Program to minimize the duration and effects of an accidental release, thereby protecting the public health and the environment.  The Agency maintains up-to- date written Emergency Action Plans (EAP's) and effective response capabilities for the covered process.                    \n\nComprehensive EAP's, emergency response training and drills are an integral part of the Agency's effort to ensure quick and effective emergency response.  The Agency's response personnel have been trained in accordance with HAZWOPER guidelines and are HAZWOPER Incident Commanders/On-Scene Managers.  The Agency has adopted SEMS and works within the County of Riverside's operational area as a Special District.                    \n\nAs part of the development of the Prevention Elements"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080058,
      "SummaryText": ", the Agency performed a 1999, 2002, 2005, 2008, 2013 and 2019 Process Hazard Analysis (PHA).  These Analyses included a review of chlorine gas safety devices currently used at the Reclamation Facility.  Based upon results of the 1999 Process Hazard Analysis, the Agency improved the active mitigation measures for containment of chlorine gas in the event of a leak; hence, a Chlorine Gas Scrubber was installed in 2000.\n\nAdditional safety measures were installed and discussed during a June 2005 PHA.  An Emergency Shut-Off System was installed to provide a secondary containment mechanism between the pressurized one-ton containers and the vacuum regulator.  In the event of a chlorine gas release, the emergency shut-off valve will close.\n\nIn result from the November 2008 PHA revalidation a placard was installed in the 1-ton cylinder storage area that says, \"No Stacking more than 2 rows high\".  This would help mitigate operators from stacking the cylinders more than two high and minimize the potential for cylinder rolling."
    }
  ]
}