{
  "FacilityID": 1000029096,
  "FacilityName": "U. S. Amines - Portsmouth Plant",
  "FacilityStr1": "3230 West Norfolk Road",
  "FacilityStr2": null,
  "FacilityCity": "Portsmouth",
  "FacilityState": "VA",
  "FacilityZipCode": "23703",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51740",
  "LEPC": "Portsmouth City LEPC",
  "FacilityLatDecDegs": "36.861085",
  "FacilityLongDecDegs": "-076.344735",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.usamines.com",
  "FacilityEmailAddress": "ejburr@usamines.com",
  "FacilityDUNS": 128489148,
  "ParentCompanyName": "U. S. Amines Limited",
  "Company2Name": null,
  "CompanyDUNS": 128489510,
  "Company2DUNS": 0,
  "OperatorName": "U. S. Amines (Portsmouth) LLC",
  "OperatorStr1": "14086 US Hwy 43 N",
  "OperatorStr2": null,
  "OperatorCity": "Axis",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36505",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eldon Burr",
  "RMPTitle": "VP Manufacturing",
  "FTE": 24,
  "OtherEPAFacilityID": "VAR000502203",
  "EPAFacilityID": "100000077105",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-07-12 00:00:00",
  "SafetyInspectionBy": "Portsmouth City Fire Marshall",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-06-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 36.86134,
  "FRS_Long": -76.34517,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000035524,
      "AltID": "Amines Production",
      "FacilityID": 1000029096,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000035886,
          "ProcessID": 1000035524,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043048,
          "ProcessID": 1000035524,
          "ChemicalID": 56,
          "Quantity": 128000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000043049,
          "ProcessID": 1000035524,
          "ChemicalID": 23,
          "Quantity": 185000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 23,
            "ChemicalName": "Allylamine  [2-Propen-1-amine]",
            "CASNumber": "107-11-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000043050,
          "ProcessID": 1000035524,
          "ChemicalID": 103,
          "Quantity": 230000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 103,
            "ChemicalName": "Ethylamine  [Ethanamine]",
            "CASNumber": "75-04-7",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000543048,
          "ProcessID": 1000035524,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000543049,
          "ProcessID": 1000035524,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000543050,
          "ProcessID": 1000035524,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029096,
      "SummaryText": "Program Overview:\n\n\n\nAt US Amines, we are dedicated to being an industry leader in protecting the environment, the health, and safety of both our employees and the communities in which we operate.  Like our community neighbors, the people who work at the Portsmouth site want a clean, safe environment, with no illnesses or injuries at work, home, or play.  That is why US Amines has a zero safety incident goal.\n\n\n\nOur Facility:\n\n\n\nWe manufacture several different chemicals in the family of amines.  Our products are used to produce agricultural chemicals, engineering resins, and drugs.  We have about 14 site employees and 10 resident contractors.  US Amines uses a variety of raw materials including the chemicals Anhydrous Ammonia and Ethylamine to produce several amines including Allylamine within its amines plant operations at the Portsmouth, Virginia site.  \n\n\n\nAmmonia: Operations of the storage locations for ammonia and the operations use of ammonia fall under the site PSM program. Ammonia is stored as a liquefied gas. The storage locations are covered by automatic and/or manual fire suppression systems.  Though ammonia is not typically considered flammable, the water systems could be used to dissolve the liquefied gas and reducing the amount of ammonia that would evaporate.\n\n\n\nAllylamine: Operations of the storage locations and production of Allylamine fall under the site PSM program. The storage locations are covered by automatic and/or manual fire suppression systems. The storage areas are curbed or diked with hold-up volume adequate to contain the tank contents where spills could be contained and pumped into containment tanks. \n\n\n\nEthylamine: Operations of the storage locations and the operations use of Ethylamine fall under the site PSM program. The storage locations are covered by automatic and/or manual fire suppression systems. The storage areas are diked with hold-up volume adequate to contain the tank contents where spills would be covered with fire fighti"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029096,
      "SummaryText": "ng foam and liquids pumped to containment tanks.\n\n\n\nPlant Safety Activities:\n\n\n\nThe site has a plant manager who oversees all plant activities.  The staff includes a production manager, maintenance manager, training coordinator, technical support, and a part-time nurse who oversees the plant medical program.  All plant employees must attend at least one safety meeting per month.  Safety meetings include training on regulatory requirements and plant specific issues.  The company also uses a Computer Based Training program (CBT) to help facilitate regulatory training.  Testing is conducted for all safety training to insure the information is understood.\n\n\n\nPlant operators are members of the emergency response team.  They are trained in the specifics of incident command, emergency response, and medical response.  The plant conducts weekly tests of the plant alarm system and conducts emergency response drills with the local fire department.\n\n\n\nThe US Amines Portsmouth Plant participates in local community activities and works the Local Emergency Planning Committee (LEPC) to promote safety in our operations.  This continued partnership ensures that the community where we all live and work will be a safe place now and in the future.\n\n\n\nPlant 5-Year Accident History: \n\n\n\nRMP regulations require us to tell the public about accidents involving the listed chemicals that resulted in injuries or serious on-site or off-site impact. \n\n\n\nThere were no RMP incidents.\n\n\n\n\n\nHow We Keep Our Plant Safe Now and in the Future:\n\n\n\nThe US Amines Portsmouth plant is subject to and complies with the EPA RMP Process Safety Regulation and OSHA Process Safety Regulation through our Process Safety Management Program.  Compliance is the first step to insure process safety but we also do things that go beyond compliance to insure safety.  The Portsmouth Plant manages all plant processes per our Process Safety Management program.  Here are some of the key concepts in our process safety program:\n\n\n\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029096,
      "SummaryText": "People: Our Most Valuable Safety Resource\n\n1. All plant operators are trained and certified in the jobs they do.\n\n2. All employees have the authority to shut down any process or stop any job, in order to maintain safe operation.\n\n3. A self-paced training program covers job specific tasks, principles of chemical processing, safety, and regulatory issues.\n\n\n\nEquipment: Maintained in Safe Condition\n\n1. All plant process equipment is subjected to mechanical integrity inspections to look for corrosion or wear.\n\n2. Safety devices such as pressure relief valves and shutdown systems are inspected and tested on a regular basis.\n\n3. The use of a thermo-graphic camera allows us to check for temperature deviations in equipment, check for electrical faults, and verify levels.\n\n4. Glass level gauges have been replaced with metal, magnetically-coupled gauges or differential pressure gauges to eliminate the issue of glass breakage. \n\n5. Quarter-turn valves (1\"  or less) are fitted with oval handles to reduce the risk of releases from bumping a straight handle valve open.\n\n\n\nSafety Systems: Protective Safety Net\n\n1. All storage tanks and process vessels are protected against over-pressure by safety relief valves, much like the safety relief valve on your home water heater.\n\n2. Process safety systems are programmed in our process control computers. If a designated level, pressure, temperature, or other parameter goes out of range, the process will shut down automatically.\n\n3. Video cameras monitor key pieces of process equipment and the plant perimeter.\n\n4. All plant modifications and procedure changes undergo a management of change process that involves operations, maintenance, engineering, and management review.\n\n\n\nPrepared: For Emergency Response\n\n1. All plant operators are trained in emergency response and must pass annual medical fitness for duty tests.\n\n2. The plant has an extensive fire fighting system with monitor nozzles, hoses, foam generating capability, and water reservoi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029096,
      "SummaryText": "r. \n\n3. The plant has a portable emergency operations trailer complete with air monitoring equipment, radio and cellular phone systems, emergency response, and decontamination materials.\n\n4. The plant alarm system is tested weekly to ensure that employees know how to use it.\n\n5. Personnel are trained in first aid and CPR.\n\n"
    }
  ]
}