{
  "FacilityID": 1000060199,
  "FacilityName": "Enterprise Princeton Terminal",
  "FacilityStr1": "3217 South 950 East",
  "FacilityStr2": "(1.2 mi South of Highway 64 West)",
  "FacilityCity": "Oakland City",
  "FacilityState": "IN",
  "FacilityZipCode": "47660",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18051",
  "LEPC": "Gibson County LEPC",
  "FacilityLatDecDegs": "38.308572",
  "FacilityLongDecDegs": "-087.390037",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enterprise Terminals and Storage, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Enterprise Products Operating LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000178719",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-07-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-10-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-10-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-10-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.30889,
  "FRS_Long": -87.39117,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000075198,
      "AltID": "Storage/Loading of LPG",
      "FacilityID": 1000060199,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000093019,
          "ProcessID": 1000075198,
          "ChemicalID": 98,
          "Quantity": 28000000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000093020,
          "ProcessID": 1000075198,
          "ChemicalID": 105,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000076379,
          "ProcessID": 1000075198,
          "NAICSCode": "488999",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000076380,
          "ProcessID": 1000075198,
          "NAICSCode": "49319",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000060199,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Columbia Township Fire Department",
    "CoordinatingAgencyPhone": "8127494037",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060199,
      "SummaryText": "Princeton Terminal\n\nEnterprise Terminals and Storage, LLC.\n\nExecutive Summary\n\nRisk Management Plan\n\nEPA Identifier:  1000 0017 8719\n\n\n\nAccidental Release Prevention and Response\n\nThe Princeton Terminal has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of the facility's processes.  It is the practice of Enterprise Terminals and Storage LLC  (Enterprise) to implement reasonable controls to prevent foreseeable releases of substances.  However, if a release does occur, trained personnel will respond to, control and contain the release.\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\nThe Princeton Terminal located in Gibson County, Indiana is owned by Enterprise Terminals and Storage LLC and is operated by Enterprise\n\nThe Princeton Terminal is a wholesale terminal facility for the storage and loading of propane.  The propane is received from an affiliated underground pipeline and is stored in two above ground storage tanks or in one underground storage cavern.  The stored propane is transferred from the storage bullet tanks into highway transport trucks for delivery of the propane to wholesale customers, or may be returned to the pipeline for bulk delivery elsewhere.  Ethyl mercaptan, stored in a small tank near the truck loading rack, is added to the propane during the truck filling operation as an odorant to aid in propane leak detection.\n\nThe Princeton Terminal was evaluated to determine if any regulated flammable or toxic substances exceeded the threshold quantity.  Enterprise identified the regulated substances and quantities kept on site based on facility knowledge.  Listed flammable substances which are stored above the threshold quantities at the Princeton Terminal are propane and ethyl mercaptan.  The Terminal is subject to the Occupational Safety a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060199,
      "SummaryText": "nd Health Administration (OSHA) Process Safety Management (PSM) regulation and is classified as a Program Level 3 site under the EPA RMP program.  Normal butane and / or isobutane may be stored at the facility in four spherical tanks that are part of DOT pipeline operations.  These butanes are in storage incident to transportation and are exempt from the RMP rule.  Additionally, refined gasoline, natural gasoline and number 2 fuel oil are stored at Princeton and are redelivered either as return to the inlet pipeline or to transport trucks.  The vapor pressure of these stored products is above 14.7 psia at 100 degrees Fahrenheit, and they are also exempt from coverage by the RMP rule. \n\nOffsite Consequence Analysis Results\n\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.\n\n\n\nGeneral Accident Release Prevention Program\n\nThe following is a summary of the accident prevention program in place at the Princeton Terminal.  The operations at the terminal are regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation, and are also subject to the OSHA PSM Standard.  This summary addresses each of the PSM program elements and describes the management system in place to implement the accident prevention program.\n\n\n\nEmployee Participation\n\nActive employee participation and involvement in the development and implementation of the terminal's PSM program is an important step toward achieving the objective to prevent or minimize the consequences of catastrophic releases of toxic, reactive, flammable or explosive chemicals.  Employee involvement helps to ensure that all perspectives regarding PSM compliance and accident prevention are considered and that the best ideas are implemented.  Open communications are encouraged between supervisors and employees regarding all aspects of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060199,
      "SummaryText": " safety and health issues concerning the employees and the public.\n\n\n\nEnterprise strongly promotes employee involvement in safety issues through existing programs.  These programs include regularly scheduled safety meetings, tail-gate safety meetings, hazard communications, Safety Suggestion Forms, a \"near-miss\" reporting system and special training programs such as emergency response training, first aid training, etc.\n\n\n\nEnterprise actively seeks employee involvement in the development and conduct of all accident prevention activities through the appropriate existing safety programs.  Accident prevention is discussed at the regularly scheduled safety meetings and/or during special training sessions if necessary.  Employees are encouraged to discuss accident prevention with their supervisors and to bring any questions, comments or suggestions forward for open discussion.\n\n\n\nProcess Safety Information\n\nComplete and accurate written process safety information concerning process chemicals, process technology and process equipment is essential to an effective PSM and RMP program as well as completing and maintaining a process hazard analysis.  The process safety information will be useful to the operators, the team performing a process hazard analysis and those in charge of updating the emergency preparedness plans.  Process safety information is readily available to all employees.  Enterprise keeps a variety of technical documents that are used to help maintain a safe operating process.  These documents address chemical properties and associated hazards, limits for key process parameters, specific chemicals inventories and equipment design basis/configuration information.\n\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations is provided in material safety data sheets (MSDS).\n\nEnterprise also maintains numerous technical documents that provide information about the design and construction of process equipment"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000060199,
      "SummaryText": ".  This information includes materials of construction, design pressure ratings, temperature ratings and electrical rating of equipment.  This information in combination with written procedures and trained personnel provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\n\nProcess Hazard Analysis (PHA)\n\nThe Princeton Terminal has a comprehensive program to help ensure that hazards associated with the various operations are identified and controlled.  Within this program, each portion of the facility is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nEnterprise primarily uses the hazard and operability (HAZOP) and PHA Revalidation Checklist method analysis techniques to perform these evaluations.  The analyses are conducted using a team of Enterprise staff which has operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\nThe PHA team findings are forwarded to local and corporate management for resolution.  Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team.  This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention.  All approved mitigation options in response to PHA team findings are tracked until they are completed.  The final resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the terminal periodically updates an"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000060199,
      "SummaryText": "d revalidates the hazard analysis results.  These periodic reviews are conducted at least every five years and will be conducted at this frequency until the process is no longer operating.  The results and findings from these updates are documented and retained.  Once again, the responses to the team findings are also documented and retained.\n\n\n\nOperating Procedures\n\nThe Princeton Terminal maintains written procedures that address various modes of process operations such as; (1) start-up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown and (6) initial startup of a new process.  These procedures provide guidance for experienced operators and also provide the basis for training new operators.  Operating procedures are periodically reviewed and annually certified as current and accurate.  The review and certification process involves both operators and technical staff.\n\nThe intent of the operating procedures is to provide workable, useful and clearly written instructions for conducting operating activities.  To have effective operating procedures, the task and procedures directly and indirectly related to the covered process must be appropriate, clear, consistent and most importantly communicated to employees.  Operating procedures are specific instructions or details on what steps are taken or followed in carrying out the stated procedures.  The specific instructions include the applicable safety precautions and appropriate information on safety implications.\n\n\n\nTraining\n\nIn addition to training on operating procedures, the Princeton Terminal has a comprehensive training program for all employees involved in operating the terminal.  New employees receive basic training in pipeline, storage and terminal operations.  In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducte"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000060199,
      "SummaryText": "d at lease every three years.  All of this training is documented for each operator including the means to verify that the operator understood the training.\n\n\n\nContractors\n\nThe Princeton Terminal uses contractors during periods of increased maintenance or construction activities.  Because some contractors work on or near the terminal storage and loading equipment, the terminal has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have appropriate knowledge and skills, (3) are aware of the hazards of their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site specific safety rules and (6) inform terminal personnel of any hazards that they find while performing their work.  This is accomplished by providing contractors with an orientation session that covers (1) a process overview, (2) information about the safety and health hazards, (3) emergency response plan requirements and (4) safe work practices prior to beginning their work.  In addition, the Princeton Terminal evaluates contractor safety programs and performance during the contractor selection process.  Enterprise personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\n\n\n\n\nPre-Startup Safety Review (PSSR)\n\nThe Princeton Terminal conducts a PSSR on any new facility or facility modification that requires a change in process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with design specifications and that all supporting systems are operationally ready.  The PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000060199,
      "SummaryText": " are properly implemented.\n\n\n\nMechanical Integrity\n\nThe Princeton Terminal has well established practices and procedures for maintaining process equipment.  The basic aspects of this program include (1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting equipment deficiencies, when identified and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n\nEnterprise incorporates quality assurance measures into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\n\n\nSafe Work Practices\n\nThe Princeton Terminal has long standing safe work practices in place to help ensure worker and process safety.  Examples of these include: (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work) and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely\n\n\n\nManagement of Change\n\nThe Princeton Terminal has a comprehensive system to manage change to all covered processes.  This system requires that changes to items such as terminal equipment, technology (including terminal operating conditions), procedures and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to ensure that adequate controls are in place to manage any new hazards and to verify that existing controls have not be"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000060199,
      "SummaryText": "en compromised by the change.  Affected chemical hazard information, process operating limits and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the changes.\n\n\n\nIncident Investigation\n\nThe Princeton Terminal promptly investigates all incidents that resulted in or reasonably could have resulted in, a fire/explosion, major property damage, environmental loss, or personal injury.  The goal of each investigation is to gather the facts, determine the root cause, and develop corrective actions to prevent the reoccurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendation(s) to prevent a reoccurrence and forwards these results to the business management team for resolution.\n\n\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, Enterprise periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every three years.  Both hourly and staff personnel participate as audit team members.  The audit team develops findings that are forwarded to terminal management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are resolved and completed.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\n\n\nChemical Specific Prevention Steps\n\nThe operations at the Princeton Terminal have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\nUniversal Prevention Activities\n\nThe accident prevention program summarized previously is applied to all RMP covered operations at t"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000060199,
      "SummaryText": "he Princeton Terminal.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\nSpecialized Safety Features\n\nThe Princeton Terminal has safety features throughout the terminal area to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\n\n\n\n\n\nRelease Detection\n\n* Hydrocarbon (hazardous gas) detectors and alarms in the storage , loading and dehydration areas\n\n* Flame detectors in the storage, loading and dehydration areas\n\n\n\nRelease Containment and Control\n\n* Area relief valves and vents that discharge to a flare to capture and incinerate episodic releases.\n\n* Valves to permit isolation of the process (manual or automated).\n\n* Automatic shutdown systems for specific process parameters (e.g., high flow, low pressure).\n\n* Secondary containment to contain any release of liquid ethyl mercaptan.\n\n* Redundant equipment and instrumentation where advisable\n\n* Dual mechanical seals with seal failure alarms installed on hydrocarbon liquid pumps, where feasible. \n\n* Storage tank emergency shut down valves\n\n* Loading line excess flow valves\n\n* Atmospheric relief devices.\n\n\n\nRelease Mitigation\n\n* Hand-held fire extinguishers \n\n* Personnel trained in emergency response and procedures.\n\n* Personnel protective equipment (e.g., chemical protective clothing, flame retardant coveralls, hard hats, safety glasses, etc.)\n\n\n\nFive Year Accident History\n\nThe Princeton Terminal has an excellent record of accident prevention.  Over the past five years there have been no large or small releases, with no injuries or offsite consequences.  \n\n\n\nEmergency Procedures Information\n\nThe Princeton Terminal maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosio"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000060199,
      "SummaryText": "n if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the terminal facilities.   \n\nThe overall emergency procedure program for the Princeton Terminal is coordinated with the Gibson County Local Emergency Planning Committee (LEPC).  This coordination includes periodic meetings with the anticipated first responder, the Columbia Township Fire Department.  The Princeton Terminal has around-the-clock communications capability with the Columbia Township Fire Department, which provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to providing information on the emergency plan to the LEPC, the Princeton Terminal conducts periodic site orientations and emergency drills that involve the emergency response organizations.  The Princeton Terminal also provides periodic refresher training to local emergency responders regarding the hazards of regulated substances in the terminal.  The Terminal has also conducted one multi-department mock drill involving additional volunteer fire departments that could be called upon to respond in case of a serious emergency.\n\n\n\nPlanned Changes to Improve Safety\n\nThe Princeton Terminal resolves all findings from PHA's, some of which result in modifications to the storage and loading operations.  Additionally, employee recommendations to improve the safety of the storage and loading operations are reviewed and implemented if they are judged to be effective in improving terminal safety or reducing accident risk.  At the present time, the following change that should help to improve operating safety is planned at the terminal:\n\n\n\n* Enterprise is in the process of reviewing the entire 14-issue safety management/accident prevention program to e"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000060199,
      "SummaryText": "nsure that it can be effectively implemented across the wide variety of covered facilities operated by Enterprise.\n\n\n\n* The Princeton Terminal recently completed a cavern safety upgrade project which included installing ESD valves on the cavern system.\n\n"
    }
  ]
}