{
  "FacilityID": 1000023303,
  "FacilityName": "RG Steel Sparrows Point, LLC",
  "FacilityStr1": "1430 Sparrows Point Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21219",
  "Facility4DigitZipExt": "1039",
  "FacilityCountyFIPS": "24005",
  "LEPC": "Baltimore County, MD",
  "FacilityLatDecDegs": "39.219611",
  "FacilityLongDecDegs": "-76.471216",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": "rg-steel.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 808561372,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "RG Steel Sparrows Point, LLC",
  "OperatorStr1": "1430 Sparrows Point Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21219",
  "OperatorZipCodeExt": "1039",
  "FTE": 2300,
  "OtherEPAFacilityID": "21219BTHLHDUALH",
  "EPAFacilityID": "100000078113",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "24-005-00147A",
  "SafetyInspectionDate": "2011-02-10 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-08-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-08-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-08-10 00:00:00",
  "DeRegistrationEffectiveDate": "2012-09-15 00:00:00",
  "AnniversaryDate": "2016-08-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.2125,
  "FRS_Long": -76.49583,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R03",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000028458,
      "AltID": "Tin Mill & Coating Op",
      "FacilityID": 1000023303,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034048,
          "ProcessID": 1000028458,
          "ChemicalID": 149,
          "Quantity": 21497.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000028762,
          "ProcessID": 1000028458,
          "NAICSCode": "331111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000028459,
      "AltID": "Cold Sheet Mill",
      "FacilityID": 1000023303,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034049,
          "ProcessID": 1000028459,
          "ChemicalID": 149,
          "Quantity": 10748.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000028763,
          "ProcessID": 1000028459,
          "NAICSCode": "331111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000023303,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2011-06-14 00:00:00",
    "ERTrainingDate": "2010-05-31 00:00:00",
    "CoordinatingAgencyName": "Baltimore County Fire Station #57",
    "CoordinatingAgencyPhone": "4108877526",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "49 CFR 172"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023303,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nIt is RG Steel, LLC's policy that the employees and facilities operate in a manner that protects the health and welfare of our employees, visitors, the community at large and the environment.  \n\nHealth, safety and environmental stewardship are a core value and the primary focus of our daily work.  Each employee is responsible for doing their part in maintaining a safe and healthful workplace. Adhering to safe work practices and following all of the rules and elements of the Company's Safety Program is a condition of employment at RG Steel.  Likewise, compliance with environmental programs is a key responsibility of every RG Steel employee in accordance with their roles and responsibility within the organization.\n\nRG Steel, LLC will maintain health, safety, and environmental (HSE) programs conforming to the best practices of global manufacturing organizations.  These practices include policies for accidental release prevention and emergency response and shall be implemented within the framework of our ISO 14001 and OHSAS 18001 certified management systems.\n\n\nOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED\nThe primary purpose of this facility is the manufacturing of iron and steel.   An annealing process is performed at several finishing operations as part of the manufacturing of sheet steel. Annealing is a heat treatment wherein a material is altered, causing changes in its properties such as strength and hardness.  This process is performed by substantially heating the material for a while and allowing it to cool. \n\nAnnealing is carried out in a special atmosphere, either hydrogen or a mixture of hydrogen and nitrogen.   Annealing gas is produced for the steel mill by blending together nitrogen and hydrogen gas. The hydrogen is supplied from three liquid hydrogen storage tanks that have a capacity of 18,150 gallons each.  One tank is located at the Cold Sheet Mill Operation where the hydrogen annealing "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023303,
      "SummaryText": "process uses 100% hydrogen-based annealing gas.  The other two storage tanks are co-located at the Tin Mill and Coating Operations.  Continuous and box annealing processes are performed at the Tin Mill Operation while continuous annealing is performed at the Coating Operations.  These processes use mixtures of hydrogen and nitrogen annealing gas, hydrogen gas ranges in concentration from 4 to 6% of the mixture.  The liquid capacity of the storage tanks represents the significant majority of hydrogen involved in the processes.  The storage tank capacity of hydrogen has not changed in the last five years.\n\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nRG Steel Sparrows Point has the following plans in place that outline our accidental release prevention program:\n\nA?    Fire Prevention Plan\nA?    Contingency Plan, Emergency Procedures, Preparedness and Prevention Plans\nA?    Spill Prevention, Control and Countermeasure Plan (SPCC)\nA?    Hazardous Materials Security Plan\n\nSpecifically for hydrogen, prevention steps for flammable and combustible liquids are outlined in the RG Steel Sparrows Point Fire Prevention Plan.\n \n\nFIVE-YEAR ACCIDENT HISTORY\nIn the last five years there have been no accidental releases of hydrogen at the facility.\n\n\nEMERGENCY RESPONSE PROGRAM\nRG Steel Sparrows Point has an emergency response plan, which is known as the RG Steel Sparrows Point Disaster Plan.  The Plan provides for the prompt, orderly and effective mobilization and coordination of key plant, community and security personnel in response to a disaster.  A disaster is defined as any incident bringing a potential for great damage, loss or destruction to equipA?ment, employees or production that necessitates the use of community assistance.  Examples of disasters are explosions, fires, hazardous chemical accidents, bomb threats, transportation accidents, riots, industrial accidents and natural disasters.  Procedures for emergency evacuation procedures and e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000023303,
      "SummaryText": "xit route assignments, procedures to account for all employees after emergency evacuation has been completed, and rescue and medical duties for those employees who perform them are described in the disaster plan.\n  \nThe initial response in any crisis or disaster situation will be the immediate notification of emergency personnel to respond and to take the necessary actions to minimize injury and loss of life.  The notification process listed in the RG Steel Sparrows Point Crisis Management Plan will be followed for emergencies that have the potential to develop into a disaster or a crisis situation.\n\nAdditionally, RG Steel Sparrows Point has the following plans in place to address health, safety, and environmental related incidents:\n\nA?  Fire Prevention Plan \n    - Informs employees of its purpose, preferred means of reporting fires and other emergencies, types of evacuations to be used, and the alarm systems\n\nA?  Environmental Response Contact Procedures \n    - Includes reporting information for a variety of environmental incidents, malfunctions, non-compliance incidents, spills and other emergencies\n\nInitial, annual, and periodic safety and environmental training of employees and contractors is conducted on an ongoing basis.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\nHealth, safety and environmental stewardship are a core value and the primary focus of the Company..  Adhering to safe work practices and following all of the rules and elements of the Company's Safety Program is a condition of employment at RG Steel.  At RG Steel, our safety programs are based on the following commitments to prevent injury and illness by: \n    I.   Enacting proper health and safety actions and practices at work through personal examples; \n    II.  Requiring safe job performance by employees and contractors;\n    III. Ensuring safe work environments by taking the necessary actions to prevent unsafe conditions and risky actions in the work place; \n    IV.  Providing continuing and mandatory safety training.\n\n"
    }
  ]
}