{
  "FacilityID": 1000015439,
  "FacilityName": "Llano Logistic, Inc.",
  "FacilityStr1": "200 Freedom Drive",
  "FacilityStr2": null,
  "FacilityCity": "Roanoke",
  "FacilityState": "TX",
  "FacilityZipCode": "76262",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48121",
  "LEPC": "Denton County LEPC",
  "FacilityLatDecDegs": "32.996583",
  "FacilityLongDecDegs": "-97.243083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "CO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.unitedtexas.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "United Supermarkets",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Llano Logistic",
  "OperatorStr1": "200 Freedom Drive",
  "OperatorStr2": null,
  "OperatorCity": "Roanoke",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76262",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000212334",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-12-10 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-08-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-08-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-08-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000019347,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000015439,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000023018,
          "ProcessID": 1000019347,
          "ChemicalID": 56,
          "Quantity": 22304.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000019733,
          "ProcessID": 1000019347,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000016117,
              "Process_NAICS_ID": 1000019733,
              "SafetyReviewDate": "2011-11-01 00:00:00",
              "PHA_Date": "2010-08-04 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-08-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "Ammonia sensors",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "Safety Shutdowns and computer controls",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-09-01 00:00:00",
              "TrainingReviewDate": "2012-04-16 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-06-04 00:00:00",
              "EquipmentInspectionDate": "2011-08-01 00:00:00",
              "EquipmentTested": "process",
              "ChangeMgmtDate": "2012-01-30 00:00:00",
              "ChangeMgmtReviewDate": "2012-01-30 00:00:00",
              "PreStartupReviewDate": "2012-03-14 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-06-04 00:00:00",
              "HotWorkPermitReviewDate": "2011-10-26 00:00:00",
              "ContractorSafetyReviewDate": "2011-01-31 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000019201,
                  "PreventionProgram3ID": 1000016117,
                  "ProcessChemicalID": 1000023018
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000015439,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2010-06-04 00:00:00",
    "ERTrainingDate": "2010-08-13 00:00:00",
    "CoordinatingAgencyName": "Roanoke Fire Department",
    "CoordinatingAgencyPhone": "8174912301",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000015439,
      "SummaryText": "This technical study was conducted to fulfill the hazard assessment (off-site consequence analysis) requirements of the united supermarkets facility. The regulated material present at the facility and the fucus of this is anhydrous ammonia. Ammonia is used as the refrigerant in the refrigeration system that provides cooling of cold storage of food products.\n\nThe maximum intended inventory at the facility is approximately 22,304 pounds of ammonia used as a refrigerant within a closed system. The system, consists of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cold storage and freezer storage and dock operations.\n\nAs part of this analysis, the emergency response planning guidelines concentration level 2 (ERPG-2) was used as a toxic endpoint to quantify off-site impact for the facility. The ERPG-2 was developed to provide estimates of concentration ranges within which adverse health effects can be observed. Table 1-1 summarizes the maximum downwind distances at the ERPG-2 and the estimated populations that are at risk to being exposed to the ERPG-2 concentration for each release. The at risk population numbers are the estimated number of people within the radius of the maximum downwind distance reached by the plume in all wind directions.\n\n\n\nEXECUTIVE SUMMARY\n\n\n\nFor\n\n\n\nLlano Logistics, L.P.\n\n200 Freedom Drive\n\nRoanoke, TX 76262\n\n\n\nPrepared By:\n\n\n\nINNOVATIVE REFRIGERATION SYSTEMS, INC.\n\n373 Mt. Torrey Road\n\nLyndhurst, VA  22952\n\n(540) 941-1999\n\n\n\n \n\nINTRODUCTION\n\nIn response to the city of Roanoke Emergency Management Agency, the Occupational Safety and Health Administration (OSHA), and the Environmental Protection Agency (EPA), this Process Safety Management/Risk Management Program (PSM/RMP) document has been developed for the Llano Logistics, L.P. facility.  This document has been"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000015439,
      "SummaryText": " prepared to satisfy multiple regulations and is governed by the following agencies:\n\n\n\n?    OSHA'S Code of Regulations, OSHA 29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals (PSM).\n\n\n\n?    Federal EPA's, Code of Federal Regulations, Title 40, Part 68, Accidental Release Prevention Requirements:  Risk Management Programs Under Clean Air Act Section 112(r), Program 3 Requirements (RMP)\n\n\n\n?    General Duty Clause, Title 40, Clean Air Act, Section 112(r)(1).\n\n\n\nThe purpose of this document is to:\n\n\n\n?    Increase the protection of public health, the environment, and facility employees by ensuring proper emergency response and mitigation procedures when handling regulated substances.\n\n\n\n?    Assist Llano Logistics, L.P. and local government agencies in their communication and coordination efforts to improve facility safety while handling regulated substances.\n\n\n\nThis document addresses Llano Logistics, L.P. administrative and operational programs to prevent accidents related to regulated substances and to reduce potential risks.  The regulated substance of concern and focus of this document is anhydrous ammonia.  Ammonia is used to provide refrigeration for warehouse cold/freezer storage, and dock operations.\n\n\n\nThis Executive Summary contains tables outlining the PSM/RMP sections. It includes the purpose, frequency of use, responsibilities and requirements, and forms for each section of the\n\nPSM/RMP  program.\n\nFACILITY DESCRIPTION\n\nLlano Logistics, L.P. operates a refrigeration system utilizing anhydrous ammonia as the primary refrigerant.  The refrigeration system is located in the main building.\n\n\n\nMechanical refrigeration is a thermodynamic process where the refrigerant, ammonia, is used as a heat exchanging fluid to maintain a desired temperature in an enclosed environment.  The refrigeration cycle consists of evaporation, compression, condensation, and expansion.  Evaporation and condensation are designed to alter the quantity of energy associated with r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000015439,
      "SummaryText": "efrigerant.  Compression and expansion are designed to change the availability of the associated energy.  The refrigeration cycle is a closed-loop process.  The ammonia refrigeration cycle utilizes fluid temperature, pressure, and latent heat of vaporization for cooling.  The refrigeration system utilizes these phenomenons to remove heat from a desired area, and then to discard that heat, through condensation, to an area where it is of no consequence.\n\n\n\nThe Llano Logistics, L.P. facility utilizes ammonia refrigeration to cool various storage areas.  The refrigeration system contains the following equipment:  one high pressure thermosyphon receiver, one high temperature recirculator, one low temperature recirculator, four screw compressors, one evaporative condenser, and thirteen evaporators.\n\n\n\n\n\n\n\n\n\nEMPLOYEE PARTICIPATION\n\n Every section of the PSM/RMP program must allow for employee participation in its development and implementation.  The plan allowing for this participation must be documented.  Employees and their representatives must have access to all information required to be developed for the Process Safety Management program without regard to possible trade secret status of such information.\n\n\n\nFrequency of Use    \n\nAll employees especially\n\nthose new to the facility or\n\ntransferred from another \n\ndepartment.\n\n\n\nAnnually\n\n\n\n\n\nResponsible Part\n\nSafety Supervisor\n\n\n\nSafety Supervisor/PSM Committee\n\n\n\n\n\nRequirements\n\nNotifying all employees of the use of ammonia at the facility. Provide\n\ninformation and hazards related to ammonia to employees.\n\n\n\nInformation on the most likely accident scenarios and consequences of \n\nammonia releases.\n\n\n\nRelated Form:\n\n?    PSM/RMP COMMITTEE REVIEW FORM\n\n\n\nThis form can be found in the Employee Participation Section of the PSM/RMP Document.\n\n\n\n\n\nPROCESS SAFETY INFORMATION\n\nComplete and accurate written information concerning process chemicals, process technology, and process equipment is essential to an effective PSM/RMP program a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000015439,
      "SummaryText": "nd to other aspects such as the Process Hazard Analysis (PHA).  The information to be compiled about the chemicals needs to be comprehensive enough for an accurate assessment of the fire and explosion characteristics, reactivity hazards, the health and safety hazards to workers, and the corrosion effects on process equipment as well as monitoring and safety related equipment.  MSDS information can provide a portion of the required data but other information will be required.\n\n\n\nProcess technology information is also required.  This includes information on the amount of hazardous material stored and used at the facility as well as operating limits for the process.  Diagrams of the system and information on all of the equipment utilized in the system are required.  Piping and instrumentation diagrams (P&IDs) are included in the Process Safety Information.\n\n\n\nFrequency of Use        \n\nUpdate if a change is made and train operators\n\nat least every three years.        \n\n\n\n\n\nResponsible Party\n\nSafety Supervisor\n\n\n\n\n\nRequirements\n\nMake available to all employees who work on or near the equipment\n\nof the ammonia process.\n\n\n\nRelated Form:\n\n?    NOT APPLICABLE\n\n\n\n\n\n\n\nPROCESS HAZARD ANALYSIS\n\nThe Process Hazard Analysis (PHA) is the basis for many of the decisions and procedures associated with an effective PSM/RMP program.  It is a systematic effort to determine the potential hazards associated with the process and to evaluate mitigation alternatives including equipment modifications, procedural modifications, training, and administrative controls.  An effective PHA considers and analyzes the potential consequences associated with a release of the hazardous materials including fires, explosions, and exposure of people to toxic materials.  It focuses on equipment, instrumentation, utilities, human actions, and external events.\n\n\n\nTo ensure that both operator safety as well as off-site safety is addressed, the HAZOP (Guide Word method) and the \"What-If\" Checklist analysis are conducted during"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000015439,
      "SummaryText": " the PHA session.  Human factors such as lighting, accessibility, and overall working conditions were incorporated in the analysis.  The following forms, relating to human factors and facility siting are also used to identify potential hazards: Human Factors, Facility Siting, and Ammonia Emergency and Fire Prevention Plan.\n\n\n\n\n\nFrequency of Use        \n\nReview and update hazard assessments or process hazard\n\nanalysis at least every five years or as a result of a change.\n\nIf no changes have occurred since initial PHA, include a\n\nstatement to this fact in the document    \n\n\n\n\n\nResponsible Party\n\nSafety Supervisor    \n\n\n\n\n\n\n\n\n\nRequirements\n\nMake available to all employees who work on or near\n\nthe equipment of the ammonia process.\n\n \n\n\n\nRelated Form:\n\n?    NOT APPLICABLE\n\n\n\n\n\n\n\nOPERATING PROCEDURES\n\nOperating procedures describe all employee tasks, data to be recorded, operating conditions to be maintained, and safety and health precautions to be utilized in operation of the process containing regulated substances.  The procedures need to be technically accurate and will result in safe operation of the facility.  In addition, they need to be understandable to the employees and/or contractors.  The procedures must be updated as changes are made to the facility or to the operating limits of the system.  The regulations require that the employer annually certify that the operating procedures are current and accurate.\n\n\n\nAll phases of system operation must be covered by written procedures.  Specifically, procedures must be available for:\n\n\n\n?    Initial startup;\n\n?    Normal operation;\n\n?    Temporary operations as the need arises;\n\n?    Emergency shutdown;\n\n?    Normal shutdown; and\n\n?    Startup following a turnaround, or after an emergency shutdown.\n\n\n\nThe procedures contain process operation limits and provide information of the consequences of deviation from these limits and the steps required to correct any deviations.  Safety and health measures are included in the procedures to warn employees of po"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000015439,
      "SummaryText": "tential risks and protective action that should be taken.\n\n\n\nFrequency of Use        Requirements\n\nAs often as necessary.\n\n\n\nAnnually\n\n    \n\n\n\nResponsible Party\n\nFacility Manager\n\n    \n\nTwo Maintenance\n\npersonnel and as many\n\nreps from Refrigeration\n\nContractor as necessary.    \n\n\n\nRequirements\n\nOperating Procedures reviewed to reflect any\n\nchanges in the facility.\n\n\n\nOperating Procedure Review where each procedure is reviewed and decided to be 1)current,2)still used, but needs updating, or 3)no longer needed. Results are documented on the SOP REVIEW SUMMARY & CERTIFICATION form.\n\n\n\nRelated form:\n\n?    SOP REVIEW SUMMARY & CERTIFICATION\n\n\n\nThis form can be found within the Operating Procedure Section of the PSM/RMP Document.\n\n\n\n \n\n\n\n\n\nEMPLOYEE TRAINING\n\nAll employees, including maintenance and contractor employees involved with regulated substances (i.e. ammonia), need to fully understand the health and safety hazards associated with the chemical with which they are working.  This will allow them to better protect themselves, fellow employees, and the neighboring communities.  In addition to the normal awareness training, which informs personnel of the hazards of the chemical and the safety precautions to use, training in operating procedures and practices, emergency response, and other required management controls are required.\n\n\n\nEmployees must identify the personnel who require training, develop a training protocol with procedures and objectives, and maintain a record of personnel training.  Regular evaluation of the training program must be accomplished to ensure that it is appropriate information to the employees in a useful and understandable way.\n\n\n\nIf outside employees (maintenance or contract) are performing work which might impact the ammonia refrigeration system, the Safety Supervisor has an obligation to assure that they have been properly trained by their employer and have been informed of any hazardous conditions and the proper procedures to be utilized at the facility."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000015439,
      "SummaryText": "\n\n\n\nFrequency of Use        \n\nInitial Training for new\n\nemployees.\n\n\n\nRefresher training/Annually\n\nemployees.\n\n\n\n\n\nResponsible Party\n\nSafety Supervisor\n\n\n\nSafety Supervisor\n\n\n\n\n\n\n\nRequirements\n\n?    Generalized training during orientation period and\n\nspecific training once assigned to a department.\n\n?    Specialized training includes:  labeling of all ammonia\n\nmaterial and use and reference to the Material Safety Data\n\nSheets (MSDS), and providing ammonia information\n\nconsisting of the Process Safety Information, Process\n\nHazards Analysis, and the Employee Training sections\n\nof the PSM/RMP Document.\n\n?    Employees sign a certification page that lists those\n\nrequirements covered under the Employee Training section.\n\n\n\n?    Periodic  training on unchanged procedures and\n\npolicies:  1) competencies in handling regulated\n\nsubstances, 2)items covered in classroom and on-the-job\n\ntraining, and 3)review of accidents and near misses\n\nassociated with the use of ammonia.\n\n?    Training on information or procedures and policies\n\nthat have changed including new process equipment or\n\na change in the process.\n\n?    Hazard Communication training and providing\n\nroutine and non-routine training to department and\n\nwork station level  employees.\n\n\n\nRelated Forms:\n\n?    TRAINING CERTIFICATION FORM (INITIAL TRAINING AND EMPLOYEE VERIFICATION)\n\n\n\nThis form can be found in the Employee Training Section of this PSM/RMP.\n\n\n\n \n\n\n\n\n\n\n\n\n\nCONTRACTOR SAFETY\n\nAny use of outside contractors who work in and around the ammonia refrigeration system requires that these contractors have accomplished the training, utilize proficient personnel, and have been informed of the necessary health and safety aspects of working in the area.  The goal is to assure that contractor employees perform work in a safe manner and do not endanger themselves, other employees, or the facility.  A plan for screening potential contractors to ensure satisfactory performance is required.\n\n\n\nFrequency of Use        \n\nIn the event of hiring an\n\noutside contrac"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000015439,
      "SummaryText": "tor.    \n\n\n\nMeetings following specific\n\nwork (for a one-time effort)\n\nor annually (for ongoing\n\nprograms such as ammonia\n\nsystem maintenance).\n\n\n\nOn-going process\n\n\n\nOn -going process/as necessary\n\n\n\n\n\n\n\n\n\nResponsible Party\n\nSafety Supervisor/Facility Manager\n\n\n\nSafety Supervisor\n\n\n\nSafety Supervisor\n\n\n\nContractor\n\n\n\n\n\n\n\nRequirements\n\nEvaluation of contractor's safety program, safety performance and programs prior to allowing them work at the facility.\n\n\n\nInform contractor of potential fire and hazards related to the work and requiring\n\ncontractor's signature on selected forms prior to performing work. Depending on the event, these forms can include:\n\nOUTSIDE CONTRACTOR HAZARD COMMUNICATION FORM, OUTSIDE CONTRACTOR LOCKOUT-TAGOUT FORM, AMMONIA EMERGENCY AND FIRE PREVENTION PLAN INFORMATION RECEIPT, AND CONTRACTOR EMPLOYEE INJURY/ILLNESS LOG.\n\nAn explanation of Llano Logistics, L.P. ammonia emergency and fire prevention plan and safe work practices prior to contractor's admittance into the facility.\n\n\n\nEvaluate performance of contract employees in meeting their responsibilities, assuring that their safety-training program is equivalent to  the facilities program. Deficiencies are immediately corrected.\n\n\n\n\n\n\n\nA log of contract employees' injuries and illnesses related to contractor's work remain available to all employees and/or contractors.\n\n\n\nInstruct contractor employees of potential fire and hazards.  Documents that employees receive training.  Assures that employee follows Llano Logistics, L.P. safety rules.  Advises Safety Supervisor of any unique hazards presented.\n\n    \n\n\n\nRelated Form:\n\n?    OUTSIDE CONTRACTOR HAZARD COMMUNICATION FORM\n\n?    OUTSIDE CONTRACTOR LOCK OUT-TAG OUT FORM\n\n?    CONTRACTOR SAFETY FORM\n\n?    AMMONIA EMERGENCY AND FIRE PREVENTION PLAN INFORMATION RECEIPT\n\n?    CONTRACTOR EVALUATION\n\n?    CONTRACTOR TRAINING CERTIFICATION\n\n\n\nThese forms can be found within the Contractor Safety Section of the PSM/RMP Document.\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nPRE-STARTUP SAFETY REVIEW\n\nFor a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000015439,
      "SummaryText": " new design or the addition of significant changes to the process, a Pre-Startup Safety Review (PSSR) must be employed to determine that the changes are not themselves deficient or that the addition of the new portions of the system will adversely affect the original system.  Management procedures must be developed to ensure that a satisfactory hazard analysis has been completed before the system is started.  The records from this Pre-Startup Safety Review must be kept on file.\n\n\n\nFrequency of Use    \n\nFor all modifications that result in a\n\nchange to the process safety information,\n\nthe construction of a new facility, and/or\n\nfor a prolonged shutdown of the process.\n\n\n\n\n\nResponsible Party\n\nFacility Manager\n\nContractor    \n\n\n\n\n\nRequirements\n\nProcess safety information is compiled; a process hazard analysis performed; recommendations from the hazard analysis resolved; safety, operating, maintenance, and emergency procedures are written, implemented and adequate; construction and equipment is in accordance with design specification, and training for each employee involved in the process is completed. A PRE-STARTUP SAFETY REVIEW VERIFICATION form\n\nis signed when the above is documented.\n\n\n\nRelated Form:\n\n?    PRE-STARTUP SAFETY REVIEW VERIFICATION\n\n?    PRE-STARTUP SAFETY REVIEW CHECKLIST\n\n\n\nThese forms can be found within the Pre-Startup Safety Review Section of the PSM/RMP Document.\n\n\n\n\n\n\n\n\n\n\n\nMECHANICAL INTEGRITY\n\nA formal maintenance program will be in place for all systems using regulated substances (i.e. ammonia).  This program will consist of routine (scheduled) inspection, testing, overhaul, and replacement as needed.  Equipment must be categorized and ranked with respect to the maintenance involved.  This maintenance and inspection information will include all equipment such as storage tanks, compressors, condensers, evaporators, process piping relief and vent systems, fire protection system components, emergency shutdown systems, and alarms.  Each component must be place"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000015439,
      "SummaryText": "d into a category that indicates how maintenance and inspection will be performed on that class of components.\n\n\n\nFrequency of Use        \n\nDaily    \n\n\n\nWeekly\n\n\n\nMonthly\n\n\n\nQuarterly\n\n\n\nSemi-Annually\n\n\n\nAnnually\n\n\n\nFive Year\n\n\n\nAs Necessary\n\n\n\n\n\n\n\nResponsible Party\n\nLlano Logistics, L.P.\n\nMaintenance personnel\n\n\n\nLlano Logistics, L.P.\n\nMaintenance personnel    \n\n\n\nMaintenance Contractor    \n\n\n\nMaintenance Contractor    \n\n\n\nMaintenance Contractor    \n\n\n\nMaintenance Contractor    \n\n\n\n3rd Party Inspector    \n\n\n\nSafety Supervisor /\n\nMaintenance Contractor\n\n\n\n\n\n\n\nRequirements\n\n?    Follow and complete the Daily Log Sheet- Engine Room\n\n\n\n?    Follow and complete the Weekly Ammonia Inspection Checklist\n\n\n\n?    Follow and complete the Monthly Ammonia Inspection Checklist\n\n\n\n?    Follow and complete the Quarterly Ammonia Inspection Checklist\n\n\n\n?    Follow and complete the Semi-Annual Ammonia Inspection Checklist\n\n\n\n?    Follow and complete the Annual Ammonia Inspection Checklist\n\n\n\n?    Follow and complete the Five-Year Ammonia Inspection Checklist\n\n\n\n?    If potentially faulty or unsafe equipment is observed by any employee it is to be documented using the FAULTY OR UNSAFE EQUIPMENT REPORT form.  Management will respond to the observation in a written and timely manner and see to the correction before the next use.\n\n\n\nRelated forms:\n\n?    FAULTY OR UNSAFE EQUIPMENT REPORT\n\n?    DAILY LOG SHEET-ENGINE ROOM\n\n?    WEEKLY AMMONIA INSPECTION CHECKLIST\n\n?    MONTHLY AMMONIA INSPECTION CHECKLIST\n\n?    QUARTERLY AMMONIA INSPECTION CHECKLIST\n\n?    SEMI-ANNUAL AMMONIA INSPECTION CHECKLIST\n\n?    ANNUAL AMMONIA INSPECTION CHECKLIST\n\n?    FIVE-YEAR AMMONIA INSPECTION CHECKLIST\n\n\n\nThese forms can be found within the Mechanical Integrity Section of the PSM/RMP Document\n\n\n\n\n\n\n\nHOT WORK PERMIT\n\nA management control program must be employed that recognizes that extra care is required for non-routine work practices.  This program will advise the personnel that significant potential hazards exist and that extra care should be taken in certain circumstances.  This w"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000015439,
      "SummaryText": "ill ensure that employees, contractors, and company property are protected against fire, explosion, and other dangers resulting from hot work. Formal procedures should exist for these programs and paperwork associated with ongoing work should be kept for documentation.\n\n\n\nFrequency of Use        Requirements\n\nIssued prior to beginning\n\nhot work.    \n\n\n\nPermit is kept on file for at\n\nleast 30 days after all work\n\nis completed.\n\n\n\n\n\n\n\nResponsible Party\n\nRequested by any facility\n\nemployee or outside contractor.\n\n\n\nSafety Supervisor, Facility\n\nManager, Contractor\n\n\n\nFacility Manager/Supervisor\n\n\n\nSafety Supervisor\n\n\n\n\n\n\n\nRequirements\n\nInitiating a hot work permit the day that the hot work is to be performed.\n\n\n\nIssuing a hot work permit before hot work is started.  List of precautions is\n\nreviewed with cutter/welder and the firewatcher.  Hot work permit is signed by appropriate parties.  Sections 1 & 2 completed by Safety Supervisor (or designated representative).\n\n\n\nPerforming hot work includes making the permit visible where hot work is\n\nbeing performed.  Firewatcher looks for fire hazards.  Facility Manager\n\ninspects work area during operation.\n\n\n\nCompletion of hot work permit includes: inspecting area for 30 minutes\n\nafter hot work performed: permit signed and returned to Safety\n\nManager who also inspects area and signs Section 3 of the hot work permit.\n\nCopies sent to the Facility Manager and the contractor, if appropriate.\n\n\n\nRelated Form:\n\n?    HOT WORK PERMIT\n\n\n\nThis form can be found within the Hot Work Permit Section of the PSM/RMP Document.\n\n \n\n\n\n\n\n\n\nMANAGEMENT OF CHANGE\n\nOther than \"replacement in kind,\" any change to the system must be documented.  In particular, the change of any equipment, control system, or procedure must be evaluated to determine that it will not have an adverse effect on the safety aspects of the system.  In addition, procedures must be revised to reflect the changes in the system.\n\n\n\nFrequency of Use        Requirements\n\nWhenever there is a design\n\nch"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000015439,
      "SummaryText": "ange regarding the\n\nammonia system.\n\n\n\nEmergency Basis-\n\nA management of change\n\nrecord must be initiated\n\nwithin 72 hours.\n\n\n\n\n\nResponsible Party\n\nFacility Manager /\n\nMaintenance Coordinator    \n\n\n\nMaintenance\n\nContractor\n\n\n\n\n\nRequirements\n\n?    A change includes: \n\n      1) Modifications to the process\n\n      2) Piping modifications\n\n      3) Instrumental changes that result in the a change to the system piping\n\n      4) Procedural modifications\n\n      5) Safety and health equipment\n\n      6) Change to a \"controlled\" document\n\n      7) Building modifications including destruction or removal of equipment\n\n        from service\n\n\n\n?    Initiator of a proposed change will prepare the Management of Change\n\n        Record form and submit it to the responsible party.\n\n?    A control number to this form is entered into the facility's Management of\n\n        Change Record Log form.\n\n?    If the work is a \"replacement in kind\" the record is signed off and filed,\n\n         otherwise, the responsible party will coordinate the progress including the\n\n         technical, safety, training, and documentation requirements.\n\n \n\nProcedural change made on an emergency basis to improve safety of an operation.\n\n\n\nRelated Forms:\n\n?    MANAGEMENT OF CHANGE RECORD (MCR)\n\n?    MANAGEMENT OF CHANGE RECORD (MCR) LOG\n\n?    SAFETY REVIEW CHECKLIST\n\n\n\nThese forms can be found within the Management of Change Section of the PSM/RMP Document.\n\n\n\n\n\n\n\n\n\nINCIDENT INVESTIGATION\n\nIncident investigation is the process of identifying the underlying causes of incidents and implementing steps to prevent similar events from occurring.  It is required that employees will recognize and investigate events that resulted in or could reasonably have resulted in a hazardous chemical release. Employers must develop in-house capabilities to investigate incidents that occur in their facilities.  A team must be assembled by Llano Logistics, L.P. and trained to collect and document information related to any incident.  Usually a multi-discipli"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000015439,
      "SummaryText": "nary team is better able to gather the facts and evaluate \"what happened and why.\"  All employees with information should be interviewed and other facts should be gathered to develop a complete picture of the facts concerning the incident.  Recommendations are then developed for changes in equipment, procedures, or safety systems to prevent recurrence of the event.\n\n\n\nFrequency of Use        \n\nA release or near\n\nrelease event.    \n\n\n\n\n\nResponsible Party\n\nSafety Supervisor, Facility Manager,\n\nMaintenance personnel,\n\nRefrigeration Contractor, and any\n\nadditional committee members.    \n\n\n\n\n\n\n\nRequirements\n\nASAP, but no later than 48 hours after an incident. A committee is\n\nassembled  to determine the facts and the cause of the incident\n\nand recommend corrective  preventative actions. Information will be\n\nretained in the administrative office and documentation is completed\n\non the INCIDENT INVESTIGATION  REPORT. Employees of\n\nLlano Logistics, L.P. will review the documentation once\n\ncomplete.  The data will be retained for 5 years following implementation\n\nof the recommendations.\n\n\n\nRelated Forms:\n\n?    AMMONIA INCIDENT INVESTIGATION REPORT (INCIDENT SUMMARY: APPROVALS, FOLLOW-UP AND REVIEWS: REFRENCE NO. LOG)\n\n\n\nThis form can be found within the Incident Investigation Section of the PSM/RMP Document.\n\n\n\n\n\n\n\n\n\nEMERGENCY PLANNING AND RESPONSE\n\nEmergency plans are required in case there is a release of ammonia (or other emergency such as fire or earthquake).  Employers must select a formal plan on how to handle an emergency situation and also a plan to educate employees as to what they should do.  This plan must be detailed and include procedures for notifying local authorities and following up with written accident reports, should the release meet or exceed the reportable quantity (100 pounds of ammonia).  Many local site factors will be included in the ammonia emergency and fire prevention plan.  Llano Logistics, L.P. has a stated policy of responding to all leaks to determine the pro"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000015439,
      "SummaryText": "per response.  Llano Logistics, L.P. will respond to and mitigate all leaks within the limits of training and with the proper use of PPE.\n\n\n\nFrequency of Use        \n\nIn the case of a significant release\n\nof a hazardous material.    \n\n\n\nAmmonia Emergency and Fire Prevention\n\nPlan is reviewed\n\n1) At the time of hire for each new employee.\n\n2) Initially when the plan is developed.\n\n3) When employee's responsibilities change.\n\n4) Whenever the Plan changes.\n\n5) Refresher training at least annually.\n\n\n\n\n\nResponsible Party\n\nFacilities Manager\n\n(Incident Commander)    \n\n\n\nSupervisor\n\n\n\nEach Manager\n\n\n\nSafety Supervisor\n\n\n\n\n\n\n\nRequirements\n\nDetermines extent of release or designates someone to do so.  Decides which personnel should be evacuated to the designated assembly areas.  Immediately notifies all of the appropriate agencies.  Is informed of any fire or ammonia emergencies and has the ultimate responsibility of facility personnel or contractors. Responsible for completing the HAZARDOUS MATERIALS INCIDENT REPORT.\n\n \n\n \n\nPerforms the same responsibilities as above if Incident Commander (IC) is not available.\n\n\n\n \n\nPerforms roll call for the personnel in their department and reports to the IC. Brings first aid kits to assembly area if applicable.\n\n\n\nResponsible for ensuring Emergency training for all employees, such as First Aid and Emergency Evacuation Training for operators and those associated with hazardous materials also receive Hazard Communication and HAZWOPER Training. Solicit input from all employees during a 2 week period following completion of each drill to correct any deficiencies found.\n\n\n\nRelated Forms:\n\n?    HAZARDOUS MATERIALS INCIDENT REPORT\n\n?    CERIFICATION FOR AMMONIA EMERGENCY AND FIRE PREVENTION PLAN\n\n\n\nThese forms can be found within the Emergency Planning and Response Section of the PSM/RMP Document.\n\n\n\nNotification of releases must be made to administrative agencies that include:\n\n\n\nNational Response Center\n\n2100 Second Street S.W.\n\nWashington, D.C. \n\n1-800-424-"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000015439,
      "SummaryText": "8802\n\n \n\n\n\n\n\nOrganizations to be contacted immediately after an emergency include the following:\n\n\n\n1.    First call 911 on an internal landline phone for the Fire Department, Police Department, Emergency Medical Services, and the Hazmat Team.\n\n\n\n2.    Call the Texas State Spill Reporting Hotline 1-800-832-8224\n\n\n\n3.    If an ammonia release meets or exceeds 100 pounds in a 24-hour period (Federal Reportable Quantity CERCLA), immediately call the National Response Center 1-800-424-8802.\n\n\n\n\n\nOther Important Contacts\n\n\n\n4.    Denton County, TX (LEPC) at 940-349-2840.\n\n\n\n5.    Governor's Division of Emergency Management / Texas Dept. of Public safety (SERC) at 512-424-2598.\n\n\n\n6.    If additional help is required for an ammonia spill the facility can call Chemtrec-Manufacturing Chemists Association 1-800-424-9300.\n\n\n\n7.    If an employee ingests ammonia, the Poison Control Center can be reached 24 hours per day at 1-800-222-1222.\n\n\n\n\n\n\n\n\n\nCOMPLIANCE SAFETY AUDITS\n\nAn effective audit program is required to determine that facility personnel and contractors are following the procedures and intents of the overall PSM requirements.  Periodic reviews of all areas of the management programs are required to verify compliance.  OSHA has published compliance guidelines for their compliance personnel.  These guidelines make a good basis for developing an internal audit program.  Corrective actions related to the audit will need to be documented and kept on record to show how the audit is improving the overall performance of the risk management programs in place at the facility.\n\n\n\nFrequency of Use        \n\nEvery 3 years.    \n\n\n\nAs necessary\n\n\n\n\n\nResponsible Party\n\nSafety Supervisor/ At least one person\n\nknowledgeable in the process and audit\n\ntechniques, and who is impartial\n\ntoward the facility.    \n\n\n\nLlano Logistics, L.P.\n\n\n\n\n\n\n\nRequirements\n\nIncludes verification that procedures developed to comply with\n\nthe risk management regulations are adequate and are being\n\nfollowed.  The Compliance Audit form is used"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000015439,
      "SummaryText": " for this\n\nprocedure.\n\nA written report of the findings of the audit is developed and\n\nan appropriate response to each of the findings. Documentation\n\nshowing that deficiencies have been corrected.\n\n \n\nThe two most recent audit reports shall be retained by the\n\nemployer and made available to employees.\n\n\n\nRelated Forms:\n\n?    COMPLIANCE AUDIT FORMS\n\n\n\nThese forms can be found within the compliance Audit Section of the PSM/RMP Document.\n\n\n\n\n\n\n\n\n\nTRADE SECRETS\n\n\n\nNo documents currently contained in the PSM files contain trade secret information.\n\n\n\n\n\n\n\nRISK MANAGEMENT PLANNING REGULATORY COMPLIANCE MATRIX\n\nSubject        \n\nExecutive Summary\n\nProgram Registration        \n\nEmployee Participation        \n\nProcess Safety Information    \n\nProcess Hazard Analysis    \n\nOperating Procedures    \n\nTraining    \n\nContractor Safety    \n\nPre-Startup Safety Review    \n\nMechanical Integrity    \n\nHot Work Permits    \n\nManagement of Change    \n\nIncident Investigation    \n\nEmergency Response Planning\n\nCompliance Audits\n\nTrade Secrets     \n\nCertification    \n\nHazard Assessment (OCA)        \n\nSeismic Hazard Assessment    \n\nManagement Programs    \n\nRecordkeeping & Updates    \n\n        \n\n\n\nOSHA, 29 CFR 1910.119 (PSM)\n\nNot Applicable\n\nNot Applicable\n\n(C)\n\n(D)\n\n(E)\n\n(F)\n\n(G)\n\n(H)\n\n(I)\n\n(J)\n\n(K)\n\n(L)\n\n(M)\n\n(N)\n\n(O)\n\n(P)\n\nNot Applicable\n\nNot Applicable\n\nNot Applicable\n\nNot Applicable\n\nNot Applicable\n\n\n\n\n\nEPA 40 CFR Part 68, Program 3 (RMP)\n\nSubpart G, 68.155\n\nSubpart G, 68.160\n\nSubpart D, 68.83\n\nSubpart D, 68.65\n\nSubpart D, 68.67\n\nSubpart D, 68.69\n\nSubpart D, 68.71\n\nSubpart D, 68.87\n\nSubpart D, 68.77\n\nSubpart D, 68.73\n\nSubpart D, 68.85\n\nSubpart D, 68.75\n\nSubpart D, 68.81\n\nSubpart E, 68.90-68.95\n\nSubpart D, 68.79\n\nNot Applicable\n\nSubpart G, 68.185\n\nSubpart B, 68.20-68.42\n\nNot Applicable\n\nSubpart B, 68.20-68.42\n\nNot Applicable\n\nSubpart A, 68.15\n\nSubpart G, 68.190\n\nSubpart H, 68.200\n\n"
    }
  ]
}