{
  "FacilityID": 1000015001,
  "FacilityName": "O.N. Stevens Water Treatment Plant",
  "FacilityStr1": "13101 Leopard Street",
  "FacilityStr2": null,
  "FacilityCity": "Corpus Christi",
  "FacilityState": "TX",
  "FacilityZipCode": "78410",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48355",
  "LEPC": "Nueces County LEPC",
  "FacilityLatDecDegs": "27.860508",
  "FacilityLongDecDegs": "-097.621309",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "LF",
  "FacilityURL": "www.cctexas.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Corpus Christi",
  "Company2Name": null,
  "CompanyDUNS": 69457786,
  "Company2DUNS": 0,
  "OperatorName": "City of Corpus Christi",
  "OperatorStr1": "PO Box 9277",
  "OperatorStr2": null,
  "OperatorCity": "Corpus Christi",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78469",
  "OperatorZipCodeExt": "9277",
  "RMPContact": "Rafael Martinez",
  "RMPTitle": "Utilities Systems Manager",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000107797",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-08-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-08-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-08-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 27.86056,
  "FRS_Long": -97.62139,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018885,
      "AltID": "Water Treatment Plant",
      "FacilityID": 1000015001,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000019227,
          "ProcessID": 1000018885,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000022469,
          "ProcessID": 1000018885,
          "ChemicalID": 62,
          "Quantity": 600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000522469,
          "ProcessID": 1000018885,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000015001,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe O.N. Stevens Water Treatment Plant (ONSWTP) provides drinking water for Corpus Christi, Texas and for surrounding communities.  The ONSWTP is located at 13101 Leopard St., in the northwestern part of Corpus Christi, Nueces County, Texas.  The ONSWTP provides approximately 70 million gallons of drinking water per day during the winter months and 100 million gallons per day in the summer.  The City of Corpus Christi has a commitment to safely providing drinking water to this region.\n\nChlorine is the only RMP-regulated chemical used in the water treatment process.  Chlorine is used as an ingredient to kill the pathogens to make the water safe to drink.  Other chemicals are used in the treatment of the water but are not subject to RMP regulations.  Safety is of utmost importance at the ONSWTP when working with and around any chemicals, including chlorine.\n\nThe ONSWTP has been using chlorine for more than 45 years, and there are no reportable incidents of chlorine releases.  The excellent track record is founded in the methods used to deliver the chlorine into the water.\n\nDuring the process, chlorine is normally stored under pressure as a liquid.  Chlorine storage containers are stationary and anchored in place, except during container delivery to the facility. As a backup measure, small containers of chlorine are also stored on-site.  If problems should arise in the normal chlorination process, the small containers will be activated and used as needed.\n\nProjects that are performed at the ONSWTP are implemented with safety at the forefront.  Competent and knowledgeable engineers design the plans, and the materials of construction are chosen to provide mechanical integrity.  Chlorine containers are equipped with excess flow valves, which will shut off the flow of chlorine should a pipe in the system sever completely, and the system is designed with proper safety relief valves as needed.  In addition, a remote actuated shut-off valve is located in th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000015001,
      "SummaryText": "e unloading line at the point the ONSWTP system is entered near the top of the chlorine containers.  Area gas monitors are used to detect chlorine gas leaks.\n\nA hazard review team consisting of experienced facility personnel, consulting engineers, and consulting scientists conducted a Hazard Review of the facility to identify potential hazards related to the chlorine system. Opportunities to further minimize the potential for a chlorine leak have been identified, and corrective actions have been recommended for implementation.  The City continually evaluates opportunities to improve facility performance and eliminate or reduce risks to staff, the public and the environment.  Improvements determined to be appropriately beneficial have either already been made or are scheduled to be made expediently.\n\nSome of the technological equipment that is in place includes a Supervisory Control Data Acquisition (SCADA) system, an operator actuated audible alarm system, and a video monitoring system.  The SCADA system is a computerized system that administratively controls the chlorine process and controls equipment that is used to treat and distribute to water throughout the community.  Many of the chlorine system's alarms are connected to the SCADA, and early detection is acquired.  Connection to the SCADA allows the operations personnel to give an early warning and to take steps to stop a release within a reasonable time after a release occurs.  \n\nTime is of the essence in an emergency, and this system provides the capability of detecting problems early.  Operator actuated alarms allow early warning to ONSWTP personnel of any emergency, should it occur.  The video monitoring system acts both as a security measure and as a measure for early detection and location.  Remote monitoring of the chlorine system allows operations personnel to detect the presence of unauthorized personnel at the facility and the location of a release, should it occur.\n\nA water spray mitigation system i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000015001,
      "SummaryText": "s installed in the chlorine storage area.  This system has the capability of creating a water curtain on either side of the chlorine storage containers and diverting the runoff to an in-ground holding tank.  The holding tank is designed to contain the chlorine in an aqueous solution should a release occur.  The tank has sufficient capacity so that the operators will have the time needed to stop the release without the tank spilling over.  A pump is in place to relocate deluge water from the holding tank back to the facility's equalization ponds at the beginning of the treatment process.\n\nThe facility is enclosed by security fence and the entrance is remotely controlled by operators in the control room.  A video camera at the entrance assists facility personnel to observe visitors to provide or deny access from a secure location.\n\nTraining is an important part of chlorine safety.  Newly hired employees are required to complete chlorine safety training before they are allowed to work on any of the components of the chlorine system.  The training program includes on-the-job training by qualified personnel experienced in the ONSWTP chlorine system. Classroom training is also provided as appropriate for new and existing employees.  Refresher training is an integral part of the program, along with hands-on application exercises.\n\nPlant personnel are trained in the performance of their duties.  Multi-Skilled Technicians are trained to operate the chlorine process in a safe manner.  They are required to be licensed by the Texas Commission on Environmental Quality. (TCEQ), and they are required to follow internal operating procedures regarding operations of the chlorine system.  Multi-Skilled Technicians are also trained to work on the Chlorine Institute guidelines.  Preventative maintenance on all equipment and materials is also performed in a timely manner, in accordance with manufacturer's recommendations.\n\nIn the event of a serious chlorine-related incident at the ONSWTP"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000015001,
      "SummaryText": ", procedures are in place to conduct a thorough investigation.  The effort of the investigations will be concentrated on determining the contributing factors to the incident, assessing the impacts of the incident, and to making improvements to minimize the potential for the incident to occur again.  An Incident Investigation Team will decide on the necessary improvements to the system to eliminate or reduce the identified hazards.\n\nThe ONSWTP maintains a facility emergency response plan for a variety of situations, including chemical leaks.  In the event of a major uncontrolled chlorine release, the Corpus Christi Fire Department will be notified and will provide emergency response.  Facility personnel will provide support services from a safe location to assist emergency response personnel.  The ONSWTP coordinates with the Fire Department to familiarize emergency responders with specific equipment functions and their locations at the facility and to familiarize employees with emergency response procedures and corresponding actions."
    }
  ]
}