{
  "FacilityID": 1000027663,
  "FacilityName": "Waco Metropolitan Area Regional Sewerage System",
  "FacilityStr1": "1147 Treatment Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Waco",
  "FacilityState": "TX",
  "FacilityZipCode": "76706",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48309",
  "LEPC": "Mclennan County LEPC",
  "FacilityLatDecDegs": "31.516389",
  "FacilityLongDecDegs": "-097.063056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "jonathand@wacotx.gov",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Waco Water Utilities Department",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Waco",
  "OperatorStr1": "P.O. Box 2570",
  "OperatorStr2": null,
  "OperatorCity": "Waco",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76702",
  "OperatorZipCodeExt": "2570",
  "RMPContact": "Jonathan Dulus",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000116643",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "22237",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-03-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-04-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-04-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-04-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 31.5098,
  "FRS_Long": -97.1204,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000033773,
      "AltID": "Chlorination",
      "FacilityID": 1000027663,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000034033,
          "ProcessID": 1000033773,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000040835,
          "ProcessID": 1000033773,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000540835,
          "ProcessID": 1000033773,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000033774,
      "AltID": "De-Chlorination",
      "FacilityID": 1000027663,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000034034,
          "ProcessID": 1000033774,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000040836,
          "ProcessID": 1000033774,
          "ChemicalID": 49,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000540836,
          "ProcessID": 1000033774,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000027663,
      "SummaryText": "The Waco Metropolitan Area Regional Sewerage System serves six communities within McLennan County: Bellmead, Lacy-Lakeview, Hewitt, Woodway, Waco, and Lorena (note: Lorena is joining the owner-cities in 2007).  The plant was opened in 1971 and is permitted for 37.8 MGD, with a daily average 22 MGD flow and an 83 MGD permitted peak flow.  Only Chlorine and Sulfur Dioxide are stored in reportable quantities.\n  \n ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES - The facility's policy requires a written emergency action plan, annual exercises and reviews of the plan, emergency response training for facility personnel and coordination with local responders.  In addition, the Department Safety Officer and City Risk Management Department conduct annual safety inspections.  \n\nCHLORINE - The 1-ton cylinders are stored in a block building with one personnel door on one side and one end of the building has sliding doors for handling the cylinders with overhead beam hoists and trolleys.  The storage/feed capacity is 12 cylinders, 6 on each side.  Each side is connected to the main header via whip lines.  Each side (bank) is controlled separately by pressure valving and switchover valves to the rotometers and gas feeders.  The chlorine system changes from a pressure to vacuum system at this point.  Normally one side/bank of cylinders is feeding and the other bank is empty or ready to be exchanged with the full cylinders or is full and on standby.  The chlorine control room is adjacent to the storage area and has an intervening block/glass wall between these two areas.  There is adequate valving to isolate and stop any leaking section of pipe from the individual cylinders to the actual induction unit.    The control room has a gas detection system with multiple sensors in the control room and the storage room.  The gas detection system sets off an audible and visual alarm in the event of a leak.  The leak detection system is connected to the SCADAsystem and has auto"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000027663,
      "SummaryText": "matic calling to staff in the event of an alarm.  There is an open, covered storage/staging area just outside the sliding doors of the storage/feed room.  This area will hold 12 cylinders and is where cylinders are unloaded from the delivery truck and the empty cylinders loaded onto the same truck.\n\nSULFUR DIOXIDE - The one-ton cylinders are stored in a storage/feed area enclosed by a metal building with block walls.  The area has room for 16 cylinders, 8 in each bank, but only 4 in each bank are connected to manifolds.  Each bank is separated using pressure valving and switchover valves going to rotometers and the gas induction system.  The system changes from a pressure to a vacuum system here.  There is a dividng block/glass wall between the sotrage/feed room and the control room.  There is a walk-through door for access to each room.There are venilation systems in both rooms and sliding doors on one wall for loading and unloading cylinders using an overhead hoist and torlley.  There is a gas detection system in place that has an audible and visual alarm to warn of a gas leak in either room, with multiple sensors.  This is also conncected to the SCADA system.  There is a covered outside storage area for loading and unloading cylinders with space to 8 cylinders.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\nCHLORINE - At any time, 24-2,000 pound cylinders of liquid chlorine could be stored.  The chlorine is used to disinfect treated wastewater prior to dischrge.  The feed system requires the cylinders be in 4 groups of six cylinders, with 2 groups connected for feed manifolds and 2 groups in storage.  Of the 2 connected groups, one group is being drawn from and the other group is in standby - activated by an automatic switchover valve, activated by depletion of all available chlorine from the first group.  Gaseous chlorine is withdrawn from the cylinders through regulators that require a vacuum to operate.  Upon loss of vacuum, the regulator will close, shutting off"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000027663,
      "SummaryText": " the chlorine feed.  After passing through the regulator, the gas goes through the automatic switchover valve, a flow rate indicator, which can be adjusted automatically of manually.  Finally the gas passes through the \"Chlor-a-Vac\" pump that produces the vacuum for the feed system to operate.  The pump is submerged in treated effluent and mixes the chlorine gas with the effluent in a concrete junction box prior to a series of concrete basins that retain the water for a minimum of 20 minutes.  The 20 minute retention is requiredby federal regulations to assure adequate disinfection.  When the water leaves the chlorine contact basins, sulfur dioxide is injected into the water to react with any remaining chlorine residual, dissapating both chemicals before discharge.  The sulfur dioxide system is essentially the same as the chlorine system.\n\nSULFUR DIOXIDE - Eight Sulfur Dioxide cylinders in two banks of four cylinders are connected to the headers at the storage room.  Each cylinder contains 2,000 pounds of Sulfur Dioxide.  Each header is provided with a separate vacuum regulator to reduce gas from varying pressure toa constantly regulated vacuum.  The vacuum regulators are equipped with gas pressure gauges and vacuum-sealing O-rings to seall off gas in the event gas is exhauted and shut off.  The exhausted supply is replaced with a fresh cylinder bank.  The \"Chlor-a-Vac\" induction units are submerged at least two feet below the water surface and apply the vacuum using motor-driven propellers, which also mix the gas in the effluent.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\nWMARSS has the capability to respond and mitigate the release of on-site hazardous chemicals that present a moderate health and/or safety threat to WMARSS and responding personnel, that present a moderate potential for adverse environmental impact, are of limited sixe, and have a low fire/explosion potential.  If the spill release is beyond the capability of on-site personnel, the City of Waco Fire De"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000027663,
      "SummaryText": "partment HAZMAT team will respond (calling 911).  Training and exercises are conducted periodically.\n\nFIVE YEAR ACCIDENT HISTORY\nIn the last five years, there have been no releases the resulted in death, injury, property damage on or off site, or that caused an evacuations, sheltering-in-place, or environmental damage."
    }
  ]
}