{
  "FacilityID": 1000102395,
  "FacilityName": "Pacific Gas & Electric CNG Fueling Facility",
  "FacilityStr1": "2320 W Yosemite Ave",
  "FacilityStr2": "Suite 107",
  "FacilityCity": "Manteca",
  "FacilityState": "CA",
  "FacilityZipCode": "95337",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.796792",
  "FacilityLongDecDegs": "-121.257325",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Pacific Gas and Electric Company",
  "Company2Name": null,
  "CompanyDUNS": 6912877,
  "Company2DUNS": null,
  "OperatorName": "Pacific Gas and Electric Company",
  "OperatorStr1": "2320 W. Yosemite Avenue",
  "OperatorStr2": "Suite 107",
  "OperatorCity": "Manteca",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95337",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000236602",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-05-18 00:00:00",
  "SafetyInspectionBy": "San Joaquin County Environmental Health Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-09-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-09-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-09-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-09-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000127130,
      "AltID": "Compressed Natural Gas",
      "FacilityID": 1000102395,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000159109,
          "ProcessID": 1000127130,
          "ChemicalID": 93,
          "Quantity": 127000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000128525,
          "ProcessID": 1000127130,
          "NAICSCode": "22121",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000109513,
              "Process_NAICS_ID": 1000128525,
              "SafetyReviewDate": "2021-05-03 00:00:00",
              "PHA_Date": "2021-03-10 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-08-11 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Locked open compressor discharge valve V302 , installed high visibility parking stops",
              "OpProceduresReviewDate": "2022-07-11 00:00:00",
              "TrainingReviewDate": "2021-08-16 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-07-15 00:00:00",
              "EquipmentInspectionDate": "2022-07-06 00:00:00",
              "EquipmentTested": "Emergency Shutdown System",
              "ChangeMgmtDate": "2021-02-17 00:00:00",
              "ChangeMgmtReviewDate": "2021-05-03 00:00:00",
              "PreStartupReviewDate": "2020-04-27 00:00:00",
              "ComplianceAuditDate": "2020-08-25 00:00:00",
              "AuditCompletionDate": "2021-08-18 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2022-08-25 00:00:00",
              "HotWorkPermitReviewDate": "2021-08-03 00:00:00",
              "ContractorSafetyReviewDate": "2022-08-08 00:00:00",
              "ContractorSafetyEvalDate": "2021-05-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000137374,
                  "PreventionProgram3ID": 1000109513,
                  "ProcessChemicalID": 1000159109
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000102395,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Manteca Fire Department",
    "CoordinatingAgencyPhone": "2094568300",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000102395,
      "SummaryText": "itoring, controls, and safety systems.\nAccidental Release Prevention Program Summary\nThe Manteca CNG Fueling Facility can potentially contain up to 127,000 pounds of CNG, of which up to 1,600 pounds are in fixed storage vessels, equipment, and piping with the remainder in portable CNG trailers that may be filled and stored at the facility. Since the quantity of CNG onsite exceeds both the California Accidental Release Prevention (CalARP) Program regulation applicability threshold and the Process Safety Management (PSM) standard (California Code of Regulations (CCR), Title 8, Section 5189) applicability threshold, the Manteca CNG Fueling Facility is subject to CalARP Program requirements as well as the PSM requirements.\nThe Manteca CNG Fueling Facility Accidental Release Prevention Program includes the following 11 elements:\n1.\tManagement System\n2.\tProcess Safety Information\n3.\tProcess Hazard Analysis (PHA)\n4.\tOperating Procedures\n5.\tTraining\n6.\tMechanical Integrity\n7.\tManagement of Change (MOC)\n8.\tPre-startup Safety Review (PSSR)\n9.\tCompliance Audits\n10.\tIncident Investigation\n11.\tEmployee Participation\nManagement System\nPG&E has developed a management system to oversee implementation of the Accidental Release Prevention Program. The Liquefied Natural Gas (LNG)/ CNG Engineering Manager has been assigned as the qualified person with overall responsibility for the development, implementation, and integration of the elements of the facility\u0092s Risk Management Program (RMP). The management system describes assignments of positions responsible for implementing individual RMP elements.\nProcess Safety Information\nComplete and up to date safety information is required to successfully implement most RMP elements including PHAs, training, emergency planning and response, MOC, incident investigation, and compliance audits. Process safety information includes safety information associated with CNG, as described in the safety data sheet, and safety information associated with the"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000102395,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\nPacific Gas and Electric Company (PG&E) is committed to becoming the safest, most reliable natural gas system in the nation. This vision will be achieved through the Gas Safety Excellence framework. The strategy is to deliver Gas Safety Excellence by putting safety and people at the heart of everything; investing in the reliability and integrity of our gas system; and by continuously improving the effectiveness and affordability of our processes. Strategic actions developed under this strategy are aligned to the following three elements of a safety management system: (1) develop an asset management strategy to appropriately invest in the integrity and reliability of the gas system; (2) nurture a safety first culture that places safety at the heart of everything it does; and (3) focus on process safety in all activities to minimize the possibility of high consequence events. PG&E has prepared an emergency response plan as an element of its Hazardous Materials Business Plan to handle potential accidental releases of compressed natural gas (CNG).\nCNG Fueling Facility Description\nThe Manteca CNG Fueling Facility is located on the south side of W. Yosemite Avenue, one mile west of the City of Manteca in San Joaquin County, California. The City of Manteca Wastewater Treatment Plant is located south and west of the facility. A residential area is situated east and north of the facility. A light industrial development is located to the northwest.\nThe Manteca CNG Fueling Facility consists of the following: utility meter set; gas dryer; fixed and portable compressors to boost utility pipeline pressure of approximately 30 pounds per square inch gauge (psig) to 2,400 and to 4,100 psig; three CNG storage vessels; fast fill CNG dispenser; Programmable Logic Controller (PLC) based gas flow control equipment; eight fill posts for filling portable CNG trailers; space for fueling 17 portable CNG equipment trailers; and mon"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000102395,
      "SummaryText": "process technology and equipment. PG&E has verified that the system is designed with recognized and generally accepted good engineering practices by specifying current codes and standards by which the facility was constructed.\nProcess Hazard Analysis\nA PHA is a systematic evaluation of the potential causes and consequences of accidental releases with the objective of eliminating conditions that contribute to a high risk of release of CNG. The PHA addresses the following:\n?\tHazards of the CNG fueling process\n?\tPrevious incidents which had likely potential for catastrophic consequences\n?\tEngineering and administrative controls\n?\tConsequences of failure of engineering and administrative controls\n?\tFacility siting\n?\tHuman factors\n?\tQualitative evaluation of health and safety effects of failure of controls\n?\tExternal events including seismic events\nAn initial PHA was performed on March 25 and 26, 2015 based on the 60 percent design package, and was updated on March 30 and 31, 2016 based on Issued for Permit design package using a combination of the Hazard and Operability Study (HAZOP) and What if/Checklist methods. The PHA was facilitated and recorded by PG&E staff with experience in the PHA methods used. The PHA team included staff with expertise in engineering and process operations associated with CNG fueling facilities.\nPG&E has established a system to address PHA findings and recommendations, consisting of a written summary table with an implementation schedule and assignment of responsibilities. The LNG/CNG Engineering Manager is assigned overall responsibility for tracking PHA findings and recommendations. Findings and recommendations from the original PHA were addressed by September 30, 2018 according to a schedule agreed to with the San Joaquin County Environmental Health Department.\nIn addition to addressing PHA findings and prior to commissioning the CNG facility, a design review was conducted to identify all changes implemented since the original PHA was con"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000102395,
      "SummaryText": "ducted. The design changes were itemized, reviewed and approved by the design team on April 27, 2017. \nA 5-year revalidation was completed on March 10, 2021 by reviewing existing PHAs, MOCs, and any previous incidents. Findings and recommendations were addressed by August 11, 2022, which is within the 2.5-year limit allowed under 19 CCR Section 2760.2(e).\nOperating Procedures\nPG&E maintains up to date operating procedures for the CNG Fueling Process. The operating procedures address startup, normal operations, emergency shutdowns, emergency operations, normal shutdowns, and startup following a turnaround or emergency shutdown. Operating procedures contain information on operating limits, consequences of deviation from operating limits, and steps to correct or avoid deviations. Operating procedures also contain safety and health considerations including the following:\n?\tCNG properties and hazards\n?\tRelease and exposure prevention precautions such as engineering controls, administrative controls, and personal protective equipment\n?\tControl measures if a release/exposure occurs\n?\tQuality control for materials and inventory\n?\tSpecial hazards\nFinally, operating procedures also contain information on safety systems and their functions.\nPG&E also has developed and implemented safe work practices to control potential hazards including lockout/tagout, confined space entry, opening process equipment or piping, and controlling entrance/access to the Manteca CNG Fueling Facility. \nOperating procedures are maintained via electronic files at the department\u0092s SharePoint where it can be accessed by all personnel within the department. Staff is trained regarding how to readily access operating procedures. The LNG/CNG South Maintenance and Operations (M&O) Supervisor is responsible for reviewing the operating procedures as often as is required and at least annually. The LNG/CNG South M&O Supervisor or the LNG/CNG Engineering Supervisor certifies annually that the operating procedures"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000102395,
      "SummaryText": "are current and accurate. \nTraining\nPG&E employees are trained in an overview of the process as well as in the written operating procedures before they may operate the Manteca CNG Fueling Facility. They are provided refresher training at least every 3 years or on a frequency established by the LNG/CNG South M&O Supervisor in consultation with affected employees. Training records are maintained at the facility.\nMechanical Integrity\nPG&E uses a Computerized Maintenance Management System (CMMS) to schedule maintenance inspections, testing, preventive maintenance, and corrective actions for the Manteca CNG Fueling Facility based on manufacturer\u0092s equipment manuals and other written procedures. The LNG/CNG South M&O Supervisor is responsible for assuring that maintenance materials, spare parts, and equipment are suitable for the process and represent \u0093replacement in kind\u0094 unless such materials, spare parts, and equipment have been evaluated and approved through the MOC process. The LNG/CNG South M&O Supervisor is also responsible for training staff involved in maintaining the system. Training records are maintained at the facility.\nManagement of Change\nPG&E has implemented a written MOC procedure to manage changes to process technology, equipment, documentation and procedures, and the physical facility infrastructure. The LNG/CNG Engineering Manager adheres to this procedure when there are any qualifying changes that occur to the Manteca CNG Fueling Facility in addition to any potential requirements (e.g., timeline notification) that the CalARP Program requires under this RMP. \nIn the event that there is a change to the Manteca CNG Fueling Facility other than \u0093replacement in kind\u0094, PG&E will evaluate the change, including the technical basis, impact on safety and health, need for new/modified operating procedures, implementation schedule, and authorization requirements and make a decision on how to proceed. Facility staff with responsibilities affected by the change is"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000102395,
      "SummaryText": "informed of, and trained on, the change prior to startup and affected process safety information, operating procedures, and mechanical integrity procedures are updated.\nPre Startup Safety Review\nPG&E performed a PSSR, using a PSSR checklist, when the Manteca CNG Fueling Facility was initially commissioned. Upon any modification significant enough to require a change in process safety information, a PSSR will again be utilized for commissioning the modified system. The PSSR verifies that the facility and equipment are in accordance with design specifications; safety, operating, maintenance, and emergency procedures are in place and adequate; a PHA has been performed, if needed, and recommendations, if any, have been addressed before startup; and employees have been trained.\nCompliance Audits\nPG&E staff, including at least one person knowledgeable of the CNG Fueling Process, perform compliance audits at least every 3 years to verify that the prevention program procedures and practices are being followed. PG&E will prepare a written audit report for the compliance audit. PG&E will coordinate with the San Joaquin County Environmental Health Department on a schedule for resolution of findings with a maximum completion date of 1.5 years after the date of the compliance audit, per 19 CCR Section 2760.8(d). \nIncident Investigation\nPG&E has designed and constructed the Manteca CNG Fueling Facility and intends to maintain and operate it in such a way to prevent CNG releases. However, in the event an incident occurs that results in or could reasonably have resulted in a catastrophic release of CNG, PG&E will investigate the incident as promptly as possible, and no later than 48 hours after the incident. The LNG/CNG Engineering Manager will assign an incident investigation team, including at least one person knowledgeable in the process, and will establish a system to address, resolve, and document findings and recommendations of the written incident investigation report. Findi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000102395,
      "SummaryText": "ngs and recommendations will be resolved on a schedule established in consultation with the San Joaquin County Environmental Health Department with a maximum completion date of 1.5 years after the completion of the incident investigation or 2 years after the date of the incident, per 19 CCR Section 2760.9(e). PG&E will review the incident investigation report with affected personnel.\nEmployee Participation\nPG&E has implemented a written plan of action for employee participation to include consulting with employees on PHAs and other prevention program elements and providing employees with access to PHAs and other prevention program documentation.\n5 Year Accident History\nThe Manteca CNG Fueling Facility started operations in mid-2017. There have been no accidental releases from the Manteca CNG Fueling Facility that have resulted in deaths, injuries, or significant property damage on site, or offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\nEmergency Response Program\nPG&E has prepared an emergency response plan for the Manteca CNG Fueling Facility as an element of its Hazardous Materials Business Plan. PG&E has coordinated response actions with the City of Manteca Fire Department. \nPlanned Changes to Improve Process Safety\nPG&E has no current plans to alter process safety at the Manteca CNG Fueling Facility beyond what has already been implemented in response to previous PHA and compliance audit recommendations."
    }
  ]
}