{
  "FacilityID": 1000043330,
  "FacilityName": "Solenis-Macon Plant",
  "FacilityStr1": "7525 N.E. Industrial Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Macon",
  "FacilityState": "GA",
  "FacilityZipCode": "31216",
  "Facility4DigitZipExt": "7727",
  "FacilityCountyFIPS": "13021",
  "LEPC": "Georgia Dnr",
  "FacilityLatDecDegs": "32.701282",
  "FacilityLongDecDegs": "-083.663101",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.solenis.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79436434,
  "ParentCompanyName": "Solenis LLC",
  "Company2Name": null,
  "CompanyDUNS": 79436434,
  "Company2DUNS": 0,
  "OperatorName": "Hercules Inc",
  "OperatorStr1": "7525 N.E. Industrial Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Macon",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31216",
  "OperatorZipCodeExt": "7727",
  "RMPContact": "Keith L. Ball",
  "RMPTitle": "Plant Manager",
  "FTE": 36,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000073118",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-05-20 00:00:00",
  "SafetyInspectionBy": "Department of Homeland Security",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.70168,
  "FRS_Long": -83.65855,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053422,
      "AltID": "Drum Storage",
      "FacilityID": 1000043330,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054188,
          "ProcessID": 1000053422,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064874,
          "ProcessID": 1000053422,
          "ChemicalID": 31,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 31,
            "ChemicalName": "Cyclohexylamine  [Cyclohexanamine]",
            "CASNumber": "108-91-8",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564874,
          "ProcessID": 1000053422,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043330,
      "SummaryText": "Executive Summary\n\n\n\nAccidental Release Prevention And Emergency Response Policies\n\n\n\nSolenis is dedicated to providing a safe and healthful environment for our employees, customers, and communities.  To do this, we are dedicated toward working toward continuous improvement in our operations to prevent pollution, reduce risks, and to enhance safety, health, and environmental performance.  By incorporating these beliefs and attitudes into the way we do things at Solenis, we take a key step forward in minimizing the environmental impact of our operations, satisfying customer needs, and creating shareholder value.  We adhere to the following basic principles in managing our business worldwide:  \n\nWe will comply with the letter and the spirit of all applicable health, safety and environmental laws, regulations, and corporate guidelines.  \n\nWe will define strategic objectives, develop tactical plans, identify clear accountability, provide necessary resources, and measure our progress on safety, health, and environmental matters on an ongoing basis.  \n\nOur planning will consider our business goals and significant safety, health and environmental aspects of our products and operations, and will work to reduce adverse impacts. \n\nWe will provide for an open dialogue on safety, health, and environmental issues relating to our products and our operations with our stakeholders, including shareholders, employees, customers, suppliers, government agencies, and communities.  \n\nWe will work continually to reduce workplace injuries, incidents with the potential to cause property damage, material loss, or interruption of our business, or waste and releases to the environment.  \n\nAll Solenis employees, worldwide, are responsible and accountable for incorporating safety, health, and environmental activities into our daily business activities.  \n\nOur company senior management and the facility personnel are committed to safety and implementation of safe procedures.   We operate under the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043330,
      "SummaryText": " Solenis corporate policy for Safety, Health & Environment. \n\n\n\nFacility Description And The Regulated Substances Handled\n\n\n\nSolenis manufactures specialty water-treatment chemicals, primarily used for the treatment of water and wastewater in industrial process systems such as boilers and cooling towers and paper chemicals. \n\nMost of our products are formulated by blending several raw materials within a mixing vessel and then packaging into various  containers.  Depending on our customer's needs, our package types can range from small 5-gallon pails to 6000-gallon truckload quantities.\n\nSimilarly, our raw materials, which we receive from suppliers, come in various  containers depending on customer demand for the product and the amount necessary to meet supply limitations and production demand. We receive materials in bags, pails, drums, totes, supersacks, and bulk containers. \n\n\n\n\n\nThe Solenis - Macon Plant covers 14.73 acres, of which 2.37 acres are used for offices, warehouse(s), production facilities and outdoor material storage.  The balance is used for access roads, parking lot or open lawn, or idle areas.\n\n\n\nAt the facility, cyclohexylamine is a chemical raw material stored onsite as a liquid in 55-gallon drums.  The maximum inventory is 42,742 pounds. Cyclohexylamine acts as a corrosion inhibitor by neutralizing acids and elevating pH in steam condensate, which makes it particularly useful as a component of our product line and to our customers.  This material is stored in a protected area and removed from any combustion sources.\n\n\n\nThe General Accidental Release Prevention Program And Chemical-Specific Prevention Steps\n\n\n\nThe purpose of the program is to define steps that are taken to identify, evaluate, and prevent or mitigate releases of hazardous chemicals that could occur as a result of failures in processes, procedures, or equipment.  The prevention program includes elements that cover the compilation of process safety information related to the process"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043330,
      "SummaryText": ", performance of process hazard review to identify and evaluate potential release scenarios, development and use of operating procedures, processes for insuring proper training of employees who are involved in handling hazardous chemicals, preventive maintenance for key equipment to limit the potential for failures that could cause releases, processes for managing changes in the process and conducting incident investigations for any release events that may occur. A maximum drum storage inventory limit has been established for cyclohexylamine.  This limit is maintained in the facility SAP purchasing system.  Receiving personnel move cyclohexylamine drums immediately to the designated storage area upon receipt. A single layer-only operating practice, when transporting RMP-regulated substances on-site via forklift truck, has been implemented. Plant personnel transport only the required number of drums for the scheduled batch into the blending room. The prevention program also includes requirements for performing compliance audits of the implementation of the prevention program.\n\n\n\nThe Five-Year Accident History\n\n\n\nAt the Solenis - Macon Plant we have not had any accidental releases that resulted in significant death, injury, property damage on-site or known offsite deaths, injuries, evacuations, sheltering-in-place, property or environmental damage in the past 5 years due to the use or handling of cyclohexylamine.\n\n\n\nThe Emergency Response Program\n\n\n\nOur chemical release response program contains these elements:\n\n- Identification of emergency organization personnel structure and functional responsibilities\n\n- Quarterly inspections to determine any new sources of ignition and a check of safety control devices\n\n- Annual inspections by Factory Mutual \n\n- Fire extinguisher training  \n\n- Annual fire drills conducted by our facility\n\n- Written procedures for handling emergency situations \n\n- Evacuation procedures and external response notifications\n\n- Incident coordination w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043330,
      "SummaryText": "ith local emergency responders\n\n- Incident analysis and review with all plant personnel, and identification of procedure changes\n\n-Annual training for reporting and containing spills and releases \n\n-Written RMP Procedure \n\n\n\nPlanned Changes To Improve Safety\n\nThe facility plans to make additional camera upgrades in the bulk loading area and \"Day Tank\" storage area. Employee and visitor parking was moved to the front of the building improving security access for employee's and visitor screening. The facility currently has total perimeter fencing and the gates are locked whenever the facility is not in operation. \n\n"
    }
  ]
}