{
  "FacilityID": 1000029316,
  "FacilityName": "Coffeen Energy Center",
  "FacilityStr1": "134 CIPS Lane",
  "FacilityStr2": null,
  "FacilityCity": "Coffeen",
  "FacilityState": "IL",
  "FacilityZipCode": "62017",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17135",
  "LEPC": "Montgomery County LEPC",
  "FacilityLatDecDegs": "39.058658",
  "FacilityLongDecDegs": "-089.401838",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.dynegy.com",
  "FacilityEmailAddress": "brian.voelker@dynegy.com",
  "FacilityDUNS": 6936017,
  "ParentCompanyName": "Illinois Power Generating Company",
  "Company2Name": null,
  "CompanyDUNS": 21104786,
  "Company2DUNS": 0,
  "OperatorName": "Illinois Power Generating Company",
  "OperatorStr1": "601 Travis Street",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": null,
  "RMPContact": "Randy O'Keefe",
  "RMPTitle": "Managing Director  Coffeen",
  "FTE": 131,
  "OtherEPAFacilityID": "IL60426",
  "EPAFacilityID": "100000060426",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "IL000667212",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "RMP for Anhydrous Ammonia and Chlorine",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-02-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-07-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-07-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-03-26 00:00:00",
  "DeRegistrationEffectiveDate": "2020-01-01 00:00:00",
  "AnniversaryDate": "2017-07-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.06424,
  "FRS_Long": -89.39237,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000035784,
      "AltID": "Selective Catalytic Reduc",
      "FacilityID": 1000029316,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000036166,
          "ProcessID": 1000035784,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043348,
          "ProcessID": 1000035784,
          "ChemicalID": 56,
          "Quantity": 440000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000543348,
          "ProcessID": 1000035784,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000035785,
      "AltID": "Biofouling Control",
      "FacilityID": 1000029316,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000036167,
          "ProcessID": 1000035785,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043349,
          "ProcessID": 1000035785,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000543349,
          "ProcessID": 1000035785,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029316,
      "SummaryText": "Executive Summary\n\n\n\nAccidental release prevention and emergency response policies\n\n\n\nThe Company has developed a risk management plan, evaluated process hazards and reviewed the design and construction of the ammonia and chlorine systems to ensure that they are safe to operate.  Employees participated in the system review and process hazards analysis.  The Company has trained and properly equipped its employees who will be responding to potential releases from these systems.  Also, the Company?s emergency response plan provides for notification of outside emergency responders to give on-site assistance and/or emergency evacuation/shelter-in-place notification of affected residents in the event of an ammonia or chlorine release.\n\n\n\nStationary source and regulated substance handled\n\n\n\nThe Ameren Energy Generating Coffeen Power Plant is located in Montgomery County, Illinois, approximately 2.5 miles southeast of the city of Coffeen. The Coffeen Plant began producing electricity in 1965. Coffeen plant has been chlorinating its circulating water since 1973 without any significant releases or injuries. The chlorination system has been periodically upgraded, and safely used one ton cylinders of chlorine since initially installed. The plant typically uses 60,000 pounds of chlorine each year to prevent biofouling of condensers and other equipment from water drawn out of Coffeen Lake.  Chlorine is added to the water for ten minutes, twelve times daily per the requirements in the NPDES permit.  The system is checked at least three times daily by operations.  Leak checks are also done whenever a new bank of cylinders is placed in service.  There are 4 banks with 4 chlorine cylinders per bank located within a fenced area near the plant entrance.  The system has leak detectors, as well as alarms to warn of any process deviations.\n\n\n\nThe plant began operation of a selective catalytic reduction unit (SCR) on one of its two coal-fired units in the fall of 2001 and began commercial "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029316,
      "SummaryText": "operation during May 2002.  The second SCR began operation on the second unit in May 2003.  An anhydrous ammonia injection system was installed to supply ammonia gas to the SCR systems for the purpose of NOx (nitrogen oxides) emissions control. Commercial grade anhydrous ammonia (99.5% or higher purity with a maximum water content of 0.5%) is required for this system.  The ammonia is stored in two 50,000-gallon tanks. From these storage tanks, the anhydrous ammonia is pumped to a vaporizer, if required due to low ambient temperatures.  Under current operating conditions, the ammonia will have enough pressure that the pumps are bypassed, and the ammonia flow is directly routed to the vaporizer. The vaporizer uses steam to vaporize the ammonia. Ammonia gas then passes through a line to the mixing chamber where it is diluted with air.  This ammonia and dilution air mixture is piped to the distribution header and injected directly into the exhaust gas. As the treated exhaust gas flows over the SCR catalyst bed, the NOx is reduced to nitrogen (N2) and water vapor.\n\n\n\nWorst-case release scenario and alternative-case release scenario, including administrative controls and mitigation measures\n\n\n\nThe worst case release scenario for chlorine involves the release of 8,000 pounds within ten minutes producing a vapor cloud that is predicted to travel offsite for a distance of 4.1 miles before reaching safe levels.\n\nThe alternative case scenario for chlorine is a pipe leak that releases 8000 pounds within 13 minutes producing a vapor cloud predicted to travel 3.0.miles before reaching safe levels.\n\nThe worst case release scenario for anhydrous ammonia involves the loss of 227,852 pounds within ten minutes due to liquid spill and vaporization.  The resulting vapor cloud is predicted to travel off-site for a distance of 5.3 miles before reaching safe levels.\n\nThe alternative case scenario for anhydrous ammonia is a release of 109,564 pounds within 60 minutes due to the rupture of a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029316,
      "SummaryText": " 2 inch supply line from the storage tanks to the vaporizer.  The resulting vapor cloud is predicted to travel for a distance of 1.3 miles before reaching safe levels.\n\nThe only mitigation measures associated with the chlorine system are chlorine detectors around the process area.\n\n\n\nThe anhydrous ammonia system has 8 sensors to detect any ammonia leaks, and 12 spray nozzles that will automatically activate to minimize the possibility of a catastrophic release of ammonia from the tank and feed system. There are also pressure relief valves on the storage tanks, as well as, flow control valves to sense changes in flow, and automatically close. The 50,000-gallon ammonia storage tanks are located so that accidental contact is unlikely. An emergency shower/eyewash facility is located at the unloading area, and guardrails are installed to prevent vehicular contact during unloading activities.  The Company has developed administrative controls to monitor the ammonia filling process to reduce the likelihood of a release during that operation.\n\n\n\nGeneral accidental release prevention program and chemical-specific prevention steps\n\n\n\nThe importance of preventing any releases is stressed through on the job and formal classroom training.  Company personnel will adhere to the system vendor?s operations and maintenance procedures that are based on acceptable industry standards. \n\n\n\nFive-year accident history\n\n\n\nThere have been no accidents to report from these systems.\n\n\n\nEmergency response program\n\n\n\nCompany employees who have been properly trained and equipped with the necessary personal protective equipment and tools, and will respond to the ammonia or chlorine release initially.  If the leak cannot be isolated, and outside assistance is deemed necessary, the Company will notify 911.  This will trigger notification of the Coffeen Fire Department to begin evacuation procedures of the surrounding area.  The Ambulance Service, Montgomery County's Sheriff Department, Illinois Stat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029316,
      "SummaryText": "e Police Hazmat Team, the Montgomery County Emergency Service Disaster Agency (ESDA), and the Illinois Emergency Management Association (IEMA) would also be notified by the 911 coordinator.\n\n\n\nPlanned changes to improve safety\n\n\n\nThe processes will be audited and systems will be inspected regularly to ensure that it remains safe to operate.  The Company has implemented a Management of Change procedure to evaluate the safety and adequacy of any changes that may have to be made to the system."
    }
  ]
}