{
  "FacilityID": 1000064698,
  "FacilityName": "Tate & Lyle, Loudon",
  "FacilityStr1": "198 Blair Bend Drive",
  "FacilityStr2": null,
  "FacilityCity": "Loudon",
  "FacilityState": "TN",
  "FacilityZipCode": "37774",
  "Facility4DigitZipExt": "6562",
  "FacilityCountyFIPS": "47105",
  "LEPC": "Loudon County LEPC",
  "FacilityLatDecDegs": "35.735278",
  "FacilityLongDecDegs": "-084.318333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.tateandlyle.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 49016843,
  "ParentCompanyName": "Tate & Lyle Ingredients, Americas,LLC",
  "Company2Name": null,
  "CompanyDUNS": 38244117,
  "Company2DUNS": 0,
  "OperatorName": "Tate & Lyle Ingredients, Americas",
  "OperatorStr1": "2200 East Eldorado Street",
  "OperatorStr2": null,
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62521",
  "OperatorZipCodeExt": "1578",
  "RMPContact": "Richard May",
  "RMPTitle": "Safety & Environmental Manager",
  "FTE": 306,
  "OtherEPAFacilityID": "3774STLYMROU",
  "EPAFacilityID": "100000148208",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "561515",
  "SafetyInspectionDate": "2003-07-02 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-11-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-07-26 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-07-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-07-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.73444,
  "FRS_Long": -84.32222,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000081137,
      "AltID": "Corn Wet Milling",
      "FacilityID": 1000064698,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000082379,
          "ProcessID": 1000081137,
          "NAICSCode": "32519",
          "_desc": {
            "NAICS_CODE": "32519",
            "NAICS_DESCRIPTION": "Other Basic Organic Chemical Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000082380,
          "ProcessID": 1000081137,
          "NAICSCode": "311221",
          "_desc": {
            "NAICS_CODE": "311221",
            "NAICS_DESCRIPTION": "Wet Corn Milling"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000101125,
          "ProcessID": 1000081137,
          "ChemicalID": 49,
          "Quantity": 144000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000101126,
          "ProcessID": 1000081137,
          "ChemicalID": 56,
          "Quantity": 246700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601125,
          "ProcessID": 1000081137,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601126,
          "ProcessID": 1000081137,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000064698,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nTate & Lyle, Loudon is strongly committed to employee, public,  and\n\nenvironmental  safety.   This commitment  is  demonstrated  by  our\n\ncomprehensive  accidental release prevention  program  that  covers\n\nareas   such   as   design,  installation,  operating   procedures,\n\nmaintenance and employee training associated with the processes  at\n\nour  facility.  It is our policy to implement appropriate  controls\n\nto prevent possible releases of regulated substances.\n\n\n\nTHE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\n\n\n\nOur  facility's  primary activities encompass  the  manufacture  of\n\nsweeteners,  corn syrups, ethanol, and propanediol  utilizing  corn\n\nwet  milling  and  fermentation processes.  Tate  &  Lyle  has  two\n\nregulated  substances at our facility.  The substances  are  Sulfur\n\nDioxide   (anhydrous)  and  Ammonia  (anhydrous).   Sulfur  Dioxide\n\n(anhydrous)  is  used to control microbial growth during  the  corn\n\nsteeping  process and also weakens the starch-gluten bonds  so  the\n\nseparation  process following steeping is more efficient.   Ammonia\n\n(anhydrous) is used as an ingredient in the fermentation process to\n\nproduce propanediol.\n\n\n\nThe maximum inventory of Sulfur Dioxide and Ammonia at our facility\n\nis 144,000 pounds and 246,700 pounds, respectively.\n\n\n\nTHE WORST CASE AND ALTERNATE RELEASE SCENARIOS\n\n\n\nTo evaluate the worst case and alternate release scenarios, Tate  &\n\nLyle  utilized  the  EPA's  RMP Comp. \n\nThe  following paragraphs provide details of  the  chosen\n\nscenarios.\n\n\n\nTHE SULFUR DIOXIDE WORST CASE RELEASE SCENARIO submitted involves a\n\ncatastrophic release from the Sulfur Dioxide storage tank.  In this\n\nscenario  144,000 pounds of Sulfur Dioxide (anhydrous) is  released\n\nin  a  gaseous  form  over  10 minutes.   At  class  F  atmospheric\n\nstability,  1.5  m/s  wind speed and urban topography  the  maximum\n\ndistance  of 13 miles is obtained corresponding to a tox"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000064698,
      "SummaryText": "ic endpoint\n\nof 0.0078 mg/L.\n\n\n\nTHE SULFUR DIOXIDE ALTERNATE RELEASE SCENARIO involves the break of\n\nthe  2\"  transfer line between a Sulfur Dioxide truck and the  bulk\n\nSulfur Dioxide storage tank.  The scenario involves the release  of\n\n18,000  pounds  of  Sulfur Dioxide.  The existing controls  prevent\n\nbulk tank losses.  The operator and the truck driver monitoring the\n\ntruck  unloading will require up to 30 minutes to stop the release.\n\nThe  toxic  gas will be released to the atmosphere with no  passive\n\nmitigation  to  control  the release rate.  Under  neutral  weather\n\nconditions  of class D atmospheric stability and 3 m/s  wind  speed\n\nand  assuming  urban topography the maximum distance to  the  toxic\n\nendpoint of 0.0078 mg/L of Sulfur Dioxide is 0.4 miles.\n\n\n\nTHE  AMMONIA  WORST  CASE  RELEASE SCENARIO  submitted  involves  a\n\ncatastrophic  release  from  the Ammonia  storage  tank.   In  this\n\nscenario  246,700 pounds of Ammonia (anhydrous) is  released  in  a\n\ngaseous  form  over 10 minutes.  At class F atmospheric  stability,\n\n1.5 m/s wind speed and urban topography the maximum distance of 5.6\n\nmiles is obtained corresponding to a toxic endpoint of 0.14 mg/L.\n\nTHE AMMONIA ALTERNATE RELEASE SCENARIO involves sending a charge of\n\nAmmonia  to  an empty fermentor when no dextrose is present.   This\n\nscenario  would  release  200 pounds of Ammonia  over  20  minutes.\n\nUnder  neutral weather conditions of class D atmospheric  stability\n\nand  3  m/s  wind speed and assuming urban topography, the  maximum\n\ndistance to the toxic endpoint of 0.14 mg/L is 0.1 miles.\n\n\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-\n\nSPECIFIC PREVENTION STEPS\n\n\n\nTate  &  Lyle has taken all the necessary steps to comply with  the\n\naccidental  release prevention requirements set out  under  40  CFR\n\npart 68 of the EPA.  This facility was designed and constructed  in\n\naccordance  with  NFPA-30 Standard, 1957 edition.   Non-combustible\n\nchemical  storage  systems "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000064698,
      "SummaryText": " were designed  and  are  maintained  in\n\nconformance  with  applicable ANSI standards and chemical  supplier\n\nrecommendations.   The  following  sections  briefly  describe  the\n\nelements of the release prevention program that is in place at  our\n\nstationary source.\n\n\n\nPROCESS SAFETY INFORMATION\n\n\n\nTate  & Lyle, Loudon maintains a record of safety information  that\n\ndescribes the chemical hazards, operating parameters, and equipment\n\ndesign associated with all processes.\n\n\n\nPROCESS HAZARD ANALYSIS\n\n\n\nOur  facility conducts comprehensive studies to ensure that hazards\n\nassociated   with  our  processes  are  identified  and  controlled\n\nefficiently.  The methodology used to carry out these  analyses  is\n\nthe  HAZOP and What  if Scenarios.  The studies are undertaken by a  team  of\n\nqualified  personnel  with  expertise in  engineering  and  process\n\noperations and are revalidated at regular intervals.  Any  findings\n\nrelated  to  the hazard analysis are addressed in a timely  manner.\n\nThe  most  recent  PHA  review for the Sulfur  Dioxide  System  was\n\nperformed on October 11, 2018, and the most recent PHA review for the\n\nAmmonia System is 05/10/2019.\n\n\n\nOPERATING PROCEDURES\n\n\n\nTate  &  Lyle,  Loudon  maintains written operating  procedures  to\n\nsafely  conduct  activities within the  covered  processes.   These\n\nprocedures address various modes of operation such as initial start-\n\nup,  normal  operation, temporary operations,  emergency  shutdown,\n\nemergency  operations,  normal  shutdown,  and  startup   after   a\n\nmaintenance shutdown.  The information is regularly reviewed and is\n\nreadily accessible to operators involved in the processes.\n\n\n\nTRAINING\n\n\n\nTate  & Lyle, Loudon has a comprehensive training program in  place\n\nto  ensure that employees who are operating processes are competent\n\nin  the  operating  procedures  associated  with  these  processes.\n\nRefresher  training  is provided as needed and  at  least  every  3\n\nyears.\n\n\n\nMECHANICAL INTEGRITY\n\n\n\nTate"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000064698,
      "SummaryText": "  &  Lyle, Loudon caries out documented maintenance  checks  on\n\nprocess  equipment to insure proper operations.  Process  equipment\n\nexamined by these checks includes: pressure vessels, storage tanks,\n\npiping systems relief and vent systems, emergency shutdown systems,\n\ncontrol  and  pumps.   Qualified personnel  carry  out  maintenance\n\noperations   with  previous  training  in  maintenance   practices.\n\nFurthermore,  these personnel are offered specialized  training  as\n\nneeded.   Any  equipment deficiencies identified by the maintenance\n\nchecks are corrected in a safe and timely manner.\n\n\n\nMANAGEMENT OF CHANGE\n\n\n\nTate  &  Lyle,  Loudon have written procedures in place  to  manage\n\nchanges in process chemicals, technology, equipment and procedures.\n\nThe  most  recent  review/revision of  maintenance  procedures  was\n\nperformed  on  January 13,  2017. Process  operators,  maintenance\n\npersonnel, or any other employee whose job tasks are affected by  a\n\nmodification in process conditions are promptly made aware  of  and\n\ngiven training on the modification.\n\n\n\nPRE-START UP REVIEW\n\n\n\nTate & Lyle, Loudon conducts pre-start up safety reviews related to\n\nnew  processes and modifications.  These reviews are  conducted  to\n\nconfirm  that  construction, equipment  operating  and  maintenance\n\nprocedures are suitable for safe startup prior to placing equipment\n\nin operation.\n\n\n\nCOMPLIANCE AUDITS\n\n\n\nTate  &  Lyle, Loudon has audits conducted on a periodic  basis  to\n\ndetermine whether the provisions set out under the PSM rule and the\n\nRMP  rule are being implemented. The most recent compliance  audit\n\nwas  conducted January 11, 2018. These audits are conducted at least\n\nonce  every 3 years and any corrective actions required as a result\n\nof the audits are undertaken in a safe and prompt manner.\n\n\n\nINCIDENT INVESTIGATION\n\n\n\nTate  &  Lyle, Loudon promptly investigates any incident  that  has\n\nresulted  in, or could reasonably result in a catastrophic  release\n\nof  a regulated "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000064698,
      "SummaryText": "substance.  These investigations are undertaken  to\n\nidentify  the  situation leading to the incident  as  well  as  any\n\ncorrective  actions to prevent the release from  reoccurring.   All\n\nreports are retained for a minimum of 5 years.\n\n\n\nEMPLOYEE PARTICIPATION\n\n\n\nTate  &  Lyle,  Loudon believes that process safety management  and\n\naccident  prevention  is  a  team effort.   Company  employees  are\n\nstrongly  encouraged  to  express their views  concerning  accident\n\nprevention issues and to recommend improvements.  In addition,  our\n\nemployees  have access to all information created as  part  of  the\n\nfacility's  implementation of the RMP rule,  including  information\n\nresulting from process hazard analysis.\n\n\n\nCONTRACTORS\n\n\n\nTate & Lyle, Loudon employs contractors to conduct specialized  and\n\nroutine    maintenance   construction   activities.    Long    term\n\nrelationships have been established with the contractors that  work\n\non  a  routine basis.  All contract personnel are required to  have\n\nsite   specific  training.   This  contractor  training   must   be\n\ndocumented before a contractor worker is allowed on the  job  site.\n\nThe  contractor  safety  representative  meets  with  Tate  &  Lyle\n\nrepresentatives  regularly.   Tate  &  Lyle  and   the   contractor\n\ndocuments  meetings  as well as investigation reports  to  document\n\npast  safety  performance.  Tate & Lyle  has  a  strict  policy  of\n\ninforming  contractors of known potential hazards  related  to  the\n\ncontractor's  work.   Contractors are  also  informed  of  all  the\n\nprocedures  for emergency response should accidental release  of  a\n\nregulated substance occur.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nTate  &  Lyle, Loudon has an excellent record preventing accidental\n\nreleases over the last 5 years. There are currently no incidents for the five year reporting period.\n\n\n\nEMERGENCY RESPONSE PLAN\n\n\n\nTate  &  Lyle,  Loudon  has a written emergency  response  plan  to\n\naddress  accidental  releases  of h"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000064698,
      "SummaryText": "azardous  materials.   The  plan\n\nincludes all aspects of emergency response including adequate first\n\naid  and  medical  treatment, evacuations,  notification  of  local\n\nemergency response agencies and the public as well as post-incident\n\ndecontamination of affected areas.\n\n\n\nTo  ensure proper functioning, the emergency response equipment  is\n\nregularly  inspected  and  serviced.   In  addition,  the  plan  is\n\npromptly  updated  to  reflect any pertinent changes  taking  place\n\nwithin  the  processes  that  would require  a  modified  emergency\n\nresponse.\n\n\n\nLoudon  County Emergency Planning Committee is the Local  Emergency\n\nPlanning  Committee  with  which  our  emergency  plans  has   been\n\ncoordinated and verified.\n\n\n\n"
    }
  ]
}