{
  "FacilityID": 1000114023,
  "FacilityName": "True Leaf Farms, LLC",
  "FacilityStr1": "1250 Hansen Street",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.656306",
  "FacilityLongDecDegs": "-121.625175",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "www.churchborthers.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "True Leaf Farms, LLC",
  "OperatorStr1": "P.O. Box 879",
  "OperatorStr2": null,
  "OperatorCity": "San Juan Bautista",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95045",
  "OperatorZipCodeExt": null,
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000031431",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-05-31 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-05-31 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-05-31 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.656306,
  "FRS_Long": -121.625175,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000142058,
      "AltID": "Main Plant Ammonia Refrig",
      "FacilityID": 1000114023,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000177716,
          "ProcessID": 1000142058,
          "ChemicalID": 56,
          "Quantity": 13157.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000143572,
          "ProcessID": 1000142058,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000121526,
              "Process_NAICS_ID": 1000143572,
              "SafetyReviewDate": "2024-04-04 00:00:00",
              "PHA_Date": "2024-04-29 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2026-10-29 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Lack of Maintenance, physical damage & vandalism/terrorism, design deficiency",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Water Diffusion Tank",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Water Diffusion Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "change in owner/operator, addition of portable refrigeration trailers, removal of hydrocooler, broccoli driers, and ice makers",
              "OpProceduresReviewDate": "2024-04-15 00:00:00",
              "TrainingReviewDate": "2024-04-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Tailgate",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-04-15 00:00:00",
              "EquipmentInspectionDate": "2024-04-29 00:00:00",
              "EquipmentTested": "All Refrigeration Equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2024-04-15 00:00:00",
              "PreStartupReviewDate": "2024-04-15 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2024-04-15 00:00:00",
              "HotWorkPermitReviewDate": "2024-04-15 00:00:00",
              "ContractorSafetyReviewDate": "2024-04-15 00:00:00",
              "ContractorSafetyEvalDate": "2024-04-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000152436,
                  "PreventionProgram3ID": 1000121526,
                  "ProcessChemicalID": 1000177716
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000114023,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-05-14 00:00:00",
    "ERTrainingDate": "2024-04-01 00:00:00",
    "CoordinatingAgencyName": "Salinas Fire Department",
    "CoordinatingAgencyPhone": "8317587261",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000114023,
      "SummaryText": "place, property damage, or environmental damage.\n\n5. Emergency Response Program\nTrue Leaf Farms facility is a Non-Responding facility. Facility only responds to situations that are within their capabilities. These may include, emergency shutdown, equipment isolation and pumping down the system. No emergency response actions or site clean-up that are beyond the capabilities of the refrigeration personnel will be performed. In case of an emergency, incident will be reported immediately to the RMP Program Coordinator. The RMP Program Coordinator is responsible for assisting county emergency responders upon arrival on site. This may include contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by the release. The RMP Program Coordinator will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if off-site evacuations are required.\n\n6. Planned Changes to Improve Safety\nRecommended corrective actions to mitigate the potential for an accidental ammonia release are proposed on the tables located in RMP Binder Chapter 0.0. The table items result from recommendations made during the Process Hazard Analysis, a Code Compliance Review, Seismic Review, and a Safety Inspection performed by a qualified person. Some recommendation items in the recommendation table originate from multiple codes but are listed only once. Specific facility areas and systems categorize recommendations resulting from the Safety Inspection; some of which may repeat general Process Hazard Analysis and Code Compliance Review items. \nBased on the severity of the hazards identified, implementation deadlines are also recommended. All refrigeration equipment is well maintained and operated in a safe manner by trained personnel. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000114023,
      "SummaryText": "pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/ or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. See Chapter 8 Appendix 8.4 for Safety Data Sheets (SDS) for anhydrous ammonia.\n\n3. General Accidental Release Prevention Program\nTrue Leaf Farms facility maintains a release prevention program to prevent or mitigate releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases for ways to prevent a similar future release, see Appendix 16 - Incident Investigation of the RMP Binder.\nThe ammonia refrigeration system has specific safety procedures to prevent a release. Operators, contractors and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency reporting and monitoring and assisting local emergency responders in the event of an ammonia release. There are emergency shut-off switches outside the machinery room for shutting down the Main System. Also, there are emergency shut-off switches for each refrigeration trailer/ vacuum tube system. Ammonia detectors are installed in all the refrigerated rooms and the engine room. The personnel in the list are notified by the control system, if any detector exceeds its set point. All of the pressure relief valves at the facility are tied to an ammonia diffusion tank to prevent high-pressure release to ambient.\n\n4. Five-Year Accident History\nAccording to True Leaf Farms personnel, there has been no releases of anhydrous ammonia in the last 5 years that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000114023,
      "SummaryText": "igeration manager in case an ammonia leak is detected in the cold rooms. The detectors in the engine room are also interlocked with emergency ventilation fans. Furthermore, the detectors can shut down compressors and solenoid valves at higher ammonia concentration levels. A manual switch to shut down all fixed compressors is located outside the machinery room, likewise, the refrigeration trailers each have their own emergency shutdown switch. To prevent mechanical failure and subsequent release of ammonia, all compressors have safety switches that would shut down the compressors upon detection of unsafe operating conditions such as high liquid levels in the low-pressure vessels and high discharge pressures. As another line of defense against excessive pressure, all pressure vessels and compressors are protected against high-pressure situations by safety relief valves. Lastly, there are assigned responders (refrigeration contractors) experienced with ammonia refrigeration that would respond to and determine specific actions for any incident. \nThe total ammonia charge of the refrigeration systems at the facility is approximately 18,000 lb. Refrigeration drawings are in Chapter 8 Appendix 8.1 (Refrigeration System Drawings) of the RMP Binder. A list of refrigeration equipment used at this facility can be found in Appendix 12 of the RMP Binder. Fixed and portable refrigeration equipment locations can be found on the plans located on sheets R1.0, R2.0 and R2.1 in the RMP Binder. International Institute of Ammonia Refrigeration (IIAR) Ammonia Refrigeration Safety Inspection Checklists, located in Appendix 12 of the RMP Binder, describe equipment details.\nThe refrigeration system at this facility is a single-stage vapor compression cycle. In general, the process chemistry for the refrigeration system is provided in Chapter 8 of the RMP Binder.\nAnhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000114023,
      "SummaryText": "ontrol systems and diffusion tanks. The main system is used for cold storage space via evaporators and pre-cooling via pressure coolers. The main system compressors, pressure vessels (high-pressure receivers and low-pressure receivers) are in a dedicated machinery room. There is refrigeration control panel inside the electrical room that schedules the fan coil defrost times and monitors the ammonia detectors inside the cold rooms.\nPortable systems located outdoors are used solely for pre-cooling and consist of two (2) high-side refrigeration trailers, and three (3) half-car (12 pallet) vacuum tubes.  A vacuum tube consists of a retort with a cooling coil inside and mounted on the roof is a low-pressure vessel (i.e. surge drum.) High-side refrigeration trailers are composed of compressors, evaporative condensers, and a high-pressure receiver. The high-side trailer and vacuum tube together form a complete refrigeration system. At the facility there are two vacuum tube systems, a half-car tube and trailer and the other consisting of two (2) half car tubes sharing one trailer. Each vacuum tube system operates independently of one another and the main system. Portable equipment is owned by Western Precooling Systems (WPS). WPS is responsible for setting-up, charging ammonia, maintaining, unloading ammonia, and removing the systems from the site each season.\nAt the end of the season, the facility pumps down (transfers) all the ammonia in the fixed system to the main system high-pressure receiver. The ammonia in the portable systems is stored in a nurse tank, which is not connected to the refrigeration system. All the portable systems are removed and do not return until the beginning of the new season.\nThe refrigeration system is equipped with safeties to protect personnel from ammonia releases. The machinery room space is equipped with detectors and alarms. The detectors are tied to the refrigeration control panel and can activate alarms and send notifications to the refr"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000114023,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies\nTrue Leaf Farms facility conducts inspection procedures to review refrigeration equipment prior to startup and during operations. These procedures identify potential sources of release and equipment corrections required to prevent these releases. On-site personnel and certified refrigeration contractors review the equipment as required. On-site personnel provide initial emergency response.\nOn-site personnel will make a preliminary assessment in the event of a release and will provide first response. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an off-site release. No emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel. Local fire and police departments with mutual aid response will provide emergency response for a major release event. Refrigeration contractors would also be on-call to provide emergency response. Emergency response training will be conducted yearly for current employees and as required for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\n\n2. Stationary Source and Regulated Substances Handled\nTrue Leaf Farms uses anhydrous ammonia as a refrigerant in their operations at their facility. See Chapter 8 Appendix 8.1 of the RMP binder for the drawings showing the facility location map and site plan.\nThe refrigeration system is used for product pre-cooling (vacuum and pressure cooling) and cold storage. The system is composed of both fixed and portable equipment. The system with fixed equipment is the main system. Both main and portable systems are in operation seasonally from April 15 through November 15. \n The main system includes screw and reciprocating compressors, evaporative condensers, pressure vessels, cold room evaporators (fan coils), pressure coolers, ammonia detection, c"
    }
  ]
}