{
  "FacilityID": 1000033740,
  "FacilityName": "Texas Barge and Boat",
  "FacilityStr1": "4115 E Floodgate Rd",
  "FacilityStr2": null,
  "FacilityCity": "Freeport",
  "FacilityState": "TX",
  "FacilityZipCode": "77541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48039",
  "LEPC": "Brazoria County LEPC",
  "FacilityLatDecDegs": "28.901664",
  "FacilityLongDecDegs": "-095.383094",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.texasbarge.com",
  "FacilityEmailAddress": "info@texasbarge.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Mickey Tiner",
  "OperatorStr1": "4115 E Floodgate Rd",
  "OperatorStr2": null,
  "OperatorCity": "Freeport",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77451",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000221226",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1698",
  "SafetyInspectionDate": "2012-05-16 00:00:00",
  "SafetyInspectionBy": "United States Coast Guard",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-04-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-04-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-04-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 28.901664,
  "FRS_Long": -95.383094,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000041211,
      "AltID": "Propane Storage",
      "FacilityID": 1000033740,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000049435,
          "ProcessID": 1000041211,
          "ChemicalID": 98,
          "Quantity": 16440.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000041615,
          "ProcessID": 1000041211,
          "NAICSCode": "336611",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000033740,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": "2012-01-31 00:00:00",
    "ERTrainingDate": "2013-01-29 00:00:00",
    "CoordinatingAgencyName": "USCG Marine Safety Office, Houston",
    "CoordinatingAgencyPhone": "7136715100",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033740,
      "SummaryText": "chemical (propane) that Texas Barge and Boat stores on-site above threshold levels.  Details regarding the worst-case and alternative release scenarios for Texas Barge and Boat are provided in the RMP Plan.\r\n\r\nI.\tDESCRIPTION OF THE FACILITY AND PURPOSE OF SUBMITTAL\r\nTexas Barge and Boat, Inc. (Texas Barge and Boat) operates a marine terminal that primarily cleans and degasses marine tank barges, and will increase their propane storage capacity to facilitate flare operations. After expansion, Texas Barge and Boat will store up to a total capacity of 4,000 gallons.  Chemicals handled at the facility include hydrocarbons/petroleum products, solvents, intermediates, and industrial products.  The terminal is located on the Brazos River approximately three miles south of Freeport. In accordance with U.S. Environmental Protection Agency (EPA) regulations in Title 40 Code of Federal Regulations Part 68 (40 CFR 68), the U.S. EPA has identified quantities for 77 toxic substances and 63 flammable substances that require a facility to comply with the Risk Management Program (RMP) rules when unit inventories exceed threshold quantities.  The RMP rules require a facility to report the unit inventory for each RMP substance that exceeds threshold quantities, along with an EPA-approved chemical release prevention program.  In addition, 40 CFR 68 requires all RMP-covered facilities to update its Risk Management Plan (RMP Plan) within (6) months of an RMP reportable incident or every five (5) years, whichever comes first.  Per 40 CFR §68.190(b)(3), an update to the RMP is required no later than the date on which a new regulated substance is first present above its threshold quantity.  This is the initial submittal of the RMP Plan for Texas Barge and Boat.\r\n40 CFR 68 requires all facilities subject to the rule to conduct an Offsite Consequence Analysis (OCA) to provide information to the public as well as state and federal environmental agencies about potential consequences of an accid"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033740,
      "SummaryText": "ental chemical release.  OCAs are essential in identifying potential hazards of an accidental release.  OCAs can include a Worst-Case Scenario (WCS) and an Alternate Release Scenario (ARS).  This submission includes OCAs of both the WCS and ARS for propane (PROPANE), a toxic chemical; it is the only chemical stored in excess of a threshold quantity as listed in 40 CFR 68 at the site.  Although numerous controls are in place to prevent chemical releases and manage such consequences should an incident occur, no credit for active mitigation measures was taken into account in evaluating these scenarios.\r\nAn OCA for the WCS was conducted using the EPA's RMP Guidance for Offsite Consequence Analysis, (EPA 550-B-99-009, April 1999).  The RMP sets forth specific criteria that must be incorporated in modeling the WCS.  The EPA defines a WCS as one that results in the greatest distance from the point of release to a specified endpoint.  As defined by the rule, the endpoint for a toxic substance is a specified concentration.\r\nAn ARS assesses the potential hazards that are more realistic than those associated with the worst-case scenario and is designed to assist in the development of emergency response plans.  The EPA RMP Guidance for Offsite Consequence Analysis was used in modeling the alternative release scenarios.  As required, an alternative release scenario was created for a toxic chemical release.\r\nThis is the initial submission of the RMP Plan for Texas Barge and Boat.  It is a requirement to update the RMP Plan within five (5) years of the initial submittal, no later than three years after a substance is first listed by EPA, or no later than the day on which a newly regulated substance is first present above the threshold level in a process that is already covered.\r\nTable 1 lists the RMP-regulated substances that Texas Barge and Boat can hold above threshold quantities:\r\n\r\nTable 1  Chemicals Considered in RMP\r\nRegulated Chemical\tFound in\tCAS Number\tCharacteristic\tThre"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000033740,
      "SummaryText": "ents for regulated chemicals stored at the Texas Barge and Boat facility.  This RMP Plan is being prepared in its entirety for the Texas Barge and Boat Terminal pursuant to the EPA Chemical Accident Prevention Provisions found in 40 CFR 68.  Note that many items are included in greater detail in the site's Emergency Response Plan/Spill Prevention, Control and Countermeasure (SPCC) Plan.\r\nDevelopment\r\nThe contents of the RMP Plan reflect compliance with federal and additional requirements that Texas Barge and Boat has deemed appropriate for accident prevention.  The document has been prepared on behalf of Texas Barge and Boat by Source Environmental Sciences, Inc.  The RMP Plan has been reviewed and approved by the Texas Barge and Boat management.\r\nPeriodic Review\r\nAs set forth in 40 CFR 68, this RMP Plan is periodically reviewed and amended as necessary, and every five (5) years as required by 40 CFR 68.  Revisions to this plan are made whenever applicable regulations are revised or added, or whenever there is a change in the facility's design, construction, operation, or maintenance that will affect the contents of the plan.  When a revision to a section is made, other sections affected by the change will be checked to assure continued accuracy and relevance.  An entire section is reissued whenever a change is made to any portion of the section.  In the event that all sections are reissued at one time, all sections will be reviewed completely.\r\nA revision history will be maintained along with the plan and it is entitled Review and Revision History, which documents the changes made, the section number, revision date, effective date, and authorized signature of the person approving the section.  Obsolete original pages and obsolete revision history pages will be maintained for a period of three (3) years in the Texas Barge and Boat environmental records.  All amendments, revisions, and updates will be made in accordance with the requirements in 40 CFR 68.\r\nSpecific"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000033740,
      "SummaryText": "opriate action as instructed through HAZWOPER training.\r\n¿\tEvacuation plans and accounting for personnel after an evacuation.\r\n¿\tNotification of local emergency response agencies and the public if a release occurs.\r\n¿\tPost-incident cleanup and decontamination requirements.\r\n¿\tInspecting, testing, maintaining, and using emergency response equipment.\r\n\r\nXII.\tPLANNED CHANGES TO IMPROVE SAFETY\r\nTexas Barge and Boat continually strives to improve its safety related systems.  Its policies and procedures provide the most efficient means to minimize environmental impacts on-site and to the public.  Texas Barge and Boat also continues to improve by implementing an incident investigation database to monitor potential risks of future incidents.  The improvements made by Texas Barge and Boat, along with monthly reviews of current safety protocols, reduce the risk of future incidents."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033740,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\nTexas Barge and Boat\r\nTexas Barge and Boat Terminal\r\nFacility: 4115 East Floodgate Road\r\nFreeport, Texas 77541\r\n\r\nRisk Management Program Plan\r\nInitial Submission\r\n\r\nTexas Barge and Boat, Inc. (Texas Barge and Boat) operates a marine terminal that primarily cleans and degasses marine tank barges as well as blasting and coating of those barges.  During the degassing operations, many of the trace chemicals are burned up in a flare with propane fuel to ensure thorough burning. Texas Barge and Boat would like to increase the amount of propane kept on site to facilitate flare operation. U.S. Environmental Protection Agency (EPA) regulations presented in Title 40 Code of Federal Regulations Part 68 (40 CFR 68), the Chemical Accident Prevention Provisions, require Texas Barge and Boat to comply with the Risk Management Program (RMP) rule because the quantities of propane to be stored onsite exceed threshold quantities.\r\nThe RMP rule requires a facility to report the unit inventory for each RMP substance that exceeds threshold quantities, along with an EPA-approved chemical release prevention program. In addition, 40 CFR 68 requires all RMP   covered facilities to update its Risk Management Program Plan (RMP Plan) within (6) months of an RMP reportable incident or every five (5) years, whichever comes first.  In accordance with 40 CFR 68, Texas Barge and Boat is submitting this initial RMP Plan.\r\nPotential offsite consequences of hypothetical Worst-Case Scenarios (WCS) and Alternative Releases Scenarios (ARS) were conducted using the EPA RMP Guidance for Offsite Consequence Analysis.  Although numerous controls are in place to prevent chemical releases and manage such consequences should an incident occur, no credit for active mitigation measures was taken into account in evaluating the worst case and alternative release scenarios.\r\nAs required by the RMP regulations, worst-case and alternative release scenarios were generated for toxic releases of the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033740,
      "SummaryText": "shold (lbs)\r\nPropane\tPropane\t74-98-6\tToxic chemical\t10,000\r\n\r\nA complete copy of 40 CFR 68 is included in Attachment A for reference.\r\nAs will be described later in the OCA, this RMP Plan includes an evaluation of propane for toxic substances.\r\nII.\tPROGRAM 1, 2, AND 3 ELIGIBILITY REQUIREMENTS\r\nProgram 1 eligibility requirements apply to a process if no accidental release of a regulated substance has lead to death, injury, or deleterious effects to an environmental receptor, if the distance to a toxic or flammable endpoint for a worst-case release assessment is less than the distance to any public receptor, and if emergency response procedures have been coordinated between the source and the local emergency planning and response organizations.\r\nProgram 3 applies if the process does not meet the applicability requirements of Program 1 and if (1) the process is in a specific Standard Industrial Code category (see list of specific SIC codes in 40 CFR 68) and/or (2) the process is subject to the OSHA process safety management standard (29 CFR §1910.119).\r\nProgram 2 applies if the eligibility requirements of Program 1 and 3 are not met for a covered process.\r\nThe Texas Barge and Boat Terminal operations are subject to Program 1 requirements because of the following conditions.\r\n1.\tNo release of a regulated substance has lead to death, injury, or deleterious effects on an environmental receptor.\r\n2.\tThe flammable endpoint for a worst-case release assessment is less than distance to an environmental receptor\r\n3.\tThe NAICS code of the facility is 336611 Ship Building and Repairing.  This industrial designation is not specifically listed as being subject to Program 3 requirements in 40 CFR §68.10(d)(1) and because no process at the Texas Barge and Boat Terminal is subject to an OSHA PSM standard (29 CFR §1910.119).\r\nIII.\tDOCUMENT CONTROL AND AMENDMENTS\r\nThis section describes the document control requirements that must be followed so that the RMP Plan meets the EPA requirem"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000033740,
      "SummaryText": "lan is effective for the Texas Barge and Boat Terminal owned and operated by Texas Barge and Boat and located in Freeport, Harris County, Texas.  The Texas Barge and Boat Terminal is identified by EPA Facility I.D. No. 100000221226.  This Plan is prepared pursuant to the requirements of 40 CFR 68, which state that any facility that exceeds threshold quantities of a regulated toxic or flammable substance must prepare and implement a RMP Plan.  These threshold quantities are described and presented in 40 CFR 68, a copy of which is included in Attachment A.\r\n\r\nThis RMP plan describes the practices, methods, equipments, and procedures that are used at Texas Barge and Boat to prevent and control the releases of toxic and flammable substances, including those releases resulting from human operational error or equipment failures.  This document is intended to specifically address those materials defined as regulated chemicals per the applicable regulations listed in 40 CFR 68.\r\nV.\tDEVIATIONS\r\nThere are no deficiencies in this RMP Plan that will cause a deviation from the requirements in 40 CFR 68.\r\nVI.\tGENERAL INFORMATION\r\nThe Texas Barge and Boat Terminal consists of a marine terminal and associated drydocks located in Freeport, Texas.  This section provides information regarding the location and business activities for Texas Barge and Boat.\r\n\r\nDescription of the Plant Location\r\nThe Texas Barge and Boat Terminal is at the intersection of the Brazos River and the Intracoastal Waterway in Freeport, Harris County, Texas.  The terminal is bounded to the west by the Brazos River.\r\n\r\nDescription of Business Activities\r\nThe typical operations at Texas Barge and Boat are associated with marine vessel deheeling, degassing, and cleaning, and blasting and coating of these vessels.  In this section, discussion of the business activities for Texas Barge and Boat is provided.\r\nTexas Barge and Boat serves as a cleaning and refurbishing point for barges and ships from companies and termi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000033740,
      "SummaryText": "amendment actions and designated staff responsibility at the Texas Barge and Boat Terminal are described below.\r\n\r\n\r\nTable 2  Amendment Action and Staff Responsibility\r\nAmendment Action\tRMP Reporting Period \tStaff Responsibility\r\nReview and revision of the RMP Plan to update offsite consequence analysis.\tAt least every five (5) years\tHealth, Safety, Security, and Environmental (HSSE) Department\r\nThe plan is determined to be deficient during an incident or during a review.\tWithin forty-eight (48) hours following incident\tHSSE Department\r\nOperations changes its policies related to design, construction, operations, and/or management and procedures relative to the maintenance of this plan.\tBefore implementation and start-up of changes\tHSSE Department\r\nThe storage container/tank information (e.g., capacity, volume, distance) changes.\tBefore implementation and start-up of changes\tHSSE Department\r\nReportable accidents.\tWithin six (6) months of the date of the accident\tHSSE Department\r\nChanges in emergency contact information.\tWithin one (1) month of the change\tHSSE Department\r\nThe chemicals and/or the quantities of regulated chemicals loaded/unloaded, transferred or stored onsite changes.\tBefore start-up of changed process\tHSSE Department\r\nCompliance audit certification.\tAt least every three (3) years\tHSSE Department\r\nHazard review.\tAt least every five (5) years\tHSSE Department\r\nEmployee refresher training. \tAt least every three (3) years\tHSSE Department\r\n\r\n&#8195;\r\nTable 3  Document Distribution\r\nCopy No.\tRecipient\tPhysical Location\r\nOn-Site\r\n1\tHSSE Department\t4115 East Floodgate Road.\r\nFreeport, Texas 77541\r\nOff-Site\r\nn/a\t\t\r\n\r\nTable 4  Review and Revision History\r\nSubmission Type\tRevision Date\tEffective Date\tDescription\tApproved By\tDate\r\nOriginal Plan \t04/03/2013\t04/03/2013\tCurrent:  The RMP Plan is the initial submission.  A record of the dates of revisions is required to be maintained. \tDavid Collins, Construction Manager\t04/03/2013\r\n\r\n \r\nIV.\tSCOPE OF PLAN\r\nThis RMP P"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000033740,
      "SummaryText": "rmation is provided, and site-specific information for Texas Barge and Boat is presented.  At a minimum, all personnel handling the chemicals included in this RMP are trained in the operations and maintenance of equipment to prevent releases; release procedure protocols; applicable pollution control regulations; general facility operations; and the concepts embodied by this RMP Plan.  Additionally, release prevention briefings are scheduled and conducted for personnel at least once a year to assure adequate understanding of the concepts that form the components of the RMP Plan.  The release prevention briefings highlight and describe known discharges or failures, malfunctioning components, and any recently-developed precautionary measures.\r\nOperator Training\r\nOperators must demonstrate successful completion of the following release-related tasks:\r\na.\tOperation of Outfalls 02, 03 and B03,\r\nb.\tOperation of dike valves for release of rainwater,\r\nc.\tResponse to releases in drainage system, (settling pond, which discharges to the Brazos River) and,\r\nd.\tOperation of electric and diesel drainage pumps.\r\nSecurity and Site Access\r\nTexas Barge and Boat is protected by a 6-foot high chain-link fence topped by barbed wire on the land-side perimeter.  \r\nPersonnel and vehicles enter/exit through gates.  Entry/exit in those areas protected only by natural barriers is controlled in two ways:\r\n¿\tRoutine patrols by operating personnel or contract security guards.\r\n¿\tPosted signs reading Restricted Area\r\nAdequate lighting is provided at the facility to assist in the discovery and control of a release occurring during hours of darkness, both by operating personnel, if present, and by non-operating personnel (the general public, local police, etc.).  Adequate lighting is provided to prevent a release from occurring through acts of vandalism.\r\n\r\nAlternative Release Scenarios\r\nAlternative Release Scenarios (ARS) assess the potential hazards that are more realistic than worst-case scenar"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000033740,
      "SummaryText": "ios and are designed to assist in the development of emergency response plans.  EPA's RMP Guidance for OCA and RMP*Comp were used in evaluating the alternative release scenarios for propane.  The consequences of these scenarios were calculated using the RMP*Comp.  Although numerous controls are in place to prevent chemical releases and manage such consequences should an incident occur, no credit for active mitigation measures was taken into account in evaluating these scenarios. \r\nAlternative Release Scenario - Flammable Substance\r\nThe alternative release scenario of propane would occur if there were a vapor cloud fire caused by a punctured tank.  The amount of propane released from a 4 square inch puncture 1 foot below the liquid line is calculated as follows:\r\nQR=HA×6.82&#8730;(11.7/&#12310;DF&#12311;^2 ×LH+669/DF×P_g )\r\n\tWhere:\t\tQR =\tRelease Rate (lb/min)\r\n\t\t\tHA = \tHole or puncture area (square inches), estimated at 4 square inches\r\n\t\t\tDF = \tDensity factor, from RMP Guidance for OCA Appendix C\r\n\t\t\t\t0.83 for Propane\r\n\t\t\tLH = Height of liquid column above hole (inches), estimated at 12 inches\r\n\t\t\tPg =\tGauge pressure of the tank pressure (psig), 121 psig for propane\t\r\nQR=4×6.82&#8730;(11.7/&#12310;(0.83)&#12311;^2 ×12+669/0.83×121)\r\nQR=8528.34 lb/min\r\nUnder this scenario, 8,528.34 lbs of propane would be released per minute, and the entire contents of the tank would be released in just under two minutes.  RMP*Comp estimates the distance to the lower flammability limit would be approximately 0.1 miles.\r\n\r\n \r\nIX.\tFIVE-YEAR ACCIDENT HISTORY\r\nThe Texas Barge and Boat Terminal, in the past five (5) years, has not incurred any chemical releases that resulted in any known onsite or offsite deaths, injuries, significant damage, evacuations or sheltering in place, property damage, or environmental damage.\r\n\r\nX.\tACCIDENTAL RELEASE PREVENTION PLAN AND POLICIES\r\nThe plans for evacuation and accounting for personnel after an evacuation at the Texas Barge and Boat Terminal are lo"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000033740,
      "SummaryText": "nals in the United States as well as other countries.   Texas Barge and Boat has 3 dry docks, 2 barge cleaning spots equipped with blowers, and storage for deheeled product.  A wide variety of chemical products are handled at Texas Barge and Boat each year.  A complete list of those chemicals is available onsite in the MSDS Manuals.\r\nVII.\tEMERGENCY RESPONSE PROGRAM\r\nInformation in this section is presented for Texas Barge and Boat in accordance with 40 CFR §68.95.  This section provides information concerning procedures for informing the public, first-aid, and procedures for emergency response.  Greater detail regarding these topics is included in the site's Emergency Response Plan/SPCC) Plan.\r\nFirst Aid\r\nThe following information sources can be used to obtain information on chemicals and materials for first aid response.\r\na.\tMaterial Safety Data Sheets (MSDS)\r\nTexas Barge and Boat maintains MSDS that include response information for all chemicals within the facility.  Copies of the data sheets are to be readily available in designated places throughout the terminal.\r\nb.\tCHEMTREC (Chemical Transportation Emergency Center)\r\nThe CHEMTREC phone number is 800-424-9300.  CHEMTREC can be called for advice or assistance with any U.S. product.\r\nProcedures for Emergency Response\r\na.\tTexas Barge and Boat personnel and all plant departments have access to equipment at any time for use in responding to accidental release situations.  The equipment is readily available in the plant or from Texas Barge and Boat contractors for control and cleanup of releases.\r\nb.\tShould an emergency happen, the HSSE Coordinator will contact the Freeport Fire and Police Departments. \r\nc.\tWhen appropriate, the HSSE Coordinator will contact an environmental response company contracted with Texas Barge and Boat to provide support (e.g. Heritage Environmental).\r\n\r\nPersonnel Training\r\nPersonnel training differs on the control structures, devices, and practices utilized; therefore, general training info"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000033740,
      "SummaryText": "cated onsite for all personnel to review.  If a release occurs, arrangements are described in the Emergency Response Plan/SPCC Plan for notification of local emergency response agencies and the public.\r\nTexas Barge and Boat is committed to operate and maintain its facility in a safe and environmentally-friendly manner.  Texas Barge and Boat complies with the RMP rules and regulations set forth by the U.S. EPA and even some elements of OSHA's Process Safety Management Program to ensure the safety of employees and public surroundings.  Texas Barge and Boat incorporates elements addressing the following:\r\nEquipment Design - Vessels (including shipping containers) and other process equipment are designed according to recognized industry standards and/or governmental requirements.\r\nProcess Safety Information - Chemical hazard, process technology, and equipment information is documented, maintained up-to-date, and available to operating personnel.\r\nEpisodic Risk Management - Periodic reviews are conducted to identify hazards that could have significant community impact and to recommend corrective action(s) needed to prevent their occurrence.  These reviews utilize advanced quantitative risk assessment techniques.\r\nOperational Safety Standards - Design requirements for active and passive mitigation controls used to prevent major process hazards are documented in operational safety standards.\r\nOperating Procedures - Operating procedures provide detail on how to safely operate a process and are maintained up-to-date.\r\nOperator Training Program - The plant has a training and testing program, which provides operators with the proper skills and knowledge prior to allowing them to independently operate a process.\r\nTechnical Staff Training and Support - Trained technical staff employees are available 24 hours a day to support operations.\r\nMaintenance Procedures - The plant has specific procedures for maintaining process equipment so that it operates safely.\r\nMaintenance Training"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000033740,
      "SummaryText": "- The plant trains persons who perform routine maintenance tasks on process equipment.\r\nMechanical Integrity Program - Vessels (including shipping containers) and other process equipment are periodically tested and/or inspected to ensure safe operation of process equipment, following recognized industry standards and/or governmental requirements.\r\nIncident Investigation - The plant has a program to ensure that accidents and incidents are properly investigated to determine the cause(s) and to implement corrective action(s) that are needed to prevent the event from reoccurring.\r\nEmployee Participation - The plant has a program to involve employees in prevention program elements. \r\nCompliance Audits - Periodic corporate and plant-led audits are conducted to ensure that process operations comply with governmental and corporate requirements.\r\nOperational Safety Program - Oiltanking has a comprehensive program to ensure that all the elements listed above are implemented at every Oiltanking location. This program includes accountability for timely and proper implementation of the program elements.\r\nThese general prevention elements are parts of an overall management system to prevent accidental chemical releases.  Texas Barge and Boat and its employees are committed to the standards that these management systems set, and have specific accountability and controls to ensure that they are meeting their own high standards for accident prevention.\r\n\r\nXI.\tEMERGENCY RESPONSE PROGRAM\r\nTexas Barge and Boat maintains a written emergency response program to protect worker and public safety, as well as the environment.  The program consists of procedures for responding to releases of hazardous substances, including fire or explosion, and is updated when necessary based on modifications made to the facility.\r\nThe procedures address all aspects of emergency response including:\r\n¿\tProper first aid and medical treatment for exposures, including cardiopulmonary resuscitation (CPR).\r\n¿\tAppr"
    }
  ]
}