{
  "FacilityID": 1000083011,
  "FacilityName": "The Andersons- Arena Terminal",
  "FacilityStr1": "6755 Helena Road",
  "FacilityStr2": null,
  "FacilityCity": "Arena",
  "FacilityState": "WI",
  "FacilityZipCode": "53503",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55049",
  "LEPC": "Iowa County LEPC",
  "FacilityLatDecDegs": "43.17167",
  "FacilityLongDecDegs": "-89.9855",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.andersonsinc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 60438439,
  "ParentCompanyName": "The Andersons, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Andersons Inc",
  "OperatorStr1": "1947 Briarfield Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Maumee",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43537",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000207304",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-10-02 00:00:00",
  "SafetyInspectionBy": "AXI / Matrix Insurance Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-11-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-11-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-11-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-11-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R01",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000103721,
      "AltID": "Propane Distibution",
      "FacilityID": 1000083011,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000129843,
          "ProcessID": 1000103721,
          "ChemicalID": 98,
          "Quantity": 207955.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000105037,
          "ProcessID": 1000103721,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000087722,
              "Process_NAICS_ID": 1000105037,
              "SafetyReviewDate": "2019-10-23 00:00:00",
              "PHA_Date": "2019-10-23 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-12-31 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-10-23 00:00:00",
              "TrainingReviewDate": "2019-10-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-10-23 00:00:00",
              "EquipmentInspectionDate": "2019-10-23 00:00:00",
              "EquipmentTested": "Entire system prior to initial start-up.",
              "ChangeMgmtDate": "2019-10-23 00:00:00",
              "ChangeMgmtReviewDate": "2019-10-23 00:00:00",
              "PreStartupReviewDate": "2019-10-23 00:00:00",
              "ComplianceAuditDate": "2019-10-23 00:00:00",
              "AuditCompletionDate": "2019-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-10-23 00:00:00",
              "HotWorkPermitReviewDate": "2019-10-23 00:00:00",
              "ContractorSafetyReviewDate": "2019-10-23 00:00:00",
              "ContractorSafetyEvalDate": "2019-10-23 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000110559,
                  "PreventionProgram3ID": 1000087722,
                  "ProcessChemicalID": 1000129843
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000083011,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-10-23 00:00:00",
    "ERTrainingDate": "2019-10-23 00:00:00",
    "CoordinatingAgencyName": "IOWA LEPC",
    "CoordinatingAgencyPhone": "6089350329",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083011,
      "SummaryText": "Arena Propane RMP Executive Summary\n\n\n\nFacility and Product Description\n\n\n\nThe Andersons Arena Facility receives bulk shipments and re-loads distribution trucks with propane.  This facility implemented this process in the Fall of 2019.  The facility is situated in an agricultural setting and is located approximately 3 miles west of the town of Arena, Wisconsin, Arena Township, Iowa County.\n\n\n\nNearby Water Bodies:\n\n\n\nDrainage ditch ? mile to the South flows west to Wisconsin river 2.5 miles.\n\n\n\nSurrounding Occupancies to Land Use:\n\n\n\nNorth:  Farmland to 1 mile, Wisconsin River 1 ? miles\n\nSouth:  Drainage ditch ? mile, farmland to 1 mile, State Hwy 14 and residential to 1 mile\n\nEast:  Farmland to 1 mile, rural residential 1 mile to 1 1/4 miles\n\nWest:  Farmland to ? mile, rural residential ? mile to 1 mile\n\n\n\nRegulated Chemical:\n\n\n\nThe only RMP-regulated material at this facility is propane.  Propane is an extremely flammable colorless gas and can travel a considerable distance to a source of ignition and flash back to the leak.  It can displace oxygen in the air, causing suffocation.  Direct addition of water to liquefied propane gas will cause flash vaporization resulting in an explosion (either immediately or delayed) known as a \"boiling liquid, expanding vapor explosion (BLEVE)\".  Heat from fire can cause a rapid build-up of pressure inside cylinder tanks.  Explosive rupture and a sudden release of large amounts of gas may result.  This condition may cause the cylinder tanks to rocket.  Direct contact with the liquefied propane can chill or freeze the skin (frostbite).\n\n\n\nPropane is a liquid when stored under pressure inside the tanks.  Propane is a gas at ambient temperature and pressure.  Two 60,000 gallon tanks are used for bulk storage of propane.  The tanks are located on the south east side of the facility adjacent to the Wisconsin Southern Rail tracks including a railroad spur.  When filled to the maximum 85% capacity, each tank can hold 51,000 gallons of li"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083011,
      "SummaryText": "quefied propane.  To fill the tanks, propane rail cars are offloaded via loading stations 7 and 8 from the rail cars and into the large storage tanks.  Distribution of the propane utilizes external trucking companies which have 24/7 access to the system.  Facility employees are only present during scheduled work hours.\n\n\n\nSummary of Major Hazards\n\n\n\nThe principal causes of propane emergencies are ruptured hoses and defective valves, as indicated by the alternative release scenario.  The most probable time for a release to occur will be during a transfer from a delivery rail car to the bulk storage tanks or a transfer from the bulk storage tanks to the delivery trucks.  Flexible hoses and fixed piping must be inspected, maintained, and connected properly to control releases of propane.  Hoses are date-stamped and replaced in advance of the expiration date or when defects are observed.  All bulk storage tank loading transfers of propane are observed by facility personnel.  Facility employees only observe transfers from the bulk storage tanks to delivery trucks during scheduled work hours.\n\n\n\nWith elevated temperatures that occur during mid-to-late summer, the propane inside the bulk storage tank can expand, and possibly cause one or more relief valves to open to reduce the pressure inside the tank.  The relief valve will re-seal itself when pressure is relieved.  These events are very short in duration a few seconds at the most.\n\n\n\nA complete failure or burst tank, as indicated by the worst-case scenario, is highly unlikely.  The propane tanks were built under strict guidelines established in the ASME and other appropriate pressure vessel code.  All welding and structural work done on the tank and the associated piping system was performed by certified welders.\n\n\n\nExplanation of How Hazard Releases are Prevented\n\n\n\nIf a rail car were to move or pull away before being properly disconnected  the following protection is in place:\n\n\n\n1.    Each rail-car has 3 Emergency Shuto"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083011,
      "SummaryText": "ff Valves (ESVs) (2 liquid and 1 vapor) that will control the flow of propane liquid and vapor at the rail-car. In an emergency, the pneumatically controlled rail-car ESVs can be employed to the \"closed\" position by activating any of the 3  Emergency Shutoff Stations located throughout the facility or by manually disconnecting the air chucks at the ESVs.\n\n\n\n2.    Each of the 3 rail arms have shutdown protection. The 2 liquid arms employ a back check valve and the vapor arm employs an ESV.\n\n\n\n3.    Activation of any of the three (3)  Emergency Shutdown Stations located at the  north wall of the equipment enclosure building and at each rail tower.  areas. \n\n\n\nExcess flow valves are located on all outgoing liquid and vapor valves on the storage tank.  They close automatically if the volume of gas or liquid flowing through the line exceeds the normal flow rate.  They will not reopen until the downstream shutoff valve is closed and the pressure equalizes on both sides of the valve seat.  Principal causes of the excess valve closing are a ruptured hose, a broken pipe, or shutoff valve downstream that is opened too quickly.\n\n\n\nIn the event of a truck pull-away the following protection is in place:\n\n\n\n1.    The disconnection of the SCULLY grounding cable will shut down the meter skid. (Control valve and pumps)\n\n\n\n2.    The truck loading bulkhead hose couplings have cables attached to the meter skid ESV which will close the flow of propane. \n\n\n\n3.    A back check valve is located in the liquid return line on the truck loading skid and prevents flow of propane back into the truck or proving vehicle.   This prevents propane from flowing to the truck from the storage tank. \n\n\n\n4.    Activation of any of the three (3)  Emergency Shutdown Stations located at the , north wall of the equipment enclosure building and at each rail tower. \n\n\n\n\n\nPressure relief valves are located on the top of the bulk storage tanks and hydrostatic relief valves are installed in the fixed steel piping to relieve pressur"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000083011,
      "SummaryText": " being considered for hire.\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000083011,
      "SummaryText": "e that is too great.  This can be caused by elevated temperatures in the summer or overfilling.  The tank pressure reliefs open and vent directly to the atmosphere at 250 psig and close when the pressure inside the tank drops below this pressure. The hydrostatic relief valves open and vent directly to atmosphere at 460 psi and are installed between shutoff valves in liquid piping.\n\n\n\nThree (3)  Emergency shut-off stations  are located within the terminal. Activation of any / all of these emergency shutdown stations will shut down all pneumatically operated internal valves and ESVs within the facility regardless of the operation(s) being performed.   This stops the flow of propane by remote activation of the terminal pneumatic system which is regulated by an air compressor located in the equipment enclosure (drivers building).  \n\n\n\nOther safety items and actions include the following.  Wind sock is located on the south east corner of the propane tanks on a pole.  Third party security monitoring system provides motion detection after hours.  Facility personnel and / or truck drivers supervise all propane to and from the bulk storage tanks.\n\n\n\nPrevention Program\n\n\n\nPreventive maintenance (PM) is an integral piece of this hazard management program.  All hoses, tanks, valves and piping are inspected at least monthly and documented using a PM database.  All hose and valve replacements are documented in the PM database.  Records of major maintenance tasks performed on the tank or related equipment are saved in the PM database.\n\n \n\nTraining\n\n\n\nEmployees receive training on propane safety, the Emergency Action Plan (EAP), and Hazard Communication Program.  Documentation and attendance rosters are on file at the facility.  Training is performed with all employees annually and within 90 days of employment.\n\n\n\nContractors\n\n\n\nPrior to performing work contractors are pre-screened and evaluated, and if approved, receive a contractor safety review prior to performing work at the fa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000083011,
      "SummaryText": "cility.  During this review, they are informed of any potential hazards at the facility, emergency procedures, site-specific safety rules, and the ability to request an SDS for any product at any time.\n\n\n\nSteps Taken to Address Hazards\n\n\n\nThe Arena Facility has systems in place for hazard assessment and mitigation.  The Corporate Safety Department performs hazard management audits at the facility.  The audits include a physical walk through of the entire facility and a review of all EPA / OSHA / DOT paperwork and training documentation.  Action items are noted and recommendations are made.  The audits consist of five major topical areas:  Safety & Health, Environmental, Fire Protection & Security, Administrative and Housekeeping & Storage. Issues are documented in a report and sent to the facility manager and upper management.  Updates on implementation of corrective actions, including the status to closure, must be made regularly.\n\n\n\nFormal investigations are performed for all environmental or safety incidents.  Documentation is kept on file at the facility and the Corporate Safety Department.\n\n\n\nFacility safety training / meetings allow employees to discuss any concerns they may have with the operation of the facility.  Issues are documented and assigned to employees for follow-up.  Records of all meetings are kept at the facility.\n\n\n\nResponse Action in the Event of a Release\n\n\n\nIn the event of a burst hose or defective valve, employees are instructed to shut down the transfer process by activating one of the four Emergency Shutdown Stations which are located at the truck loading skid, equipment enclosure building, rail tower and compressor station areas.  If possible, employees should approach the shutoff valve from upwind when attempting to turn it off.\n\n\n\nFor an uncontainable release, employees will immediately call the police and fire department or other first responders, as appropriate.  All employees, customers and contractors are to be evacuated to an upwin"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000083011,
      "SummaryText": "d location.  Once the response team has arrived, the facility will work in concert with them to close the valves between the tank and the leak.  \n\n\n\nThe facility employees are instructed to make emergency phone calls in this order:  911, the facility manager, the Corporate Safety Department and Group Safety emergency phone numbers, the appropriate Federal and State of Wisconsin agencies.  All applicable contact names and numbers are found in the both the facility Spill Control and Emergency Response Plans.  Emergency phone numbers are posted outside the office.\n\n\n\nCommunication Procedures with Emergency Responders\n\n\n\nFacility management, employees, and fire department personnel jointly discuss the location of the propane and response procedures on a regular basis.  Responders are informed of the locations of all emergency shutoff valves and on-site response equipment.\n\n\n\nThe Fire Department, LEPC, and State Regulatory Agencies receive a copy of the hazardous materials storage information, annually, in accordance with community right to know obligations.  A copy of the Arena Facility's EAP is on file with the Local Fire Department.\n\n\n\nThe Five-Year Accident History\n\n\n\nThe Arena facility has not had a propane release in the last five years.\n\n\n\nSecurity Plan\n\n\n\nFacilities that offer or transport hazardous materials are required to document a security plan and perform employee awareness training.  A security assessment plan has been created to describe all security measures at this facility, identify any vulnerable areas, and then document the measures taken to address those risks.  The plan is intended to work in conjunction with the EAP and Spill Control Plan to meet all required criteria.\n\n\n\nAll potential employee candidates are interviewed prior to hiring.  Candidates with a CDL receive additional previous employment verification and a record is kept in their Driver Qualification file.  References may be verified depending on the level of familiarity with the person"
    }
  ]
}