{
  "FacilityID": 1000008857,
  "FacilityName": "Burton Creek Wastewater Treatment Plant",
  "FacilityStr1": "300 Park Road",
  "FacilityStr2": null,
  "FacilityCity": "Bryan",
  "FacilityState": "TX",
  "FacilityZipCode": "77805",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48041",
  "LEPC": "Bryan Fire Department/EMC",
  "FacilityLatDecDegs": "30.640556",
  "FacilityLongDecDegs": "-096.320833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.bryantx.gov",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Bryan, Texas",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Bryan, Texas",
  "OperatorStr1": "PO Box 1000",
  "OperatorStr2": null,
  "OperatorCity": "City of Bryan",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77805",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": "TX0022616",
  "EPAFacilityID": "100000060649",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Brazos County EMC",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-08-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.64072,
  "FRS_Long": -96.32241,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010324,
      "AltID": "Effluent Disinfection",
      "FacilityID": 1000008857,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011771,
          "ProcessID": 1000010324,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000011772,
          "ProcessID": 1000010324,
          "ChemicalID": 49,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000010666,
          "ProcessID": 1000010324,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000007823,
              "Process_NAICS_ID": 1000010666,
              "SafetyReviewDate": "2013-02-15 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2009-06-10 00:00:00",
              "ChangeCompletionDate": "2009-12-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-02-15 00:00:00",
              "TrainingReviewDate": "2010-10-21 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-02-15 00:00:00",
              "EquipmentInspectionDate": "2013-02-11 00:00:00",
              "EquipmentTested": "Ton cylinders, flexible tubing connections, vaccum regulators, gas filters, supply headers, Chlorinators, Sulfonators, leak detectors, alarms",
              "ComplianceAuditDate": "2013-01-10 00:00:00",
              "AuditCompletionDate": "2013-02-13 00:00:00",
              "IncidentInvestigationDate": "2005-05-31 00:00:00",
              "InvestigationChangeDate": "2005-06-15 00:00:00",
              "MostRecentChangeDate": "2013-01-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000008030,
                  "PreventionProgram2ID": 1000007823,
                  "ProcessChemicalID": 1000011771
                },
                {
                  "PrimaryKey": 1000008031,
                  "PreventionProgram2ID": 1000007823,
                  "ProcessChemicalID": 1000011772
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000008857,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-11-01 00:00:00",
    "ERTrainingDate": "2011-04-08 00:00:00",
    "CoordinatingAgencyName": "City of Bryan Fire Department/ EMC",
    "CoordinatingAgencyPhone": "9795956251",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008857,
      "SummaryText": "Executive Summary\r\nThis document was developed to comply with the Environmental Protection Agency's (EPA's) Risk Management Program (RMP) II, under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 CFR Part 68. An outline of the RMP is provided in Figure ES-1.  Processes covered under this regulation at the Burton Creek WWTP include chlorine and sulfur dioxide systems. \r\n\r\nHAZARD ASSESSMENT\r\n\tWorst-Case Scenarios\r\n\tAlternative Release Scenarios\r\n\t5-year Accident History\r\nMANAGEMENT PROGRAM\r\n\tDocument Management System\r\nPREVENTION PROGRAM\r\n\tSafety Information\r\n\tHazard Review\r\n\tOperating Procedures\r\n\tTraining\r\n\tMaintenance\r\n\tIncident Investigation\r\n\tCompliance Audit\r\nEMERGENCY RESPONSE PROGRAM\r\nRISK MANAGEMENT PLAN\r\nFIGURE ES-1 OUTLINE OF RISK MANAGEMENT PROGRAM \r\nTo meet the regulation requirements, this binder contains useful information on the chlorine and sulfur dioxide systems. The technical information herein may be used as a training reference in initial and recurring operator and maintenance training. Training on process fundamentals, operations, and maintenance, coupled with the recommended process modifications discussed below, will reduce the potential hazards to plant personnel and the surrounding community.\r\nAn Emergency Response Program and an Incident Investigation Program are included. These two programs should be an integral part of both initial and recurring training.\r\nA Risk Management Plan (Plan), as required by the EPA, is included at the end of the main body of this document. It consists of a summary of data elements that must be submitted to the EPA which will eventually be uploaded onto a public access data base. The Plan has an Executive Summary that follows a required EPA format, and is intended to inform the public of Burton Creek WWTP's proactive stance toward protection of the environment and the surrounding community.\r\nHazard Assessment\r\nThe Hazard Assessment is comprised of a Worst Case and Alternative Release Scenario ea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008857,
      "SummaryText": "ch for the chlorine and sulfur dioxide systems, as well as a 5-Year Accident History for the same. The Hazard Assessment was conducted as an initial screening procedure as part of determining into which Program Level (I, II, or III) the Burton Creek WWTP falls. Residences lie within the EPA-defined endpoint concentrations of Burton Creek's Worst-Case releases. Therefore, the plant is ineligible for Program I. Because Texas public utilities are currently excluded from Program III, Burton Creek is included in Risk Management Program II.  The Hazard Assessment is provided in Chapters 1 through 3.\r\nWorst Case Scenarios\r\nThe Worst Case Scenarios were defined as a ton cylinder (2,000 pounds) of chlorine or sulfur dioxide, each being released by a catastrophic event within 10 minute duration. Mitigation factors of 0.55 were allowed for these processes due to the roofs and walls covering each storage area. These scenarios were developed and modeled using the EPA approved dense gas dispersion model RMP Comp 2.01. The toxic 3 mg/l (ppm) endpoints for both chlorine and sulfur dioxide were determined to be 1.30 miles.\r\nAlternative Release Scenarios\r\nThe Alternative Releases Scenarios of chlorine and sulfur dioxide were also modeled using RMP Comp 2.01. Source term estimations of approximately 175 pounds of either chlorine or sulfur dioxide gas released were derived from a scenario of a flexible connection failure. The dispersion model estimated the 3 ppm chlorine and sulfur dioxide endpoints to extend 0.10 miles.\r\n5 Year Accident History\r\nLast record of incident was February 4, 2010.\r\nManagement Program\r\nThe Management Program consists of the Document Management System described below.\r\nDocument Management System\r\nA Document Management System was established to attribute responsibility for the development, implementation, and maintenance of the Risk Management Program. The Program must be updated every three years, or any time a covered process undergoes a physical or administr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008857,
      "SummaryText": "ative modification.  The Document Management System is largely a function of the Risk Management Program Team, described below in Table ES-2.\r\n\r\nRisk Management Program Team\r\nThe following members are responsible for the Risk Management Program development, implementation, and maintenance. The Public Works Director has the ultimate responsibility.\r\nTable ES-2  Burton Creek WWTP Risk Management Program Team\r\n\r\nPosition /Expertise\r\nPublic Works Director\r\nTreatment & Compliance Manager\r\nProduction & Field Operations Manager\r\nMaintenance Supervisor\r\nChief Plant Operator\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPrevention Program\r\nThe Prevention Program is more appropriately entitled the Accidental Release Prevention Program.  It is comprised of Safety Information, Hazard Review, Operating Procedures, Training, Maintenance, Incident Investigation, and \tCompliance Audit procedures.  Each has an entire chapter devoted to it in this RMP, and is described in more detail below.\r\nSafety Information\r\nSafety Information is divided between Chemical Safety Information, and Process Safety Information.  Each is described below.\r\nChemical Safety Information\r\nComprehensive chemical data is provided in this section to include regulatory reporting and action thresholds, health hazard and chemical exposure limitations, as well as detailed physical properties of each regulated substance. This information was compiled from numerous sources, and is intended to be a one-stop source for the reader seeking data on these substances. The physical data will provide useful information in the inevitable event the plant processes are modified, thereby requiring revisited dense gas dispersion modeling.\r\nProcess Safety Information\r\nProcess Safety Information was meticulously compiled on each system studied. Specifications on each process are collocated in one place for easy reference. Details such as Maximum Intended Inventory, Safe Upper and Lower Temperatures, Safe Upper and Lower Pressures, and Codes and Standards"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008857,
      "SummaryText": "Used to Design, Build and Operate the Process are provided in this section. Used as a training reference, together with the Process Schematics located in the Appendix, the reader will readily understand the function and operation of these plant systems.\r\nHazard Review\r\nA Hazard Review was conducted for each regulated process. The team consisted of plant management, process operating and maintenance experts, outside process design engineers, and consultants knowledgeable in the Hazard Review process itself. The Hazard Review technique used was a hybrid Hazard and Operability Study (HAZOP), in the form of a \"what if\" analysis. The \"what if\" was developed from HAZOP experience at similar wastewater treatment processes.\r\nRecommendations\r\nThe result of the Hazard Review is a set of recommendations for the Plant to implement. The Rule under 40 CFR 68.50 requires the City of Bryan to ensure that problems identified are \"resolved in a timely manner.\"  For those items that can not be promptly resolved, it is recommended that a schedule be developed that addresses those issues, with personnel responsibility assigned for each.  \r\nPlease note that these are not the recommendations of Camp Dresser & McKee Inc.  Rather, they are Plant recommendations developed by the Hazard Review Team with a consensus from all team members.  CDM's role was simply to facilitate the Hazard Review process. \r\nOne of the most significant recommendations to be generated by the Hazard Review was to investigate scrubbing and emergency containment alternatives for accidental releases of chlorine or sulfur dioxide.  This should be investigated as a separate scope of engineering work.\r\nOperating Procedures\r\nOperating Procedures have been developed for the Burton Creek WWTP. They provide system descriptions, specifications, and operating procedures for the chlorine and sulfur dioxide gas systems. Procedures include Start, Shutdown, Normal, Abnormal, and Emergency Operation. Also included are Troubleshootin"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000008857,
      "SummaryText": "g Procedures.\r\nTraining \r\nTraining is required by EPA to be included in the Risk Management Program. A program has been developed with guidelines on how to conduct regular and structured plant training. Training Record Forms are included with the Program for the required training documentation. Additionally, a Training Record has been compiled and included for all affected personnel associated with the covered processes.\r\nMaintenance\r\nA Maintenance Program has been developed with associated documentation forms. Sound preventive maintenance will reduce potential hazards to personnel onsite, and to the off-site public. State and federal regulators will most surely expect to see documentation and recordkeeping associated with the Maintenance Program. \r\nIncident Investigation\r\nAn Incident Investigation Program has been developed. The EPA has established strict guidelines to follow in the aftermath of any release involving either the chlorine or sulfur dioxide system. The Incident Investigation Program outlines key milestones that must be accomplished within 24 hours of any covered incident, and the actions that must occur subsequently. Ultimately, it is desired that the plant learn from the incident and take action to prevent similar incidents in the future. Incident Investigation Report Forms are included, and must be maintained for a minimum of five years after each incident.\r\nCompliance Audits\r\nInternal Compliance Audits must be conducted every three years to verify compliance with the programs and procedures contained in this document. The Plant Manager must certify that the Risk Management Program team has evaluated compliance with the provisions of the Program, and verify that the procedures and practices are adequate and are being followed. Audit Report Forms are provided, the two most recent of which must always be maintained. This means that in the year 2010, the Compliance Audit Report for the year 2004 may be discarded.\r\nEmergency Response Program\r\nThe Emerge"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000008857,
      "SummaryText": "ncy Response Program is included as part of the Risk Management Program, in case a significant release ever occurs. As in all the above programs, it is important to review this program regularly. The RMP Rule, 40 CFR 68.95 requires training for all employees \"in relevant procedures\" of the Emergency Response Program.\r\nIt is recommended that training on the specific plant procedures take place upon initial employment and every three years thereafter, as with most of the other RMP training programs.  Other training recommendations, i.e., OSHA 8, 24, and 40 hour training are discussed in the Emergency Response Program as appropriate to the level of response.\r\nRisk Management Plan\r\nA copy of the Risk Management Plan is provided. As stated previously, this document is public information. Its purpose is submission to the EPA to be uploaded on a public-access database. No other portion of the Burton Creek WWTP Risk Management Program must be made available to the public. \r\nSummary of Action Items for the City of Bryan\r\nThe RMP Rule, 40 CFR 68.42 requires that details of all accidental releases be recorded from this date forward.  The format details are provided in Chapter 3.\r\nThe RMP Rule, 40 CFR 68.15 requires that the Document Management System (e.g., the RMP Team) be updated anytime personnel changes or administrative changes are made that would affect the lines of authority or responsibility for maintaining the RMP at the Burton Creek WWTP. The format details are provided in Chapter 4.\r\nThe RMP Rule, 40 CFR 68.54 requires that each employee presently operating a process, and each employee newly assigned to a covered process be trained or tested competent in the operating procedures.  CDM facilitated the development of operating procedures for the Burton Creek WWTP, and they are provided in Chapters 7 through 8 of this RMP Manual.  As an alternative, the City of Bryan may certify in writing that the employee has the required knowledge, skills, and abilities to safely ca"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000008857,
      "SummaryText": "rry out the duties and responsibilities as provided in the operating procedures.  Training documentation forms are provided in Chapter 9.\r\nThe RMP Rule, 40 CFR 68.56 requires training on the plant maintenance procedures provided in Chapter 10.  The City of Bryan must train or cause to be trained each employee involved in maintaining the on-going mechanical integrity of the process.  To ensure that the employee can perform the job tasks in a safe manner, each such employee must be trained in the hazards of the process, in how to avoid or correct unsafe conditions, and in the procedures applicable to the employee's job tasks. Training documentation forms are provided in Chapter 9.\r\nAll maintenance contractors must ensure that each contract maintenance employee is trained to perform any applicable maintenance procedures (provided in each RMP document). Training documentation forms are provided in Chapter 9.\r\nRefresher training on operating and maintenance procedures must be provided every three years. Training documentation forms are provided in Chapter 9.\r\nThe RMP Rule, 40 CFR 68.60 requires incident investigations not later than 48 hours following each incident. That guidance is provided in Chapter 11.\r\nThe RMP Rule, 40 CFR 68.58 requires the City of Bryan to certify compliance with RMP Accident Prevention Program provisions at least every three years to verify that the procedures and practices developed under the rule are adequate and are being followed.  That guidance, along with Compliance Audit forms, is provided in Chapter 12.\r\nThe RMP Rule, 40 CFR 68.95 requires training for all employees \"in relevant procedures\" of the Emergency Response Program.  It is recommended that training on the specific plant procedures take place upon initial employment and every three years thereafter, as with most of the other RMP training programs.  Other training recommendations, i.e., OSHA 8, 24, and 40 hour training are discussed in the Emergency Response Program as appropriate"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000008857,
      "SummaryText": "to the level of response. The Emergency Response Program is discussed in Chapter 13. Training documentation forms are provided in Chapter 9.\r\nThe City of Bryan is submitting updates to the existing Risk Management Plan (Plan) to USEPA to comply with RMP Rule by June 22, 2009 which will be valid from the year 2009 through 2014.  The Plan is a summary of the Program, and is located in Chapter 14. The Plan is submitted electronically using EPA's RMP eSubmit software."
    }
  ]
}