{
  "FacilityID": 1000015023,
  "FacilityName": "The City of Mercedes Sewage Treatment Plant",
  "FacilityStr1": "8 Mile North",
  "FacilityStr2": null,
  "FacilityCity": "Mercedes",
  "FacilityState": "TX",
  "FacilityZipCode": "78570",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48215",
  "LEPC": "Hidalgo County LEPC",
  "FacilityLatDecDegs": "26.166667",
  "FacilityLongDecDegs": "-097.966667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 50147297,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Operations Management Int'l, Inc.",
  "OperatorStr1": "P.O. Box 327",
  "OperatorStr2": null,
  "OperatorCity": "Mercedes",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78570",
  "OperatorZipCodeExt": null,
  "RMPContact": "Marcelo Cosme",
  "RMPTitle": "Project Manager I",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000164216",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-08-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-06-08 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-12-19 00:00:00",
  "DeRegistrationEffectiveDate": "2011-09-11 00:00:00",
  "AnniversaryDate": "2016-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 26.17056,
  "FRS_Long": -97.90278,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018914,
      "AltID": "Chlorination",
      "FacilityID": 1000015023,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000019257,
          "ProcessID": 1000018914,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000022501,
          "ProcessID": 1000018914,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000522501,
          "ProcessID": 1000018914,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000015023,
      "SummaryText": "The owner or operator shall provide in the RMP an executive summary that includes a brief description of the following elements: (a) The accidental release prevention and emergency response policies at the stationary source; (b) The stationary source and regulated substances handled; (c) The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario; (d) The general accidental release prevention program and chemical-specific prevention steps; (e) The five-year accident history; (f) The emergency response program; and (g) Planned changes to improve safety.\n\nThe City of Mercedes Wastewater Treatment Plant (WWTP) is a municipal wastewater treatment facility designed to provide treatment of incoming wastewater and septate. It receives and treats wastewater from the city of Mercedes in Hidalgo County, Texas.  Located in the eastern portion of Hidalgo County, Mercedes is approximately six (6) miles north of the U.S./Mexico international border and located off of Expressway 83 between La Feria and Weslaco.  \n\nThe Mercedes Wastewater Treatment Plant utilizes chlorine as a critical component of the treatment process. As a result of the minimum amount of chlorine housed at the facility, the Mercedes WWTP is subject to Risk Management Plan (RMP) requirements of the Environmental Protection Agency for Prevention Program 3 [40 CFR 68] and the Process Safety Management (PSM) requirements of the Occupational Safety and Health Administration [29 CFR 1910.119].     \n\nRMP regulations for Program 3 processes require the performance of a consequence analysis for one worst-case release scenario estimated to create the greatest distance in any direction to a toxic endpoint. The selected worst-case release scenario involved the complete loss of 4,000 pounds of chlorine to the air. The 4,000 pounds worst-case release quantity represents the greatest quantity stored at th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000015023,
      "SummaryText": "e City of Mercedes Wastewater Treatment Plant (WWTP) at any given time. \n\nFederal air dispersion modeling software (RMP*Comp32) was used to determine the maximum distance of a potential release.  The RMP*Comp32 results indicate that the maximum distance needed for the concentration of chlorine to reach the toxic endpoint (0.0087 mg/L) as a result of a 10-minute release of 4,000 pounds of chlorine is 1.3 miles. The total potentially affected population within a radius of 1.3 miles of the WWTP is 3,533 persons as given by the LandView Population Census Estimator.\n\nOne alternative scenario was selected for the offsite consequence analysis, in which failure results in the release of the 4,000 pounds of chlorine over a period of 30 minutes. This is equivalent to a release rate of 133 pounds of chlorine per minute. The RMP*Comp32 dispersion modeling results indicate that 0.2 miles is the maximum distance for the concentration of chlorine to reach the toxic endpoint (0.0087 mg/L) as a result of a 30 minute release of 133 pounds of chlorine per minute. The total potentially affected population within a radius of 0.2 miles is 65 persons as given by the LandView Population Census Estimator.\n\nA search of U.S. Geological Survey and Google maps did not identify any offsite impacts of environmental receptors within the endpoint. Environmental receptors include natural areas such as national or state parks, forests, or monuments officially designated wildlife sanctuaries, preserves, refuges, and federal wilderness areas.\n\nNo accidental chlorine releases have occurred at this facility. \n\nThe City of Mercedes WWTP Accidental Release Prevention Policy involves an approach that integrates technologies, procedures, and management practices in compliance with all applicable EPA Prevention Program 3 requirements and OSHA Process Safety Management requirements. \n\nChemical-specific prevention steps include availability of Self-Contained-Breathing-Apparatuses (SCBA) and staff awareness of t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000015023,
      "SummaryText": "he hazardous and toxic properties of chlorine. Mercedes WWTP personnel employed the Hazard and Operability Study (HAZOP) technique to conduct a Process Hazard Analysis. Employees discussed each question and recorded their answers. After answering the questions, they discussed the adequacy of the existing safeguards and recommendations for additional safeguards. The staff finished the Process Hazard Analysis with an equipment inspection. All equipment was inspected during the Process Hazard Analysis. The Process Hazard Analysis will be updated at least once every five years.  \n\nThe City of Mercedes WWTP ensures that each employee presently operating the process, and each employee newly assigned to these processes have been trained or tested successfully in the operating procedures listed above that pertain to their duties. Annual refresher training provided to each employee operating the wastewater treatment process ensures that the employee understands and adheres to the current operation procedures of the process. \n\nThe Mercedes WWTP emergency procedures address potential emergencies that can reasonably be expected to occur at the facility. The emergency response procedures consider dangers within the facility that may affect employees as well as dangers outside of the facility that may affect the public or the environment. These procedures comply with EPA Risk Management Plan and OSHA Process Safety Management requirements set forth in 40 CFR 68 and 29 CFR 1910.119. \n\nThe Mercedes WWTP is the first responder. Employees are trained in response techniques and notification of other first responders in the event of accidental chlorine releases. An emergency response plan is kept on-site where all employees have access to it.\n\nThe Mercedes WWTP posts escape plans within the facility where any person entering can see them; facility personnel receive training in escape procedures. \n"
    }
  ]
}