{
  "FacilityID": 1000043779,
  "FacilityName": "Chemical Unloading Facility",
  "FacilityStr1": "19765 Patterson Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Perris",
  "FacilityState": "CA",
  "FacilityZipCode": "92570",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.833972",
  "FacilityLongDecDegs": "-117.254806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.mwdh2o.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Metropolitan Water District of So. California",
  "Company2Name": null,
  "CompanyDUNS": 63842975,
  "Company2DUNS": null,
  "OperatorName": "MWD of Southern California",
  "OperatorStr1": "700 North Alameda Street",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90012",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": "CAL000034541",
  "EPAFacilityID": "100000126927",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-12-18 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.833972,
  "FRS_Long": -117.254806,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054091,
      "AltID": "Chlorination System",
      "FacilityID": 1000043779,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065850,
          "ProcessID": 1000054091,
          "ChemicalID": 62,
          "Quantity": 504000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000054880,
          "ProcessID": 1000054091,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000045376,
              "Process_NAICS_ID": 1000054880,
              "SafetyReviewDate": "2014-06-02 00:00:00",
              "PHA_Date": "2014-12-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-05-06 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Remote shutoff capability",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Video Cameras",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-11-30 00:00:00",
              "TrainingReviewDate": "2013-11-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Manufacturer O&M Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-11-30 00:00:00",
              "EquipmentInspectionDate": "2014-06-02 00:00:00",
              "EquipmentTested": "Evaporator",
              "ChangeMgmtDate": "2013-12-12 00:00:00",
              "ChangeMgmtReviewDate": "2013-06-04 00:00:00",
              "PreStartupReviewDate": "2007-08-07 00:00:00",
              "ComplianceAuditDate": "2011-07-19 00:00:00",
              "AuditCompletionDate": "2013-12-13 00:00:00",
              "IncidentInvestigationDate": "2009-04-06 00:00:00",
              "InvestigationChangeDate": "2009-04-06 00:00:00",
              "ParticipationPlansReviewDate": "2014-05-30 00:00:00",
              "HotWorkPermitReviewDate": "2014-05-30 00:00:00",
              "ContractorSafetyReviewDate": "2014-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2014-05-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000054761,
                  "PreventionProgram3ID": 1000045376,
                  "ProcessChemicalID": 1000065850
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043779,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Riverside Co. Fire Dept.,Station 34",
    "CoordinatingAgencyPhone": "9519266430",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Cal/ARP-T19, Div. 2, Chp 4.5 and Cal/OSHA T8, 5189 PSM Standard"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000043779,
      "SummaryText": "ipment inspection requirements, and operating procedures for the CUF system.  The operating procedures include connection/disconnection of railcars and cargo tanks, start-up and shutdown for chlorine evaporators, after maintenance start-up for chlorine evaporators, maintenance shutdown for chlorine evaporators, start-up and shutdown for ejectors, start-up and shutdown for chlorinators, chlorine system emergency shutdown, start-up following an emergency shutdown, and temporary operations.  Also included are the maintenance and troubleshooting procedures, including consequences of deviation and the steps to correct or avoid deviations. CUF updates procedures annually or whenever a change occurs that alters the steps needed to operate safely.  Updated operating procedures will be developed and put in place prior to any new process equipment coming on line or changes made in the handling of chlorine equipment, and reconfiguration of the facilities.\r\n\r\nTraining \r\n\r\nCUF employees presently involved in operating or maintaining the cargo tank filling process are trained in an overview of the process and detailed applicable operating and maintenance procedures.  CUF ensures that each employee newly assigned to the process is trained and tested to be competent in the operating procedures listed pertaining to their duties.  The CUF training program includes four elements: (1) initial training and awareness training, (2) refresher training, (3) documentation, and (4) and testing.  Each employee presently involved in operating the cargo tank filling process has been trained to receive the required knowledge, skills, and abilities to safely carry out the duties and responsibilities, including chlorine leak response, as provided in the operating procedures.  \r\n\r\nRefresher training is provided every three years or less to each employee operating the covered process to ensure that the employee understands and adheres to the current operating procedures.  In addition, CUF ensures tha"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043779,
      "SummaryText": "Transfer Building is located approximately 100 feet west of the Main Office Building.  Empty and full chlorine cargo tanks, are stored in a paved storage area west of the Transfer Building.  In addition, a chlorine rail car may be occasionally located in an area, immediately east of the Transfer Building.  The evaporators and the chlorinators are located in the Control Building No. 3 adjacent to the Transfer Building. The maximum quantity of chlorine present at the CUF at any given time may be more than the listed threshold quantities in the RMPR and CalARP rules.  It is also more than the listed threshold quantities in the federal and California Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standards.  \r\n\r\nChlorine leak sensors are provided in the rail car and cargo tank storage areas, outside the Office Building, inside Control Building No. 3 and inside the chlorine vent box.  In addition, each rail car and chlorine cargo tank angle valve, which is connected during the unloading process, is provided with a pneumatic emergency shutoff system, which may be activated manually or automatically.  In case of a major chlorine leak, the chlorine supply in the rail car or chlorine cargo tank will be stopped automatically if any fixed chlorine detector exceeds 3 ppm or by manually closing the shutoff system at the unloading platform or remotely, at the east and west sides of the Transfer Building, in Control Building No. 3, and in the Main Office. \r\n\r\nThe chlorine sensors will trigger alarms on the Main Control Board (Mills Plant control room and the gas detector monitoring station).  Once alerted, fully trained personnel, including the CUF personnel will respond to assess the chlorine leak on a 24-hour basis.\r\n\r\nEmergency shower and eye wash stations are also provided around the chlorine unloading, equipment and general maintenance areas.\r\n\r\nThe chlorine leak detectors are connected to an uninterruptible power supply (UPS) system. In"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043779,
      "SummaryText": "EXECUTIVE SUMMARY\r\nThe Metropolitan Water District of Southern California (MWD) distributes drinking water to member water agencies throughout Southern California.  MWD provides approximately 60 percent of the drinking water used by nearly 16 million people living on the southern California coastal plain between Ventura County and the Mexican border.\r\n\r\nDisinfection is a critical process used by MWD in the treatment of its drinking water.  Disinfection helps to protect public health by killing pathogens in the water and preventing the spread of waterborne diseases.  The use of chlorine as a disinfectant in the treatment of drinking water and wastewater has been the dominant disinfection method in the United States since it was introduced, around the beginning of the last century.  MWD currently utilizes bulk chlorine for disinfection at all of its water treatment plants.  The MWD Chemical Unloading Facility (CUF) plays a critical role in supplying chlorine for drinking water disinfection.  The chlorine at CUF is received in rail cars and then transferred to chlorine cargo tanks which supply disinfection processes at various MWD water treatment facilities.\r\n\r\nAs one might expect from its superior disinfection properties, chlorine is a hazardous substance.  Thus, storing and handling chlorine can present a risk to employees and the public without proper precautions.  MWD regards safe practices in the storing and usage of chlorine to be of primary importance and has an excellent safety record with chlorine.\r\n\r\nCUF's chlorine handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program Rule (RMPR) and also to the California Accidental Release Prevention (CalARP) Program regulation.  Both of these regulations require submission of a Risk Management Plan (RMP).  An integral part of the RMP is a summary of policies and procedures followed to safely operate the facility, including a description of the possible consequences in case of"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000043779,
      "SummaryText": "ion.\r\n\r\nAs part of its ongoing commitment to keep enhancing chlorine process safety, MWD will be constructing a facility at CUF for containment of the storage and cargo tank filling area, with the capability of scrubbing both (to collect and neutralize any accidental chlorine release). This chlorine containment and neutralization project will substantially reduce the risk of an accidental release to CUF employees, the surrounding community and the environment. Construction is scheduled to begin mid-2014 and the facility is expected to be in operation in early 2016."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043779,
      "SummaryText": "an accident and the actions which will be taken by the facility in an emergency.\r\n\r\nThe following information is specifically required in the RMP Executive Summary: \r\n\r\n&#61607;\tAccidental release prevention and emergency response policies.\r\n&#61607;\tGeneral facility and regulated substances information.\r\n&#61607;\tSummary of the accidental release prevention program and chemical-specific prevention steps.\r\n&#61607;\tFive-year accident history summary.\r\n&#61607;\tEmergency response program summary.\r\n&#61607;\tPlanned changes to improve safety.\r\n\r\nAn RMP for CUF has been prepared and is being submitted to the EPA and Riverside County Environmental Health Department in June 2014 as part of the five-year RMP update process.  MWD is constructing a new Chlorine Containment and Handling Facility which will contain all chlorine inside a building that is protected by caustic scrubbers to neutralize any accidental chlorine release.\r\n\r\nThe information required in the RMP Executive Summary is provided below for CUF.\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe MWD accidental release prevention policy for chlorine involves a unified approach that integrates proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable procedures of the State of California and EPA's RMP Prevention Program are adhered to, including key elements such as training, systems management, and emergency response.  CUF has an excellent safety record with chlorine use.\r\n\r\nGeneral Facility and Regulated Substance Information\r\n\r\nCUF was built in 1972, and is located at 19765 Patterson Avenue, in Perris, California.  The facility is situated just west of Interstate Highway 215 and south of the Cajalco Expressway, covering approximately 3.8 acres.  CUF is equipped with two rail car unloading platforms, located under a large covered structure (Transfer Building). Only one rail car is in use at a time.  The"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043779,
      "SummaryText": "the event power is lost at the chlorination facility, an alarm will alert the Mills Plant control room. CUF has an emergency generator system, which provides backup power to run CUF emergency systems in the event of a power failure.\r\n\r\nAccess to CUF is controlled through a closed gate, which is manned by a security guard 24/7. In addition, all of CUF is marked Authorized Personnel Only and monitored remotely by video camera.\r\n\r\nFinally, no chlorine releases that caused or could have caused a safety or health hazard or property or environmental damage, evacuations, or sheltering in place have occurred at CUF during the last five years.  \r\n\r\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n\r\nCUF's accidental release prevention program complies with all RMPR, CalARP and PSM requirements and is based on the following key elements:\r\n\r\n&#61607;\tDetailed management system and clear levels of responsibilities and team member roles.\r\n&#61607;\tComprehensive process safety information that is readily available to staff, emergency responders, and contractors.\r\n&#61607;\tComprehensive preventive maintenance program.\r\n&#61607;\tPerformance of process hazard analysis of process, equipment and procedures with operation and maintenance staff participation and review.\r\n&#61607;\tUse of state-of-the-art process and safety equipment.\r\n&#61607;\tUse of accurate and effective operating procedures, written with the participation of the operators.\r\n&#61607;\tHigh level of training of the operators and maintenance staff.\r\n&#61607;\tImplementation of an incident investigation, inspection, and auditing program using qualified staff.\r\n\r\nHazard-specific prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine supply, awareness of the hazardous and toxic properties of chlorine, presence of chlorine detectors and alarms, and remotely controlled shutoff device on the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043779,
      "SummaryText": "chlorine storage.\r\n\r\nProcess and Chemical Safety Information\r\n\r\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine.  This information includes chlorine health and safety background information and SDS sheets.\r\n\r\nEquipment safety information was meticulously compiled on the chlorine process. Specifications for chlorine process are collected and provided in one place for easy reference. Details such as maximum intended inventory; safe upper and lower temperatures; safe upper and lower pressures; and codes and standards used to design, build, and operate CUF are on file at the facility.  CUF also has procedures in place to update process safety information if there is a change that makes existing information inaccurate.\r\n\r\nProcess Hazard Analysis \r\n\r\nIn 1992, 1995, 1998, 2004 and 2009 detailed process hazard analyses (PHAs) were conducted for CUF's equipment and procedures. The 2009 RMP PHA was recently reviewed and updated in 2014 and will be updated again within a five-year period or whenever there is major change in the process.  Recommended actions were developed in the May 2014 PHA to further improve the chlorine safety and staff is currently evaluating these recommendations. Staff will document the completion of recommended actions.\r\n\r\nAn update of the June 2009 CUF CalARP seismic risk assessment was completed in March 2014, based on Region 1 LEPC CalARP Seismic Update Guidance. Recommendations were provided to the CUF staff for evaluation and implementation.\r\n\r\nOperating Procedures\r\n\r\nCUF maintains up-to-date, accurate, written operating procedures that provide clear instructions for the CUF process.  CUF ensures effective operating and maintenance practices by combining them with operating and maintenance training programs.  Standard operating procedures (SOPs) provide system descriptions, specifications, equ"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000043779,
      "SummaryText": "t operators are trained in any updated or new procedures prior to startup of a process after a major change as indicated in their Management of Change procedures.\r\n\r\nCUF prepares and retains records of initial and refresher training, provides certification of the records, which includes the identity of the employee, the date of training, and the signature of the person (s) administering the training.\r\n\r\nContractors\r\n\r\nCUF has procedures and policies in place that ensure that the contractors are properly informed of the hazards, access limitations to these process areas, and emergency procedures, and are prepared to safely complete the work.  The contractors are informed, prior to the initiation of the work at the site, of the applicable provisions of the Emergency Action Plan.  CUF holds contractor safety briefings before allowing them near or in the process area; controls access to the process areas, and evaluates the contractor's performance.\r\n\r\nPre-Startup Safety Review and Mechanical Integrity Program\r\n\r\nCUF ensures that a pre-startup safety review is completed for any new process covered by this regulation, or for significant modifications to an existing covered process that requires a change in the process safety information.  CUF maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  CUF mechanical integrity program includes the following:\r\n\r\n&#61607;\tWritten procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes and practice, and prior operating experience.\r\n&#61607;\tImplementation of the written procedures by performing inspections and tests on process equipment at specified intervals.\r\n&#61607;\tTraining of maintenance personnel in preventive maintenance program procedures; safe work practices such as lockout/tagout, line or equipment opening, and avoidance"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000043779,
      "SummaryText": "and correction of unsafe conditions; and safe use and application of special equipment and/or unique tools.\r\n\r\nHot Work Permits and Management of Change \r\n\r\nCUF requires employees and contractors to employ safe work practices when performing hot work in, on, or around the covered process.  CUF uses a permitting and training program to ensure hot work is monitored and conducted safely on or near a process involving chlorine.\r\n\r\nCUF provides a system and approach to maintain and implement any management of change or modifications to process, equipment, procedures, chemicals, and processing conditions.  This system allows CUF staff to identify and review safety hazards or provide additional safety, process, or chemical information to existing data before the proposed change would either compromise system safety or need training to be completed.\r\n\r\nInternal Compliance Audits\r\n\r\nInternal compliance audits are conducted every 3 years to verify compliance with the programs and procedures contained in the RMP.  CUF assembles an audit team that includes personnel knowledgeable in the Risk Management Program rule and in the process.  This team evaluates whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations resolved, and appropriate enhancements to the prevention program are implemented.\r\n\r\nIncident Investigation\r\n\r\nCUF investigates all incidents that could reasonably have resulted in a catastrophic release (serious injury to personnel, the public, or the environment) so that similar accidents can be prevented.  If required, an investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during th"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000043779,
      "SummaryText": "e investigation is reviewed by affected staff and added or used to revise operating and maintenance procedures.  There have been no such incidents involving the CUF chlorine cargo tank filling system.\r\n\r\nFive-year Accident History Summary\r\n\r\nNo chlorine releases that caused or could have caused safety or health hazard (deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at CUF during the last five years.\r\n\r\nEmergency Response Program Summary\r\n\r\nCUF is a non-responding facility and, as such, does not have an emergency response plan.  CUF has Technician Level HAZWOPER-trained plant employees who will respond only to incidental chlorine releases and will respond to emergency releases only to assess.  CUF also includes employees trained in Incident Command System, who can coordinate with and provide technical assistance to outside emergency responders.  Depending on the severity of the accidental release, external hazardous materials response agencies, such as the Riverside County Fire Department Hazardous Materials Response Team, will be called to handle a chlorine release.  CUF coordinates routinely with local response agencies (Riverside County Fire Department Hazardous Materials Response Team) to help ensure that they are familiar with the CUF cargo tank filling system and its emergency response requirements and that this is reflected in their Area Plans.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nNumerous changes to improve safety (recommended actions) were previously identified for the chlorine unloading process in 1992, 1995, 1998, 2004, and 2009 when Process Hazard Analyses (PHAs) were prepared for the CUF. These recommended actions have been evaluated and implemented, as required. Additional changes to improve chlorine safety were identified in May of 2014, when the 2009 RMP process hazard analysis was reviewed and updated. It is expected that these recommended actions will be evaluated and implemented in a timely fash"
    }
  ]
}