{
  "FacilityID": 1000074263,
  "FacilityName": "Grubb Lease Gas Plant",
  "FacilityStr1": "3055 West Pacific Coast Highway",
  "FacilityStr2": null,
  "FacilityCity": "Ventura",
  "FacilityState": "CA",
  "FacilityZipCode": "93001",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.328797",
  "FacilityLongDecDegs": "-119.347828",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 878173806,
  "ParentCompanyName": "CalNRG Operating, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "CalNRG Operating, LLC",
  "OperatorStr1": "1746 F So. Victoria Ave",
  "OperatorStr2": null,
  "OperatorCity": "Ventura",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93003",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000222591",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "00008",
  "SafetyInspectionDate": "2018-10-22 00:00:00",
  "SafetyInspectionBy": "Ventura County Environmental Health Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-05-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-11-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 34.3155,
  "FRS_Long": -119.36314,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "8",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092520,
      "AltID": "Nat. Gas Liq. Storage",
      "FacilityID": 1000074263,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115772,
          "ProcessID": 1000092520,
          "ChemicalID": 155,
          "Quantity": 123397.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000100916,
              "ProcessChemicalID": 1000115772,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000100915,
              "ProcessChemicalID": 1000115772,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000100914,
              "ProcessChemicalID": 1000115772,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000100913,
              "ProcessChemicalID": 1000115772,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000100912,
              "ProcessChemicalID": 1000115772,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000100933,
              "ProcessChemicalID": 1000115772,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000100932,
              "ProcessChemicalID": 1000115772,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000093782,
          "ProcessID": 1000092520,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000074263,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Ventura County Fire Department",
    "CoordinatingAgencyPhone": "8053899710",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000074263,
      "SummaryText": "e been no accidental releases from the covered process that resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nEmergency Response Program\n\nCalNRG has developed written emergency response procedures to assist the employees with the reporting and safe practices to be taken in the event of a release.  Furthermore, the facility has submitted their Hazardous Materials inventories and Business Emergency Plan with the local Fire Department to provide notification to first responders.  The plan consists of procedures for notification of local emergency response agencies, evacuation plans for the Santa Clara Valley Gas Plant and accounting for facility personnel after an evacuation.  Emergency shutdown procedures are included in the Operating Procedures for the plant that are located at the field office, as well as on the company's shared servers.  The procedures allow for safe shutdown or isolation of the covered process and containment of potential spills or leaks.\nApplication of the emergency response procedures ensures compliance with the Cal/OSHA Emergency Action Plans Standard and the emergency response element of the CalARP Prevention Program 3 requirements. \n\nPlanned Changes to Improve Safety \nCalNRG evaluates, and as appropriate, implements changes to improve safety as opportunities are\nidentified in PHAs, compliance audits, or by operating, maintenance, or other personnel."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000074263,
      "SummaryText": "s address various modes of operation such as initial startup,\nnormal operations, temporary operations, emergency shutdown, emergency operations, normal\nshutdown and startup after a turnaround. The information is regularly reviewed and is readily\naccessible to operators involved in the processes.\n\nTraining\n\nCalNRG has a comprehensive training program in place to ensure that employees who are operating\nprocesses are competent in the operating procedures associated with these processes, as well as\nemergency activities. Refresher training is provided at least every 3 years.\n\nMechanical Integrity\n\nCalNRG carries out documented inspections, tests, and maintenance checks of process equipment to\nensure adequate mechanical integrity. These activities are conducted by the Mechanical Integrity\nand Maintenance groups. Only qualified personnel are permitted to carry out inspections, tests, and\nmaintenance activities on process equipment and systems such as pressure vessels, storage tanks,\npiping systems, relief and vent systems, emergency shutdown systems, pumps, compressors and\nelectrical equipment. Specialized training is provided as needed for certain maintenance checks.\nEquipment deficiencies identified by the maintenance checks are tracked to completion through the\ncompany maintenance work order system and corrected in a safe and timely manner.\n\nManagement of Change\n\nA Management of Change program is in place at CalNRG to manage changes in process chemicals,\ntechnology, equipment, procedures, and personnel. Process operators, maintenance personnel or\nany other employee whose job tasks are affected by a modification in process conditions are\npromptly made aware of or, if needed, trained on the modification.\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications of established processes\nare conducted whenever there is a change in the safety information as part of the Management of\nChange process. \n\nFive-Year Accident History\n\nThere hav"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000074263,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies at the Stationary Source\n\nCalNRG is strongly committed to employee and public safety, as\nwell as sound environmental practices. This commitment is demonstrated by our comprehensive\naccidental release prevention program that covers areas such as design, installation, operating\nprocedures, maintenance, and employee training associated with the processes at our facility. It is\nour policy to implement appropriate controls to prevent accidental releases of regulated substances.\n\nStationary Source and Regulated Substances Handled\n\nThe CalNRG stationary source consists of a gas plant and NGL recovery which contains a flammable mixture.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nOur facility has taken all steps necessary to comply with the applicable accidental release prevention provisions of 40 CFR Part 68. The following sections briefly describe the elements of the accidental release prevention program that is in place at CalNRG.\n\nProcess Safety Information\n\nCalNRG maintains a detailed record of safety information that describes the hazards of the chemicals\nused in the processes, information regarding the technology of the process, and detailed equipment\ninformation.\n\nProcess Hazard Analysis\n\nCalNRG conducts comprehensive studies to ensure that hazards associated with processes are\nidentified and appropriately managed. The primary methodologies used to conduct these analyses\nare Hazard and Operability (HAZOP) and What-If studies. The studies are undertaken by a team of\nqualified personnel with expertise in engineering and process operations and are revalidated at a\nregular interval of 5 years. Findings related to the hazard analysis are addressed in a timely manner\nbased on relative risk of potential hazards.\n\n\nOperating Procedures\n\nFor the purpose of safely conducting activities within covered processes, CalNRG maintains written\noperating procedures. These procedure"
    }
  ]
}