{
  "FacilityID": 1000044614,
  "FacilityName": "Genencor International Wisconsin, Inc.",
  "FacilityStr1": "2600 Kennedy Drive",
  "FacilityStr2": null,
  "FacilityCity": "Beloit",
  "FacilityState": "WI",
  "FacilityZipCode": "53511",
  "Facility4DigitZipExt": "3969",
  "FacilityCountyFIPS": "55105",
  "LEPC": "Rock County LEPC",
  "FacilityLatDecDegs": "42.512812",
  "FacilityLongDecDegs": "-088.992119",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.dupont.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 611454406,
  "ParentCompanyName": "DuPont",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Genencor International, Inc.",
  "OperatorStr1": "2600 Kennedy Drive",
  "OperatorStr2": null,
  "OperatorCity": "Beloit",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53511",
  "OperatorZipCodeExt": "3969",
  "RMPContact": "Mike Vonderhaar",
  "RMPTitle": "Plant Manager",
  "FTE": 75,
  "OtherEPAFacilityID": "53511NZYMB2600K",
  "EPAFacilityID": "100000150123",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-04-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-09-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.51546,
  "FRS_Long": -88.99038,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055149,
      "AltID": "Ammonia System",
      "FacilityID": 1000044614,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055998,
          "ProcessID": 1000055149,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067227,
          "ProcessID": 1000055149,
          "ChemicalID": 56,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567227,
          "ProcessID": 1000055149,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044614,
      "SummaryText": "Executive Summary\n\nGenencor International Wisconsin, Inc.\n\nDuPont Industrial Biosciences\n\nE.I. DuPont de Nemours and Company\n\nRisk Management Plan\n\n\n\n\n\nIntroduction to Facility & Regulated Substance\n\n\n\nGenencor International Wisconsin, Inc. is an industrial biotechnology facility located in Beloit's Industrial Park.  This ISO-9001:2008-and ISO 14001:2004 certified-facility employs approximately 75 people and operates under a team-based organizational structure.  E.I. DuPont de Nemours assumed ownership of the Genencor International Wisconsin facility in 2011.  In late 2011, efforts were initiated to improve Safety, Health, and Environmental systems for the site, guided by DuPont Core Values and Commitment to Safety, Health, and Environment.  \n\n\n\nThe facility manufactures enzymes through a fermentation-based process. Enzymes are chemicals comprised of large proteins, and have been used in the food and detergent manufacturing industries for many years.  The site's manufactured enzymes are primarily intended for use in the grain processing industry.   The facility operates a continuous 24-hour-per-day process and has on-site Maintenance and Laboratory support.  Staff support includes site Management, Safety, Health & Environmental, Engineering, Purchasing, Finance, and Systems personnel.\n\n\n\nAnhydrous ammonia is the regulated substance under EPA Risk Management criteria and is used in the enzyme manufacturing process.  The covered process for the site's Risk Management efforts includes the anhydrous ammonia storage and distribution system.  The RMP covered process is divided into the following sections or \"nodes\" for the purpose of this program:\n\n?    Ammonia truck unloading\n\n?    Ammonia storage tank\n\n?    Ammonia distribution up to Building 18 Branch\n\n?    Ammonia distribution from the Building 18 Branch to Building 1 up to the last block valve at each fermentor\n\n?    Ammonia distribution from the Building 1 Branch to Building 18 up to the last block valve at each fermentor\n\n\n\n\n\nChe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044614,
      "SummaryText": "mical Safety\n\n\n\nDuPont Industrial Biosciences' overall approach to chemical safety is comprehensive.  Systems are engineered with safety and environmental aspects in mind, with input from affected areas of the plant prior to construction or use.  The goal is to provide a safe workplace while minimizing any environmental impacts.  Release prevention methods are implemented where possible, including computer controls, automation, containment of outdoor tanks; inside sump areas; and neutralization capabilities.\n\n\n\nSite commitment to Safety, Health, & Environment includes the following examples:\n\nThe Safety, Health, & Environment budget is established to provide:\n\n?    Appropriate and adequate personal protective equipment\n\n?    Appropriate post-offer and annual medical examinations\n\n?    Training\n\n?    Air monitoring equipment and analysis\n\n?    Hazardous waste pick-up for a small quantity hazardous waste generator\n\n\n\nA Safety Committee is in place to ensure that plant safety is continually reinforced.  \n\nThe role of this support team includes the following:\n\n?    Help identify, prioritize and address physical hazards through plant safety audits\n\n?    Help communicate impacts to employees\n\n?    Help others to act\n\n\n\nMember responsibilities include:\n\n?    Represent their functional areas as members of the Safety Committee\n\n?    Facilitate safety program implementation\n\n?    Help to establish minimum safe work practices\n\n?    Participate in safety walk-arounds\n\n?    Communicate back to their functional teams\n\n\n\nProcess Safety Steering Committee and Process Safety Element Committee are in place.\n\n    The role of these support teams includes the following:\n\n?    Implementation of the DuPont PSM Program\n\n?    Providing and executing implementation strategies\n\n?    Review of process safety metrics\n\n?    Review audit results and coordinate implementation action\n\nThe DuPont Core Values and Commitment to Safety, Health, and Environment guide us through sustainable site efforts.\n\n\n\nThe DuPont Commitment Safety, Health, and the Envi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044614,
      "SummaryText": "ronment:\n\nThrough our Commitment to safety, health, and environment excellence, we affirm to all our stakeholders, including our employees, customers, shareholders, and the public, that we will work collaboratively to bring sustainable, market-driven and innovative solutions to solve some of the world's biggest challenges, making lives better, safer ,and healthier for people everywhere.  We will implement those strategies that build successful businesses and achieve the greatest benefor for all our stakeholders with respect and care for the environment without compromising the ability of future generations to meet their needs.\n\n\n\nWe will continuously improve our practices in light of advances in technology and new understandings in safety, health, and environmental science.  We will make consistent measureable progress in implementing this Commitment throughout our worldwide operations and support Responsible Care as a key program to achieve this Commitment.\n\n\n\n\n\nNew employees attend ~7 hours of initial safety training, which includes chemical awareness training as well as various OSHA and EPA-required information.  Job-duty training is ongoing for each employee and occurs with co-worker trainers utilizing training manuals and SOP's.  Genencor believes in being proactive in its training endeavors and strives to encourage employees to attend specific training associated with their job duties that go above and beyond the basic job requirements.  \n\n\n\nCapital projects deemed necessary for environmental, health & safety reasons are implemented and supported through the capital expenditure process.\n\n\n\n\n\nEmergency Response \n\n\n\nThe site Emergency Action Plan addresses how employees shall respond to emergencies, including hazardous weather; fire; building evacuation; hazardous device threat; and hazardous material spills.  All employees are trained in the site Emergency Action Plan as part of the established initial safety training for new employees. \n\n\n\nThe site Emergency R"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044614,
      "SummaryText": "esponse Plan for a Hazardous Substance Release is in place to provide guidance for spill operations.  The Incident Command System is the designated management system for emergencies and is included in the plan.  The plan outlines the responsibility of involved personnel during an incident; discusses the Incident Command System; gives instruction for securing outside emergency assistance; addresses internal and external notifications including the media/public; outlines emergency procedures for general emergency response; addresses spill control, personal protective equipment & first aid; and covers disposal & decontamination.  All employees are trained in the site Emergency Response Plan for a Hazardous Substance Release.  \n\n\n\n\n\nGeneral Prevention Measures\n\n\n\nDuPont Industrial Biosciences has a number of measures in place for spill prevention.  These include, but are not limited to, preventative maintenance work; standard operating procedures which are updated at least bi-annually; employee training; back-up equipment where possible; and computer-monitored level indicators with interlocking systems when process limits are reached.  The facility has 24-hour team-based process coverage in the facility, including a full-service maintenance department.  The facility also operates under ISO 9001:2008 and ISO 14001:2004 certifications which ensures among other things, that procedures are updated and used for plant operations in addition to proper handling of all documents.\n\n\n\n\n\nFive-Year Accident History\n\n\n\nThere have been no accidents at the Genencor International Wisconsin, Beloit facility involving anhydrous ammonia system that resulted in a serious onsite or offsite impacts.\n\n\n\n\n\nChanges to Improve Safety\n\n\n\nA Process Hazard Analysis was conducted for the site's anhydrous ammonia system beginning in June 2013 and concluding in December 2013  .  This was led by an experienced DuPont PHA Resource and completed by a team with representation from Maintenance, Engineering,"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044614,
      "SummaryText": " Operations, and Safety, Health, & Environmental perosnnel.  Fifty recommendations were accepted from the Process Hazard Analysis and are currently being implemented.\n\n\n\n"
    }
  ]
}