{
  "FacilityID": 1000078519,
  "FacilityName": "Goal Line LP",
  "FacilityStr1": "555 N. Tulip St",
  "FacilityStr2": null,
  "FacilityCity": "Escondido",
  "FacilityState": "CA",
  "FacilityZipCode": "92025",
  "Facility4DigitZipExt": "2532",
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.118552",
  "FacilityLongDecDegs": "-117.099367",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 861499762,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Goal Line L.P.",
  "OperatorStr1": "555 N. Tulip St.",
  "OperatorStr2": null,
  "OperatorCity": "Escondido",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92025",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": "Cal000122995",
  "EPAFacilityID": "100000122173",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-02-04 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-06-03 00:00:00",
  "DeRegistrationEffectiveDate": "2020-08-28 00:00:00",
  "AnniversaryDate": "2024-05-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.1196,
  "FRS_Long": -117.09926,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097911,
      "AltID": "SCR Ammonia System",
      "FacilityID": 1000078519,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122828,
          "ProcessID": 1000097911,
          "ChemicalID": 57,
          "Quantity": 31004.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000099153,
          "ProcessID": 1000097911,
          "NAICSCode": "221118",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000061142,
              "Process_NAICS_ID": 1000099153,
              "SafetyReviewDate": "2018-12-05 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2019-04-04 00:00:00",
              "ChangeCompletionDate": "2020-04-04 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-12-07 00:00:00",
              "TrainingReviewDate": "2018-08-09 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-09-24 00:00:00",
              "EquipmentInspectionDate": "2018-10-12 00:00:00",
              "EquipmentTested": "UT testing for Pressure Vessel and regular preventive maintenance inspections are carried out for calibrations, leaks, and visual inspections.",
              "ComplianceAuditDate": "2017-01-05 00:00:00",
              "AuditCompletionDate": "2018-01-05 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000061810,
                  "PreventionProgram2ID": 1000061142,
                  "ProcessChemicalID": 1000122828
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000078519,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fire Department, HAZMAT Division",
    "CoordinatingAgencyPhone": "6197783591",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078519,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nAccidental Release Prevention \n\n\n\nGoal Line LP has developed a Risk Management Program and an Emergency Response Plan to address CalARP Program requirements (19 CCR ?2735-2785).  \n\n\n\nGoal Line LP has a long standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the Ammonia Systems.  Goal Line LP's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n\n\n\nStationary Source and Regulated Substance \n\n\n\nThe Goal Line LP is located at 555 Tulip Street, Escondido, California 92025.  \n\nThe regulated substances at the Facility are: anhydrous ammonia for the Ammonia Absorption Refrigeration Unit and 30% aqueous ammonia for both the SCR Ammonia System and the Ammonia Absorption System.\n\n\n\nHazard Assessment Summary/Offsite Consequence Analysis \n\n\n\nProcess No.1: SCR Ammonia System - 30% Aqueous Ammonia\n\n\n\n?    Worst-Case Release Scenario Results Summary:\n\nPer CalARP Regulations and EPA RMP Regulations, one worst-case analysis has been defined and modeled for the SCR Ammonia System.  The results can be found in the Hazard Assessment documentation located behind the Hazard Assessment tab of the 2019 Five Year Update Binder. \n\n?    Alternative Release Scenario Results Summary:\n\nAn alternative release scenario was modeled.  The results can be found in the Hazard Assessment documentation located behind the Hazard Assessment tab of the 2019 Five Year Update Binder.\n\n\n\nProcess No.2: Ammonia Absorption Refrigeration Unit - Anhydrous Ammonia.  System is not regulated by the EPA only regulated by CalARP.\n\n\n\n?    Worst-Case Release Scenario Results Summary:\n\nPer CalARP Regulations, one worst-case analysis has been defined and modeled for the Ammonia Absorption Refrigeration Unit.  The results can be found in the Hazard Assessment documentation located behind"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078519,
      "SummaryText": " the Hazard Assessment tab of the 2019 Five Year Update Binder.\n\n?    Alternative Release Scenario Results Summary:\n\nAn alternative release scenario was modeled.  The results can be found in the Hazard Assessment documentation located behind the Hazard Assessment tab of the 2019 Five Year Update Binder.\n\n\n\n\n\nRisk Considerations\n\nAlthough the storage and use of ammonia has inherent potential risks, and worst-case release scenarios can potentially reach the community; Goal Line LP has recognized these potential risks and structured its safety programs to make the worst-case type of event non-credible.  In addition to the safety practices of the company and plant personnel to make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event (e.g., In the event of a release, sudden rupture and flashing of ammonia would be highly turbulent.  Turbulence causes entrainment of air and the released vapor dilutes much more quickly than is shown in the model).\n\nIn addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with an ammonia release, including the following:\n\n\n\n?Although, the facility is not subject to Cal/OSHA PSM, the facility prevention program meets and exceeds the PSM requirements.\n\n?Ammonia sensors are located in the process area.\n\n?Automatic/Manual shutdowns in place.\n\n?Personal Protective Equipment (PPE) is used by plant personnel, as necessary.\n\n?The history of the Goal Line LP facility (i.e., no CalARP-applicable ammonia releases) reflects the adequacy of the design and diligence of the plant staff in safely operating the Ammonia Absorption Refrigeration Unit and SCR System.\n\n\n\n\n\nAccidental Release Prevention Program \n\n\n\nThe facility "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078519,
      "SummaryText": "has an inventory of 31,004 pounds (lbs.) aqueous ammonia on-site.  Therefore, it is over the 20,000-lb. threshold (20% or greater concentration) for US EPA RMP and the 500-lb. (all concentrations) state threshold for CalARP Program.  Goal Line LP is not subject to Cal/OSHA PSM or Program 3 requirements due to the fact that the concentration of aqueous ammonia managed at the facility is 30% and the Cal/OSHA PSM threshold quantities of aqueous ammonia is only for concentrations greater than 44%.  For the reasons mentioned above, the SCR Ammonia System is subject to CalARP Program Level 2 and US EPA RMP Program Level 2.\n\n\n\nThe Absorption Refrigeration Unit has an inventory of 5,160 lbs. anhydrous ammonia on-site.  The regulated substance is over the 500-lb. threshold for the CalARP Program but under the US EPA RMP and Cal/OSHA PSM Program threshold quantity of 10,000 lbs.  Therefore, the Absorption Refrigeration Unit is only subject to CalARP Program Level 2.\n\n\n\nAs part of the implementation of this CalARP Program, even though the Ammonia Absorption Refrigeration Unit and the Ammonia SCR System are only subject to Prevention Program 2 requirements, Prevention Program 3 elements were implemented by Goal Line LP to manage process safety issues associated with the use of ammonia for the NOx abatement, as well as for the refrigeration system.  \n\n\n\nIn addition, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed.\n\n\n\nThe Prevention Program 3 elements include:\n\n?Process Safety Information\n\n?Process Hazard Analysis\n\n?Operating Procedures\n\n?Training\n\n?Mechanical Integrity\n\n?Management of Change\n\n?Pre-Startup Safety Review\n\n?Compliance Audits\n\n?Incident Investigation\n\n?Employee Participation\n\n?Hot Work Permit\n\n?Contractors\n\n\n\n\n\nIn addition, key emergency response elements were addressed in Section 4.7 of this document. \n\n\n\nFive-Year Accident History \n\n\n\nNew accident history information - For any accidental relea"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078519,
      "SummaryText": "se meeting the five-year accident history reporting criteria of 19 CCR ?2750.9, the owner or operator shall submit the data required under 19 CCR ?2745.5, ?2745.6, and ?2745.7 with respect to that accident within six months of the release or by the time the RMP is updated under 19 CCR ?2745.10, whichever is earlier.\n\nFrom 19 CCR ?2750.9: \n\n\n\nThe owner or operator shall include in the five-year accident history all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nThere have been no CalARP-applicable releases of ammonia at Goal Line LP in the past five years.\n\n\n\nEmergency Response Program\n\n\n\nGoal Line LP is not a First Responder Facility.  The Facility has implemented an Emergency Action Plan (EAP) that meets the requirements of 8 CCR ?3220 and does not assume the role of first responder during an emergency.  Employees are trained to evacuate and call 9-1-1.  The Goal Line LP will coordinate with local Fire Department and First Responders.  They are trained and fully equipped to respond to hazardous material releases  \n\n\n\nGoal Line LP maintains the Business Emergency Plan (BEP) for the facility.  The BEP provides the response protocols and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which have been implemented to respond effectively to emergency situations that may arise at the facility.  The BEP is reviewed and updated at least once per year to ensure compliance with CalARP and BEP regulations. \n\nKey elements of the BEP include:\n\n\n\n?Emergency Alarm Procedures\n\n?Evacuation Procedures\n\n?Safety and Health Considerations\n\n?Notification Procedure\n\n\n\nExternal Events Analysis Information\n\n\n\nPursuant to the requirements of 19 CCR ?2745.6(l); the following external events analysis information shall be submitted:\n\n\n\n?The types of natural and human c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078519,
      "SummaryText": "aused external events considered in PHA 19 CCR ?2760.2 or Hazard Review 19 CCR ?2755.2.  \n\n\n\nDuring the April 4, 2019 Process Hazard Analysis (PHA), plausible events were considered.  General events external to the facility that can conceivably cause a release of ammonia were addressed.  For detail information, refer to PHA Report located within the PHA Section Tab of the 2019 Five-Year Update Binder.\n\n?The estimated magnitude or scope of external events which were considered.  If not known, the owner or operator of the stationary source shall work closely with the AA to determine what is required.  If seismic events are applicable, the parameters used in the consideration of the seismic analysis and which edition of the Uniform Building Code was used when the process was designed.\n\n\n\nThe magnitudes of the external events considered are detailed within the PHA Worksheets and were qualitatively risk-ranked by the PHA Team.\n\n\n\n?For each external event, with a potential to create a release of a regulated substance that will reach an endpoint offsite, apply \n\n1)The expected date of completion of any changes resulting from the Process Hazard Analysis (PHA)\n\n2)Major hazards identified;\n\n3)Process controls in use;\n\n4)Mitigation systems in use;\n\n5)Monitoring and detection systems in use; and,\n\n6)Changes since the last PHA\n\nRefer to Section 7.4 section of the RMPe*submit, under PHA, for the required information.\n\n\n\n?The date of the most recent field verification that equipment is installed and maintained as designed.\n\n\n\noThe most recent field verification of equipment was conducted on June 2015 and it included the UT testing for both Anhydrous Ammonia and the Aqueous Ammonia systems.\n\noRegular preventive maintenance inspections are carried out for calibrations, leaks, and visual inspections.  The Anhydrous system (AARU) had the absorbers and condenser opened, cleaned and inspected on 10/10/18. The Anhydrous cross exchangers were re-tubed 3/28/14.\n\n\n\nPlanned Changes To Improv"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000078519,
      "SummaryText": "e Safety \n\nThe PHA study has been conducted to examine mitigation measures to improve safety at the facility.  Planned changes to improve safety are listed as recommendations in the April 4, 2019 PHA Report located behind the PHA Tab of the 2019 Five-Year Update Binder.\n\n\n\nFlammables: Worst Case \n\nThe use of flammable materials at Goal Line LP is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable. \n\n\n\nFlammables: Alternative Release \n\nThe use of flammable materials at Goal Line LP is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable. \n\n"
    }
  ]
}