{
  "FacilityID": 1000013774,
  "FacilityName": "Delta Deer Park",
  "FacilityStr1": "334 Tidal Road",
  "FacilityStr2": null,
  "FacilityCity": "Deer Park",
  "FacilityState": "TX",
  "FacilityZipCode": "77536",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-Deer Park Area L",
  "FacilityLatDecDegs": "29.713490",
  "FacilityLongDecDegs": "-095.113030",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.deltacompanies.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Delta Petroleum Company",
  "Company2Name": "Grief",
  "CompanyDUNS": 8176364,
  "Company2DUNS": 8176364,
  "OperatorName": "Delta Deer Park",
  "OperatorStr1": "334 Tidal Road",
  "OperatorStr2": null,
  "OperatorCity": "Deer Park",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77536",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tommy Boyette",
  "RMPTitle": "Plant Manager",
  "FTE": 36,
  "OtherEPAFacilityID": "TXR000029199",
  "EPAFacilityID": "100000119267",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-29 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-06-24 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-06-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.71444,
  "FRS_Long": -95.11111,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "LORAN C",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017219,
      "AltID": "Chemical Packaging, Wareh",
      "FacilityID": 1000013774,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017621,
          "ProcessID": 1000017219,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020497,
          "ProcessID": 1000017219,
          "ChemicalID": 26,
          "Quantity": 979500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 26,
            "ChemicalName": "Ethylenediamine  [1,2-Ethanediamine]",
            "CASNumber": "107-15-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000020498,
          "ProcessID": 1000017219,
          "ChemicalID": 44,
          "Quantity": 6142032.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000020499,
          "ProcessID": 1000017219,
          "ChemicalID": 20,
          "Quantity": 1535508.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 20,
            "ChemicalName": "Toluene 2,6-diisocyanate  [Benzene, 1,3-diisocyanato-2-methyl-]",
            "CASNumber": "91-08-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000520497,
          "ProcessID": 1000017219,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000520498,
          "ProcessID": 1000017219,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000520499,
          "ProcessID": 1000017219,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013774,
      "SummaryText": "1.0    EXECUTIVE SUMMARY AND CERTIFICATION\n\n1.1    SITE INFORMATION\nThe main operation of Delta Deer Park is contract chemical packaging, warehousing and distribution.  The facility was completed and began packaging operation in 1998.  The facility is situated on approximately 9 acres located at 334 Tidal Road in Deer Park, Texas 77536.\n\n1.2    ACIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICES\nDelta Deer Park is committed to employee, public and environmental safety. This commitment is inherent to comprehensive accidental release prevention program that covers areas such as design, instillation, operating procedures, maintenance and employee training on facility processes. It is Delta's policy to implement appropriate controls to reduce and prevent the release of regulated substances. Delta has trained emergency response personnel on site for release response.\n\n1.3     THE STATIONARY SOURCE AND THE REGULATED SUBSTANCE HANDLED\nThe Delta Deer Park facility's primary activities are packaging, warehousing and distribution of chemicals. The regulated substances handled by the facility are listed below.  Delta Deer Park receives the regulated substances in bulk tanker trucks, rail cars and iso tanks and transfers them to 55-gallon drums, 275 gallon totes and other smaller containers.  Filled containers are then warehoused or shipped depending on customer specifications.  Inventory is dependent upon customer orders and not all regulated substances are always present onsite. Typical Material Safety Data Sheets (MSDS) are provided for all predicted regulated substances in Appendix A.\n\n\nChemical:                      CAS No.\n\nToxic Substances:    \n\nToluene 2,4 Diisocyanate (TDI)     584-84-9\nToluene 2,6 Diisocyanate (TDI)     91-08-7\nEthylenediamine                     107-15-3\n\n\n1.4    THE WORST CASE RELEASE SCENARIOS AND THE ALTERNATIVE RELEASE SCENARIOS\nDelta Deer Park is the operator of a stationary source that has more than the threshold quantity of a regulated substance in a process, as de"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013774,
      "SummaryText": "termined under 40 CFR 68.115 and therefore is subject to 40 CFR Part 68 - Chemical Accident Prevention Provisions.  Delta Deer Park is a Program 2 level facility.\n\nTo evaluate the worst case and alternative scenarios, EPA's RMP*Comp&trade; program was used to evaluate off-site consequences.  RMP*Comp&trade; is based on the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst-case scenario for the regulated chemicals involves the catastrophic failure of the largest vessel containing the regulated substance at the facility and is a rail car (est. 20,600 gallons).\n\nThe alternative release scenarios include:\nA?    3\" hose with 1\" puncture while filling at 90A?F, that leaks for 5 minutes.  \nA?    3\" hose with 1\" puncture while filling at 70A?F, that leaks for 5 minutes.  \nA?    3\" hose separation flange at 90A?F, that leaks for 5 minutes.  \nA?    four drums falling off the loading dock and contents leaking within one minute at 100A?F.  \nA?    overfilling of a drum at the filler for 1 minute at 90A?F.  \n\nNone of these scenarios are likely to result in the full amount of the regulated substances being released because of onsite personnel and other mitigation techniques, but for the worst-case and alternative scenarios these situations were used as potential possibilities that could have offsite consequences, as required by 40 CFR 68.25 and 40 CFR 68.28.\n\n1.5    THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-SPECIFIC PREVENTION STEPS\nDelta Deer Park has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68. The packaging and warehouse process at the facility is not subject to the OSHA PSM standard under 29 CFR 1910.119. Delta Deer Park is subject to EPCRA Section 313 notification requirements. The following sections briefly describe elements of the release prevention program that is in pl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013774,
      "SummaryText": "ace at the stationary source.\n\nProcess Safety Information  \nDelta Deer Park maintains a record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with the process. \n\nProcess Hazard Review\nThis facility conducts process hazard reviews to ensure that hazards associated with the process are identified and controlled efficiently. Checklist and What If methods are used to carry out the process hazard analysis. The process hazard analysis is undertaken by a team of qualified personnel with expertise in engineering and process operations and is revised as needed when there is a change in the process. Any findings related to the hazard analysis are addressed in a timely manner. \n\nOperating Procedures\nFor the purposes of safely conducting activities within the covered process, Delta Deer Park maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency operations, normal shutdown and startup after maintenance. The information is regularly reviewed and is readily accessible to operators involved in the process.\n\nTraining\nDelta Deer Park has a training program in place to ensure that employees are competent in the operating procedures associated with those processes. New employees receive training before starting work. Operating procedures are reviewed annually and more frequently as needed. \n\nMechanical Integrity \nDelta Deer Park carries out documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks include among others; pressure valves and systems, hoses and piping systems, relief and vent systems, emergency shutdowns systems and controls. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. These personnel receive specialized on the job training as needed. Any equipment deficiencies ident"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013774,
      "SummaryText": "ified by the maintenance checks are corrected in a timely manner. \n\nManagement of Change\nWritten procedures are in place at Delta Deer Park to manage changes in chemicals being packaged, technology, equipment and procedures. Process operators and maintenance personnel whose job tasks are affected by a change or modification of process conditions are made aware of the changes.\n\nPre-startup Reviews\nPre-startup safety reviews related to new processes and modifications in existing processes are conducted as needed. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment in operation.\n\nCompliance Audits\nDelta Deer Park conducts compliance audits to determine whether the provisions set out under the RMP rule are being implemented. These audits will be carried out at least every 3 years and any corrective actions as a result of the audits will be undertaken promptly. \nIncident Investigation\nDelta Deer Park promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the root cause of the incident as well as any corrective actions to prevent the incident from recurring. Reports are retained in the web based CMS system.\n\nEmployee Participation\nDelta Deer Park believes that incident prevention is a team effort and involves employees in the incident prevention process. Delta employees have access to the information created as part of facility's implementation of the RMP rule, including information resulting from process hazard analyses. \n\nContractors\nOn occasion, the company hires contractors to conduct specialized maintenance and construction activities. Delta Deer Park has a policy of informing the contactors of known potential hazards related to the contactor's works. Contractors are also informed of emergency procedures should an accidental releas"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000013774,
      "SummaryText": "e of a regulated substance occur.\n\n1.6     FIVE-YEAR ACCIDENT HISTORY\nThere has been no release of RMP chemicals at the Delta Deer Park site over the past 5 years.\n\n1.7    EMERGENCY RESPONSE PLAN\nDelta Deer Park has a written emergency response plan for responding to accidental releases of hazardous materials. The plan covers the aspects of emergency response including adequate first aid and medical treatment, evacuations, notifications of local emergency response agencies and the public, as well as post-incident return to work procedure.  The plan is updated regularly to reflect relevant changes taking place within the process that would require a modified emergency response.\n\n1.8    PLANNED CHANGES TO IMPROVE SAFTY\nDelta Deer Park has a continuous improvement policy in place that includes safety improvement. \n\n1.9    CERTIFICATION STATEMENT\nTo the best of my knowledge, information and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n\n__________________________        _______________________\nSignature                    Name\n\n____________________________        ________________________\nEH&S Manager                        Date\n"
    }
  ]
}