{
  "FacilityID": 1000000602,
  "FacilityName": "Walnut Creek Wastewater Treatment Plant",
  "FacilityStr1": "7113 E. Martin Luther King Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Austin",
  "FacilityState": "TX",
  "FacilityZipCode": "78724",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48453",
  "LEPC": "Travis County LEPC",
  "FacilityLatDecDegs": "30.279722",
  "FacilityLongDecDegs": "-097.652778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.ci.austin.tx.us/water",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Austin Water Utility",
  "OperatorStr1": "625 East 10th St., Suite 800",
  "OperatorStr2": null,
  "OperatorCity": "Austin",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78701",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Welch",
  "RMPTitle": "Plant Superintendent",
  "FTE": 34,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000077123",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-07-18 00:00:00",
  "SafetyInspectionBy": "Insurance Carrier",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.27981,
  "FRS_Long": -97.65289,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000746,
      "AltID": "Chlorination",
      "FacilityID": 1000000602,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000000793,
          "ProcessID": 1000000746,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000772,
          "ProcessID": 1000000746,
          "ChemicalID": 62,
          "Quantity": 64000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000500772,
          "ProcessID": 1000000746,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000000747,
      "AltID": "Dechlorination",
      "FacilityID": 1000000602,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000000794,
          "ProcessID": 1000000747,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000773,
          "ProcessID": 1000000747,
          "ChemicalID": 49,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000500773,
          "ProcessID": 1000000747,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000602,
      "SummaryText": "WALNUT CREEK WASTEWATER TREATMENT PLANT\nCITY OF AUSTIN, WATER AND WASTEWATER UTILITY\nRISK MANAGEMENT PLAN (RMP), EXECUTIVE SUMMARY\n\nThe accidental release prevention and emergency response policies at the facility:\n\nThe City of Austin Water & Wastewater Utility (Utility) owns and operates Walnut Creek Wastewater Treatment Plant (Walnut Creek WWTP). The Utility's mission is that it will protect our community's public health and environment by effective management of our water resources.  \n\nThe Walnut Creek WWTP has established an effective chemical release prevention and emergency response plan.  It is the policy of the Walnut Creek WWTP to take all necessary actions to prevent the release of a hazardous chemical.  Even with an effective prevention program in place, a chemical release incident may still be a remote possibility.  Through planning, procedures, training, monitoring, and mitigation systems, the facility is prepared to promptly perform emergency actions to minimize and contain the release of a hazardous chemical.  Highly trained Walnut Creek WWTP technicians with the aid of City of Austin Fire Department Hazardous Materials Team are prepared to respond to the scene, evacuate the immediate area (if necessary), and control a release. \n\nThe facility and the regulated substance handled:\n\nThe Walnut Creek WWTP provides wastewater treatment services to citizens, businesses, and industries of the City of Austin.  In the process of treating domestic and industrial sewage, the regulated chemicals, chlorine and anhydrous sulfur dioxide, are used and stored at the facility to disinfect the water from microbial contamination and neutralize the chlorine before discharged in the Colorado River.  Chlorine liquefied under pressure is delivered in one ton containers.  A maximum inventory of chlorine containers are stored in a specially designed storage building.  Anhydrous Sulfur Dioxide liquefied under pressure is also delivered in one ton containers.  A maximum inventor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000602,
      "SummaryText": "y of sulfur dioxide containers are stored in a specially designed storage building.  The administrative controls placed on the amount of chemicals stored allow the facility to maintain safe operating and design conditions.\n\nThe worst-case release scenario(s) and the alternative release scenario(s):\n\nThe Environmental Protection Agency (EPA) defines a \"worse-case\" scenario as the release over a 10- minute period of the largest amount of a listed chemical under very extreme weather conditions and with the total, simultaneous failure of all active safety and emergency backup systems and personnel.  The probability of this scenario is so extremely remote that EPA's basic intention is to identify any potential offsite impacts.  The facility defines its worst case scenario as the total release of a one ton chlorine cylinder due to impact without consideration of an enclosure or other mitigation system.  The EPA developed model, RMP* Comp Version 1.07, was used to calculate endpoint distances as reported in the plan.  The facility reports that the potential for offsite public and environment impact exists.\n\nThe EPA requires facilities to plan for more realistic \"alternative-release\" scenarios.  The EPA characterizes an alternative release scenario as \"more likely to occur than the worst-case scenario\" and allows sites to include active and passive control/mitigation systems and more realistic weather conditions in the assumptions. \n\nThe sulfur dioxide and chlorine storage facilities are specifically designed to limit the release of the process chemicals.  The design includes both active and passive mitigation systems.  The passive mitigation systems include enclosures and sumps.  The active mitigation systems include sprinkler and scrubber systems.  The process controls used include alarms, gas leak detection systems, automatic/manual shut-off, and emergency power.  The facility defines the alternative case scenario for chlorine and sulfur dioxide as a flexible tubing leak"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000602,
      "SummaryText": " occurring inside a storage building with the consideration of active and passive mitigation systems.  Active and passive mitigation systems are design to contain or neutralize alternative scenario releases. The EPA developed model, RMP* Comp Version 1.07, was used to calculate endpoint distances as reported in the plan.  The facility reports that the potential for offsite public impact does not exist.  \n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\nWalnut Creek WWTP complies with The Design Criteria for Sewage Systems Rules issued by the Texas Commission on Environmental Quality (TCEQ).  The rules require the facility to construct, maintain, and operate the chemical facilities in accordance with OSHA, ASTM, ANSI, and ASME Standards.  These rules are intended to ensure safe operation of the facility.  \n\nThe Walnut Creek WWTP has established a comprehensive accidental release prevention program.  The prevention program is intended to assure that facility designs and procedures are reviewed and conform to safe design principles and practices.  The operations, maintenance, and training program elements assure that the processes are within the safe design and operating conditions.  Highly trained Hazmat technicians are on duty 24 hours per day to inspect, maintain, and operate the process chemical systems.  Operational, maintenance, and emergency response procedures are periodically reviewed and updated.  The facility has an established training program that consists of classroom, on-the-job, and demonstration training.  The facility has an established maintenance program that requires equipment identification, testing and inspections, preventative maintenance, training, and documentation.  This is accomplished with the assistance of maintenance management software.\n\nThe five-year history:\n\nThe facility has not had an accidental release of any regulated chemical (chlorine or sulfur dioxide) in the past five years.  No docume"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000602,
      "SummaryText": "nted offsite injuries or environmental impacts have occurred due to a chemical release in the 32 year history of the facility's operation. \n\nThe emergency response program:\n\nThe Walnut Creek WWTP has established an emergency response program which involves training of employees and a partnership arrangement with the Austin Fire Department Hazardous Materials (AFD HazMat) Team.  The Utility has spent considerable time, money, and effort to train every employee at the facility to respond to a chemical release.  All facility employees have received Hazardous Waste Operations and Emergency Response (HAZWOPER) awareness, operations, or technician level training.  Selected employees have received extensive training in emergency response from AFD HazMat instructors equal to that received by the HazMat Team.  In case of a hazardous chemical release, the facility operators would determine the severity of the situation and if warranted, would call the HazMat team to respond to the facility.  After an assessment of the situation has been made by AFD and facility personnel, a partnered response to alleviate the problem would be performed. This partnership makes the best use of the expertise of facility employees and HazMat team.  The Austin Office of Emergency Management would notify citizens via television and radio broadcast of the hazard.  \n\nPlanned changes to improve safety and security:\n\nThe Walnut Creek Wastewater Treatment Plant has recently completed modifications to the chlorine processes, which upgraded the safety systems in the chlorine storage buildings.  Security measures have been implemented and continue to be reevaluated for entire facility including process buildings.  The facility is continuously evaluating new safety systems, process control equipment, and procedures that would improve the safety of the employees, the public, and the environment."
    }
  ]
}