{
  "FacilityID": 1000090503,
  "FacilityName": "Central Region Cooperative - Fairfax Agronomy",
  "FacilityStr1": "48153 State HWY 19",
  "FacilityStr2": "PO Box E",
  "FacilityCity": "Fairfax",
  "FacilityState": "MN",
  "FacilityZipCode": "55332",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27129",
  "LEPC": null,
  "FacilityLatDecDegs": "44.5268955",
  "FacilityLongDecDegs": "-94.6987908",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.centralregioncoop.com",
  "FacilityEmailAddress": "traci.eisenmann@centralregioncoop.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Central Region Cooperative",
  "OperatorStr1": "48153 State HWY 19",
  "OperatorStr2": "PO BOX E",
  "OperatorCity": "Fairfax",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55332",
  "OperatorZipCodeExt": null,
  "RMPContact": "Butch Altmann",
  "RMPTitle": "Agronomy Manager",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000245228",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-10-09 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-11-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-11-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-11-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-11-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112830,
      "AltID": null,
      "FacilityID": 1000090503,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000114162,
          "ProcessID": 1000112830,
          "NAICSCode": "42459",
          "_desc": {
            "NAICS_CODE": "42459",
            "NAICS_DESCRIPTION": "Other Farm Product Raw Material Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000140992,
          "ProcessID": 1000112830,
          "ChemicalID": 56,
          "Quantity": 425000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000640992,
          "ProcessID": 1000112830,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090503,
      "SummaryText": "Executive Summary\n\n\n\nCentral Region Cooperative Fairfax Agronomy EPA ID: 1000 0024 5228\n\n48153 State Hwy 19 Fairfax MN 55332\n\nExecutive Summary _ Ammonia (Anhydrous)\n\n\n\nTHE ACCIDENT RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES FOR OUR FACILITY\n\n\n\nThis facility complies with the 1989 ANSI K61.1 \"Safety Requirements for the Storage and Handling of Anhydrous AMMONIA\". In addition, it is our policy to adhere to all applicable federal, state and local laws.\n\n\n\nOne of our company goals states, \"To provide for the safety and security of our employees, our customers, the general public and to be a good steward of the environment for which we serve\". To fulfill these goals, we enroll in regulatory management service that assists in the maintaining and administer comprehensive safety and environmental programs, procedures and training courses. We perform a thorough annual audit program and monitor facility compliance with the safety standards and overseen assistance with this specialty firm. The program consists of internal audit utilizing checklist survey forms that are reviewed regularly and updated as necessary to ensure all applicable federal, state and local regulations are covered. These checklists are used to measure regulatory compliance including those governing the safe handling and storage of anhydrous ammonia.\n\n\n\nProcedures require a timely response and correction of all recommendations resulting from these audit checklists.\n\n\n\nA \"Site Safety Coordinator\" is identified and used as an extension of the General Manager and management service personnel. For a \"hands on\" manager of the day to day safe working activities,\n\nmaintain the required regulatory recordkeeping, conduct monthly safety meetings, conduct employee training and act as the location's contact during the emergency incidents that are rehearsed biannually.\n\n\n\nA DESCRIPTION OF THE FACILITY AND REGULATED SUBSTANCES HANDLED\n\n\n\nThe facility is a wholesale farm supply and distribution center and as such"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090503,
      "SummaryText": " we store and distribute a wide variety of pesticides and fertilizers including anhydrous ammonia. Anhydrous Ammonia is received by truck, is handled and stored on-site and is regulated substance by the EPA requiring us to comply with this Risk Management Program. We sell Anhydrous Ammonia to growers in nurse tanks manufactured to the requirements to do such. The customer applies the ammonia into the soil as a needed source of nitrogen fertilizer for growing agricultural crops. Ammonia is also used for blending into mixed grade liquid fertilizers for crop production nutrients.\n\n\n\nOur facility maintains twenty five - 1450 gallon nurse tanks, and twenty five - double 1000 gallon nurse tanks. Our combined storage capacity in nurse tanks is 402,253 pounds. Anhydrous Ammonia is stored in 3 stationary tanks: two 30,000 gallon tank and one - 26,000 gallon tanks onsite. 401,087 pounds of Anhydrous Ammonia is the maximum storage capacity of the stationary storage tanks. Therefore, the total facility Anhydrous Ammonia storage capacity for this location is 413,912 pounds. The largest storage vessel at our facility contains 279,828 pounds.\n\n\n\nWORST CASE SENARIO\n\n\n\nOur worst case scenario is the loss of the total contents of all of the stationary storage tanks, when filled to the greatest amount allowed (85% capacity), released as a liquid over 10 minutes, resulting in total vaporization. The maximum quantity released would be 37,600 pounds per minute. According to RMP*Comp modeling, the distance to the endpoint (point of dispersion to 200 ppm) would have offsite impact. \n\n\n\nAnother worst case scenario is the loss of the total contents of one of the 30,000 gallon storage tank, when filled to the greatest amount allowed (85% capacity), released as a liquid over 10 minutes, resulting\n\nin total vaporization. The maximum quantity released would be 3,000 pounds per minute. According to RMP*Comp modeling, the distance to the endpoint (point of dispersion to 200 ppm) would have offsite"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090503,
      "SummaryText": "\n\nimpact. \n\n\n\nIt should be noted that our company has never had a total release of an entire storage tank.\n\n\n\n\n\nALTERNATE RELEASE SENARIO\n\n\n\nThe most common alternate release scenarios from an anhydrous ammonia storage facility would not reach an endpoint off-site. The alternate release scenario modeled for the purposes of this plan is a three - minute release from a stationary storage tank representing a hose failure requiring a manual shutdown. The total amount of anhydrous ammonia released in this scenario would be 3,000 pounds per minute. The distance to the endpoint would have an impact on the surrounding area within 1.0 miles. Depending on wind direction, speed, and response time. this could have immediate effects on the residential and industrial businesses of Fairfax. \n\n\n\nIt should be noted that our company has never had a total release of an entire storage tank.\n\n\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION\n\n\n\nThe ammonia storage system is designed, installed and maintained in accordance with ASTM standards and the ASME codes. This facility complies with the ANSI K61.1 standards (1989 Edition), OSHA - 29 CFR 1910.111, EPA's Accidental Release Prevention Rule as well as all applicable federal, state and local codes and regulations.\n\n\n\nOur ammonia system is protected from major releases by internal excess flow valves, check valves, relief valves, manual shutoffs and emergency shutoff valves. Load out risers used for the purpose of filling the nurse tanks are protected by excess flow valves and fill line breakaways to immediately stop the flow of ammonia it a line or hose would fail. All of the main storage tank valves and the riser load valves are locked when not in use. Lighting for the facility has been increased to discourage the increase of meth theft.\n\n\n\nOur anhydrous ammonia system is inspected on a regular basis with maintenance and preventative maintenance scheduled and documented. Liquid and vapor valves, hoses, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000090503,
      "SummaryText": "excess flow valves, gauges and relief valves are replaced when necessary and/or according to guidelines within the ANSI standards.\n\n\n\nTraining is provided to all employees at least annually, whenever there is a change in the process or whenever competency with the regulations is questioned. In accordance with the 1989 ANSI standards, training is offered for all ammonia customers on a regular basis and offered to the local fire department personnel during their annual tour of our facility and operations. These training courses consist of classroom lecture, current and approved videos or compact discs, testing, both verbally and/or written, demonstration and observation for each person working with the process that are certified while on-going job training is always improved upon.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no accidents involving anhydrous ammonia that has caused death, recordable injuries, property or environmental damage including evacuations on and off site.\n\n\n\nTHE EMERGENCY RESPONSE AND CONTINGENCY PLAN\n\n\n\nIn the event of an emergency involving our ammonia system, it is our policy to notify the local fire department and request that they respond to the emergency, with the facility's personnel assistance. In preparation for this, we have coordinated with all of the local response agencies by providing information and facility tours annually to ensure that they are familiar with and properly prepared for an incident at our facility. This will help to ensure that our community has the strategy for responding to and mitigating the threat posed by an anhydrous ammonia release. This complies with the requirement of our facility to be included in the community emergency response plan prepared under EPCRA and coordinated with our local LEPC.\n\n\n\nCERTIFICATION LETTER CERTIFICATION STATEMENT FOR PROGRAM LEVEL 2 PROCESS\n\n\n\nTo the best of the undersigned knowledge and belief formed after reasonable inquiry, the information submitted is true, accurate and "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000090503,
      "SummaryText": "complete.\n\n\n\nTraci Eisenmann\n\nSafety Manager Central Region Cooperative\n\nEPA Facility ID# 1000 0024 5228\n\n\n\nTHE FACILITY HAS:\n\nA. A WRITTEN EMERGENCY ACTION PLAN, IN ACCORDANCE WITH OSHA STANDARD, 29 CFR 1910.38;\n\nB. PROVIDED STATE AND LOCAL AUTHORITIES THE EMERGENCY PLANNING AND COMMUNITY RIGHT-TO-KNOW INFORMATION AS REQUIRED UNDER SARS TITLE III (EPCRA).\n\nC. COORDINATED WITH LOCAL EMERGENCY RESPONDERS. SAFETY IMPROVEMENT IS AN ON GOING PROCESS AT THE FACILITY. PERIODIC EVALUATIONS ARE PERFORMED TO ASSESS THE MAINTENANCE OF SAFE CONDITIONS. THERE ARE NO ADDITIONAL SPECIFIC ANHYDROUS AMMONIA SAFETY RECOMMENDATIONS FOR IMPLEMENTATION AT THIS TIME."
    }
  ]
}