{
  "FacilityID": 1000036956,
  "FacilityName": "Reddy Ice-Dallas (311)",
  "FacilityStr1": "4320 Duncanville Road",
  "FacilityStr2": null,
  "FacilityCity": "Dallas",
  "FacilityState": "TX",
  "FacilityZipCode": "75236",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.690113",
  "FacilityLongDecDegs": "-096.907277",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.reddyice.com",
  "FacilityEmailAddress": "information@reddyice.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Reddy Ice Corporation",
  "Company2Name": null,
  "CompanyDUNS": 364514133,
  "Company2DUNS": 364514133,
  "OperatorName": "Reddy Ice Corporation",
  "OperatorStr1": "5720 LBJ Freeway",
  "OperatorStr2": "Suite 200",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75240",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brandon Stevens",
  "RMPTitle": "Plant Manager",
  "FTE": 60,
  "OtherEPAFacilityID": "75236RDDYC4320D",
  "EPAFacilityID": "100000177989",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-03-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Dallas 5-yr Resubmittal (10/23/08)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-09-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-10-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-10-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-10-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.69098,
  "FRS_Long": -96.90848,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000045244,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000036956,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000045686,
          "ProcessID": 1000045244,
          "NAICSCode": "312113",
          "_desc": {
            "NAICS_CODE": "312113",
            "NAICS_DESCRIPTION": "Ice Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054708,
          "ProcessID": 1000045244,
          "ChemicalID": 56,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000554708,
          "ProcessID": 1000045244,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036956,
      "SummaryText": "PROCESS SUMMARY\n\nThe Reddy Ice-Dallas (311) facility manufactures packaged ice for wholesale/retail distribution.  The facility has a production capacity of approximately 850 tons of ice per day and utilizes anhydrous ammonia as a refrigerant for ice production and storage.  The facility is a state-of-the-art plant constructed in 2002.\n\n\n\nThe refrigeration system is a standard closed-loop design with two distinct refrigeration loops, the high stage/icemaker system and the low stage/freezer system.  The system has five screw compressors, four evaporative condensers, ten P-34A-XL-LOF Vogt ice machines, two recirculators, a thermosyphon vessel, a controlled pressure receiver vessel, nine evaporators and a water chiller.  A Programmable Logic Controller (PLC) monitors the system and controls the system operation.  In addition to the PLC, each of the compressors has numerous protective controls (motor overload, high discharge temperature, high discharge pressure, low suction pressure, and low oil pressure), which will shut down the compressor if operating limits are exceeded.  Pressure relief valves are installed on all pertinent equipment and are piped to discharge to a water-filled diffusion tank in the event of a release. \n\n\n\nThe facility has multiple safeguards pertinent to the anhydrous ammonia process.  These include emergency ventilation systems, controls that shut down the compressors if operating limits are exceeded, and the capability of shutting down the entire system remotely if required.  An ammonia detection and alarm system is installed to notify employees in the event of an ammonia leak.  \n\n\n\nAnhydrous ammonia, when properly used, has proven to be a safe and reliable refrigerant.  The sharp odor of ammonia provides its own warning agent.  Practically all accidents involving anhydrous ammonia can be avoided through the facility's program of proper employee training; knowledge of the equipment and procedures; and the development, maintenance, and implementa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036956,
      "SummaryText": "tion of effective operating and maintenance procedures for all ammonia equipment.\n\n\n\nThe company has developed an emergency response plan (\"ERP\") that includes procedures for notification of emergency authorities/agencies and the public, evacuation of personnel, and establishment, training, and outfitting of an emergency response and entry team for each shift.\n\n\n\nRISK MANAGEMENT PREVENTION PROGRAM 3\n\nBased on the Reddy Ice-Dallas facility's ammonia inventory, location, and requirement to meet OSHA PSM regulations, it has been determined the facility is subject to Accident Prevention Program 3 requirements.  This accident prevention program is a way to make safe operations and accident prevention systematic throughout the facility.  Reddy Ice Corporate Management and Reddy Ice-Dallas management are committed to operating a safe and compliant facility for the protection of its employees, the public, and the environment.  A combined Process Safety Management/Risk Management (\"PSM/RMP\") Program has been developed to meet the accidental release prevention requirements of EPA's Risk Management Program (40 CFR Part 68) and OSHA's Process Safety Management Standard (29 CFR 1910.119) regulations.  The combined PSM/RMP Program contains thirteen elements, establishing requirements for:  employee participation, safety information, hazard analysis, pre-startup safety review, operating procedures, training, management of change, mechanical integrity, hot work permits, contractors, incident investigation, compliance audits, and trade secrets.  These elements are tied together by a management system to ensure development, implementation, and integration of the Program requirements.\n\n\n\nMANAGEMENT SYSTEM\n\nA management system has been developed to oversee the implementation of the PSM/RMP Program elements.  The Market Manager has been identified as the \"PSM/RMP Program Coordinator,\" with overall responsibility for developing, implementing, and integrating the program requirements.  Un"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036956,
      "SummaryText": "der the PSM/RMP Program, various responsibilities have been assigned to other individuals.  The Operations Manager and Maintenance Lead are responsible for portions of the program closely tied to the refrigeration equipment and operation.  A safety committee with rotating membership meets each month to present a safety meeting and address any safety issues brought up by employees during the month.\n\n\n\nHAZARD ASSESSMENT\n\nAs required by the Risk Management Program (\"RMP\") regulations, the Reddy Ice-Dallas facility has conducted a hazard assessment including offsite consequence analyses (\"OCA\") for potential accidental releases of anhydrous ammonia.  The OCAs describe the potential offsite exposure to surrounding areas from an accidental release.  A worst-case release scenario and alternative release scenarios were calculated using the EPA RMP*Comp modeling program, and the potentially affected offsite population and facilities were identified. \n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Reddy Ice-Dallas facility has not had any releases that would require reporting as part of a five-year accident history.\n\n\n\nEMERGENCY PLANNING AND RESPONSE\n\nThe Reddy Ice-Dallas facility operates under an Emergency Response Plan (\"ERP\") that includes procedures for:  notifying the public and local emergency responders; emergency evacuation/response procedures; use of emergency alarms and equipment; employee training in evacuation and response procedures; annual training, medical exams, and equipment maintenance for in-house responders; first aid for ammonia exposure; and periodic review and updating of the emergency response plan.  Reddy Ice refrigeration employees are HAZWOPER trained and equipped to assist with entry and equipment control in the event of an ammonia release at the facility if needed.\n\n\n\nIn addition, the facility has coordinated emergency response activities with the Dallas County LEPC and the Dallas Fire Department, and has appropriate mechanisms in place to notify emergency r"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036956,
      "SummaryText": "esponders if needed.  The ammonia inventory is verified and reported annually to the state and local authorities, and the plant is incorporated into the community emergency response plan developed under 42USC.\n\n\n\nPLANNED CHANGES\n\nThe Reddy Ice-Dallas facility is a recently constructed state-of-the-art ice production facility.  No significant changes are planned to the facility or operations.  Reddy Ice facilities operate an ongoing program of preventive and predictive maintenance to identify and implement changes that may result in improved safety and operations.\n\n"
    }
  ]
}