{
  "FacilityID": 1000100002,
  "FacilityName": "Berkshire Refrigerated Warehousing, LLC",
  "FacilityStr1": "4550 South Packers Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Chicago",
  "FacilityState": "IL",
  "FacilityZipCode": "60609",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.812003",
  "FacilityLongDecDegs": "-087.658728",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "NA",
  "Company2Name": "NA",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ted Grzywacz",
  "OperatorStr1": "4550 South Packers Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60609",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ted Grzywacz",
  "RMPTitle": "President",
  "FTE": 62,
  "OtherEPAFacilityID": "None",
  "EPAFacilityID": "100000190722",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-09-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-02-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2022-02-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-02-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.4",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "200",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000123669,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000100002,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000125062,
          "ProcessID": 1000123669,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000154491,
          "ProcessID": 1000123669,
          "ChemicalID": 56,
          "Quantity": 15044.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000654491,
          "ProcessID": 1000123669,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000100002,
      "SummaryText": "- \n\nI.    Introduction\n\nA Risk Management Program has been implemented at the Berkshire Refrigerated Warehousing, LLC (Berkshire) facility located at 4550 South Packers Avenue in Chicago, Illinois, for the reduction of accidental releases of hazardous materials. This 5-year, updated Risk Management Plan (RMP) summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to site personnel, contractors, visitors, and the community and environment at large of hazardous chemical releases. The RMP is organized to correspond with specific U.S. Environmental Protection Agency (EPA) RMP, Program 3 of 40 CFR 68, definitions and requirements of Subpart G, including: \n\n?    Introduction;\n\n?    Berkshire policies to protect health, environment, and safety;\n\n?    Facility identification and regulated substances covered processes;\n\n?    Hazard Assessment;\n\n?    Prevention Program;\n\n?    Five-Year Accident History;\n\n?    Emergency Response Plan; \n\n?    Emergency Communications;\n\n?    Spill Reporting / Environmental Release Procedures;\n\n?    Planned changes to improve safety; and\n\n?    Management Program\n\n\n\nII.    Berkshire Refrigerated Warehousing, LLC Policies To Protect Health, Environment, and Safety\n\nRisk management and safety are important concerns at Berkshire; this RMP formalizes and documents these activities. Berkshire is committed to conducting its operations in a safe and responsible manner and to reducing risks to human health and to the environment. It is Berkshire policy to comply with all applicable federal, state, and local rules and regulations. \n\n\n\nThis RMP has identified potential hazards and has taken steps to design and maintain a safe facility in order to prevent releases, and minimize the consequences of accidental releases, which could occur. This RMP addresses potentially catastrophic chemical releases that could result in immediate harm and acute health effects to offsite receptors (public and environmental). Berkshire has developed a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000100002,
      "SummaryText": "n Emergency Action Plan that contains procedures designed to maximize the safety of all employees, contractors, and visitors in the event of an emergency and also guard against environmental consequences.\n\n\n\nIII.    Facility Identification\n\nThe Berkshire Refrigerated Warehousing facility is located at 4550 South Packers Avenue in Chicago, Illinois. The NAICS code for the facility is 49312 - Refrigerated Warehousing and Storage. \n\n\n\nThe facility uses ammonia for refrigeration, and is regulated under 40 CFR Part 68, the EPA RMP Rule. There is one (1) refrigeration system onsite that is used for cold storage. \n\n\n\nThe amount of ammonia currently present in the refrigeration system is approximately 15,000 pounds.  The refrigeration system is used to cool the blast freezers, holding freezer, convertible freezers, north and south freezer, shipping docks, and boxing room, ready-to-eat room. This system is a two stage system with three (3) low stage and two (2) high stage compressors.  Evaporators are fed with high pressure liquid from the receiver, through the low and high temperature recirculators.\n\n\n\nAn aerial photo identifying the site location is included as Appendix A. \n\n\n\nIV.    Hazard Assessment - Worst Case Scenarios (WCS)\n\nAppendix B consists of the RMP*Submit Printout and contains additional information on the worst-case scenario.  Appendix C consists of the offsite consequence analysis data and maps for the worst case release scenario. \n\n\n\nV.    Hazard Assessment - Alternative Release Scenarios (ARS)\n\nAppendix B consists of the RMP*Submit Printout and contains additional information on the alternative release scenario.  Appendix D consists of the offsite consequence analysis data and maps for the alternative release scenario. \n\n\n\n \n\nVI.    General Accidental Release Prevention Program\n\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the OSHA Process Safety Management (PSM) standard (29 CFR 1910.119) and the EPA Risk Man"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000100002,
      "SummaryText": "agement Program.   However, as discussed throughout this document Berkshire is continuously improving this program. \n\n\n\nThis prevention program covers those processes that handle ammonia above the threshold quantity for both PSM and RMP rules. The most recent audit of the PSM program was conducted on February 2-4, 2021, and the next audit will occur before February 4, 2024, in compliance with the requirement to conduct PSM audits every three years.  The elements of the PSM / Program 3 prevention program and a brief description are listed below.\n\n?    Employee Participation - Berkshire has developed a site-specific employee participation plan that ensures employees and their representatives are consulted when conducting and developing process hazard analyses and other information required to be developed under the PSM/RMP regulation.  In addition, the employee participation program will ensure employees and their representatives have access to process hazard analyses and all other information required to be developed under PSM/RMP.  \n\n?    Process Safety Information - Berkshire maintains a site-specific PSI program that ensures information pertaining to the hazards, technology, and equipment of the process are properly developed and maintained. \n\n?    Process Hazard Analysis - Berkshire has developed a site-specific PHA program that ensures a PHA is conducted initially, at a minimum of every five (5) years, and whenever a change is significant enough to require a change in PSI.  In addition, this program ensures PHAs are conducted in accordance with OSHA and EPA regulations and ensures findings and recommendations of PHAs are properly documented. Berkshire conducted a thorough PHA revalidation study for the ammonia refrigeration system on January 26, 27, and 28, 2022.\n\n?    Operating Procedures - Berkshire has updated a site-specific procedure that ensures operating procedures provide clear instruction for different phases of process operations and ensures they are properly main"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000100002,
      "SummaryText": "tained.  Berkshire developed initial operating procedures for the refrigeration system during December 2004. Operating procedures were most recently reviewed and certified on February 18, 2022.\n\n?    Training - Berkshire has developed a site-specific training procedure that ensures employees operating the ammonia process have the knowledge to safely operate the process, are aware of the potential hazards of the process, and understand the causes of process problems. However, refrigeration contractors are currently relied upon to operate and maintain the syste,\n\n \n\n?    Management of Change - Berkshire has developed a site-specific management of change procedure that ensures changes (except for replacement in kind) to the ammonia process, such as additions of new equipment or changes in operating, maintenance, or other procedures are documented. \n\n?    Pre-Startup Review - Berkshire has developed a site-specific pre-startup safety review procedure that ensures a safety review is performed when modifications to the ammonia process are significant enough to require a change in PSI.\n\n?    Mechanical Integrity - Berkshire has updated a site-specific mechanical integrity procedure that ensures written preventative maintenance procedures are developed and maintained, preventative maintenance tests and inspections are properly documented, and employees maintaining the process receive adequate training.  \n\n?    Contractor Qualifications - Berkshire has developed a site-specific contractor qualification procedure that ensures all contract employers' safety performance and programs are evaluated, a contract employee injury and illness log is maintained, information of potential hazards are communicated between Berkshire Refrigerated Warehousing and the contract employer, and required training and information is communicated, such as the provisions of the emergency action plan and control over entrance into process areas.\n\n?    Incident Investigation - Berkshire has developed a site-specific inc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000100002,
      "SummaryText": "ident investigation procedure that ensures each incident that either results in a release or could have resulted in a release of anhydrous ammonia is investigated, within 48 hours, by a team of at least one person knowledgeable in the process.  This procedure will also make provisions to ensure a report is prepared at the conclusion of the investigation and findings are promptly addressed. No ammonia releases have been reported within the past five (5) years.\n\n?    Compliance Audit - Berkshire has developed a site-specific compliance audit program that ensures compliance audits are conducted at a minimum of every three years to verify that Berkshire PSM/RMP practices and procedures are adequate and are being followed.  The two most recent compliance audits were completed February 2, 3, and 4, 2021.    \n\n?    Hot Work Permits - Berkshire has developed a best management practice for hot work.  \n\n \n\n\n\nVII.    Five-Year Accident History\n\nThe Berkshire facility has not had an accidental anhydrous ammonia release, which resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years. \n\n\n\nVIII.    Emergency Response Program\n\nBerkshire has developed an emergency action plan to ensure that in the event of an emergency the facility personnel are aware of the appropriate actions to take and authorities to contact in order to mitigate the effects of a release.  \n\n\n\nBerkshire has communicated and trained facility employees on proper evacuation procedures and has had interaction with the Chicago Fire Department HAZMAT Team.  \n\n\n\nBerkshire has coordinated their emergency action plan with the Cook County Local Emergency Planning Committee (LEPC) and the Chicago Fire Department.  This coordination effort includes providing each aforementioned agency with a copy of our emergency action plan, providing each with a site diagram and hazardous material information"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000100002,
      "SummaryText": ".\n\n\n\nAlthough Berkshire does not have an onsite hazardous materials response team, selected individuals have received HAZWOPER training through classroom instruction, on-the-job training, and drills.  The current HAZWOPER training includes the first responder awareness level, the first responder operations level, and hazardous materials technician training.  \n\n\n\nThe facility has one (1) windsock present onsite for use in determining wind direction in the event of an ammonia release and evacuation of the building.\n\n\n\nThe current Material Safety Data Sheet (MSDS) for anhydrous ammonia is included in Appendix E. \n\n\n\nIX.    Emergency Communications\n\nThe telephone numbers of agencies and plant personnel that may be contacted in case of an emergency are available onsite.\n\n \n\n\n\nX.    Planned Changes to Improve Safety\n\nChemical safety is an important part of Berkshire operations. Berkshire recently conducted a process hazard analysis (PHA) of their ammonia refrigeration system and will be dutifully implementing the recommendations from that PHA. Continuous improvement in safety is an important goal for Berkshire.  \n\n\n\nXI.    Management Program\n\nBerkshire has developed a management system to oversee the implementation of the risk management program elements.  This system has assigned qualified person(s) (or position) to assist in the development, implementation, and integration of the risk management program elements.  If any portion of the program is delegated to others, the names or positions of those individuals will be documented and the lines of authority defined through an organization chart or similar document.  Currently, Ted Grzywacz, President of Berkshire Refrigerated Warehousing, LLC is responsible for implementation of the overall Risk Management Program.\n\n  \n\n"
    }
  ]
}