{
  "FacilityID": 1000086832,
  "FacilityName": "ADM Corn Processing",
  "FacilityStr1": "1251 Beaver Channel Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Clinton",
  "FacilityState": "IA",
  "FacilityZipCode": "52732",
  "Facility4DigitZipExt": "5935",
  "FacilityCountyFIPS": "19045",
  "LEPC": "Clinton County LEPC",
  "FacilityLatDecDegs": "41.820611",
  "FacilityLongDecDegs": "-090.209611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G5",
  "LatLongDescription": "AS",
  "FacilityURL": "www.adm.com",
  "FacilityEmailAddress": "media@adm.com",
  "FacilityDUNS": 56484348,
  "ParentCompanyName": "Archer Daniels Midland Co.",
  "Company2Name": null,
  "CompanyDUNS": 1307586,
  "Company2DUNS": 0,
  "OperatorName": "ADM Corn Processing",
  "OperatorStr1": "1251 Beaver Channel Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Clinton",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52732",
  "OperatorZipCodeExt": "5935",
  "RMPContact": "Eric Fasnacht",
  "RMPTitle": "Plant Manager",
  "FTE": 760,
  "OtherEPAFacilityID": "52732DMCRN1251B",
  "EPAFacilityID": "100000137498",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "06-TV-007",
  "SafetyInspectionDate": "2015-11-16 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-05-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-05-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-05-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-05-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.81832,
  "FRS_Long": -90.21512,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000108352,
      "AltID": "Fuel Alcohol Denaturing",
      "FacilityID": 1000086832,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000109665,
          "ProcessID": 1000108352,
          "NAICSCode": "311221",
          "_desc": {
            "NAICS_CODE": "311221",
            "NAICS_DESCRIPTION": "Wet Corn Milling"
          }
        },
        {
          "Process_NAICS_ID": 1000109666,
          "ProcessID": 1000108352,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000135461,
          "ProcessID": 1000108352,
          "ChemicalID": 125,
          "Quantity": 111846.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000635461,
          "ProcessID": 1000108352,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000108353,
      "AltID": "Anhydrous Ammonia System",
      "FacilityID": 1000086832,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000109667,
          "ProcessID": 1000108353,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000135462,
          "ProcessID": 1000108353,
          "ChemicalID": 56,
          "Quantity": 391000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000635462,
          "ProcessID": 1000108353,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000086832,
      "SummaryText": "ADM - Clinton\n\nRMP Executive Summary \n\n\n\n\n\nA. The accidental release prevention and emergency response policies\n\n\n\nIt is the policy of the Archer Daniels Midland Company (ADM) complex in Clinton, Iowa to implement the requirements of the Risk Management Program (RMP) in accordance with USEPA regulations under 40 CFR Part 68.  The objectives are to minimize the risk of a RMP chemical release, and if a release occurs, to minimize the potential impact to ADM's employees, the public and the environment.  These objectives will be accomplished by utilizing general good operating procedures, maintaining a preventive maintenance program, providing appropriate training to all employees, and coordinating response activities, as necessary with the Clinton Fire Department, the local emergency response providers.\n\n\n\nEmergency response for this facility is coordinated with the Clinton County Emergency Management Agency, which is the Local Emergency Planning Committee (LEPC) and the Clinton Fire Department.  Emergency response procedures at this facility include notification of the LEPC in the event of an accident involving denaturant with emergency response provided by the Clinton Fire Department with support by the Davenport Fire Department.  \n\n\n\nB. The Stationary Source and the Regulated Substances Handled \n\n\n\nThe ADM-Clinton complex is comprised of a corn wet milling processing plant (Corn Plant), a cogeneration facility (Cogen), and a bioprocessing facility (BioProcessing).  The Corn Plant processes corn into products such as corn sweeteners, fuel and beverage ethanol, corn oil and dry specialty starches.  The Corn Plant is supported with steam and electricity produced by the adjacent coal and natural gas-fired Cogen facility.  Starches from the Corn Plant and steam and electricity from Cogen are used at the BioProcessing facility.  The three facilities are considered one stationary source as defined in 40 CFR 68.3:\n\n\n\n\"... any buildings, structures, equipment, installations,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000086832,
      "SummaryText": " or substance emitting stationary activities which belong to the same industrial group, which are located on one or more contiguous properties, which are under the control of the same person (or persons under common control), and from which an accidental release may occur. A stationary source includes transportation containers that are no longer under active shipping papers and transportation containers that are connected to equipment at the stationary source for the purposes of temporary storage, loading, or unloading.\"\n\n\n\nPreviously, the three facilities had been managed as two facilities under RMP, with Cogen and Bioprocessing managed as one facility because they shared the use of the anhydrous ammonia system. \n\n\n\nAnhydrous Ammonia\n\n\n\nCogen and Bioprocessing share use of an anhydrous ammonia system. The Cogen facility utilizes anhydrous ammonia for purposes of boiler NOx emissions control and BioProcessing utilizes anhydrous ammonia as a feedstock for a fermentation process.\n\n\n\nAnhydrous ammonia is a substance regulated under 40 CFR 68.130 with a listed threshold quantity of 10,000 lbs.  It is stored in two 40,000 gallon tanks at Cogen with a density of 5.75 lb/gal and operated at a maximum capacity of 85%.  This equals a quantity of 391,000 lbs. in the process, which exceeds the threshold quantity.  ADM defines the ammonia \"process\" as all storage tanks, piping systems, and unloading facilities associated with anhydrous ammonia.\n\n\n\nFuel Alcohol Denaturant\n\n\n\nThe Corn Plant is a wet milling processing plant which processes corn into products such as corn sweeteners, fuel and beverage ethanol, corn oil, and dry specialty starches. During the production of fuel alcohol, natural gasoline is used as a denaturant.\n\n\n\nThe denaturant used at ADM may contain three regulated RMP chemicals: n-pentane (up to 30%), isopentane (up to 30%), and n-butane (up to 5%). It is stored in two 36,000 gallon internal floating roof tanks each having a diameter of 16 feet.  The denaturant"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000086832,
      "SummaryText": " specific gravity is 0.65 to 0.75. Given this volume, all three components exceed the covered process planning threshold.\n\n\n\nDenaturant from these tanks is blended with approximately 200 proof ethanol, along with a small amount of rust inhibitor, to form denatured fuel ethanol (CDA). CDA is stored in three 4,000,000 gallon tanks each having a diameter of 120 feet.  The concentration of denaturant plus inhibitor can be no more than 2.5%, with the balance being at least 97.5% ethanol; therefore, the concentration of individual RMP-covered components in CDA are:\n\n\n\n?        N-pentane: up to 0.75%\n\n?        Isopentane: up to 0.75%\n\n?        N-butane: up to 0.13%\n\n\n\nPer the ADM Fuel Ethanol SDS, the flammability of CDA is NFPA 3, the flashpoint is -5?F, and the boiling point is 165?F.  The mixture does not meet the flammability criteria (NFPA 4) for an RMP-covered flammable mixture.  As such, ADM considers the fuel ethanol denaturant \"process\" to end with the blending to produce CDA.\n\n\n\nC. Accidental Release Prevention:\n\nThe key concepts in this facility's prevention program are the elements of OSHA's PSM Program which include Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Mechanical Integrity, Management of Change, Compliance Audits, Incident Investigation, Employee Participation, and Contractors.\n\n\n\nD. Five-Year Accident History:\n\n\n\nThis facility has not had any accidents involving denaturant or anhydrous ammonia that requires reporting under EPA's Risk Management Rules.\n\n\n\nE. Emergency Response Program:\n\n\n\nThis facility has an Emergency Response Program and Emergency Response Plan for responding to accidental releases of hazardous substances.  As part of this program, ADM has personnel trained to the First Responder Awareness Level who can identify the released materials and activate the Plant Emergency Operations Plan, and First Responder Operations Level who can isolate the spill area, control access to the areas, and initiate c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000086832,
      "SummaryText": "ontainment activities under the direction of the Operations Officer.  Hazardous Waste clean-up activities are handled primarily by spill contractors.\n\n\n\nClinton County has a Local Emergency Planning Committee (LEPC) which has developed a county-wide emergency response plan that involves local industry, the fire departments, police departments, ambulance services, hospitals, the health department, the county highway department, local streets and sanitation department, and other local government agencies.  The plan organizes county-wide response to emergencies.\n\n\n\nF. Planned Changes to Improve Safety\n\n\n\nADM is continually evaluating options for improving processes and efficiencies in order to reduce the quantities of hazardous materials used and stored at its facilities.  In addition, ADM continually evaluates options at its facilities for replacing hazardous material with less hazardous materials or non-hazardous materials.\n\n\n\nAmmonia\n\n\n\nAs a result of a safety review of this facility's anhydrous ammonia system it has been determined that no changes are required to be made to the systems at this time.  All changes recommended in the most recent hazard analysis have been implemented.\n\n\n\nDenaturant\n\n\n\nAs a result of a safety review of this facility's fuel alcohol system it has been determined that no changes are required to be made to the systems at this time.  All changes recommended in the most recent hazard analysis have been implemented.\n\n\n\n"
    }
  ]
}