{
  "FacilityID": 1000089622,
  "FacilityName": "Sherrod Compressor Station",
  "FacilityStr1": "8 Miles Southeast of Midkiff CR-101",
  "FacilityStr2": null,
  "FacilityCity": "Big Lake",
  "FacilityState": "TX",
  "FacilityZipCode": "76932",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48383",
  "LEPC": "Reagan County LEPC",
  "FacilityLatDecDegs": "31.51961",
  "FacilityLongDecDegs": "-101.75403",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.xtoenergy.com",
  "FacilityEmailAddress": "jason_morden@xtoenergy.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "XTO Energy  Inc",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "XTO Energy, Inc",
  "OperatorStr1": "22777 Springwoods Village Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Spring",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77389",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000245237",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-09-30 12:11:46",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-09-30 12:11:46",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-09-30 12:11:46",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-09-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000111791,
      "AltID": "Natural Gas Compression",
      "FacilityID": 1000089622,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000139758,
          "ProcessID": 1000111791,
          "ChemicalID": 155,
          "Quantity": 233860.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000123300,
              "ProcessChemicalID": 1000139758,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000123301,
              "ProcessChemicalID": 1000139758,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000123302,
              "ProcessChemicalID": 1000139758,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000123299,
              "ProcessChemicalID": 1000139758,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000123228,
              "ProcessChemicalID": 1000139758,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000123229,
              "ProcessChemicalID": 1000139758,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000123230,
              "ProcessChemicalID": 1000139758,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000113103,
          "ProcessID": 1000111791,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000089622,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Reagan County LEPC",
    "CoordinatingAgencyPhone": "3258842665",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089622,
      "SummaryText": "variety of technical documents that are used to help maintain safe operation of the Site's processes. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design\t\r\nbasis/configuration information. Employees at the Site are active in the development and\tmaintenance of up-to-date process safety information. Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety\t\r\ndata sheets (SDSs). This information is supplemented by documents that specifically address known concerns. For specific operations areas, the Site has documented safety-related limits for specific process parameters, such as temperature, level, and composition. The Site ensures that each\t\r\nprocess is maintained within approved limits using process controls and monitoring instruments,\ttrained personnel, and automated shutdown systems.\r\n\t\r\nThe Site also maintains technical documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in\t\r\ncombination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and Site changes to ensure that safety features in the process are not compromised.\r\n\t\r\nOperations at the Site have hazards that are managed to ensure continued safe operation. The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the location.\r\n\t\r\nEMERGENCY RESPONSE PROGRAM:\r\n\t\r\nThe Site maintains a written emergency response program, which is in place to protect worker and public safety, as well as to protect the environment. The program consists of procedures for contacti"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089622,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES:\r\n\t\r\nXTO Energy, Inc.(XTO) has a strong commitment to the protection of workers and the environment. The Sherrod Compressor Station site has an active safety program covering both employees and contract workers. This program encompasses promotion of safe work practices to prevent personal accidents, and incidents that would adversely affect the community. \r\n\r\nXTO recognizes their commitment to accident prevention through continuing programs including personnel training. Consideration is also given to safety in the design, installation, and operation of natural gas production and gathering systems and modifications to the Site. The safety commitment is also carried forth as evidenced by an aggressive maintenance program. \r\n\r\nReasonable controls have been implemented to prevent foreseeable releases of regulated substances. In the unlikely event that a release does occur, arrangements have been made within the local community to provide response and control of any catastrophic releases. Passive mitigation, such as vents, is present at the site to manage any overpressure conditions that may occur.\r\n\t\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES:\t\r\n\r\nThe facility is located off CR 101 From Midkiff, Texas, drive east on FM 2401 for 6 miles to FM 1357. Turn south and drive 8 Miles to Byrd Road.  Turn West and drive 3 miles to CR 101. Drive South for approximately 0.5-1Mile and the station is on the right in Reagan County Texas. \r\n\r\nInherent with the operation of an oil and gathering and stabilization process, the process stores regulated flammable substances above the threshold quantity. These flammable substances are addressed throughout the RMP, and may include Methane, Ethane, Propane, Butane, Isobutane, Pentane and Isopentane which are all components of the Natural Gas Liquids Product(NGLP).\r\n\t\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\r\n\t\r\nXTO maintains a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089622,
      "SummaryText": "ng responders for mitigation of a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address aspects of emergency response by outside experts and include proper first aid and medical\t\r\ntreatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs,and post incident cleanup and any decontamination requirements. Employees receive appropriate training in\t\r\nprocedures necessary to perform their specific emergency response duties which includes contacting trained responders. The emergency response program is updated when necessary based\ton modifications made to Site processes or other facilities within the Site.\t\r\n\r\nThe overall emergency response program for the Site is coordinated with the Reagan Emergency Planning Committee (LEPC). This coordination includes periodic meetings, which include local emergency response officials, and local government officials. The Site contacts local\t\r\nemergency responders annually with regard to the hazards of regulated substances at the Site.\tXTO has implemented an Emergency Response Plan (ERP), elements of which overlap those of the\t\r\nRMP. \r\n\r\nThe ERP provides the following information:\r\n\r\nProcedures for informing the public and offsite emergency response officials of a release.\tThe individuals and groups contacted, the means by which they will be contacted, the time frame for notification, and the information that will be provided is included in the ERP.\t\r\n\t\r\nThe proper procedures for first aid and medical treatment for employees, first responders, and members of the public exposed to a release. Safety precautions for injured parties and detailed information for medical professionals.\t\r\n\t\r\nInformation regarding who is likely responsible for providing appropriate treatment (e.g.an employee, an employee with specialized training"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089622,
      "SummaryText": ", or a medical professional).\t\r\n\t\r\nProcedures for emergency response in the event of a release of a regulated substance, including descriptions of actions to be taken by employees and other individuals onsite over the course of the\trelease event such as:\t\r\n\t\r\nActivation of alarm systems and interpretation of signals. \r\n\r\nSafe evacuation, assembly and return.\t\r\n\t\r\nSelection of response strategies and incident command structure.\t\r\n\t\r\nUse of response equipment and other release mitigation activities.\t\r\n\t\r\nPost-release equipment and personnel cleanup and decontamination.\t\r\n\t\r\nPLANNED CHANGES TO IMPROVE SAFETY:\r\n\t\r\nNo changes are currently proposed for the Site. In the event a change is identified that would improve safety, that change will be implemented upon management approval and directive.\t\r\n\r\nIncident Investigation:\r\n\t\r\nThe Site has had no incidents, to date, that would require an accident investigation. However, there is a system in place to investigate any incident that could result, or could reasonably result in, a\t\r\nfire/explosion, flammable gas release, major property damage, environmental loss, or personal\tinjury. The goal of an investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to management for resolution. Corrective actions potentially taken in response to the investigation team's findings and recommendations will be tracked until they are complete. The final resolution of each finding or recommendation will be documented, and the investigation results reviewed with all\temployees and contractors who could be affected by the findings."
    }
  ]
}