{
  "FacilityID": 1000095104,
  "FacilityName": "Priority Cooling",
  "FacilityStr1": "4899 East Gila Ridge Road",
  "FacilityStr2": null,
  "FacilityCity": "Yuma",
  "FacilityState": "AZ",
  "FacilityZipCode": "85365",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04027",
  "LEPC": "Yuma County LEPC",
  "FacilityLatDecDegs": "32.677046",
  "FacilityLongDecDegs": "-114.547977",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Mann Packing Co.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Priority Cooling, LLC",
  "OperatorStr1": "4899 East Gila Ridge Road",
  "OperatorStr2": null,
  "OperatorCity": "Yuma",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85365",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000178167",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-07-19 00:00:00",
  "SafetyInspectionBy": "Cypress Engineering Group (Consultant)",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "5yr Update 2/2009; Original 2002",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-08-09 15:03:52",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-08-09 15:03:52",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-08-09 15:03:52",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-08-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 32.677046,
  "FRS_Long": -114.547977,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000118051,
      "AltID": "Ammonia Ref. System-1",
      "FacilityID": 1000095104,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000147635,
          "ProcessID": 1000118051,
          "ChemicalID": 56,
          "Quantity": 13500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000119384,
          "ProcessID": 1000118051,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000101120,
              "Process_NAICS_ID": 1000119384,
              "SafetyReviewDate": "2021-03-17 00:00:00",
              "PHA_Date": "2023-04-03 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-07-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Operator error, no flow, low level, lack of maintenance, design deficiency, physical damage, vandalism/terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Plate frame with surge drum and submerged chiller installation.",
              "OpProceduresReviewDate": "2021-07-12 00:00:00",
              "TrainingReviewDate": "2021-07-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-07-12 00:00:00",
              "EquipmentInspectionDate": "2021-03-17 00:00:00",
              "EquipmentTested": "all refrigeration equipment",
              "ChangeMgmtDate": "2017-09-12 00:00:00",
              "ChangeMgmtReviewDate": "2021-07-12 00:00:00",
              "PreStartupReviewDate": "2020-11-02 00:00:00",
              "ComplianceAuditDate": "2021-07-19 00:00:00",
              "AuditCompletionDate": "2022-11-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-07-12 00:00:00",
              "HotWorkPermitReviewDate": "2021-07-12 00:00:00",
              "ContractorSafetyReviewDate": "2021-07-12 00:00:00",
              "ContractorSafetyEvalDate": "2021-07-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000126980,
                  "PreventionProgram3ID": 1000101120,
                  "ProcessChemicalID": 1000147635
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000095104,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-07-12 00:00:00",
    "ERTrainingDate": "2020-11-03 00:00:00",
    "CoordinatingAgencyName": "Yuma Cty. Office of Emergency Mgmt",
    "CoordinatingAgencyPhone": "9283731093",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000095104,
      "SummaryText": "rooms and two (2) shipping docks. \r\nThe total quantity of ammonia currently at the site is approximately 27,000 lb. Public receptors are located within the worst-case and alternative-release accidental release toxic endpoint area.\r\nThe compressors have safety switches that will shut down the compressor upon detection of unsafe operating conditions. All pressure vessels and the compressors are protected against high-pressure situations by safety relief valves. All low side vessels that are connected directly to the suction of compressor is installed with high level float switches that shuts down compressor upon detection of high liquid level in the vessel. All cold storage rooms are installed with ammonia sensors that triggers an alarm upon detection of ammonia vapor at 10 ppm. Ammonia detection system does not have an audible-visual alarm, when triggered, notifies only the maintenance personnel. Refrigeration machinery rooms are not furnished with ammonia sensors. There are two (2) exhaust fans installed in the engine room-1, and one exhaust fan in the engine room-2.\r\nRefrigeration system drawings are located in RMP Binder Chapter 8 Appendix 8.1. International Institute of Ammonia Refrigeration (IIAR) Ammonia Refrigeration Safety Inspection Checklists, located in RMP Binder Appendix 12.1, describe equipment details.\r\nThe ammonia refrigeration system at this facility is a single-stage vapor compression cycle. In general, the process chemistry is described in RMP Binder Chapter 8 Safety Information.\r\nAnhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000095104,
      "SummaryText": "rteen (13) evaporator fan coils, one (1) plate frame heat exchanger, one (1) submerged heat exchanger, and miscellaneous equipment like oil pots and oil separators. Portable equipment composed of three (3) vacuum tubes. Two of the vacuum tubes removed from the site during off season, while the other (Priority Cooling Tube) stays on site all year. Ammonia charge of the Refrigeration System 1 is approximately 13,500 lbs.\r\nRefrigeration System 2 is composed of both fixed and portable equipment. The fixed equipment is composed of two (2) screw compressors, one (1) high-pressure receiver, one (1) low-pressure receiver, two (2) ammonia pumps, one (1) evaporative condenser, eight (8) evaporator fan coils, and miscellaneous equipment like oil pots and oil separators. Portable equipment composed of one (1) vacuum tube (T-60), which is removed from the site during off season. Ammonia charge of the Refrigeration System 2 is approximately 8,500 lbs.\r\nFacility has one standalone vacuum trailer system composed of one full car vacuum tube (T-59), refrigeration trailer and vacuum pump and one standalone Ice Generator Trailer (IG-1). Both of these systems are pumped down to on site nurse tanks and removed from the site at the end of the season. Ammonia charge of the Vacuum Cooling System (T-59) is approximately 3,800 lbs and the Ice Generator Trailer charge is 1,200 lbs.\r\nThe facility operates seasonally from November through March. The facility pumps down all the ammonia in the system to the two (2) high-pressure receivers and two (2) nurse tanks located at the southeast corner of the facility during the off season.   The facility has two (2) mechanical rooms that house the refrigeration compressors. All vessels in System 1 are located at the outdoor vessel area. LPR-2 (System 2) Is located in the Engine Room 2. Condensers EC-1 and EC-2 are located on the Engine Room 1 Roof. EC-3 and HPR-2 are located on the Engine Room 2 roof. The evaporator fan coils are located in four (4) cold"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000095104,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policy\r\nPriority Cooling conducts inspection procedures to review refrigeration equipment prior to startup and during operations. These procedures identify potential sources of release and equipment corrections required to prevent these releases. On-site personnel and certified refrigeration contractors review the equipment as required. On-site personnel provide initial emergency response. On-site personnel will make a preliminary assessment in the event of a release and will provide first response. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an off-site release. No emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel. Local fire and police departments with mutual aid response will provide emergency response for a major release event. Refrigeration contractors would also be on-call to provide emergency response.Emergency response training will be conducted yearly for current employees and as required to for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\r\n\r\n2. Description of Source and Substance Handled\r\nPriority Cooling uses anhydrous ammonia as a refrigerant in their operations. The ammonia system is used for room cooling, vacuum cooling, ice making, and water chilling operations. Drawings in RMP Binder Chapter 8 - Appendix 8.1 show the facility location map, site plan, and refrigeration system layout.\r\nThere are four separate refrigeration systems at the facility. Refrigeration System 1 is composed of both fixed and portable equipment. The fixed system is composed of six (6) reciprocating compressors, one (1) screw compressor, one (1) high-pressure receiver, one (1) low-pressure receiver, one (1) suction accumulator, two (2) ammonia pumps, five (5) surge drums, two (2) evaporative condensers, thi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000095104,
      "SummaryText": "in and serious skin burn. See RMP Binder Chapter 8 Appendix 8.4 for Safety Data Sheets (SDS) for anhydrous ammonia.\r\n\r\n3. Accidental Release Prevention Program\r\nPriority Cooling maintains a release prevention program to eliminate or minimize releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases for ways to prevent future releases, that are included in RMP Binder Chapter 16 - Incident Investigation.\r\nThe ammonia refrigeration system has specific safety procedures to prevent a release. Operators and mechanics are trained for safe operation of the refrigeration system. Maintenance is done by the qualified refrigeration contractor (Hasler Refrigeration). They are also trained in emergency action procedures in the event of an ammonia release. \r\nThere is no emergency shut-off switch/panel outside the refrigeration machinery rooms for shutting down the system. Ammonia detectors are installed in the cold rooms. There is no audible-visual alarm connected to the ammonia detectors. When triggered, the system sends notification only to the maintenance personnel. Monitoring is done 24 hours per day. All of the relief valves, except the PRVs of the surge drum of the water chiller located in the Cold Room-A, at the facility are tied into an ammonia diffusion tank to prevent high-pressure releases to ambient. The water chiller surge drum PRVs release to the atmosphere at the roof of the room.\r\n\r\n4. Five-Year Accident History\r\nAccording to Priority Cooling personnel, there has been no releases of anhydrous ammonia in the last 5 years.\r\n\r\n5. Emergency Response Program\r\nIn event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures. The Emergency Coordinator is responsible in coordinating emergency response and will be contacting emergency response agencies, schools, daycare centers, and acute care"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000095104,
      "SummaryText": "facilities that may be affected by the release. The Emergency Coordinator will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if off-site evacuations are required. A description of the emergency action plan is included in RMP Binder Chapter 20.\r\n\r\n6. Planned Changes to Improve Safety\r\nRecommended corrective actions to mitigate the potential for an accidental ammonia release are proposed on the tables located in RMP Binder Chapter 00. The table items result from recommendations made during the Process Hazard Analysis, a Code Compliance Review, Seismic Review, and a Safety Inspection performed by a qualified person. Some recommendation items in the recommendation table originate from multiple codes/sections but are listed only once. Based on the severity of the hazards identified, priority level and implementation deadlines are also recommended.\r\nAll refrigeration equipment is well maintained and operated in a safe manner by trained personnel & qualified contractors. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation."
    }
  ]
}