{
  "FacilityID": 1000088569,
  "FacilityName": "Americold - Russellville 324",
  "FacilityStr1": "500 State Road 324 South",
  "FacilityStr2": "P.O. Box 11300",
  "FacilityCity": "Russellville",
  "FacilityState": "AR",
  "FacilityZipCode": "72812",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05115",
  "LEPC": "Pope County LEPC",
  "FacilityLatDecDegs": "35.271808",
  "FacilityLongDecDegs": "-93.093491",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.Americold.com",
  "FacilityEmailAddress": "Sheldon.Baptiste@Americold.com",
  "FacilityDUNS": 181055658,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Americold",
  "OperatorStr1": "10 Glenlake Parkway, Suite 800",
  "OperatorStr2": "Suite 406",
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30328",
  "OperatorZipCodeExt": null,
  "RMPContact": "Sheldon Baptiste",
  "RMPTitle": "SR. Regional PSM Manager",
  "FTE": 53,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000104317",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-02-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-07-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-07-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-07-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.2786,
  "FRS_Long": -93.1388,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110217,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000088569,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000111489,
          "ProcessID": 1000110217,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000137599,
          "ProcessID": 1000110217,
          "ChemicalID": 56,
          "Quantity": 44612.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000637599,
          "ProcessID": 1000110217,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000088569,
      "SummaryText": "  \n\nRISK MANAGEMENT PLAN AND DATA ELEMENTS\n\n\n\nThe following subsections outline the Executive Summary requirements of the EPA's 40 CFR Part 68.155.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe Americold, Russellville 324 facility abides by the emergency action procedures and policies detailed in the Emergency Response and Action Plan manual. \n\n\n\nThis Plan was designed to meet the following objectives:\n\n?    To save lives.\n\n?    To minimize and avoid injuries.\n\n?    To protect the environment.\n\n?    To minimize property damage.\n\n\n\nAmericold maintains a safety committee whose members are the designated emergency coordinators for the facility. The Plan provides the response organization and notification procedures, evacuation routes,\n\nammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility. This Plan is reviewed and updated at least once per year.\n\n\n\nThis Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Americold, Russellville 324 facility chills and stores a variety of food products in their cold storage warehouse. The refrigeration process, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cold storage rooms. Changes in pressures are directly related to changes in temperature. For example, lowering the ammonia pressure lowers its temperature. Low pressure (cold) liquid ammonia provides refrigeration by removing ambient heat. Removal of ambient heat causes the liquid ammonia (contained within the system) to vaporize. Heat is later removed from the ammonia as it is condensed back into a liquid. Typical operating conditions r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000088569,
      "SummaryText": "ange from vacuum (approximately 6\" Hg) on the low pressure side of the system to 150-160 psig on the high side.\n\nAnhydrous ammonia (CAS #7664-41-7) is used as the refrigerant in the refrigeration process. The total ammonia inventory is above the Threshold Quantity for Accidental Release Prevention.\n\n\n\nHAZARD ASSESSMENT SUMMARY\n\n?    Worst Case Release Result Summary\n\n?    Alternative Release Result Summary\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n\n\n?    ANSI/IIAR Standard 1-2017 American National Standard for Definitions and Terminology Used in IIAR Standards\n\n?    ANSI/IIAR Standard 2-2014 Addendum A (2019) American National Standard for Safe Design of Closed-Circuit Ammonia Refrigeration System\n\n?    ANSI/IIAR Standard 3-2017 American National Standard for Ammonia Refrigeration Valves\n\n?    ANSI/IIAR Standard 4-2015 American National Standard for Installation of Closed-Circuit Ammonia Refrigeration Systems\n\n?    ANSI/IIAR Standard 5-2019 American National Standard for Startup of Closed-Circuit Ammonia Refrigeration Systems\n\n?    ANSI/IIAR Standard 6-2019 American National Standard for Inspecting, Testing, and Maintenance of Safe Closed-Circuit Ammonia Refrigeration Systems\n\n?    ANSI/IIAR Standard 7-2019 American National Standard for Developing Operating Procedures for Closed-Circuit Ammonia Refrigeration Systems\n\n?    ANSI/IIAR Standard 8-2015 American National Standard for Decommissioning of Closed-Circuit Ammonia Refrigeration Systems\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no RMP reportable releases of ammonia at this facility over the last five years.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Americold, Russellville 324 324 facility has an Emergency Action Program in place. The facility has personnel that are trained to First Responder Operations Level on an annual basis, all are fit tested an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000088569,
      "SummaryText": "d respiratory trained annually.\n\nDuring the RMP Development Review, it was recommended that the facility conduct annual evacuation drills to ensure all employees understand the emergency response procedures. In addition, it was recommended\n\nthat the facility contacts the local Fire Department regarding participation in the evacuation drills.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nDuring the Review of the Process Safety Management program at this facility, the Process Hazard Analysis study generated mitigation measures that would improve safety at the Americold, Americold, Russellville 324 324 facility located at 500 State Road 324 South, Russellville 324 72812. These action items were entered into APSM which generates a tracking document that provides reminder communications via e-mails if the recommendation(s) are open pass its due date.\n\n\n\nOn an annual basis the technicians at the site complete annual visual inspections of each major piece of equipment. All gaps are documented in APSM which generates a tracking document that provides reminder communications via e-mails if the recommendation(s) are open pass its due date.\n\n\n\nIn addition to the annual visual inspections the site utilizes a third party to perform the 5-year comprehensive Mechanical Integrity Inspection and a Non Destructive test to determine the condition of the insulation and the quantity of wall loss for selected pipe locations and vessels. The recommendations from this major Inspection are loaded to APSM which generates a tracking document that provides reminder communications via e-mails if the recommendation(s) are open pass its due date.\n\n"
    }
  ]
}