{
  "FacilityID": 1000066598,
  "FacilityName": "Niteo Products, LLC.",
  "FacilityStr1": "720 Vaiden Drive",
  "FacilityStr2": null,
  "FacilityCity": "Hernando",
  "FacilityState": "MS",
  "FacilityZipCode": "38632",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28033",
  "LEPC": "Desoto County LEPC",
  "FacilityLatDecDegs": "34.815833",
  "FacilityLongDecDegs": "-089.976389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.highlander-partners.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79820313,
  "ParentCompanyName": "Highlander Partners Chemicals, LLC.",
  "Company2Name": null,
  "CompanyDUNS": 79819568,
  "Company2DUNS": null,
  "OperatorName": "Niteo Products, LLC.",
  "OperatorStr1": "720 Vaiden Drive",
  "OperatorStr2": null,
  "OperatorCity": "Hernando",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "38632",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": "MSD982770547",
  "EPAFacilityID": "100000086783",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-08-05 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Starting Fluid Process",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-10-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-10-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-10-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-10-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.815294,
  "FRS_Long": -89.976969,
  "FRS_Description": null,
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA OFF)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R02",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000083494,
      "AltID": "STARTING FLUID MFG.",
      "FacilityID": 1000066598,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000104162,
          "ProcessID": 1000083494,
          "ChemicalID": 92,
          "Quantity": 370000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000084696,
          "ProcessID": 1000083494,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000070372,
              "Process_NAICS_ID": 1000084696,
              "SafetyReviewDate": "2015-03-27 00:00:00",
              "PHA_Date": "2013-06-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-11-25 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Human errors, sources of ignition",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Nitrogen blanket system, level instrumentation, electrical classifcation",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Monitor nozzles",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "tank farm inspections, LEL detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-08-02 00:00:00",
              "TrainingReviewDate": "2016-12-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "computer-based interactive",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Buddy system",
              "MaintenanceReviewDate": "2016-09-01 00:00:00",
              "EquipmentInspectionDate": "2017-10-10 00:00:00",
              "EquipmentTested": "LEL detectors in the tank farm",
              "ChangeMgmtDate": "2017-03-09 00:00:00",
              "ChangeMgmtReviewDate": "2015-12-08 00:00:00",
              "PreStartupReviewDate": "2016-03-10 00:00:00",
              "ComplianceAuditDate": "2015-03-27 00:00:00",
              "AuditCompletionDate": "2015-06-15 00:00:00",
              "IncidentInvestigationDate": "2017-08-08 00:00:00",
              "InvestigationChangeDate": "2017-12-31 00:00:00",
              "ParticipationPlansReviewDate": "2015-12-07 00:00:00",
              "HotWorkPermitReviewDate": "2015-12-07 00:00:00",
              "ContractorSafetyReviewDate": "2017-10-04 00:00:00",
              "ContractorSafetyEvalDate": "2015-08-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000087231,
                  "PreventionProgram3ID": 1000070372,
                  "ProcessChemicalID": 1000104162
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000083495,
      "AltID": "Product Warehouse",
      "FacilityID": 1000066598,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000104163,
          "ProcessID": 1000083495,
          "ChemicalID": 92,
          "Quantity": 1700000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000104164,
          "ProcessID": 1000083495,
          "ChemicalID": 155,
          "Quantity": 810000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000091365,
              "ProcessChemicalID": 1000104164,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000091366,
              "ProcessChemicalID": 1000104164,
              "ChemicalID": 98
            }
          ]
        },
        {
          "ProcessChemicalID": 1000104165,
          "ProcessID": 1000083495,
          "ChemicalID": 111,
          "Quantity": 150000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000084697,
          "ProcessID": 1000083495,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000066598,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-01-30 00:00:00",
    "ERTrainingDate": "2017-02-28 00:00:00",
    "CoordinatingAgencyName": "DeSoto County LEPC",
    "CoordinatingAgencyPhone": "6624698017",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000066598,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\n\r\nNiteo Products, LLC has a long-standing commitment to worker and public safety and strives to continuously improve safety and environmental operations of its facilities. This commitment is demonstrated by significant investments of resources to prevent releases of hazardous substances and for accident prevention, such as employee participation and training, and considering safety in the design, installation, operation, and maintenance of processes.  Niteo's published policy is to implement practical controls to prevent foreseeable releases of hazardous substances. However, in the very unlikely event that a release occurs, Niteo has a well-defined emergency action plan and controls to contain the release and minimize any impacts.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nThe Niteo Plant, located in Hernando, Mississippi, produces a variety of car-care products. The facility consists of an outdoor tank farm and administrative and manufacturing buildings where the finished products are processed and packaged. These products are well known under the Valvoline and Pyroil brand names. The plant has an excellent safety and environmental record, with a high level of employee involvement and commitment to operational excellence.\r\n\r\nThe Niteo Plant has one manufacturing process (starting fluid manufacturing process) that uses a flammable substance- ethyl ether- listed in the EPA's Risk Management Plan (RMP) rule. There are no toxic regulated substances above the threshold quantity at the site. The starting fluid manufacturing process involving ethyl ether consists of storage, blending and packaging.  Ethyl ether is received at the facility by truck shipments and stored in storage tanks in a dedicated tank farm prior to use in blending the final products.  The process operations are covered by OSHA's process safety management (PSM) standard and are considered Program Level 3 for the RMP rule.\r\n\r\nA Product Distribution Center (war"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000066598,
      "SummaryText": "HAs insure that appropriate safeguards are in place to minimize the risk of any releases associated with the process.  Any recommendations that come from the PHAs are addressed and documented.  The PHAs are reviewed and updated whenever major changes are planned or at least every five years.\r\n\r\nOperating Procedures and Training - The Niteo plant maintains written procedures for the operation of the process that address all modes of operation, including start-up/shutdown, normal operation and emergency operations.  The procedures define the safe operating parameters for the operation and highlight the steps necessary for safe operation.  These procedures are reviewed and updated at least annually.  The procedures are available to all employees, are used in training new operators and in refresher training for experienced operators.  The plant also maintains a comprehensive training program for all employees.  The training covers the operation of the process as well as safety training and emergency response training.  Written tests along with observation and demonstration are used to insure that employees are properly prepared for operation of the process.  Refresher training is provided at least every three years.\r\n\r\nContractor Management - The Niteo plant has a comprehensive program in place to manage any contractors that may be needed during periods of increased maintenance or construction activity.  The program requires that contractor safety performance be reviewed as part of the selection process and that all contractor employees who come onto the site receive the necessary orientation and training to insure that they can work safely.  Periodic audits of contractor safety performance are conducted to review any issues that might arise.\r\n\r\nManagement of Change - A comprehensive management of change (MOC) procedure is also in place at Niteo.  The procedure insures that changes that might impact the safety of the plant and process are reviewed by the appropriate per"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000066598,
      "SummaryText": "ehouse), located on adjoining property (separated by railroad tracks), stores the finished products, containing ethyl ether, butane, propane and difluoroethane. The warehouse is also included in this RMP as a separate process because the total quantity in small product containers (7.8 and 11 oz. cans) may exceed the threshold quantity sometime during peak storage season. The warehouse is considered eligible for Program Level 1 for the RMP rule because: \r\n1. There are no public receptors within a distance to an endpoint from a worst-case scenario;\r\n2. The warehouse has had no release of a regulated substance in the past five years resulting in offsite exposure or consequences; and\r\n3. The warehouse emergency response activities are coordinated with the local responders.\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM\r\nThe following is a summary of the accidental release prevention program in place for the starting fluid manufacturing process at the Hernando, MS plant.  As noted, the facility is subject to the OSHA PSM standard and has programs and procedures in place to address each of the elements required under that standard.  Key features of the prevention program include the following:\r\n\r\nEmployee Participation - Employees are active in all aspects of the prevention program, including participating in process hazards analyses, operating procedure development, management of change and others.  The specific means and methods for employee involvement are outlined in a written procedure maintained by the plant.\r\n\r\nProcess Safety Information and Process Hazards Analyses - The plant maintains files of the information about the chemicals, technology, and equipment in the process necessary to safe operation.  Process Hazards Analyses (PHAs) using the information have been conducted to identify and characterize potential hazards in the process. The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  The P"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000066598,
      "SummaryText": "sonnel to insure that the changes can be implemented safely.  Checklists are used in the process to insure that adequate controls are in place, procedures and process documentation have been updated, and any necessary training has been conducted prior to implementation of changes.  Pre-startup safety reviews are conducted prior to change implementation as directed by the management of change procedure.\r\n\r\nMechanical Integrity - The plant has established procedures for the identification and maintenance of equipment that is critical to process safety.  This includes maintenance of a critical equipment list, definition of appropriate procedures for testing, inspecting and maintaining the equipment.  Training of maintenance personnel is also addressed.  Procedures are also in place to insure that any new or replacement parts and equipment are suitable for the service.  These procedures serve to insure the mechanical integrity of the process and minimize the potential for releases.\r\n\r\nSafe Work Practices - Niteo maintains a full set of safe work procedures to insure worker and process safety.  The procedures cover issues such as personnel access to the process, lockout/tagout before personnel work on energized equipment, confined space entry, hot work to minimize potential ignition sources, opening of equipment containing hazardous materials.  Training is conducted for applicable employees in these procedures.\r\n\r\nIncident Investigation - Niteo also maintains incident reporting and investigation procedures to insure that various types of incidents (near-misses, releases, fires, injuries, etc.) are reported and properly investigated.  Responsibilities for and procedures for conducting investigations are documented and will involve the employees affected by the incident.  Corrective actions developed by the investigations are documented and tracked to completion.  The facility has not had any incidents that require inclusion in the 5-year incident history under the RMP rul"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000066598,
      "SummaryText": "ures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements. In addition, the plant has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties. The emergency action plan is updated when necessary based on modifications made to plant processes or other developments. The emergency action plan changes are administered through management of change, which includes informing and/or training affected personnel in the changes.\r\n\r\nThe overall emergency response program for the Niteo Plant and Product Distribution Center is coordinated with DeSoto County Emergency Management. This coordination includes periodic meetings of the local emergency planning commission (LEPC), with local fire emergency response officials, local government officials, and industry representatives. The Niteo plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  The Niteo Plant and Product Distribution Center conducts periodic emergency drills that may involve the emergency response organizations, and provides refresher training to local emergency responders regarding the hazards of regulated substances in the Niteo Plant and Product Distribution Center."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000066598,
      "SummaryText": "e.\r\n\r\nCompliance Audits - The Niteo prevention program requires that compliance audits be conducted on the implementation of the prevention program at least every three years.  The audits review the procedures associated with the program as well as the documentation produced by the program to insure that the procedures are complete, comply with the requirements, and are being followed.  The audits involve the appropriate personnel as necessary and use protocols based on the regulatory requirements.  The audit results as well as any corrective actions identified in the audit are documented and tracked to completion.\r\n\r\nProcess Specific Safeguards - Some examples of the extensive safeguards associated with the use of ethyl ether at Niteo include: design and maintenance of the storage tanks according to industry standards including relief protection, nitrogen blanketing, and fire protection, release detection provisions, diking around the tank farm to contain any releases and procedures and administrative controls on valve operation.  These measures are part of the overall prevention program as described in this summary.\r\n\r\nFIVE YEAR INCIDENT HISTORY\r\n\r\nThe Niteo plant in Hernando has not had any incidents to date that meet the requirements for inclusion in the 5-year incident history portion of the RMP.  This includes both the starting fluid manufacturing process as well as the product distribution center.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe Niteo Plant and Product Distribution Center maintain a written emergency action plan, which is in place to protect worker and public safety as well as the environment and meet the regulatory requirements applicable to the facility.  The plan consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including proper first aid and medical treatment for expos"
    }
  ]
}