{
  "FacilityID": 1000088562,
  "FacilityName": "General Mills - Belvidere",
  "FacilityStr1": "915 East Pleasant Street",
  "FacilityStr2": null,
  "FacilityCity": "Belvidere",
  "FacilityState": "IL",
  "FacilityZipCode": "61008",
  "Facility4DigitZipExt": "3350",
  "FacilityCountyFIPS": "17007",
  "LEPC": "Boone County Emerg Mgmt Agency",
  "FacilityLatDecDegs": "42.262383",
  "FacilityLongDecDegs": "-088.832275",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "CO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.generalmills.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 116053091,
  "ParentCompanyName": "General Mills, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "General Mills - Belvidere",
  "OperatorStr1": "915 East Pleasant Street",
  "OperatorStr2": null,
  "OperatorCity": "Belvidere",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61008",
  "OperatorZipCodeExt": "3350",
  "RMPContact": "Jonathan Gomez",
  "RMPTitle": "Maintenance Team Lead",
  "FTE": 550,
  "OtherEPAFacilityID": "ILD982211435",
  "EPAFacilityID": "100000021219",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-05-14 00:00:00",
  "SafetyInspectionBy": "FM Global",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "RMP - General Mills - Belvidere 2008",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-07-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-07-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-07-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.26171,
  "FRS_Long": -88.8308,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110209,
      "AltID": "Production Engine Room",
      "FacilityID": 1000088562,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000111482,
          "ProcessID": 1000110209,
          "NAICSCode": "31191",
          "_desc": {
            "NAICS_CODE": "31191",
            "NAICS_DESCRIPTION": "Snack Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000137591,
          "ProcessID": 1000110209,
          "ChemicalID": 56,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000637591,
          "ProcessID": 1000110209,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000088562,
      "SummaryText": "Executive Summary\n\n\n\nThe Risk Management Program (RMP) for the General Mills-Belvidere, Illinois facility includes an Executive Summary as required by 40CFR 68.155.  This Executive Summary includes a discussion of the various Risk Management Program elements as follows:\n\n\n\n1. Accidental release prevention and emergency response policies\n\n2. Stationary source activities\n\n3. Regulated substances handled\n\n4. Release scenario analysis\n\n5. Accidental release prevention program\n\n6. Five-year accident history\n\n7. Emergency response preparedness program\n\n8. Planned changes to improve safety\n\n9. Summary\n\n\n\n[This facility was previously owned and operated by The Pillsbury Company and was acquired by General Mills, Inc. effective October 31, 2001.]\n\n\n\n\n\n1. Accidental release prevention and emergency response policies\n\n\n\nIt is General Mills' policy to comply with all of the requirements of the EPA's Accidental Release Prevention Program regulation as well as all other applicable Federal and State rules and regulations.  The Belvidere Plant has developed an OSHA Process Safety Management (PSM) Manual that documents safety and risk management policies pertaining to the prevention of accidental releases and emergency response preparedness.  In addition to the PSM Manual, the Belvidere Plant has developed a Risk Management Program that includes the OSHA PSM elements, a description of the risk management system, an Offsite Consequence Analysis (OCA), and the five-year accident history. \n\n\n\n\n\n2. Stationary Source Activities\n\n\n\nThe Belvidere Plant is located in Boone County, Illinois.  The facility is located south of the Kishwaukee River with other industrial facilities; the City of Belvidere lies to the south, west, and northwest of the facility.  Granola and chewy bars are manufactured, packaged and shipped along with cereal products that are packaged at this facility.  Ammonia is used to provide refrigeration for glycol chilling, refrigerated warehousing and cooling of processing "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000088562,
      "SummaryText": "and packaging space.\n\n\n\n\n\n3. Regulated Substances Handled\n\n\n\nThe ammonia refrigeration system at the Belvidere facility consists of production engine room (PER) that is subject to EPA's Risk Management Program rule.  The system is a closed-loop processes which recirculate and reuse the same materials.  Infrequent makeup to the systems is only to replace material lost due to maintenance activities and small intermittent purging.   The system consist of vessels, compressors, evaporators, condensers, safety relief systems, ammonia detectors and alarms.  All leaks are addressed and the system charges are maintained at intended levels.\n\n\n\n\n\n4.  Release Scenario Analysis\n\n\n\nRelease scenarios were analyzed using the EPA Model Risk Management Program and Plan for Ammonia Refrigeration (May 1996), the International Institute of Ammonia Refrigeration (IIAR) Risk Management Guidelines for Ammonia Refrigeration (1998) and the EPA Risk Management Program Guidance for Ammonia Refrigeration (May 2000). A worst-case release scenario was defined to determine the potential emergency response procedures needed for the facility and community; however, it is important to empha that a worstcase release is extremely unlikely to occur because of the many safety features inherent in the design and operational systems for the plant. On the other hand, the alternative release scenarios are based on credible assumptions. The alternative scenario was selected from a number of possible scenarios from the Ammonia Model RMP and is representative of a pipe, valve or flange gasket leak or a pump seal leak. \n\n\n\n\n\n5.  Prevention Programs\n\n\n\nFor the Belvidere Plant ammonia systems, General Mills followed the ANSI/IIAR 2-1992 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigeration Systems and implemented an RMP Program 3 Prevention Program which is equivalent to the OSHA Process Safety Management (PSM) program.  This is one of the most important ways for preventing ammonia r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000088562,
      "SummaryText": "eleases and for minimizing the impacts of any release that does occur.  Some of the key elements of the Prevention Program are summarized below. \n\n\n\nProcess Safety Information (PSI) - A comprehensive set of process safety information has been compiled for the ammonia systems.  The PSI includes data on the chemicals, the equipment design and the technology of the process.\n\n\n\nProcess Hazards Analysis (PHA) - An initial PHA was conducted to satisfy the PSM requirements in 1994.  The hazard analysis of the ammonia process is re-validated at least every 5-years.  Recommendations made by the most recent PHA team to improve the safety of the systems are being addressed to further reduce the risk of an accidental release or incident.\n\n\n\nOperating Procedures - An Operations and Maintenance Manual provides detailed written operating procedures for the ammonia system and for safe work practices.  Safe work practices include the use of ammonia personal protective equipment, lockout/tagout procedures, confined space entry procedures, safe use of motorized vehicles around ammonia equipment, and access control to critical areas.  Operating procedures are reviewed and re-certified annually to make sure they are current.\n\n\n\nTraining - Training is provided to each ammonia system operator and maintenance person before they are certified to operate the system.  There is a company developed ammonia operator training and certification program and includes initial and refresher training.\n\n\n\nMaintenance - All of the covered ammonia equipment is included in the Belvidere preventive maintenance program.  Equipment inspections, testing and preventive maintenance activities are performed following a structured schedule according to IIAR Bulletin 109 and a company developed mechanical integrity program.\n\n\n\nManagement of Change (MOC) - An MOC procedure is followed for all changes made to the ammonia systems, including the safety systems, to ensure that the system safety and integrity are not com"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000088562,
      "SummaryText": "promised.\n\n\n\nPre-Startup Review (PSR) - Pre-startup reviews are conducted whenever a change results in a change to the PSI.  Checklists are used to direct the PSR process.  The checklists are used to ensure that all essential elements of the prevention program (i.e., engineered systems and documentation) were in place prior to startup of new or modified systems. \n\n\n\nCompliance Audits - An initial compliance audit was conducted in 1995 and at least every 3 years.  The most recent audit was completed in February 2016 and findings and recommendations for improvement are being addressed.  All findings from earlier audits have been addressed.\n\n\n\nIncident Investigation - General Mills routinely investigates any ammonia related incident or accident that occurs at the Belvidere Plant.  An Incident Investigation procedure has been developed to help the investigation team determine the root cause of an incident and to help them develop measures to prevent recurrence. \n\n\n\nEmployee Participation - An employee participation program (for safety and risk management) is in place and training in PSM has been conducted for all affected employees.  Employee involvement in PHA studies and review of operating procedures is an important way in which employees take and retain ownership of the risk management programs. \n\n\n\nHot Work Permit Program - A hot work permit program is being used at the Belvidere Plant whenever hot work is conducted in and around the ammonia systems. \n\n\n\nContractor Safety - Contractor safety procedures are in place and include reviews of contractor performance and the inclusion of safety performance and programs in selecting contractors for work on or adjacent to the ammonia processes.\n\n\n\n\n\n6. Five -Year Accident History\n\n\n\nThere has been no release of ammonia from the Belvidere Plant in the last five years that meets the RMP reporting criteria. \n\n\n\n\n\n7. Emergency Response Preparedness Plan\n\n\n\nThe Belvidere Plant has an emergency response preparedness program which"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000088562,
      "SummaryText": " is described in the site Emergency Response Plan (ERP).  This plan includes procedures for evacuations, notifying response agencies and adjacent businesses, emergency equipment list with maintenance schedule, and procedures for responding to any release that may occur.  The plan also includes first aid procedures for toxic exposures to ammonia.  The facility has an on-site trained hazardous material (hazmat) team for responding to ammonia releases, isolate, and minimize off-site consequences.  The ERP is coordinated with the City of Belvidere Fire Department and the Boone County Emergency Management Agency and consistent with the county hazmat response plan.   The facility conducts annual drills with community first responders.\n\n\n\nThe facility has conducted risk management plan communication meetings with employees and has notified immediate offsite receptors.  A public communications meeting was held on April 24, 1999 in cooperation with the Belvidere Fire Department and the Boone County Emergency Management Agency.\n\n\n\n\n\n8. Planned Changes to Improve Safety\n\n\n\nAll recommendations from PHAs, MOCs, PSRs, mechanical integrity inspections, incident investigations, and compliance audits are addressed on an on-going basis.  It is also General Mills' policy to review operating, maintenance and emergency response procedures on a routine basis to ensure they are always applicable and effective.  This continuous review process generates further recommendations for improved safety during the course of operations and these measures are typically addressed in a very short time frame. \n\n\n\n\n\n9. Summary\n\n\n\nThe design, operation and maintenance of the ammonia system according to IIAR Standards and Guidelines and the implementation of the PSM and RMP programs provide a high level of assurance that the hazards and risks associated with the use of ammonia are being managed in an appropriate manner.  The likelihood of a release is minimized through the implementation of these programs"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000088562,
      "SummaryText": ".  General Mills has developed an Emergency Response Plan which is coordinated through the local response agencies and has communicated the information in this Risk Management Plan to the local community.  General Mills corporate and plant management are committed to safety and implementation of safe procedures and practices for both Prevention and Preparedness."
    }
  ]
}