{
  "FacilityID": 1000112360,
  "FacilityName": "Cut Bank NGL Plant",
  "FacilityStr1": "4 miles east-U.S. Hwy 2",
  "FacilityStr2": null,
  "FacilityCity": "Cut Bank",
  "FacilityState": "MT",
  "FacilityZipCode": "59427",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "30035",
  "LEPC": "Glacier County LEPC",
  "FacilityLatDecDegs": "48.603056",
  "FacilityLongDecDegs": "-112.246667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Montalban",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Patrick Montalban",
  "OperatorStr1": "4 miles east-U.S. Hwy 2",
  "OperatorStr2": "P.O. Box 250",
  "OperatorCity": "Cut Bank",
  "OperatorStateFIPS": "MT",
  "OperatorZipCode": "59427",
  "OperatorZipCodeExt": null,
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000095648",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "OP2428-15",
  "SafetyInspectionDate": "2022-08-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-04-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-04-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-04-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-04-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 48.603056,
  "FRS_Long": -112.246667,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000139909,
      "AltID": "NGL Processing",
      "FacilityID": 1000112360,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000175055,
          "ProcessID": 1000139909,
          "ChemicalID": 125,
          "Quantity": 350000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000175056,
          "ProcessID": 1000139909,
          "ChemicalID": 118,
          "Quantity": 160000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000175057,
          "ProcessID": 1000139909,
          "ChemicalID": 98,
          "Quantity": 140000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000141422,
          "ProcessID": 1000139909,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000112360,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-04-03 00:00:00",
    "ERTrainingDate": "2023-09-13 00:00:00",
    "CoordinatingAgencyName": "Cut Bank VFD",
    "CoordinatingAgencyPhone": "4068732288",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000112360,
      "SummaryText": "or over pressuring of a tank cannot occur.  Trucks are used to transport product from the plant.  No one is allowed access into the plant without prior authorization from personnel in the plant office, so plant administration knows when a truck is on premises.\n\nRelease Scenario\nFor worst case the regulation is clear.  The assumption is that the single largest container is released over a ten (10) minute period.  No active mitigation is considered.  Worst case meteorological conditions are assumed and RMP*Comp was used to calculate the endpoint distance for overpressure of 1.0 pound per square inch (PSI) for a butane vapor cloud explosion.   A distance of 0.3 miles to the flammable endpoint was determined for a release of 275,000 pounds in ten minutes.  \n\nPrevention Program\nThe prevention program and chemical-specific action steps are described in detail in the Cut Bank PSM/RMP Manual and the plant emergency response plan.\nElements in the program include or refer to:\n- Employee participation\n- Process safety information\n- Process hazard analysis\n- Operating and maintenance procedures  \n- Training\n- Contractor management\n- Pre startup procedures\n- Mechanical integrity requirements\n- Hot work procedures\n- Management of change procedures\n- Incident investigation\n- Compliance audits\n\nAccident History\nThe plant has not experienced any accidents that meet the criteria specified in the standard in the past five years.\n\nEmergency Response Program\nThe facility has established and maintains an emergency response plan that is coordinated with local response agencies.   The plan meets the requirements of 40 CFR 68.95.  The plan is designed to protect personnel on the site, to ensure their safe and orderly evacuation in event of an emergency, and to provide appropriate information and protection for response personnel.   The program is reviewed and updated as needed on at least an annual basis."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000112360,
      "SummaryText": "ergency response plan has been coordinated with the Glacier County Disaster and Emergency Services department (LEPC) and agency personnel have toured the facility.  Montalban and NorthWestern Energy takes an active role in preventing accidental releases at its facility by ensuring that employees are trained in the safe operation of the plant and evacuation procedures.  \n\nMontalban and NWE managements understand their duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  \n\nStationary Source and Regulated Substances\nThe plant is a natural gas fractionation facility designed to extract certain hydrocarbon liquids from the inlet gas stream.  This is done to make the gas stream pipeline ready as the dew point must be at a certain level to permit the gas to be transported via pipeline, safely.  The company has installed many safety systems to ensure that the inlet compression, processing, storage and distribution systems function safely. \n\nPropane, butane, natural gas, and natural gasoline are products of the fractionation processes at the Cut Bank plant.  These flammable substances are managed with great care given their inherent hazards.  The company invests in equipment upgrades as necessary to ensure the operations remain safe.  In addition, there are maintenance procedures, parts controls, internal engineering standards, and ongoing personnel awareness training (e.g., hazard communication, lockout/tagout, emergency drills.)  \n\nInternal and external audits are done to ensure the plant is in a continual improvement process.  Audits may be regulatory or management systems in nature, but in any case are done as part of the plant's objectives.  Results are reported to management and corrective actions taken and tracked as indicated. \n\nThe butane, propane and natural gasoline storage tanks are filled only to 80% of capacity.  This is done as an administrative control to ensure overfilling"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000112360,
      "SummaryText": "This is a brief overview of the RMP and policies of Montalban/ Cut Bank, MT gas plant.\n\nLocation and Status\nThe Cut Bank Main Line plant is located near Cut Bank, Montana at Township 33N -  Range 5W., Section 22.  The plant is located on approximately 20 acres of land, some six miles from the southern edge of the town of Cut Bank.  The plant is owned by Montalban.  Montalban purchased the facility from Omimex Energy, Inc in April of 2021.  Montalban contracts with NorthWestern Energy (NWE) to operate the plant, but Montalban retains authority for the operations.  The plant continues to fractionate approximately ten million cubic feet of gas per day and Montalban has no immediate plans to change the operations.\n\nThe plant has not experienced an incident that resulted in injuries or environmental damage as defined in the RMP rule in the past five years.\n\nHistory and Ownership\nThe plant was originally constructed by ProPak Inc. as a gas compression and fractionation facility for Montana Power Company.  In 1997, through an internal reorganization, Montana Power Company's oil and gas operations (NARCO) assumed responsibility for management of the plant.  The NGL Plant changed hands since then.  It was acquired by Omimex in 2003 and then by Montalban in 2021.    \n\nProgram Level\nMontalban has determined the Cut Bank plant is a Program Level 1 facility because there are no identified public receptors within the range of the worst case release scenario, there have been no incidents meeting the RMP criteria in the past five years, and emergency response procedures have been coordinated with the local response agency.  The plant is covered under the Occupational Safety and Health Administration's Process Safety Management standard.  \n\nPrevention and Response Policies\nThe accidental release prevention and emergency response policies are provided in the plant Emergency Response Plan and the Emergency Planning and Response section of the Cut Bank plant RMP manual.  The plant's em"
    }
  ]
}