{
  "FacilityID": 1000022859,
  "FacilityName": "Dorada Poultry LLC, Ponca City",
  "FacilityStr1": "2000 Hall BLVD",
  "FacilityStr2": null,
  "FacilityCity": "Ponca City,",
  "FacilityState": "OK",
  "FacilityZipCode": "74601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40071",
  "LEPC": "Ponca City Fire Department",
  "FacilityLatDecDegs": "36.726169",
  "FacilityLongDecDegs": "-097.109937",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dorada Poultry LLC.",
  "OperatorStr1": "2000 Hall BLVD",
  "OperatorStr2": null,
  "OperatorCity": "Ponca City,",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74601",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gerald Thomas",
  "RMPTitle": "Plant Manager",
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000016813",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-07-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-07-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-07-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.7245,
  "FRS_Long": -97.1166,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000027866,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000022859,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000028168,
          "ProcessID": 1000027866,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000033230,
          "ProcessID": 1000027866,
          "ChemicalID": 56,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000533230,
          "ProcessID": 1000027866,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000022859,
      "SummaryText": "EPA RISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\nDorada Poultry LLC., Ponca City, Oklahoma \n\n\n1. Accidental release prevention and emergency response polices.  To insure safe operation and release prevention at Dorada Poultry LLC, Ponca City (2000 Hall Blvd, Ponca City, OK 74601), this facility has implemented The Occupational Safety and Health Administrations Chemical Process Safety Management Program 29 CFR 1910.119.  All operators of systems containing the threshold amount of hazardous chemicals will undergo Chemical Process Safety Management training and operator training specific to the system. \nTo insure proper response to emergency situations, Dorada Poultry LLC, Ponca City (2000 Hall Blvd, Ponca City, OK 74601), has implemented Emergency Action Plans as required by The Occupational Safety and Health Administrations 29 CFR 1910.38(a) and Emergency Response Plans  29 CFR 1910.120. All safety personnel and operators of the process will be trained in these emergency procedures.\n\n2. The stationary source and regulated substances handled.\n\n(Brief description of the facility: Dorada Poultry LLC, Ponca City is in the business of processing raw pork   \n       and chicken  into ready-to-eat sliced meats and other ham products)\n\n             (Use of regulated substances: Ammonia is utilized as a refrigerant)\n\n(Amount of  regulated substance (Ammonia): 35,000 lbs. Of Ammonia)\n \n\n3. The general accidental release prevention program.\n      This facility complies with the Occupational Safety and Health Administrations  Chemical Process Safety Management 29 CFR 1910.119 and the Environmental Protection Agencies Risk Management Program 40 CFR Part 68.  For ammonia systems \nDorada Poultry LLC, Ponca City has adopted the International Institute of Ammonia Refrigeration guidelines for system operation and maintenance.Dorada Poultry LLC, Ponca City uses the IIAR Basic Ammonia Refrigeration Training Series for all operators\n \n4. Five-year accident history.\n(Dorada Poultry LLC, Ponca "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000022859,
      "SummaryText": "City has not had a release of reportable quantity in the past five years. There have not been any accidents due to an ammonia release.)\n\n5.   The emergency response program.\nA fully trained and equiped Emergency Response Team is on site.  This team is trained to the Hazardous Materials Responder-Technician response capability in accordance with OSHA 29 CFR 1910.120 (q).  The team is capable of affecting all control measures (both confinement operations and containment operations) required to remediate the incident.\n\nA written Emergency Response Plan has been developed and is on record at the Facility.  This plan includes Pre-Emergency Planning with Outside Agencies, Personnel Roles and Lines of Incident Command Authority, Facility Hazard Analysis and Emergency Prevention, Safe Distances and Places of Refuge, Site Security and Control, Evacuation Routes and Procedures, Decontamination Procedures, provisions for Emergency Medical Treatment, Emergency Notification Procedures, Chemical Response Procedures, Post Incident Critique, and Personal Protective Clothing and Emergency Equipment.\n\nAll Hazmat courses at Dorada Poultry LLC, Ponca City are designed to meet training requirements of the OSHA 29 CFR 1910.120 (q) (7) and (8). All Hazmat Team Members are trained 24 hours initially to the Technician level followed by 8-24 hours of refresher training per year under the direction of the on-site Hazmat Instructor at the facility. Each Instructor receives an initial 40 hours of training and 8-16 hours per year re-certification training that goes to I.C. level. \n\nThe training is designed to teach both theory and hands-on training giving the person an overall understanding of the nature of hazardous materials and the ability to assess and safely respond to the incidents in the Incident Command structure.  Technician level  training includes but is not limited to the following:\n\nAA?Knowledge of basic hazards and risk assessment techniques\nAA?Proper selection and use of appropria"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000022859,
      "SummaryText": "te and required PPE for the chemical hazard\nAA?Terminology associated with Hazmat\nAA?Advanced site control/security procedures\nAA?Advanced Containment/Control/Decon procedures\nAA?Use of Atmospheric Monitoring Equipment and Contaminant Test Procedures\nAA?Incident Command Structure Roles and Line of Authority\nAA?Interaction with Local and State Officials\nAA?Standard Operating Procedures for Clean-up and termination \nAA?Critique\n\nOn Site facility Instructors have completed in excess of 40 hours of InstructorAA?s training, achieving the Incident Command level, over the past year and have instructed their team in approximately  24 hours of training.  \n\nAll training materials, hands-on drills and response procedures have been developed under the direction of the Corporate Environmental, Health and Safety Department.\n\nAll Team members are taught in Hazard Communication to report any observed chemical leaks/spills and odors to their supervisor or lead person immediately.  Supervisors and Leads are taught to report the above to the Safety or Process Manager immediately for further investigation and action by the Hazmat team.  MSDS information books are accessible to all team members for review.\n     \n6. Planned changes to improve safety.  \n  The Ponca City facility will continue to upgrade the PSM/RMP Programs and refrigeration equipment as necessary."
    }
  ]
}