{
  "FacilityID": 1000050978,
  "FacilityName": "CERTAINTEED CORPORATION",
  "FacilityStr1": "3300 PETE MANENA ROAD",
  "FacilityStr2": null,
  "FacilityCity": "WESTLAKE",
  "FacilityState": "LA",
  "FacilityZipCode": "70669",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22019",
  "LEPC": "Calcasieu Parish LEPC",
  "FacilityLatDecDegs": "30.227017",
  "FacilityLongDecDegs": "-93.298194",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.certainteed.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2358265,
  "ParentCompanyName": "SAINT-GOBAIN CORPORATION",
  "Company2Name": null,
  "CompanyDUNS": 275517225,
  "Company2DUNS": null,
  "OperatorName": "CERTAINTEED CORPORATION",
  "OperatorStr1": "P.O. BOX 1189",
  "OperatorStr2": null,
  "OperatorCity": "SULPHUR",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70664",
  "OperatorZipCodeExt": null,
  "FTE": 43,
  "OtherEPAFacilityID": "70664CRTNTPETEM",
  "EPAFacilityID": "100000098869",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-02-26 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-07-17 00:00:00",
  "ErrorReportDate": "2004-08-10 00:00:00",
  "ReceiptDate": "2015-08-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-08-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-02-20 00:00:00",
  "DeRegistrationEffectiveDate": "2019-02-07 00:00:00",
  "AnniversaryDate": "2020-08-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.2",
  "FRS_Lat": 30.227017,
  "FRS_Long": -93.298194,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064326,
      "AltID": "PVC MANUFACTURING",
      "FacilityID": 1000050978,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000079530,
          "ProcessID": 1000064326,
          "ChemicalID": 101,
          "Quantity": 1200000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000065428,
          "ProcessID": 1000064326,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000053398,
              "Process_NAICS_ID": 1000065428,
              "SafetyReviewDate": "2015-05-11 00:00:00",
              "PHA_Date": "2014-07-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Modify Operating Procedures",
              "OpProceduresReviewDate": "2015-06-29 00:00:00",
              "TrainingReviewDate": "2015-02-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-07-03 00:00:00",
              "EquipmentInspectionDate": "2013-01-19 00:00:00",
              "EquipmentTested": "VCM Storage Tank D-202-A",
              "ChangeMgmtDate": "2015-04-25 00:00:00",
              "ChangeMgmtReviewDate": "2010-06-22 00:00:00",
              "PreStartupReviewDate": "2015-05-29 00:00:00",
              "ComplianceAuditDate": "2013-02-23 00:00:00",
              "AuditCompletionDate": "2016-12-31 00:00:00",
              "IncidentInvestigationDate": "2015-05-28 00:00:00",
              "InvestigationChangeDate": "2016-12-31 00:00:00",
              "ParticipationPlansReviewDate": "2013-07-22 00:00:00",
              "HotWorkPermitReviewDate": "2009-03-24 00:00:00",
              "ContractorSafetyReviewDate": "2015-02-23 00:00:00",
              "ContractorSafetyEvalDate": "2012-01-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000065622,
                  "PreventionProgram3ID": 1000053398,
                  "ProcessChemicalID": 1000079530
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000050978,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-04-27 00:00:00",
    "ERTrainingDate": "2015-04-30 00:00:00",
    "CoordinatingAgencyName": "CALCASIEU OFF. OF EMERG. PREPAREDNE",
    "CoordinatingAgencyPhone": "3374399911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050978,
      "SummaryText": "The CertainTeed Corporation (CertainTeed), Lake Charles Polymer Plant located in Calcasieu Parish, Louisiana produces a high quality polyvinyl chloride (PVC) polymer resin with a maximum capacity production rate of 1,500,000 pounds per day. Currently the dry bulk polymerization process produces a normal operating rate of approximately 1,000,000 pounds per day.  \r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\nCertainTeed is a subsidiary of Compagnie de Saint-Gobain (Saint-Gobain), who has based its development upon respect for people and their environment. This commitment is formalized in the Principles of Conduct and Action. Adherence to these principles is a condition for belonging to our company.\r\n\r\nEHS (Environmental, Health and Safety) are fundamental values for Saint-Gobain. The EHS policy guides Saint-Gobain over the long term, bringing benefits to both people and their environment, and assuring the success of our strategy.\r\n\r\nHealth and Safety, which together form the first pillar of our EHS policy, contribute directly to the improvement of the working conditions and to the well-being of everyone. All work-related accidents and occupational illnesses are, by their very nature, unacceptable. We work tirelessly to achieve the only possible goal: zero work-related accidents and zero occupational illnesses.\r\n\r\nPotential of the environment is the second pillar of our EHS policy, requiring our constant commitment and attention. It is essential to mobilize all our employees, in all countries, to achieve the only acceptable goal: zero environmental accidents and the maximum possible reduction of the impact of our activities.\r\n\r\nResponsibility for the implementation of the Group's EHS policy lies at all levels of the organization. Within the general framework established by Saint-Gobain, each Sector defines a specific action plan related to its particular activities and processes. The delegations coordinate general EHS actions across business units,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050978,
      "SummaryText": "or train has six reactors, and the Poly2 reactor train has three reactors.  The nine reactors are identical in design, size, capacity, and operation.  The two reactor trains produce PVC resin using the same formulation and additives, resulting in the production of a single type and grade of PVC resin.  Currently, due to economic condition, only Poly 1 is producing PVC resin, as Poly 2 has been idled.\r\n\r\nThe vinyl chloride monomer (VCM) feedstock is received from an offsite source via pipeline.  The VCM is polymerized in a two-step process utilizing a pre-polymerizer and an autoclave (reactor).  The VCM is stored in the VCM storage tanks.  From the VCM storage tanks, the VCM is transferred to the VCM day tank.  The VCM day tank charges the pre-polymerizers and the autoclaves.  When the polymerization is complete in the autoclave, the dry PVC powder is degassed of its residual vinyl chloride in four sequential degassing cycles.  The residual VCM vapor is sent to the VCM vapor recovery area.  The stripped PVC powder is transferred to product classification and subsequently stored for railcar load-out.\r\n\r\nIn the VCM recovery area, residual VCM vapor is condensed and returned to the VCM day tank.  Non condensable vapors from the VCM vapor recovery area are routed to the thermal oxidizers.  Condensed water is sent to a wastewater stripper for removal of entrained VCM, and the wastewater stripper overheads are routed to the thermal oxidizers.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\nCertainTeed has deployed the facility's Process Safety Management (PSM) and Risk Management Plan (RMP) activities and address the requirement for a compliance audit every three (3) years as defined in 29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals and 40 CFR Part 68, Chemical Accident Prevention Provisions. These regulations are performance-based management system regulations intended to prevent explosions and catastr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050978,
      "SummaryText": "ophic releases of highly hazardous chemicals.\r\n\r\nCertainTeed originally designed the Plant and has maintained the minimal inventory approach to storing and handling VCM and other hazardous materials on site.  The VCM raw material storage vessel receives inventory from an industrial neighbor via above ground pipeline.  This requires no loading or offloading facilities.  If the supply is stopped, CertainTeed's production will have to cease in a six-to-eight-hour time frame.  This stored quantity (63,680 gal. capacity) is manageable within the boundaries of the facility.  The total volume of material can be contained locally with its concrete containment walls.  Fumes and fire can be managed locally with automatic stationed fire cannons and a deluge system.\r\n\r\nThe PVC process equipment has multi-safety systems in the event of temperature, pressure, or reaction swings (high or low).  Process deviation procedures are located in the Production Procedure Manual.  Standard operating procedures outline how to recognize process deviations and how to correct problems.\r\n\r\nVCM has a permissible exposure limit (PEL) of 1 part per million for an eight-hour time-weighted average.  With such a low biological index, CertainTeed has placed area monitors that alarm if there is an indication of vinyl chloride in any part of the Plant.  When the alarm sounds, protective measures are used to protect the employees and others that may be on site including evacuation of non-essential personnel from the immediate area while operations and maintenance personnel don respiratory protection until the source has been repaired.\r\n\r\nThe Plant also has a Management of Change (MOC) process in place to evaluate any changes in the process for potential risks that a change could introduce so protective measures can be implemented to eliminate or minimize any such risks. Pre-startup Safety Reviews (PSSRs) are also conducted prior to start-up after a change is implemented to confirm equipment is installed"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000050978,
      "SummaryText": "es, products and services throughout their life cycle. This continuous loop is perpetuated until an interdependent autonomous EHS culture is realized.\r\n\r\nA recent example of continuous improvement is the incident investigation and implementation of actions resulting from the investigation. Action items include completing a procedure review, and additional engineering measures have been identified to improve the safety of the operation.  The engineering scope has been developed, and detailed plans to implement the work are being developed at this time.  Visual inspections and confirmation of operating procedures are performed prior to the start of each batch."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050978,
      "SummaryText": "as designed, procedures and other documentation are updated, and personnel are trained on the change.  \r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\nCertainTeed is proud that the facility has had no incidents that impacted the public in the last five years and are required to be reported per the RMP regulations. However, on April 19, 2015 there was an incident that released approximately 250 pounds of vinyl chloride, which, to the best of our knowledge, had no impact on the environment. A release of this amount is less than the alternate release evaluated with the offsite consequence analysis, which is predicted to result in no offsite impact.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\nCertainTeed has developed emergency plans and programs to address internal and external response actions, and to evaluate risks of existing and new equipment systems. The facility's Emergency Response Plan (ERP) includes the following features:\r\n- Material Risk Identification\r\n- Measures and controls\r\n- Emergency Procedures\r\n- Site Evaluation\r\n- Emergency Response/Evacuation\r\n- Hurricane/Severe Weather Procedures\r\n- Fire/Explosion/Bomb Threat Procedures\r\n- ISO 14001:2004 Registered\r\nThe facility also actively participates in the Calcasieu Parish Office of Emergency Preparedness programs and has been a member of the Southwest Louisiana Mutual Aid Association since 1975. CertainTeed conducts readiness training and exercises to ensure effective emergency response capability is available, if necessary. These exercises are evaluated to assess results and implement corrective actions.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nContinuous improvement is driven by Saint-Gobain's EHS Frame of Reference which is derived from the concept of the Deming wheel represented by the Plan Do Check Act cycle. The Frame of Reference also describes the EHS management system that the site managers must implement. This principle allows Saint-Gobain to implement and continually improve the EHS management system extended to all process"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050978,
      "SummaryText": "particularly those related to the specific conditions of the country. The entire local management is committed to ensuring the full implementation and application of the EHS policy.\r\n\r\nThe Lake Charles Polymer Plant EHS Policy states that all employees, contractors and visitors at the Lake Charles Plant have a right to expect a safe, healthy, and injury-free workplace. Furthermore, the policy includes a pledge that the highest priority of actions and guidance will be to ensure the health and safety of all employees and our environment. \r\n\r\nThe Lake Charles Plant is committed to complying with all Saint-Gobain, CertainTeed Siding Products Group, OSHA, and site specific Environmental, Health and Safety policies. Additionally, we are committed to continually improving our EHS standards and performance.\r\n\r\nFurthermore, the CertainTeed Lake Charles Polymer Plant is registered to the ISO 14001:2004 Standard and utilizes this documented system to manage the required elements of the CAA Risk Management Program.  The Plant Technical Manager has overall responsibility for both programs, ISO 14001 and RMP.  The Plant EHS Manager has responsibility for managing the OSHA Process Safety Management Program at the Lake Charles Polymer Plant.  The Technical Manager works closely with the EHS Manager to ensure that the implementation and integration of all the applicable RMP elements are successful and sustained in conformance with the applicable requirements.  \r\n\r\nFACILITY BACKGROUND AND REGULATED SUBSTANCE HANDLED\r\nCertainTeed Corporation has manufactured polyvinyl chloride (PVC) polymer in the Lake Charles, Louisiana area since 1975. The polymer resin is produced from vinyl chloride (CAS #75-01-4) monomer. This colorless gas with a sweet smell is a toxic, flammable carcinogen that can be formed in the environment when soil organisms break down chlorinated solvents.\r\n\r\nAt the CertainTeed Lake Charles Polymer Plant two reactor trains are available to produce PVC.  The Poly1 react"
    }
  ]
}