{
  "FacilityID": 1000077185,
  "FacilityName": "Linde - East Chicago, IN",
  "FacilityStr1": "4400 Kennedy Avenue",
  "FacilityStr2": null,
  "FacilityCity": "East Chicago",
  "FacilityState": "IN",
  "FacilityZipCode": "46312",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18089",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "41.631119",
  "FacilityLongDecDegs": "-087.462067",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.linde.com",
  "FacilityEmailAddress": "info@linde.com",
  "FacilityDUNS": 94738762,
  "ParentCompanyName": "Linde Inc.",
  "Company2Name": null,
  "CompanyDUNS": 197154586,
  "Company2DUNS": 197154586,
  "OperatorName": "Linde Inc.",
  "OperatorStr1": "4400 Kennedy Avenue",
  "OperatorStr2": null,
  "OperatorCity": "East Chicago",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46312",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Sidener",
  "RMPTitle": "Facilities Manager",
  "FTE": 120,
  "OtherEPAFacilityID": "46312NNCRB4550K",
  "EPAFacilityID": "100000144462",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "089-40799-00330",
  "SafetyInspectionDate": "2018-05-14 00:00:00",
  "SafetyInspectionBy": "Indiana Dept of Environmental Management",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-03-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-03-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.63343,
  "FRS_Long": -87.46152,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "55",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000096065,
      "AltID": "Hydrogen Liquefaction",
      "FacilityID": 1000077185,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000097327,
          "ProcessID": 1000096065,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120275,
          "ProcessID": 1000096065,
          "ChemicalID": 149,
          "Quantity": 380000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000620275,
          "ProcessID": 1000096065,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077185,
      "SummaryText": "Facility Description\n\n\n\nThe Linde facility at 4400 Kennedy Avenue in East Chicago, Indiana is a hydrogen purification plant.  We receive hydrogen gas from an offsite Linde facility via pipeline. In our production process, the hydrogen gas is compressed and cooled to remove moisture and other contaminants.  The hydrogen gas is then liquefied using a high-speed turbine process.  The final cryogenic liquid hydrogen product is stored in our insulated storage tanks, and is shipped by truck to customers throughout the midwest.\n\n\n\nRegulated Substances\n\n\n\nThis facility uses, manufactures, or stores a chemical listed in part 68 of Title 40 of the Code of Federal Regulations, beyond a threshold quantity, as established by the EPA; \n\nHydrogen, which is produced and stored in a liquified state.\n\n\n\n\n\nAccidental Release Prevention Policy\n\n\n\nLinde is dedicated to being the best performing industrial gas company in all aspects of our business, including safety, health, and environmental affairs. Our safety, health, and environmental policy call for a commitment to protecting the health and safety of our employees, neighbors, and the surrounding environment. This policy is the basis for engineering and construction programs that produce equipment and process systems that minimize the possibility of accidental chemical releases and operational safety programs that ensure safe operation of our facilities. Linde is committed to the continuous improvement of these programs.\n\n\n\nLinde is an active member of the American Chemistry Council and subscribes to the council's program of Responsible CareA&reg; Employee Health and Safety Code of Management Practices.\n\n\n\n\n\nPrevention Program\n\n\n\nIn accordance with OSHA's Process Safety Management standard and EPA's Risk Management Program rule, the East Chicago IN facility has a comprehensive accident prevention program in place. This program is built around process safety concepts such as:\n\n- Technical documentation of Process Safety Information, d"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077185,
      "SummaryText": "escribing the physical properties of the hazardous substances, the safety systems in place to control these substances, and the critical operating parameters of the associated equipment and systems.\n\n- Procedures and programs to develop, maintain, and control key program elements such as process operations, equipment mechanical integrity, employee training, management of change, hot work permits, incident investigation, and contractor activity. \n\n- Initial and periodic review of new or modified processes through application of comprehensive design safety and management of change programs that include Process Hazard Analysis study and pre-startup review. \n\n\n\nLinde has an employee participation program that promotes involvement in the process safety program and helps ensure understanding of facility-specific elements of the safety program.\n\n\n\nThe prevention program is audited periodically, by our corporate assessment group, to ensure that the process safety concepts and practices are in place and working effectively.\n\n\n\n\n\nChemical-specific Prevention Steps\n\n\n\nIn addition to the required prevention program elements, we have implemented safety features specific to the covered process at our facility. Following is a description of some of these safety features.\n\n\n\nThe Hydrogen Sphere is protected by a Fire Protection water deluge system. Overfill protection is accomplished by Manual and Automatic shutdown valves.\n\n\n\nSafety Relief Valves overpressure protection is present. \n\n\n\n\n\n\n\nFive-year Accident History\n\n\n\nThe East Chicago Hydrogen facility did not experience any EPA RMP recordable events over the last five years.  \n\n\n\n\n\nEmergency Response Programs\n\n\n\nLinde has an emergency response program in place to minimize the effects of accidental release of regulated substances on employees, the public, and the environment. \n\n\n\nFor other than minor incidents Linde has in place an emergency response plan in coordination with the Lake County Indiana Emergency Planning Commission,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077185,
      "SummaryText": " located in Crown Point Indiana, as well as the East Chicago Indiana Fire Department.  \n\nLinde is a member of the CAN- Network  & Lake County Indiana Emergency Response Program.\n\n\n\n\n\nAll facility employees are trained in their role in the emergency plan and emergency drills are conducted at least annually.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nLinde has a commitment to safety that is expressed in a company-wide goal of \"Zero/Zero\", which means zero accidents and zero injuries or illnesses at each and every location. We look to constantly improve the safety of our processes using recommendations developed through the prevention program and a program soliciting safety suggestions from our employees.\n\n\n\nThere are currently no major projects for safety improvement that have reached the planning stage"
    }
  ]
}