{
  "FacilityID": 1000011625,
  "FacilityName": "Isomedix Operations, Inc",
  "FacilityStr1": "Vista del Sol Industrial Park",
  "FacilityStr2": "1435 Isomedix Place",
  "FacilityCity": "El Paso",
  "FacilityState": "TX",
  "FacilityZipCode": "79936",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48141",
  "LEPC": "El Paso Fire Department",
  "FacilityLatDecDegs": "31.729000",
  "FacilityLongDecDegs": "-106.290889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G5",
  "LatLongDescription": "PG",
  "FacilityURL": "WWW.ISOMEDIX.COM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "STERIS Corporation",
  "Company2Name": null,
  "CompanyDUNS": 177360039,
  "Company2DUNS": null,
  "OperatorName": "Isomedix Operations, Inc.",
  "OperatorStr1": "Vista del Sol Industrial Park",
  "OperatorStr2": "1435 Isomedix Place",
  "OperatorCity": "El Paso",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79936",
  "OperatorZipCodeExt": null,
  "FTE": 85,
  "OtherEPAFacilityID": "79936SMDXN14351",
  "EPAFacilityID": "100000194176",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-06-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-01-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-11-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-11-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-11-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 31.73177,
  "FRS_Long": -106.2892,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013971,
      "AltID": "EtO Sterilization",
      "FacilityID": 1000011625,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000016075,
          "ProcessID": 1000013971,
          "ChemicalID": 9,
          "Quantity": 56000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000014332,
          "ProcessID": 1000013971,
          "NAICSCode": "56191",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000011506,
              "Process_NAICS_ID": 1000014332,
              "SafetyReviewDate": "2011-10-20 00:00:00",
              "PHA_Date": "2011-05-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-08-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Catalytic oxidizer, flare, safe cells, and scrubbers",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Startup of additional sterilizer on contiguous property, revised operating procedures, training procedures, maintenance procedures, emergency response plan, etc.",
              "OpProceduresReviewDate": "2012-10-15 00:00:00",
              "TrainingReviewDate": "2012-10-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-11-09 00:00:00",
              "EquipmentInspectionDate": "2012-12-13 00:00:00",
              "EquipmentTested": "Catalytic oxidizer",
              "ChangeMgmtDate": "2011-12-16 00:00:00",
              "ChangeMgmtReviewDate": "2012-11-09 00:00:00",
              "PreStartupReviewDate": "2012-07-13 00:00:00",
              "ComplianceAuditDate": "2011-10-28 00:00:00",
              "AuditCompletionDate": "2012-04-25 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-02-18 00:00:00",
              "HotWorkPermitReviewDate": "2009-10-09 00:00:00",
              "ContractorSafetyReviewDate": "2012-06-05 00:00:00",
              "ContractorSafetyEvalDate": "2010-07-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000013353,
                  "PreventionProgram3ID": 1000011506,
                  "ProcessChemicalID": 1000016075
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000011625,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "El Paso Fire Department",
    "CoordinatingAgencyPhone": "9158497222",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011625,
      "SummaryText": "The Isomedix Operations, Inc. El Paso facility uses ethylene oxide (EtO) for sterilizing pre-packaged supplies for health care facilities.  Ethylene oxide is highly effective in killing bacteria, insects, and fungi.  It serves as an efficient means for sterilization in systems where heat cannot be used to kill such organisms.  The use of ethylene oxide as a sterilant has been the dominant disinfection method in the United States since it was first introduced.\n\nAs one might expect from its superior sterilization properties, ethylene oxide is a hazardous substance.  Thus, storing and handling ethylene oxide can present a risk to employees and the public without proper precautions.  The El Paso facility considers safe practices in storing and using ethylene oxide to be of primary importance and has an excellent safety record with ethylene oxide.\n\nThe El Paso facility ethylene oxide storage and usage is subject to the Environmental Protection Agency Risk Management Program regulation.  This regulation requires submission of a Risk Management Plan (RMP).  An integral part of the RMP is a summary of policies and procedures followed to safely operate the facility, including a description of the possible consequences in case of an accident and the actions, which will be taken by the facility in an emergency.\n\nThe following information is specifically required in the RMP Executive Summary: \n\n* Accidental release prevention and emergency response policies.\n* General facility and regulated substances information.\n* Summary of the accidental release prevention program and chemical-specific prevention steps.\n* Five-year accident history summary.\n* Emergency response program summary.\n* Planned changes to improve safety.\n\nThe above information for the El Paso facility ethylene oxide sterilization system is provided below:\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe El Paso facility accidental release prevention policy for ethylene oxide involves a unified a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011625,
      "SummaryText": "pproach that integrates proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable procedures of the EPA Risk Management Program are adhered to, including key elements such as training, management system, and emergency response procedures. \n\nThe El Paso facility emergency response policy involves the preparation of Emergency Response Plans which are tailored to the facility and to the emergency response services available in the community, and is in compliance with the EPA Emergency Response Program requirements.  El Paso facility has prepared Emergency Response Plans for ethylene oxide to facilitate coordination and emergency planning with offsite response officials and facilities in the event of an emergency.  The Emergency Response Plans have been coordinated with local response agencies, such as the El Paso Fire Department.  El Paso facility has an excellent record in preventing accidents from occurring.\n\nGeneral Facility and Regulated Substance Information\n\nThe El Paso facility incorporates two sterilization plants on contiguous property in the Vista del Sol Industrial Park, with a main address at 1435 Isomedix Place in El Paso, Texas.  The original plant has been using EtO since 1990 and is referred to as the EL Plant.  The new plant began routine operation in 2009 and is referred to as the E2 Plant.  Located on contiguous property to the EL Plant, the E2 Plant has an address of 1441 Don Haskins Drive.  The EL Plant has a total space of approximately 90,000 square feet, with approximately 25,000 square feet utilized for storage of incoming products to be sterilized and approximately 30,000 square feet for storage of processed product. \n\nThe facility stores and uses ethylene oxide, a regulated toxic substance under the EPA rules, and the inventory can exceed 10,000 pounds.  The potential maximum inventory of ethylene oxide at both the EL and E2 Plants is 56,000 pounds.  Ethylen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011625,
      "SummaryText": "e oxide is received and stored in a storage area at the EL Plant and a storage area at the E2 Plant.  \n\nThe El Paso facility is equipped with an automatic fire sprinkler system, both ceiling and in rack.  The sterilizer vessels are contained in the EL and E2 Plant sterilizer rooms. The ethylene oxide supply drums are bonded, grounded and chained, and only non-sparking tools are used to make drum connections.  The lines are purged with nitrogen prior to change out of drums and empty drums receive a nitrogen over-blanket in accordance with Department of Transportation requirements.  Ethylene oxide from the drums is vaporized in a steam-heated vaporizer prior to its introduction into the vessels.  The nitrogen gas is also steam heated prior to its introduction into the vessels.  The vessels are computer controlled by a programmable logic control system.  A system of passwords ensures that only authorized personnel have access to the logic control system.\n    \nThe EL Plant is equipped with an EtO removal and destruction system, which consists of two units: (1) the Flare System, and (2) two Donaldson Abator Units.  EtO-laden air from the sterilization chambers is delivered to the flare system after the flare undergoes a readiness test, and air from the aeration rooms is delivered to the abator units to combust the gas mixture and convert EtO to carbon dioxide and water. \n\nThe E2 Plant is equipped with an EtO removal and reaction system, which consists of passive hydrolyzers followed by active, packed bed wet scrubbing hydrolyzers, all converting used EtO into ethylene glycol.  The EtO storage room at the E2 Plant is vented to one of the active packed bed wet scrubbers to convert any fugitive EtO releases into ethylene glycol.\n\nThe EL Plant EtO storage room is provided with three safe-cell systems. Each safe cell is capable of destructing 150 pounds of EtO should there be a leak. The EtO removal efficiency in the safe-cells is about 99%.  The safe-cells are activated by t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011625,
      "SummaryText": "he EtO monitoring system (baseline monitoring system), which has an EtO sensor inside the EtO storage room.  The non-destructed EtO is exhausted through a common stack from all the three safe cells.\n\nBoth the EL Plant and the E2 Plant at the El Paso facility are equipped with a 16-port continuous ethylene oxide monitor.  The results of the ethylene monitoring are continuously displayed in the Control Rooms.  The alarm set point is 1 ppm ethylene oxide.  The facility is also equipped with combustible gas sensors, located in the sterilizer rooms and EtO drum rooms.  Sensors are set to alarm at 1,500 ppm (EtO) and will activate an evacuation alarm in the control Room.  A second alarm is set at 50% of the lower explosive limit of EtO (15,000 ppm).  This alarm will activate a remote red strobe light located in the electrical room for the purposes of emergency response planning.  Each instrument is also equipped with an oxygen sensor set to alarm at 19% by volume of oxygen to air.\n\nEthylene oxide storage and use at the El Paso facility is subject to EPA rules, as well as the federal Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standards.\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n  \nThe El Paso facility complies with Federal Process Safety Management requirements.  The El Paso facility accidental release prevention program is based on the following key elements:\n\n* Detailed management system and clear levels of responsibilities and team member roles.\n* Comprehensive process safety information that is readily available to staff, emergency responders, and contractors.\n\n* Comprehensive preventive maintenance program.\n\n* Performance of process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\n\n* Use of state-of-the-art process and safety equipment.\n\n* Use of accurate and effective operating procedures, written with the participatio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011625,
      "SummaryText": "n of the operators.\n\n* High level of training of the operators and maintenance staff.\n\n* Implementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nChemical-specific prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of ethylene oxide supply, awareness of the hazardous and toxic properties of ethylene oxide, presence of ethylene oxide detectors and alarms, flare system, two abators, three safe cells, and scrubbers.\n\nProcess and Chemical Safety Information\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of ethylene oxide.  This information includes ethylene oxide background information and MSDS sheets.\n\nEquipment safety information was meticulously compiled on the ethylene oxide process.  Specifications for ethylene oxide process are collected and provided in one place for easy reference.  Details such as maximum intended inventory; safe upper and lower temperatures; safe upper and lower pressures; and codes and standards used to design, build, and operate the processes are on file at the facility.  The El Paso facility also has procedures in place that are triggered to update process safety information if there is a major change that makes existing information inaccurate.\n\nProcess Hazard Analysis \n\nIn November 2003, a detailed process hazard analysis (PHA) was conducted for the EL Plant ethylene oxide system equipment and procedures.  This PHA was further reviewed on May 26, 2005. \n\nA PHA was conducted in July 2008 on the design of the E2 Plant.  The E2 Plant performs the same type of sterilization processing as the EL Plant and was built to increase processing capacity.  This HAZOP review included all operating concerns reviewed in previous PHA reviews, in addition to the sterilizers to be adde"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000011625,
      "SummaryText": "d.  \n\nThe PHA will be updated again within a five-year period or whenever there is a major change in the process.  Based on the PHA, a list of recommended actions was developed to further improve ethylene oxide safety.\n\nOperating Procedures\n\nThe El Paso facility maintains up-to-date, accurate, written operating procedures that provide clear instructions for the ethylene oxide process.  The El Paso facility ensures effective operating practices by combining them with operating and maintenance training programs.  Standard operating procedures (SOP) provide system descriptions, specifications, equipment inspection requirements, and operating procedures for the ethylene oxide system.  The operating procedures include connection/disconnection for ethylene oxide drums, start-up and shutdown for ethylene oxide evaporators, after-maintenance start-up for ethylene oxide evaporators, and maintenance shutdown for ethylene oxide evaporators, ethylene oxide system emergency shutdown, start-up following an emergency shutdown, and temporary operations. Also included are the maintenance and troubleshooting procedures, including consequences of deviation and the steps to correct or avoid deviations.  The El Paso facility updates procedures whenever a change occurs that alters the steps needed to operate safely.  Operating procedures will be developed and put in place prior to any new process equipment coming on line, changes made in the handling of ethylene oxide equipment, or reconfiguration of the facilities.\n\nTraining \n\nEl Paso facility employees presently involved in operating or maintaining the ethylene oxide process are trained in an overview of the process and detailed applicable operating and maintenance procedures.  The El Paso facility ensures that each employee newly assigned to the process is trained and tested to be competent in the operating procedures listed pertaining to their duties.  El Paso facility training program includes four elements: (1) initial training and"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000011625,
      "SummaryText": "awareness training; (2) refresher training; (3) documentation; and (4) and testing.  Each employee presently involved in operating the ethylene oxide process has been trained to receive the required knowledge, skills, and abilities to safely carry out the duties and responsibilities, including ethylene oxide emergency response, as provided in the operating procedures.  \n\nRefresher training is provided every three years or less to each employee operating the covered process to ensure that the employee understands and adheres to the current operating procedures.  In addition, the El Paso facility ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change as indicated in their Management of Change and/or Pre Startup Safety Review procedures.\n\nEl Paso facility prepares and retains records of initial and refresher training, which includes the identity of the employee, the date of training, and the signature of the person (s) administering the training.\n\nContractors\n\nThe El Paso facility has procedures and policies in place that ensure that contractors are properly informed of hazards, access limitations to hazardous process areas, emergency response procedures, and are prepared to safely complete the work.  The contractors are informed, prior to the initiation of the work at the site, of the applicable provisions of the emergency response plan.  The El Paso facility holds contractor safety briefings before allowing them near or in the process area, controls access to the process areas, and evaluates the contractorÂ¿s safety performance.\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nThe El Paso facility ensures that a pre-startup safety review is completed for any new process covered by this regulation, or for significant modifications to an existing covered process that requires a change in the process safety information.  The El Paso facility maintains the mechanical integrity of process equipme"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000011625,
      "SummaryText": "nt to help prevent equipment failures that could endanger workers, the public, or the environment.  The El Paso facility mechanical integrity program includes the following:\n\n* Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes and practice, and prior operating experience.\n\n* Implementation of the written procedures by performing inspections and tests on process equipment at specified intervals.\n\n* Training of maintenance personnel in preventive maintenance program procedures: safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions; and safe use and application of special equipment and/or unique tools.\n\nHot Work Permits and Management of Change \n\nThe El Paso facility requires employees and contractors to employ safe work practices when performing Hot Work in, on, or around the covered process.  The El Paso facility uses a permitting and training program to ensure that hot work is monitored and conducted safely on or near a process involving ethylene oxide.\n\nThe El Paso facility provides a system and approach to maintain and implement any management of change or modifications to equipment, procedures, chemicals, and processing conditions.  This system allows El Paso facility staff to identify and review safety hazards or provide additional safety, process, or chemical information to existing data before the proposed change would either compromise system safety or require training to be completed.\n\nInternal Compliance Audits\n\nInternal compliance audits will be conducted every three years to verify compliance with the programs and procedures contained in the RMP.  The El Paso facility will assemble an audit team that will include personnel knowledgeable in the Risk Management Program rule and in the process.  This team will evaluate whether the prevention program satisfies the requirements"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000011625,
      "SummaryText": "of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit will be documented, recommendations resolved, and appropriate enhancements to the prevention program will be implemented.\n\nIncident Investigation\n\nThe El Paso facility investigates all incidents that could reasonably have resulted in a catastrophic release (serious injury to personnel, the public, or the environment) so that similar accidents can be prevented.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff and added or used to revise operating and maintenance procedures.  There have been no such incidents involving the El Paso facility ethylene oxide system.\n\nFive-Year Accident History Summary\n\nNo ethylene oxide releases that could have caused safety or health hazard (deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the El Paso facility during the last five years.\n\nEmergency Response Program Summary\n\nThe El Paso facility is a non-responding facility, which means that the facility employees will not respond to ethylene oxide accidental relaese.  Instead the facility has coordinated with the local response agency to respond to any ethylene oxide release that may occur at the facility.\n\nThe main elements of the emergency response plan are: (1) initial discovery equipment and procedure, (2) response to an emergency, including procedures for immediate action and internal notifications, and (3) procedures for external notifications, including coordination with local agencies. \n\nPlanned Changes to Improve Safety\n\nNumerous changes to improve safety (recommended actions) were identified for the ethylene oxide"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000011625,
      "SummaryText": "system equipment and procedures in November 2003, when a process hazard analysis was performed.  This PHA was again reviewed on May 26, 2005.  All the recommendations were evaluated and documented. A PHA was conducted on the design of the new E2 Plant and recommendations are presently being implemented."
    }
  ]
}