{
  "FacilityID": 1000078522,
  "FacilityName": "Wurth International Trading America, Inc.",
  "FacilityStr1": "91 Grant Street",
  "FacilityStr2": null,
  "FacilityCity": "Ramsey",
  "FacilityState": "NJ",
  "FacilityZipCode": "07446",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34003",
  "LEPC": "Ramsey Boro LEPC",
  "FacilityLatDecDegs": "41.077113",
  "FacilityLongDecDegs": "-74.144521",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A2",
  "LatLongDescription": "CE",
  "FacilityURL": "34 pleasant hill road",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 940863897,
  "ParentCompanyName": "Wurth Group",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Johannes Hoenig",
  "OperatorStr1": "91 Grant Street",
  "OperatorStr2": null,
  "OperatorCity": "Ramsey",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07446",
  "OperatorZipCodeExt": null,
  "RMPContact": "Johannes Hoenig",
  "RMPTitle": "Head of Supply Chain",
  "FTE": 34,
  "OtherEPAFacilityID": "NJ0000229500",
  "EPAFacilityID": "100000241758",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-08-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097922,
      "AltID": "Aerosol Spray Can Storage",
      "FacilityID": 1000078522,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099164,
          "ProcessID": 1000097922,
          "NAICSCode": "42371",
          "_desc": {
            "NAICS_CODE": "42371",
            "NAICS_DESCRIPTION": "Hardware Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122839,
          "ProcessID": 1000097922,
          "ChemicalID": 155,
          "Quantity": 150000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000106399,
              "ProcessChemicalID": 1000122839,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000106400,
              "ProcessChemicalID": 1000122839,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000106401,
              "ProcessChemicalID": 1000122839,
              "ChemicalID": 130,
              "_chemical": {
                "ChemicalID": 130,
                "ChemicalName": "Methyl ether  [Methane, oxybis-]",
                "CASNumber": "115-10-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000106402,
              "ProcessChemicalID": 1000122839,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000622839,
          "ProcessID": 1000097922,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078522,
      "SummaryText": "Executive Summary - Aerosol Spray Can Storage and Distribution\n\nAerosol Spray Can Storage and Distribution\n\nWurth International Trading America, inc. (WITA) stores and distributes cases of aerosol spray cans containing flammable propellants, paints lubricants and sealants.  WITA is listed as being included in Code 423710 \"Hardware Merchant Wholesalers\" under The North American Industry Classification System (NAICS).\n\nOne covered process is present at the facility and has been identified as falling under the requirements of RMP/PSM/TCPA based upon federal and state regulations:\n\n?    Aerosol Spray Can Storage and Distribution\n\nSince  the concentration of the flammable substances is one percent or greater by weight of the mixture, and the mixture is under pressure,  for purposes of determining whether a threshold quantity is present at the facility, the entire weight of the mixture is treated as the regulated substance (unless the mixture itself does not have a National Fire Protection Association flammability hazard rating of 4).  The threshold for the applicable regulations is:\n\nRegulation    Material    Threshold (lbs)\n\nRMP    Flammable    10,000\n\nPSM    Flammable    10,000\n\nTCPA    Flammable    10,000\n\n\n\n\n\nSince the facility is planning to have a maximum storage capability of 150,000 lbs. the facility is preparing a Program 3 Risk Management Program under the New Jersey TCPA regulations.  The TCPA program will assure compliance with the above regulations.\n\nSummary of Security Plan\n\nProcedural and physical security measures are in place to deter, detect and delay a threat.  The complete security plan is outlined and discussed in the WITA Security Plan and is considered confidential.  Some highlights of the plan include adequate illumination of the site; surveillance cameras, limited door/gate access and controlled access levels throughout the facility.\n\nThe facility is located on a roughly rectangular property at the end of Grant Street and across from another Wurth owned facility in Ramsey,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078522,
      "SummaryText": " NJ.\n\nSite access security is maintained by locked doors.  Facility access security is maintained via locked exterior personnel and shipping/receiving overhead doors. Visitors are required to enter through the front entrance and sign in.  No unescorted visitors are permitted in the material storage, operations or production areas.  Delivery and shipment drivers check in with their respective loading docks for access.\n\nThe following is a list of some of the areas that are monitored.\n\nFront entrance gate\n\nProperty line/perimeter\n\nParking areas\n\nEmergency assembly area\n\nVisitor parking area\n\nLoading dock aprons/tertiary containment areas\n\nExterior access to shipping/receiving areas - overhead and personnel doors\n\nExterior office doors; exterior operations area doors\n\nExterior emergency exits\n\nInterior access to operations, shipping/receiving\n\nHazardous materials storage\n\nSpill Prevention\n\nSpill prevention and abatement means utilized at WITA include the following.\n\nAerosol cans are in cardboard boxes which are secured by having them stretch wrapped onto pallets.  \n\nThe packaging provides enough insulation to prevent failure until the cardboard ignites (after which, flammables from any failed can will be immediately ignited).\n\nThe barrier boxes are such that they would prevent a hot air layer from producing a large cloud of flammable gas due to failed cans.\n\nAerosols are stored in a hazardous storage area designed to contain flammable materials.\n\nStructural integrity of the building such that there would be protection from an external fire. In practice the outside wall of the hazardous materials storage is fire rated such that a fire scenario will not result in a VCE.\n\nA suitable sprinkler system is provided in the warehouse. Sprinkler systems installed in the area storing aerosol dispensers by code is deemed reliable enough to ensure that the risk of property loss is reduced to a reasonable level will have sprinkler heads that activate at about 70?C.  As it would be ne"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078522,
      "SummaryText": "cessary for the ambient temperature to be about 80?C to burst the aerosols, then the sprinklers would operate before the aerosol dispensers start to burst and the cooling effect will prevent burst, or at the very least disrupt the formation of a hot layer.\n\nFor an external fire there would need to be flammable material which could cause a significant fire close to the warehouse.  As there are no adjacent buildings this is not considered to be a likely scenario.\n\nHVAC and VOC Removal\n\nBuilding heating, cooling and ventilation systems are sized to provide the appropriate air flow and velocities necessary for the flammability class of Aerosol Spray Cans.  \n\nSprinkler and Fire Protection\n\nWITA's facility is fully sprinklered at the correct density and coverage for the materials stored including Aerosol Spray Cans.  \n\nAccidental Release Prevention and Response Policies and Procedures\n\nWITA has written procedures that address various phases of operations, such as receipt, inspection/testing, storage, and packing/shipping. These procedures are used as a reference by experienced team members and provide a basis for consistent training of new personnel.  These procedures are periodically reviewed and maintained as current and accurate. \n\nTraining\n\nTo complement the written procedures for operations, WITAhas implemented a specific training program for all employees potentially involved in working with Aerosol Spray Cans.  All training is been documented for each operator; supervisors verify that the operators understood the training.\n\nMaintenance\n\nWITA has developed procedures to maintain its facilities in a safe operating condition. Maintenance personnel have received training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure they can perform jobs in a safe manner. \n\nFive-Year Accident History\n\nWITA has had no AEROSOL SPRAY CANS accidents"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078522,
      "SummaryText": " in the past 5 years that impacted offsite areas.\n\nEmergency Response Program Information\n\nWITA maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to the operations or the processes.  The overall emergency response program for WITA is coordinated with the Local Emergency Planning Committee (LEPC).\n\nSafety\n\nWITA strives for continuous improvement in its safety programs.  Including training employees to safely perform assigned tasks and encouraging employees to suggest changes or improvements that will help improve safety and performance.  Preventative maintenance is performed to minimize the potential for unanticipated failure of operating equipment.\n\nWITA continuously reviews and updates prevention program elements, including written operating procedures, mechanical integrity programs, and the emergency response plan.  Recommendations identified during the process hazard review of the Aerosol Spray Cans equipment and procedures have been incorporated.\n\n"
    }
  ]
}