{
  "FacilityID": 1000112087,
  "FacilityName": "Domtar A.W. LLC Ashdown Mill",
  "FacilityStr1": "285 Highway 71 South",
  "FacilityStr2": null,
  "FacilityCity": "Ashdown",
  "FacilityState": "AR",
  "FacilityZipCode": "71822",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05081",
  "LEPC": "Little River LEPC",
  "FacilityLatDecDegs": "33.640278",
  "FacilityLongDecDegs": "-094.113056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 114415925,
  "ParentCompanyName": "Domtar Corporation",
  "Company2Name": null,
  "CompanyDUNS": 202169744,
  "Company2DUNS": null,
  "OperatorName": "Domtar A.W. LLC",
  "OperatorStr1": "285 Highway 71 South",
  "OperatorStr2": null,
  "OperatorCity": "Ashdown",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "71822",
  "OperatorZipCodeExt": "8356",
  "FTE": 599,
  "OtherEPAFacilityID": "71822nkspphighw",
  "EPAFacilityID": "100000059296",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "287-AOP-R24",
  "SafetyInspectionDate": "2013-08-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-03-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-03-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-03-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-03-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.64108,
  "FRS_Long": -94.11243,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000139554,
      "AltID": "Chlorine Dioxide",
      "FacilityID": 1000112087,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000174696,
          "ProcessID": 1000139554,
          "ChemicalID": 71,
          "Quantity": 56800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000141067,
          "ProcessID": 1000139554,
          "NAICSCode": "32211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000119898,
              "Process_NAICS_ID": 1000141067,
              "SafetyReviewDate": "2023-10-30 00:00:00",
              "PHA_Date": "2023-10-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-12-01 00:00:00",
              "TrainingReviewDate": "2023-12-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-02-15 00:00:00",
              "EquipmentInspectionDate": "2023-07-25 00:00:00",
              "EquipmentTested": "Erco Generator",
              "ChangeMgmtDate": "2023-02-06 00:00:00",
              "ChangeMgmtReviewDate": "2023-09-18 00:00:00",
              "PreStartupReviewDate": "2024-02-06 00:00:00",
              "ComplianceAuditDate": "2022-01-10 00:00:00",
              "AuditCompletionDate": "2022-10-13 00:00:00",
              "IncidentInvestigationDate": "2023-03-14 00:00:00",
              "InvestigationChangeDate": "2024-04-06 00:00:00",
              "ParticipationPlansReviewDate": "2022-03-07 00:00:00",
              "HotWorkPermitReviewDate": "2024-02-29 00:00:00",
              "ContractorSafetyReviewDate": "2019-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2023-09-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000150277,
                  "PreventionProgram3ID": 1000119898,
                  "ProcessChemicalID": 1000174696
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000112087,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-01-18 00:00:00",
    "ERTrainingDate": "2024-02-26 00:00:00",
    "CoordinatingAgencyName": "Little River County OES",
    "CoordinatingAgencyPhone": "8708987203",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000112087,
      "SummaryText": "Domtar A.W. LLC\nRisk Management Plan\n\n\n1.0\tEXECUTIVE SUMMARY\n\nDomtar A.W. LLC, Ashdown Mill is committed to operating in a manner that is safe for Ashdown Mill workers, the public, and the environment. As part of this commitment, the Company has established a system to help ensure safe operation of the hazardous chemical processes at this facility. One component of this system is a Risk Management Program (RMP) that helps manage the risks at the facility and addresses compliance with the requirements of the Environmental Protection Agency's (EPA) Regulation, 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP Rule). One of the requirements of the RMP Rule is to submit a Risk Management Plan (RMP) describing the Risk Management Program at the Domtar A.W. LLC, Ashdown Mill. This document is intended to satisfy the RMP requirements of the RMP Rule and to provide the public with a description of the Risk Management Program at the facility.\n\nThe Risk Management Program at the facility consists of the following elements:\n\n\u0095\tA hazard assessment to help understand (a) the potential off-site consequences of hypothetical accidental releases and (b) accidents that may have occurred during the last five years associated with the use of the substance regulated by the RMP Rule \n\t\n\u0095\tA prevention program to help maintain and safely operate the processes containing more than the threshold quantity of the regulated substance (covered process)\n\t\n\u0095\tAn emergency response program to help respond to accidental releases of the regulated substance from the covered process.\n\n\u0095\tA management system that assigns responsibility for specific elements of the program.  These elements include the preparation and maintenance of the hazards assessment, accident prevention program (including OSHA PSM), and emergency response plan, Risk Management Plan preparation, submittal, and communication.  This system ensures that Ashdown Mill employees work as a responsible an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000112087,
      "SummaryText": "d accountable team, ensuring that the Mill operates in a safe and reliable manner, protecting workers, the community, and the environment.\n\nInformation further describing these elements is provided in this RMP.\n\nAlthough the Risk Management Program at the facility helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety program at Ashdown Mill. In fact, the facility has a comprehensive safety program in place establishing many levels of safeguards that are designed to minimize the potential for the release of any hazardous substance and injuries and damage resulting from the release of a hazardous substance.\n\nAshdown Mill minimizes the potential releases of the hazardous substances used at the facility. When hazardous substances are used at the facility, the equipment is carefully designed, built, and operated to reduce the likelihood of an accidental release. Industry and government standards are closely adhered to in design, construction, and operation of the equipment.\n\nAshdown Mill limits damage from a release, if such a release occurs. The facility trains workers to respond to upset conditions, reducing the consequences of a release if it occurs. In addition, the facility will be working with the Local Emergency Planning Commission (LEPC) to reduce the potential for injuries and/or environmental damage to occur in the event of a release. \n\nThe safety program at Ashdown Mill consists of a number of elements, only some of which are required by the RMP Rule. This RMP is primarily intended to describe those parts of the safety program at the facility that are required by the RMP Rule.\n\n\n1.1\tACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \n\nAshdown Mill is committed to the safety of workers and the public, as well as the preservation of the environment through the prevention of accidental releases of hazardous substances. The facility implements reasonable controls to prevent foreseea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000112087,
      "SummaryText": "ble releases of the hazardous substances. These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of the processes; and programs to evaluate the hazards at the facility.\n\nIn the event of an accidental release, the facility will control and contain the release in a manner that will be safe for workers and will help prevent injury to the public and/or the environment. Ashdown Mill provides response training for upset conditions to facility personnel, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with the local emergency response organizations.\n\nIn order to effectively implement these policies, the facility has established a management system directed by the General Manager.\n\n\n1.2\tDOMTAR A.W. LLC AND REGULATED SUBSTANCES\n\nDomtar A.W. LLC is a pulp and paper mill primarily involved in the manufacture of bleached paper products. As part of this manufacturing process, the facility produces and stores Chlorine Dioxide (Cl02) for the use of bleaching pulp.  The Chlorine Dioxide System, which includes the generation, storage and distribution of chlorine dioxide, is considered an RMP covered process in Program Level 3.\n\n\t\n1.3 ACCIDENTAL RELEASE PREVENTION PROGRAM\n\t\n\tDomtar A.W. LLC has always used a prevention program to help prevent accidental releases of hazardous substances. Beginning in 1992, the facility formalized this prevention program for the Chlorine Dioxide System to comply with the 14 elements of the Occupational Safety and Health Administration\u0092s (OSHA) Process Safety Management (PSM) prevention program. In 1996, the EPA RMP Rule established that a Program Level 3-prevention program would become a requirement for this process as well. The facility's Program Level 3 Prevention Program under the RMP Rule is essentially the same as the OSHA PSM Program, except that the program also focuses on protecting the public and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000112087,
      "SummaryText": "the environment. \n\t\n\tThe following paragraphs briefly describe the elements of the Domtar A.W. LLC Program Level 3 prevention program that addresses the EPA RMP Rule prevention program requirements for the Chlorine Dioxide System.\n\t\n\t1.3.1 Employee Participation The facility has developed a written employee participation program for the covered process to help ensure that the safety concerns of Ashdown Mill employees are addressed. The facility encourages active participation from personnel in the development and maintenance of the prevention program activities of all processes at the facility. Employees are consulted on, and informed about, all aspects of the RMP Rule prevention program, including the development of Process Hazard Analysis and Operating Procedures.\n\t\n\t1.3.2 Process Safety Information The facility maintains a variety of technical documents that are used to help ensure the safe operation of the processes. The documents address (1) the hazards of the chemicals used in the process, (2) the technology data of the process and (3) the design basis and configurations of the equipment used in the processes. The facility ensures that this process safety information is maintained, accurate, and available to all Ashdown Mill employees, and the LEPC. All of the information and documentation for the RMP Prevention Program is maintained in the PSM/RMP Center at the facility.\n\t\n\tSafety Data Sheets (SDS) document the physical and chemical properties of the hazardous substances handled at the facility, including non-regulated substances in the covered process. SDS for hazardous substances handled in each process are available in the control rooms so the operators have ready access to this information. In addition, SDS are provided to the LEPC and/or Plant Emergency Response teams for use in helping formulate emergency response plans.\n\t\n\tMany of the operating parameters are included in the technology information to help with the safe operation of the process. These"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000112087,
      "SummaryText": "documents are also used (1) to train employees, (2) to perform process hazard analysis, and (3) to help maintain the equipment to the design specification.\n\t\n\t1.3.3 Process Hazard Analysis.  Ashdown Mill performs and periodically updates process hazard analyses (PHAs) of the covered process to help identify process hazards and generate recommendations that might improve the safe operation of the process. A team composed of personnel with engineering and process operating experience and a team leader with experience in performing process hazard analyses is assembled to analyze the process. The facility primarily uses the \"Hazard and Operability\" (HAZOP) and/or \"What If'\u0094 technique, supplemented with checklists, to perform this analysis. The PHA team prepares a written report describing the results of the analysis, including recommendations. Responsibility for resolving the recommendations is assigned to personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\t\n\t1.3.4 Operating Procedures. Ashdown Mill operators, supervisors, and engineers work together to develop and maintain accurate operating procedures to define how tasks related to process operations should be safely performed. The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and upset operating conditions. The operating procedures include:\n\t\n\t-\tSteps for safely conducting activities\n\t\n\t-\tApplicable process safety information, such as safe operating limits and consequences of process deviations\n\t\n\t-\tSafety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs\n\t\n\tThe facility personnel develop and maintain operating procedures that cover all phases of the operations, including initial start-up, normal operations, normal shutdown, emergency shutdown, start-up following"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000112087,
      "SummaryText": "a standby condition, and temporary operations. The facility reviews and certifies the operating procedures annually.\n\t\n\t1.3.5 Training. Ashdown Mill trains employees to safely and effectively perform their assigned tasks. The facility training program for employees involved in operating the process includes both the initial training and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substance in the process, and (3) a detailed review of the process operating procedures and safe work practices. Written tests and oral reviews are used to verify that the employee understands the training materials before the employee can be involved in operating the process.\n\t\n\tThe operators are consulted annually about the frequency of the training and the materials to be used for the training. Recommendations from the operators are reviewed and changes to the training are implemented as appropriate.\n\t\n\t1.3.6 Contractors.  Ashdown Mill has established a program to help ensure that contractor activities at the facility are performed in a safe manner. The program reviews the safety record of all contractors to help ensure that the facility only hires contractors who can safely perform the desired job tasks. Ashdown Mill explains to the contract supervisors the hazards of the process on which they and their employees will work, the facility safe work practices, and the emergency response procedures for the facility. The facility requires that the contractor supervisor train each of their employees who will work on or near a covered process before that employee begin work at the site. The facility periodically reviews contractors' training documents and work performance to ensure that safe practices are followed.\n\t\n\t1.3.7 Pre-startup Safety Reviews.  Ashdown Mill performs a safety review of new or modified equipment in the covered process before the process is placed into service to help ensure that the process has been prepared"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000112087,
      "SummaryText": "to operate safely. This review confirms that:\n\t\n\t-\tConstruction and equipment are in accordance with design specifications\n\t\n\t-\tAdequate safety, operating, maintenance and emergency procedures are in place\n\t\n\t-\tEmployee training has been completed\n\t\n\t-\tFor a covered process, a PHA has been performed if the process is new or management of change requirements have been completed if an existing process has been modified.\n\t\n\tA pre-startup safety review checklist is completed to document the review and to ensure that the appropriate issues have been addressed.\n\t\n\t1.3.8 Mechanical Integrity.  Ashdown Mill maintains the mechanical integrity of the covered process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. The facility mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in the Ashdown Mill covered process. The facility mechanical integrity program also includes:\n\t\n\t-\tSpecifications for inspection and testing of process equipment\n\t\n\t-\tSpecifications for replacement parts and equipment\n\t\n\t-\tStandard maintenance procedures for inspecting, testing, and maintaining process equipment\n\t\n\t-\tProcedures for safe work practices such as lockout/tag out, hot work, and confined space entry\n\t\n\t-\tTraining of maintenance personnel\n\t\n\t-\tDocumentation of maintenance activity\n\t\n\t1.3.9 Hot Work Permit.  Ashdown Mill has established a hot work permit program to control spark or flame- producing activities that could result in fires or explosions in covered processes at the facility. The facility reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit form to comply with these requirements. Personnel who are to perform hot work are required to fil"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000112087,
      "SummaryText": "l out the Hot Work Permit form. The supervisor reviews the completed form before work can begin.\n\t\n\t1.3.10 Management of Change.  The Ashdown Mill \u0093management of change\u0094 program evaluates and approves all proposed changes to chemicals, equipment, and procedures for a covered process to help ensure that the change does not negatively affect safe operations. Process changes that are determined to be a replacement in kind are allowed without completing a \u0093management of change\u0094 form. All other changes must be confirmed through the \u0093management of change\u0094 program to help ensure that inadvertent consequences of the process changes are prevented, safety consequences of the changes are addressed, affected process safety information and operating procedures are updated, and affected employees are notified of the changes.\n\t\n\t1.3.11 Incident Investigations.  Ashdown Mill investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented. The facility trains employees to identify and report any incident requiring investigation. An incident investigation team is assembled, and the investigation is initiated within 48 hours of the incident. The results of the investigations are documented, recommendations are resolved and appropriate process enhancements are implemented.\n\t\n\t1.3.12 Compliance Audits.  Ashdown Mill audits the covered process to be certain that the facility's prevention program is effectively addressing the safety issues of the operations. The facility assembles an audit team that includes personnel knowledgeable in the RMP Rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP Rule and also whether the prevention program is sufficient to help ensure safe operations of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention progr"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000112087,
      "SummaryText": "am are implemented.\n\t\n1.3.13\tChemical-specific Prevention Steps.  In addition to the required prevention program elements, Ashdown Mill has implemented safety features specific to the Chlorine Dioxide System. Chlorine Dioxide is produced at the facility and stored as a diluted aqueous solution to avoid the necessity of transporting large quantities of the solution. Chlorine dioxide gas is produced in the chlorine dioxide generator and piped to an absorber column, where as high as 12.0 gram-per-liter (1.2 wt. %) strength solution is produced.\n\t\n\t\n1.4\tFIVE-YEAR ACCIDENT HISTORY\n\t\n\t1.4.1\tChlorine Dioxide.  There have been no accidents over the last five years involving the release of chlorine dioxide that resulted in a death, injury or significant property damage on or off-site. \n\t\n\t\n1.5\tEMERGENCY RESPONSE PROGRAMS\n\t\n\tDomtar A.W. LLC has established a written emergency response program to help safely respond to accidental releases of hazardous substances. The emergency response plan includes procedures for:\n\t\n\t-Informing the local response organizations and the public about accidental releases that could reasonably result in off-site consequences\n\t\n\t-Providing proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances at the facility\n\t\n\t-Controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment\n\t\n\t-Inspecting and maintaining emergency response equipment\n\t\n\t-Reviewing and updating the emergency response plan\n\t\n\tThe facility maintains an emergency response team trained in this emergency response program. All the facility personnel are trained in evacuation procedures. The facility periodically conducts emergency response drills, including an annual drill coordinated with the local fire department.\n\t\n\tThe written emergency response plan complies with other federal contingency plan regulations and will be communicated to local emergency response officials throug"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000112087,
      "SummaryText": "h the Local Emergency Planning Committee. The facility maintains a regular dialogue with the local emergency response organizations and provides appropriate information to them."
    }
  ]
}