{
  "FacilityID": 1000008301,
  "FacilityName": "COLE'S QUALITY FOODS, INC.",
  "FacilityStr1": "1188 LAKESHORE DRIVE",
  "FacilityStr2": null,
  "FacilityCity": "MUSKEGON",
  "FacilityState": "MI",
  "FacilityZipCode": "49441",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26121",
  "LEPC": "Muskegon County LEPC",
  "FacilityLatDecDegs": "43.226111",
  "FacilityLongDecDegs": "-086.273611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 17266065,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mk\\ike Hulsebos",
  "OperatorStr1": "1188 Lakeshore Drive",
  "OperatorStr2": null,
  "OperatorCity": "Muskegon",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49441",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Hulsebos",
  "RMPTitle": "V. P. of Operations",
  "FTE": 118,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000147502",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-08-07 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.22606,
  "FRS_Long": -86.27336,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009546,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000008301,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000009887,
          "ProcessID": 1000009546,
          "NAICSCode": "311812",
          "_desc": {
            "NAICS_CODE": "311812",
            "NAICS_DESCRIPTION": "Commercial Bakeries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000010811,
          "ProcessID": 1000009546,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000510811,
          "ProcessID": 1000009546,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008301,
      "SummaryText": "ColeA?s Quality Foods, Inc.\nMuskegon, MI  \n\nRisk Management Plan\n\nExecutive Summary\n\n\n1.  Accidental Release prevention and emergency response policies:\n\nCole's Quality Foods, Inc.  Facility in Muskegon, MI uses anhydrous ammonia as a refrigerant.  This chemical is considered hazardous by the EPA and necessitates the highest level of operation and maintenance management to safely handle this chemical.  The use of ammonia is generally safe provided appropriate maintenance and operating controls are exercised.  The personal health and safety of our employees and that of our neighbors has always been of primary importance.  To the greatest degree possible, Cole's management provides all mechanical and physical equipment required for personal safety and health, in keeping with the highest standards in our industry.  \n\nThe emergency response program is a cooperative effort between on-site response detection equipment, personnel and governmental authorities.  The emergency response plan includes notification of plant personnel, local off-site emergency responders and potentially affected neighbors for emergency situations.\n\n2.  The stationary source and regulated substances handled:\n\nThis facility is primarily involved with the baking of bread products.  It is in operation five to seven days per week.  The product must be refrigerated and/or frozen to provide a quality product to our customers.  As described above, we use an anhydrous ammonia refrigeration system to accomplish this need.  The system is a closed loop process and does not normally necessitate re-filling or unloading of ammonia.  Access to the entire facility is controlled and further access to the ammonia process is limited to authorized employees and approved contractors.\n\nThe maximum amount of anhydrous ammonia contained in the process is 14,000 lbs.\n\n3.  The worst case release scenario and alternative release scenario:\n\nWorst Case Scenario - Failure of the high pressure receiver and subsequent release of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008301,
      "SummaryText": " entire contents of ammonia in the system would release 14,000 lbs. of anhydrous ammonia.  The distance to the endpoint (200 ppm) is 1 mile.\n\nAlternative Scenario - A failure of a flange or pipe on the high pressure portion of the system resulting in a release of liquid anhydrous ammonia from a 1/4\" orifice.  Ammonia detection systems would immediately notify personnel and low pressure interlocks would limit the loss of ammonia.  The distance to the endpoint (200 ppm) would be .1 of a mile.  This release has the possibility of extending beyond the facility boundary.\n\n4.  General accidental release prevention program and chemical specific prevention steps:\n\nThe ammonia refrigeration system was built in 1990 and designed and constructed in accordance to ANSI/ASH RAE 15 - 1989.  The system utilizes a computer run control process to reduce the possibility of human error and the computer monitors the operation of the process continually.  The computerized detection system automatically sounds an alarm in the facility and automatically notifies the site emergency coordinator.  In addition, a security company monitors the system 24 hours a day, seven days a week for any abnormal conditions.\n\nA specialized refrigeration maintenance contractor is responsible for maintaining the system to the highest standards while Cole's maintenance personnel continually check the operation and status of the system.\n\n5.  Five year accident history\n\nWe have not had a reportable release of anhydrous ammonia in the past five years.\n\n6.  The emergency response program:\n\nThe emergency response program is based on both on-site and off-site emergency response plans.  These plans are coordinated through the local emergency planning committee.  The Emergency response unit for our facility is the City of Muskegon Fire Department.  Also, the responding unit for a hazardous materials release is the Muskegon HazMat Team.  Each of these units have been on-site and toured the facility including a review o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008301,
      "SummaryText": "f all pertinent facts about the system and hazards.  \n\n7.  Planned changes to improve safety\n\nIn 2009 we will provide refresher training on the overview of the system for the RMP team as well as the maintenance staff.  The training will be provided thru our refrigeration contractors who installed our system.  Targeted completion date is before 10/1/09.  \n\nA meeting with the Secretary of the LEPC has been scheduled for 6/23/09 to review and update the City of Muskegon Hazmat Response Guide for ColeA?s.\n\nNew Since Last Submission:  Tracking and managing the scheduled maintenance on the ammonia system was greatly improved by installing an MP2 maintenance program in the spring of 2008.   The MP2 program is an organized accountable maintenance program with the ability to organize and track inventory; track equipment history; schedule preventive maintenance tasks; generate and track work orders; as well as project equipment failure and maintenance needs. The MP2 program replaces a file card system of notifying and scheduling the ammonia system maintenance schedule.  \n"
    }
  ]
}