{
  "FacilityID": 1000090866,
  "FacilityName": "Whirlpool Corporation - Amana Division",
  "FacilityStr1": "2800 220th Trail",
  "FacilityStr2": null,
  "FacilityCity": "Amana",
  "FacilityState": "IA",
  "FacilityZipCode": "52204",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19095",
  "LEPC": "Iowa County LEPC",
  "FacilityLatDecDegs": "41.79364",
  "FacilityLongDecDegs": "-91.89908",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "G1",
  "LatLongDescription": "PP",
  "FacilityURL": "WWW.Whirlpool.com",
  "FacilityEmailAddress": "misti_l_huedepohl@whirlpool.com",
  "FacilityDUNS": 5277678,
  "ParentCompanyName": "Whirlpool Corporation",
  "Company2Name": null,
  "CompanyDUNS": 5265689,
  "Company2DUNS": 0,
  "OperatorName": "Whirlpool Corporation",
  "OperatorStr1": "2800 220th Trail",
  "OperatorStr2": null,
  "OperatorCity": "Amana",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52204",
  "OperatorZipCodeExt": null,
  "RMPContact": "Matthew Helmuth",
  "RMPTitle": "Senior EHS Manager",
  "FTE": 3500,
  "OtherEPAFacilityID": "52204MNRFRFIRST",
  "EPAFacilityID": "100000245745",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-07-15 00:00:00",
  "SafetyInspectionBy": "Iowa State Fire Marshal",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-03-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-03-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-03-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112936,
      "AltID": "R600a",
      "FacilityID": 1000090866,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000114289,
          "ProcessID": 1000112936,
          "NAICSCode": "33522",
          "_desc": {
            "NAICS_CODE": "33522",
            "NAICS_DESCRIPTION": "Major Household Appliance Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000141138,
          "ProcessID": 1000112936,
          "ChemicalID": 107,
          "Quantity": 95880.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000641138,
          "ProcessID": 1000112936,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090866,
      "SummaryText": "(A)    Facility Policy:  Whirlpool Corporation - Amana Division (Whirlpool) is committed to the prevention of accidental releases of the refrigerant R600a, Isobutane [Propane, 2-methyl] (R600a), through the design and use of proper equipment, regular inspections, maintenance and training of all persons who work with R600a at the facility.  Should an accidental release occur, Whirlpool has coordinated with local emergency responders to appropriately respond to such an event and minimize the impact to people and the environment.\n\n\n\n(B)    Facility Information:  Whirlpool manufactures refrigerators at the facility, which includes the storage, distribution and dispensing of R600a.  R600a is stored in bulk in two 12,000-gallon capacity tanks that are interconnected by piping to transfer the R600a from the tank storage area to dispensing machines in the production building.  The dispensing machines are designed to meter in the required amount of refrigerant into each refrigerator unit.  The design and construction of the R600a tank storage area, which conforms to NFPA 58, has been approved by the Iowa State Fire Marshal.   \n\n\n\n(C)    Accidental Release Prevention Program:  This facility complies with applicable requirements governing the storage and handling of R600a, including NFPA 58 (Liquified Petroleum Gas Code) and other requirements defined by the Iowa State Fire Marshal, United States Environmental Protection Agency, Iowa Department of Natural Resources and the United States Department of Labor, Occupational Safety and Health Administration.  The R600a tank storage area is equipped with gas detectors and a tank sprinkler / deluge system, and the R600a distribution system is equipped for remote monitoring to verify that process variables for pressure, flow and temperature are within acceptable limits.  Dispensing machines are equipped with safety interlocks to avoid leakage of R600a during the charge cycle, and all dispensing locations in the facility building are located wi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090866,
      "SummaryText": "thin a Class 1, Division 2 mechanically ventilated space that is continuously monitored by an independent safety system with gas detectors, alarms and exhaust air fans. Whirlpool has implemented facility policies to address the requirements for Program Level 3 processes, which include the hot work permit system, emergency response plan, incident investigation program, and contractor safety program. \n\n\n\n(D)    Emergency Response Program:  Prior to receipt of the test load of R600a at the facility (below the Risk Management Plan threshold quantity), Whirlpool reached out to the local community, fire department and LEPC to inform the public of the future use, storage and handling of R600a.  Whirlpool emergency coordinators are trained to respond to accidental releases of R600a, which would be detected by gas detection equipment located throughout the process.  Whirlpool has implemented an emergency plan for the facility that includes specific protocols for employees and first responders regarding emergency response. Local Fire Chief has been on site In Nov 2020, February 2021 and March 2021 regarding this project, and there has been constant correspondence between Whirlpool and the LEPC.\n\n\n\n(E)    Planned Changes to Improve Safety:  Process safety improvement is a priority for Whirlpool.  Periodic inspections and assessments are completed to ensure safe practices and operations at the facility.  There are no additional specific R600a safety recommendations for implementation at this time.\n\n"
    }
  ]
}