{
  "FacilityID": 1000090022,
  "FacilityName": "Watco Transloading, LLC - Wood River Terminal",
  "FacilityStr1": "435 N. Old Saint Louis Rd",
  "FacilityStr2": null,
  "FacilityCity": "Wood River",
  "FacilityState": "IL",
  "FacilityZipCode": "62095",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17119",
  "LEPC": "Madison County LEPC",
  "FacilityLatDecDegs": "38.871765",
  "FacilityLongDecDegs": "-90.104929",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.watco.com",
  "FacilityEmailAddress": "Kim.Gardner@watco.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Watco Transloading, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Kim Gardner",
  "OperatorStr1": "435 N. Old Saint Louis Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Wood River",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62095",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000245424",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "No inspections within last 5 years.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-10-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-10-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-10-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000111969,
      "AltID": "Storage of Railcars",
      "FacilityID": 1000090022,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000140013,
          "ProcessID": 1000111969,
          "ChemicalID": 129,
          "Quantity": 120700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000140012,
          "ProcessID": 1000111969,
          "ChemicalID": 107,
          "Quantity": 123250.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000140011,
          "ProcessID": 1000111969,
          "ChemicalID": 118,
          "Quantity": 118490.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000140038,
          "ProcessID": 1000111969,
          "ChemicalID": 98,
          "Quantity": 120700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000113302,
          "ProcessID": 1000111969,
          "NAICSCode": "48821",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000095517,
              "Process_NAICS_ID": 1000113302,
              "SafetyReviewDate": "2024-05-14 00:00:00",
              "PHA_Date": "2024-05-14 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Railcar storage only; no process or offloading.",
              "PHACompletionDate": "2024-05-14 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Storage only; no process or offloading.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Storage only; no process or offloading.",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Storage only; no process or offloading.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-05-14 00:00:00",
              "TrainingReviewDate": "2024-05-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-05-14 00:00:00",
              "EquipmentInspectionDate": "2024-05-14 00:00:00",
              "EquipmentTested": "Visual inspection of onsite railcars",
              "ChangeMgmtDate": "2022-05-27 00:00:00",
              "ChangeMgmtReviewDate": "2022-05-27 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2024-05-14 00:00:00",
              "AuditCompletionDate": "2024-05-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2020-05-27 00:00:00",
              "HotWorkPermitReviewDate": "2020-05-27 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000119336,
                  "PreventionProgram3ID": 1000095517,
                  "ProcessChemicalID": 1000140011
                },
                {
                  "PrimaryKey": 1000119337,
                  "PreventionProgram3ID": 1000095517,
                  "ProcessChemicalID": 1000140012
                },
                {
                  "PrimaryKey": 1000119338,
                  "PreventionProgram3ID": 1000095517,
                  "ProcessChemicalID": 1000140013
                },
                {
                  "PrimaryKey": 1000119376,
                  "PreventionProgram3ID": 1000095517,
                  "ProcessChemicalID": 1000140038
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000090022,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-05-14 00:00:00",
    "ERTrainingDate": "2024-05-14 00:00:00",
    "CoordinatingAgencyName": "Wood River Fire Department",
    "CoordinatingAgencyPhone": "6182590984",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000090022,
      "SummaryText": "ger, Environmental Manager and Divisional Safety Manager will review the PSM Manual every 5 years at a minimum to verify that the procedures and practices as described in the PSM Manual and per the standard are adequate and being followed.  All findings during the audit of the covered storage operation shall be documented, corrective actions identified during the audit, and create an action plan to correct deficiencies in a timely manner. \n\nFive Year Accident History:\n\nNo fires or loss of containment within last 5 years.\n\nEmergency Response Program:\n\nThe WTPS Wood River facility has an Emergency Action Plan for the facility that identifies all anticipated emergencies that can be reasonably expected to occur. All facility personnel are trained on the Emergency Action Plan and expected team member responses to the identified emergencies. The team at the WTPS Wood River facility are not subject to the hazardous waste and response provisions contained in 29CFR1910.120(a), (p) and (q), also known as the HAZWOPER regulations, as the team do not participate in clean-up operations but use 3rd party contractors.\n\nIt is important to note that should a leak occur on a loaded railcar, it would in all probability occur at one of the product or vapor valves not being tightened to the appropriate tool tight condition as per 49CFR173.31(d)(1)(iv).  In the event a leak is discovered by and/or reported to the WTPS Wood River Terminal Manager, he will immediately notify the customer, P66 Wood River Refinery, of the railcar number and the condition so appropriate action can be taken to have the leak secured. \n\nThe overall emergency response program for the Watco facility is coordinated with the Wood River Fire Department and the Madison County Local Emergence Planning Committee (LEPC). This coordination includes periodic meetings of the committee. The facility will conduct periodic reviews and orientation with local responders."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000090022,
      "SummaryText": "ent does not apply to the storage operation. \n\nManagement of Change (MOC):\n\nThe MOC Section of the PSM standard requires that the employer establish and implement written procedures to manage changes to procedures and changes to facilities that affect a covered process. Watco has an established Watco Management of Change procedure in place that meets the requirements of the PSM standard.\n\nIncident Investigation:\n\nThe Terminal Manager along with the Environmental Manager and  Divisional Safety Manager assigned the WTPS Wood River facility shall investigate incidents which resulted in, or could reasonably have resulted in a catastrophic release of highly hazardous chemical in the workplace.  An incident investigation shall be initiated within 24 hours, but no later than 48 hours following the incident.  An incident investigation team shall be established and consist of at least one person knowledgeable in the process involved, including a WATCO team member if the incident involved our work, and other persons with appropriate knowledge and experience to thoroughly investigate and analyze the incident.  \n\nWatco utilizes a web-based incident reporting system, known as KMI to document the First Report of the Incident, the Investigation of the Incident, the Corrective Actions identified during the investigation, and the Action Items used to complete the identified Corrective Actions. \n\nThe report prepared in the web based system at the conclusion of the investigation includes at a minimum each of the following information:  date of incident, date investigation began, a description of the incident, the factors that contributed to the incident, and any recommendations resulting from the investigation.  The report shall be reviewed with all affected personnel whose job tasks are relevant to the incident findings including WATCO team members where applicable. Incident investigation reports shall be retained for five years.\n\nCompliance Audits:\n\nThe WTPS Wood River Terminal Mana"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000090022,
      "SummaryText": "cilities are kept electronically through a system known as InfoRail. Training log sheets and other documentation can be attached to the InfoRail record of training.  Refresher training of Watco Team Members is provided at a minimum of every three years or more often as necessary to assure the team member understands and adheres to the operating procedures of the covered operations.\n\nContractors:\n\nThe facility currently does not allow repairs to be performed on any of the railcars within the facility. There are no PSM covered contractors as per 29CFR1910.119(h)(1) performing work within the facility therefore this element of the PSM standard does not apply to the WTPS Wood River facility. \n\nPre Startup Safety Review:\n\nAs the facility does not have specific processes where stored products are physically transferred, a formal Pre Start-up Safety Review as specified in 29CFR1910.119 is not required. \n\nMechanical Integrity:\n\nThe equipment being used for the storage of the Propylene/Butane for the customer P66 Wood River Refinery are railcars. There are no piping systems, emergency shutdown systems, controls (such as monitoring devices and/or alarms), or pumps in use. The railcars are considered to be a stand alone storage vessel and each is equipped with a pressure relief device.  The railcars that are being used for this storage operation are DOT105 or DOT112 pressure railcars which, are equipped with a protective housing and guarding for the various loading/unloading valves and pressure relief devices.  Each pressure railcar has a re-closing Pressure Relief Device (PRD) that is set by the manufacturer and installed by the railcar manufacturer. Depending upon the design pressure the railcar was built to determines the pressure of the installed PRD on the railcar. \n\nAuthorization for Hazardous Tasks:\n\nWhile this section deals primarily with Hot Work, there is currently no Hot Work that is performed or permitted within the WTPS Wood River facility therefore, this elem"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090022,
      "SummaryText": "process that involves the handling or use of the products to review therefore this element of the PSM standard does not apply to this operation.  The Terminal Manager conducts daily, when on duty, visual inspections of the railcars in storage to visually verify there is no evidence of tampering, product leak or release of any magnitude of product stored in the railcars within the facility.  \n\nIt is important to note that should a leak occur on a loaded railcar, it would in all probability occur at one of the product or vapor valves not being tightened to the appropriate tool tight condition as per 49CFR173.31(d)(1)(iv). In the event a leak is discovered by and/or reported to the Terminal Manager, they will immediately notify the customer, P66 Wood River Refinery, of the railcar number and the condition so appropriate action can be taken to have the leak secured. \n\nOperating Procedures:\n\nThe WTPS Wood River facility is a switching yard and is operated through the WTPS division. All switching operations are conducted as per FRA (Federal Railroad Association), GCOR (General Code of Operating Rules), and ABTH (Air Brake Train Handling) regulations in addition to Watco SSI's (Special System Instructions) and any current General Orders for Watco Switching Operations. There are no operations that require personnel to have any contact with the products either Propylene/Butane during the storage operations. \n\nTraining:\n\nWTPS provides all required periodic and annual training for team members assigned to the facility. The Terminal Manager, Environmental Manager and the Divisional Safety manager work together to ensure all required training is completed in a timely manner prior to its due date.  Training is documented through Training Log Sheets that each team member signs as acknowledgement that they attended the specific training session. Training is also conducted via CBT (Computer Based Training) if applicable.  All training and qualification records for regulated rail fa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090022,
      "SummaryText": "d any recognized and/or potential hazards/exposures they may encounter.  Additionally the team is given an opportunity to report any issue they may have encountered and were not able to correct. Job Briefings and/or Job Safety Analysis are documented on the Watco Job Briefing and/or JSA/Risk Assessment Forms which are then available for review by any visitors to the facility. \n\nProcess Safety Information:\n\nThe process safety information for the WTPS Wood River Transload Terminal railcar storage of Propylene/Butane includes information pertaining to the hazards of the highly hazardous chemicals stored in the railcars at the WTPS Wood River facility. This information shall be provided by P66 Wood River Refinery in the form of current Safety Data Sheets (SDS) meeting the requirements of 29CFR1910.1200(g) for each of the products. The current SDS's shall be maintained in the SDS Binder located in the facility operations office.  There is no process involving the Propylene/Butane railcars within the WTPS Wood River facility.  \n\nEquipment used in the operation are railcars that are built to AAR requirements based on the railcar specifications in effect as of the date built. Railcars that are used for the storage of Propylene/Butane are Pressure type railcars that are DOT105 and/or DOT112 railcars. Railcar specification sheets for applicable railcars are included in the appendix of the PSM Manual. The build dates are stenciled on the side of the railcar located just to the left of and below the Railcar Qualification Stencil. The DOT specification is located just above the Qualification Stencil located on each side of the railcar.  Qualification Stencils are visually checked for ensuring that all dates are current and within the qualification due dates for those railcars being used for the Propylene/Butane storage for the Watco Wood River customer, P66 Wood River Refinery. \n\nProcess Hazards Analysis:\n\nAs this is a Propylene/Butane Railcar Storage only operation, there is no"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090022,
      "SummaryText": "Executive Summary:\n\nWatco Terminals and Port Services (WTPS), has been safely storing rail cars at this Wood River Transload Terminal in Wood River, Illinois since 2020. WTPS is committed to maintaining the high levels of safety and operational performance of its rail yard. \n\nDescription of the Stationary Source and Regulated Substances:\n\nThere is no operation that involves the product in the railcars; therefore, there is no actual process that is carried out on site.\n\nThe WTPS Wood River Transload Terminal contains one 350-gallon diesel fuel aboveground storage tank (AST) located on the eastern portion of the facility. There are two large propane tanks located on the central and western portion of the facility. \n\nToxics:\n\nThere are no listed toxic substances above EPA threshold quantitates.\n\nFlammables:\n\nButane (CAS 106-97), Isobutane (CAS 75-28-5), Propane (CAS 74-98-6) and Propylene (CAS 115-07-1).  Propane and Propylene are stored in railcars as a mixture.\n\nGeneral Accidental Release Prevention Program:\n\nThe accidental release prevention programs and contingency planning efforts help the railyard effectively manage the potential hazards posed by this product to its employees, the community and the environment by our storage of these substances.  The following is a summary of the accidental release prevention programs in place for the covered process at the facility. The facility is regulated by the Environmental Protection Agency's (EPA's) Risk Management plan (RMP) regulations and classed as a Program Level 3. This summary addresses each of the PSM elements and describes the management system in place to implement the accident prevention program.\n\nEmployee Participation:\n\nTeam members are trained on the requirements of the PSM Manual for the Propylene/Butane Storage and have been included in the Facility Risk Assessment for the Storage Operation.  Each morning a Job Briefing is held with the team on what operations will be conducted during the shift that day an"
    }
  ]
}