{
  "FacilityID": 1000118440,
  "FacilityName": "Red Cedar Gathering Company, Arkansas Loop Plant",
  "FacilityStr1": "2843 CR 310",
  "FacilityStr2": "NW 1/4 Section 1, T32N, R9W",
  "FacilityCity": "Durango",
  "FacilityState": "CO",
  "FacilityZipCode": "81303",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08067",
  "LEPC": "Southwest Regional EPC",
  "FacilityLatDecDegs": "37.052710",
  "FacilityLongDecDegs": "-107.784870",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.redcedargathering.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 872966460,
  "ParentCompanyName": "Southern Ute Indian Tribe",
  "Company2Name": "Kinder Morgan Energy Partners",
  "CompanyDUNS": null,
  "Company2DUNS": 800408192,
  "OperatorName": "Red Cedar Gathering Company",
  "OperatorStr1": "125 Mercado St., Suite 201",
  "OperatorStr2": null,
  "OperatorCity": "Durango",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81301",
  "OperatorZipCodeExt": null,
  "FTE": 21,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000006254",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "VSUIT00102019.0",
  "SafetyInspectionDate": "2020-08-05 00:00:00",
  "SafetyInspectionBy": "Southern Ute Air Quality Program",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-11-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-11-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-11-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-11-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.054639,
  "FRS_Long": -107.785972,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000148052,
      "AltID": null,
      "FacilityID": 1000118440,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000185023,
          "ProcessID": 1000148052,
          "ChemicalID": 93,
          "Quantity": 55193.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000149665,
          "ProcessID": 1000148052,
          "NAICSCode": "48621",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000118440,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-02-10 00:00:00",
    "ERTrainingDate": "2020-02-12 00:00:00",
    "CoordinatingAgencyName": "Los Pinos Fire District",
    "CoordinatingAgencyPhone": "9705639501",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000118440,
      "SummaryText": "Executive Summary\r\n\r\n1. Accidental release prevention and emergency response policies:\r\nRed Cedar Gathering Company's Arkansas Loop treating plant removes water and carbon dioxide from coal bed methane gas.  The facility has implemented the elements of a Program 1 Risk Management Plan (RMP) and all the elements of OSHA's Process Safety Management (PSM) program.\r\nThe facility's Emergency Response Plan is site-specific. It includes required actions by plant employees as well as required notification and coordination with local responders and agencies. All employees are trained in the execution of the Emergency Response Plan and drills are conducted annually.\r\n\r\n2. The Stationary Source and Regulated substances:\r\nThe regulated substance handled by this facility is methane.  The purpose of this treating facility is to remove impurities from the methane gas (water and carbon dioxide) and compress the gas into transportation pipelines.  Methane gas is not stored at this facility.\r\n\r\n3. General accidental release prevention program and specific steps.\r\nThe facility has implemented all the elements of a Program 1 Risk Management Plan (RMP) and all the elements of OSHA's Process Safety Management (PSM) program. Key element of these programs include:\r\n\r\nThe facility has implemented all the elements of a Program 1 Risk Management Plan (RMP) and all the elements of OSHA's Process Safety Management (PSM) program. Key elements of these programs include:\r\n\r\nEmployee Participation: Employees are consulted on the development of the required elements of the PSM/RMP Program. Employees participate by developing, revising, and auditing the PSM/RMP program where applicable.\r\n\r\nProcess Safety Information: Technical information and documents are used to help maintain safe operation of the process, make decisions and perform process hazard analysis.\r\n\r\nProcess Hazard Analysis (PHA): A systematic examination of the plant to identify possible hazards and ensure that adequate controls are in p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000118440,
      "SummaryText": "lace to manage these hazards.\r\n\r\nOperating Procedures: The facility maintains written procedures that address all modes of operation, including a) initial start-up, b) normal operations, c) temporary operations, d) emergency shutdown, e) emergency operations, f) normal shutdown, and g) start-up after turnaround.\r\n\r\nTraining: The facility has training programs for all personnel operating or maintaining the processes. The training programs include classroom, OJT, demonstration and computer-based training. Employees are tested to demonstrate competency.\r\n\r\nContractors: The facility uses contractors to supplement its workforce during periods of increased maintenance or construction activities. The facility has procedures in place to ensure that contractors, a) perform their work in a safe manner, b) are aware of any hazards in the workplace, c) are aware of what they should do in the event of an emergency, d) understand and follow site safety rules, and e) inform plant personnel of any hazards that they find during their work.\r\n\r\nPre-startup Safety Reviews (PSSR's): The facility has implemented the use of PSSR's is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to being placed in service.\r\n\r\nMechanical Integrity: The facility has developed practices and procedures to maintain the integrity of process equipment, piping and emergency shutdown systems.\r\n\r\nManagement of Change: The facility uses MOC to manage changes by performing reviews to ensure that adequate controls are in place for any new processes or changes to processes.\r\n\r\nIncident Investigation: The facility has developed an incident investigation program to determine the causes of an incident or near miss and to take actions to prevent recurrence.\r\n\r\nCompliance Audits: Audits are conducted in accordance with the requirements of PSM and RMP regulations.\r\n\r\nSafe Work Practices and Procedures: The facility has developed safe work practices including"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000118440,
      "SummaryText": "a) controlling personnel entering the plant, b) ensuring isolation of energy sources for equipment undergoing maintenance through lock out and tag out, c) Safe Work a procedure used by RCGC operated under the control of its management, to provide for the safety and health of its employees, contractors and the public and to protect the environment against harm d) hot work procedures and permits for work with the potential for generating ignition sources, and e) confined space entry permits and procedures.\r\n\r\n4. Five-year accident history:\r\nNo major uncontrolled emission, fire, or explosion, involving one or more regulated substances that presents imminent and substantial endangerment to public health and the environment has occurred in the past 5 years.\r\n\r\n5. Emergency Response:\r\nThe facility's emergency response is based on OSHA's 1910.38 (Employee emergency plans and fire prevention).  Employees have been instructed / trained to activate the Emergency Shut Down System and evacuate the facility in an emergency.  The Los Pinos fire district personnel will not enter this facility in a fire or explosion emergency but may be summoned to control the public and any grass or shrub fires on surrounding property. Fire district personnel will assist in caring for any resulting injuries. Specific training for the Emergency Action Plan occurs every three years using computer based training. HAWOPER Training occurs annually.  \r\n\r\n6.  Planned changes to improve safety:\r\nThis facility was constructed in 1989 and has had no major safety up-grades.  Being an OSHA 1910.119 Process Safety Management facility constantly places all elements of the process under scrutiny.  Safety issues are continuously addressed."
    }
  ]
}