{
  "FacilityID": 1000074740,
  "FacilityName": "Mountain Meadow Pad A",
  "FacilityStr1": "1889 Mountain Meadow Road",
  "FacilityStr2": null,
  "FacilityCity": "McIntyre Township",
  "FacilityState": "PA",
  "FacilityZipCode": "17771",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42081",
  "LEPC": "Lycoming County LEPC",
  "FacilityLatDecDegs": "41.512669",
  "FacilityLongDecDegs": "-76.979867",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Edge Gathering Virtual Pipeline Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Edge Gathering Virtual Pipeline Com",
  "OperatorStr1": "101 Lindenwood Drive,Suite 225",
  "OperatorStr2": null,
  "OperatorCity": "Malvern",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19355",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000240615",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-04-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-04-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-01-27 00:00:00",
  "DeRegistrationEffectiveDate": "2019-10-27 00:00:00",
  "AnniversaryDate": "2024-04-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "4",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000093100,
      "AltID": "LNG Production and Storag",
      "FacilityID": 1000074740,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000116539,
          "ProcessID": 1000093100,
          "ChemicalID": 93,
          "Quantity": 42300.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000097124,
          "ProcessID": 1000093100,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000074740,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": "2019-02-15 00:00:00",
    "ERTrainingDate": "2019-03-08 00:00:00",
    "CoordinatingAgencyName": "Lycoming County LEPC",
    "CoordinatingAgencyPhone": "5704334461",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000074740,
      "SummaryText": "Edge Gathering Virtual Pipeline Company, LLC (Edge) operates a natural gas liquefaction facility at the Meadow Mountain, Pad A site located at 1889 Mountain Meadow Road in McIntyre Township, Pennsylvania (the Facility).  Edge will utilize Galileo Technologies' (Galileo) equipment to liquefy and subsequently distribute the liquefied natural gas from the Facility. This operation is defined as a stationary source using more than a threshold quantity of a regulated substance (methane) in a process. \r\n\r\nThe Risk Management Program Rule defines three Program levels based on the processes' relative potential for public impacts and the level of effort needed to prevent accidents. The Facility is eligible for Program Level 1. Below are the criteria a source must satisfy to qualify for a Program Level 1 plan:\r\n\r\n¿\tThere are no public receptors identified within the distance to the endpoint for a worst-case release. \r\n¿\tThe process has not had a release of a regulated substance in the past five years where exposure to the regulated substance, its \r\n        reaction products, overpressures generated by explosion involving the regulated substance, or radiant heat from a fire involving the \r\n        substance resulted in one or more offsite deaths, injuries, or response or restoration activities for exposure of an environmental \r\n        receptor.\r\n¿\tEmergency response activities with local responders are completed with respect to a potential release.\r\n\r\n\r\nEdge provides the highest consideration to protecting our employees, contractors and the communities we work in.  Senior management acknowledge an obligation, as an employer, to provide the safest possible working conditions for employees and contractors and to ensure the impacts on the communities we work in are minimized.  Edge is committed to providing a safe, accident-free, and healthy work environment for everyone.  We want our job sites to be places that encourage and support our employees to be their best and provide eve"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000074740,
      "SummaryText": "ry employee and contractor the unconditional right and obligation to question, stop and correct unsafe acts or conditions.  \r\n\r\nHowever, excellent safe and healthy conditions do not occur by chance.  They are the result of diligent work and careful attention to all company policies by everyone since safety demands cooperation on everyone's part.  Thus, it is important that communication will be kept open between management and employees at all times.  Workers who notice hazards or other safety problems, or feel that they need additional training, must notify their supervisor.  Supervisors and management at all levels are authorized to address these concerns and take corrective action when warranted.\r\n\r\nThe process extracts natural gas from a production well which is treated and liquefied before being stored in 10,000-gallon storage tanks (up to six storage tanks may be located at the Facility at any given time, however the tanks are not interconnected or manifolded together) and subsequently trucked offsite.\r\n   \r\nThe worst-case scenario is assumed to be the failure of a 10,000-gallon storage tank when filled and resulting in a vapor cloud explosion of the entire contents of the storage tank. Utilizing EPA RMP*CompTM, the potential reach and effect of a hypothetical accidental release of LNG from one storage tank at the Facility was modeled. The estimated worst-case end-points were calculated to be 0.3  miles. The Facility is located in a remote, unoccupied area.  Using ALOHA, the hazard modeling program for the CAMEO software suite, it was determined that no public receptors were identified  within the perimeter of a worst-case scenario. \r\n\r\nEdge utilizes SMART Control Technology to safely operate the liquefaction operations.  These operations are completely monitored and operated remotely. This remote monitoring system continuously monitors operating parameters, equipment service requirements, and operation performance. The system includes several alarms and emerg"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000074740,
      "SummaryText": "ency shutdown protocols including:\r\n \r\n¿\tA methane detector alarm with an immediate, automatic shutdown\r\n¿\tHigh pressure sensors with immediate, automatic shutdown\r\n¿\tOil low-level sensors with an immediate, automatic shutdown, including an alarm and shutdown if there is a failure of the lubrication \r\n        system\r\n¿\tA compressor high temperature alarm with an immediate, automatic shutdown\r\n¿\tPressure relief valves and\r\n¿\tA LNG line pressure alarm with an immediate, automatic shutdown\r\n\r\nIn effort to prevent accidents and incidents, the Facility adheres to applicable federal, state and local laws and regulations. Additionally, Edge is committed to continuous safe improvement of these operations. Edge has created and regularly updates it safety information and hazard reviews, developed applicable operations procedures, conducts training that provides information to the workers needed to safely operate, created and adheres to a preventative maintenance schedules, performs audits and investigates accidents/incidents.\r\n\r\nThe LNG operations will be new at the Facility; therefore, there is no history of accidents involving LNG that caused deaths, injuries, property or environmental damage, evacuations or sheltering in place at the Facility.\r\n\r\nIn the event of an emergency involving the LNG operations, it is the policy of the Facility to notify 911. Edge has coordinated emergency response efforts with the local fire departments, Lycoming County Local Emergency Planning Committee (LEPC) and the Department of Public Safety's Emergency Management Agency.  The primary First Responder has been identified as Ralston Fire Department. These agencies have been have been notified that when responding to a fire, explosion, or a release of a regulated substance from the process at the Facility, entry within the distance to the specified worst-case endpoint (0.3 miles) may pose a danger. Therefore, entry into this area should not occur unless arranged with the emergency contacts indi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000074740,
      "SummaryText": "cated in the RMP.\r\n\r\nEdge has also developed an Emergency Response (ER) plan.  The ER plan provides planned actions to take during the most common emergency, including: fires, medical emergencies, bomb threats, and work-place violence.  The majority of actions described in the ER plan are related to evacuation and notification procedures.  The plan also provides procedures related to fire prevention and the requirements to regularly exercise the plan."
    }
  ]
}