{
  "FacilityID": 1000091766,
  "FacilityName": "High Liner Foods (USA), Inc.",
  "FacilityStr1": "1 Highliner Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Portsmouth",
  "FacilityState": "NH",
  "FacilityZipCode": "03801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33015",
  "LEPC": "Portsmouth LEPC",
  "FacilityLatDecDegs": "43.060833",
  "FacilityLongDecDegs": "-070.796389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": "www.highlinerfoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 71982839,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "High Liner Foods (USA), Inc.",
  "OperatorStr1": "1 Highliner Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Portsmouth",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03801",
  "OperatorZipCodeExt": "0839",
  "RMPContact": "Erika Pouliot",
  "RMPTitle": "Env., Health & Safety Director",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000004639",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-02-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-02-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-02-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-02-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.0619,
  "FRS_Long": -70.79581,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000114023,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000091766,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000115436,
          "ProcessID": 1000114023,
          "NAICSCode": "31171",
          "_desc": {
            "NAICS_CODE": "31171",
            "NAICS_DESCRIPTION": "Seafood Product Preparation and Packaging"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000142503,
          "ProcessID": 1000114023,
          "ChemicalID": 56,
          "Quantity": 37000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000642503,
          "ProcessID": 1000114023,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000091766,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nIt is High Liner's policy to adhere to all applicable federal, State, and local laws.  The ammonia refrigeration process at High Liner has been designed and operates in compliance with EPA's Accidental Release Prevention Rule, and applicable State and local codes and regulations. High Liner has qualified engineering, operations, and maintenance personnel knowledgeable in the safe operation of ammonia refrigeration systems in direct responsibility of the process.  The process is also designed and operated in compliance with the Occupational Safety and Health Administration's Process Safety Management (OSHA-PSM) rule. \n\nThrough its Emergency Action Plan (i.e., Integrated Contingency Plan) as required under OSHA PSM, High Liner has emergency response procedures in place that comply with the Accidental Release Prevention Program (ARPP).\n\n\n\nA DESCRIPTION OF YOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED\n\n\n\nHigh Liner is a food processing facility primarily engaged in the preparation and packaging of seafood products.  The regulated substance, anhydrous ammonia, is stored and utilized within the facility's anhydrous ammonia refrigeration systems.  As High Liner's anhydrous ammonia storage capacity exceeds AARP threshold quantity, the facility is subject to the program and is required to prepare a RMP for this process.  The anhydrous ammonia refrigeration system at High Liner is the only process that stores a substance in greater quantities than the ARPP applicability threshold.\n\n\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe process is currently designed and maintained in compliance with American National Standards Institute / American Society of Heating, Refrigerating and Air-Conditioning Engineers guidance, and American Society of Mechanical Engineering (ASME) guidance.  Process verification takes place through design audits by tra"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000091766,
      "SummaryText": "ined personnel and/or industry consultants.  The schedule of such verifications is at least once every three years.\n\nAn off-site consequences analysis has been completed for the worst-case release scenario and an alternative release scenario to document the radius of impact (i.e., distance to toxic endpoint) for each scenario and the potential population, public receptors and environmental receptors that fall within the radius of impact for each scenario. \n\n\n\nPreventative Maintenance (PM) is an active part of High Liner's daily operations.  PM is performed in accordance with OSHA-PSM and, in many cases; the process safety equipment PM schedule prescribed by High Liner exceeds recommended equipment maintenance schedules.  Ammonia detection sensors are present and are tested on a regular basis.  Relief valves are replaced by a qualified refrigeration contractor on a five-year schedule or after operation. \n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nIn the last five years there have been no federal reportable releases that caused death, injury, hospitalization, or property damage.  \n\n\n\nTHE EMERGENCY RESPONSE PROGRAM\n\n\n\nA process release would be detected by ammonia sensors located in process and perimeter locations.  A process release would also be detected by the employees through odor.  When an ammonia alarm signal is triggered, it would sound throughout the facility and an auto-dialer is activated to alert maintenance personnel. The ammonia sensors are tested semi-annually.\n\n\n\nIn the event of a process release, the alarm system auto-dialer calls the facility maintenance department, which would in turn contact the Portsmouth Fire Department if any of the following conditions are present:\n\n?    Upon investigating the incident, High Liner determines that the release is severe enough to require response assistance. \n\n?    Reportable quantities of ammonia are released; and\n\n?    A potential for fire exists.\n\nThe Local Emergency Planning Committee (LEPC or Portsmouth Fire Department) is trai"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000091766,
      "SummaryText": "ned and equipped to respond to ammonia releases at High Liner.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nA Process Hazard Analysis (PHA) 5 Year Revalidation was conducted in 2019 and identified several areas where process updates and revisions could improve the safety of the facility.  \n\n\n\n"
    }
  ]
}