{
  "FacilityID": 1000084830,
  "FacilityName": "Vantage Corn Processors",
  "FacilityStr1": "3000 E 8th St",
  "FacilityStr2": "Suite 300",
  "FacilityCity": "Columbus",
  "FacilityState": "NE",
  "FacilityZipCode": "68601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31141",
  "LEPC": "District 4 LEPC",
  "FacilityLatDecDegs": "41.421390",
  "FacilityLongDecDegs": "-097.288612",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.adm.com",
  "FacilityEmailAddress": "emergency@adm.com",
  "FacilityDUNS": 117166840,
  "ParentCompanyName": "Archer Daniels Midland Company",
  "Company2Name": null,
  "CompanyDUNS": 1307586,
  "Company2DUNS": 0,
  "OperatorName": "Vantage Corn Processors",
  "OperatorStr1": "3000 E 8th St",
  "OperatorStr2": "Suite 300",
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68601",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Bauer",
  "RMPTitle": "Environmental Manager",
  "FTE": 450,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000243391",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "39285",
  "SafetyInspectionDate": "2010-04-20 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-01-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-01-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-01-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105984,
      "AltID": "Ethyl Alcohol Manufacturi",
      "FacilityID": 1000084830,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000107254,
          "ProcessID": 1000105984,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132729,
          "ProcessID": 1000105984,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000132730,
          "ProcessID": 1000105984,
          "ChemicalID": 125,
          "Quantity": 3100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000132731,
          "ProcessID": 1000105984,
          "ChemicalID": 56,
          "Quantity": 210000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632729,
          "ProcessID": 1000105984,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632730,
          "ProcessID": 1000105984,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632731,
          "ProcessID": 1000105984,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084830,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n1.0    Introduction\n\n\n\nThis Risk Management Plan (RMPlan) was prepared to meet the requirements of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) Rule (40 Code of Federal Regulation (CFR) 68).  Vantage Corn Processors (VCP) has operational control of a Corn Dry Mill and Cogeneration facility located at Columbus, NE, and is a covered facility under the rule because three processes at the facility contain more than a threshold quantity of a regulated substance.  All three of the processes meet Program Level 3 criteria.  The actual components of the required RMP include:\n\n\n\n?    Conduct a hazard assessment (release scenarios)\n\n?    Develop and implement an accident prevention program\n\n?    Develop and implement an emergency response program\n\n?    Development and implementation of a management system organizational structure\n\n?    Submittal of a RMP Plan\n\n\n\nThe purpose of the RMP is to prevent the accidental release, and to minimize the consequences of any such release of hazardous substances.\n\n\n\nAt VCP, we are committed to operating and maintaining our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n\n\n?    A description of our facility and use of substances regulated by EPA's RMP regulation\n\n?    A summary of results from our assessment of the potential off-site consequences from accidental chemical releases\n\n?    A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n\n?    An overview of our accident prevention program\n\n?    An overview of our emergency response program\n\n?    An overview of planned improvements at the facility to help"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084830,
      "SummaryText": " prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n\n?    The certifications that EPA's RMP rule requires us to provide\n\n?    The detailed information (called data elements) about our risk management program\n\n \n\n2.0    Stationary Source and Regulated Substances\n\n\n\nVCP operates dry corn milling, and cogeneration facilities in Columbus, Nebraska.  Operations at the site include raw material receiving and storage, corn processing and co-product separation, product storage and shipping.  The primary products are ethanol and animal feed.  In our processes, we use two toxic chemicals and one flammable material stored in quantities greater than the EPA RMP Threshold Quantity limit.  The EPA has identified that toxic chemicals and flammable materials exceeding Threshold Quantities have the potential to cause significant off-site consequences in the event of a substantial accidental release.  The three substances and quantities are identified below.\n\n\n\n    Toxics    Quantity    Threshold Quantity\n\n            \n\n1.    Chlorine    4,000 lbs.\n\n(2 - 2,000 lb. Cylinders)    2,500 lbs.\n\n2.    Ammonia (anhydrous)    48,000 gal \n\n(210,000 lbs. @ 85% Admin. Control)\n\n(4 - 12,000 gal. AST)    10,000 lbs.\n\n\n\n    Flammable    Quantity    Threshold Quantity\n\n1.    Natural Gasoline\n\n(35% Pentane)    500,000 gal. AST\n\n(1 - 500,000 gal )\n\n(2,795,000 lbs.)    10,000 lbs.\n\n\n\n\n\nChlorine is used at the cooling towers.  Chlorine is drawn into the water stream from storage cylinders to keep a bacteria-free system.  Anhydrous ammonia can used for pH adjustment and as a nutrient in our dry mill ethanol plant, the tanks are currently out of service but remain available for service.  Anhydrous ammonia is also used in the cogeneration facility for the selective non-catalytic reduction (SNCR) system, which injects ammonia into the appropriate high temperature region of the furnace/boiler for conversion of NOx to N2 and H2O.  Natural gasoline is added to ethanol in a blend tank as a denaturant."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084830,
      "SummaryText": "    The \"denatured ethanol\" contains approximately 2.5 to 5 percent natural gasoline.  The purpose of the denaturant is to classify the material as \"non-food grade\".  This material is sold as an additive to unleaded gasoline. \n\n\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the potential hazards that are posed to our employees, the public, and the environment by our use of these chemicals.  Administrative controls, mitigation systems, and preventive measures used at VCP include:\n\n\n\n?    Chemical permit system for anhydrous ammonia storage to limit the quantity in the tank to 85 percent capacity\n\n?    High level tank alarm for filling operations\n\n?    Release sensors and alarms\n\n?    Excess flow valve/regulator (system shutdown)\n\n?    Pressure relief valves and rupture disks\n\n?    On-site emergency response team (ERT)\n\n?    Monitoring of unloading operations\n\n?    A preventative maintenance program to ensure equipment integrity and proper operation\n\n?    Standard operating procedures\n\n?    Chlorine tanks designed and operated according to Chlorine Institute Standards.\n\n?    Ammonia Tanks designed and operated according to Ammonia PSM standards.\n\n?    Pressurized vacuum flow system (system shutdown)\n\n?    Cylinder patch kit\n\n\n\n3.0    Key Off-Site Consequence Analysis Scenarios\n\n\n\nEPA's RMP rule requires that we conduct a hazard assessment and provide information about the worst-case release scenario(s) and alternative release scenario(s) for our facility.  This information identifies the potential hazards and the potential risks they pose.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit exposure distances for each scenario.\n\n\n\nWorst-Case Release Scenario\n\n\n\nThe worst-case scenario (WCS) is an evaluation of the impact of a release of a hazardous substance from a complete failure (catastrophe) of the largest vessel, releasing the entire contents over a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084830,
      "SummaryText": " ten-minute period under the most stable weather conditions.  The probability of a release meeting these conditions is extremely small.\n\n\n\nThe worst-case toxic release scenario at VCP's Columbus Facility is the rupture of the anhydrous ammonia outdoor aboveground storage tank and release of the entire contents (full tank = 68,000 lbs.).  The worst release would occur over a 10-minute period and the distance to the toxic endpoint (3 ppm) is 4.7 miles.  The exposure distance was obtained using the RMP*Comp program for Anhydrous Ammonia as well as Risk Management Program Guidance (EPA 550-B-99-009). There are no mitigation measures included in this scenario.  Public and environmental receptors in this WCS include:  residences, schools, public recreational areas, commercial / industrial areas, national or state parks / forests and officially designated wildlife refuges.  The population was estimated and public receptors were identified using The EPA TRI Facility Siting tool and U.S. Census Data utilizing Marplot 4.2.4.  Environmental receptors were identified using U.S. Geological Survey Quad Maps.  Additional information regarding the WCS is included in the Registration Data Elements.\n\n\n\nThe worse-case flammable release scenario at VCP's Columbus Facility would be a vapor cloud explosion of the natural gasoline following release of the entire tank contents (2,900,000 lbs.).  The consequence distance to an overpressure of 1 pound per square inch is 1.1 miles.  The distance was obtained using RMP*Comp.  There are no mitigation measures included in this scenario.  Public receptors include residences and commercial/industrial areas.  There are no environmental receptors within the exposure distance.\n\n\n\nAlternate Release Scenarios\n\n\n\nAn Alternate Release Scenario (ARS) is the evaluation of the impact of a more likely release of smaller quantities of material.  The causes and the amount in these scenarios were determined based on site-specific data.  The probability of this "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000084830,
      "SummaryText": "scenario is higher than worst-case scenarios and therefore is the primary focus for on and off-site emergency planning. Alternate toxic release scenarios have been prepared and selected for chlorine and ammonia.  An alternate flammable scenario has been prepared for natural gasoline.\n\n\n\n\n\nThe selected ARS for chlorine is described below.  Chlorine could be released at the facility if a one-ton chlorine cylinder valve is sheared off.  The entire contents of the cylinder (2,000 lbs.) could be released at a rate of 63.4 lbs/sec.  The release would occur inside the chlorine building.  Liquid chlorine is released which flashes immediately to vapor.  The distance to the toxic endpoint (3 ppm) is 0.4 miles.  Active mitigation in this scenario includes release sensors and alarms, vacuum system shutdown, the presence of unloading personnel, and on-site Emergency Management Team (ERT) personnel and equipment.  The exposure distance was obtained using EPA Risk Management Program Guidance (EPA 550-B-99-009).  Public receptors include residences and commercial / industrial areas.  There are no environmental receptors within the exposure distance.\n\n\n\nThe selected ARS for anhydrous ammonia is described below.  Anhydrous ammonia could be released when a pressure release valve malfunctions.  Anhydrous Ammonia is released at a rate of 288 lbs. per minute for 30 minutes (8,640 lb. release).  The distance to the toxic endpoint (200 ppm) is 0.4 miles.  The exposure distance was obtained using the ALOHA 5.4.1 program for ammonia (anhydrous).  Detection equipment, alarm system, excess flow valves, and an on-site ERT help limit release duration.  Public receptors include residential areas.  There are no environmental receptors within the anhydrous ammonia ARS exposure distance\n\n\n\nThe selected ARS for natural gasoline is described below.  Natural gasoline could be released at the facility if a rupture occurred in the aboveground storage tank followed by a pool fire.  The consequence distanc"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000084830,
      "SummaryText": "e, which is the distance that could cause second-degree burns from a 40-second exposure, is 0.4 miles.  Passive mitigation includes the material being contained within the dike area containing above ground storage tank.  The exposure distance was obtained using RMP*Comp.  Public receptors include residential areas.  There are no environmental receptors within the exposure distance.\n\n\n\nWe are using this information to help us to ensure that our emergency response plan and the community emergency response plan address all reasonable contingency scenarios.  \n\n\n\n4.0         General Accidental Release Prevention Program\n\n\n\nVCP takes a systematic, proactive approach to evaluating chemical processes.  Using this approach, the design, technology, operation and maintenance activities, emergency preparedness plans, training, process changes, and other elements that affect processes are all considered.  Through evaluation, the consequences of catastrophic releases can be prevented or minimized.\n\n\n\nVCP processes are currently in compliance with OSHA Process Safety Management (PSM) Standard (29 CFR 1910.119).  The PSM Program addresses chemical accident prevention in a way that protects employees as well as the public, and the environment.  \n\n\n\nThe purpose of the PSM Program is to prevent unwanted releases or minimize the impacts of accidental releases of hazardous chemicals, especially into locations that could expose employees and others to serious hazards.  Our management systems address each of the key features of successful prevention programs including:\n\n\n\n?    Process safety information: Technical information about how a process operates\n\n?    Process hazard analysis: Technical analysis of the plants processes in order to anticipate what might go wrong\n\n?    Operating procedures: Technical and administrative procedures used to operate the plant safely\n\n?    Training: Provide employees with information necessary to ensure safe operation\n\n?    Mechanical integrity: Proper care on an ongoing "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000084830,
      "SummaryText": "basis\n\n?    Management of change: Analyze and understand the impact of changes in equipment, procedures or personnel\n\n?    Pre-startup review: Check equipment and make sure everyone knows what to do before starting a process\n\n?    Compliance audits: Evaluate whether any safety hazards exist\n\n?    Incident investigation: Procedures for investigating the cause of an accident and developing measures to prevent future accidents\n\n?    Employee participation\n\n?    Hot work permit\n\n?    Contractors\n\n\n\nPSM modifications necessary to further account for protection of public health and the environment will be made when PSM elements are updated under the existing schedule as required by OSHA.  The PSM Program was last revised on November 1, 2018.  The PSM Program is maintained by the Safety Manager.\n\n\n\nOur company and our employees are committed to the standard that the PSM Program and Risk Management Program set.  We do business, and we have specific accountabilities and controls to ensure that we are meeting high standards for accident prevention.  VCP has developed a risk management system which identifies positions and responsibilities for proper management of the RMP.  An organizational chart is included as Attachment 2.\n\n\n\n5.0           Five-Year Accident History\n\n\n\nWe keep records for accidental chemical releases and \"near misses\" that occur at our facility.  Incident reports are completed and the appropriate emergency response agencies are notified by VCP for any accidental chemical release exceeding federal or state Reportable Quantities.  Reporting and notification procedures are documented in the VCP Environmental Compliance Manual.  Reports are also completed for First Aid or chemical release \"near misses\" that occur on-site.  Appropriate corrective measures are taken to help prevent similar situations from occurring in the future.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule which occurred at VCP during the past five y"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000084830,
      "SummaryText": "ears:\n\n\n\n-    None to Report\n\n\n\n6.0          Emergency Response Program \n\n\n\nVCP has developed and maintains an Emergency Response / Fire Prevention Plan and an Emergency Response Plan for Hazardous Chemical Spills, Leaks and Releases.  The Plans consolidate various federal, state, and local regulatory requirements for emergency response planning.  Our emergency response program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  The Emergency Response Plans include written procedures to follow in the event of an incident.  Furthermore, we coordinate our plan with the Platte County Emergency Planning Committee (LEPC).  \n\n\n\n7.0       Planned Changes to Improve Safety\n\n\n\nThe following are improvements that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:\n\n\n\n-    Evaluate the use of alternate sources of sulfur dioxide (dry/solid forms)\n\n-    Evaluate placing administrative controls on the quantity of sulfur dioxide stored on-site\n\n-    Evaluate the use of alternate chemicals to replace the use of chlorine in the cooling towers.\n\n-    Alternative chemicals / methods have replaced anhydrous ammonia at the dry mill, however the tanks remain in place out of service.\n\n\n\nIn addition, recommended changes identified during Process Hazard Analysis will be implemented as necessary.\n\n"
    }
  ]
}