{
  "FacilityID": 1000065519,
  "FacilityName": "Kiva Energy - LP Terminal, LLC",
  "FacilityStr1": "5300 Claus Road",
  "FacilityStr2": null,
  "FacilityCity": "Riverbank",
  "FacilityState": "CA",
  "FacilityZipCode": "95367",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Stanislaus County Emerg Mgmt",
  "FacilityLatDecDegs": "37.71769",
  "FacilityLongDecDegs": "-120.919",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Kiva Energy - LP Terminal, LLC",
  "Company2Name": null,
  "CompanyDUNS": 62457304,
  "Company2DUNS": null,
  "OperatorName": "Kiva Energy",
  "OperatorStr1": "1262 Dupont Court",
  "OperatorStr2": null,
  "OperatorCity": "Manteca",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95336",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000235943",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-05-29 00:00:00",
  "SafetyInspectionBy": "Stanislaus County Dept of Environmental Resources",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-11-11 17:18:48",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-08-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-08-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-08-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000082096,
      "AltID": "Propane terminal storage",
      "FacilityID": 1000065519,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000102185,
          "ProcessID": 1000082096,
          "ChemicalID": 98,
          "Quantity": 3701781.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000083338,
          "ProcessID": 1000082096,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000069137,
              "Process_NAICS_ID": 1000083338,
              "SafetyReviewDate": "2017-08-11 00:00:00",
              "PHA_Date": "2017-08-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-06-29 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire hydrants onsite.",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Odorized propane. Operator surveillance and truck loader attendance during product transfer operations.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-08-11 00:00:00",
              "TrainingReviewDate": "2017-08-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer based training (CBT), safety meetings",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-08-11 00:00:00",
              "EquipmentInspectionDate": "2017-07-03 00:00:00",
              "EquipmentTested": "Smart hoses",
              "ChangeMgmtDate": "2017-05-31 00:00:00",
              "ChangeMgmtReviewDate": "2017-08-11 00:00:00",
              "PreStartupReviewDate": "2017-08-11 00:00:00",
              "ComplianceAuditDate": "2017-05-31 00:00:00",
              "AuditCompletionDate": "2017-08-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2017-08-11 00:00:00",
              "HotWorkPermitReviewDate": "2017-08-11 00:00:00",
              "ContractorSafetyReviewDate": "2017-08-21 00:00:00",
              "ContractorSafetyEvalDate": "2017-08-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000085459,
                  "PreventionProgram3ID": 1000069137,
                  "ProcessChemicalID": 1000102185
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000065519,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-06-26 00:00:00",
    "ERTrainingDate": "2017-01-11 00:00:00",
    "CoordinatingAgencyName": "Stanislaus County Emergency Mgmt",
    "CoordinatingAgencyPhone": "2095523600",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000065519,
      "SummaryText": "management identified and evaluated hazards of the process as well as accident prevention and mitigation measures, and the team made recommendations for additional prevention and/or mitigation measures when the team believes such measures are necessary.\r\n\r\nOperating Procedures:  The Riverbank Terminal maintains procedures that address various modes of process operations such as:\r\n* start­up;\r\n* normal operations;\r\n* temporary operations;\r\n* emergency shutdown;\r\n* normal shutdown; and\r\n* initial startup of a new process. \r\n\r\nThese procedures provide guidance for experienced operators and also provide the basis for training new operators. Operating procedures include applicable safety precautions that must be taken in the operation of the facility. The procedures are periodically reviewed and annually certified as current and accurate. The review and certification process involves both operators and technical staff. \r\n\r\nTraining:  The Riverbank Terminal facility staff, and Kiva Energy corporate staff, understand that incidents involving the accidental release of regulated substances can be reduced by having trained operations and maintenance staff. A training program, which incorporates specific operating procedures and safe work practices, is an essential element of an effective prevention program. \r\n\r\nThe training program is comprised of the following:\r\n* Initial employee training;\r\n* Periodic refresher training (provided at least every three years);\r\n* Training provided as a result of a new equipment addition or modification;\r\n* Competency testing involving written tests and observation following training; and\r\n* Training records for each employee.\r\n\r\nMaintenance Procedures & Mechanical Integrity:  The maintenance program at the Riverbank Terminal is intended to preserve the mechanical integrity of the process equipment to minimize the potential for an accidental release. The Riverbank Terminal has established practices and procedures for maintaining process equipm"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000065519,
      "SummaryText": "CALIFORNIA ACCIDENTAL RELEASE PREVENTION PROGRAM\r\nRISK MANAGEMENT PLAN\r\nKiva Energy - LP Terminal, LLC Riverbank\r\n5300 Claus Rd\r\nRiverbank, California 95357\r\nEXECUTIVE SUMMARY (19 CCR 2745.3)\r\n\r\nES - 1.0\tFACILITY ACCIDENTAL RELEASE POLICY\r\nThe owners, management, and employees of Kiva Energy - LP Terminal, LLC Riverbank (Riverbank Terminal) located at 5300 Claus Rd, Riverbank, California in Stanislaus County, are committed to the prevention of any accidental release of liquefied petroleum gas (LPG, typically 40%-99% propane). If an accidental release should occur, the facility staff are prepared to work with the local fire department, or other authorities to mitigate any release and minimize the impact of the release to people and the environment. A detailed Consolidated Emergency Response/Contingency Plan (CCP) has been developed and will be implemented in the event of an accidental release.\r\n\r\nES - 2.0\tFACILITY INFORMATION\r\nThe Facility is a bulk, hydrocarbon storage and handling facility that receives LPG by tank cars and trucks. The liquefied petroleum gas is stored in the facility's 16 aboveground, pressurized storage tanks prior to being loaded into DOT approved delivery trucks (including those owned by Kiva Energy as well as third-party distributors). \r\n\r\n-The 16 tanks are interconnected into four groups of four vessels. Each group of four tanks is operated as if it were a single storage vessel. Those vessels are\r\n\r\n*  A-Bank-1 : A-Bank-4; \r\n*  B-Bank-1 : B-Bank-4; \r\n*  C-Bank-1 : C-Bank-4; and\r\n*  D-Bank-1 : D-Bank-4. \r\n\r\n-An LPG vapor compressor is used to create a pressure differential between the tank cars or trucks being unloaded and the receiving vessels. The differential pressure \"pushes\" the LPG from the tank cars or trucks into the storage vessels. \r\n\r\n-The LPG stored in the 30,000-gallon, aboveground storage tanks (identified below) is transferred to DOT approved LPG transportation trucks of approximately 11,000 gallons or smaller bobtail LPG delive"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000065519,
      "SummaryText": "ry trucks of approximately 3,000 gallons using a vapor compressor. \r\n\r\nVessel                          Vessel Capacity (gals)     Maximum Volume     Mass of LPG\r\n* LPG Tank                      30,000                     25,500             107,610 lbs.\r\n* Net A-Bank-1 thru D-Bank-4    480,000                    408,000            1,721,760 lbs.\r\n\r\n* Totals                        480,000                    408,000            1,721,760 lbs.\r\n\r\nThe maximum amount of LPG present within the interconnected storage vessels is 1,721,760 lbs. This number represents that volume contained in the 16 storage tanks (as described above). \r\n\r\nDOT Tank car                     Vessel Capacity (gals)     Maximum Volume     Mass of LPG\r\n* Tank car (on siding)           34,500                     29,325             123,752 lbs.\r\n\r\n* Tank cars (16) Total           552,200                    469,200            1,980,024 lbs.\r\n\r\nThe maximum amount of LPG contained in the 16 DOT tank cars on the Riverbank Terminal's siding is 1,980,024 lbs. That number represents that volume present in the DOT Type 112 or 114 tank cars.\r\n\r\nThe maximum amount of LPG on site is 1,032,200 gallons. At the assumed density of 4.22 lbs. per gallon, that volume of LPG has a weight of 3,701,784 lbs. \r\n\r\nES - 3.0\tTHE WORST-CASE RELEASE SCENARIO AND ALTERNATIVE RELEASE SCENARIO\r\nThe worst-case release scenario and the alternative release scenario were evaluated for each of the regulated processes. The detailed results of the evaluation are provided in the Risk Management Plan (RMP). Administrative controls limit the tank fill capacity to in accordance with NFPA 58 7.4.3.2(B).\r\n\r\nWorst-Case Release Scenario. The worst-case release scenario is the release of LPG from a bank of four (4) storage tanks when filled to the greatest amount . The scenario assumes a complete release of 430,440 pounds of LPG gas. The pressure wave (with an endpoint of 1 pound per square inch gauge over atmospheric pressure) would extend 0.6 mile"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000065519,
      "SummaryText": "s (1 kilometers). The pressure wave could reach the residential neighborhood located to the northwest of the site as well as the church and playing fields located to the south-southwest. The blast has the potential to impact as many as 446 residents. There are no sensitive receptors, environmental or otherwise, within this blast zone.\r\n\r\nAlternative Release Scenario. The alternative release scenario based on the hazard review (or a more plausible potential incident) is a catastrophic release from a full-sized (11,000-gallon\r\nwater capacity), tanker truck. This scenario assumes that the tanker leaks from the bottom mounted entry valve and that the entire contents of the truck are released to the atmosphere. The scenario assumes a complete release of 39,457 pounds of LPG gas. The alternative release scenario would produce a pressure wave with an endpoint of 1 pound per square inch gauge over atmospheric pressure that would extend 0.3 miles (0.48 kilometers). The blast would have the potential to impact as many as 50 residents. The resulting pressure wave has the potential to impact nearby businesses within this blast radius. \r\n\r\nES - 4.0\tACCIDENTAL RELEASE PREVENTION PROGRAM\r\nThe Facility has implemented the following prevention program elements.\r\nSafety Information:  Kiva Energy keeps a variety of technical documents that are used to help maintain a safe operating process. These documents address chemical properties. Chemical specific information, including exposure hazards and emergency response/exposure. Treatment considerations is provided in safety data sheets (SDS's). A complete review of the safety information for the Riverbank Terminal is currently underway and will be completed by November 30, 2017. \r\n\r\nHazard Review:  Kiva Energy conducted a hazard review of the operations at the Riverbank Terminal. The hazard review employed the Hazard and Operability Study (HAZOPS) methodology and a \"What if?\" / Checklist method analysis. The plant operator and operations"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000065519,
      "SummaryText": "ent. The basic aspects of this program include (1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting equipment deficiencies. In combination, these activities form a system that maintains the mechanical integrity of the process. \r\n\r\nEquipment inspections are conducted on a monthly or quarterly basis. The frequency of the inspection is based upon regulatory framework impacting the particular system or subsystem. \r\n\r\nRMP Change Management (aka Management of Change):  The Kiva Energy Riverbank Terminal employs a change management system that requires changes to various systems or items, such as process equipment, technology, procedures and other facility functions, be properly reviewed and authorized before being implemented. This program ensures that the safety of the facility is not compromised by the change. Operating and maintenance personnel are provided any necessary training on any changes as part of the change management process. \r\n\r\nPre-startup Safety Review:  The Riverbank Terminal conducts a pre-startup safety review prior to the operating equipment or systems following a modification that requires a change in process safety information. The purpose of the pre-startup safety review is to ensure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment in service. \r\n\r\nCompliance Audits:  Periodic compliance audits to assess the effectiveness of the written plan must be conducted every three years. Plant operations and management personnel participate as audit team members. The audit team develops findings that are forwarded to operations or facility management for resolution. \r\n\r\nIncident Investigation:  The Riverbank Terminal has procedures in place that require prompt investigation of incidents that resulted in or could have reasonably resulted in, a fire/explosion, major property damage, environmental loss, or personal injury. The investigat"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000065519,
      "SummaryText": "ion team documents its findings, develops recommendation(s) to prevent a recurrence and forwards these results to the business management team for resolution. \r\n\r\nEmployee Participation:  The Facility must rely upon the operational expertise and training of its employees at all levels and disciplines to ensure safe operations. The Facility has implemented procedures regarding employee participation to ensure consideration of their knowledge and experience in all applicable areas of the prevention program.\r\n\r\nA formalized employee participation plan for the Riverbank Terminal is being developed with a target completion date of October 31, 2017.\r\nHot Work Permit:  Regarding hot work that may occur on or near the LPG process, the Riverbank Terminal has developed a written contractor evaluation program and a Hot Work Permit program to document the evaluation of the fire prevention and protection requirements. The Hot Work Permit system is implemented prior to allowing activities that could result the generation of sparks (e.g. cutting and grinding) or that involve the use of open flames. A formalized hot work permit program for the Riverbank Terminal is being developed with a target completion date of October 31, 2017.\r\n\r\nContractor Safety:  The Riverbank Terminal uses contractors during periods of increased maintenance or construction activities. The Kiva Energy evaluates and qualifies contractors who will work on the systems and equipment. Riverbank Terminal has procedures in place to ensure that contractors:\r\n* perform their work in a safe manner;\r\n* have appropriate knowledge and skills;\r\n* are aware of the hazards of their workplace;\r\n* understand what they should do in the event of an emergency;\r\n* understand and follow site specific safety rules; and \r\n* inform plant personnel of any hazards that they find while performing their work. \r\n\r\nEffective implementation of the contractor safety program is accomplished by providing contractors with an orientation session"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000065519,
      "SummaryText": "that covers (1) a process overview, (2) information about the safety and health hazards, (3) emergency response plan requirements and (4) safe work practices prior to beginning their work. \r\n\r\nFormalized contractor safety procedures have been implemented at the Riverbank Terminal. Riverbank Terminal management staff will conduct periodic reviews of the contractor safety performance after program implementation. The most recent review of contractor safety procedures occurred on August 21, 2017. \r\nLPG Regulatory Framework:  The Facility implements the provisions of the following guidelines and regulations for this regulated substance. The California Code of Regulations Title 8 provide the regulatory framework for the design of equipment and use of LPG gas. The National Fire Protection Code (NFPA) 58, LP-Gas Code, 2014 Edition is incorporated by reference in Title 8, Section 450. The NFPA 58 standard is supplemented by additional regulations in Title 8 Sections 470 through 494.\r\n* California Code of Regulations, Title 8, Division 1, Chapter 4, Subchapter 1, Unfired Pressure Vessel Safety Orders; \r\n* National Fire Protection Association (NFPA) 58 - Liquefied Petroleum Gas Code, 2014 edition; \r\n* NFPA 70 - National Electrical Code; and \r\n* United States Department of Labor, Occupational Safety and Health Administration (OSHA), 29 CFR 1910.110, Storage and Handling of Liquefied Petroleum Gases.\r\n\r\nES - 5.0\tFIVE-YEAR ACCIDENT HISTORY\r\nOver the past five years there have been no large or small releases which have resulted in any injuries, property damage or offsite consequences. An incident investigation program is in place at the Facility and incident investigations would be implemented if needed. \r\n\r\nES - 6.0\tTHE EMERGENCY RESPONSE PROGRAM\r\nThe Riverbank Terminal maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment. The procedures describe the manner of response to a fire or explosion in the event that"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000065519,
      "SummaryText": "a flammable substance is accidentally released. The procedures address notification of local emergency response agencies if a release occurs. Employees receive training in emergency procedures.\r\n\r\nThe overall emergency procedure program for the Riverbank Terminal is coordinated with the Stanislaus County Emergency Management Program. This coordination involves periodic meetings of the committee, which includes local emergency response officials, local government officials and industry representatives. The Riverbank Terminal has around the clock communications capability with appropriate Emergency Management Program officials and emergency response organizations (e.g., Stanislaus Consolidated Fire District). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. The facility's emergency response program is developed in accordance with Section 25503, Division 6.95 of the California Health and Safety Code, Hazardous Materials Business Plan requirements.\r\n \r\nThe emergency response program is updated in when necessary based on modifications made to the plant facilities. \r\n\r\nES - 7.0\tPLANNED CHANGES TO IMPROVE SAFETY\r\nSafety improvement is an on-going process at the Riverbank Terminal. The Kiva Energy Riverbank Terminal operators and Kiva Energy corporate staff will work jointly to address safety concerns and will conduct periodic evaluations to assess the operational safety and to ensure the maintenance of safe operating conditions. Specific changes to the LPG process at the Riverbank Terminal will be implemented as needed."
    }
  ]
}