{
  "FacilityID": 1000072343,
  "FacilityName": "West Memphis LPG Terminal",
  "FacilityStr1": "1241 South 8th Street",
  "FacilityStr2": null,
  "FacilityCity": "West Memphis",
  "FacilityState": "AR",
  "FacilityZipCode": "72301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05035",
  "LEPC": "Crittenden County LEPC",
  "FacilityLatDecDegs": "35.131870",
  "FacilityLongDecDegs": "-90.174680",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.nglenergypartners.com",
  "FacilityEmailAddress": "info@nglenergypartners.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "NGL Supply Terminal Company LLC",
  "Company2Name": "NGL Energy Partners LP",
  "CompanyDUNS": 0,
  "Company2DUNS": 965465086,
  "OperatorName": "NGL Supply Terminal Company LLC",
  "OperatorStr1": "6120 South Yale Avenue,",
  "OperatorStr2": "Suite 805",
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74136",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joshua Craig",
  "RMPTitle": "Director - EHS",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176196",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-08-14 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-08-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-08-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-08-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-08-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.12928,
  "FRS_Long": -90.17348,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000090528,
      "AltID": "LPG Transfer Facility",
      "FacilityID": 1000072343,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000091750,
          "ProcessID": 1000090528,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000113185,
          "ProcessID": 1000090528,
          "ChemicalID": 125,
          "Quantity": 1356809.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000113186,
          "ProcessID": 1000090528,
          "ChemicalID": 98,
          "Quantity": 8399882.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000113187,
          "ProcessID": 1000090528,
          "ChemicalID": 118,
          "Quantity": 3453137.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000613185,
          "ProcessID": 1000090528,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000613186,
          "ProcessID": 1000090528,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000613187,
          "ProcessID": 1000090528,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072343,
      "SummaryText": "WEST MEMPHIS TERMINAL\n\n2015 RMP\n\nEXECUTIVE SUMMARY\n\n\n\n\n\nAccidental release prevention and emergency response policies:\n\n\n\nThe West Memphis Terminal has implemented all the elements of an EPA Program 3 Risk Management Plan (RMP) and all the elements of OSHAA?s Process Safety Management (PSM) program.  The West Memphis Terminal complies with NFPA-58 requirements for LP-Gas Storage, and it is company policy to adhere to all applicable federal, state, and local laws.  If an emergency were to occur, it is company policy to notify the Crittenden County Emergency Management and request that they respond to the emergency.\n\n\n\nThe Stationary Source and Regulated substances:\n\n\n\nThe West Memphis Terminal is a bulk terminal that receives LPG by pipeline, railcar, and truck transport.  LPG is stored at the West Memphis Terminal and distributed by customer truck transports, or railcar.\n\n\n\nGeneral Accidental Release Prevention Program:\n\n\n\nThe West Memphis Terminal has developed and implemented the following general accidental release and prevention program elements in accordance with all the elements of a Program 3 Risk Management Plan (RMP) accident prevention rule, all the elements of OSHAA?s Process Safety Management (PSM) standard, NFPA-58 and all codes and regulations:\n\n\n\nProcess Safety Information:  The West Memphis Terminal has compiled written process safety information for all PSM covered processes.  The process safety information includes the hazards of chemicals used or produced in the process, process technology information, and process equipment data.  The process safety information is updated whenever process changes are made.\n\n\n\nAccurate and complete process safety information enables the West Memphis Terminal employees involved in operating and maintaining the terminal to identify and understand the hazards of the process.  Process safety information is used to conduct process hazard analysis on the existing process or a proposed modification to a process.  \n\n\n\nProc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072343,
      "SummaryText": "ess Hazard Analysis (PHA):  The West Memphis Terminal is committed to performing a detailed hazard analysis of each covered process to identify, evaluate, and control hazards involved in the processes.  Each process is systematically examined to identify potential hazards, controls in place to manage these hazards, and recommended additional controls, as appropriate. \n\n\n\nThe West Memphis Terminal uses the \"what if\" methodology, which is conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  The team identifies and evaluates potential hazards of the process as well as accidental prevention and mitigation measures, and makes suggestions for additional prevention and / or mitigation measures.  \n\n\n\nAs a minimum the West Memphis Terminal performs periodic PHA reviews or revalidations every 5 years as long as the process is operating.\n\n\n\nPHA findings and recommendations and their resolution are documented.  The West Memphis Terminal has implemented a system to address and resolve all PHA findings and recommendations in a timely manner through a written schedule.  All PHA findings and recommendation resolutions are communicated to all effected employees.  All recommendations must be resolved by management.\n\n\n\nOperating Procedures:  The West Memphis Terminal has developed and implemented written operating procedures that describe the tasks that terminal operators and transport drivers must perform, the safe process operating parameters that must be maintained, and safety precautions for operations and maintenance activities.  The West Memphis Terminal written operating procedures address various modes of process operations, including:  (1) initial start-up,  (2) normal operations,  (3) temporary operations,  (4) emergency shutdown,  (5) emergency operations,  (6) normal shutdown, and  (7) start-up after turnaround.\n\n\n\nContractors:  The West Memphis Terminal has developed and implemented a program to ensure that cont"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072343,
      "SummaryText": "ractors used to supplement its workforce to perform maintenance, renovation or specialty work on or near RPM / PSM covered processes are qualified to perform the work and are informed of the potential hazards.\n\n\n\nPre-Startup Safety Reviews (PSSRA?s):  The West Memphis Terminal requires a pre-startup safety review (PSSR) to be performed and documented for any physical modification in the PSM covered processes.   Additionally, any new units added at the West Memphis Terminal which is considered PSM covered processes will also require a PSSR to be performed and documented.\n\n\n\nMechanical Integrity:  The West Memphis Terminal has developed and implemented procedures to maintain the on-going mechanical integrity of critical process equipment in accordance with NFPA 58 and industry recognized and generally accepted good engineering practices.\n\n\n\nInspections and tests are documented and deficiencies outside of the acceptable limits are corrected before further use or in a safe and timely manner.  \n\n\n\nSafe Work Practices and Procedures:  The West Memphis Terminal has developed and implemented safe work practices that include methods for controlling plant entry, presence and exit of support personnel, and lockout/tagout procedures to ensure isolation of energy sources for equipment undergoing maintenance, hot work procedures for work with the potential for generating ignition sources in the presence of flammable or combustible material, and confined space entry procedure to ensure that adequate precautions are in place before entry is allowed into a permit required confined space. NGL utilizes the use of a Safe Work Permit for all non-routine tasks. The SWP covers: Date and time issued and expiration, Location, Equipment/Line ID, Emergency preparedness,  the hazard(s) involved, and the precautions to be taken. The Safe work permits are a written record that authorizes specific work, at a specific location, for a specific time period and are used for controlling and coordinati"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000072343,
      "SummaryText": "ng work to establish and maintain safe working conditions. They also ensure that all foreseeable hazards have been considered and that the appropriate precautions are defined and carried out in the correct sequence.\n\n\n\n\n\nTraining:  The West Memphis Terminal has developed and implemented a comprehensive training program for all employees involved in operating a process or loading a truck transport.  The training programs may include classroom, practical and computer-based training.  Employees are tested to demonstrate their understanding of the training and competency.\n\n\n\nManagement of Change:  The West Memphis Terminal requires that a management of change (MOC) be performed for any modification to equipment, procedures, products and process parameters of a PSM covered process.\n\n\n\nIncident Investigation:  The West Memphis Terminal requires that any incidents that resulted in the release of regulated substances, or a near miss, must be investigated as soon as possible, but no later than 48 hours following the incident.  The West Memphis Terminal has established a system to promptly address and resolve incident investigation findings and recommendations.\n\n\n\nCompliance Audits:  The West Memphis Terminal conducts audits on a regular basis to ensure that the facility is in compliance with applicable all the elements of the EPA Risk Management Plan (RMP) accident prevention rule, all the elements of the OSHA Process Safety Management (PSM) standard, NFPA-58 and all applicable codes and regulations.  \n\n\n\nFive-year Accident History:\n\n\n\nNo release of a regulated substance has occurred in the last 5 years.\n\n\n\nEmergency Response Program Information:\n\n\n\nThe West Memphis Terminal Emergency Response Plan is site-specific.  It includes required actions by plant employees as well as required notification and coordination with local responders and agencies.  All employees are trained in the execution of the Emergency Response Plan and drills are conducted annually.\n\n\n\nEmergency respo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000072343,
      "SummaryText": "nse program changes are administered through the MOC process.\n\n\n\nPlanned Changes to Improve Safety:\n\n\n\nThere are no planned changes to improve safety at the West Memphis Terminal."
    }
  ]
}