{
  "FacilityID": 1000072501,
  "FacilityName": "Indianapolis Refinery",
  "FacilityStr1": "3970 W. 10th St.",
  "FacilityStr2": null,
  "FacilityCity": "Indianapolis",
  "FacilityState": "IN",
  "FacilityZipCode": "46222",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18097",
  "LEPC": "Marion County LEPC",
  "FacilityLatDecDegs": "39.781162",
  "FacilityLongDecDegs": "-86.225313",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.crystal-clean.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Heritage-Crystal Clean, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 9990065,
  "Company2DUNS": null,
  "OperatorName": "Heritage-Crystal Clean, Inc.",
  "OperatorStr1": "2175 Point Blvd.",
  "OperatorStr2": "Suite 375",
  "OperatorCity": "Elgin",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60123",
  "OperatorZipCodeExt": null,
  "FTE": 79,
  "OtherEPAFacilityID": "ILR000130062",
  "EPAFacilityID": "100000221823",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "T097-37467-0067",
  "SafetyInspectionDate": "2018-11-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-12-18 18:28:26",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-12-18 18:28:26",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-12-18 18:28:26",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-12-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 39.781162,
  "FRS_Long": -86.225313,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000090778,
      "AltID": "Re-Refinery",
      "FacilityID": 1000072501,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000113528,
          "ProcessID": 1000090778,
          "ChemicalID": 149,
          "Quantity": 18093.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000092020,
          "ProcessID": 1000090778,
          "NAICSCode": "32419",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000076994,
              "Process_NAICS_ID": 1000092020,
              "SafetyReviewDate": "2018-11-16 00:00:00",
              "PHA_Date": "2018-06-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-12-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-05-22 00:00:00",
              "TrainingReviewDate": "2018-07-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-11-11 00:00:00",
              "EquipmentInspectionDate": "2018-06-29 00:00:00",
              "EquipmentTested": "VLO - V400, V-403, and V-405, HT - T-500, T-501, V-501, V-502, V-503, V-504, V-509, and V-510",
              "ChangeMgmtDate": "2018-11-12 00:00:00",
              "ChangeMgmtReviewDate": "2018-09-11 00:00:00",
              "PreStartupReviewDate": "2018-09-06 00:00:00",
              "ComplianceAuditDate": "2018-01-18 00:00:00",
              "AuditCompletionDate": "2018-12-31 00:00:00",
              "IncidentInvestigationDate": "2018-11-21 00:00:00",
              "InvestigationChangeDate": "2018-12-07 00:00:00",
              "ParticipationPlansReviewDate": "2018-10-24 00:00:00",
              "HotWorkPermitReviewDate": "2017-11-27 00:00:00",
              "ContractorSafetyReviewDate": "2018-06-08 00:00:00",
              "ContractorSafetyEvalDate": "2018-01-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000095753,
                  "PreventionProgram3ID": 1000076994,
                  "ProcessChemicalID": 1000113528
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000072501,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-02-15 00:00:00",
    "ERTrainingDate": "2018-06-26 00:00:00",
    "CoordinatingAgencyName": "Speedway Fire Department",
    "CoordinatingAgencyPhone": "3172464300",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072501,
      "SummaryText": "Process Description:  Process ID: (1000042653) - Re-Refinery - Includes VLO Distillation Unit, Hydrotreater, MS142, Utilities and Onsite Tankage.\r\n\r\nRe-Refinery lube oil process, with a maximum capacity of 75 million gallons per year, and consisting of:\r\n\r\n1)  Lube Oil Distillation, identified as P-400, used to remove water, light fuels, and heavy hydrocarbons from the used oil feed stream; producing two overhead streams, which include a water/light fuel stream and an off-gas stream, and byproducts vacuum lube oil and asphalt, consisting of:\r\n(a) Natural gas-fired boiler, identified as SB-201, constructed in 2012, with a maximum capacity of 16.74 MMBtu/hr, and exhausting through stack SB-201;\r\n(b) Vacuum heater, constructed in 2010, approved for modification in 2012, fueled by natural gas during normal operation, and process stream offgases during start-up or shut-down of H-401/402, H-500, or H-501 or during HT start of run conditions, identified as H-400, with a maximum capacity of\r\n25.00 MMBtu/hr, and exhausting through stack H-400;\r\n(c) Dehydration heater, approved for construction in 2012, fueled by a combination of natural gas, vaporized distillate fuel, dehydration off-gas, sour water, and HT off-gas during HT start of run reactor conditions and HT startup and shutdown, identified as H-402, with a maximum capacity of 60 MMBtu/hr,\r\nand exhausting through stack H-402;\r\n(d) Back-up dehydration heater, constructed in 2010, fueled by a combination of natural gas, vaporized distillate fuel, dehydration off-gas, sour water, and HT off-gas during HT start of run reactor conditions and HT startup and shutdown, identified as H-401, with a maximum capacity of 36.0 MMBtu/hr, and exhausting through stack H-401. H-401 will be used only during instances of H-402 downtime.\r\n(e) Caustic scrubber, identified as V-403, used to remove H2S from P-400 and MS142 off-gasses, prior to entering Vacuum Heater H-400 and Dehydration Heater H-401;\r\n(f) Lube Oil Distillation Unit and ancill"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072501,
      "SummaryText": "ary equipment, and;\r\n(g) Vacuum system used to collect and transfer off-gas from P-400 to V- 403 or back to P-400.\r\n\r\n2)  Lube Oil Hydrotreater (HT), identified as P-500, used to improve the quality of lube oil as a finished product, consisting of:\r\n(a) A series of reactors, to remove nitrogen, oxygen, sulfur, chlorine, and other contaminants;\r\n(b) Process heater, constructed in 2011, approved for modification in 2012, combusting natural gas and HT off-gas during normal operation, and VLO off-gas during start-up or shut-down of H-401/402,  identified as H-500, with a nominal rating of 14.00 MMBtu/hr, used to heat the P-500 reactor feeds, and exhausting through stack H-500;\r\n(c) Process heater, constructed in 2011, approved for modification in 2012, combusting natural gas and HT off-gas during normal operation, and VLO off-gas during start-up and shutdown of H-401/H-402, identified as H-501, with a nominal rating of 10.00 MMBtu/hr, used to heat the P-500 reactor feeds, and exhausting through stack H-501;\r\n(d) Caustic scrubber, identified as T-501, used to remove H2S from of the hydrogen rich recycle gas used in the reactors.\r\n(e) Natural gas process heater, identified as H-502, constructed in 2011, with a nominal rating of 6.00 MMBtu/hr, used to preheat the P-500 reactor feed to the steam stripper column, and exhausting through\r\nstack H-502; (vi) One (1) steam stripper column, identified as T-500, and associated ancillary equipment, used to remove light fuels or off-gas;\r\n(f) Air dryers, identified as T-502 and T-503, used to cool and dry the steam stripper bottoms product, exhausting through stacks T-502 and T-503, respectively;\r\n(g) High pressure separator, identified as V-501;\r\n(h) Low pressure caustic flash drum, identified as V-502;\r\n(i) Off-gas knock out, identified as V-505;\r\n(j) Caustic cooler heat exchanger, identified as E-503; and\r\n(k) Caustic scrubber, identified as V-510, used to remove H2S from the HT off-gas stream prior to combustion in Heaters H-500"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072501,
      "SummaryText": "and H-501.\r\n\r\n3) MS142 - Clean mineral spirits operation, identified as P-100, constructed in 2007, with a maximum capacity of 6,000 gallons per hour, processing mineral spirits to produce clean solvents, residue, and light fuel, utilizing no control devices, and exhausting to the ambient air, and consisting of:\r\n(a) One (1) natural gas-fired boiler, identified as S8-200, with a maximum capacity of 14.645 MM8tu/hr, and exhausting through stack S8-200.\r\n(b) One (1) Distillation Column and associated ancillary equipment, identified asMS142.\r\n(c) One (1) Vacuum system used to collect and transfer off-gas from MS142 to T-102.\r\n(d) One (1) Caustic Scrubber, identified as T-102, used to remove odor from MS142 off-gasses.\r\n\r\nUtilities include production equipment and distribution systems for steam, instrument air and nitrogen for operation of the refinery.\r\n\r\nOnsite tankage consists of fifty-one tanks used to support refinery feed, intermediate processing and final product storage and shipping.\r\n\r\nThe Heritage Crystal-Clean Indianapolis Re-Refinery operations comply with OSHA Standard 29 CFR 1910.119, Process Safety Management of highly hazardous chemicals via Corporate and Local management's commitment to the elements of PSM by applying the programs and policies found in the standard to activities throughout the facility. Specific program elements include:\r\n1. Employee Participation - It is the policy of Heritage Crystal-Clean (HCC) to seek participation of employees at all levels in establishing procedures and practices that govern Health, Safety and Environmental issues.  The PSM Policy includes a description of how the Employee Participation element is implemented in PSM-02; \r\n2. Process Safety Information - Process safety information is maintained for the facility.  The PSM Policy includes a description of how the Process Safety Information element is implemented in PSM-03; \r\n3. Process Hazard Analysis - A detailed process hazard assessment, using HAZOP, is conducted"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000072501,
      "SummaryText": "on the facility to insure that it has been designed safely.  The PSM   Policy includes a description of how the Process Hazard Analysis element is implemented in PSM-04; \r\n4. Operating Procedures - A system is in place to ensure that updated and approved procedures cover the facility's operation.  The PSM Policy includes a description of how the Operating Procedure element is implemented in PSM-05; \r\n5. Training - A training program has been established to ensure that personnel are well trained in the specific duties of their jobs (The process also includes an annual Training Needs Analysis).  The PSM Policy includes a description of how the Training element is implemented in PSM-06; \r\n6. Contractors - It is HCC's objective to partner with contractors that share the same safety philosophy.  A dedicated, collective, and consistent approach by HCC and contractors will enhance and maintain the safety and health of our respective employees.  The PSM Contractor Management Program element is included in PSM-07 Contractor Control System; \r\n7. Prestart up Safety Review - A prestart up safety review walk down and checklist is completed for changes that impact the Process Safety Information. PSM-08 Pre-Startup Safety Review includes a description of how the Prestart up Safety Review element is implemented; \r\n8. Mechanical Integrity - An equipment inspection program is in place to ensure equipment remains in good condition to prevent releases.  The PSM includes a description of how the Mechanical Integrity element is implemented in PSM-09; \r\n9. Hot Work Permits - A work permit system is in place to ensure that work on process equipment and hot work are conducted in a safe manner.  The PSM Policy and includes a description of how the Hot Work element is implemented in PSM-10;\r\n10. Management of Change - A management of change system has been established and implemented to ensure that changes are thoroughly reviewed prior to implementation.  PSM-11 Management of Change Procedure"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000072501,
      "SummaryText": "includes a description of how the Management of Change element is implemented; \r\n11. Incident Investigation - Incidents are investigated using one of several industry recognized methodologies, such as Tap Root, to determine system level root causes that can be remedied to prevent a reoccurrence. Employees and contractors involved in the incident are included on the investigation team.  The PSM Policy includes a description of how the Incident Investigation element is implemented in PSM-12; \r\n12. Emergency Planning and Response - An emergency action plan has been established.  PSM-13 includes a description of how the Emergency Planning and Response element is implemented; \r\n13. Compliance Audits - Programs are evaluated annually; audited at least every three years through PSM compliance audits; and weekly safety inspections of the facility are conducted by cross functional teams.  Action items resulting from these are tracked to a timely completion.  The PSM Policy includes a description of how the Compliance Audit element is implemented in PSM-14; \r\n14. Trade Secrets - There are no Trade Secret issues at this facility, per se. This is covered in PSM-15 of the PSM Policy."
    }
  ]
}