{
  "FacilityID": 1000015588,
  "FacilityName": "Sunview Cold Storage Peterson South Facility",
  "FacilityStr1": "31543 Peterson Road",
  "FacilityStr2": null,
  "FacilityCity": "McFarland",
  "FacilityState": "CA",
  "FacilityZipCode": "93250",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": null,
  "FacilityLatDecDegs": "35.701473",
  "FacilityLongDecDegs": "-119.226555",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 76210293,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Sunview Cold Storage",
  "OperatorStr1": "31543 Peterson Road",
  "OperatorStr2": null,
  "OperatorCity": "Delano",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93215",
  "OperatorZipCodeExt": "9614",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000187166",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-09-25 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "2007 Update",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-11-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-11-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-11-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-11-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 35.701465,
  "FRS_Long": -119.226611,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "9",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000019538,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000015588,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000023243,
          "ProcessID": 1000019538,
          "ChemicalID": 56,
          "Quantity": 102933.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000019921,
          "ProcessID": 1000019538,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000016266,
              "Process_NAICS_ID": 1000019921,
              "SafetyReviewDate": "2012-10-29 00:00:00",
              "PHA_Date": "2012-10-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-10-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "ammonia diffusion system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-01-04 00:00:00",
              "TrainingReviewDate": "2012-10-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-10-29 00:00:00",
              "EquipmentInspectionDate": "2012-10-31 00:00:00",
              "EquipmentTested": "Engine Room Inspection",
              "ChangeMgmtDate": "2012-09-03 00:00:00",
              "ChangeMgmtReviewDate": "2012-10-29 00:00:00",
              "PreStartupReviewDate": "2006-10-04 00:00:00",
              "ComplianceAuditDate": "2012-10-24 00:00:00",
              "AuditCompletionDate": "2013-10-24 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-10-29 00:00:00",
              "HotWorkPermitReviewDate": "2012-10-29 00:00:00",
              "ContractorSafetyReviewDate": "2012-10-29 00:00:00",
              "ContractorSafetyEvalDate": "2012-10-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000019391,
                  "PreventionProgram3ID": 1000016266,
                  "ProcessChemicalID": 1000023243
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000015588,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Kern County Environmental Health",
    "CoordinatingAgencyPhone": "6618628700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000015588,
      "SummaryText": "ed.\r\n\r\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, Sunview Cold Storage has assigned overall responsibility for the RMP elements to the Safety Manager at the Peterson South facility.  The Safety Manager has the overall responsibility for the development, implementation, and integration of the RMP elements.\r\n\r\nFive-Year Accident History\r\n\r\nThe Peterson South facility has not had any accidental releases from the ammonia-based refrigeration system that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\r\n\r\nEmergency Response Program\r\n\r\nSunview Cold Storage has established an emergency action plan and a chain of command to respond to emergencies at the Peterson South facility and to notify emergency responders when there is a need for a response.  However, an emergency response program does not need to be developed for the facility since Sunview Cold Storage employees will not respond to accidental releases of ammonia, the facility is included in the community emergency response plan, and appropriate mechanisms are in place to notify emergency responders.  \r\n\r\nPlanned Changes To Improve Safety\r\n\r\nThrough the accidental release prevention program, Sunview Cold Storage regularly evaluates the need for any changes to improve safety.  Currently, Sunview Cold Storage does not have any changes planned for the anhydrous ammonia-based refrigeration system to improve safety."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000015588,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe Sunview Cold Storage Peterson South facility utilizes anhydrous ammonia as the refrigerant in their cold storage facility located north of McFarland, California.  As it is Sunview Cold Storage¿s policy to comply with all applicable governmental regulations, the cold storage facility was designed and constructed in 1999 in accordance with the 1994 Uniform Building and Uniform Mechanical Codes.  The 2003-2004 expansion to the cold storage facility increased the amount of ammonia handled in the refrigeration system to a level above the threshold quantity.  \r\n\r\nSince the refrigeration system now handles more than 10,000 pounds of anhydrous ammonia, Sunview Cold Storage has developed and implemented a process safety management (PSM) program for the refrigeration system.  As part of the PSM program, Sunview Cold Storage has completed process hazard analyses, developed written operating procedures, trained employees on the refrigeration process, conducted a pre-startup safety review, and developed a mechanical integrity program for the ammonia equipment.  In addition to plant personnel monitoring the operation of the refrigeration process on a daily basis, Sunview Cold Storage has implemented a preventative maintenance program to ensure that the refrigeration process is maintained in good operating condition.  Properly maintained equipment reduces the risk of an accidental release.\r\n\r\nSunview Cold Storage emphas safe and environmentally sound operating practices through their employee training programs.  In addition to job specific training, operators and maintenance personnel receive training in accident prevention, safety, and first aid.  While it is Sunview Cold Storage¿s objective to be a responsible citizen of the community in all of its business activities, the limited staff at the cold storage facility precludes emergency response operations.  As such, an emergency action pla"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000015588,
      "SummaryText": "n has been prepared for the Peterson South facility and a chain of command to respond to emergencies has been established.\r\n\r\nSunview Cold Storage has developed a detailed Compliance Audit Checklist to evaluate compliance with the Process Safety Management (PSM) and CalARP regulations.  At least every three years, Sunview Cold Storage will audit these programs and any findings of noncompliance will be documented and responded to and the deficiencies will be corrected.\r\n\r\nDescription of the Stationary Source and Regulated Substances \r\n\r\nSunview Cold Storage owns and operates a cold storage facility located at 31543 Peterson Road.  McFarland is the closest community to the Peterson South facility.  The rural plant was constructed during 1999 utilizing all new equipment at the time of construction.  The cold storage facility was expanded in the fall of 2003.\r\n\r\nAnhydrous ammonia is used as the refrigerant that provides cooling for the Peterson South facility.  The refrigeration system consists of a suction accumulator with a liquid transfer system, five compressors, four evaporative condensers, a thermal siphon receiver, a high pressure receiver, two pre-cool rooms, six cold storage rooms, and the associated hallway, staging and shipping areas.  Bunker mounted accumulators are utilized to feed the flooded evaporators in the pre-cool and cold storage rooms.  The hallway, staging and shipping areas are cooled through direct expansion evaporators.  \r\n\r\nDuring normal operation, the anhydrous ammonia is distributed throughout the refrigeration system.  However, during major maintenance activities, the entire refrigeration system can be ¿pumped down¿ to evacuate the ammonia from the system and store it in the high pressure receiver.  The maximum quantity of ammonia that can be stored in the outdoor high pressure receiver is 18,600 pounds. \r\n\r\nFor purposes of the offsite consequence analyses, 40 CFR Part 68 and the CalARP regulations define the toxic endpoint for anhydrous am"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000015588,
      "SummaryText": "monia as 0.14 mg/l (200 ppm).\r\n\r\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n\r\nA PSM program, which meets the requirements of the general accidental release prevention program, is being implemented by Sunview Cold Storage to address the anhydrous ammonia system at the Peterson South facility.  The PSM program includes the following chemical-specific prevention steps:\r\n\r\n- Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process has been compiled.\r\n\r\n- Process Hazard Analyses (PHA) have been completed and will be updated and revalidated at least every five years.\r\n\r\n- Written operating procedures have been developed and will be reviewed at least annually.\r\n\r\n- Safe work practices, such as lockout/tagout, confined space entry, opening process equipment or piping, and control over entrance into the facility are implemented as needed.\r\n\r\n- Each employee involved in operating the ammonia system has received initial training and refresher training at least every three years.\r\n\r\n- Written mechanical integrity procedures have been established and implemented.\r\n\r\n- A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system.\r\n\r\n- Pre-startup safety reviews will be performed when a modification is made to the ammonia system that is significant enough to require a change in the process safety information.\r\n\r\n- Audits will be conducted at least every three years to evaluate compliance with the CalARP regulations.\r\n\r\n- Incident investigation procedures have been established.\r\n\r\n- A written plan of action regarding the implementation of employee participation has been developed and implemented.\r\n\r\n- Hot work permits will be issued for all hot work operations conducted on or near the ammonia system, as needed.\r\n\r\n- A Contractor Safety Policy has been developed and implement"
    }
  ]
}