{
  "FacilityID": 1000026176,
  "FacilityName": "Eagle Chemicals, Inc.",
  "FacilityStr1": "2550 Bobmeyer Rd",
  "FacilityStr2": null,
  "FacilityCity": "Hamilton",
  "FacilityState": "OH",
  "FacilityZipCode": "45015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39017",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "39.365833",
  "FacilityLongDecDegs": "-84.536944",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 72862535,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Eagle Chemicals, Inc.",
  "OperatorStr1": "2550 Bobmeyer Rd",
  "OperatorStr2": null,
  "OperatorCity": "Hamilton",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45015",
  "OperatorZipCodeExt": "1366",
  "RMPContact": "Mike Schaber",
  "RMPTitle": "Vice President of Systems",
  "FTE": 14,
  "OtherEPAFacilityID": "45015GLCHM2550B",
  "EPAFacilityID": "100000160782",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-02-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-10-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-10-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-10-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-09-09 00:00:00",
  "DeRegistrationEffectiveDate": "2019-09-01 00:00:00",
  "AnniversaryDate": "2017-10-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "2.0",
  "FRS_Lat": 39.36589,
  "FRS_Long": -84.53683,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000032064,
      "AltID": "Mixing and Packaging",
      "FacilityID": 1000026176,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000032367,
          "ProcessID": 1000032064,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000039028,
          "ProcessID": 1000032064,
          "ChemicalID": 55,
          "Quantity": 21500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000539028,
          "ProcessID": 1000032064,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000026176,
      "SummaryText": "Eagle Chemicals, Inc. is a mixing/packaging company related to manufacturing process fluid chemicals. Eagle Chemicals, Inc.  as part of its normal systems review, includes the Risk Management requirements as well as the Emergency Response Plan, review of chemicals used, employee safety plans, equipment and maintenance updates. Eagle rarely, if at any time uses outside contractors. However, if required they must confirm to all of the Eagle Chemicals, Inc.  requirements currently in place. Eagle Chemicals, Inc.  uses the yearly ISO audit as a point in time to review and update all critical plans, requirements, etc related to our business. It should be noted that Eagle Chemicals, Inc. has had no spills, accidents, chemical/airborne discharges since our last submission.\n\nOur process at Eagle Chemicals, Inc., requires a comprehensive management program involving a holistic approach that integrates technologies, procedures, and management practices, which address: Employee Participation, Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Contractors, Pre-Startup Safety Reviews, Mechanical Integrity, Hot Work Permits, Management of Change, Incident Investigations, Emergency Planning and Response, and Trade Secrets. The current internal compliance reviews are intended to provide the basis for Eagle Chemicals, Inc. to certify that it is meeting Program 3 requirements of the RMP. Eagle Chemicals, Inc. facility is subject to Program 3 of RMP by virtue of the presence of two toxic chemicals in the workplace and SIC 49311. Both hydrochloric acid and hydrofluoric acid exceed the RMP threshold levels. There are no flammables at threshold levels. The effectiveness of this program depends entirely on the quality of the procedures and training that accompanies them. The Eagle Chemicals, Inc. facility has developed and implemented several of the employee participation and operating procedures requirements, including Emergency Planning, Safety\n\nAwarene"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000026176,
      "SummaryText": "ss, Toxic Chemical Inventory review, etc. Eagle Chemicals, Inc. uses the checklist analysis for assessing hazards, hazard cause, cause level, and hazard effect category pursuant to 7.4.b.2 of its RMP program 3, Prevention Program. Required modifications should be tracked through the Management of Change Section 3, Paragraph 10 of the Plan. Other than the PHA, the Management of Change section as well as several of the elements necessary to satisfy the Plan should be completed on a scheduled and regular basis established by Eagle Chemicals, Inc. Eagle Chemical has separate folders corresponding to RMP Plan sections for the Emergency Response Plan, Toxic Chemical Inventory, etc. Information on each section is provided in a separate folder as supporting information, some of which change over time while other information does not. It then becomes a better control system to compare completed past section information with any new or added information. All sections on this report have been completed and updated. \n\n\n\n\n\nAs indicated above, Eagle Chemicals, Inc. is part of a yearly ISO inspection process. The company uses this annually scheduled review/audit to also review and update any sections of the RMP. Since our business is very recurring and does not change a lot, updates are not needed, as procedures remain effective and in place. Because our procedures remain in place, continual training and education become an important part of the process. As updates do occur, they become part of the training and education process. Eagle Chemicals, Inc.  does not discharge any chemicals, etc. into the local water system. Any waste water from cleaning the mixing tanks or floor scrubber is collected and reused in the same process. If some residual were to remain, it can be used in the manufacturing process.\n\n\n\nThe entire facility is kept neat and clean. All inventory containers are inspected for leaks or failing supports, and are immediately replaced. Eagle Chemicals, Inc. has an on l"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000026176,
      "SummaryText": "ine inventory system that tracks inventory on a daily basis. The types of chemicals used are recurring and do not change, except for quantities used or in inventory. This is monitored daily.\n\n\n\nWe at Eagle Chemicals, Inc. are proud of our clean record and continue to follow the highest standards to insure our employees, neighbors and the environment remain green.  \n\n"
    }
  ]
}