{
  "FacilityID": 1000062767,
  "FacilityName": "Helena Agri-Enterprises, LLC - Casey, IL Facility",
  "FacilityStr1": "601 West Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Casey",
  "FacilityState": "IL",
  "FacilityZipCode": "62420",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17023",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "39.295538",
  "FacilityLongDecDegs": "-088.002622",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7036759,
  "ParentCompanyName": "Helena Agri-Enterprises, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Agri-Enterprises, LLC",
  "OperatorStr1": "601 West Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Casey",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62420",
  "OperatorZipCodeExt": null,
  "RMPContact": "Clint Bayles",
  "RMPTitle": "Warehouse Manager",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176276",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-06-13 00:00:00",
  "SafetyInspectionBy": "Illinois Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Casey Fertilizer Company",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-07-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-03-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-03-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-03-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.295,
  "FRS_Long": -88.00267,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078683,
      "AltID": "NH3 Storage & Handling",
      "FacilityID": 1000062767,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000079864,
          "ProcessID": 1000078683,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098019,
          "ProcessID": 1000078683,
          "ChemicalID": 56,
          "Quantity": 840890.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598019,
          "ProcessID": 1000078683,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062767,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThe Casey Facility has submitted this updated electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68. Standards codified by the Occupational Safety and Health Administration at 29 CFR 1910.119 are not applicable to the operations at this facility because the facility is operated as a retail operation and is exempt from the OSHA standards.  However, the OSHA standards at 29 CFR 1910.111, Storage and Handling of Anhydrous Ammonia, are applicable and are included in the Risk Management Program (RMPr) document that is implemented by this Facility.\n\n\n\nThis electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Casey Facility located on the west end of Casey at 601 West Main Street, Casey, IL 62420.  The electronic RMP summarizes the policies and procedures implemented by the Casey Facility to minimize the likelihood of an accident.  The electronic RMP also summarizes the actions that the Casey Facility has taken to ensure that a response to a release will be implemented in a proper and timely manner.\n\n\n\nPURPOSE FOR UPDATING RMP\n\n\n\nHelena has updated the RMP to report to show a change in the nurse tank inventory.  \n\n\n\nFACILITY\n\n\n\nThe Casey Facility is a retail agricultural chemical facility and operates one (1) covered process that includes Storage and Handling of anhydrous ammonia.  Anhydrous ammonia is transported to the Facility via a commercial tanker truck and then transferred to one of three (3) 30,000-gallon stationary pressure vessels.  The commercial tanker truck operator (Contractor) performs these transfer operations.  \n\n\n\nHelena stores the anhydrous ammonia in the on-site stationary pressure vessels and then transfers the anhydrous ammonia from the pressure vessels to nurse tanks at point of retail sale to the end user (e.g. the farmer).  This Facility owns and ope"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062767,
      "SummaryText": "rates 34 1,450-gallon nurse tanks and 41 1,000-gallon nurse tanks.  Helena performs this operation in accordance with its RMPr accident prevention program.  \n\n\n\n\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\n\n\nWorst case and alternative case consequence analyses were completed for the storage and handling process.  The worst case scenario release for the Retail Facility assumed that all the contents in the largest single pressure vessel were released. The release was modeled as if the pressure vessel was punctured on the side at the ground level. The resulting release of ammonia was modeled as a ground level horizontal jet. \n\n\n\nThe alternative (or more likely to occur) scenario assumes a rupture of a 2-inch transfer hose caused by an impact from a vehicle or some other source during a major loading or unloading operation. This alternative scenario also considers active mitigation of the safety equipment (i.e. emergency shutoff and excess flow valves on the commercial tanker truck; and back flow check valves, emergency shutoff, and excess flow valves on the pressure vessel side of the bulkhead), and operating procedures that the Facility uses to safeguard against releases from ammonia transfer operations.\n\n\n\nACCIDENT PREVENTION PROGRAM\n\n\n\nThe Warehouse Manager implements the risk management planning process at this Facility.  The Warehouse is assisted by other Helena staff, as directed.  The Warehouse Manager is responsible for ensuring that Helena Staff are properly trained in the implementation of the Prevention Program which includes Safety Information, Hazard Analysis, Operating Procedures, Training, Maintenance, Compliance Audits, Incident Investigations, and Emergency Contingency Plans.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nHelena's Casey Facility is a non-responding facility. Helena has coordinated emergency response activities with its local emergency response agency and local fire department.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no on-site deaths, injuries, or sign"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062767,
      "SummaryText": "ificant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Casey Facility.\n\n\n\nCONCLUSION\n\n\n\nThe Risk Management Plan implemented by the Casey Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Casey Facility adds, deletes, or changes processes. The Emergency Response Program has been coordinated with the Cumberland County LEPC and Casey Fire Department.\n\n\n\nNOTE: Sections 4, 5, 6, and 7 of the standard RMP produced by EPA's RMP Submit Program are not applicable to the Casey Facility.\n\n"
    }
  ]
}