{
  "FacilityID": 1000074204,
  "FacilityName": "Western Plains Energy LLC",
  "FacilityStr1": "3022 County Road 18",
  "FacilityStr2": null,
  "FacilityCity": "Oakley",
  "FacilityState": "KS",
  "FacilityZipCode": "67748",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20063",
  "LEPC": "Gove County LEPC",
  "FacilityLatDecDegs": "39.121920",
  "FacilityLongDecDegs": "-100.735876",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 120723718,
  "ParentCompanyName": "Western Plains Energy LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Western Plains Energy LLC",
  "OperatorStr1": "3022 County Road 18",
  "OperatorStr2": null,
  "OperatorCity": "Oakley",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67748",
  "OperatorZipCodeExt": null,
  "RMPContact": "Derek Peine",
  "RMPTitle": "General Manager",
  "FTE": 37,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184926",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-09-25 00:00:00",
  "SafetyInspectionBy": "Kansas Department of Labor",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Denaturant/Ammonia",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-11-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-11-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 38.9671,
  "FRS_Long": -100.9253,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092481,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000074204,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093743,
          "ProcessID": 1000092481,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115732,
          "ProcessID": 1000092481,
          "ChemicalID": 155,
          "Quantity": 666000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000100845,
              "ProcessChemicalID": 1000115732,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000615732,
          "ProcessID": 1000092481,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000092482,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000074204,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093744,
          "ProcessID": 1000092482,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115733,
          "ProcessID": 1000092482,
          "ChemicalID": 56,
          "Quantity": 95026.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000615733,
          "ProcessID": 1000092482,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000074204,
      "SummaryText": "RISK MANAGEMENT PLAN EXECUTIVE SUMMARY\n\nWESTERN PLAINS ENERGY, LLC\n\n\n\nWestern Plains Energy, LLC (WPE) is submitting this correction based on updated information related to population, correction of coordinates for applicable tanks, and updates based on RMP audits conducted in region 7. \n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES:\n\nWPE has an ongoing commitment to the health and safety of onsite employees and the surrounding community.  This commitment is demonstrated in the resources invested in accident prevention, such as training personnel as well as considering safety in the design, installation, operation, and maintenance of the facility.\n\n\n\n\n\nWPE has emergency response policies in place that are addressed in the facility's Health and Safety Plan, SPCC/FRP, and Emergency Action Plan. Most of the listed Plans require a minimum of annual training in order to keep employees educated on emergency response procedures in place at the facility. All new employees are required to undergo training on emergency response procedures prior to initiating responsibilities onsite. It is WPE's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, plant personnel will respond to control the release as necessary.\n\n\n\n\n\nDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED:\n\nWestern Plains Energy, LLC ethanol plant is located near Oakley, Gove County, Kansas.The facility operates 24 hours per day, 7 days per week for the purpose of manufacturing fuel grade ethanol from corn.  The regulated substances under the RMP program are Anhydrous Ammonia a flammable mixture (natural gasoline), typically referred to as denaturant.  \n\n\n\n\n\nWORST CASE AND ALTERNATIVE CASE SCENARIOS:\n\nWorst Case Scenarios:\n\nAnhydrous Ammonia - Anhydrous Ammonia is stored as a gas liquefied by pressure in an aboveground steel tank. The worst case scenario used is a release of the entire contents of the storage"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000074204,
      "SummaryText": " vessel, creating a vapor cloud. RMP Comp was used to determine the worst case distance to endpoint; the model results were 5.6 miles. The ammonia tank sits on a concrete pad, passive mitigation was not included as part of this scenario. Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals, etc.) was obtained using Google Earth. The North and South Fork Saline Rivers, Big Creek River, Saline River, North Branch Hackberry Creek, and the Middle Branch Hackberry Creek are located within the worst case distance to endpoint for ammonia.  \n\n\n\nFlammable Mixture (Denaturant) - The flammable mixture stored onsite is natural gasoline, typically referred to as denaturant. Natural gasoline is used onsite to denature ethanol prior to shipment offsite. Denaturant is stored in an aboveground steel tank. The located is located in a diked containment structure that contains an impermeable liner with gravel overlay. A facility-specific SSDS was used to determine RMP applicability. The worst case scenario used is the release of the entire contents of the denaturant tank, causing a vapor cloud explosion. RMP Comp was used to determine the worst case distance to endpoint; the model results were 0.7 miles. Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals, etc.) was obtained using Google Earth.  No environmental receptors are affected by a worst case release of denaturant.\n\n\n\nAlternative Case Scenarios:\n\nAnhydrous Ammonia:  The alternate scenario used for anhydrous ammonia is a release of 10,000 pounds due to a rupture disk/relief valve failure from the ammonia piping system.  This scenario is considered the most likely cause of an ammonia release onsite.  The alternate release duration assumed is 30 minutes with an atmospheric stability of D and wind spe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000074204,
      "SummaryText": "ed of 3.0m/sec.  The facility control room is manned 24 hours/day and would be alerted of the relief valve failure at the ammonia tank within minutes.  The emergency shutdown system installed at the facility has been considered in this scenario as active mitigation.  RMP Comp was used to determine the alternate distance to endpoint (0.3 miles), the model results are provided as part of this documentation.  Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools) was obtained using Google Earth.  No environmental receptors are affected by an alternate release of anhydrous ammonia.  \n\n\n\nFlammable Mixture (Denaturant):  The alternate scenario used for the flammable mixture is the release due to a tanker truck loadout spill, causing a vapor cloud fire.   The endpoint used was an over pressurization of 1 PSI, a worst case option.  Denaturant deliveries at the facility typically occur during normal business hours with a facility staff member overseeing loadout operations - therefore a release at the loadout area could be ceased within minutes by manual overrides.  The loadout area also has a catchment basin with underground piping to secondary containment of the tank farm.   For this scenario passive and active mitigation was not considered, as the mitigation strategies currently in place would not contain a vapor cloud fire.  RMP Comp was used to determine the alternate distance to endpoint, the model results were <0.1 mile. Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools) was obtained using Google Earth.  No environmental receptors are affected by an alternate release of denaturant.  \n\n\n\nThe facility qualifies as a Program 3 due to the close proximity of public receptors, and therefore, Program Safety Management (PSM) has been completed for this facility.\n\n\n\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000074204,
      "SummaryText": "\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\n\nGeneral accidental release prevention programs in place at the WPE facility are described in earlier portions of this Executive Summary and the Industrial SWPPP and SPCC/FRP Plans onsite. As part of training, employees participate in drills and exercises in order to test responsiveness to releases of chemicals onsite. These drills and exercises are evaluated by WPE management to determine if any additional training or education is required. \n\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\nOn January 17, 2017, WPE experienced a 150-200 gallon denatured ethanol spill. Denatured ethanol is not a RMP covered chemical; therefore, is noted here for informational purposes.\n\n\n\nEMERGENCY RESPONSE PROGRAM:\n\nWPE ethanol plant has several safety programs in place at the facility that incorporate emergency response, including a Health and Safety Plan.  All applicable OSHA standards are followed and safety training is provided to all employees on an annual basis. Emergency response is also addressed in the facility's Industrial SWPPP and SPCC/FRP Plans. All Plans listed in this Executive Summary have been prepared in accordance with applicable regulations.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nWPE will continue to provide annual training programs to employees covering both safety and environmental programs in place at the facility to ensure the continued safety of employees and contractors. If any additional training is deemed necessary, WPE will ensure that additional training or education opportunities are presented to the employees in need. There are no planned changes to improve safety at the WPE facility at this time.\n\n"
    }
  ]
}