{
  "FacilityID": 1000048783,
  "FacilityName": "Helena Agri-Enterprises, LLC - Toluca, IL Facility",
  "FacilityStr1": "2766 County Road 500 North",
  "FacilityStr2": null,
  "FacilityCity": "Toluca",
  "FacilityState": "IL",
  "FacilityZipCode": "61369",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17123",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "41.000356",
  "FacilityLongDecDegs": "-089.111286",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7036759,
  "ParentCompanyName": "Helena Agri-Enterprises, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Agri-Enterprises, LLC",
  "OperatorStr1": "PO Box 488",
  "OperatorStr2": null,
  "OperatorCity": "Toluca",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61369",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000092972",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-04-11 00:00:00",
  "SafetyInspectionBy": "Illinois Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Toluca Corrected 10-26-09",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-09-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-02-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-02-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-02-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 41.0033,
  "FRS_Long": -89.1359,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000061164,
      "AltID": "Storage & Handling (NH3)",
      "FacilityID": 1000048783,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000075024,
          "ProcessID": 1000061164,
          "ChemicalID": 56,
          "Quantity": 607232.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000062358,
          "ProcessID": 1000061164,
          "NAICSCode": "42491",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000038773,
              "Process_NAICS_ID": 1000062358,
              "SafetyReviewDate": "2018-06-27 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Illinois Department of Agriculture",
              "FR_Comments": null,
              "HazardReviewDate": "2015-02-19 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Vehicle or Projectile Strike, Vandalism, Theft, or Terrorism",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Audio, Visual and Olfactory Inspection",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-06-27 00:00:00",
              "TrainingReviewDate": "2018-06-27 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-06-27 00:00:00",
              "EquipmentInspectionDate": "2018-08-23 00:00:00",
              "EquipmentTested": "Replaced pressure relief valves on the pressure vessels",
              "ComplianceAuditDate": "2018-06-27 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2009-10-21 00:00:00",
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The Interim Operations Manager implements the Risk Management Plan (RMP) and Risk Management Program (RMPr) for the Storage & Handling of anhydrous ammonia at this facility and is assisted by other Facility staff as directed. The RMPr describes the Accident Prevention Program that includes Safety Information, Hazard Analysis, Operating Procedures, Training, Maintenance, Compliance Audits, Incident Investigation, and Emergency Response.  Equipment included under this covered process includes (2) 30,000-gallon stationary pressure vessels (PV), (1) 18,000-gallon stationary PV, (24) 1,450-gallon nurse tanks, (6) double 1,450-gallon nurse tanks, and ancillary pump, piping, and valves.  Facility personnel perform the transfer of anhydrous ammonia from the PV to the nurse tanks in accordance with the Operating Procedures provided in the RMPr.\n\n\n\nThe Facility receives anhydrous ammonia by a Contractor that transports the anhydrous ammonia with a commercial tanker truck. The commercial tanker truck is temporarily parked on the Facility property while the anhydrous ammonia is transferred to the stationary PVs. The transfer process from the commercial truck is performed by the commercial tanker truck operator (Contractor). The Facility does not own or operate the commercial tanker truck. The Contractor is responsible to the Facility for complying with relevant operation and training procedures and documentation.  At a minimum, the Contractor must (1) have in place and certify compliance with applicable and relevant DOT and OSHA regulations, (2) make available to the Facility and EPA upon request any contractor-related documentation necessary to demonstrate compliance, and (3) certify that it has in place emergency shut-down procedures for ammonia unloading operations and that its OSHA and DOT programs comply with federal, state, and local regulatory requirements. Further, the Facility coordinates with the Contractor on the Facility Contingency Plan and will provide the Facility RMPr for review upon request by the Contractor.\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000039301,
                  "PreventionProgram2ID": 1000038773,
                  "ProcessChemicalID": 1000075024
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000048783,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Toluca Fire Protection",
    "CoordinatingAgencyPhone": "8154522422",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": " This is a non-responding facility and it coordinates its response activities with the LEPC and local Fire Department. Notification information and procedures are provided in its Contingency Plan."
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048783,
      "SummaryText": "The Facility has submitted this updated electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68. Standards codified by the Occupational Safety and Health Administration at 29 CFR 1910.119 are not applicable to the operations at this Facility because the Facility is operated as a retail operation and is exempt from the OSHA standards.  However, the OSHA standards at 29 CFR 1910.111, Storage and Handling of Anhydrous Ammonia, are applicable and are included in the Risk Management Program (RMPr) document that is implemented by this Facility.\n\n\n\nThis electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Toluca, IL Facility located one mile east of Toluca, IL along County Road 500 North in Toluca, IL.  The physical address to the Facility is 2766 County Road 500 North, Toluca, IL 61369.  The electronic RMP summarizes the policies and procedures implemented by the Facility to minimize the likelihood of an accident.  The electronic RMP also summarizes the actions that the Facility has taken to ensure that a response to a release will be implemented in a proper and timely manner.\n\n\n\nPURPOSE FOR UPDATING RMP\n\n\n\nThe Facility is submitting this as a correction to reflect the change in (1) Company Name; (2) nurse tank inventory; and (3) change in Emergency Contact and RMP Implementation Manager.  All relevant sections for a Program 2 RMP Facility have been reviewed and/or updated.  The updates are reflected in both the EPA RMP Submit report and the Facility Risk Management Plan Program Document (RMPr).\n\n\n\nFACILITY\n\n\n\nThe Facility is a retail agricultural chemical Facility and operates one (1) covered process that includes Storage and Handling of anhydrous ammonia.  Anhydrous ammonia is transported to the Facility via a commercial tanker truck and then transferred to two (2) 30,000-gallon stationary pres"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048783,
      "SummaryText": "sure vessels (PV) and one (1) 18,000-gallon stationary PV.  The commercial tanker truck operator (Contractor) performs these transfer operations.  \n\n\n\nThe Facility stores the anhydrous ammonia in the on-site stationary PVs and then transfers the anhydrous ammonia from the PVs to nurse tanks at point of retail sale to the end user (i.e. Grower/Farmer).  This Facility owns and operates (24) 1,450-gallon nurse tanks and (6) double 1,450-gallon nurse tanks.  Trained Facility Process Operators performs this operation in accordance with its RMPr accident prevention program.  \n\n\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\n\n\nWorst case and alternative case consequence analyses were completed for the single covered process that is operated at this Facility.  The covered process includes anhydrous ammonia Storage and Handling.  The worst case scenario release for the Retail Facility assumes that all the contents in the largest single PV are released.  For this Facility, the largest vessel is a 30,000-gallon stationary PV.  The release was modeled as if the ammonia tank was punctured on the side at the ground level. The resulting release of ammonia was modeled as a ground level horizontal jet.\n\n\n\nThe alternative (or more likely to occur) scenario was completed for the storage and handling covered process as well.  The alternative release for the Storage and Handling assumes a 60-second release from a ruptured 3-inch transfer hose caused by an impact from a vehicle or some other source on the liquid ammonia transfer hose during a transfer operation.  This scenario considers implementation of mitigation equipment including the: emergency shutoff and excess flow valve at the commercial tanker truck; back flow check valves, emergency shutoff valves, and excess flow valves on the PV side of the bulkhead; and operating procedures that the Facility uses to safeguard ammonia transfer operations.\n\n\n\nACCIDENT PREVENTION PROGRAM\n\n\n\nThe Interim Operations Manager implements the risk management planni"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048783,
      "SummaryText": "ng process at this Facility.  The Interim Operations Manager is assisted by other Facility staff, as directed.  The Interim Operations Manager is responsible for ensuring that Facility Staff are properly trained in the implementation of the Prevention Program which includes Safety Information, Hazard Analysis, Operating Procedures, Training, Maintenance, Compliance Audits, Incident Investigations, and Emergency Contingency Plans.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThis is a non-responding Facility. The Facility has coordinated emergency response activities with its local emergency response agency and local fire department.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at this Facility.\n\n\n\nCONCLUSION\n\n\n\nThe Risk Management Plan implemented by the Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Facility adds, deletes, or makes changes to the process. The Emergency Response Program has been coordinated with the Marshall County LEPC and the Toluca Fire Protection.  \n\n\n\nNOTE: Sections 4, 5, 6, and 7 of the standard RMP produced by EPA's RMP Submit Program are not applicable to the Toluca, IL Facility.\n\n"
    }
  ]
}