{
  "FacilityID": 1000118122,
  "FacilityName": "Interstate Paper LLC dba DS Smith Riceboro",
  "FacilityStr1": "2366 Interstate Paper Road",
  "FacilityStr2": null,
  "FacilityCity": "Riceboro",
  "FacilityState": "GA",
  "FacilityZipCode": "31323",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13179",
  "LEPC": "Liberty County EMA",
  "FacilityLatDecDegs": "31.741778",
  "FacilityLongDecDegs": "-081.406861",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "WR",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 66928623,
  "ParentCompanyName": "DS Smith",
  "Company2Name": null,
  "CompanyDUNS": 66928623,
  "Company2DUNS": null,
  "OperatorName": "IP LLC dba DS Smith Riceboro",
  "OperatorStr1": "2366 Interstate Paper Road",
  "OperatorStr2": null,
  "OperatorCity": "Riceboro",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31323",
  "OperatorZipCodeExt": null,
  "FTE": 246,
  "OtherEPAFacilityID": "31323NTRSTONEIN",
  "EPAFacilityID": "100000113469",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "26311790001V024",
  "SafetyInspectionDate": "2014-06-12 00:00:00",
  "SafetyInspectionBy": "Vulmaint",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-10-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-10-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-10-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-10-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 31.741994,
  "FRS_Long": -81.40669,
  "FRS_Description": "WATER RELEASE PIPE",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000147289,
      "AltID": "Water Chlorination",
      "FacilityID": 1000118122,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000183951,
          "ProcessID": 1000147289,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000148922,
          "ProcessID": 1000147289,
          "NAICSCode": "32213",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000126018,
              "Process_NAICS_ID": 1000148922,
              "SafetyReviewDate": "2024-10-08 00:00:00",
              "PHA_Date": "2024-10-08 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "N/A",
              "PHACompletionDate": "2024-12-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "N/A",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "N/A",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-10-08 00:00:00",
              "TrainingReviewDate": "2024-01-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "N/A",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "N/A",
              "MaintenanceReviewDate": "2024-07-26 00:00:00",
              "EquipmentInspectionDate": "2024-07-26 00:00:00",
              "EquipmentTested": "Chlorine System",
              "ChangeMgmtDate": "2015-01-19 00:00:00",
              "ChangeMgmtReviewDate": "2015-01-19 00:00:00",
              "PreStartupReviewDate": "2018-05-10 00:00:00",
              "ComplianceAuditDate": "2024-10-08 00:00:00",
              "AuditCompletionDate": "2024-12-18 00:00:00",
              "IncidentInvestigationDate": "2018-11-29 00:00:00",
              "InvestigationChangeDate": "2018-11-29 00:00:00",
              "ParticipationPlansReviewDate": "2024-01-15 00:00:00",
              "HotWorkPermitReviewDate": "2024-01-15 00:00:00",
              "ContractorSafetyReviewDate": "2024-02-12 00:00:00",
              "ContractorSafetyEvalDate": "2024-02-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000157757,
                  "PreventionProgram3ID": 1000126018,
                  "ProcessChemicalID": 1000183951
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000118122,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-06-08 00:00:00",
    "ERTrainingDate": "2020-06-08 00:00:00",
    "CoordinatingAgencyName": "Georgia DNR/Liberty Hinesville EMA",
    "CoordinatingAgencyPhone": "9123682201",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Clean Air Act, Safe Drinking Water Act",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000118122,
      "SummaryText": "Executive Summary\n\nThis risk management plan (RMP) has been prepared for  Interstate Paper\nLLC dba DS Smith Riceboro facility located in Riceboro, Georgia to fulfill the\nrequirements of Section 112(r)(7) of the Clean Air Act Amendments (CAAA)\nof 1990 and pursuant to 40 CFR Part 68 (Risk Management Programs for\nChemical Accidental Release Prevention).  These regulations require\nstationary sources with listed substances present in a process in quantities\ngreater than the threshold quantity to develop and implement a risk\nmanagement program that includes a hazard assessment, a prevention\nprogram, and an emergency response program.  The risk management\nprogram must be described in an RMP that is required to be:\nregistered with the US Environmental Protection Agency (EPA);\nsubmitted to appropriate local emergency planning agencies; and\navailable to the public.  \n\nFor the Interstate Paper dba DS Smith facility in Riceboro, Georgia, chlorine (which is a\nlisted toxic substance) is stored in amounts that exceed the threshold quantity\nof 2500 lb.  Based on a review of the RMP regulations and the potential off-site \nimpacts from this chlorine system, Prevention Program 3 requirements\nwere identified to apply to this facility (due to the system's applicability to the OSHA process safety management program requirements).  To meet the\nPrevention Program 3 requirements, this RMP has been prepared in\naccordance with 40 CFR Subpart G, Parts 68.150 through 68.190, which\ndescribe the format to be followed in completing an RMP document.\n\n\n1.1. Accidental release prevention and emergency response policies\n\nThe Interstate Paper dba DS Smith facility in Riceboro, Georgia is committed to providing\na strong health and safety program for its on-site employees as well as a safe\nenvironment for the surrounding community.  In this regard, the Interstate\nPaper facility is committed to:\n\nAppropriately managing the types and quantities of chemicals stored and\nhandled on-site.  As indicated within"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000118122,
      "SummaryText": "Section 1.2, only one chemical\n(chlorine) is currently stored and handled in a quantity that exceeds the\nRMP threshold limits.  In addition, as noted below in Section 1.2, the\nstorage and handling of this material has been located in the central\nportion of the facility to limit the off-site impacts due to potential\naccidental releases.\n\nDeveloping and implementing the programs necessary to store and handle\nchemicals on-site during typical and/or emergency situations.  Examples\nof the types of supporting chemical handling programs currently in-place\nat the facility include: an Emergency Response Plan, which includes a\ncomplete evacuation of the facility and coordination with off-site\nemergency services; a Process Safety Management Plan, which provides\nfor typical operating procedures, emergency procedures, routine\nmaintenance, inspections, training, and the like; and a Hazard\nCommunication Program and associated training such that on-site\npersonnel understand the hazards associated with the chemicals and\nprocesses located on-site.\n\nIn short, the Interstate Paper facility's accidental release prevention and\nemergency response procedures are based on the goal of storing and handling\nchemicals (including chlorine) to prevent exposure to employees and the\nsurrounding community.  In pursuit of this goal, it is the Interstate Paper\nfacility's policy to adhere to applicable State and Federal regulations.  As\nsuch, the chlorine system is designed in accordance with applicable\nregulations and design standards (such as those provided in the ASTM and\nANSI Standards).  In addition, the day-to-day use of chlorine is based on safe\nhandling procedures and proper training of personnel and the emergency\nhandling of an accidental release of chlorine is covered within the facility's\nEmergency Response Plan (which includes procedures for notification to the\nlocal fire department and the local emergency planning committee [LEPC] in\nthe event of a release to the environment).\n\n\n1.2.  The"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000118122,
      "SummaryText": "stationary source and regulated substances handled\n\nThe Interstate Paper dba DS Smith facility located in Riceboro, Georgia is engaged in the\nproduction of kraft liner paperboard.  Of the chemicals handled on-site in\nsupport of these manufacturing operations, only one (chlorine) was identified\nto be stored and handled on-site in quantities which exceed the thresholds\nestablished in 40 CFR Part 68.\n\nChlorine is needed at the Interstate Paper facility for disinfection of the\ndrinking water and process water supplies in accordance with the facility's\nSafe Drinking Water Permit. This chlorine disinfection is required for:  the\nprevention of diseases and public health concerns which may otherwise be\nassociated with the facility's drinking water supply; and the treatment of the\nfacility's process water supply prior to its introduction into the process\nequipment. \n\nThe Safe Drinking Water Permit requires the Interstate Paper facility to\nchlorinate its water supply on a continual basis year-round.  To guarantee that\nsufficient chlorine is available on-site to provide the required levels of\nchlorination, the Interstate Paper facility stores a maximum of five\n1-ton cylinders of chlorine on-site at a time.  These cylinders are\nunloaded and stored in the central portion of the facility (away from the\nproperty lines).\n\n\n1.3.  The worst-case release scenario and the alternative release scenario, including administrative controls and mitigation measures to limit the distances for each scenario\n\nWorst-case scenario - The worst-case release scenario is a highly unlikely\nevent, whose parameters are defined by the USEPA.  The worst-case scenario\nis defined by the USEPA to be the result of a failure of the largest single\nvessel, which would result in the release of the greatest amount chlorine that\ncould be held in a single storage tank (which is equal to 2000 lb based on the\nfacility's administrative controls).  For this scenario, it is assumed that the\nentire contents of the storage"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000118122,
      "SummaryText": "tank are released as a vapor and that the\nendpoint of concern occurs at a concentration of 0.0087 mg/L.\n\nThe distance to the 0.0087 mg/L toxic endpoint for the worst-case scenario\nis calculated to result in a radius of impact of 2.14 mi. A portion of this\nimpact (a calculated 11.79 mi2 area of the total 14.39 mi2 area) is identified to extend beyond the Interstate Paper property.  This 11.79 mi2 of impact is\nidentified to potentially affect one industrial facility, several residential\nproperties, and several recreation areas located around the Interstate Paper\nproperty.  No hospitals, schools, prison/ correction facilities, parks, or public arenas were identified to be located within the zone of impact.\n\nAlternative scenario -Any accidental release with an off-site consequence is\nalso a highly unlikely event.  In fact, this facility has been in operation for\napproximately forty years without such a release.\n\nWith that said, alternative release scenarios should represent an event that is\nmuch more likely to occur than a worst-case release scenario.  However, it\nshould also be noted that USEPA reporting elements require that an off-site\nimpact be identified (if available) for the alternative release scenario.  In order to obtain off-site impacts from large facilities (such as the 1663-acre property owned by Interstate Paper), unlikely alternative release scenarios need to be evaluated.\n\nThe following alternative release scenarios were evaluated for the Interstate\nPaper facility: transfer hose releases due to splits or sudden hose uncouplings;\nprocess piping releases from failures at flanges, joints, welds, or valves; and\nprocess vessel releases due to cracks, seal failure, or drain.\n\nOf the above-referenced alternative scenarios, it was identified that neither the transfer hose releases or the process piping releases would produce an off-site impact.  The only off-site impact was obtained by assuming the failure of a\nfusible plug (a 0.75-inch hole) on a one-ton cylind"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000118122,
      "SummaryText": "er and a choke (sonic) flow\ncondition.  Although this situation is not considered very likely to occur, it\nwould create an alternative release scenario with an off-site impact (with a\nradius of impact of 1.53 mi). A portion of this impact (a calculated 4.75 mi2\narea of the total 7.35 mi2 area) is identified to extend beyond the Interstate\nPaper property.  This 4.75 mi2 of impact is identified to potentially affect\nseveral residential properties and recreational areas located around the\nInterstate Paper property.  No hospitals, schools, prison/correction facilities,\ncommercial or industrial properties, parks, or public arenas were identified to\nbe located within the zone of impact. \n\n\n1.4.  The general accidental release prevention program and the specific prevention steps\n\nIn keeping with the Interstate Paper dba DS Smith facility's commitment to health and\nsafety, the chlorine system complies with USEPA's RMP regulations and\nother applicable regulations.  The system was designed and constructed in\naccordance with applicable ASTM and ANSI Standards.  Safety  information,\nincluding a Material Safety Data Sheet (MSDS) for chlorine, maximum\ninventory, and equipment specifications and codes are maintained.\n\nPersonnel responsible for operating and maintaining the chlorine system have\nbeen thoroughly trained and tested competent in the hazards of the system,\nhow to avoid or correct unsafe conditions, and in the written operating,\ninspection, and maintenance procedures.  The procedures were developed in\naccordance with chlorine industry standards and 40 CFR 68.  Refresher\ntraining, including hands-on demonstration training and classroom computer-based training, is provided at least every three years.\n\nAdministrative controls are in-place to limit the capacity of each of the\nchlorine cylinders to 2000 lb.  As an additional administrative control, the\nchlorine residual levels in the treated water are required to be recorded every\n2 hr for reporting to the Georgia Department"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000118122,
      "SummaryText": "of Natural Resources -\nEnvironmental Protection Division (GDNR-EPD) in compliance with the\nfacility's Safe Drinking Water Permit.  As such, the chlorine system is\nchecked regularly throughout the operating day.\n\nIn addition, written maintenance procedures have been developed for chlorine\nstorage and use.  Maintenance checks occur daily or monthly, as required.\n\n\n1.5.  Five-year accident history\n\nThe chlorine system at the Interstate Paper dba DS Smith facility has been in operation since\nthe late-1960s/early-1970s, with several upgrades performed on the system\nduring that time period.  No accidental releases are known to have been\nassociated with the operation of this chlorine system during its years of its\noperation.  As such, there are no records indicating any on-site or off-site\ndeaths, injuries, evacuations, sheltering in-place, property damage, or\nenvironmental damage during the past five years of the chlorine system's\noperation.\n\n\n1.6.  The emergency response program\n\nThe facility has developed and implemented a written Emergency Response\nPlan, which requires an evacuation of the facility and coordination with the\nlocal fire department and LEPC in the unlikely event of a release of chlorine. \nThe Interstate Paper facility has coordinated with several of the local fire\ndepartments (including the Hinesville Fire Department, the Riceboro Fire\nDepartment, and the Midway Fire Department) as well as the Liberty\nHinesville Emergency Management Agency with respect to emergency\nchlorine situations.\n\nBased on information obtained from the Hinesville Fire Department, the\nresponders and firemen in their department have completed the required\nHAZMAT training courses offered by the State of Georgia with respect to\npotential chlorine releases.\n\n\n1.7.  Planned changes to improve safety\n\nThe chlorine system was constructed and is operated in accordance with the\nASTM Standards, ANSI Standards, and other applicable chlorine industry\nstandards.  The chlorine system was last modi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000118122,
      "SummaryText": "fied and upgraded to these\nstandards in the early-1990s.  No additional construction or modification to\nthe chlorine system is planned at this time."
    }
  ]
}