{
  "FacilityID": 1000068296,
  "FacilityName": "Wacker Chemical Corporation, Polymers Division-VAM",
  "FacilityStr1": "854 North Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Calvert City",
  "FacilityState": "KY",
  "FacilityZipCode": "42029",
  "Facility4DigitZipExt": "0097",
  "FacilityCountyFIPS": "21157",
  "LEPC": "Marshall LEPC",
  "FacilityLatDecDegs": "37.05288",
  "FacilityLongDecDegs": "-088.335967",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.wacker.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 35869044,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Wacker Chemical Corporation",
  "OperatorStr1": "3301 Sutton Road",
  "OperatorStr2": null,
  "OperatorCity": "Adrian",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49221",
  "OperatorZipCodeExt": "9397",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000016038",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "V-16-010",
  "SafetyInspectionDate": "2004-04-16 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-10-14 14:08:45",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-10-14 14:08:45",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-10-14 14:08:45",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-10-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 37.044796,
  "FRS_Long": -88.349313,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085635,
      "AltID": "Barge Unloading & storage",
      "FacilityID": 1000068296,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000106958,
          "ProcessID": 1000085635,
          "ChemicalID": 29,
          "Quantity": 22000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000086854,
          "ProcessID": 1000085635,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000072291,
              "Process_NAICS_ID": 1000086854,
              "SafetyReviewDate": "2013-10-28 00:00:00",
              "PHA_Date": "2013-10-28 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Concrete containment added at north tank, overfill protection added",
              "OpProceduresReviewDate": "2017-04-17 00:00:00",
              "TrainingReviewDate": "2017-04-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "VAM unloaders are contractors from ACBL   American Commercial Barge Lines and/or Ingram Barge Company and are certified as tankermen by the Coast Guard",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-02-24 00:00:00",
              "EquipmentInspectionDate": "2012-12-07 00:00:00",
              "EquipmentTested": "River VAM Unloading Line",
              "ChangeMgmtDate": "2016-01-01 00:00:00",
              "ChangeMgmtReviewDate": "2016-08-06 00:00:00",
              "PreStartupReviewDate": "2017-01-16 00:00:00",
              "ComplianceAuditDate": "2018-01-05 00:00:00",
              "AuditCompletionDate": "2018-01-05 00:00:00",
              "IncidentInvestigationDate": "2015-06-08 00:00:00",
              "InvestigationChangeDate": "2015-12-31 00:00:00",
              "ParticipationPlansReviewDate": "2017-11-20 00:00:00",
              "HotWorkPermitReviewDate": "2017-11-20 00:00:00",
              "ContractorSafetyReviewDate": "2017-01-01 00:00:00",
              "ContractorSafetyEvalDate": "2017-11-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000089912,
                  "PreventionProgram3ID": 1000072291,
                  "ProcessChemicalID": 1000106958
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000068296,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-03-18 00:00:00",
    "ERTrainingDate": "2011-10-05 00:00:00",
    "CoordinatingAgencyName": "Marshall County LEPC",
    "CoordinatingAgencyPhone": "2705271333",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068296,
      "SummaryText": "Calvert City Plant - VAM Distribution Facility\r\nRisk Management Plan\r\nExecutive Summary\r\n\r\n1.  Accidental release prevention and emergency response policies:\r\n\r\nThe Wacker Chemical Corporation, Polymers Division (Wacker) plant, which is located on Highway 95 in Calvert City, Kentucky is a Program 3 facility in the Environmental Protection Agency's (EPA) Risk Management Plan (RMP).  Under RMP, the Calvert City plant is classified as two sources:\r\n\r\n1.  The main plant stationary source on Highway 95 and\r\n2.  The storage, pipeline, and barge unloading source at the Tennessee River.  \r\n\r\nThe largest quantity raw material feedstock, Vinyl Acetate Monomer (VAM), is used in the production of Wacker's VAE Emulsions and SekiSui Polyvinyl Alcohol.  Ethylene and Vinyl Chloride Monomer (VCM) are also used in the production of VAE and EVCL Emulsions.  VAM, VCM, and ethylene, in the quantities handled at this facility, are considered hazardous by EPA under the Risk Management Plan rule.  \r\n\r\nWacker is committed to continuous improvement in all aspects of safety and \r\nenvironmental performance.  It is our policy to adhere to all applicable Federal, Commonwealth of Kentucky,and local rules and regulations.  The Wacker Site Manager at the Calvert City plant is responsible for facility operation.  \r\n\r\nAs a site that is in compliance with OSHA Process Safety Management (PSM) regulations, the Calvert City plant strives to prevent chemical emergencies.  Prevention of chemical emergencies includes specifying that all equipment, piping, vessels, tanks, etc meet all applicable design codes and specifications.  Documentation of  these codes and specifications form the basis of our process safety information including flow diagrams, piping and instrument diagrams, process descriptions, and other documentation.  Trained and qualified employees work with sophisticated control systems that include instrumentation, alarms, and shutdowns to keep our processes operating in safe limits that minimiz"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068296,
      "SummaryText": "e adverse impacts on the employees, the surrounding community, and/or the environment.  \r\n\r\nOperating instructions, startup/shutdown, and consequences of deviation define required operating conditions and steps needed to control normal and out-of-normal conditions. \r\n\r\nUnder PSM, employee involvement in all aspects of plant operations, its safety and environmental programs is required and met at the Calvert City plant.  Employees are regularly trained, certified, and subject to random substance abuse checks to ensure the safety of the plant.  Our Polymers Safety Process (PSP) contains many elements including management of change, hot work procedures, and regular process hazards analysis using the hazard and operability (HAZOP) methodology.  All contractors working at the plant are subject to the same rules and procedures that Wacker employees must follow.  \r\n\r\nThe emergency response plan includes OSHA Hazardous Waste Operations and Emergency Response (HAZWOPER) training and qualifications for on-site employees.  Wacker shares emergency response resources on the plant site with the Sekisui PVOH plant and Air Products and Chemicals, Inc.  Wacker, Air Products and Sekisui participate in a partnership among the Calvert City area industries named the Calvert Industrial Mutual Aid Program or CIMAP.  The CIMAP organization collaborates with community emergency responders and citizens to form the core of a strong Local Emergency Planning Committee or LEPC.  Wacker is an active member of the LEPC and the Calvert City Community Advisory Team.  \r\n\r\nThis document has been prepared in accordance with the EPA's Risk Management Plan regulation (40CFR Part 68).  The substances and processes considered during the preparation of this document, the scenarios described, and modeling techniques selected were chosen based on the criteria established in the regulation.\r\n\r\n2.  The stationary source and regulated substances handled:\r\n\r\nThe Wacker stationary source that makes up the storage,"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000068296,
      "SummaryText": "s can activate the system to notify emergency responders, plant personnel, and the media that no emergency exists."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068296,
      "SummaryText": "pipeline, and barge unloading facility at the Tennessee River is considered a separate facility under RMP.  This facility unloads Vinyl Acetate Monomer (VAM) from barges that are shipped from the Texas Gulf Coast up the Tennessee River to Calvert City.  VAM is unloaded from  the barges and transferred to one of two storage tanks, FB-4515 and FB-4516.  VAM is pumped to the main plant via a pipeline that runs from the river storage tanks to the main plant. \r\n\r\nThe only RMP regulated substance handled at this stationary source is Vinyl Acetate Monomer (VAM), a toxic liquid.  The maximum quantity of VAM inventoried in an individual storage tank is 11,700,000 pounds.\r\n\r\n3.  The general accidental release prevention program and specific prevention measures:\r\n\r\nKey to the plant's prevention programs are the layers of protection provided at each process.  This protection  \r\nstarts with the facility design and construction.  Wacker meets or exceeds all design and construction codes when implementing new projects in the plant.  A comprehensive mechanical integrity program includes routine checks of all process equipment, tanks, vessels, and piping.  These checks are done using non-destructive testing techniques with records maintained in the permanent equipment files.  \r\n\r\nBarge unloading activities are controlled by two people that are present during the unloading.  These unloaders are contractors working for the barge company that have been trained and certified as tankermen by the US Coast Guard.  When unloading a barge they can instantly stop VAM transfers at any time.  They can also contact emergency assistance via two separate means of communications. \r\n\r\nIn the event an upset leads to an uncontrolled condition, process safety devices including pressure relief valves, rupture disks, and flame arrestors are in place to safely control upset conditions.  Containment dikes around the storage tanks are designed to hold the entire contents of the tank.  \r\n\r\nEach plant proces"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000068296,
      "SummaryText": "s design is subject to detailed process hazard reviews during design, construction, and start-up.  All process changes must be reviewed and approved under a detailed Management of Change procedure before any changes are made.  At periods not to exceed five years, Operating Plant Hazards Reviews (OPHRS) are conducted by teams of supervisors, engineers, operators, mechanics, and EH&S professionals.  \r\n\r\nThe elements of the prevention program are audited regularly at the production unit, plant, and corporate levels.  These audits are documented as part of the basic safety process with corrective action defined and tracked through plant safety management systems. \r\n\r\n4.  Five year accident history:\r\n\r\nNone of the stationary sources or covered processes at the Wacker plant at Calvert City has had an incident in the last five years that would be reported under RMP.  There have been no releases of VAM that have had any off-site consequences, resulted in any employee injuries, or resulted in any significant equipment damage.  \r\n\r\n5.  The emergency response program:\r\n\r\nThe facility's emergency response program is based on the OSHA HAZWOPER standard.  Wacker, Air Evonik and Sekisui share emergency response resources.  There are at least 16 trained emergency responders in the fire and rescue squad that are divided across four shifts and day workers.  Each shift has a fire and rescue squad that is led by the shift safety officer.  In an emergency, the safety officer assumes on-scene command of any incident.  \r\n\r\nOn-site emergency resources include a fire/foam truck, a rescue truck, and a Hazmat Response trailer.  In \r\naddition to these resources, Wacker is a member of the Calvert Industrial Mutual Aid Program (CIMAP) and can draw from pooled resources from surrounding plants and communities.  As a member of the LEPC, Wacker regularly stages emergency response drills both in-house and outside with emergency responders from the public and private sector.  LEPC members and other e"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000068296,
      "SummaryText": "mergency responders regularly tour the facility to familiarize themselves with the plant, its hazardous materials, equipment, layout, personnel, and emergency procedures.  \r\n\r\n6.  Planned changes to improve safety:\r\n\r\nThe process safety information and systems are evaluated regularly through the Operational Plant Hazard Reviews, with industry-wide changes in standards and as a result of incidents that have occurred within the chemical industry.  The VAM storage tanks have no outstanding upgrade recommendations.  \r\n\r\nThe Calvert Area Emergency Warning System (CAEWS) is an emergency notification system to alert the community of  a chemical and/or weather related emergency.  The system is composed of a siren network in Calvert City and Livingston County that is activated by the 911 operator.  The 911 operator is backed up by the safety officer at Evonik, who can also activate the system.  In the event of an emergency, 911 would activate the sirens and voice command modules that are placed in public buildings such as the Convelescent Center, City Hall, and the Calvert City Elementary School.  Once a citizen has heard the siren or the voice command module alert, they are to turn their radio on the local Calvert City radio station (WCCK) and listen for specific instructions.  The sirens are routinely tested one day per month.  \r\n\r\nThe CAEWS also has a telephone notification system that can be activated by any of the ten participating plants.  In the event of a chemical emergency, a plant could activate the system to notify everyone in the community within a five mile radius of the complex.  These calls notify people of the emergency, instruct them to Shelter-in-place, and tune to their local radio station for more information.  The system can make an All-Clear call to notify everyone that the emergency has passed.  The system also has a test notification that can be activated in conjunction with any drills.  In the event of an incident with no off-site consequences, plant"
    }
  ]
}