{
  "FacilityID": 1000065904,
  "FacilityName": "Costco Wholesale Morris Meat Plant",
  "FacilityStr1": "7320 Lisbon Road",
  "FacilityStr2": null,
  "FacilityCity": "Morris",
  "FacilityState": "IL",
  "FacilityZipCode": "60450",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17063",
  "LEPC": "Grundy County LEPC",
  "FacilityLatDecDegs": "41.389510",
  "FacilityLongDecDegs": "-88.436919",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Costco Wholesale",
  "OperatorStr1": "7320 Lisbon Road",
  "OperatorStr2": null,
  "OperatorCity": "Morris",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60450",
  "OperatorZipCodeExt": null,
  "RMPContact": "Katie Holck",
  "RMPTitle": "General Manager",
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000236648",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "No inspection yet",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-04-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-09-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-09-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-09-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000082579,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000065904,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000083781,
          "ProcessID": 1000082579,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000102667,
          "ProcessID": 1000082579,
          "ChemicalID": 56,
          "Quantity": 70000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000602667,
          "ProcessID": 1000082579,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000065904,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nCostco Wholesale is committed to safety. This commitment is enforced through the corporate safety\n\ngroup. This group monitors the on site implementation of the Process Safety Management\n\nprograms through periodic meetings at each regulated facility. In addition, the corporate safety\n\ngroup in conjunction with the local Utilities Manager are responsible for maintaining a safety and\n\nenvironmental program to promote a safe environment for all employees and the surrounding\n\ncommunities. The facility currently has 200 employees but plans to expand that number to 425 by 2019. This policy is administered through Costco Wholesale's safety and environmental\n\nprograms. These programs include forklift safety, hazard communications, lockout / tagout,\n\nemployee safety manuals, manufacturers' documentation, as well as the Risk Management Plan.\n\nThe Costco Wholesale facility has an emergency action plan in effect. The Emergency Action Plan\n\n(Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document\n\nwhich is maintained at the facility. This Plan was designed to meet the following objectives:\n\n\n\n- To save lives.\n\n- To minimize and avoid injuries.\n\n- To protect the environment.\n\n- To minimize property damage.\n\n\n\nThe Plan provides the response organization and notification procedures, evacuation routes,\n\nammonia health hazards, and mitigation procedures which will be implemented to respond\n\neffectively to emergency situations that may arise at the facility.\n\nCostco Wholesale has coordinated the emergency response efforts with the local fire department. In the case of an ammonia related emergency, it is the policy of Costco Wholesale to evacuate and to allow the fire department/HazMat Team to respond to the emergency. The refrigeration department will be available for guidance and assistance. In the future, Costco Wholesale - Morris Meat Plant is planning to become a full-responding facili"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000065904,
      "SummaryText": "ty.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Costco Wholesale facility including the ammonia refrigeration system was built in 2017. The\n\nfacility serves as a distribution point and processing plant for meat products that are shipped to Costco Wholesale retail outlets. Costco Wholesale is located at 7320 Lisbon Road, in Morris, Illinois. The facility is approximately 0.5 miles northwest of Highway 80. Morris is located approximately 55 miles southwest of Chicago. The immediate area is primarily\n\nurban. The ammonia system was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes.\n\n\n\nThe ammonia refrigeration system uses ammonia for meat production operations, warehouse cold storage, and freezer storage. Refrigeration process equipment at the facility operates continuously. Compressors and condensers cycle on and off to comply with system demand during operation. The majority of the system equipment is located in the ammonia engine\n\nroom as well as in the respective processing areas. The condensers are mounted on the engine room roof and the evaporators are placed in their respective cold storage areas.\n\n\n\nThe refrigeration cycle begins with the High Pressure Receiver / Thermosyphon Receiver which provides liquid feed to the High Temperature Recirculator (PR-3) and the Medium Temperature Recirculator (PR-4). The High Pressure Receiver / Thermosyphon Receiver also provides liquid feed to the compressors for thermosyphon oil cooling. The High Temperature Recirculator (PR-3) pumps high temperature liquid to the following equipment:\n\n\n\n?    Evaporators (AU12 - AU23, AU31 - AU34, AU42 - AU55, AU66), \n\n?    Air Handling Units (RTU1 - RTU4), \n\n?    Ambient Dry Storage Evaporators (AU31 - AU34)\n\n?    Glycol Heat Exchanger (GHX-4), \n\n?    Low-Low Temperature Recirculator (PR-1), and \n\n?    Low Temperature Recirculator (PR-2). \n\n\n\nThe High Temperature Recirculator receives return suction from these units, as"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000065904,
      "SummaryText": " well as return condensate from the Underfloor Heat Exchangers (GHX1 - GHX3) and the HCR Doors (HCR-1 & HCR-2). The vapor rises to the top of the vessel and is drawn off by the High Stage Compressors (RC1 - RC3). \n\n\n\nThe Medium Temperature Recirculator (PR-4) pumps high temperature recirculated liquid to the following equipment: \n\n\n\n?    High temperature evaporators (AU24 - AU30, AU35 - AU41, AU56 - AU65, AU67 - AU68, AU1 - AU4), and \n\n?    Heat Exchangers (HX-1 & HX2). \n\n\n\nThe Medium Temperature Recirculator (PR-4) also receives return suction from these evaporators, as well as booster discharge from the Booster Compressors (RCB1 & RCB2). Vapor rises to the top of the vessel and is pulled off by the High Stage Compressors (RC5 - RC8). \n\n\n\nThe Low Temperature Recirculator (PR-2) pumps liquid ammonia to the freezer evaporators (AU5 - AU11) and the Ice Makers (IM1 & IM2). \"Wet\" Suction from this equipment returns back to this same vessel. The vapor rises to the top of the vessel and is drawn off by the Booster Compressors (RCB3 - RCB5). \n\n\n\nThe Low-Low Temperature Recirculator (PR-1) pumps liquid ammonia to the Spiral Freezers (3 Units: Chub, Patty, & Meatball). There is a level column in the pipe that collects \"wet\" suction from this equipment. Vapor from this column is returned to the PR-1 via the wet suction return. As this fills with liquid ammonia, the pump is triggered to turn on along with a solenoid valve in the LTRS line and returns back to this same vessel. The vapor rises to the top of the vessel and is drawn off by the Booster Compressors (RCB1 & RCB2). \n\n\n\nThe Liquid Transfer Unit can transfer liquid from any of the four recirculators in the system (PR1 - PR4). Upon high level in a recirculator, the associated transfer solenoid valve is opened allowing flow of the excess liquid into the Liquid Transfer Unit. A transfer float at the Liquid Transfer unit will trigger the three-way valve to allow hot gas to pressurize the unit. The pressurized liquid is then dumpe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000065904,
      "SummaryText": "d to the High Pressure / Thermosyphon Receiver (HPR/TSR-1). \n\n\n\nThe compressors draw suction from the recirculators as shown below. The compressors raise the pressure and temperature of the vapor and the high stage compressors discharge to the condensers while the booster compressors discharge to the Medium Temperature Recirculator.\n\n\n\n?    High Stage compressors (RC1 & RC3) draw suction from the High Temperature Recirculator (PR-4). \n\n?    Medium Stage compressors (RC5 - RC8) draw suction from the Medium Temperature Recirculator (PR-3).\n\n?    Low-Low Temperature Booster compressors (RCB3 - RCB5) draw suction from the Low-Low Temperature Recirculator (PR-1). \n\n?    Low Temperature Booster compressor (RCB2) draws suction from the Low Temperature Recirculator (PR-2).\n\n?    High Temperature Swing Compressor (RC2) draws suction from either the High Temperature Recirculator or the Medium Temperature Recirculator. \n\n?    Booster Swing Compressor (RCB1) draws suction from either the Low Temperature Recirculator or the Low-Low Temperature Recirculator. \n\n\n\nThe Evaporative Condensers use a combination of sprayed water and fans blow air over the condenser coils. The ammonia flows through the coils, and is condensed to liquid as it rejects heat to the atmosphere. The resulting liquid condensate is then gravity drained to the High Pressure / Thermosyhon Receiver (HPR/TSR-1).\n\n\n\nRISK MANAGEMENT PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Costco Wholesale ammonia refrigeration system has many safety features. Much of the safety\n\nof the system is inherent in the policies and procedures that govern the operation of the system. For\n\nexample, the Costco Wholesale facility operates in accordance with OSHA's Process Safety\n\nManagement regulation. Refrigeration contractors, experts in the ammonia refrigeration industry,\n\nare contracted at the facility to maintain the system and perform any repairs.\n\n\n\nAmmonia sensors are strategically located in the engine room and refrigerated areas. In the ev"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000065904,
      "SummaryText": "ent\n\nof ammonia detection, an audible and visual alarm is triggered throughout the cold storage\n\nwarehouse. \n\n\n\nThe system also incorporates a pressure relief system. In the event of over-pressurization, vessels\n\nwill vent to a common header which relieves to the Water Diffusion Tank until the system pressure\n\ndecreases sufficiently to reseat the valves. This mechanism prevents vessels from rupturing in case\n\nthey become over pressurized.\n\n\n\nThe Costco Wholesale facility including the ammonia system was designed and constructed in\n\naccordance with the IIAR Standard 2 & ASHRAE-15 which specifically outline requirements for the safe\n\noperation of the ammonia refrigeration system. These safety features include a water diffusion tank,\n\nammonia sensors in the machine room as well as sensors in the cold storage and processing areas, and automatic shut down systems that prevent equipment damage and ammonia releases. In addition, the majority of the ammonia inventory is maintained inside the machine room and just outside of the machine room (condensers). All pressure vessels are equipped with pressure relief valves that automatically engage in case of a high pressure situation and vent through a common header to a water diffusion tank.\n\n\n\nCostco Wholesale has developed a preventive maintenance program to complete regularly scheduled inspections and tests of the ammonia refrigeration system as well as repairs as needed to process equipment. \n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nSince this is a new facility, there is no accident history to report. \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nCostco Wholesale has an emergency action plan in effect at the facility. The Emergency Action Plan\n\n(Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document,\n\nwhich is maintained at the facility. Emergency response activities are coordinated with the local\n\nMorris Fire Department. In case of a major ammonia emergency, the facility will first call 911 to alert the local P"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000065904,
      "SummaryText": "olice and Fire Departments. Other responders will be called as needed, including the\n\ncounty Hazardous Materials Response Team. If a release exceeds the federal reporting quantity of\n\n100 pounds for ammonia, the National Response Center will be called.\n\n\n\nThe Costco Wholesale facility has an Emergency Command System in place. The Utility Manager\n\nwill assume command in an emergency situation with backup personnel appointed to serve if he/she\n\nis not available. The Plan provides the response organization and notification procedures,\n\nevacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to\n\nrespond effectively to emergency situations that may arise at the facility. The facility holds\n\nevacuation drills at least once per year.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Costco Wholesale facility conducted a two phase Process Hazard Analysis (PHA) on June 21-22, 2017 and September 11, 2017. The 2017 PHA study includes the results from the two elements: 1) the Hazard and Operability (HAZOP) study and 2) a Site Inspection. These studies were performed to define\n\npotential hazard associated with operational deviations of the ammonia system.\n\n\n\nThe 2017 PHA generated recommendations to improve safety at the facility. Costco has a list of these\n\nrecommendations and is working to complete them in a timely manner.\n\n"
    }
  ]
}