{
  "FacilityID": 1000033596,
  "FacilityName": "Ducor Cold Storage",
  "FacilityStr1": "5351 Road 236",
  "FacilityStr2": null,
  "FacilityCity": "Ducor",
  "FacilityState": "CA",
  "FacilityZipCode": "93218",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "35.886779",
  "FacilityLongDecDegs": "-119.045396",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Growers Citrus Packing, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ducor Cold Storage",
  "OperatorStr1": "P.O. Box 10226",
  "OperatorStr2": null,
  "OperatorCity": "Terra Bella",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93270",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000063879",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-09-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-10-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-10-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-10-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.88444,
  "FRS_Long": -119.04583,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040988,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000033596,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000049208,
          "ProcessID": 1000040988,
          "ChemicalID": 56,
          "Quantity": 33000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000041427,
          "ProcessID": 1000040988,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000035797,
              "Process_NAICS_ID": 1000041427,
              "SafetyReviewDate": "2013-10-03 00:00:00",
              "PHA_Date": "2014-05-29 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-05-29 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-09-22 00:00:00",
              "TrainingReviewDate": "2012-10-18 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-10-18 00:00:00",
              "EquipmentInspectionDate": "2014-04-04 00:00:00",
              "EquipmentTested": "Annual MI Inspection",
              "ChangeMgmtDate": "2013-11-13 00:00:00",
              "ChangeMgmtReviewDate": "2012-10-18 00:00:00",
              "PreStartupReviewDate": "2013-04-15 00:00:00",
              "ComplianceAuditDate": "2012-10-02 00:00:00",
              "AuditCompletionDate": "2013-04-03 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-10-18 00:00:00",
              "HotWorkPermitReviewDate": "2012-10-18 00:00:00",
              "ContractorSafetyReviewDate": "2012-10-18 00:00:00",
              "ContractorSafetyEvalDate": "2014-09-22 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ducor Cold Storage has prepared a unified Risk & Process Safety Management Program. The program is in compliance with California's Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5 Program Level 3 Elements. At the Federal level, Title 40 CFR Part 68), and California OSHA's \"Process Safety Management (PSM) of Acutely Hazardous Materials\" standard (in California CCR Title 8, Section 5189, \"Process Safety Management of Acutely Hazardous Materials,\" and Federally Title 29 Code of Federal Regulations (CFR) 1910.119). This program has been prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs., which is contained in our refrigeration system.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000042281,
                  "PreventionProgram3ID": 1000035797,
                  "ProcessChemicalID": 1000049208
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000033596,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Tulare County Environmental Health",
    "CoordinatingAgencyPhone": "5596247421",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033596,
      "SummaryText": "EXECUTIVE SUMMARY 2010 Update\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nThe Ducor Cold Storage facility has implemented preventative maintenance procedures to ensure that the ammonia based refrigeration system is maintained in good operating condition.  Plant personnel monitor the operation of the refrigeration system on a daily basis.  Periodic preventative maintenance procedures are performed on the refrigeration equipment, including inspecting and testing the equipment to ensure the mechanical integrity of the system.  Properly maintained equipment reduces the risk of an accidental release. Several staffing changes since the last update have occured.\n\n\n\nWhile it is Ducor Cold Storage's objective to be a responsible citizen of the community in all of its business activities, the limited staff at the cold storage facility precludes emergency response operations.  As such, an emergency action plan has been prepared for the Ducor Cold Storage facility and a chain of command to respond to emergencies has been established. Ducor Cold Storage employees will take defensive actions of mitigation that do not require entering a hazardous area.\n\n\n\nThe Ducor Cold Storage facility has developed a detailed Compliance Audit Checklist which is used to evaluate compliance with the Process Safety Management (PSM) and RMP regulations.  At least every three years, Ducor Cold Storage audits these programs and any findings of noncompliance are documented and responded to and the deficiencies are corrected. \n\n\n\nDescription of the Stationary Source and Regulated Substances \n\n\n\nThe Ducor Cold Storage facility is located at 5351 Road 236.  Ducor is the closest community to the Ducor Cold Storage facility.  \n\n\n\nAnhydrous ammonia is used as the refrigerant that provides cooling for the Ducor Cold Storage facility.  The refrigeration system currently consists of two suction accumulators with liquid transfer systems, five compressors, two evaporative condensers, two h"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033596,
      "SummaryText": "igh pressure receivers, eight pre-cooler rooms, ten cold storage rooms, and the associated hallway, staging and shipping areas.  Bunker mounted accumulators are utilized to feed the flooded evaporators in the pre-cooler rooms and cold storage rooms.  \n\n\n\nDuring normal operation, the anhydrous ammonia is distributed throughout the refrigeration system.  However, during major maintenance activities, the refrigeration system can be \"pumped down\" to evacuate the ammonia from the system and store it in the high pressure receivers.  The maximum quantity of ammonia that can be stored in the largest high pressure receiver is over 10,000 pounds.  \n\n\n\nFor purposes of the offsite consequence analyses, the RMP regulations defines the toxic endpoint for anhydrous ammonia as 0.14 mg/l (200 ppm).\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nA PSM program, which meets the requirements of the general accidental release prevention program, has been implemented by the Ducor Cold Storage facility to address the anhydrous ammonia system.  The PSM program includes the following chemical-specific prevention steps:\n\n\n\n-Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process has been compiled.\n\n\n\n-Process Hazard Analyses (PHA) have been completed and will be updated and revalidated at least every five years. Recommendations are implemented in a timely manner.\n\n\n\n-Written operating procedures have been developed and will be reviewed at least annually.\n\n\n\n-Safe work practices, such as lockout/tagout, confined space entry, opening process equipment or piping, and control over entrance into the facility are implemented as needed.\n\n\n\n-Each employee involved in operating the ammonia system has received initial training and refresher training at least every three years.\n\n\n\n-Written mechanical integrity procedures have been established and implemented"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033596,
      "SummaryText": ".\n\n\n\n-A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system.\n\n\n\n-Pre-startup safety reviews will be performed when a modification is made to the ammonia system that is significant enough to require a change in the process safety information.\n\n\n\n-Audits will be conducted at least every three years to evaluate compliance with the RMP regulations.\n\n\n\n-Incident investigation procedures have been established and utilized.\n\n\n\n-A written plan of action regarding the implementation of employee participation has been developed and implemented.\n\n\n\n-Hot work permits will be issued for all hot work operations conducted on or near the ammonia system, as needed.\n\n\n\n-A Contractor Safety Policy has been developed and implemented.\n\n\n\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, the overall responsibility for the RMP elements has been assigned to the Plant Manager at the Ducor Cold Storage facility.  The Plant Manager has the overall responsibility for the development, implementation, and integration of the RMP elements.\n\n\n\nFive-Year Accident History\n\n\n\nThe Ducor Cold Storage facility has not had any accidental releases from the ammonia-based refrigeration system that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, property damage, or environmental damage in the last five years.  \n\n\n\nEmergency Response Program\n\n\n\nDucor Cold Storage has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  However, an emergency response program does not need to be developed for the facility since the Ducor Cold Storage employees will not respond to accidental releases of ammonia, the facility is included in the community emergency response plan, and appropriate mechanisms are in place to "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033596,
      "SummaryText": "notify emergency responders.  \n\n\n\nPlanned Changes To Improve Safety\n\n\n\nThrough the accidental release prevention program, Ducor Cold Storage regularly evaluates the need for any changes to improve safety.  We are currently evaluating and replacing older piping, removing sight glasses from room accumulators and have updated the NH3 alarm system."
    }
  ]
}