{
  "FacilityID": 1000113737,
  "FacilityName": "EF Oxnard LLC",
  "FacilityStr1": "550 Diaz Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.195728",
  "FacilityLongDecDegs": "-119.167107",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "MPH Oxnard, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "EF Oxnard LLC",
  "OperatorStr1": "550 Diaz Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Oxnard",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93030",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": "CAL000291607",
  "EPAFacilityID": "100000065653",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "VCAPCD #0214",
  "SafetyInspectionDate": "2024-04-10 00:00:00",
  "SafetyInspectionBy": "Oxnard Fire Department / CUPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.19677,
  "FRS_Long": -119.168423,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000141646,
      "AltID": "Turbine SCR System",
      "FacilityID": 1000113737,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000177197,
          "ProcessID": 1000141646,
          "ChemicalID": 56,
          "Quantity": 54000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000143182,
          "ProcessID": 1000141646,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000121226,
              "Process_NAICS_ID": 1000143182,
              "SafetyReviewDate": "2024-05-13 00:00:00",
              "PHA_Date": "2024-02-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2026-08-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "UPS for detectors, circuit breaker",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "CEM system, hand-held ammonia detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-05-13 00:00:00",
              "TrainingReviewDate": "2024-01-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Quarterly safety training and technical offsite conferences, HSI (computer based online training program)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-12-29 00:00:00",
              "EquipmentInspectionDate": "2024-04-29 00:00:00",
              "EquipmentTested": "Ammonia Tank",
              "ChangeMgmtDate": "2024-04-04 00:00:00",
              "ChangeMgmtReviewDate": "2020-03-04 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2023-06-14 00:00:00",
              "AuditCompletionDate": "2024-12-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-10-17 00:00:00",
              "HotWorkPermitReviewDate": "2019-02-08 00:00:00",
              "ContractorSafetyReviewDate": "2024-03-29 00:00:00",
              "ContractorSafetyEvalDate": "2024-03-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000152107,
                  "PreventionProgram3ID": 1000121226,
                  "ProcessChemicalID": 1000177197
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000113737,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Oxnard Fire Dept., CUPA",
    "CoordinatingAgencyPhone": "8053857740",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000113737,
      "SummaryText": "ms:\n\n1.  Continue to train all employees in the facility safety plan/programs.\n\n2.  Continue to have employee involvement in safety plan development.\n\n3.  Continue employee involvement through safety team participation.\n\n4.  Continue internal and external safety audits/inspections and implement changes as needed."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000113737,
      "SummaryText": "nt property damage (§68.42(a)); or\n-  Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)).\n\nBased on the above definition and an investigation into the EF Oxnard LLC the SCR system's accident history conducted at the time of the Process Hazard Analysis Revalidation study (February 22, 2024), there have been no significant releases of ammonia at the SCR system that exceeded the Federal Reportable Quantity of 100 pounds in the last five years (February 2019 to February 2024) or the state requirement mandating immediate reporting of any release or threatened release of hazardous material.   In addition, there have been no injuries resulting from an ammonia release, nor any releases or near misses that warranted an internal incident investigation.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nEF Oxnard LLC has developed a written emergency plan to deal with accidental releases of hazardous materials.  The plan includes the following information describing the actions of employees over the course of a release event:\n\n- Alarm system activation and signal interpretation\n- Safe evacuation, assembly locations and return to the facility\n- Selection of response strategies based on type of incident\n- Incident command structure and emergency contact list\n- List of response equipment onsite and authorized use of equipment by employees\n- Release mitigation activities and measures in place\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazards Analysis Revalidation study (performed on February 22, 2024), including a Hazard and Operability (HAZOP) study, completion of checklists, and a facility inspection provided mitigation measures to improve safety for the SCR system at the EFO LLC facility located at 550 Diaz Avenue in Oxnard, California. EF Oxnard LLC is planning to complete several items over the next year, as a continual effort to provide a safe work environment for its employees.  These changes include the following ite"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000113737,
      "SummaryText": "ade up of local and remote indicators, sensors, and alarms that monitor operating levels, pressures and temperatures, and relay information to the facility Control Room Operator through an automated Distribution Control System (DCS).\n\nThe ammonia handling processes include relief, excess flow, and vent valves that can provide a margin of safety in the event of deviations from normal conditions.  These safety mechanisms allow the operator to identify and isolate the problem and either return the system to normal conditions, or safely shut down the process.  The ammonia storage tank has a deluge system, which, in the event of a major leak or release, will activate high pressure water nozzles around the tank. Furthermore, ammonia sensors are installed at various locations throughout the facility, and there are automatic system shutdowns.\n\nA number of administrative safety procedures complement the process safety equipment at the EF Oxnard LLC facility.  These include written standard operating procedures (SOP) for all processes; regularly scheduled shift walkdown and inspections of all major equipment, including valves and alarms; extensive use of procedural checklists, such as for ammonia tank loading; and an automated preventative maintenance system for tracking daily repair work orders and scheduled maintenance operations. \n\nAn operator training program encompassing operating procedures, safety and health, and emergency response refresher ammonia safety training, helps ensure that employees think, act, and work safely while on the job.\n\nIn addition to the OSHA PSM, the EF Oxnard LLC facility holds federal and state emergency response and safety plans.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nEPA's RMP regulation defines accident as the following:\n\nThe release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\n\nThe release must have caused at least one of the following:\n\n-  On-site deaths, injuries, or significa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000113737,
      "SummaryText": "pment is properly maintained and functioning properly; operating procedures to ensure that equipment is operated in a manner that minimizes the possibility of an ammonia release; employee training to ensure that operators know how to properly use the equipment and non-operators are aware of the dangers of ammonia and the necessary steps to take in the event of an ammonia release; and fencing around the site to minimize the possibility of a third party damaging  equipment or releasing ammonia.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe EF Oxnard LLC facility, located at 550 Diaz Avenue in Oxnard, California, utilizes a selective catalytic reduction (SCR) unit that uses ammonia to control oxides of nitrogen (NOx) emissions from the exhaust of a natural gas-fired cogeneration gas turbine. Anhydrous ammonia is stored in a 12,800-gallon tank and fed to the SCR unit. Current facility policy implements administrative controls to limit the contents to 85% of the tank capacity.  Therefore, the maximum quantity of anhydrous ammonia that is handled in this system is 10,500 gallons. \n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nIn the state of California, the California Occupational Safety and Health Administration (Cal-OSHA) has implemented a state driven Process Safety Management Program rule that also satisfies federal requirements. The facility maintains, as required by the Occupational Safety and Health Administration, its Process Safety Management (PSM) Program, which provides for the identification, prevention and minimization of chemical releases that could result from failures in processes, procedures and equipment.  The major safety systems in place at the facility include process safety equipment and administrative safety procedures.  \n\nThe EF Oxnard LLC facility is designed and built according to accepted safety codes and standards for electrical, mechanical, and structural integrity.  EF Oxnard LLC process safety equipment includes a number of redundant systems, m"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000113737,
      "SummaryText": "Per the federal U.S. EPA requirements of 40 CFR Part 68 (Risk Management Plan, or RMP) and the California requirements of Chapter 6.95, California Health & Safety Code's Accidental Release Prevention (CalARP) Program, the RMP and CalARP must be updated and resubmitted at least once every 5 years, unless certain process changes described in 40 CFR Part 68.190 occur prior to the 5-year RMP anniversary; if this occurs, the 5-year anniversary date is reset whenever a full update is made. This RMP/CalARP, submitted by EF Oxnard, LLC (EFO), presents the 5-year anniversary update and resubmittal.\n\nAs background for this facility, EF Oxnard LLC (EF Oxnard) is the current operator. EF Oxnard, Inc. (EFO) was the original owner/operator of the facility that prepared a Risk Management Plan (RMP) to U.S. EPA and the City of Oxnard Fire Department under the CalARP; the RMP/CalARP document was submitted on June 21, 1999. \n\nAs required by the federal EPA, this executive summary has been submitted to the EPA.  This RMP Public Document presents the efforts of EF Oxnard LLC to manage and prevent risks associated with the storage and use of anhydrous ammonia at its cogeneration facility located in the City of Oxnard and County of Ventura, California. \n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of EF Oxnard LLC to protect the health and safety of its employees, officers, and the general public.  It is the firm policy of EF Oxnard LLC to fully and faithfully comply with all requirements, both substantive and reporting, of all environmental, health, and safety statues, regulations, ordinances, and permits affecting the operations and maintenance of our plant.  EF Oxnard LLC has in place a number of plans for responding to emergency situations.  These plans are described in the PSM/RMP/CalARP documents maintained onsite.\n\nTo prevent the accidental release of ammonia, EF Oxnard LLC has developed the following: maintenance procedures to ensure that equi"
    }
  ]
}