{
  "FacilityID": 1000078255,
  "FacilityName": "Cargill, Inc.",
  "FacilityStr1": "1710 16th St., S.E.",
  "FacilityStr2": "N/A",
  "FacilityCity": "Cedar Rapids",
  "FacilityState": "IA",
  "FacilityZipCode": "52401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19113",
  "LEPC": "Linn County LEPC",
  "FacilityLatDecDegs": "41.969279",
  "FacilityLongDecDegs": "-091.650166",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 94783594,
  "ParentCompanyName": "Cargill, Inc.",
  "Company2Name": "N/A",
  "CompanyDUNS": 6249189,
  "Company2DUNS": 0,
  "OperatorName": "Dan Pulis",
  "OperatorStr1": "1710 16th St., S.E.",
  "OperatorStr2": null,
  "OperatorCity": "Cedar Rapids",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52401",
  "OperatorZipCodeExt": "1467",
  "FTE": 211,
  "OtherEPAFacilityID": "IAD 098 026545",
  "EPAFacilityID": "100000127267",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "07-TV-006R2",
  "SafetyInspectionDate": "2018-10-04 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 41.96916,
  "FRS_Long": -91.6423,
  "FRS_Description": "OTHER",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097483,
      "AltID": "Propylene Oxide",
      "FacilityID": 1000078255,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000121986,
          "ProcessID": 1000097483,
          "ChemicalID": 12,
          "Quantity": 65682.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000098731,
          "ProcessID": 1000097483,
          "NAICSCode": "311221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000082777,
              "Process_NAICS_ID": 1000098731,
              "SafetyReviewDate": "2018-11-02 00:00:00",
              "PHA_Date": "2017-07-19 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": "Layers of Protection Analysis (LOPA)",
              "PHACompletionDate": "2019-07-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Human Factors",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "Underground storage, Diversion to reactor vessel",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Underground storage, Diversion to reactor vessel",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-11-02 00:00:00",
              "TrainingReviewDate": "2018-11-02 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-02-28 00:00:00",
              "EquipmentInspectionDate": "2019-03-08 00:00:00",
              "EquipmentTested": "LDAR testing (all piping, valves, flanges and connections from PO tank)",
              "ChangeMgmtDate": "2019-04-23 00:00:00",
              "ChangeMgmtReviewDate": "2016-09-21 00:00:00",
              "PreStartupReviewDate": "2019-01-11 00:00:00",
              "ComplianceAuditDate": "2018-06-21 00:00:00",
              "AuditCompletionDate": "2021-06-19 00:00:00",
              "IncidentInvestigationDate": "2019-03-07 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-11-02 00:00:00",
              "HotWorkPermitReviewDate": "2017-12-31 00:00:00",
              "ContractorSafetyReviewDate": "2019-02-15 00:00:00",
              "ContractorSafetyEvalDate": "2019-02-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "Propylene Oxide",
              "_chemicals": [
                {
                  "PrimaryKey": 1000102779,
                  "PreventionProgram3ID": 1000082777,
                  "ProcessChemicalID": 1000121986
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000078255,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-03-20 00:00:00",
    "ERTrainingDate": "2019-04-30 00:00:00",
    "CoordinatingAgencyName": "Cedar Rapids Fire Department",
    "CoordinatingAgencyPhone": "3192865200",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078255,
      "SummaryText": "Cargill Inc. owns and operates a wet corn milling facility in Cedar Rapids, Iowa which is subject to U.S. EPA regulations governing Accidental Release Prevention Requirements: Risk Management Programs under Section 112(r) of the Clean Air Act (40 CFR Part 68). The Risk Management Plan (RMP) update being submitted at this time was developed in accordance with the requirements specified under 40 CFR Part 68. The plan certifies that Cargill Starches and Sweeteners North America has instituted an up to date RMP at the Cedar Rapids, Iowa facility.\n\n\n\nThe only covered process and regulated substance on-site is Propylene Oxide (PO) which is stored in an underground storage tank. Any accidental release of PO is included in this update to the RMP. \n\n\n\nAccidental Release and Emergency Response Policies.\n\n\n\nCargill's policy is to conduct all business activities in a manner that protects the environment and the health and safety of our employees, contractors, customers and the public.\n\n\n\nEnvironment. Cargill will comply with all applicable environmental requirements, prevent pollution, and continually improve performance on criteria relevant to its businesses and operations.\n\n\n\nHealth and Safety. Cargill will comply with all applicable occupational health and safety, process safety, and product safety requirements, continually improve performance on criteria relevant to its businesses and operations, and insist that all work, however urgent, be done safely.\n\n\n\nFood and Product Safety. Cargill is committed to providing safe food and animal feed products and services. We will use only those product development, procurement, supply chain, transportation, storage production, manufacturing, and distribution systems and suppliers that ensure the safety and regulatory compliance of our products. We will communicate relevant food safety matters both internally and externally. We will adhere to the food safety requirements we have mutually agreed to with our customers.\n\n\n\nEvery Cargill "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078255,
      "SummaryText": "Business Unit, Function, and employee has a responsibility to ensure the production of safe products that comply with the applicable laws, regulations and Corporate Food Safety and Regulatory Affairs requirements. Cargill management will provide the resources and support necessary to enable our employees to fulfill this responsibility and continually improve our programs and processes.\n\n\n\nAccident Prevention Program.\n\n\n\nThe Cargill facility in Cedar Rapids is designed, maintained and operated so as to minimize adverse impacts to its employees, local communities and the environment. Plant management makes information available to the local community regarding the hazards and risks in operating the facility and the prevention techniques in place. This includes ensuring that all regulatory requirements are met.\n\n\n\nPlant management is fully informed as to the materials that are stored or used on-site and aware of the possible risk associated with their handling, storage, use, disposal or accidental release. Safety Data Sheets (SDS's) for all materials utilized at the facility are maintained on-site. The facility maintains inspection records and up-to-date procedures to ensure the proper control of hazardous materials. Procedures and systems are devised which include provisions for the periodic testing, review, and update of the emergency response programs.\n\n\n\nEmployees are trained and periodically retrained in the methods of detection of hazardous material releases, the potential physical and health risks associated with the materials, and methods for protecting themselves, co-workers, and the public. The facility investigates, corrects, and reports in writing all incidents involving hazardous materials having caused, or having the potential for causing, injury or loss.\n\n\n\nThe processes subject to the risk management regulations are also subject to Occupational Safety and Health Administration (OSHA) Process Safety Management Standard (PSM). Cargill has a PSM program ut"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078255,
      "SummaryText": "ilized for the prevention of accidental chemical releases of propylene oxide at the Cedar Rapids facility that includes the following elements: Employee Training and Participation, Process Safety Information, Process Hazards Analysis, Operating Procedures, Training, Contractors, Pre-Startup Safety Review, Mechanical Integrity, Hot Work Permit, Management of Change, Incident Investigation, Emergency Planning and Response and Compliance Audits. The Cargill Cedar Rapids facility's safety program incorporates continuous improvement through use of on-going evaluations of safety and programs.\n\n\n\nIn conjunction with the current RMP and PSM programs in place at the Cedar Rapids Corn Milling facility, there is a standard management practice that requires internal reporting of unusual events, including those in which any abnormal emission of regulated chemicals is observed or suspected. The incident information is reviewed and a determination is made as to whether a reportable quantity of any chemical listed as requiring reports to regulatory authorities is involved. If so, the appropriate authorities are notified.\n\n\n\nFive Year Accident History.\n\n\n\nDuring the past 5 years, there have been no accidents involving any RMP regulated substance that qualifies for reporting under 40 CFR Part 68. This means that no accident has resulted in reportable on-site injury, off-site injury, evacuations, sheltering in place, or damage to property or the environment.\n\n\n\nEmergency Response Program.\n\n\n\nCargill's Cedar Rapids facility has established an Emergency Action Plan to ensure appropriate steps are taken to protect the public health and the environment, as well as the safety of the plant employees. The EAP is designed to address foreseeable emergency situations at the facility and provide appropriate hazard and emergency preparedness information to employees, contractors, emergency response personnel, and the community. Emergency situations can include fire, explosion, chemical release or"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078255,
      "SummaryText": " spill, bomb threats, weather emergencies and other natural emergencies. Cargill has personnel available to administer basic first aid and CPR. Cargill has developed procedures to be followed in the event of an emergency. If an emergency release of PO occurs that is beyond what would be considered an incidental release that employees are trained to handle as part of their routine operational duties, Cargill will initiate plant evacuation procedures.  Cargill will rely on the Cedar Rapids Fire Department, Linn County HAZ-MAT team, and Area Ambulance/Paramedic Services for assistance as required to control and resolve emergencies.\n\n\n\nPlant operation at the Cargill Cedar Rapids facility can present various types of potential hazards and Cargill recognizes the need to have a well-trained and prepared work force to safely and effectively deal with emergency situations. A preventative maintenance program to inspect and test emergency response equipment has been established. Classroom training and drills are conducted to ensure responsible staff know the appropriate response in the event of an emergency. Emergency response training exercises have included the Cedar Rapids Fire Department, CRFD or Linn County HAZ-MAT team, Area Ambulance/Paramedic Services and the LEPC. Important communication links with the community are maintained through Cargill plant staff attendance at regularly scheduled meetings with local industry and emergency response planning officials.\n\n\n\nPlanned Changes to Improve Safety.\n\n\n\nCargill's Cedar Rapids Corn Milling facility, under the RMP program, as well as its existing PSM and earlier SARA Title III Community Right-to-Know Act compliance programs has organized its management system to effectively address foreseeable hazards and potential risks. Both the advanced planning aspects of process design, operating procedures, and emergency preparedness, and the operational elements of system maintenance, safe operating practices and ongoing personnel tra"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078255,
      "SummaryText": "ining are necessary to support a continual improvement in facility safety. These programs are documented so that information about safe handling of chemicals at the facility is readily available to all employees and in the event questions arise from public officials regarding potential risks to the community. \n\n\n\nThe Cargill Cedar Rapids facility's safety program incorporates continuous improvement through use of on-going evaluations of safety and programs.  In January 2016, the facility was officially recognized as a STAR site under OSHA's Voluntary Protection Program (VPP).  Recertification under this program was obtained in April 2019. In order to achieve this elite designation, the facility submitted over 60 pages of information describing the facility's safety programs.  Auditors from OSHA then conducted an intense onsite audit reviewing the facility's equipment and structures, its documentation as well as conducting interviews with a wide variety of employees.  This audit included Cargill's management of highly hazardous chemicals.   Companies who receive VPP status are considered roles models in their industry and have attained a high degree of management support and employee involvement in the safety program.   By participating in VPP and receiving the STAR designation, Cargill Cedar Rapids has demonstrated that it has a rigorous commitment to maintaining a safe work environmental for its employees and the community.  As part of maintaining its STAR status, Cargill Cedar Rapids will do regular self-reviews of its programs to identify improvement opportunities and will also receive periodic recertification audits from OSHA. \n\n\n\nAll of these features of the RMP and the integrated risk management program at the Cargill Cedar Rapids facility lead to operations that are safe today, but will be even safer tomorrow.\n\n "
    }
  ]
}