{
  "FacilityID": 1000103827,
  "FacilityName": "Lost Pines 1 Power Plant",
  "FacilityStr1": "256 Power Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Bastrop",
  "FacilityState": "TX",
  "FacilityZipCode": "78602",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48021",
  "LEPC": "Bastrop County LEPC",
  "FacilityLatDecDegs": "30.147778",
  "FacilityLongDecDegs": "-097.271389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lcra.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 112045708,
  "ParentCompanyName": "Gentex Power Corp.",
  "Company2Name": "Lower Colorado River Authority",
  "CompanyDUNS": 71023449,
  "Company2DUNS": null,
  "OperatorName": "GenTex Power Corporation",
  "OperatorStr1": "256 Power Plant Road",
  "OperatorStr2": null,
  "OperatorCity": "Bastrop",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78602",
  "OperatorZipCodeExt": null,
  "FTE": 59,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000175017",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-00021",
  "SafetyInspectionDate": "2022-02-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Anhydrous Ammonia for SCR",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-09-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-01-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-01-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-01-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 30.147778,
  "FRS_Long": -97.271389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000129261,
      "AltID": "Ammonia Storage",
      "FacilityID": 1000103827,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000162042,
          "ProcessID": 1000129261,
          "ChemicalID": 56,
          "Quantity": 128000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000130656,
          "ProcessID": 1000129261,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000079819,
              "Process_NAICS_ID": 1000130656,
              "SafetyReviewDate": "2022-03-31 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2022-03-31 00:00:00",
              "ChangeCompletionDate": "2022-03-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-10-03 00:00:00",
              "TrainingReviewDate": "2022-12-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-12-01 00:00:00",
              "EquipmentInspectionDate": "2022-04-27 00:00:00",
              "EquipmentTested": "Annual Maximo Workorder Equpment list",
              "ComplianceAuditDate": "2022-01-27 00:00:00",
              "AuditCompletionDate": "2022-01-27 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000080548,
                  "PreventionProgram2ID": 1000079819,
                  "ProcessChemicalID": 1000162042
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000103827,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-03-31 00:00:00",
    "ERTrainingDate": "2022-02-09 00:00:00",
    "CoordinatingAgencyName": "Bastrop County ESD No. 2",
    "CoordinatingAgencyPhone": "8443473373",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "40 CFR 60, 40 CFR 70, 40 CFR 75"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000103827,
      "SummaryText": "igation documentation shall be retained by Plant Environmental Support as part of the facility RMP for a maximum of five years.  \n\nFor any accidental release meeting the five-year accident history reporting criteria of §68.42,\nPlant Environmental Support in conjunction with Environmental Affairs and Legal Services shall \nsubmit the data required under §§68.168, 68.170(j), and 68.175(l) with respect to that accident within \nsix months of the release or by the time the RMP is updated under §68.190, whichever is earlier.\n\nEmergency Response-\n\n Emergency Response coordination with local emergency planning and response agencies is completed on an annual basis.  Emergency Response exercises (Tabletop Exercises) are conducted by LCRA Public Safety personnel.   Emergency Response activities are routinely conducted and involve but are not limited to LCRA\u0092s contracted Emergency Response vendor, LCRA\u0092s contracted anhydrous ammonia supplier, Lost Pines Power Park employees, local emergency response personnel from Bastrop County and appropriate mutual aid entities."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000103827,
      "SummaryText": ", that the procedures and practices are adequate, LP1 conducts a compliance audit every three years.  The compliance audit is conducted by at least one person knowledgeable in the anhydrous ammonia system.  Additionally, the audit team may include representatives from Plant Operations, Plant Maintenance, Plant Environmental Support, Plant Engineering, and Safety.\nA compliance audit checklist has been prepared listing elements of the anhydrous ammonia system and appropriate documentation to be audited, the audit findings, the action taken, and the date each audit finding was resolved. The audit team shall walk through the facility and check relevant items. The checklist will include the following as a minimum:\n\n\u0095\tConfirmation with LCRA Safety that a current SDS is available to employees \n\u0095\tVisual verification of the condition of tanks, piping, pressure relief valves, \n        emergency shut-off valves, gauges, pumps, and hoses \n\u0095\tReview of employee training records\n\u0095\tReview of appropriate Safety, operations, and maintenance procedures\n\u0095\tInspection of Safety equipment required\n\n       Written records of compliance audit findings are kept on file for a maximum of five years.\n\nIncident Investigation\n\nEmployees will promptly report all incidents including but not limited to those that have resulted in, or could reasonably be expected to result in, the catastrophic release of anhydrous ammonia. Based upon the severity of the incident, an investigation will be conducted.  The investigative team will include a representative from Plant Operations, Plant Maintenance, Plant Environmental Support, Plant Engineering, and Safety as a minimum.  The findings of the investigation, along with any corrective actions taken to prevent recurrence of the incident, will be documented by the investigation team, and reviewed with the Plant Director.  The investigation findings and any corrective actions will also be reviewed with plant personnel, including contractors as appropriate. Invest"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000103827,
      "SummaryText": "ydrous ammonia system to detect, report, and suppress leaks.  This review is updated at least once every five years and/or whenever a major change in the process occurs.\n\nOperating Procedures-\n\nLP1 maintains operating procedures that address the various modes of process operations, including initial startup, routine startup and shutdown, emergency shutdown, emergency operation, routine operation, and temporary operation. The procedures also detail safe upper and lower process limits and consequences of deviation from safe limit.  The procedures are readily available to all Lost Pines Power Park personnel and are reviewed on a recurring basis.\n\nTraining-\n\nAll operations personnel at LP1 are initially trained in an overview of the anhydrous ammonia system including the storage tanks, the ammonia dilution/injection process, the delivery process, and the procedures to safely operate the process.  Operations personnel and other associated personnel working on the system receive refresher training every three years, with a written demonstration of knowledge.  All plant personnel and associated personnel receive annual awareness training via the LCRA Learning Management System (LMS). \n\nMaintenance-\n\nProcedures for maintaining the on-going mechanical integrity of the anhydrous ammonia system are contained in the facility preventative maintenance program and follow Original Equipment Manufacturers (OEM) guidelines.  Maintenance procedures follow a schedule that matches the OEM\u0092s recommendation and/or as operating experience indicates is necessary.  Some anhydrous ammonia system maintenance activities are completed in conjunction with an outside contracted vendor with specific anhydrous ammonia experience.  LP1 Maintenance personnel that participate in the maintenance activities and have received training in the process hazards and how to correct unsafe conditions if possible.\n\nCompliance Audits\n\nTo ensure that the accidental release prevention program is functioning properly"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000103827,
      "SummaryText": "ments to ensure that the process hazards are understood and that the plant is operated and maintained in a safe manner.  These documents include information concerning the hazards of anhydrous ammonia, process technology and process equipment. Anhydrous ammonia hazard documentation includes but is not limited to Safety Data Sheets (SDS), maximum storage capacity in individual vessels, safe upper and lower operating limits, and consequences of deviating from safe limits.  Process equipment documentation includes but is not limited to information on the materials of construction, piping specifications, piping and instrumentation diagrams, electrical area classifications, system design codes/standards used to design, build, and maintain the anhydrous ammonia system, and safety systems.  This information is updated when changes are made to processes.\n\nLP1 has additional Safety systems in place to prevent accidental releases of anhydrous ammonia, as well as systems to lessen the impact of an accidental release.  These systems include redundant monitoring of critical process parameters, redundant critical equipment, automated shutdown systems, pressure relief valves, and a water deluge system over the storage tanks and anhydrous ammonia delivery area.  \nHazard Review-\n\nLP1 completes a comprehensive review in conjunction with LCRA Safety personnel to ensure that the hazards associated with the regulated process are systematically identified and controlled. This review completed in accordance with regulatory requirements, general industry standards, and guidance from safety organizations such as the Center for Chemical Process Safety.  The review includes operational processes and opportunities for equipment malfunction and/or human error that could cause an anhydrous ammonia release and safeguards that will control the hazards and/or prevent the malfunction and/or error. In addition, ammonia sensors, alarms, and a deluge system are installed at key locations around the anh"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000103827,
      "SummaryText": "Management System-\n\nLost Pines 1 Power Plant (LP1) has developed a Risk Management Plan Manual with detailed procedures outlining the program.  This system uses existing proven policies and procedures that are a part of LCRA\u0092s successful environmental, health and safety record.  These policies and procedures are enhanced as necessary to document compliance with USEPA\u0092s Risk Management Plan regulations.  The Risk Management Plan Manual is designed as a tool to guide the user through the methods, procedures, and documentation required comprising LP1\u0092s RMP compliance.  The Lost Pines Power Park Director is responsible for the integration and implementation of this program.\n\nDescription of the Stationary Source and regulated substance:\n\nLP1, located in Bastrop County, Texas, is a gas-fired combined cycle power plant that produces electricity. As a means of reducing nitrogen oxide emissions from the two gas-fired combustion turbines, anhydrous ammonia is injected into the turbine exhaust streams acting as a reductant for the Selective Catalytic Reduction system.  The anhydrous ammonia is stored on-site in two storage tanks located on opposite sides of the units.  The storage limit of each tank at 12,800 gallons or approximately 64,000 pounds exceeds the threshold quantity for RMP applicability.\n\n Accidental Release Prevention Program-\n\nThe Lower Colorado River Authority (LCRA) has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as mandatory technical and safety training for all facility personnel and considering safety in the design, installation, operation, and maintenance of our processes. It is the policy of LCRA to implement reasonable controls to prevent releases of regulated substances.  LP1 is subject to Program Level 2 of USEPA\u0092s RMP rule.  The accidental release prevention program at LP1 includes:\n \nProcess Safety Information-\n\nLP1 maintains a variety of technical docu"
    }
  ]
}