{
  "FacilityID": 1000024080,
  "FacilityName": "MarkWest Langley Processing Plant",
  "FacilityStr1": "72 Maple Street",
  "FacilityStr2": null,
  "FacilityCity": "Langley",
  "FacilityState": "KY",
  "FacilityZipCode": "41645",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21071",
  "LEPC": "Floyd LEPC",
  "FacilityLatDecDegs": "37.527340",
  "FacilityLongDecDegs": "-082.799950",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.markwest.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "MarkWest Energy Appalachia, L.L.C.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": 362584435,
  "OperatorName": "MarkWest Energy Appalachia, L.L.C.",
  "OperatorStr1": "72 Maple Street",
  "OperatorStr2": null,
  "OperatorCity": "Langley",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "41645",
  "OperatorZipCodeExt": null,
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000024779",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "F-11-073",
  "SafetyInspectionDate": "2011-08-26 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-01-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-01-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-01-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-01-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 37.52734,
  "FRS_Long": -82.79995,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029490,
      "AltID": "Natural Gas Liquids Extra",
      "FacilityID": 1000024080,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000035374,
          "ProcessID": 1000029490,
          "ChemicalID": 155,
          "Quantity": 890812.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000029778,
              "ProcessChemicalID": 1000035374,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000029779,
              "ProcessChemicalID": 1000035374,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000029780,
              "ProcessChemicalID": 1000035374,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000029781,
              "ProcessChemicalID": 1000035374,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000029782,
              "ProcessChemicalID": 1000035374,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000029783,
              "ProcessChemicalID": 1000035374,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000029784,
              "ProcessChemicalID": 1000035374,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000029772,
          "ProcessID": 1000029490,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000025481,
              "Process_NAICS_ID": 1000029772,
              "SafetyReviewDate": "2011-04-27 00:00:00",
              "PHA_Date": "2011-12-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-09-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "hill on east side 60 feet tall",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "gas detectors in the process areas",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-07-11 00:00:00",
              "TrainingReviewDate": "2011-04-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-04-27 00:00:00",
              "EquipmentInspectionDate": "2011-08-15 00:00:00",
              "EquipmentTested": "Cranes",
              "ChangeMgmtDate": "2011-05-06 00:00:00",
              "ChangeMgmtReviewDate": "2011-05-06 00:00:00",
              "PreStartupReviewDate": "2011-03-22 00:00:00",
              "ComplianceAuditDate": "2011-04-27 00:00:00",
              "AuditCompletionDate": "2012-03-30 00:00:00",
              "IncidentInvestigationDate": "2008-01-18 00:00:00",
              "InvestigationChangeDate": "2008-07-04 00:00:00",
              "ParticipationPlansReviewDate": "2011-04-27 00:00:00",
              "HotWorkPermitReviewDate": "2011-08-01 00:00:00",
              "ContractorSafetyReviewDate": "2011-08-01 00:00:00",
              "ContractorSafetyEvalDate": "2011-08-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000030365,
                  "PreventionProgram3ID": 1000025481,
                  "ProcessChemicalID": 1000035374
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000024080,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-12-30 00:00:00",
    "ERTrainingDate": "2012-01-05 00:00:00",
    "CoordinatingAgencyName": "Maytown Fire Department",
    "CoordinatingAgencyPhone": "6062859543",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024080,
      "SummaryText": "MarkWest Energy Appalachia, L.L.C. - Langley Plant, is a natural gas liquids extraction facility located in a rural section of Floyd County near Maytown, Kentucky. At this location we can extract up to 150,000 gallons per day of natural gas liquids from raw natural gas that is piped to the plant. The liquid product primarily consists of liquid propane with lesser amounts of butane, isobutane,isopentane, hexane and smaller quantities of ethane and methane. This mixture of natural gas liquids is flammable and is considered to be hazardous by the US Environmental Protection Agency. The liquids are stored in seven pressurized horizontal bullet storage tanks with a total capacity of 210,000 gallons. Also in the process area are four smaller tanks with a total capacity of 27,000 gallons giving a total site capacity of 237,000 gallons. Because of the proximity of the storage tanks to each other, they are considered part of the same process. It is our policy to take proactive action to reduce the risk of exposure of these hazardous chemicals to company employees, the local community and the environment. We comply or are in the process of updating our compliance with all Federal and State regulations including OSHA Process Safety Management. These regulations require specific actions to identify potential hazards in the process, to train operators in procedures that will reduce potential releases of hazardous chemicals and appropriate measures to reduce the potential of uncontrolled process releases. Due to our efforts in these safety and prevention programs, there has been no accidental releases of hazardous chemicals in the last five years. In the event of an accidental release of hazardous chemicals, we are trained to respond by means of an Emergency Action Plan. The Emergency Action Plan includes step by step procedures for protecting plant personnel and the general public in the event of an uncontrolled release of hazardous chemicals and includes response and evacuation"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024080,
      "SummaryText": "procedures. The Emergency Action Plan also involves the use of the Maytown Fire Department. Members of the fire department are involved in the development of the Emergency Action Plan and ongoing discussions on the coordinated responsibility of both the company and the fire department in the event of an uncontrolled release of hazardous chemicals.\r\n\r\n1.\tAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe MarkWest Energy Appalachia (MarkWest) - Langley facility located in Maytown, Kentucky is strongly committed to employee, public, and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program that covers such areas as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is the policy of MarkWest to implement appropriate controls to prevent the possible release of regulated substances.  Unforeseeably, if such a release does occur, MarkWest is completely coordinated with the Floyd County Local Emergency Planning Committee (LEPC) which provides emergency response personnel to control and mitigate the effects of the release.\r\n\r\n2.\tThe Stationary Source and the Regulated Substance Handled\r\n\r\nThe primary function of the MarkWest facility encompasses natural gas liquid (Y-Grade) extraction.  Y-Grade is the one substance present at the facility that is regulated by Risk Management Plan (RMP) regulations.  This flammable substance is a mixture comprised of propane, normal butane, isobutane, and natural gasoline (pentanes and hexanes).\r\n\r\nThe facility Y-Grade is extracted from a natural gas gathering pipeline.  Once extracted, the Y-grade is stored in pressurized storage vessels prior to being transferred via truck/pipeline to a fractionation facility.\r\n\r\nProduct is stored in 7 - 30,000 gallon pressurized tanks along with an additional four tanks totalling 27,000 gallon capacity.  Product stored in the vessel is administratively contr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024080,
      "SummaryText": "olled to ensure that the vessels are not filled above 85% of capacity.  Additionally, pressure relief devices provide added assurance that the vessels are not over-filled to pressures above 250 pounds per square inch (psi).  These controls are in place to prevent the potential for over-pressurization which could cause structural damage to the vessels and lead to a release.\r\n\r\nBased on the administrative controls described above, the maximum inventory present at the facility would be equal to 85% of the total 237,000-gallon capacity:  201,450 gallons (890,811 the equivalent of  pounds) of Y-Grade.  For the largest container this would be 85% x 30,000 = 25,500 gallons (112,761 pounds).\r\n\r\n3.\tThe Worst Case Release Scenario and Alternative Release Scenario\r\n\r\nThe parameters of the offsite consequence analysis for this MarkWest facility were based on the requirements set forth in the RMP rules outlined in 40 CFR 68.25 (e), Worst-case release scenario-flammables and 40 CFR 68.28, Alternative release scenario analysis.  The worst case and alternative case radii of effect were determined utilizing RMP*Comp software provided by the EPA. The worst case scenario is described as a pressurized vessel releasing the contents to atmosphere, all liquids vaporizing and then an explosion. This results in 25,500 gallons released.  The alternative case scenario is for a fill hose to rupture and a maximum of five minutes elapse prior to complete shutoff.  The average hose flow rate is approximately 200 gallons per minute so a five-minute release would be 1,000 gallon maximum release.  Calculations to show each constituent weight are given at the conclusion of this section\r\n\r\n4.\tThe General Accident Release Prevention Program and the Chemical-Specific Prevention Steps\r\n\r\nMarkWest has taken all the necessary steps to comply with accidental release prevention requirements set out under 40 CFR Part 68 of the RMP regulations.  The NGL extraction and storage processes at MarkWest are subject"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024080,
      "SummaryText": "to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.\r\n\r\nThe following briefly describes the elements of the release prevention program in place at the MarkWest Langley facility.\r\n\r\nProcess Safety Information\r\n\r\nMarkWest maintains a detailed record of written safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all processes.\r\n\r\nProcess Hazard Analysis\r\n\r\nMarkWest conducts comprehensive studies to ensure that the hazards associated with the processes at the facility are identified and controlled efficiently.  The HAZOP methodology is used to carry out these analyses.  The studies are undertaken by a team of qualified personnel in engineering and process operations and are revalidated at regular intervals.  Any findings related to the hazard analyses are addressed in a timely manner.\r\n\r\nOperating Procedures\r\n\r\nFor the purpose of safely conducting activities within covered processes, MarkWest maintains written operating procedures.  These procedures address various modes of operation such as initial start up, normal operations, temporary operations, emergency shutdown, normal shutdown, and startup after turn around.  The information is regularly reviewed and is readily accessible to operators involved with the process.\r\n\r\nTraining\r\n\r\nMarkWest has a comprehensive training program in place to ensure that the employees operating processes are completely competent in the operating procedures associated with the processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided as needed.\r\n\r\nMechanical Integrity\r\n\r\nThe integrity of mechanical operations at MarkWest is ensured through documented maintenance checks on process equipment.  Process equipment examined by these checks include among others: pressurized storage"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000024080,
      "SummaryText": "vessels, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\n\r\nWritten procedures are in place at MarkWest to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel, or any other employees whose job tasks are affected by a modification in process conditions are promptly made aware of and are trained on the specifics of the modification.\r\n\r\nPre-Startup Reviews\r\n\r\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted as required.  These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\n\r\nMarkWest conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out every three years as required by RMP regulations (40 CFR 68.58) and any corrections required as a result of the audits are undertaken in a safe and timely manner.\r\n\r\n\r\nIncident Investigation\r\n\r\nMarkWest investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident, as well as any corrective actions needed to prevent the release from reoccurring.  All reports are retained for a period of five years.\r\n\r\nEmployee Participation\r\n\r\nMarkWest believes that successful RMP, PSM and accident prevention programs require a team effort.  Company employees are encouraged to expre"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000024080,
      "SummaryText": "ss their views concerning accident prevention issues and to recommend improvements.  In addition, MarkWest employees have access to all information created as part of the facility¿s implementation of the RMP program, in particular, information relating to and resulting from process hazard analyses. \r\n\r\nContractors\r\n\r\nPeriodically, MarkWest hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of the safety performance of the contractor is undertaken.  MarkWest has a strict policy of informing contractors of known potential hazards relating to the contractor's work and the associated processes.  Contractors are also informed of all procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\n5.\tFive Year Accident History\r\n\r\nMarkWest has had an excellent record of preventing accidental releases over the last five years.  Due to stringent release prevention policies, there have been no accidental releases during this period.\r\n\r\n6.\tEmergency Action Plan\r\n\r\nA written emergency action plan to deal with accidental releases of regulated substances is retained at the MarkWest facility.  The plan includes all aspects of emergency response including medical treatment, evacuations, and notification of local emergency response agencies and the public.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within processes that would require a modified emergency response.\r\n\r\nMarkWest has fully coordinated this RMP and our emergency response plan with the Floyd County local emergency response committee (LEPC).\r\n\r\n7.\tPlanned Changes to Improve Safety  \r\n\r\nMarkWest will continue to monitor the implementation of the RMP program at the Langley facility to ensure that accidental release of Y-Grade does not occur.  To date, no operat"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000024080,
      "SummaryText": "ional changes have been identified or deemed necessary to improve safety at the facility.\r\n\r\n8.\tConclusion\r\n\r\nMarkWest has taken all necessary measures required by EPA and OSHA regulations to ensure the continued safe operations of the MarkWest - Langley facility.  The Risk Management Plan provided herein summarizes the active release prevention program that is currently in place at the facility.  This risk management program illustrates MarkWest's commitment to employee, public, and environmental safety.  In the unforeseeable event that a release does occur, MarkWest's emergency action plan combined with the assistance of the Floyd County LEPC provide assurance that such an event will be successfully and safely mitigated. \r\n\r\nDocumentation of Calculations for January 2012 Revision\r\n\r\nTanks Included in the Plan:\r\nThe tanks included in the RMP are 7 - 30,000 gallon y-grade storage tanks and an additional four y-grade storage tanks with a total capacity of 27,000.  A total of 237,000 gallons of storage is included; however, as noted below the capacity are administratively limited to 85% of the capacity of any one vessel for maximum total of 201,450 gallons on site.\r\n\r\nDetermination of Quantities:\r\nThe following factors were used to determine the amount of regulated material stored on the site:\r\n-\tTanks will not be filled above 85% of capacity.\r\n-\tY-grade is a mixture of ethane, propane, butane, pentane and natural gasoline\r\n-\tThe mixture has a density of 4.422 lb/gallon and has the following weight percentage distribution based on analysis on January 4, 2012\r\no\tC2 - 3.2738\r\no\tC3 - 59.6132\r\no\tIC4 - 5.5206\r\no\tNC4 - 19.2567\r\no\tIC5 - 3.2089\r\no\tIC5 - 4.2944\r\no\tC6+ - 4.8278 - not regulated under RMP\r\n-\tEach tank is assumed to be at the maximum operating capacity\r\n-\tTransfer hose will leak at a rate of 200 gal/min. for a total of 5 minutes\r\n\r\nDetermination of Worst-Case and Alternative-Case Scenarios:\r\nA 30,000 gallon y-grade tank rupturing was considered the worst-case scen"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000024080,
      "SummaryText": "ario because it is a) the largest volume tank, b) has the largest quantity of flammable materials and thus the largest off-site consequence analysis using the overpressure model for flammables.  A total weight from one tank would be 30,000 gal x 85% x 4.422 lb/gal = 112,761 lb\r\nThe alternative case scenario is a transfer hose rupturing to lose flow for a period of up to five minutes (very conservative assumption) to completely shut off the flow from hose transfer.  The total weight of liquids from a rupture event would be 1,000 gal x 4.422 lb/gal =4,422 lb\r\n\r\nEthane Calculation:\r\nTank rupture total:   112,761 lbs x 3.2738% = 3,692 lbs\r\nHose rupture total : 4,422 lbs x 3.2738% = 145 lbs\r\nPropane Calculation:\r\nTank rupture total:   112,761 lbs x 59.6132% = 67,220 lbs\r\nHose rupture total : 4,422 lbs x 59.6132% = 2,636 lbs\r\nButane Calculation\r\nTank rupture total:   112,761 lbs x 5.5206% = 6,225 lbs\r\nHose rupture total : 4,422 lbs x 5.5206% = 244 lbs\r\nIsobutane Calculation\r\nTank rupture total:   112,761 lbs x 19.2567% = 21,714 lbs\r\nHose rupture total : 4,422 lbs x 19.2567% = 851 lbs\r\nPentane Calculation\r\nTank rupture total:   112,761 lbs x 3.2089% = 3,618 lbs\r\nHose rupture total : 4,422 lbs x 3.2089% = 142 lbs\r\nIsopentane Calculation\r\nTank rupture total:   112,761 lbs x 4.2944% = 4,842 lbs\r\nHose rupture total : 4,422 lbs x 4.2944% = 190 lbs\r\n\r\nRMP*COMP Worst Case Analysis\r\n\r\nRMP*Comp Ver. 1.07\r\nResults of Consequence Analysis\r\n\r\nCHEMICAL NAME                              CAS #   WEIGHT (lbs)\r\nButane                                     106-97-8    6200\r\nEthane                                     74-84-0     3700\r\nIsobutane [Propane, 2-methyl]              75-28-5    22000\r\nIsopentane [Butane, 2-methyl-]             78-78-4     4800\r\nPentane                                    109-66-0    3600\r\nPropane                                    74-98-6    67000\r\n\r\nCategory: Flammable\r\nScenario: Worst-case\r\nRelease Type: Vapor Cloud Explosion\r\nEstimated Distance to 1 psi overpressur"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000024080,
      "SummaryText": "e: .4 miles (.6 kilometers)\r\n\r\nRMP*COMP Alternative Case Analysis\r\nRMP*Comp Ver. 1.07\r\nResults of Consequence Analysis\r\n\r\nCHEMICAL NAME                              CAS #   WEIGHT (lbs)\r\nButane                                     106-97-8    240\r\nEthane                                     74-84-0     140\r\nIsobutane [Propane, 2-methyl]              75-28-5     850\r\nIsopentane [Butane, 2-methyl-]             78-78-4     190\r\nPentane                                    109-66-0    140\r\nPropane                                    74-98-6    2600\r\n\r\nCategory: Flammable\r\nScenario: Worst-case\r\nRelease Type: Vapor Cloud Explosion\r\nEstimated Distance to 1 psi overpressure: .1 miles (.2 kilometers)"
    }
  ]
}