{
  "FacilityID": 1000054217,
  "FacilityName": "Decatur Utilities Dry Creek Wastewater Plant",
  "FacilityStr1": "902 Wilson Street NW",
  "FacilityStr2": null,
  "FacilityCity": "Decatur",
  "FacilityState": "AL",
  "FacilityZipCode": "35601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01103",
  "LEPC": "Morgan County LEPC",
  "FacilityLatDecDegs": "34.622758",
  "FacilityLongDecDegs": "-86.998085",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 120323696,
  "ParentCompanyName": "City of Decatur",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tom Cleveland",
  "OperatorStr1": "PO Box 2232",
  "OperatorStr2": null,
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35609",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tom Cleveland",
  "RMPTitle": "Water Resources Manager",
  "FTE": 17,
  "OtherEPAFacilityID": "NPDES#AL0048593",
  "EPAFacilityID": "100000050794",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-11-18 00:00:00",
  "SafetyInspectionBy": "Evoqua Water Technologies",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-01-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-12-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-12-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-12-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.62833,
  "FRS_Long": -86.99861,
  "FRS_Description": "LIQUID WASTE TREATMENT UNIT",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000067965,
      "AltID": "Chlorine Process",
      "FacilityID": 1000054217,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000069127,
          "ProcessID": 1000067965,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000083772,
          "ProcessID": 1000067965,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000583772,
          "ProcessID": 1000067965,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000067966,
      "AltID": "Sulfur Dioxide Process",
      "FacilityID": 1000054217,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000069128,
          "ProcessID": 1000067966,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000083773,
          "ProcessID": 1000067966,
          "ChemicalID": 49,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000583773,
          "ProcessID": 1000067966,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000054217,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nPart 68.155 Executive Summary\n\n\n\nThe owner or operator shall provide in the RMP an executive summary that includes a brief description of the following elements:\n\n\n\n*     Accidental release prevention and emergency response policies at the stationary source.\n\n\n\n*     The stationary source and regulated substances handled.\n\n\n\n*     The general accidental release prevention program and chemical-specific prevention steps.\n\n\n\n*     The five-year accident history.\n\n\n\n*     The emergency response program. \n\n\n\n*     Planned changes to improve safety.\n\n\n\n\n\nPart 68.155 Section A\n\n\n\nAccidental Release Prevention and Emergency Response Policies:\n\n\n\nDecatur Utilities (DU) operates the Dry Creek Wastewater Treatment Plant (WWTP) where chlorine is used to disinfect the plant effluent water and sulfur dioxide is used to neutralize the chlorinated water before it is discharged to the Tennessee River.\n\n\n\nDU has in place, mandatory annual chlorine and sulfur dioxide safety training for all employees who work at the WWTP. Additionally, specific training is required in all aspects of the operation of the chlorine and sulfur dioxide process for those who operate the processes. Training in maintenance and repair of the chlorine and sulfur dioxide process equipment is conducted with all employees who are required to maintain and repair any part of the system.\n\n\n\nDecatur Utilities has developed a chlorine and sulfur dioxide Emergency Response Program to fulfill the requirements of OSHA Part 1910.38. The Emergency Response Program is coordinated with the local and state emergency response plan.\n\n\n\n\n\nPart 68.155 Section B\n\n\n\nStationary Source and Regulated Substances Handled \n\n\n\nThe Dry Creek Wastewater Treatment Plant has one stationary source capable of holding 12 one ton containers of chlorine as well as one stationary source capable of holding 8 one ton containers of sulfur dioxide. The covered processes consist of piping (per the Chlorine Institute Pamphlet 6, Pipin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000054217,
      "SummaryText": "g Systems for Dry Chlorine) and chlorine and sulfur dioxide injection equipment specifically designed for each process.\n\n\n\n\n\nPart 68.155 Section D\n\n\n\nPrevention Program Elements\n\n\n\nManagement System\n\n\n\nDecatur Utilities has documented a management system and has assigned overall responsibility for development and implementation of the Risk Management Plan to the Risk Management Plan Manager. The management system clearly delineates accountability and responsibility of specific elements of the program to the appropriate Risk Management Plan Team Member.\n\n\n\n\n\nProcess Safety Information\n\n\n\nCurrent process safety information is available to all operators of the covered processes and maintenance employees in accordance with CFR 40 Part 68.48. Safety information includes current MSDS sheets, maximum intended inventory, safe upper and lower temperatures, pressures, and flows, process equipment and material specifications, safe operating procedures and codes and standards used in the design and construction of the process.\n\n\n\nProcess Hazard Analysis\n\n\n\nA Hazard Analysis has been performed for the Program II covered processes. A checklist was used from Exhbits F-26, F-27, and F-28 of the EPA Supplemental Risk Management Program for Wastewater Treatment Plants.  Causes of potential accidental release scenarios were investigated and safeguards put in place to prevent a release.  The process hazard analysis was documented and is updated every five-years.\n\n\n\n\n\nOperating Procedures\n\n\n\nProcess operating procedures were reviewed, documented, and refresher training conducted with all plant operators and maintenance employees.  Operating procedures cover all phases of process operations including system startup, temporary operations, emergency shutdown, normal shutdown, and startup following an emergency shutdown. Process limits were reviewed and documented. \n\n\n\nTraining\n\n\n\nChlorine and sulfur dioxide safety training is performed at least once every 3 years. CPR training is mandatory"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000054217,
      "SummaryText": " for all plant employees and is conducted every two years. First aid training is also mandatory for all plant employees and is conducted at least once every 3 years. Other mandatory training is conducted at least once every 3 years for all operators and maintenance employees and includes emergency first aid for chlorine and sulfur dioxide exposures, process safe upper and lower limits, Emergency Response Plan, operating procedures, and safe loading/unloading of ton containers. Training for all maintenance employees is conducted once every 3 years and covers process and chlorinator and sulfonator maintenance and repair, and chlorine and sulfur dioxide piping specifications.  Documentation of employee attendance at all training sessions is maintained for a period of not less than 5 years.\n\n\n\nMechanical Integrity\n\n\n\nAll process equipment, piping, ventilation system, monorail and hoist, have a documented schedule of inspection, and preventive and periodic maintenance.  All maintenance inspection and testing on chlorine and sulfur dioxide process equipment is conducted as per manufacturer's recommendations and is consistent with accepted engineering practices. Any deficiencies identified during such maintenance and inspection are addressed in a safe and prompt manner. \n\n\n\n\n\nPart 68.58\n\n\n\nCompliance Audits\n\n\n\nCompliance audits are conducted every 3 years by at least one person knowledgeable in the process. A report of the audit findings is generated following the audit and all deficiencies or recommendations are promptly addressed and the resolution is documented.  The two most recent audits are maintained at the facility.\n\n\n\n\n\nPart 68.60\n\n\n\nIncident Investigation\n\n\n\nSpecific incident investigation reporting and documentation procedures have been implemented and are followed in accordance with this part in response to any incident involving a covered process that did or could have reasonably resulted in a catastrophic release of chlorine and sulfur dioxide gas. The incide"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000054217,
      "SummaryText": "nt investigation is conducted as soon as possible but no later than 48 hours following the incident. Following the investigation a summary report is generated and includes, at a minimum, the following information: date of incident, date the investigation began, description of the incident and any contributing factors, and any corrective action or recommendations resulting from the investigation.\n\n\n\n\n\nPart 68.155 Section E\n\n\n\nFive-year Accident History\n\n\n\nAn accidental release is defined in part 68.42 Section A as having resulted in deaths, injuries or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. Decatur Utilities has had no accidental release within the past five years.  \n\n\n\n\n\nPart 68.155 Section F\n\n\n\nEmergency Response Program\n\n\n\nDecatur Utilities has in place an Emergency Response Program that is coordinated with both state and local emergency response plans, (LEPC). Additionally, a specific plan has been developed for chlorine and sulfur dioxide emergencies following OSHA Standard 1910.38.  The plan is reviewed and training is conducted with all plant operators and maintenance employees at least every 3 years.  The plan includes comprehensive procedures for on-site emergencies and is designed to coordinate with the state and local emergency response plan.  \n\n\n\n\n\nPart 68.155 Section G\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nNo changes are planned to improve safety."
    }
  ]
}