{
  "FacilityID": 1000083482,
  "FacilityName": "River Island Fresh Cold Storage",
  "FacilityStr1": "200 N. Uruapan Drive",
  "FacilityStr2": null,
  "FacilityCity": "Dinuba",
  "FacilityState": "CA",
  "FacilityZipCode": "93618",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "36.540542",
  "FacilityLongDecDegs": "-119.393533",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "River Island Fresh Cold Storage",
  "OperatorStr1": "200 N. Uruapan Drive",
  "OperatorStr2": null,
  "OperatorCity": "Dinuba",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93618",
  "OperatorZipCodeExt": null,
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000227916",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-09-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-11-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-11-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-11-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-12-11 00:00:00",
  "DeRegistrationEffectiveDate": "2020-11-18 00:00:00",
  "AnniversaryDate": "2024-11-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 36.540542,
  "FRS_Long": -119.393533,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Sold Facility. River Island is no longer responsible for the Process",
  "_processes": [
    {
      "ProcessID": 1000104334,
      "AltID": "North System",
      "FacilityID": 1000083482,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000130657,
          "ProcessID": 1000104334,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000105667,
          "ProcessID": 1000104334,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000088302,
              "Process_NAICS_ID": 1000105667,
              "SafetyReviewDate": "2019-10-23 00:00:00",
              "PHA_Date": "2019-10-23 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-10-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-03-08 00:00:00",
              "TrainingReviewDate": "2019-11-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-11-04 00:00:00",
              "EquipmentInspectionDate": "2019-09-05 00:00:00",
              "EquipmentTested": "Alarm Call Out (Dialer) Test",
              "ChangeMgmtDate": "2018-05-31 00:00:00",
              "ChangeMgmtReviewDate": "2019-11-04 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2017-08-29 00:00:00",
              "AuditCompletionDate": "2019-02-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-11-04 00:00:00",
              "HotWorkPermitReviewDate": "2019-11-04 00:00:00",
              "ContractorSafetyReviewDate": "2018-12-10 00:00:00",
              "ContractorSafetyEvalDate": "2019-11-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000110041,
                  "PreventionProgram3ID": 1000088302,
                  "ProcessChemicalID": 1000130657
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000083482,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Tulare County Environmental Health",
    "CoordinatingAgencyPhone": "5596247400",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083482,
      "SummaryText": "frigerant absorbs a great deal of heat from the surrounding area and evaporates. To increase the rate of heat removed, the evaporator uses an electric fan to move warm air over the coils of cold liquid ammonia. Once the liquid has evaporated to form low temperature and pressure vapor, it travels back to the accumulators, through a suction return line, and into the main suction accumulator for Process 2. In Process 2, any remaining liquid falls to the bottom of the vessel and is fed by gravity into the transfer vessel. Inside the transfer vessel, the liquid rises in temperature and is returned to the high pressure receiver as high pressure liquid. From the main suction accumulator or header, the remaining low pressure vapor is piped to the suction inlet on the reciprocating/screw compressors.\r\n\r\nThe compressors compress the low pressure vapor, and it exits through the discharge outlet as a high pressure and high temperature vapor. The vapor is then sent to an evaporative condenser where it is cooled and liquefied. The condenser uses air and water to cool the warm ammonia as it passes through a series of tubes within the condenser. As the cooling medium of air and water draws the heat from the vapor, the refrigerant condenses into a liquid and flows to the high pressure receiver. The receiver serves as a holding tank for the liquid refrigerant being fed to the low side, and holds the bulk of the refrigerant in the system when it is not operating.\r\n\r\nSafety Systems\r\n \r\nThe ammonia detection system was installed in accordance with ANSI/ASHRAE 15, ANSI/IIAR 2 and the Uniform Mechanical Code at the time of construction. If ammonia is detected in the cold rooms at concentrations above the alarm level of 25 ppm an audible alarm sounds. If ammonia is detected in the Machinery Room in concentrations above the alarm level of 50 ppm, an audible alarm sounds until it is manually reset.\r\n\r\nThe machinery rooms are equipped with a roof/wall-mounted ventilation fan. The P2 North ven"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083482,
      "SummaryText": "1. Executive Summary\r\n\r\nThis program is intended to meet the spirit and intent of the following regulations:\r\n- California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\r\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR §68\r\n- California Process Safety Management (PSM) Program, Title 8 CCR §5189\r\n- Federal Process Safety Management (PSM) Program, Title 29 CFR §1910.119\r\n\r\nHereafter this program will be referred to as the RMP-PSM program.\r\n\r\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, River Island Fresh has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \r\n\r\n1.1 River Island Fresh, Risk and Process Safety Management Program\r\n\r\nThis is to inform all interested persons, including employees, that River Island Fresh has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following processes which have the presence of hazardous chemicals above threshold quantities: \r\n\r\nProcess Name               |   Process Chemical     |   Process Quantity(lbs.)\r\nNorth System Refrigeration |   Anhydrous Ammonia    |   12,000\r\n\r\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses and physical property damage.\r\n\r\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \r\n1. Prepared a unified program based on the PSM plan to meet CalARP and RM"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083482,
      "SummaryText": "P obligations as well\r\n2. Organized the program so that it meshes closely with general business practices\r\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\r\n\r\nThe RMP-PSM program sets forth rules, procedures and practices that will help our employees and neighbors protect themselves.\r\n\r\n1.2 Process Descriptions\r\n\r\nFacility Layout\r\n\r\nRiver Island Fresh Cold Storage operates a commercial cold storage facility for tree fruits and grapes in Dinuba, CA. The facility has two (2) ammonia refrigeration systems (P1 South System and P2 North System) that provides refrigeration capacity to the following:\r\n(5) Cold Storage Rooms\r\n(1) Precool Room\r\n\r\nRefrigeration System Equipment\r\n\r\nThe refrigerated spaces are equipped with air-cooling evaporators and accumulators, as required for flooded operation.\r\n\r\nP2 Machinery Room\r\n(3) Reciprocating compressors\r\n(1) Screw compressors\r\n(4) Oil separators\r\n(2) Shell and tube oil coolers\r\n(1) Plate and frame oil cooler\r\n(1) High pressure receiver\r\n(1) Liquid transfer vessel\r\n(1) Main suction accumulator\r\n\r\nCondenser Area\r\n(2) Evaporative condensers\r\n\r\nPrecool\r\n(2) Accumulator\r\n(6) Air-cooling evaporators (bunker-mounted, spiral fin)\r\n\r\nRoom 4\r\n(1) Accumulator\r\n(3) Air-cooling evaporators (bunker-mounted, spiral fin)\r\n\r\nRoom 5\r\n(1) Accumulator\r\n(3) Air-cooling evaporators (bunker-mounted, spiral fin)\r\n\r\nProcess Chemistry\r\n\r\nThe refrigeration systems employed at River Island Fresh Cold Storage is a flooded system. Each accumulator is equipped with an expansion valve which expands the high pressure liquid into a low temperature and pressure liquid as it enters the accumulator. Each accumulator feeds two/three bunker mounted evaporator coils located in the Precoolers and Storage Rooms. The evaporators contain a set of continuous coils through which the low pressure liquid flows. Due to the low pressures and temperatures maintained in the evaporator, the liquid re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000083482,
      "SummaryText": "tilation fan is activated by an ON/OFF single-pole, single-throw switch inside the electrical and machinery room. Additionally, the P2 North System ventilation fan serves to control the temperature within the machinery room via a wall-mounted thermostat. \r\n\r\nEach Emergency Control Box (ECB) was installed in accordance with the Fire Code at the time of construction. The ECB is installed on the east wall of the machinery room and contains three (3) valves.\r\nValve #1: High Side Discharge Valve\r\nValve #2: Low Side Discharge Valve\r\nValve #3: High to Low Pressure Control Valve\r\nOpening Valve #1 will evacuate the process through the high pressure side of the system. Opening Valve #2 will evacuate the process through the low pressure side of the system. Opening Valve #3 will equalize the high and low pressure portions of the system. \r\n\r\nThe Emergency Control Box is seldom used in a refrigeration system, but has been installed for rare emergency situations.\r\n\r\nEach screw compressor has numerous safety devices to protect the compressor and the associated equipment.\r\n\r\nEach reciprocating compressor has numerous safety devices to protect the compressor and the associated equipment.\r\n\r\nAll ASME pressure vessels and positive displacement compressors are equipped with pressure relief valves designed to relieve pressure and protect the equipment from rupturing. The relief valves on the high side of each system relieve at 250 psig while the low side of each system relieves at 150 psig. All pressure relief valves are vented to atmosphere.\r\n\r\nThe main suction accumulator is equipped with a high level float switch that is wired to shut down the compressors in the event of a high level situation. This prevents liquid ammonia from entering the compressors.\r\n\r\n1.3 General Accident Release & Chemical Specific Prevention Steps\r\n\r\n1.3.1 General \r\n\r\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. Dur"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000083482,
      "SummaryText": "ing these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\r\n\r\nRiver Island Fresh has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \r\n\r\n1.3.2 Anhydrous Ammonia\r\n\r\nThe ammonia refrigeration process at the River Island Fresh facility is an integral part of the overall business and operates most of the year. It is extremely important that this process are maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\r\n\r\nOur refrigeration personnel monitor the ammonia refrigeration process and keep active records of all procedures and transactions that pertain to ammonia. Also, refrigeration contractors assist in performing the annual mechanical integrity inspection of our ammonia equipment.\r\n \r\n1.4 Five Year Accident History\r\n\r\nRiver Island Fresh has had no accidental release within the last five (5) years.\r\n\r\n1.5 Emergency Action and Response Plan\r\nRiver Island Fresh's emergency action and response program has been developed to satisfy the following requirements:\r\n- California \"Emergency Action Plan\" - Title 8 CCR §3220\r\n- Federal \"Emergency Action Plan\" - Title 29 CFR §1910.38\r\n\r\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team.\r\n  \r\n1.6 Planned Changes to Improve Safety\r\n\r\nRiver Island Fresh has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, River Island Fresh continually strives to impro"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000083482,
      "SummaryText": "ve in all areas, including safety.\r\n\r\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved River Island Fresh's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that River Island Fresh's management team can ensure that the RMP-PSM program is being implemented.\r\n\r\nRiver Island Fresh has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\r\n\r\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, River Island Fresh has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\r\n\r\nFor the future, River Island Fresh now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for River Island Fresh employees, but allows for feedback and continual improvement. Through the RMP-PSM program River Island Fresh will continue to maintain overall plant worker and public safety."
    }
  ]
}