{
  "FacilityID": 1000059864,
  "FacilityName": "Rich Products Corporation - Crest Hill Facility",
  "FacilityStr1": "21511 West Division Street",
  "FacilityStr2": null,
  "FacilityCity": "Crest Hill",
  "FacilityState": "IL",
  "FacilityZipCode": "60403",
  "Facility4DigitZipExt": "2020",
  "FacilityCountyFIPS": "17197",
  "LEPC": "Will County LEPC",
  "FacilityLatDecDegs": "41.579288",
  "FacilityLongDecDegs": "-88.137984",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "PF",
  "FacilityURL": "http://www.richs.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Rich Products Corporation",
  "Company2Name": null,
  "CompanyDUNS": 2108371,
  "Company2DUNS": null,
  "OperatorName": "Rich Products Corporation",
  "OperatorStr1": "21511 West Division Street",
  "OperatorStr2": null,
  "OperatorCity": "Crest Hill",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60403",
  "OperatorZipCodeExt": "2020",
  "FTE": 65,
  "OtherEPAFacilityID": "6040WRCHPR21511",
  "EPAFacilityID": "100000222154",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-08-13 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-02-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-10-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-10-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-10-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 41.57815,
  "FRS_Long": -88.13914,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074733,
      "AltID": "Ammonia",
      "FacilityID": 1000059864,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092402,
          "ProcessID": 1000074733,
          "ChemicalID": 56,
          "Quantity": 44200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000075895,
          "ProcessID": 1000074733,
          "NAICSCode": "44511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000062838,
              "Process_NAICS_ID": 1000075895,
              "SafetyReviewDate": "2016-06-10 00:00:00",
              "PHA_Date": "2016-08-23 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-08-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "An additional process line.",
              "OpProceduresReviewDate": "2016-08-22 00:00:00",
              "TrainingReviewDate": "2016-08-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-07-28 00:00:00",
              "EquipmentInspectionDate": "2016-04-21 00:00:00",
              "EquipmentTested": "Vibration Analysis - All Compressors",
              "ChangeMgmtDate": "2016-07-19 00:00:00",
              "ChangeMgmtReviewDate": "2016-07-26 00:00:00",
              "PreStartupReviewDate": "2016-08-25 00:00:00",
              "ComplianceAuditDate": "2016-01-07 00:00:00",
              "AuditCompletionDate": "2017-01-06 00:00:00",
              "IncidentInvestigationDate": "2016-05-26 00:00:00",
              "InvestigationChangeDate": "2016-05-27 00:00:00",
              "ParticipationPlansReviewDate": "2016-05-08 00:00:00",
              "HotWorkPermitReviewDate": "2016-06-03 00:00:00",
              "ContractorSafetyReviewDate": "2016-08-26 00:00:00",
              "ContractorSafetyEvalDate": "2016-05-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000076937,
                  "PreventionProgram3ID": 1000062838,
                  "ProcessChemicalID": 1000092402
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000059864,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lockport City Fire Department",
    "CoordinatingAgencyPhone": "8157291460",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059864,
      "SummaryText": "Rich Products Corporation's (RPC's) Crest Hill, IL location (\"Site\") has developed this program in accordance with the United States Environmental Protection Agency's (USEPA's) Chemical Accident Prevention Provisions (CAPP) of the Clean Air Act, as amended (CAAA), a.k.a., the Risk Management Plan (RMP) rule, which is codified at 40 CFR 68 and the United States Occupational Safety & Health Administration's (OSHA's) Process Safety Management (PSM) of Highly Hazardous Chemicals (HHCs) standard (PSM standard), which is codified at 29 CFR 1910.119. The program is designed to inform all Site employees (hereafter referred to as Associates) of the hazards of ammonia, procedures for the safe use of ammonia, and the steps taken for the safety of Associates in the event of a release or spill (i.e., emergency response plan, management of change procedures, preventative maintenance program, associate training, etc.).\r\n\r\nAdditionally, RPC has developed and implemented the \"Rich Products Corporation Standards for Safety Performance\" which outlines the corporate policy for safety policies, safety procedures, and sample programs to be implemented at each Rich Products Corporation Facility.\r\n\r\nRPC is guided by a set of core values that include:\r\n\r\n¿ Cherish Our Culture - Work, learn and celebrate together;\r\n¿ Innovate - Imagine what's possible and create what's valued;\r\n¿ Be the Trusted First Choice - Listen, understand and deliver for customers like no other company;\r\n¿ Better Our Communities - Devote time and talent where we work and live; and\r\n¿ Do What's Right - No matter what.\r\n\r\nRPC is committed to an irrevocable obligation to act responsibly in every decision made and with every person encountered.  RPC understands it is a trusted steward of its business relationships, its environment and the communities in which it serves.  RPC holds itself to the highest set of standards and is about doing what's right...no matter what.\r\n\r\n\r\nFACILITY DESCRIPTION\r\n\r\nThe Site is located at 215"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059864,
      "SummaryText": "11 West Division Street in the City of Crest Hill, Will County, Illinois and is situated in an industrial park. The Site is located on a 15.451-acre parcel of land that includes an approximately 280,000-square foot structure for office, research and development, manufacturing, maintenance, and warehouse uses. The Site building was originally constructed in 2005/2006 as a spec building. The Site commenced operations in approximately 2013. The Facility normally operates 7 days per week, 24 hours per day.\r\n\r\nThe Site manufactures dough products, pizza crusts, and frozen pizzas, which are frozen for shipment. The Site's North American Industrial Classification System (NAICS) code is 311824 (Frozen Doughs Made From Purchased flour)\r\n\r\nAs part of the Site's refrigeration system, which is used to freeze the dough products, pizza crusts, and frozen pizzas for shipment, the Site handles quantities of anhydrous ammonia, a regulated substance/highly hazardous chemical as defined in the USEPA's RMP Rule and OSHA's PSM standard, in an amount exceeding the regulatory threshold  for anhydrous ammonia in a single process, i.e., the Site's refrigeration system. The Facility is registered to Program Level 3 under the USEPA CAPP program.\r\n\r\nThe anhydrous ammonia, which is liquefied under pressure, is contained in various vessels, accumulators, piping, and heat exchangers throughout the refrigeration system. The Facility's engine room houses the majority of the refrigeration machinery.\r\n\r\n\r\nACCIDENTAL RELEASE PREVENTION\r\n\r\nWhile there are few long-term environmental consequences to ammonia use, it can present health hazards if handled improperly. RPC has developed a comprehensive safety program in compliance with OSHA and EPA requirements to ensure the responsible management of the ammonia onsite (the Process Safety Management and Risk Management Program, respectively). All refrigeration Associates receive operator training, safe work practices training and training on the standard ope"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059864,
      "SummaryText": "rating procedures (SOPs). Safety meetings are conducted to further protect Associates and the community as a whole.\r\n\r\nThe Facility's prevention program is designed to inform all Associates of the hazards of ammonia, procedures for the safe use of ammonia, and the steps taken for the safety of Associates and the community in the event of a release or spill. \r\n\r\nThe Facility endeavors to eliminate accidents and health hazards to Associates, customers, and the community by having procedures in place to provide Associates educational training, safe working conditions, and the means to increase awareness of potential dangers both on and off the job. RPC's objective is to prevent unwanted releases of ammonia into locations that could potentially expose Associates and others to serious hazards. An effective program requires a systematic approach to evaluating the entire system. Workplace and process safety are major concerns to management and Associates alike. The prevention and mitigation of unwanted releases of ammonia into locations that could expose Associates and the community to serious hazards is of primary concern.\r\n\r\nThe Facility has incorporated many safety features in the design of the ammonia refrigeration system to prevent system failures and to mitigate potential releases. The predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion. The Facility's ammonia system is continuously monitored by automated control systems that shutdown pump and the components if deviations from normal operating conditions occur. Further, the system is equipped with pressure relief valves on all pressure vessels and most, if not all, additional locations within the ammonia system where ammonia could become trapped.\r\n\r\nRPC considers the health and safety of each Associate as its most important responsibility. It is our policy to provide a healthy and safe work env"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000059864,
      "SummaryText": "ironment. This facility follows operating practices that safeguard all associates and result in safe working conditions while maintaining efficient operations.\r\n\r\nSafety is the responsibility of all Associates. Each associate is expected to comply with the requirements of RPC's Standards for Safety Performance. Management is responsible for the implementation, communication, documentation, and necessary training. The Associate is responsible for implementation, communication, and practices of the program. Management is committed to maintain a high level of interest in health and safety throughout this facility. This commitment extends to the associates and their involvement in preventing accidents.\r\n\r\nRPC has established its Health and Safety Program to insure that:\r\n\r\n¿ Associates work in a healthy and safe environment.\r\n¿ Associates are trained on safe work practices.\r\n¿ Associates practice safe work habits.\r\n¿ Management and associates are both involved in the program.\r\n¿ There is constant communication between all Associates on safety issues.\r\n¿ Compliance with all regulatory agencies is maintained.\r\n\r\nMajor safety features at the Facility include:\r\n\r\n¿ Installation of ammonia leak detectors in processing areas and the engine room\r\n¿ Remote emergency shutdown switches for the refrigeration system\r\n¿ Fire sprinklers throughout the Facility, and\r\n¿ Component specific safety shutdowns of the refrigeration system.\r\n\r\nIn determining the worst case release scenario, from time to time, in order to conduct maintenance activities, Site Associates pumpout sections of the refrigeration system into the largest vessel. Subsequently, the Site has utilized the maximum amount the vessel would be filled to, during maintenance activities, rather than the amount normally present.\r\n\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nSince operations commenced in July 2013, there have been no accidental releases.\r\n\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe Facility is equipped with an emergency warning sy"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000059864,
      "SummaryText": "stem. Alarms are placed throughout the Facility to alarm personnel of an emergency relating to the accidental release of ammonia or other emergencies that may be encountered. RPC has developed specific procedures to be followed in the event of release. These procedures include evacuation of personnel, notification of authorities and actions to be taken to stop or mitigate the emergency if it is safe to do so.\r\n\r\nPlant personnel have received emergency response training as outlined in OSHA's HAZWOPER regulation 29 CFR 1910.120 and other various rules and regulations.\r\n\r\nThe Lockport Fire Department has visited the facility to review the process operations, safety systems and discuss emergency response coordination.  Additionally, Site Associates have made arrangements with a third-party emergency response contractor.\r\n\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Facility recognizes that the implementation of this program is a continuous process for evaluating, monitoring and improving anhydrous ammonia handling operation at the Facility. As such, the prevention program will evolve as RPC continues their ongoing focus and dedication of risk minimization and safety improvement for the employees and the surrounding community."
    }
  ]
}