{
  "FacilityID": 1000061483,
  "FacilityName": "Kiva Energy- LP Terminal, LLC Rocklin",
  "FacilityStr1": "1545 Nichols Drive",
  "FacilityStr2": null,
  "FacilityCity": "Rocklin",
  "FacilityState": "CA",
  "FacilityZipCode": "95765",
  "Facility4DigitZipExt": "1306",
  "FacilityCountyFIPS": "06061",
  "LEPC": "Placer County Emergency Svcs",
  "FacilityLatDecDegs": "38.810528",
  "FacilityLongDecDegs": "-121.3160",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.kivaenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Kiva Energy- LP Terminal, LLC Rocklin",
  "Company2Name": null,
  "CompanyDUNS": 62457304,
  "Company2DUNS": null,
  "OperatorName": "Kiva Energy",
  "OperatorStr1": "1262 Dupont Court",
  "OperatorStr2": null,
  "OperatorCity": "Manteca",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95336",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165974",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-05-17 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-12-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-12-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-12-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-12-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 38.81067,
  "FRS_Long": -121.31558,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000076904,
      "AltID": "Propane terminal storage",
      "FacilityID": 1000061483,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000095499,
          "ProcessID": 1000076904,
          "ChemicalID": 98,
          "Quantity": 5000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000078086,
          "ProcessID": 1000076904,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000064650,
              "Process_NAICS_ID": 1000078086,
              "SafetyReviewDate": "2016-08-24 00:00:00",
              "PHA_Date": "2013-06-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-08-12 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Low Pressure Shutdown on Transfer Pumps",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Operator survellieance and truck loader attendance during product transfer operations; Automatic notification of fire department upon activation of terminal deluge system.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-09-01 00:00:00",
              "TrainingReviewDate": "2013-02-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training (CBT); Safety meetings",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-02-12 00:00:00",
              "EquipmentInspectionDate": "2013-02-10 00:00:00",
              "EquipmentTested": "Truck Delivery Meter",
              "ChangeMgmtDate": "2012-08-15 00:00:00",
              "ChangeMgmtReviewDate": "2013-03-01 00:00:00",
              "PreStartupReviewDate": "2012-11-30 00:00:00",
              "ComplianceAuditDate": "2011-01-26 00:00:00",
              "AuditCompletionDate": "2012-09-12 00:00:00",
              "IncidentInvestigationDate": "2001-02-26 00:00:00",
              "InvestigationChangeDate": "2001-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2012-05-17 00:00:00",
              "HotWorkPermitReviewDate": "2012-05-17 00:00:00",
              "ContractorSafetyReviewDate": "2012-07-26 00:00:00",
              "ContractorSafetyEvalDate": "2012-05-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000079723,
                  "PreventionProgram3ID": 1000064650,
                  "ProcessChemicalID": 1000095499
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000061483,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Placer County OES",
    "CoordinatingAgencyPhone": "5308865300",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061483,
      "SummaryText": "Rocklin LPG Terminal\r\nKiva Energy, LP Terminal, LLC\r\nExecutive Summary\r\nRisk Management Plan\r\nEPA Identifier:  1000 0016 5974\r\n\r\n\r\nAccidental Release Prevention and Response\r\n\r\nThe Rocklin LPG Terminal has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of the facility's processes.  It is the practice of Kiva Energy, LP Terminal LLC to implement reasonable controls to prevent foreseeable releases of substances.  However, if a release does occur, trained personnel will respond to, control and contain the release.\r\n\r\nDescription of the Stationary Source and Regulated Substances\r\n\r\nThe Rocklin Propane terminal located in Washoe County, Nevada is owned by Kiva Energy, LP Terminal, LLC and its partners.\r\n\r\nThe Rocklin Propane terminal facility is a bulk hydrocarbon storage and handling facility.  The facility receives odorized propane LPG by rail car and stores the liquid in one of three above ground pressurized storage tanks.   A propane vapor compressor is used to provide pressurized vapors into the vapor space for the unloading of rail cars spotted on the facility rail siding.  The same compressor is subsequently used to remove vapors from the empty cars prior to their disconnection from the tank fill piping and railcar unloading racks.  Odorized propane stored in the three above-ground propane storage bullets is transferred to 18-wheel or smaller bobtail propane delivery trucks through the use of a small liquid propane pump.  The terminal operator is responsible for the hookup, unloading and disconnection of supply rail cars.  The operator also assists with the proper loading of transport trucks that fill up at the terminal, and with coordinating the removal of empty rail cars and the delivery of full cars as the propane transfer demand requires.\r\n\r\nThe Rocklin Propane Termi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061483,
      "SummaryText": "nal facility was evaluated to determine if any regulated flammable or toxic substances exceeded the threshold quantity.  Kiva Energy identified the regulated substances and quantities kept on site based on the known volumes of the storage tanks and supply rail cars.  The only listed flammable substance which is stored above the threshold quantity at the Rocklin Propane Terminal facility is odorized propane.  The propane terminal facility is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standard and is classified as a Program Level 1 site under the EPA RMP program.  \r\n\r\nToxics\r\n\r\nNo toxic materials to report.\r\n\r\n Offsite Consequence Analysis Results\r\n\r\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.  \r\n\r\nGeneral Accident Release Prevention Program\r\n\r\nThe following is a summary of the accident prevention program in place at the Rocklin LPG Terminal.  The processes at the plant are regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation (Program 1), and are also subject to the OSHA's PSM Standard.  This summary addresses each of the PSM program elements and describes the management system in place to implement the accident prevention program which is required only by the facility OSHA PSM regulation coverage.\r\n\r\nEmployee Participation\r\n\r\nKiva Energy strongly promotes employee involvement in safety issues through existing programs.  These programs include regularly scheduled safety meeting, tail-gate safety meetings, and hazard communications. \r\n\r\nKiva Energy actively seeks employee involvement in the development and conduct of all accident prevention activities through the appropriate existing safety programs.  Employees are encouraged to discuss accident prevention with their supervisors and to bring any"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061483,
      "SummaryText": "questions, comments or suggestions forward for open discussion.\r\n\r\nProcess Safety Information\r\n\r\nKiva Energy keeps a variety of technical documents that are used to help maintain a safe operating process.  These documents address chemical properties.  Chemical specific information, including exposure hazards and emergency response/ exposure treatment considerations is provided in material safety data sheets (MSDS).\r\n\r\nKiva Energy also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure ratings, temperature ratings and electrical rating of equipment.  \r\n\r\nProcess Hazard Analysis (PHA)\r\n\r\nKiva Energy primarily uses the hazard and operability (HAZOP) and Checklist method analysis technique to perform these evaluations.  The plant operator and operations management identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes recommendations for additional prevention and/or mitigation measures when the team believes such measures are necessary.\r\n\r\nOperating Procedures\r\n\r\nThe Rocklin LPG Terminal maintains written procedures that address various modes of process operations such as; (1) start-up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown and (6) initial startup of a new process.  These procedures provide guidance for experienced operators and also provide the basis for training new operators.  Operating procedures include applicable safety precautions that must be taken in the operation of the facility.  The procedures are periodically reviewed and annually certified as current and accurate.  The review and certification process involves both operators and technical staff.\r\n\r\n\r\n\r\nTraining\r\n\r\nIn addition to training on operating procedures, the Rocklin LPG Terminal has a comprehensive training program for all employees involved"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061483,
      "SummaryText": "in operating the process.  New employees receive basic training in gas plant operations and safe work practices.  All operators receive refresher training on the operating procedures at least every three years to ensure that their skills and knowledge are maintained at an acceptable level.  \r\n\r\nContractors\r\n\r\nThe Rocklin LPG Terminal uses contractors during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the plant has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have appropriate knowledge and skills, (3) are aware of the hazards of their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site specific safety rules and (6) inform plant personnel of any hazards that they find while performing their work.  This is accomplished by providing contractors with an orientation session that covers (1) a process overview, (2) information about the safety and health hazards, (3) emergency response plan requirements and (4) safe work practices prior to beginning their work\r\n\r\nPre-Startup Safety Review (PSSR)\r\n\r\nThe Rocklin LPG Terminal conducts a PSSR prior to the startup of all new facilities or any modification that requires a change in process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment into service.  \r\n\r\nMechanical Integrity\r\n\r\nThe Rocklin LPG Terminal has well established practices and procedures for maintaining process equipment.  The basic aspects of this program include (1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting equipment deficiencies. In combination, these activities form a system that maintains the mechanical integrity of the process.\r\n\r\n\r\nSafe Work Practices\r\n\r\nThe Rocklin LPG Terminal has safe work p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000061483,
      "SummaryText": "ractices in place to help ensure worker and process safety.  Examples of these include: (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark-producing activities. These procedures, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely\r\n\r\nManagement of Change\r\n\r\nThis system requires that changes to items such as process equipment, technology, procedures and other facility changes be properly reviewed and authorized before being implemented to ensure that the safety of the facility is not compromised by the change.  Operating and maintenance personnel are provided any necessary training on any changes as part of the change management process.\r\n\r\nIncident Investigation\r\n\r\nThe Rocklin LPG Terminal promptly investigates all incidents that resulted in or reasonably could have resulted in, a fire/explosion, major property damage, environmental loss, or personal injury.  The investigation team documents its findings, develops recommendation(s) to prevent a reoccurrence and forwards these results to the business management team for resolution.\r\n\r\nCompliance Audits\r\n\r\nCompliance audits will be conducted at least every three years.  Both hourly and staff personnel participate as audit team members.  The audit team develops findings that are forwarded to operations or facility management for resolution.  \r\n\r\n\r\n\r\n\r\n\r\nChemical Specific Prevention Steps\r\n\r\nThe processes at the Rocklin LPG Terminal have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\r\n\r\nUniversal Prevention Activi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000061483,
      "SummaryText": "ties\r\n\r\nThe accident prevention program summarized previously is applied to all RMP covered processes at the Rocklin LPG Terminal.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\r\n\r\nSpecialized Safety Features\r\n\r\nThe Rocklin LPG Terminal has safety features on many units to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\r\n \r\n\r\nRelease Detection\r\n\r\n* Hydrocarbon (hazardous gas) detectors and alarms\r\n\r\nRelease Containment and Control\r\n\r\n* Valves to permit isolation of the process (manual or automated).\r\n* Automatic shutdown systems for specific process parameters (e.g., excess flow valves).\r\n* Terminal emergency shutdown system (ESD).\r\n* Redundant equipment and instrumentation where advisable\r\n* Atmospheric relief devices \r\n\r\n\r\nRelease Mitigation\r\n\r\n* Hand-held and wheeled cart fire extinguishers \r\n* Personnel trained in emergency response and procedures.\r\n* Personnel protective equipment (e.g., chemical protective clothing, self-contained breathing apparatus, etc.)\r\n\r\nFive Year Accident History\r\n\r\nOver the past five years there have been no large or small releases which resulted in any injuries, property damage or offsite consequences.  \r\n\r\nEmergency Procedures Information\r\n\r\nThe Rocklin LPG Terminal maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the plant facilities.  \r\n\r\nThe overall emergency procedure program for the Rockl"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000061483,
      "SummaryText": "in LPG Terminal is coordinated with the Placer County Emergency Management Program.  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials and industry representatives.  The Rocklin LPG Terminal has around-the-clock communications capability with appropriate Emergency Management Program officials and emergency response organizations (e.g., Rocklin Fire Department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  \r\n  \r\nPlanned Changes to Improve Safety\r\n\r\nThe Rocklin LPG Terminal resolves all findings from PHAs, some of which result in modifications to the process.  Other recommendations for possible changes to improve safety come from periodic accident prevention program audits, incident investigations, or employee suggestions and recommendations.  The following changes are planned for implementation at the Rocklin LPG Terminal.  \r\n\r\n* New security fencing and automatic gates have been installed for more positive site access control.\r\n* Four new hazardous gas detectors have been installed in the storage and rail car unloading areas.\r\n* The terminal has begun using Smart Hose automatic shutoff hoses for improved shutoff in case of equipment failure at the truck loading and rail unloading racks.\r\n* The terminal Emergency Shutdown System has been improved, and an additional emergency shutdown station has been added.\r\n* Kiva Energy is currently in the process of reviewing and revising the entire safety management / accident prevention program to ensure that the program can be fully administered across the diverse nature of the facilities owned or operated by the company."
    }
  ]
}