{
  "FacilityID": 1000079440,
  "FacilityName": "Mont Belvieu North/Central Storage Facility",
  "FacilityStr1": "10902 Fitzgerald Road",
  "FacilityStr2": null,
  "FacilityCity": "Mont Belvieu",
  "FacilityState": "TX",
  "FacilityZipCode": "77580",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48071",
  "LEPC": "Chambers County LEPC",
  "FacilityLatDecDegs": "29.857654",
  "FacilityLongDecDegs": "-94.899323",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.energytransfer.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Energy Transfer Mont Belvieu NGLs LP",
  "Company2Name": "Energy Transfer Company",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Energy Transfer Mont Belvieu Div",
  "OperatorStr1": "12353 Eagle Pointe Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Mont Belvieu",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77535",
  "OperatorZipCodeExt": null,
  "RMPContact": "Cody Milburn",
  "RMPTitle": "PSM/RMP Manager",
  "FTE": 39,
  "OtherEPAFacilityID": "TXR000007112",
  "EPAFacilityID": "100000178764",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-08-30 00:00:00",
  "SafetyInspectionBy": "Texas Railroad Commission",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-01-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 29.85603,
  "FRS_Long": -94.90361,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099101,
      "AltID": "Storage/Handling of NGLs",
      "FacilityID": 1000079440,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100344,
          "ProcessID": 1000099101,
          "NAICSCode": "48691",
          "_desc": {
            "NAICS_CODE": "48691",
            "NAICS_DESCRIPTION": "Pipeline Transportation of Refined Petroleum Products"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124188,
          "ProcessID": 1000099101,
          "ChemicalID": 118,
          "Quantity": 143300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000124189,
          "ProcessID": 1000099101,
          "ChemicalID": 98,
          "Quantity": 126300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000124190,
          "ProcessID": 1000099101,
          "ChemicalID": 105,
          "Quantity": 14100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 105,
            "ChemicalName": "Ethyl mercaptan [Ethanethiol]",
            "CASNumber": "75-08-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000124191,
          "ProcessID": 1000099101,
          "ChemicalID": 155,
          "Quantity": 530424.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000107505,
              "ProcessChemicalID": 1000124191,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000107506,
              "ProcessChemicalID": 1000124191,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000107507,
              "ProcessChemicalID": 1000124191,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000107508,
              "ProcessChemicalID": 1000124191,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000107509,
              "ProcessChemicalID": 1000124191,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000107510,
              "ProcessChemicalID": 1000124191,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000624188,
          "ProcessID": 1000099101,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624189,
          "ProcessID": 1000099101,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624190,
          "ProcessID": 1000099101,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624191,
          "ProcessID": 1000099101,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079440,
      "SummaryText": "Executive Summary\n\n1. Accidental Release Prevention and Energy Response Policies\n\nEnergy Transfer Mont Belvieu NGLs LLC is strongly committed to employee, public, and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release does occur at the Energy Transfer Mont Belvieu NGLs LLC Mont Belvieu Terminal, our response activities are coordinated with Mont Belvieu Police Department and Mutual Aid Mont Belvieu (MAMB).\n\n\n\n2.  The Stationary Source and the Regulated Substances Handled\n\nThe Mont Belvieu Terminal's RMP-regulated activities are the storage and loading of propane [CAS# 74-98-6], butane [CAS# 106-97-8], and NGL [CAS# 68425-31-0].  Propane and butane are received by pipeline and stored in pressure vessels. Propane is stored in two 30,000-gallon pressurized \"bullet\" tanks. Likewise, butane is stored in two 30,000-gallon pressurized \"bullet\" tanks.  NGL commonly referred to as natural gasoline is stored in a 106,000 gallon pressurized tank which is connected to a pipeline for further shipment.  The propane and butane tanks provide intermediate storage prior to truck and rail loading of both propane and butane.  All loading of LPG products is for purposes of wholesale distribution. Ethyl mercaptan [CAS# 75-08-1] is also stored at the site in quantities potentially above the RMP threshold of 10,000 lbs. Ethyl mercaptan is used to odorize LPG products prior to loading into transport vessels.  Propane, butane, natural gasoline (as a flammable mixture) and ethyl mercaptan are all classified as flammable under 40 CFR Part 68. No other flammable compounds or designated toxic compounds are stored or used at the facility in amounts above their RMP th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079440,
      "SummaryText": "reshold quantities.  The maximum on-site quantities of propane, butane, natural gasoline and ethyl mercaptan subject to regulation under 40 CFR Part 68 at any one time are estimated to be 250,000 lbs, 290,000 lbs, 530,000 lbs, and 19,000 lbs, respectively.\n\n\n\n3.  General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68. The following sections briefly describe the elements of the release program that is in place at our stationary source.  \n\n\n\nProcess Safety Information\n\nEnergy Transfer Mont Belvieu NGLs LLC maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  Hazop and What-if hazard analysis methodologies have been used to carry out these analyses. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of not more than five (5) years. Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\nFor the purpose of safely conducting activities within our covered processes, Energy Transfer Mont Belvieu NGLs LLC maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nEnergy Transfer Mont Belvieu NGLs LLC has a comprehensive training program in place to ensure that employees who are operatin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079440,
      "SummaryText": "g processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three (3) years, and more frequently as needed.\n\n\n\nMechanical Integrity\n\nEnergy Transfer Mont Belvieu NGLs LLC carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes, among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, pumps, valves, gas detectors, flame detectors, and temperature and pressure switches.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at Energy Transfer Mont Belvieu NGLs LLC to manage changes in process chemicals, technology, equipment, and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-Startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Energy Transfer Mont Belvieu NGLs LLC. These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nEnergy Transfer Mont Belvieu NGLs LLC will conduct audits on a regular basis to confirm that the provisions set out under the RMP rule are being properly and adequately implemented. These audits will be carried out at least every three (3) years and any corrective actions required as result of the audits wi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079440,
      "SummaryText": "ll be undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nEnergy Transfer Mont Belvieu NGLs LLC promptly investigates any incident that results in, or could reasonably result in, a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release form release from reoccurring. All reports are retained for a minimum of five (5) years.\n\n\n\nEmployee Participation\n\nEnergy Transfer Mont Belvieu NGLs LLC truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Energy Transfer Mont Belvieu NGLs LLC has a strict policy of informing the contractors of known potential hazards related to contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.  \n\n\n\n4.  Five-year Accident History\n\nEnergy Transfer Mont Belvieu NGLs LLC Mont Belvieu Storage has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, there have been no accidental releases of Energy Transfer Mont Belvieu NGLs LLC Mont Belvieu Storage substances regulated under 40 CFR Part 68 during this period which have resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injur"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000079440,
      "SummaryText": "ies, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\n5.  Emergency Response Plan\n\nEnergy Transfer Mont Belvieu NGLs LLC maintains a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  To ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the emergency response plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\n6.  Planned Changes to Improve Safety\n\nAt the present time, there are no plans for significant changes to the facility for purpose of improving safety.\n\n"
    }
  ]
}