{
  "FacilityID": 1000041034,
  "FacilityName": "Brenntag Mid-South Inc.",
  "FacilityStr1": "2 HCI Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Greensboro",
  "FacilityState": "NC",
  "FacilityZipCode": "27409",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37081",
  "LEPC": "Guilford County LEPC",
  "FacilityLatDecDegs": "36.064950",
  "FacilityLongDecDegs": "-079.878813",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": "aclements@brenntag.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Brenntag Inc.",
  "Company2Name": null,
  "CompanyDUNS": 122625064,
  "Company2DUNS": null,
  "OperatorName": "Brenntag Mid-South Inc.",
  "OperatorStr1": "1405 Hwy. 136 West",
  "OperatorStr2": null,
  "OperatorCity": "Henderson",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42420",
  "OperatorZipCodeExt": null,
  "FTE": 37,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177186",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-04-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-04-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-04-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-04-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.06525,
  "FRS_Long": -79.87939,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000050506,
      "AltID": "Ammonia Hydroxide",
      "FacilityID": 1000041034,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000061177,
          "ProcessID": 1000050506,
          "ChemicalID": 57,
          "Quantity": 146400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000050970,
          "ProcessID": 1000050506,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000033314,
              "Process_NAICS_ID": 1000050970,
              "SafetyReviewDate": "2014-04-16 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "U.S. Department of Transportation specifications",
              "FR_Comments": null,
              "HazardReviewDate": "2014-04-16 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Emergency response equipment",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-01-02 00:00:00",
              "TrainingReviewDate": "2014-01-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-01-02 00:00:00",
              "EquipmentInspectionDate": "2014-04-02 00:00:00",
              "EquipmentTested": "Forklift Preventative Maintenance Inspection (used to move containers)",
              "ComplianceAuditDate": "2014-04-16 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2014-04-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000033781,
                  "PreventionProgram2ID": 1000033314,
                  "ProcessChemicalID": 1000061177
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000041034,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-10-30 00:00:00",
    "ERTrainingDate": "2013-09-18 00:00:00",
    "CoordinatingAgencyName": "Guilford  County Emer. Mgmt",
    "CoordinatingAgencyPhone": "3363732278",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041034,
      "SummaryText": "Brenntag Mid-South, Inc. Executive Summary for Greensboro, NC\r\n\r\n1. Accidental Release Prevention and Emergency Response Policies We at Brenntag Mid-South, Inc. are strongly committed to employee, public and environmental safety. This is evidenced through our Core Values found in the Brenntag Cornerstone. The six (6) elements or core values of Brenntag Cornerstone are: SAFETY FIRST, LEADERSHIP & ACCOUNTABILITY, EMPLOYEE INVOLVEMENT AND\r\nOWNERSHIP, COMMITMENT TO EXCELLENCE, CONTINUOUS IMPROVEMENT AND WORLD CLASS VALUE CREATION. As stated by Mr. William A. Filder, President & CEO of Brenntag North America and Latin America; \"Nothing we do can ever become more important than our safety performance.\" and \"There is not business goal worth asking people to sacrifice what they value most in life.\" This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation,\r\noperating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Unforeseeably, if such a release does occur, we are completely coordinated with GREENSBORO FIRE DEPARTMENT which provides highly trained emergency response personnel to control and mitigate the effects of a release.\r\n\r\n2.The Stationary Source and the Regulated Substances Handled\r\nOur facility's primary activities encompass Chemical distribution. We have 1 regulated substance present at our facility. This substance is Ammonium Hydroxide (Ammonia aqueous solution). The RMP regulated substance is packaged elsewhere and is simply stored and warehoused at our Greensboro facility for distribution.\r\n\r\n3.To perform the required offsite consequence analysis for our facility, we have used EPA's RMP*Comp(TM).\r\n\r\n4.The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps Our facility has taken all the necessary"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041034,
      "SummaryText": "steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. This facility was designed and constructed in accordance with Federal, State, and Local regulations. Brenntag is also ISO 9000-2001 certified. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\r\n\r\nProcess Safety Information\r\nBrenntag Mid-South, Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.  Process Hazard Analysis Our facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is Checklist. Any findings related to the hazard analysis are addressed in a timely manner.\r\n\r\nOperating Procedures\r\nFor the purposes of safely conducting activities within our covered processes, Brenntag Mid-South, Inc. maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations,normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\r\n\r\nTraining\r\nBrenntag Mid-South, Inc. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every three (3) years and more frequently as needed.\r\n\r\nMechanical Integrity\r\nBrenntag Mid-South, Inc. carries out documented maintenance checks on equipment to ensure proper operations. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041034,
      "SummaryText": "needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  Management of Change Written procedures are in place at Brenntag Mid-South, Inc. to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee\r\nwhose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\nPre-startup Reviews\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Brenntag Mid-South, Inc. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\nBrenntag Mid-South, Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out on a periodic basis and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\r\n\r\nIncident Investigation\r\nBrenntag Mid-South, Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\r\n\r\nEmployee Participation\r\nBrenntag Mid-South, Inc. truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information res"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000041034,
      "SummaryText": "ulting from process hazard analyses in particular.\r\n\r\nContractors\r\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Brenntag Mid-South, Inc. has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\n5.Five-year Accident History\r\nBrenntag Mid-South, Inc. has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there have been no accidental release during this period. \r\n\r\n6.Emergency Response Plan\r\nBrenntag Mid-South, Inc. has a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  To ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.  Guliford County is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\r\n\r\n7.Planned Changes to Improve Safety\r\nSeveral developments and findings have resulted from the implementation of the various elements of our\r\naccidental release prevention program. EPA RMP Comp is the methodology used to determine distance to\r\ntoxic endpoints"
    }
  ]
}