{
  "FacilityID": 1000077240,
  "FacilityName": "Solvay  - Orange Facility",
  "FacilityStr1": "4059 FM 1006",
  "FacilityStr2": null,
  "FacilityCity": "Orange",
  "FacilityState": "TX",
  "FacilityZipCode": "77630",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48361",
  "LEPC": "Orange County LEPC",
  "FacilityLatDecDegs": "30.048611",
  "FacilityLongDecDegs": "-093.771944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.solvay.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 154288492,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Solvay Specialty Polymers USA, LLC",
  "OperatorStr1": "P. O. Box 3860",
  "OperatorStr2": null,
  "OperatorCity": "Orange",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77631",
  "OperatorZipCodeExt": "3860",
  "FTE": 40,
  "OtherEPAFacilityID": "TXD981513963",
  "EPAFacilityID": "100000154316",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-06-28 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "04/07/06",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-03-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-03-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 30.05047,
  "FRS_Long": -93.76653,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000096157,
      "AltID": "Fluoropolymer Manufacture",
      "FacilityID": 1000077240,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120387,
          "ProcessID": 1000096157,
          "ChemicalID": 117,
          "Quantity": 350000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000097419,
          "ProcessID": 1000096157,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000081953,
              "Process_NAICS_ID": 1000097419,
              "SafetyReviewDate": "2013-04-25 00:00:00",
              "PHA_Date": "2017-05-12 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-12-31 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Fire Water Monitor",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-06-29 00:00:00",
              "TrainingReviewDate": "2018-07-31 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-03-08 00:00:00",
              "EquipmentInspectionDate": "2019-01-16 00:00:00",
              "EquipmentTested": "U-830",
              "ChangeMgmtDate": "2019-03-26 00:00:00",
              "ChangeMgmtReviewDate": "2019-01-18 00:00:00",
              "PreStartupReviewDate": "2019-03-27 00:00:00",
              "ComplianceAuditDate": "2019-03-26 00:00:00",
              "AuditCompletionDate": "2019-12-31 00:00:00",
              "IncidentInvestigationDate": "2019-01-30 00:00:00",
              "InvestigationChangeDate": "2019-07-31 00:00:00",
              "ParticipationPlansReviewDate": "2019-03-26 00:00:00",
              "HotWorkPermitReviewDate": "2019-03-26 00:00:00",
              "ContractorSafetyReviewDate": "2019-01-23 00:00:00",
              "ContractorSafetyEvalDate": "2019-02-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "This process is one production unit. Some mitigation systems in use are specific to individual pieces of equipment such as blast wall for reactors and dump tanks and dike for storage tank.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000101792,
                  "PreventionProgram3ID": 1000081953,
                  "ProcessChemicalID": 1000120387
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000077240,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-08-24 00:00:00",
    "ERTrainingDate": "2018-08-23 00:00:00",
    "CoordinatingAgencyName": "City of Orange Fire Department",
    "CoordinatingAgencyPhone": "4098831050",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077240,
      "SummaryText": "SOLVAY SPECIALTY POLYMERS USA, LLC\n\nORANGE PLANT\n\nRISK MANAGEMENT PLAN EXECUTIVE SUMMARY\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\n\n\nAt the Solvay Orange Plant, we are committed to operating and maintaining all of our processes in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.\n\n\n\nWe are a member of the American Chemistry Council (ACC) Responsible Care Program.  The ACC Responsible Care Program goes beyond the boundaries of regulatory compliance and strives for continuous improvement in industry operations and processes by incorporating health, safety, and environmental protection into all stages of a products life; design, manufacture, marketing, distribution, use, recycling, and disposal.\n\n\n\nThe Orange plant participates in the Orange Community Advisory Panel of local citizens who meet regularly with plant management to discuss various issues, especially those related to environmental, safety, and health.  This mechanism was established to better understand and address the needs and concerns of the local community.\n\n\n\nSolvay has been proactive in communicating our risk management program with the community.  A RMP Community Awareness event was in public meetings during April of 1998 and included participation by local industry and the local emergency response community.  The Community Advisory Panel toured our plant and employees and management were available to answer questions.  Information was distributed that explains our plant's safety programs, release scenarios, and emergency response program.  The presentation to the general public was repeated during the community's annual \"Gumbo Cook-Off Festival\" on May 2,1998.\n\n\n\nThe following is taken from the Solvay Corporate Safety Policy:\n\n\n\n\"Consistent with the policy of the Global Business Unit Solvay "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077240,
      "SummaryText": "Specialty Polymers on health, safety, and environment and quality, the most important objective of Solvay Specialty Polymers USA, LLC (SSPUSA) is to safely and responsibly produce and offer differentiated products, solutions and services to our customers while safeguarding the safety and health of our employees and surrounding communities.  SSPUSA firmly believes that being excellent in health, safety, environmental and quality (HSEQ) is crucial for generating a growing, successful and sustainable business.\"\n\n\n\nThe following specific points are included in Solvay Corporate Safety policy.\n\n\n\n- Committing efforts and ensuring compliance with all applicable regulations for health safety and environment (HSE), responsible care management system (RCMS) and adopted industrial standards for quality such as ISO 9001 and the Solvay Group's Responsible Care Policy and sustainable development principles; \n\n\n\n- Developing and implementing education and training of all employees to ensure awareness and knowledge, while targeting the prevention and continuous improvement in the areas of HSEQ;\n\n\n\n- Ensuring our facilites are built, operated and maintained in accordance with all applicable regulatory standards to protect the health and safety of our employees, the surrounding communities, and the environment, with the ultimate goals of no accidents, occupational injuries or illnesses, or harm to the environment;\n\n\n\nThe Orange Plant recognizes and is concerned that every employee shall be furnished a safe and healthful place to work, free from recognized hazards that might cause serious injuries and illness.  Every effort will be made in the interest of accident prevention, health preservation, and fire protection.\n\n\n\n\n\n\n\n2.    Stationary Source and Regulated Substances\n\n\n\nSolvay has developed and currently markets a family of fluorine based products that are noted for their exceptional resistance to chemical agents and environments, which attack and degrade other materials.  At the Or"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077240,
      "SummaryText": "ange plant, various grades of HALAR(r); are manufactured that are used by customers in a number of applications, including the formulation of wire and cable coatings. The Orange plant became fully operational in 1982, was purchased by Ausimont USA, Inc. in 1986, changed its name to Solvay Solexis, Inc. on January 1, 2002, and became part of Solvay Specialty Polymers USA, LLC on November 1, 2012.\n\n\n\nThe regulated substance at the Orange plant is trifluorochloroethylene, a flammable substance which is the primary raw material used in the manufacture of HALAR(r);. Trifluorochloroethylene is also known as chlorotrifluoroethylene, or CTFE. \n\n\n\n3.    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nThe facility is regulated under the OSHA Process Safety Management rules, which regulates the management of process safety.  Our management systems address each of the key features of successful prevention programs including:\n\n\n\nProcess Safety Information: A variety of technical documents are kept that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters, and equipment design basis/configuration information.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment.\n\nProcess Hazard Analysis:  A comprehensive program ensures that hazards associated with the various processes are identified and controlled.  Within this program, each process or process change is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.  This is performed by a team, which identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and makes recommendations for additional prevention and/or mitigation measures when deemed necessary.\n\nStandard Operating Procedures:  Operating procedures p"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000077240,
      "SummaryText": "rovide clear instructions for safely conducting activities involved in each process, consistent with the process safety information.  The written procedures address steps for each operating phase, operating limits, emergency shutdown procedures, and safety and health considerations.\n\nTraining:   We have established a comprehensive training program to certify operators in both unit operations and emergency response procedures.  This requires operators to demonstrate (through written testing and hands-on examinations) that they have adequate knowledge before they can work independently.  This training includes emphasis on the specific safety and health hazards, emergency operations including shutdown, and safe work practices applicable to the employee's job tasks.  There is refresher training for all operators on the operating procedures and chemical hazards of the process.\n\nMechanical Integrity:  An established preventive maintenance and equipment integrity program promotes that all process equipment is operating within approved limits.  The initial and on-going integrity of process equipment is ensured by determining that the equipment is designed, installed and maintained properly.  This includes testing and inspection of equipment and quality assurance checks of equipment, spare parts and maintenance materials.  Any deficiencies, which are found, are required to be corrected before the equipment is returned to service.\n\nManagement of Change: A compliance program ensures that changes to equipment, chemicals, technology (including process operating conditions), and operating procedures are properly reviewed and authorized before being implemented. Changes are reviewed to confirm that adequate controls are in place to manage the change and that existing controls have not been compromised by the modification.  All changes affecting process safety information are verified with a pre-startup safety review, all relevant process safety information is updated, and all affe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000077240,
      "SummaryText": "cted employees are notified of the change.\n\nPre-startup Safety Review:  A pre-startup safety review is performed for all modifications, which resulted in a change in the process safety information.  This review ensures that all construction and equipment is in accordance with the design specifications, that the safety, operating, maintenance, and emergency procedures are current and adequate, that a process hazard analysis has been performed if required and that all recommendations have been addressed; and that employees have been trained on the change.\n\nCompliance Safety Audits: Audits are performed to verify that all procedures and practices developed under the process safety standard are adequate and are being followed.  All findings of the audit are promptly addressed and are tracked to ensure they have been corrected.\n\nIncident Investigation: All incidents are investigated and appropriate corrective actions are made to prevent recurrence. The investigations are conducted to determine the facts and develop recommendations, which are tracked to completion.  These are reviewed with all employees during monthly safety meetings, as well as any recommendations from our employee safety committee.\n\nEmployee Participation: Employees are encouraged to participate in all areas of process safety management, including the conduct and development of process hazard analysis and other process safety information.  The Employee Safety Committee normally meets once per month to review new information and address the concerns of the plant employees.\n\nHot Work Permit: A permit is required to be issued before any hot work operations can be performed on or near a processing area.  This ensures that all fire prevention and protection have been implemented and that employees in the area are aware of the activity.\n\nContractors:  All contractors working in the plant receive training on all facility rules and regulations, chemical/process hazards, and emergency procedures.  The contractor"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000077240,
      "SummaryText": "'s safety records are pre-screened before they are hired, and they are periodically audited to ensure that they are working safely and following all plant rules and regulations.\n\nInspections:  There are a number of safety inspections conducted by plant personnel, including weekly process unit safety inspections by the operators and periodic management inspections.\n\nMonitoring:  A computer controlled monitoring and process system continuously evaluates key system conditions with alarms/interlocks/shutdown to a manned control room and routine checks are conducted every work shift to promote safe operations.\n\n\n\nAs part of our prevention efforts, we have implemented the following chemical-specific prevention steps for CTFE:\n\nSystem Design: The storage tank and charge pumps are maintained in a diked area. A fixed fire monitor and a fixed deluge system provide coverage for this area.\n\nAlarms:  Leak detection system sensors immediately alert the operator in the control room if a leak were to occur.  \n\n\n\n4.    Five-year Accident History\n\n\n\nThere has not been an accident from a covered process that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the past five years at this facility.\n\n\n\n5.    Emergency Response Program\n\n\n\nThe Emergency Response Program is designed to assure that the Solvay employees are prepared to respond to emergency situations, which may occur at the facility.  The Program involves the following elements:\n\n\n\nEmergency Response Plan- We maintain an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  The plan includes instructions for: emergency reporting and plan activation, notifi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000077240,
      "SummaryText": "cation of emergency responders, emergency shutdown procedures, establishment of a emergency command center and field command post, duties of key individuals, procedures for fire, chemical release, off-site spills, hurricane, and bomb threat, evacuation procedures, HAZMAT procedures, and emergency response equipment information.\n\nOur Emergency Response Plan has been coordinated with local emergency management services.  Local community emergency responders also participate in annual drills at the facility.  There is a post-drill review of all exercises to access the effectiveness of the Emergency Response Plan.\n\nThe plant has an industrial contract with the city of Orange Fire Department for emergency response and rescue.\n\nEmergency Response Training- Orange site personnel are not trained First Responders.  The Orange Fire Department acts as First Responders for the site.  However, personnel receive annual training in:  alarm identification and response, response to a release, use of personal protective equipment, rescue procedures (contacting Orange Fire Department), evacuation procedures,  action plans dealing with specific scenarios, specifically assigned emergency response duties, hazard communication, air monitoring equipment, decontamination, containment procedures and spill control techniques.\n\n\n\nEmergency Response Equipment and Systems- In the event of an emergency, the following is some of the response equipment available onsite so mitigation activities can begin immediately:\n\n-    Personal protective equipment (e.g., protective clothing, self-contained breathing apparatus)\n\n-    Valves to permit isolation of the process (manual or automated)\n\n-    Automated shutdown systems for specific process parameters (e.g., high level, high temperature)\n\n-    Curbing or diking to contain liquid releases\n\n-    Redundant equipment and instrumentation (e.g., backup power supply for process control system)\n\n-    Fire suppression and extinguishing systems\n\n-    Deluge system for specific equipm"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000077240,
      "SummaryText": "ent and raw materials storage area\n\n-    High pressure firewater system with remote and manual water spray suppression systems to cool equipment and to dilute and disperse vapors\n\n-    Video camera system offers 24 hour monitoring of the facility from the plant control room\n\n-    Spill containment equipment and supplies\n\n-    Air monitoring equipment\n\n-    Neutralization of liquid spills\n\n\n\n6.    Planned Changes To Improve Safety\n\n\n\nWe will continue to incorporate the findings from incident investigations and the recommendations developed during process hazard analysis as a means of continuously improving the safety at the Orange Plant.\n\n"
    }
  ]
}