{
  "FacilityID": 1000083146,
  "FacilityName": "Tyson Refrigerated Processed Meats, Portwall",
  "FacilityStr1": "300 Portwall Road",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77029",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-City Of Houston",
  "FacilityLatDecDegs": "29.784306",
  "FacilityLongDecDegs": "-095.280282",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.Tyson.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 600306690,
  "ParentCompanyName": "Tyson Foods Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6903702,
  "Company2DUNS": 0,
  "OperatorName": "Tyson Refrigeration Processed Meats",
  "OperatorStr1": "300 Portwall Road",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77029",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jason Sturdy",
  "RMPTitle": "Plant Manager",
  "FTE": 613,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176187",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-09-28 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-10-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-10-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-10-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.78649,
  "FRS_Long": -95.27583,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000103935,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000083146,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000105267,
          "ProcessID": 1000103935,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000130119,
          "ProcessID": 1000103935,
          "ChemicalID": 56,
          "Quantity": 45553.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000630119,
          "ProcessID": 1000103935,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083146,
      "SummaryText": "Tyson Refrigerated Processed Meats, Portwall - Houston\n\nRisk Management Plan\n\nExecutive Summary            \n\n\n\nI. Accidental release prevention and emergency response policies\n\n\n\nIt is the policy of Tyson Foods Inc to implement a Risk Management Plan (RMP) in accordance with 40 CFR Part 68. Included in this process is the implementation of OSHA standard 29 CFR 1910.119.\n\n\n\nThe purpose of implementing these programs is to prevent the release of anhydrous ammonia. By doing so we protect employees and guests on site while protecting the general public off site. \n\n\n\nAs part of these programs, Tyson Foods has developed an emergency response plan that includes a well trained response team that coordinates closely with local fire department and other off site emergency personnel.\n\n\n\nII. The stationary source and regulated substance handled.\n\nAmmonia for refrigeration-amount of regulated substance-(45,553 pounds).\n\n\n\nTyson Refrigerated Processed Meats, Portwall is a food manufacturing facility located in a heavy industrial section of Houston Texas. \n\n\n\nThe food production process at this facility requires very low temperatures to process and maintain the finished product. The refrigeration system uses anhydrous ammonia to provide the proper temperature in the production areas, coolers and blast freezers. \n\n\n\nIII. General accident release prevention program and chemical-specific prevention.\n\n\n\nA. Tyson Refrigerated Processed Meats, Portwall Facility  has designed and implemented a preventative maintenance program to reduce the potential for release of ammonia from the refrigeration system. This program complies with the requirements of OSHA regulation 29 CFR 1910.119 Process Safety Management. The key concept of this release prevention program is employee participation, appropriate design and maintenance of equipment and appropriate training of all Tyson Team Members.\n\n\n\nIV. Five-year accident history\n\n\n\nThere have not been any releases of anhydrous ammonia at this facility "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083146,
      "SummaryText": "in the last five years that resulted in deaths, injuries, or significant damage on site or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.    \n\n\n\nV. Emergency Response Program\n\n\n\nAs part of these programs, Tyson Foods has developed an emergency response plan that includes a well-trained response team that coordinates closely with local fire department and other off site emergency personnel.\n\nAn Emergency Response Team is currently undergoing training. This team is trained to the Hazardous\n\nMaterials Responder-Technician response capability in accordance with OSHA 29 CFR 1910.120 (q). The team\n\nis capable of affecting all control measures (both confinement operations and containment operations)\n\nrequired to remediate an incident.\n\n\n\nA written Emergency Response Plan has been developed and is on record at the Facility. This plan includes\n\nPre-Emergency Planning with Outside Agencies, Personnel Roles and Lines of Incident Command Authority,\n\nFacility Hazard Analysis and Emergency Prevention, Safe Distances and Places of Refuge, Site Security and\n\nControl, Evacuation Routes and Procedures, Decontamination Procedures, provisions for Emergency Medical\n\nTreatment, Emergency Notification Procedures, Chemical Response Procedures, Post Incident Critique, and\n\nPersonal Protective Clothing and Emergency Equipment.\n\n\n\nAll Hazmat courses at Tyson Foods, Inc. are designed to meet training requirements of the OSHA 29 CFR\n\n1910.120 (q) (7) and (8).  All Houston (Portwall) Hazmat Team Members will be trained 40 hours initially followed by 8 hours of refresher training per year under the direction of the on-site Hazmat Instructor at the facility. Each Instructor receives an initial 40 hours of training.\n\n\n\nThe training is designed to teach both theory and hands-on training giving the person an overall\n\nunderstanding of the nature of hazardous materials and the ability to assess and safely respond to the\n\nincidents in the Inci"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083146,
      "SummaryText": "dent Command structure. Technician level training includes but is not limited to the\n\nfollowing:\n\n* Knowledge of basic hazards and risk assessment techniques\n\n* Proper selection and use of appropriate and required PPE for the chemical hazard\n\n* Terminology associated with Hazmat\n\n* Advanced site control/security procedures\n\n* Advanced Containment/Control/Decon procedures\n\n* Use of Atmospheric Monitoring Equipment and Contaminant Test Procedures\n\n* Incident Command Structure Roles and Line of Authority\n\n* Interaction with Local and State Officials\n\n* Standard Operating Procedures for Clean-up and termination\n\n* Critique\n\n\n\nOn Site facility Instructors have completed in excess of 40 hours of Instructor's training, achieving the\n\nIncident Command level, over the past 1 year and have instructed their team in approximately 8 hours of\n\ntraining.\n\n\n\nAll training materials, hands-on drills and response procedures have been developed under the direction of\n\nthe Corporate Loss Control Department.\n\n\n\nAll Team members are taught in Hazard Communication to report any observed chemical leaks/spills and\n\nodors to their supervisor or lead person immediately. Supervisors and Leads are taught to report the above\n\nto the Safety or Process Manager immediately for further investigation and action by the Hazmat team.\n\nMSDS information books are accessible to all team members for review.\n\n\n\nVI. Planned changes to improve safety\n\n\n\nThe site has been and plans to continue to send Managers & Refrigeration Team Members to outside training on PSM/RMP and refrigeration technical training."
    }
  ]
}