{
  "FacilityID": 1000107565,
  "FacilityName": "North Silo Crude Oil Terminal",
  "FacilityStr1": "2678 US 85",
  "FacilityStr2": null,
  "FacilityCity": "Cheyenne",
  "FacilityState": "WY",
  "FacilityZipCode": "82009",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56021",
  "LEPC": "Laramie County LEPC",
  "FacilityLatDecDegs": "41.387",
  "FacilityLongDecDegs": "-104.510",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "http://roaringforkmidstream.site",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Roaring Fork Midstream",
  "OperatorStr1": "1225 17th Street Suite 2450",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000251318",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-10-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-10-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-10-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-10-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000134462,
      "AltID": "Butane Storage & Blending",
      "FacilityID": 1000107565,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000168544,
          "ProcessID": 1000134462,
          "ChemicalID": 118,
          "Quantity": 239443.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000136056,
          "ProcessID": 1000134462,
          "NAICSCode": "48611",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000107565,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-10-06 00:00:00",
    "ERTrainingDate": "2023-10-25 00:00:00",
    "CoordinatingAgencyName": "Laramie County Fire District 6",
    "CoordinatingAgencyPhone": "3075472253",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000107565,
      "SummaryText": "I. Introduction to Risk Management Plan\nThe Environmental Protection Agency (EPA) has published regulations and guidance for chemical accident prevention at facilities that handle hazardous chemicals, which can be found in the Risk Management Plan (RMP) rule. The facilities which handle certain hazardous chemicals, must develop a Risk Management Plan, which [1]: \n1.\tidentifies the potential effects of a chemical accident\n2.\tidentifies steps the facility is taking to prevent an accident\n3.\tspells out emergency response procedures should an accident occur\nThe list of regulated substances under the RMP program can be found in the following link: https://www.epa.gov/rmp/list-regulated-substances-under-risk-management-plan-rmp-program. When a facility is built, and the chemicals handled are above the listed threshold quantity, the company needs to implement a risk management program, develop the RMP, and submit it to the EPA. \nThe plan must be revised and resubmitted to EPA every five years.\nPer the requirements of the RMP rule, this document addresses the following [1]:\n1.\tHazard assessment that details the potential effects of an accidental release, an accident history of the last five years, and an evaluation of worst-case and alternative accidental releases\n2.\tPrevention program that includes safety precautions and maintenance, monitoring, and employee training measures\n3.\tEmergency response program that spells out emergency health care, employee training measures and procedures for informing the public and response agencies (e.g., the fire department) should an accident occur\n?\nII. RMP Inventory Summary\nAn inventory of RMP regulated substances at the Roaring Fork Midstream North Silo Crude Oil Terminal was developed utilizing the volumes of vessels and associated process piping shown on the facility Process and Instrument Diagrams (P&IDs). Table 1 illustrates the vessels accounted in the RMP and their inventory.\nVessel Tag Number\tVessel description\tMaximum Inventory"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000107565,
      "SummaryText": "(gal)\nV-450\tButane Storage Tank\t60,000\nV-460\tButane Storage Tank\t60,000\nTable 1: Vessels and Inventories for RMP\nThere are no regulated toxic substances above threshold quantities present at the North Silo Crude Oil Terminal.\n?\nIII. RMP Program Level Determination\nNorth Silo Crude Oil Terminal Location\nRoaring Fork Midstream (Roaring Fork) owns and operates the North Silo Crude Oil Terminal in Laramie County, Wyoming. The facility address is 2678 US 85, Cheyenne, WY 82009, with coordinates 41.387°N, 104.510°W. An aerial photograph of the area around the North Silo Crude Oil Terminal, including a facility plot plan is presented in Appendix A.\nDefinitions of RMP Program Level\nThe RMP rule defines three different program levels based on the potential for public impacts and the efforts needed to prevent accidents [2].\nRMP Program Level 1 (Level 1): Processes which would not affect the public in the case of a worst-case release; in the language of Part 68, processes \u0093with no public receptors within the distance to an endpoint from a worst-case release\u0094. Additionally, these processes must have had no accidents with specific offsite consequences within the past five years to be eligible for Level 1, which imposes limited hazard assessment requirements and minimal prevention and emergency response requirements.\nRMP Program Level 2 (Level 2): Processes not eligible for Level 1 or subject to Level 3 are placed in Level 2, which imposes streamlined prevention program requirements, as well as additional hazard assessment, management, and emergency response requirements. \nRMP Program Level 3 (Level 3): Processes not eligible for Level 1 and either subject to Occupational Safety and Health (OSHA) Process Safety Management (PSM) standard 1910.119 under federal or state OSHA programs or classified in one of ten specified North American Industrial Classification System (NAICS) codes are placed in Level 3, which imposes OSHA\u0092s PSM standard as the prevention program as well as additi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000107565,
      "SummaryText": "onal hazard assessment, management, and emergency response requirements.\nNorth Silo Crude Oil Terminal RMP Program Level\nThe North Silo Crude Oil Terminal is a Level 1 covered process. The assessment details can be found in Appendix B.\nOffsite Consequence Analysis\nWorst-case Case Scenarios\nRMP*Comp was used to determine the endpoint for a \u0093worst-case\u0094 scenario of each regulated substance. The total volume was entered in RMP*Comp to yield the estimated distance to 1-psi overpressure [3]. \n1.\tVapor Cloud Explosion (VCE) resulting from a release of 239,443 lbs. of the butane from one of the 60,000 Gallon Storage Tanks, V-450 or V-460. The distance to 1-psi overpressure for this scenario is 0.5 miles.\nThe open-source mapping program MARPLOT® was first used to determine the potential number of population (public) affected by the 1 psi overpressure generated by the \u0093worst-case\u0094 scenarios [4]. Using the North Silo Crude Oil Terminal coordinates and entering the distance to 1 psi overpressure, MARPLOT provides the population affected by the offsite consequences based on the 2010 census data. \nWithin MARPLOT, there is one (1) public receptor (housing unit) within the \u0093worst-case\u0094 scenario for V-450 or V-460.  However, the latest satellite imagery from Google Earth, the MARPLOT Map, and onsite verification, have confirmed that there are zero (0) public receptors within any \u0093worst-case\u0094 scenario at the North Silo Crude Oil Terminal.\nA plot plan of the North Silo Crude Oil Terminal and 1-psi overpressure contour for the worst-case scenario (0.5 miles) is presented in Figure 3 in Appendix C along with additional detailed information regarding the offsite consequence analysis using RMP*Comp and the MARPLOT population results.\nAlternative Release Scenarios\nBecause this is an RMP Program 1 facility, no analysis of Alternative Release Scenarios was required. \n\nIV. RMP Program Development\nThe following was developed to satisfy the management documentation as required by the RMP rule"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000107565,
      "SummaryText": "and applies to each regulated substance at the North Silo Crude Oil Terminal. A copy of the RMP filed with the EPA containing the RMP required information is available in Appendix D.\nExecutive Summary \u0096 North Silo Crude Oil Terminal\nRoaring Fork has a standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, including training personnel and considering safety in the design, installation, operation, and maintenance of our processes. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, facility-trained personnel will respond to control and contain the release.\n\nDescription of the Stationary Source and Regulated Substances\nRoaring Fork Midstream owns and operates a crude oil terminal, the North Silo Crude Oil Terminal, in Laramie County, Wyoming. The North Silo Crude Oil Terminal receives crude oil from various field production facilities in the area via pipelines and trucks.  The crude oil is stored in internal floating roof crude oil storage tanks.  Butane is trucked in from offsite and unloaded into pressurized butane storage tanks.  The butane and crude oil are blended in a static mixer (the blended product is not stored on site) before being sent off-site via pipeline. \nThe regulated flammable substance in the process is butane.\n\nGeneral Accident Release Prevention Program\n\nEmployee Participation\nRoaring Fork encourages employees to participate in all aspects of RMP and accident prevention. Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a Process Hazard Analysis (PHA) team. Employees have access to all information created as part of the facility accident prevention program. Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan which is ma"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000107565,
      "SummaryText": "intained at the facility and addresses each accident prevention program element.\n\nProcess Safety Information\nThe North Silo Crude Oil Terminal maintains a variety of technical documents that are used to help ensure safe operation of the process. These documents address (a) chemical properties and associated hazards, (b) limits for key process parameters and specific chemical inventories, and (c) equipment design basis/configuration information. \nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in Safety Data Sheets (SDSs). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.\nFor specific process areas, the facility has documented safety-related limits for specific process parameters (e.g., temperature, level, and composition). The facility ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\nThe facility also maintains documentation that provides information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information provides a basis for establishing inspection and maintenance activities, as well as evaluating proposed changes to ensure that safety features in the process are not compromised.\n\nProcess Hazard Analysis\nRoaring Fork has a comprehensive program to help ensure that hazards associated with the process are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\nPHAs are conducted using a team of people who have operating and maintenance experience in"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000107565,
      "SummaryText": "addition to engineering expertise. The team identifies and evaluates potential hazards and makes recommendations to mitigate the risk. Implementation of mitigation options in response to PHA findings is based on a qualitative risk ranking assigned by the PHA team. This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. The final recommendations are tracked to closure, and resolution of each finding is documented and retained.\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the North Silo Crude Oil Terminal periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted when major changes occur at the facility, or at minimum of every five years. The results and findings from these updates are also documented and retained.\n\nOperating Procedures\nThe North Silo Crude Oil Terminal maintains written procedures that address various modes of process operations, such as (1) startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for the training of new operators. These procedures are periodically reviewed to maintain correctness and annually certified as current and accurate. In addition, the North Silo Crude Oil Terminal maintains key process parameter documents that provide guidance on how to respond to upper or lower limit exceedance for specific process or equipment parameters. This information, along with written operating procedures, is readily available in the facility for operators and other personnel to use as necessary to safely perform their job tasks.\n\nTraining\nTo complement the written procedures for process operations, the North Silo Crude Oil Terminal has implemented a comprehensive training"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000107565,
      "SummaryText": "program for all employees involved in operating a process. New employees receive basic training in facility operations if they are not already familiar with such operations. After successfully completing this training, a new operator learns process-specific duties and tasks. A performance review is administered and must be successfully completed during this training period. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every three years, or more frequently if requested. All training is documented for each operator, including the means used to verify and demonstrate skills.\n\nContractors\nThe North Silo Crude Oil Terminal uses contractors to supplement its workforce during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, the station has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in event of an emergency, (5) understand and follow site safety rules, and (6) inform facility personnel of any hazards that they find during their work. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to beginning work.\n\nPre-Startup Safety Reviews (PSSRs) and Management of Change (MOC)\nRoaring Fork has a comprehensive system to manage changes to all covered processes. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) en"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000107565,
      "SummaryText": "sure that adequate controls are in place to manage any new hazards and to (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, operating and maintenance personnel are provided with any necessary training on the change.\nRoaring Fork conducts a PSSR for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready. The PSSR involves field verification of the construction and services as assurance that the accident prevention program requirements are properly implemented.\n\nMechanical Integrity\nRoaring Fork has established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: (1) conducting training, (2) maintenance procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process.\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.\nJob plans/written procedures help ensure that work is performed in a consistent manner and provide a b"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000107565,
      "SummaryText": "asis for training. Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g. adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\nAnother integral part of the mechanical integrity program is quality assurance. The North Silo Crude Oil Terminal incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\nSafe Work Practices\nThe North Silo Crude Oil Terminal has safe work practices as mandated by OSHA and the EPA to help provide employee, public, and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a permit and procedure to control spark-producing activities (i.e. hot work), and (4) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\nIncident Investigation\nRoaring Fork promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommend"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000107565,
      "SummaryText": "ations to prevent reoccurrence, and forwards these results to facility management for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during PHAs and PHA revalidations.\n\nCompliance Audits\nA compliance audit addressing all EPA RMP requirements is conducted at least every three years. The audit team documents findings, develops recommendations, and provides the overall results to facility management in a written report. All corrective actions are tracked until they are completed, and the two most recent audit reports are retained at the facility.\nChemical \u0096 Specific Prevention Steps\nThe processes at the North Silo Crude Oil Terminal have hazards that must be managed to ensure continued safe operation. The following is a description of existing safety features applicable to the prevention of accidental releases of regulated substances in the facility.\nSpecialized Safety Features\nThe North Silo Crude Oil Terminal has safety features to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of a release (mitigation). The following types of safety features are used in the covered processes:\nRelease Detection:\n1.\tTanks/Vessels are equipped with level and pressure sensors\n2.\tHigh/Low alarms and shutdowns\nRelease Containment/Control:\n1.\tProcess relief valves venting vapors to the atmosphere to prevent vessels from rupturing\n2.\tValves to permit isolation of the process (manual and automated)\n3.\tAutomated shutdown systems for specific process parameters\nRelease Mitigation:\n1.\tTrained personnel\n2.\tSpill Prevention, Control, and Countermeasure (SPCC) Pl"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000107565,
      "SummaryText": "an\n3.\tFire extinguishers\nFive Year Accident History\nThe North Silo Crude Oil Terminal has not included any RMP processes in the past, so there have been no releases of RMP-regulated substances in the past five years.\n\nEmergency Response Program Information\nThe North Silo Crude Oil Terminal is a Non-Responding Facility as per 40 CFR 68.90(b). The plant maintains a written emergency response plan, which is in place to help protect employee and public safety as well as the environment. The plan identifies steps to be taken in case of an accidental release including:\n1.\tProper first aid and medical treatment for exposures, \n2.\tEvacuation plans and accounting for personnel after an evacuation, and\n3.\tNotification of local emergency response agencies and the public if a release occurs.\nThe North Silo Crude Oil Terminal has 24/7 communications capability with appropriate emergency response organizations (Fire Department, Police, and Sheriff's Office). This interface provides the means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. In addition, Roaring Fork conducts periodic emergency drills and annual refresher training for plant personnel."
    }
  ]
}