{
  "FacilityID": 1000048860,
  "FacilityName": "Galmish Loading and Storage Facility",
  "FacilityStr1": "57 Piney Fork Road",
  "FacilityStr2": null,
  "FacilityCity": "Pine Grove",
  "FacilityState": "WV",
  "FacilityZipCode": "26419",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54103",
  "LEPC": "Wetzel County LEPC",
  "FacilityLatDecDegs": "39.564836",
  "FacilityLongDecDegs": "-080.700044",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.dominionenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Dominion Gathering & Processing, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 80303487,
  "Company2DUNS": 116025180,
  "OperatorName": "Dominion Energy Transmission, Inc.",
  "OperatorStr1": "925 White Oaks Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Bridgeport",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26330",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jennifer H. McCloskey",
  "RMPTitle": "Manager BU Environmental Compliance",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000060248",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-01-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-10-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-03-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-03-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-03-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.56647,
  "FRS_Long": -80.70339,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000061228,
      "AltID": "Storage/Transportation",
      "FacilityID": 1000048860,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000062429,
          "ProcessID": 1000061228,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000075091,
          "ProcessID": 1000061228,
          "ChemicalID": 98,
          "Quantity": 3300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000075092,
          "ProcessID": 1000061228,
          "ChemicalID": 118,
          "Quantity": 2200000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000075093,
          "ProcessID": 1000061228,
          "ChemicalID": 107,
          "Quantity": 510000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000075094,
          "ProcessID": 1000061228,
          "ChemicalID": 105,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 105,
            "ChemicalName": "Ethyl mercaptan [Ethanethiol]",
            "CASNumber": "75-08-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000075095,
          "ProcessID": 1000061228,
          "ChemicalID": 155,
          "Quantity": 290000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000065058,
              "ProcessChemicalID": 1000075095,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000065059,
              "ProcessChemicalID": 1000075095,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000065060,
              "ProcessChemicalID": 1000075095,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000065061,
              "ProcessChemicalID": 1000075095,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000575091,
          "ProcessID": 1000061228,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000575092,
          "ProcessID": 1000061228,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000575093,
          "ProcessID": 1000061228,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000575094,
          "ProcessID": 1000061228,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000575095,
          "ProcessID": 1000061228,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048860,
      "SummaryText": "Executive Summary for Dominion Gathering and Processing, Inc. (Dominion) - Galmish Loading and Storage Facility\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nDominion Gathering and Processing, Inc. (Dominion) - Galmish Loading and Storage Facility (Galmish) is committed to employee, public, and environmental safety.  This commitment is demonstrated by the release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at the facility.  It is Dominion's policy to implement appropriate controls to prevent possible releases of regulated substances.  If a release does occur, regular personnel are at hand to control and mitigate the effects of the release.  Dominion has contracted Weavertown Environmental Group as an Oil Spill Response Organization to provide additional emergency response expertise.  Also, Dominion will contact the Wetzel County Emergency Dispatch to obtain additional resources from local volunteer fire departments, law enforcement and emergency medical services.\n\n\n\n2. The Stationary Source and the Regulated Substances Handled\n\nThe Galmish Loading and Storage Facility handles five regulated flammable substances; propane, butane, isobutane, ethyl mercaptan and a flammable mixture.  Propane, butane, and isobutane [propane, 2-methyl] are stored in spheres until loaded on tank cars or tank trucks.  Propane can also be pumped back to the Hastings Extraction Plant.  Ethyl mercaptan [ethanethiol] is used to odorize propane so that a leak of this otherwise odorless substance can be detected by smell.  A vapor recovery system will also be used to recover product as it is loaded onto rail cars.  The recovered product is considered a flammable mixture under the rule.  Regulated substances in the flammable mixture will include propane, butane, isobutane, and pentane. \n\n\n\nThe maximum inventory of propane at the facility is 3,300,000 pounds while bu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048860,
      "SummaryText": "tane, isobutane [propane, 2-methyl] and ethyl mercaptan [ethanethiol] are present at the facility in quantities of 2,200,000 pounds, 510,000 pounds and 20,000 pounds, respectively.  A flammable mixture will also be present at the facility.  The maximum inventory of the flammable mixture will be 290,000 pounds.  No regulated toxic substances above the threshold quantity are used at the facility.\n\n\n\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 Code of Federal Regulations (CFR) Part 68 of the EPA.  This facility was designed and constructed in accordance with ASME B31.3.  A number of processes at the facility are subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.  The following sections briefly describe the elements of the release prevention program that is in place at this stationary source.\n\n\n\nProcess Safety Information\n\nGalmish maintains a detailed record of process safety information that describes the hazards of regulated substances, operating parameters and equipment designs associated with all processes.  Much of this information was compiled during the preparation of the Process Hazard Analysis (PHA).  Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in Safety Data Sheets (SDSs). The OSHA Hazard Communication Standard (HCS)requires chemical manufacturers, distributors or importers to provide SDSs to communicate the hazards of hazardous chemical products. As of June 1, 2015, the HCS will require new SDSs to be in uniform format.\n\n\n\nProcess Hazard Analysis\n\nThe facility conducts comprehensive studies to ensure that hazards associated with the processes are identified and controlled efficiently.  Galmish primarily uses the what-if m"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048860,
      "SummaryText": "ethod analysis technique to perform these evaluations.  The studies were undertaken by a team of qualified personnel with expertise in engineering and process operations and will be revalidated at regular intervals of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within the covered processes, Galmish maintains written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent with the process safety.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nGalmish develops and implements safe work practices to provide for the control of hazards during operations such as lockout/tagout; confined space entry; opening process equipment or piping; and control over entrance into a stationary source by maintenance, contractor, laboratory, or other support personnel.  These safe work practices apply to employees and contractor employees.\n\n\n\nTraining\n\nGalmish has a training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Initial training is provided to all employees upon hire and refresher training is conducted at least every 3 years or more frequently as needed.  Both initial and refresher training is documented and records of training are maintained onsite for at least 3 years.\n\n\n\nMechanical Integrity\n\nGalmish has written procedures for maintaining on-going integrity of process equipment, which incorporates training for process maintenance activities, inspection and testing, corrective action for equipment deficiencies, and the applicati"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048860,
      "SummaryText": "on of quality assurance measures.  Galmish carries out documented maintenance checks on process equipment to ensure proper installation and operation.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified and trained personnel carry out maintenance operations at the site.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  The plant also incorporates quality assurance measures to ensure that equipment and parts are suitable for the process application for which they will be used.\n\n\n\nManagement of Change\n\nWritten procedures are in place at Galmish to manage changes in process chemicals, technology, equipment and procedures.  These procedures will be updated as needed.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-startup safety reviews related to new processes and to modifications in established processes will be conducted as a regular practice at Galmish.  These reviews are conducted to confirm that construction and equipment is in accordance with design specifications, and safety, operating, maintenance, and emergency procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nGalmish conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out by at least one person knowledgeable in the process and are conducted at least every 3 years.  Audit findings are documented in a report.  Any corrective actions required from the audits are undertaken in a safe and prompt manner and are also documented.  The facility will maintain the two most recent "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048860,
      "SummaryText": "compliance audit reports.\n\n\n\nIncident Investigation\n\nGalmish promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  An incident investigation will be initiated as promptly as possible, but no later than 48 hours after the incident, and will involve at least one person knowledgeable of the process involved.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring.  A report will be prepared at the conclusion of the investigation and will include any resolutions and corrective action.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nGalmish believes that PSM and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nHot Work Permit\n\nGalmish will issue a hot work permit for hot work operations conducted on or near a covered process.  The permit shall document that the fire prevention and protection requirements have been implemented prior to beginning the hot work operations; it shall indicate the date(s) authorized for hot work; and identify the object on which hot work is to be performed.  The permit will be kept on file until completion of the hot work operations.\n\n\n\nContractors\n\nDominion hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Before any contractors are allowed to work at Galmish, they undergo an orientation conducted by the PSM team.  During this orientation contractors are made aware of th"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000048860,
      "SummaryText": "e known potential hazards related the contractor's work, the hazards of regulated substances within Galmish, the safe work procedures insisted on by Dominion, and familiarized with the Hot Work Permit Policy and the Lock Out/Tag Out Procedures used at Galmish.  Contractors are informed of all the procedures for emergency response should an accidental release of a regulated substance occur, and this information includes evacuation routes and assembly points.  Galmish will document that the contractor has received and understands the training.\n\n\n\nChemical Specific Prevention Steps\n\nThe processes at the Galmish have hazards that must be managed to ensure continued safe operation.  The following is a description of the existing safety features applicable to prevention of accidental releases of regulated substances at the facility.\n\n\n\nThe accident prevention program summarized previously is applied to all RMP-regulated processes at Galmish.  Collectively, these prevention program activities help prevent potential accidental scenarios that could be caused by equipment failures and human error.  The Galmish facility has safety features on many units to help (a) contain/control a release (e.g., diking and enclosures); (b) quickly detect a release (e.g., hydrocarbon detectors with alarms), and (c) reduce the consequences of (mitigate) a release (e.g., fire suppression and extinguishing).\n\n\n\n4. Five-year Accident History\n\nGalmish has an excellent record of preventing accidental releases over the last 5 years and no reportable accidents have occurred.\n\n\n\n5. Emergency Response Program\n\nGalmish maintains a SharePoint website for Site Specific Emergency Plans (SSEP) for emergency response information on individual sites.  This website is readily available for use on employee computer terminals and the emergency response plan is also conspicuously posted on bulletin boards for immediate access should an emergency response be required.  Each written SSEP has an emergency plan to de"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000048860,
      "SummaryText": "al with accidental releases of regulated substances which is in place to protect worker and public safety, as well as the environment.  The plan includes actions to be taken including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.  To ensure proper functioning, the emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within the processes that would require a modified emergency response.  In the event of an emergency, Dominion will immediately notify 911 (Wetzel County E-911 Center and Emergency Management).  The responders will coordinate emergency response activities. The emergency plan has been coordinated with the Marshall/Wetzel County Local Emergency Planning Committee (LEPC).\n\n\n\nOn May 12, 2009, Senate Bill 279, entitled Emergency Response Regulations, more commonly known as the \"Fifteen Minute Rule\" was signed into law.  The bill amends the Code of West Virginia, Chapter 131, adding new provisions that will require RMP subject industrial facilities (among others) to provide certain information to state and local emergency responders within 15 minutes of an accident or emergency.  Local emergency responders must be provided information related to public health, safety and welfare regarding hazardous waste or material releases.   \n\n\n\nAccidents and emergencies subject to these reporting requirements are unplanned events that include (but are not limited to) an explosion, a fire that cannot be contained, the release of a reportable quantity of an extremely hazardous substance (specified in 40 CFR ?302 and 40 CFR ?355), loss of life or serious injury.  In the event of a qualifying accident or emergency, the Emergency Response Plan will be enacted by notifying the Wetzel County Emergency Dispatch by telephone of the occurrence of an emergency event within 15 minutes of ascertaining the occurr"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000048860,
      "SummaryText": "ence of an emergency event.  Dominion will provide information concerning the nature and extent (as known) of the emergency event, including any information that concerns the existence or nonexistence of potential threats to public health and preliminary information (as known) regarding the type of substance involved (in a fire) or released.  Dominion will implement a communications system, as soon as practicable after providing initial notice, designed to provide timely information to appropriate state and local officials.  Upon request, Dominion will also provide appropriate state and local officials timely authorized access to any areas affected by the emergency event (provided the facility has determined such areas to be reasonably safe).\n\n\n\n6. Planned Changes to Improve Safety\n\nThe Galmish facility will continue improve safety at the facility through training.  No other upcoming events are planned to improve safety at this time."
    }
  ]
}