{
  "FacilityID": 1000064999,
  "FacilityName": "AgroChem, Inc",
  "FacilityStr1": "26 Freedom Way",
  "FacilityStr2": null,
  "FacilityCity": "Saratoga Springs",
  "FacilityState": "NY",
  "FacilityZipCode": "12866",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36091",
  "LEPC": null,
  "FacilityLatDecDegs": "43.062944",
  "FacilityLongDecDegs": "-73.834673",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 805427700,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Agrochem Inc",
  "OperatorStr1": "26 Freedom Way",
  "OperatorStr2": null,
  "OperatorCity": "Saratoga Springs",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "12866",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000236336",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-07-18 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-08-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-08-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-08-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-08-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000081535,
      "AltID": "8500 gal Formaldehyde AST",
      "FacilityID": 1000064999,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000101545,
          "ProcessID": 1000081535,
          "ChemicalID": 1,
          "Quantity": 28345.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000082777,
          "ProcessID": 1000081535,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000068631,
              "Process_NAICS_ID": 1000082777,
              "SafetyReviewDate": "2017-02-22 00:00:00",
              "PHA_Date": "2017-02-22 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-12-29 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-02-22 00:00:00",
              "TrainingReviewDate": "2017-02-22 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-02-22 00:00:00",
              "EquipmentInspectionDate": "2017-08-14 00:00:00",
              "EquipmentTested": "Daily - Chemical Bulk Storage systems",
              "ChangeMgmtDate": "2017-02-22 00:00:00",
              "ChangeMgmtReviewDate": "2017-02-22 00:00:00",
              "PreStartupReviewDate": "2017-02-22 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2017-06-01 00:00:00",
              "InvestigationChangeDate": "2017-06-01 00:00:00",
              "ParticipationPlansReviewDate": "2017-02-22 00:00:00",
              "HotWorkPermitReviewDate": "2017-02-22 00:00:00",
              "ContractorSafetyReviewDate": "2017-02-22 00:00:00",
              "ContractorSafetyEvalDate": "2017-02-22 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000084930,
                  "PreventionProgram3ID": 1000068631,
                  "ProcessChemicalID": 1000101545
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000064999,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2017-02-22 00:00:00",
    "ERTrainingDate": "2017-05-22 00:00:00",
    "CoordinatingAgencyName": "Saratoga Springs Fire Department",
    "CoordinatingAgencyPhone": "3155874570",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000064999,
      "SummaryText": "This Risk Management Plan (RMP) is for the 8,500-gallon aboveground storage tank system containing 37% formaldehyde solution at the AgroChem facility located in Saratoga Springs, New York. This RMP was prepared in accordance with the requirements of 40 CFR 68, Subpart G, and is required for all facilities that store greater than a threshold quantity of a hazardous substance regulated under 40 CFR 68.\n\n\n\nFormaldehyde solutions are classified as a toxic chemical per the OSHA and EPA standards, with a threshold quantity of 1,000 pounds and 15,000 pounds, respectively. The facility's formaldehyde storage system was expanded to include an 8,500-gallon aboveground storage tank with the result that total formaldehyde capacity is approximately 28,345 pounds. Hence, an RMP must be prepared and implemented.\n\n\n\nThe AgroChem facility has one covered process, the 8,500-gallon aboveground storage tank system containing 37% formaldehyde solution. Because the release of formaldehyde has the potential to impact offsite receptors, and because formaldehyde is subject to the OSHA Process Safety Management (PSM) Standard, 29 CFR ?1910.119, the process has been determined to be a \"Program Level 3\" process. The basic process safety management program elements for a Program 3 process are covered in detail in the \"AgroChem Process Safety Management Program\".\n\n\n\nIn addition to the PSM elements, the RMP regulations require that subject facilities evaluate the consequences of off-site releases. The scenarios used in AgroChem's consequence assessment were selected from a review of the process hazard analysis conducted in February of 2017.  A summary of the scenarios are as follows:\n\n\n\nWorst-Case Release Scenario\n\n\n\nThe worst-case release scenario at the AgroChem facility would be the catastrophic failure of the delivery truck during off-loading activities into the unloading area secondary containment system, which is 1,518 square feet in size. The maximum release quantity was conservatively est"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000064999,
      "SummaryText": "imated to be 6,000 gallons and was assumed to occur over a period of 10 minutes, resulting in a release rate of 222 gallons of formaldehyde per minute (600 gallons of 37% formaldehyde solution).  It should be noted that the formaldehyde solution is typically warm/hot during delivery at approximately 110 degrees Fahrenheit.  Using evaporation equations obtained from Chemical Process Safety: Fundamentals with Applications (1990, Daniel Crowl, Joseph Louvar), the evaporation rate of 37% formaldehyde solution over a ten-minute period from the outdoor unloading secondary containment system is 8.7 pounds of solution per minute (3.2 pounds of formaldehyde per minute).\n\n\n\nEPA allows for the effects of 'passive mitigation' on the release rate. For instance, if the release occurs inside of a building, the rate of release will be significantly attenuated. The worst-case release for AgroChem occurs outside and therefore, no passive mitigation was assumed for this release scenario. \n\n\n\nFor the worst-case release, EPA requires that a worst-case set of meteorological conditions be used to estimate the distance to the toxic endpoint.  This includes a wind speed of 1.5 meters per second and an atmospheric stability class of F (extremely stable). Under these conditions, a vapor cloud could travel the greatest distance with minimal dilution or dispersion. It also assumes uniform release rates, wind speed, and wind direction. Again, these are extremely conservative worst-case assumptions designed to assure that the worst possible scenario is addressed.\n\n\n\nThe distance to the toxic endpoint for the worst-case release scenario was calculated using the formaldehyde evaporation rate calculated and the EPA's Risk Management Program Guidance for Off-Site Consequence Analysis (EPA 550-B-99-009, March 2009) Reference Table 1, which equated to a distance of 0.6 miles. This is the farthest distance that a formaldehyde cloud could travel under the worst-case release scenario. The residential popu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000064999,
      "SummaryText": "lation within this radius of the plant was estimated to be approximately 611 (226 housing units). This figure is based on 2010 census data for Saratoga Springs within the potential release radius using the MARPLOT software.  The facility's emergency procedures for evacuation, notification and response include evaluation of wind direction. \n\n\n\nAlternative-Case Release Scenario\n\n\n\nEPA requires that owners/operators identify and analyze at least one \"alternative\" release scenario, in addition to the worst-case. This is defined as a release that is more likely to occur than the worst-case scenario and that reaches an endpoint offsite, unless no such credible scenario exists. This generally implies the need for a relatively large release rate. While there are many failure scenarios, few of these produce off-site impacts that affect populations or environmental receptors.\n\n\n\nThe \"worst-case\" alternative case scenario was determined to be a catastrophic release of formaldehyde solution from the 8,500-gallon aboveground storage tank into the secondary containment system within the building. Using evaporation equations obtained from Chemical Process Safety: Fundamentals with Applications (1990, Daniel Crowl, Joseph Louvar), the evaporation rate of 37% formaldehyde solution over a ten-minute period from a release into the indoor 8,500-gallon tank secondary containment system is approximately 11 pounds of solution per minute (4.07 pounds of formaldehyde per minute).\n\n\n\nAlternative release scenarios use a more realistic set of meteorological parameters including an atmospheric stability class of \"D\" and a wind speed of 3 meters per second. These parameters provide significantly better dispersion than the worst-case parameters.   \n\n\n\nThe calculation of the toxic endpoint for the attenuated release from the release of formaldehyde within the secondary containment system located in the building using the evaporation equations obtained from Chemical Process Safety: Fundamentals wit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000064999,
      "SummaryText": "h Applications (Daniel Crowl, 1990) and the Risk Management Program Guidance for Off-Site Consequence Analysis (EPA 550-B-99-009, March 2009) resulted in a distance to the toxic endpoint of 0.2 miles. Again, it was assumed that the temperature of the formaldehyde solution would be 110 degrees Fahrenheit.  The residential population within a 0.2-mile radius of the plant was estimated to be approximately five (5 housing units) based on 2010 census data using MARPLOT software.\n\n\n\nThe RMP is also required to contain a history of any formaldehyde-related accidents occurring over the last 5 years (no such accidents have occurred at this site) and a summary of the facility's emergency response program. \n\n\n\nAgroChem maintains a comprehensive safety program that includes emergency procedures in the event of a formaldehyde release (evacuation, notification, response, local agency coordination, and communication).   AgroChem coordinates closely with the Saratoga Springs Fire Department.  Site personnel have been trained in proper formaldehyde off-loading and handling management and have participated in process hazard reviews.\n\n"
    }
  ]
}