{
  "FacilityID": 1000077076,
  "FacilityName": "City of Bartow Water Treatment Facility",
  "FacilityStr1": "2500 Hwy 17 N.",
  "FacilityStr2": null,
  "FacilityCity": "Bartow",
  "FacilityState": "FL",
  "FacilityZipCode": "33830",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12105",
  "LEPC": "District 7 LEPC",
  "FacilityLatDecDegs": "27.925556",
  "FacilityLongDecDegs": "-081.820000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": "www.cityofbartow.net",
  "FacilityEmailAddress": "wpchief.water@cityofbartow.net",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 65909947,
  "Company2DUNS": null,
  "OperatorName": "City of Bartow",
  "OperatorStr1": "450 North Wilson",
  "OperatorStr2": "P.O. Box 1069",
  "OperatorCity": "Bartow",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33830",
  "OperatorZipCodeExt": null,
  "FTE": 11,
  "OtherEPAFacilityID": "FL6530315",
  "EPAFacilityID": "100000181974",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-06-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-05-22 07:27:15",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-22 07:27:15",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-05-22 07:27:15",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 27.925556,
  "FRS_Long": -81.82,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": null,
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000095898,
      "AltID": "Water Disinfection",
      "FacilityID": 1000077076,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120072,
          "ProcessID": 1000095898,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000097164,
          "ProcessID": 1000095898,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000081724,
              "Process_NAICS_ID": 1000097164,
              "SafetyReviewDate": "2019-01-10 00:00:00",
              "PHA_Date": "2017-04-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Human Error",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-10-18 00:00:00",
              "TrainingReviewDate": "2018-10-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-11-09 00:00:00",
              "EquipmentInspectionDate": "2010-12-06 00:00:00",
              "EquipmentTested": "Chlorine Cylinder Hoist Crane",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2018-03-07 00:00:00",
              "PreStartupReviewDate": "2002-06-14 00:00:00",
              "ComplianceAuditDate": "2017-04-18 00:00:00",
              "AuditCompletionDate": "2017-05-19 00:00:00",
              "IncidentInvestigationDate": "2004-05-05 00:00:00",
              "InvestigationChangeDate": "2004-07-30 00:00:00",
              "ParticipationPlansReviewDate": "2018-08-21 00:00:00",
              "HotWorkPermitReviewDate": "2018-08-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2018-08-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000101506,
                  "PreventionProgram3ID": 1000081724,
                  "ProcessChemicalID": 1000120072
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000077076,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-05-03 00:00:00",
    "ERTrainingDate": "2018-10-23 00:00:00",
    "CoordinatingAgencyName": "City of Bartow Fire Department",
    "CoordinatingAgencyPhone": "8635345044",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077076,
      "SummaryText": "INTRODUCTION\r\n\r\nThe City of Bartow Water Treatment Facility owned and operated by the City of Bartow is the major water treatment plant for the community.  An integral component of the treatment plant is chlorine (Cl2) used for water disinfection.  The Cl2 storage capacity of the facility is 24,000 pounds.  This inventory exceeds the 2,500-pound threshold for Cl2 set by EPA under the Risk Management Program (RMP) Rule codified at 40 CFR 68.  Pursuant to the requirements of the rule, the City of Bartow has prepared this Risk Management Program (RMP) Plan. We are proud of our environmental, health, and safety efforts and programs and our record in these areas.  The following sections outline our RMP plan.   \r\n\r\nOVERALL RESPONSIBILITY\r\n\r\nOur Chief Operator of Water has the overall responsibility for ensuring that our facility operates in a safe and reliable manner.  This responsibility includes overseeing the implementation of the elements of our risk management program.  To ensure that our risk management program is appropriately developed and implemented, our Chief Operator has assumed the role of RMP Coordinator.  The RMP Coordinator has the responsibility for the development, implementation, and integration of the EPA RMP elements.  In addition, the RMP Coordinator works closely with Operator's at the Water Treatment Facility to integrate the elements of OSHA's PSM program (where applicable) as required under Section 68.15 of the RMP rule.  \r\n\r\nThe RMP Coordinator serves as the chairman of the facility's RMP Steering Committee.  This committee comprises members with responsibilities for developing and managing specific elements of our risk management and process safety programs.  The members of this committee are assigned by the Chief Operator of Water.  Currently, the members of the RMP Steering Committee include the following: \r\n\r\n *  RMP Coordinator (Chief Operator)\r\n *  Senior Operator of the Water Treatment Facility\r\n *  Maintenance Personnel at the Water Trea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077076,
      "SummaryText": "tment Facility\r\n\r\nThe following sections identify the specific responsibilities for each aspect of our risk management and process safety management programs.\r\n\r\nHAZARD ASSESSMENTS\r\n\r\nThe Chief Operator of Water has the responsibility for (1) ensuring that offsite consequence analyses for each regulated process are consistently performed and documented in accordance with Sections 68.20 through 68.39 and (2) selecting the scenarios that will be reported in the facility Risk Management Program Plan as required under Section 68.165.  The Chief Operator of Water also is responsible for ensuring that the accident history for each covered process is appropriately documented and maintained in accordance with Section 68.42 and 68.168 of the RMP rule.\r\n\r\nThe rule requires the evaluation of a worst case scenario, even though the likelihood of the occurrence of such a scenario may be extremely small.  The worst case scenario has been defined as a catastrophic release of one entire Cl2 tank containing 2,000 pounds.  The distance to the toxic endpoint as predicted by the EPA RMP Guidance for Water Treatment Plant Reference Tables is 3.0 miles.  In addition to the worst case scenario, an alternative release scenario has been modeled employing more appropriate meteorological conditions and release assumptions.  In the alternative release scenario, 9 pounds of Cl2 per minute are assumed to be released as a result of a valve failure.  A 15-minute release would be expected in such a scenario.  Based upon these assumptions, the distance to the endpoint as predicted by the RMP Guidance is 0.33 miles (1,760 feet).  At these distances, residences may be impacted.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\n\r\nPREVENTION PROGRAMS\r\n\r\nThe RMP and PSM Coordinators have the responsibility for ensuring that the facility has an integrated, effective, and compliant prevention program that meets EPA RMP (Sections 68.65 through 68.87 of the RMP rule) and OSHA PSM requirements.  \r\n\r\nPROCESS SAFETY INFORMATION"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077076,
      "SummaryText": "The responsibility for process safety information (PSI) (Section 68.65 of the RMP rule) including the process chemical information, process technology information, and equipment information is assigned to the Chief Operator of Water.  The Chief Operator of Water has the responsibility of ensuring that all of this information is readily accessible for use.\r\n\r\nPROCESS HAZARD ANALYSIS\r\n\r\nIn accordance with Section 68.67 of the RMP rule, the Chief Operator of Water has the responsibility for ensuring that process hazard analyses (PHAs) are scheduled, conducted, and documented by the Chief Operator of Water.  The Chief Operator of Water also uses outside contractors/consultants to lead PHAs when appropriate.  The Chief Operator of Water is responsible for (1) ensuring that the information and personnel necessary to conduct PHAs are available according to the PHA implementation schedule and (2) resolving recommendations that are assigned to their respective areas.\r\n\r\nOPERATING PROCEDURES\r\n\r\nIn accordance with Section 68.69 of the RMP rule, the Chief Operator of Water has the responsibility for ensuring that complete and accurate operating procedures are in place for all regulated processes.  The Chief Operator of Water works closely with the Operator's to develop and maintain the facility's safe work practices.\r\n\r\nTRAINING\r\n\r\nIn accordance with Section 68.71 of the RMP rule, the Chief Operator of Water has the responsibility for (1) ensuring that operations employees receive and understand training applicable to their specific jobs and the associated processes and (2) documenting the training.  \r\n\r\nMECHANICAL INTEGRITY\r\n\r\nIn accordance with Section 68.73 of the RMP rule, the Chief Operator of Water has the responsibility for the overall mechanical integrity program, with specific emphasis on written procedures, maintenance training, the equipment and instrumentation inspection/test program and documentation, and equipment deficiency resolution.  The Water Treatment Fac"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000077076,
      "SummaryText": "ility also employs outside contractors and/or consultants to assist in the implementation and maintenance of the mechanical integrity program.  The Chief Operator of Water and the Maintenance Personnel work with the Operator to define and maintain appropriate quality assurance procedures for all types of equipment acquisitions/installations/repairs.\r\n\r\nMANAGEMENT OF CHANGE\r\n\r\nIn accordance with Section 68.75 of the RMP rule, the Chief Operator of Water has the responsibility for the overall management of change (MOC) program; the Chief Operator has responsibility for ensuring that the overall MOC program is effectively implemented.\r\n\r\nPRE-STARTUP REVIEW\r\n\r\nIn accordance with Section 68.77 of the RMP rule, the Chief Operator of Water has the responsibility for the overall pre-startup review program, which is closely related to the MOC program. However, the Chief Operator of Water has the primary responsibility for ensuring that this program is effectively implemented before affected operations begin.\r\n\r\nCOMPLIANCE AUDITS\r\n\r\nIn accordance with Section 68.79 of the RMP rule, the Chief Operator of Water has the responsibility for ensuring that compliance audits regularly occur (and are documented) to verify that the prevention program is working and meets EPA/OSHA requirements.  The Chief Operator of Water has responsibility for resolving any identified deficiency at the Water Treatment Facility.\r\n\r\nINCIDENT INVESTIGATION\r\n\r\nIn accordance with Section 68.81 of the RMP rule, the Chief Operator of Water has the responsibility for designing and managing the incident investigation program, including tracking resolution of investigation findings and recommendations.  The Chief Operator of Water also has the responsibility of ensuring that only trained personnel lead our investigations.  The Chief Operator of Water has responsibility for ensuring that all incidents in his areas are reported and investigated, and the investigations findings are resolved, documented, and commun"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000077076,
      "SummaryText": "icated to affected personnel.\r\n\r\nEMPLOYEE PARTICIPATION\r\n\r\nIn accordance with Section 68.83 of the RMP rule, the Chief Operator of Water has the responsibility of involving employees in the planning and implementation of the facility's prevention program elements.\r\n\r\nHOT WORK PERMITS\r\n\r\nIn accordance with Section 68.85 of the RMP rule, the Chief Operator of Water,has the responsibility of developing and maintaining the facility's hot work permit program.\r\n\r\nCONTRACTORS\r\n\r\nIn accordance with Section 68.87 of the RMP rule, the Chief Operator of Water has the overall responsibility for the contractor program.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nIn accordance with Sections 68.90 and 68.95 of the RMP rule, the Chief Operator of Water is responsible for (1) designing, implementing, and maintaining the facility's emergency response plan, (2) ensuring that all associated training is conducted and documented as necessary, (3) coordinating the site emergency response plan with the community emergency response plan, and (4) responding to local emergency planners/responders when questions arise.\r\n \r\nRMPLAN PREPARATION AND SUBMISSION\r\n\r\nThe Chief Operator of Water is responsible for preparing and submitting the Risk Management Program Plan for the facility as required under Sections 68.150 through 68.185 of the RMP rule.\r\n\r\nRMPLAN COMMUNICATION\r\n\r\nThe Chief Operator of Water has the responsibility of providing Risk Management Program Plan information (other than the required EPA submission) to employees and the public as required under Section 68.210 of the RMP rule."
    }
  ]
}