{
  "FacilityID": 1000006599,
  "FacilityName": "Beckley Water Company (Glade Creek Plant)",
  "FacilityStr1": "1006 Pluto Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Shady Spring",
  "FacilityState": "WV",
  "FacilityZipCode": "25918",
  "Facility4DigitZipExt": "8023",
  "FacilityCountyFIPS": "54081",
  "LEPC": "Raleigh County LEPC",
  "FacilityLatDecDegs": "37.703278",
  "FacilityLongDecDegs": "-081.050639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "NE",
  "FacilityURL": "www.beckleywater.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Beckley Water Company",
  "OperatorStr1": "P.O. Box 2400",
  "OperatorStr2": null,
  "OperatorCity": "Beckley",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "25802",
  "OperatorZipCodeExt": "2400",
  "RMPContact": "Matt Stanley",
  "RMPTitle": "President",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000109125",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-10-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-07-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.70328,
  "FRS_Long": -81.05064,
  "FRS_Description": "NE CORNER OF LAND PARCEL",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000007763,
      "AltID": "Water Treatment",
      "FacilityID": 1000006599,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000007910,
          "ProcessID": 1000007763,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008687,
          "ProcessID": 1000007763,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508687,
          "ProcessID": 1000007763,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000006599,
      "SummaryText": "The Beckley Water Company water treatment system utilizes chlorine gas for disinfection purposes.  The facility utilized one-ton cylinders of chlorine gas which are received at the facility every two months with six cylinders delivered at any one time.  Up to eight cylinders are maintained on-site at any one time.  All cylinders are stored inside the water treatment plant chlorine cylinder storage building.  The process utilizes two cylinders on-line at any one time.  The transfer system allows the second cylinder to go on-line as soon as the chlorine from the first cylinder has been totally utilized.  The average chlorine usage rate at this facility is 250 to 500 pounds per day.  The Beckley Water Company water system utilizes a Wallace and Tiernan (WT) chlorinator system.  This system operates such that the chlorine transfer from the cylinder to the chlorinators is under vacuum versus pressure.  This type of arrangement provides for minimal potential for leaks of chlorine through the piping.  The only section of the system which is not under vacuum is the piping from the cylinder valves to the cylinder manifold which is under pressure.  The facility has a preventive maintenance program which is designed to maintain the equipment that handles chlorine gas in a good operating mode. Chlorine cylinders are received from the vendor and the transfer of the cylinders from the truck to the chlorine storage building is always performed during daylight hours, and is attended by the truck driver and a Beckley Water Company water treatment plant operator.  The Beckley Water Company's Glade Creek Plant is manned by one employee for twenty-four hours per day.  There are two chlorine sensor systems located at the facility.  These sensors are designed to detect any chlorine release within either the chlorine cylinder storage area or the chlorinator room.  Both the chlorinator room and chlorine storage building are designed with exhaust fans that are automatically started if a chl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000006599,
      "SummaryText": "orine release is identified by either of the sensors.\n\n\n\nThe alternative scenario identified for this facility would be for failure of the piping which connects to the cylinder.  If this piping and related regulator valve failed, a maximum of 50 pounds per hour of chlorine gas could be released from one cylinder.\n\n\n\nEMERGENCY RESPONSE PROCEDURES\n\n\n\nIn the event of a severe chlorine release, the Beckley Water Company employees are instructed to call 911 and request assistance from the Ghent Volunteer Fire Department.  The Ghent Volunteer Fire Department personnel can respond within 10 minutes and have the adequate personal protective equipment to isolate valves in the event of such an incident.  Regarding lower volume incidents involving minor leaks, the Beckley Water Company has a contract with C.I. Thornburg, the supplier of chlorine cylinders to the facility, provides emergency response to any chlorine releases.  The C.I. Thornburg personnel can be on-site within 2 hours of notification.  Once the chlorine usage area has been adequately ventilated and the release of chlorine stopped, Beckley Water Company personnel will enter into the area to perform any necessary repair work.  Beckley Water Company personnel will enter into the chlorine usage area in the event of an alarm situation to assess the condition and perform minor emergency response.  The facility is covered under a general emergency response plan implemented by the Raleigh County Local Emergency Planning Committee.  The facility also has an emergency response plan for evacuation of employees and performance of critical operations in the event of an emergency.\n\n\n\nTRAINING\n\n\n\nOne (1) employee of the Beckley Water Company received chlorine awareness training from C.I. Thornburg, the supplier of the chlorine cylinders.  This training was performed in order to insure that personnel understand the hazards of dealing with chlorine gas and are familiar with the routine tasks associated with their jobs, as well "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000006599,
      "SummaryText": "as the emergency response procedures necessary to be followed in the event of a chlorine release.  The supplier of chlorine cylinders may change on an annual basis.  Any such change will result in modification of this section of the risk management plan to insure that the current supplier is listed.\n\n\n\nAFFECTED AREA\n\n\n\nIn the event of a catastrophic release of chlorine gas, one school, one recreational area, several businesses and private residences would be affected.  For an alternative scenario release, one recreational area and several private residences would be affected.\n\n"
    }
  ]
}