{
  "FacilityID": 1000024940,
  "FacilityName": "Custom Food Products LLC",
  "FacilityStr1": "59 Custom Food Drive",
  "FacilityStr2": null,
  "FacilityCity": "Owingsville",
  "FacilityState": "KY",
  "FacilityZipCode": "40360",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21011",
  "LEPC": "Bath County LEPC",
  "FacilityLatDecDegs": "38.127065",
  "FacilityLongDecDegs": "-83.772046",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "CTI Foods",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Custom Food Products, LLC",
  "OperatorStr1": "59 Custom Food Drive",
  "OperatorStr2": null,
  "OperatorCity": "Owingsville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40360",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tony Walker",
  "RMPTitle": "Plant Manager",
  "FTE": 140,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000212227",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-11-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-08-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-12-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-12-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-12-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "0",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000030572,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000024940,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000031087,
          "ProcessID": 1000030572,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000036925,
          "ProcessID": 1000030572,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000536925,
          "ProcessID": 1000030572,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024940,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies:\n\n\n\nWe at Custom Food Products, LLC are committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as the design, installation, operating procedures, maintenance, and employee training associated with the ammonia refrigeration system at our facility.  It is our policy to implement appropriate control measures to prevent possible releases of anhydrous ammonia.  Unforseeable, if such a release does occur, our highly trained employees are available to control and mitigate the effects of the release.  We are also completely coordinated with the Owingsville Fire Department, who provides our emergency response services.\n\n\n\n2. The Stationary Source and the Regulated Substances Handles:\n\n\n\nWe have one RMP regulated chemical at our facility.  The chemical is Anhydrous Ammonia.  The maximum intended inventory of Anhydrous Ammonia that is expected to be at the facility for the ammonia refrigeration system is 15,422.5 pounds.\n\n\n\n3. The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps:\n\n\n\nOur facility has taken the following steps as required by 40 CFR Part 68 of the Environmental Protection Agency (EPA).  Our Anhydrous Ammonia refrigeration system is also regulated by 29 CFR 1910.119 of the Occupational Safety & Health Administration (OSHA).  Our facility is also regulated by the Emergency Planning and Community Right to Know Act (EPCRA) and is subject to the Section 302 reporting requirements.\n\n\n\nProcess Safety Information:\n\n\n\nOur facility conducts comprehensive analyses to ensure that hazards associated with our Anhydrous Ammonia refrigeration system are identified and controlled efficiently.  The methodology used to complete these analyses is the What-If Checklist.  These analyses are completed by a team of qualified personnel with expertise in engineering and p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024940,
      "SummaryText": "rocess operations and are revalidated at a regular interval of every 5 years.\n\n\n\nOperating Procedures:\n\n\n\nCustom Food Products, LLC maintains written operating procedures.  These procedures address various modes of operation such as initial start-up, normal operations, temporary operations, emergency shutdown, emergency procedures, normal shutdown and start-up after a turnaround.  the information is regularly reviewed and is readily accessible to operators and maintenance personnel involved in the process.\n\n\n\nTraining:\n\n\n\nCustom Food Products, LLC has a comprehensive training program in place to ensure that employees who operate and/or maintain the ammonia refrigeration system are competent.  New employees receive basic classroom training in process operations and maintenance, followed by on-the-job training and supervision until they are qualified to work independently.  Safety refresher training is provided annually and operation and maintenance training is provided at least every three years.\n\n\n\nMechanical Integrity:\n\n\n\nCustom food Products, LLC completes maintenance inspections and testing of ammonia refrigeration system equipment to maintain safety and mechanical integrity.  The equipment included in the inspections and tests includes pressure vessels, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Trained and certified personnel complete maintenance operations as required by the equipment manufacturers and the Company.  Should the inspections and tests indicate indicate equipment deficiencies, the equipment is repaired as soon as possible.\n\n\n\nManagement of Change:\n\n\n\nWritten procedures are in place at Custom Food Products, LLC to manage change in process chemicals, technology, equipment and processes other than replacement in kind.  Operators, maintenance personnel and contractors are trained and determined to be qualified before operating or maintaining new or modified equipment subject to Management of Change.\n\n\n\nPr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024940,
      "SummaryText": "e-Startup Safety Review:\n\n\n\nPre-startup safety reviews related to new ammonia refrigeration systems or to modifications made to existing ammonia refrigeration systems are completed consistently at Custom Food Products, LLC.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are safe prior to placing the equipment in operation.\n\n\n\nCompliance Audits:\n\n\n\nCustom Food Products, LLC conducts compliance audits at least every three years to ensure that the mandatory RMP requirements are being consistently implemented.\n\n\n\nIncident Investigation:\n\n\n\nCustom Food Products, LLC promptly investigates all accidents and incidents (near misses) involving the accidental release of anhydrous ammonia.  These investigations are conducted to identify the surface and root causes of the accident or incident as well as all corrective actions necessary to prevent a recurrence.  All accident and incident reports are kept for a minimum of 5 years.\n\n\n\nEmployee Participation:\n\n\n\nCustom Food Products, LLC believes that accident and incident prevention result from a team effort.  Company employees are strongly urged to express their opinions concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP regulation, including information resulting the process hazard analyses, in particular.\n\n\n\nContractors:\n\n\n\nOn occasion, Custom Food Products, LLC hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough review of the contractor's safety performance is completed.\n\nCustom Food Products, LLC has a strict policy of informing contractors of known hazards regarding the design, installation, maintenance or operation of the ammonia refrigeration system.  Contractors are also informed of al the procedures for emergency notification and evacuation, should an acc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024940,
      "SummaryText": "ident release of Anhydrous Ammonia occur.\n\n\n\n5-Year Accident History:\n\n\n\nThere have been no reported accidents or incidents at the Custom Food Products, LLC facility during the past 5 years.\n\n\n\nEmergency Response Plan:\n\n\n\nCustom Food Products, LLC in included in the community emergency response plan.  The facility also has it's own emergency response plan.  The emergency response plan includes specific actions to be taken in response to accidental releases of Anhydrous Ammonia.  The emergency response plan includes procedures for informing the public and local response agencies in the event of an Anhydrous Ammonia release.  The emergency response plan also includes information regarding emergency health care.\n\n\n\nThe date of the most recent review or update of the emergency response plan: November 17, 2011\n\n\n\nThe date of the most recent emergency response training of employees: November 16, 2011\n\n\n\nThe Owingsville Fire Department is the coordinating agency for our emergency response plan.  Their non-emergency phone number is: \n\n\n\nPlanned Changes to Improve Safety:\n\n\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental anhydrous ammonia release prevention program.  We will continue our annual planning and training site visits with the Owingsville Fire Department and emergency notification, evacuation and employee accountability training and drills in the future.     \n\n\n\n\n\n             \n\n\n\n             "
    }
  ]
}