{
  "FacilityID": 1000014287,
  "FacilityName": "Lufkin Gas Plant",
  "FacilityStr1": "4818 Perdue Hill Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Frisco City",
  "FacilityState": "AL",
  "FacilityZipCode": "36445",
  "Facility4DigitZipExt": "3220",
  "FacilityCountyFIPS": "01099",
  "LEPC": "Monroe County LEPC",
  "FacilityLatDecDegs": "31.458056",
  "FacilityLongDecDegs": "-087.422222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Hilcorp Energy Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Hilcorp Energy Corporation",
  "OperatorStr1": "4818 Perdue Hill Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Frisco City",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36445",
  "OperatorZipCodeExt": "3220",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000170067",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-12-12 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-05-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-05-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-05-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-07-18 00:00:00",
  "DeRegistrationEffectiveDate": "2013-06-26 00:00:00",
  "AnniversaryDate": "2015-05-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 31.456835,
  "FRS_Long": -87.420434,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Redesignation of NAICS to 486210 and SIC 4922 from NAICS 211112 and SIC 1321.",
  "_processes": [
    {
      "ProcessID": 1000017863,
      "AltID": "NGL Extraction",
      "FacilityID": 1000014287,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021196,
          "ProcessID": 1000017863,
          "ChemicalID": 155,
          "Quantity": 92600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 98944,
              "ProcessChemicalID": 1000021196,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 98945,
              "ProcessChemicalID": 1000021196,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 98946,
              "ProcessChemicalID": 1000021196,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 98947,
              "ProcessChemicalID": 1000021196,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 98948,
              "ProcessChemicalID": 1000021196,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 98949,
              "ProcessChemicalID": 1000021196,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000018195,
          "ProcessID": 1000017863,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000012413,
              "Process_NAICS_ID": 1000018195,
              "SafetyReviewDate": "2010-05-25 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "Yes",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2009-04-01 00:00:00",
              "ChangeCompletionDate": "2010-12-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-01-13 00:00:00",
              "TrainingReviewDate": "2010-05-25 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-04-15 00:00:00",
              "EquipmentInspectionDate": "2010-04-15 00:00:00",
              "EquipmentTested": "Monthly visual inspection of all equipment; Engines and compressors serviced",
              "ComplianceAuditDate": "2007-07-20 00:00:00",
              "AuditCompletionDate": "2010-09-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000012717,
                  "PreventionProgram2ID": 1000012413,
                  "ProcessChemicalID": 1000021196
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000014287,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-05-25 00:00:00",
    "ERTrainingDate": "2010-03-05 00:00:00",
    "CoordinatingAgencyName": "Frisco City Fire Department",
    "CoordinatingAgencyPhone": "2512673118",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014287,
      "SummaryText": "EXECUTIVE SUMMARY\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Hilcorp Energy Company Lufkin Natural Gas Processing Plant has a long-standing commitment to workers and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our production equipment and operation.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, gas plant trained personnel will respond to control and contain the release.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Lufkin Plant, located near Frisco City, Alabama, operates a variety of processes to produce petroleum products (e.g., natural gas and natural gasoline) from natural gas.  Regulated flammables at the Lufkin Natural Gas Processing Plant include natural gasoline.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the plant and the management system in place to implement the accident prevention program.  It is our policy, at the Lufkin Plant, to adhere to all Federal, State and Local laws.  If an emergency were to occur, it is part of our training and a company policy to notify the Frisco City Volunteer Fire Department and the Monroe County Emergency Management Agency.\n\nEmployee Participation\n\nThe Lufkin Plant encourages employees to participate in all facets of accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the gas plant accident prevention program.  Specific ways that employees can be involved in the accident prevention program are documented in the facility Risk Management Plan that"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014287,
      "SummaryText": "is maintained at the gas plant and addresses each accident prevention program element.\n\nProcess Safety Information\n\nThe Lufkin Plant keeps a variety of technical documents that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information.  Specific individuals within the gas plant are assigned responsibility for maintaining up-to-date process safety information.  A table summarizing the reference documents and their location is readily available as part of the written Risk Management Plan to help employees locate any necessary process safety information.  Chemical specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDS's).  This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.\n\nThe gas plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings and electrical rating of equipment.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure the safety features in the process are not compromised.\n\nOperating Procedures\n\nThe Lufkin Plant maintains written procedures that address various modes of process operation, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These procedures can be used as a reference by experienced operators and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014287,
      "SummaryText": "provide a basis for consistent training of new operators.  These procedures are periodically reviewed through Job Safety Analysis (JSA) program by two or more operators to analyze tasks, to identify possible hazards, to ensure safeguards are in place and follow through with recommendations and modification to improve job safety.  Standard Operating Procedures (SOP) are certified as current and accurate annually.  The procedures are also kept current and accurate by revising them as necessary to reflect changes made through the management of change process.  Upper and lower operating limits and consequence of deviation and how to correct deviations on most of the critical equipment, most particularly the fractionation section, are incorporated in the written standard operating procedures.  This information is readily available to operators in the process unit and for other personnel to use as necessary to safely perform their tasks. \n\nTraining\n\nTo complement the written procedures for process operations, the Lufkin Plant has implemented a refresher training program for all employees involved in operating a process.  New employees receive basic training in gas plant operations if they are not already familiar with such operations.  After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks.  After operators demonstrate (e.g., through oral tests, skills demonstration and observation) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently.  In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted every year.  All of this training is documented for each operator, including the means used to verify that the operator understood the training.\n\nContractors\n\nThe Lufkin Plant uses cont"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014287,
      "SummaryText": "ractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the gas plant has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform gas plant personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work and the issuance of work permits that include general work permit, confined space entry permit and hot work permit for any welding work.  In addition, the Lufkin Plant evaluates contractor safety programs and performance during the selection of a contractor.  Gas plant personnel monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\nPre-Startup Safety Reviews (PSSRs)\n\nThe Lufkin Plant conducts a PSSR for any new unit or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\nMechanical Integrity\n\nThe Lufkin Plant ha"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000014287,
      "SummaryText": "s well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of the program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.  Another integral part of the mechanical integrity program is quality assurance.  The Lufkin Plant incorporates quality assurance measures into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\nSafe Work Practices\n\nThe Lufkin Plant has long-standing safe work practices in place to help ensure worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure i"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000014287,
      "SummaryText": "solation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\nManagement of Change\n\nThe Lufkin Plant has a comprehensive system to manage changes to all covered processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards, (2) verify that existing controls have not been comprised by the change and (3) ensure the change is communicated to affected personnel.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.\n\nIncident Investigation\n\nThe Lufkin Plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, significant toxic gas release, major property damage, significant environmental damage, or personal injury.  The goal of each investigation is to determine the root cause and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to gas plant management for resolution.  Corrective actions taken in response to"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000014287,
      "SummaryText": "the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees, (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least five 5 years.\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, the Lufkin Plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Both hourly and staff personnel participate as audit team members.  The audit team develops findings that are forwarded to gas plant management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe processes at the Hilcorp Energy Company Lufkin Natural Gas Processing Plant have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.  All chemicals newly introduced to the Hilcorp Energy Company Lufkin Natural Gas Processing Plant have to have MOC document, Product Acceptance certification approved by the Facilities Engineer, Environmental Safety Specialist and the Operations Supervisor.  All chemicals delivered to the facility must be accompanied by a Material Safety Data Sheet (MSDS).  Chemical truck drivers are required to follow Plant Entry Procedures which involve signing of the Sign In/Sign Out log and safety orientation overview training.  The Operator on duty has to check the area with gas detectors before letting the truck into the Gas Plant.  The Operator has to supervise the driver d"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000014287,
      "SummaryText": "uring the unloading process to ensure that chemical will go to right storage or container.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Lufkin Plant has an excellent record of accident prevention over the past five years.  There have been no off-site accidents within this time period.\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Lufkin Plant maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements.  In addition, the plant has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to the Hilcorp Energy Company Lufkin Natural Gas Processing Plant processes or other third party facilities that may affect the operations at the gas plant.  The emergency response program changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes.\n\nThe overall emergency response program for the Lufkin Plant is coordinated with the Frisco City Volunteer Fire Department.  This coordination includes periodic meetings, which includes local emergency response officials and industry representatives.  The facility has around-the-clock communicati"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000014287,
      "SummaryText": "ons capability with appropriate Public Safety officials and/or emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, we well as facilitating quick response to an incident.  In addition, the gas plant operators are given annual refresher training for emergency response regarding the hazards of regulated substances in the gas plant.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Lufkin Plant resolves all findings from PHA's, some of which may result in modifications to the process.  At the current time, no changes are planned over the foreseeable future.\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\nAn Off-site Consequence Analysis (OCA) was conducted for the mixture of NGLs stored in the 42,000 gal bullet tank at the site.  Since this mixture is a National Fire Protection Association (NFPA)-4 flammable mixture, it is required to be evaluated.\n\nWorst case scenario - defined as the release of the largest quantity from a single vessel or process line, taking into account administrative controls limiting the quantity.  \n\nThe result of the worst case scenario also determines which Program level (1, 2, or 3) is required for the RMP plan.  The worst case scenario was based on the following information:\n\n- Maximum quantity in the bullet tank - 20,000 gal (93,000 lb); based on information supplied by Hilcorp \n- Density of mixture Â¿ 4.629 lb/gal, obtained from the liquid analysis from Southern Flow \n- Component Wt percents obtained from liquid analysis \n- Type of scenario Â¿ Vapor Cloud Explosion \n- Quantities for each component in 20,000 gal calculated as follows:\n\n\t\tWorst Case\nChemical\twt %\tlb\n\nEthane\t        6%\t5,260\nPropane\t        32%\t29,457\nIsobutane\t15%\t13,677\nButane\t        27%\t25,249\nIsopentane\t9%\t8,416\nPentane\t        11%\t10,520\n\nThe distance to the endpoint was estimated to be 0.4 miles.  Since, based on the aerial photos available on line, the estimated distance to the nearest residences are 0.18 miles to"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000014287,
      "SummaryText": "the southeast and 0.12 miles to the southwest, the results indicate that there are public receptors within the distance to endpoint.  Based on these results, the facility is not eligible for Program 1, but Program 3 is not required, since the facility is not subject to OSHA Process Safety Management.  Therefore, the facility is eligible for Program 2.  This requires modeling of an alternative (more likely) release scenario, in addition to the worst case scenario.  \n\n\nAlternative Scenario - based on the following:\n\n- Quantity released, based on 10,000 gal (46,000 lb) (information supplied by Hilcorp) and the flammable part of the vapor cloud (QF) calculated as follows(from RMP Guidance for Offsite Consequence Analysis, EPA 550-B-99-009, Section 10.4):\n  QF = Flash Fraction Factor (FFF) x 46,000 lb x 2\n     = 17,000 lb (rounded to 2 significant figures)\n  FFF for Butane/Isobutane (avg) = 0.19\n- Cannot model mixture in alternative scenario in RMPComp, so used ethane as the representative component \n- Type of scenario Â¿ Vapor Cloud Explosion \n- Release rate 1,400 lb/min; Duration 10 min \n\nThe distance to the endpoint was estimated to be 0.1 miles. Based on the aerial maps available and our interpretation of the maps, there are public receptors within the distance to endpoint."
    }
  ]
}