{
  "FacilityID": 1000042176,
  "FacilityName": "Permviro Systems, Inc.",
  "FacilityStr1": "3520 Trotter Drive",
  "FacilityStr2": null,
  "FacilityCity": "Alpharetta",
  "FacilityState": "GA",
  "FacilityZipCode": "30004",
  "Facility4DigitZipExt": "7701",
  "FacilityCountyFIPS": "13117",
  "LEPC": null,
  "FacilityLatDecDegs": "34.127389",
  "FacilityLongDecDegs": "-084.230111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "permviro@bellsouth.net",
  "FacilityDUNS": 361107048,
  "ParentCompanyName": "Not Applicable",
  "Company2Name": "Not Applicable",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Permviro Systems, Inc.",
  "OperatorStr1": "3520 Trotter Drive",
  "OperatorStr2": null,
  "OperatorCity": "Alpharetta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30004",
  "OperatorZipCodeExt": "7701",
  "FTE": 3,
  "OtherEPAFacilityID": "Not applicable",
  "EPAFacilityID": "100000013932",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-02-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-05-05 17:37:33",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-05-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.127389,
  "FRS_Long": -84.230111,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051967,
      "AltID": "Repackaging ethylene gas",
      "FacilityID": 1000042176,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000063036,
          "ProcessID": 1000051967,
          "ChemicalID": 95,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000052582,
          "ProcessID": 1000051967,
          "NAICSCode": "32532",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000042176,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-03-09 00:00:00",
    "ERTrainingDate": "2016-03-09 00:00:00",
    "CoordinatingAgencyName": "Forsyth County Fire Department",
    "CoordinatingAgencyPhone": "7707812180",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042176,
      "SummaryText": "regulations.  In addition, PSI is registered with Chemtrec which provides 24 hour assistance in the event of an accident.  Chemtrec provides a toll-free number with the United States and Canada(1-800-424-9300).\r\n\r\nThe Forsyth County fire station is located within 2/10 of a mile from PSI's plant.   A security system has been installed on the perimeter of PSI's building to discourage/prevent unauthorized entry into PSI's office/warehouse.\r\n\r\nPSI is also registered with the U.S. DOT's Hazardous Registration Program."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042176,
      "SummaryText": "Ethylene is transported to Permviro Systems, Inc.'s plant in a tube trailer.  This trailer is leased from Airgas Specialty Gases of Houston, Texas.  This trailer consists of 8 independent  tubes with each tube containing up to 1,750 lbs. of ethylene gas.  These tubes are individually valved into a manifold with a master valve to which PSI personnel make the plant connection.  One or more tubes can be opened to the manifold at one time.  We engage the services of Airgas to transport the tube trailer to and from Houston, Texas.  A trailer is at our plant (on-site) approximately eight weeks per calendar year.  PSI will receive approximately 12-14,000 lbs. per shipment two to three times per year.  Upon receipt of ethylene in this tube trailer PSI personnel attach its filling line to the trailer and proceed to off-load and repackage ethylene into cylinders.  These cylinders are as follows:\r\n\r\nMaterial of contruction:                                  Valves:                         Net contents:\r\n\r\n\r\nAluminum                                                    Brass 350A                   10 lbs.\r\nSteel                                                           Brass 350A                   38 lbs.\r\n\r\nCylinders are filled by pressure differential as long as possible and then when necessary an air driven pump is employed.  Generally the tube trailer is emptied into these individual cylinders within 1 week of delivery to the plant.  As a result, the tube trailer has in excess of 10,000 lbs of ethylene no more than a few hours (approximately 16 hours) during each calendar year while situated on PSI premises.  During the repackaging process, each line fitting, valve and safety relief is soap-tested on each and every cylinder attachment in order to detect even the smallest possible leak. All cylinders owned by PSI have the appropriate safety-relief valves.\r\n\r\nAll of PSI's cylinders are hydrostatically tested pursuant to the appropriate DOT regulations every 5 years.  These cylin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042176,
      "SummaryText": "ders are tested by West Georgia Fire Extinguisher, Inc., Carrollton, Georgia.  Log sheets are maintained for each cylinder retested.  Each cylinder retested is individually stamped with date of retest.\r\n\r\nAfter completion of cylinder filling, each cylinder is closed and test-weighed.  Each cylinder is soap-tested around the valve to detect minute leaks.  A dust cap is applied to the threaded outlet of each cylinder and the valve cap is screwed on.  Cylinders are immediately placed on specially designed pallets where they are strapped and shrink-wrapped to assure safety and stability.  Full cylinders are stored outside within a securely fenced area directly behind PSI's warehouse.  Empty and full cylinders are labeled and clearly segregated throughout the year.\r\n\r\nA minimum of two owner-managers are always present during the repackaging/filling operation.  All three owner-managers have over thirty years experience in this operation.  The filling operation is carried out in an open-air secured area with a roof covering.   When PSI's facility was built in 1993, PSI installed an eight-foot high security fence enclosing the outside filling area. The warehouse and plant is entirely a non-smoking area.  None of the owners of PSI are smokers.  All appropriate areas are equipped with fire extinguishers.  Signage and placards prohibiting any visitors from smoking are posted throughout the plant.\r\n\r\nIn PSI's over thirty years of repackaging/filling ethylene cylinders it has never experienced a spill of any kind aside from minor valve or attachment leakage.  A leak of this type might result in a tenth of a pound of ethylene to escape into the atmosphere.  Ethylene has been classified by the EPA as a biopesticide and aside from its flammable properties (only in high concentrations) is considered to be a very safe gas.\r\n\r\n Safety Data Sheets, Emergency Response Guidebooks and Flammable gas placards are provided to the Carrier/Driver with each shipment of ethylene pursuant to DOT"
    }
  ]
}