{
  "FacilityID": 1000008113,
  "FacilityName": "Quality Refrigerated Services",
  "FacilityStr1": "225 West 21st Street",
  "FacilityStr2": null,
  "FacilityCity": "Spencer",
  "FacilityState": "IA",
  "FacilityZipCode": "51301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19041",
  "LEPC": "Clay County LEPC",
  "FacilityLatDecDegs": "43.145107",
  "FacilityLongDecDegs": "-095.145690",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "mlamundson@aol.com",
  "FacilityDUNS": 609729843,
  "ParentCompanyName": "Quality Refrigerated Services",
  "Company2Name": null,
  "CompanyDUNS": 609661509,
  "Company2DUNS": null,
  "OperatorName": "Quality Refrigerated Services",
  "OperatorStr1": "3301 G Street",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68107",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": "IA0000330662",
  "EPAFacilityID": "100000124171",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-07-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.15935,
  "FRS_Long": -95.14805,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009361,
      "AltID": null,
      "FacilityID": 1000008113,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000010590,
          "ProcessID": 1000009361,
          "ChemicalID": 56,
          "Quantity": 10700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000009642,
          "ProcessID": 1000009361,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000007671,
              "Process_NAICS_ID": 1000009642,
              "SafetyReviewDate": "2009-06-15 00:00:00",
              "PHA_Date": "2004-07-14 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2005-07-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-06-15 00:00:00",
              "TrainingReviewDate": "2009-06-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-06-15 00:00:00",
              "EquipmentInspectionDate": "2009-06-04 00:00:00",
              "EquipmentTested": "condenser",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-06-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2009-06-15 00:00:00",
              "AuditCompletionDate": "2009-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-06-15 00:00:00",
              "HotWorkPermitReviewDate": "2009-06-15 00:00:00",
              "ContractorSafetyReviewDate": "2009-06-04 00:00:00",
              "ContractorSafetyEvalDate": "2009-06-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000008799,
                  "PreventionProgram3ID": 1000007671,
                  "ProcessChemicalID": 1000010590
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000008113,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-06-15 00:00:00",
    "ERTrainingDate": "2008-11-21 00:00:00",
    "CoordinatingAgencyName": "Clay County LEPC",
    "CoordinatingAgencyPhone": "7122621019",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008113,
      "SummaryText": "requirements.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nQuality Refrigerated Services maintains a detailed record of safety informaion that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What IF/Checklist.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and arerevalidated at a regular interval of (five years or when changes dictate).  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Quality Refrigerated Services maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nQuality Refrigerated Services has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at lease every three years and more frequently as needed.  All training will be documented and validated by employee in the QRS Training Tracking System.\n\nMechanical Integrity\nQuality Refrigerated Services carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage ta"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008113,
      "SummaryText": "nks, piping systems, relief systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Futhermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Quality Refrigerated Services to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Quality Refrigerated Services.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nQuality Refrigerated Services conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nQuality Refrigerated Services promptly investigates any incident that has resulted in , or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nQuality Refrigerated Services truly believes that process safety management and accident prevention is a team effort."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008113,
      "SummaryText": "1. Accidental Release Prevention And Emergency Response Policies\n\nWe at Quality Refrigerated Services are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to Implement appropriate controls to prevent possible releases of regulated substances.  If such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with the Clay County LEPC and Spencer City Fire Department, which provide additional emergency response expertise.\n\n2 The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass refrigerated storage and handling of meat products.  The plant is located at 225 W 21 street in Spencer, Iowa.  We have one RMP-regulated substance, Ammonia, at our facility, which is used to provide refrigeration for the meat containing areas.  The maximum inventory of Ammonia at our facility is approximately 10,500 lb.\n\n3 The Worst Case Release Scenario and the Alternative Release Scenarios, including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nTo perform the required offsite consequence analysis for our facility, we have used the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance and EPA Model RMP for Ammonia Refrigeration.  The following paragraphs provide details of the chosen scenarios.\n\nConsequence modeling was conducted to determine the release distances from the site.\n\nFor the worst case scenario at this facility, the vessel containing the largest amount of ammonia (the High Pressure Receiver) with a maximum inventory, limited by administrative cont"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008113,
      "SummaryText": "rols (written operating procedures), of 4,451 pounds was assumed to have released its contents over a 10-minute period.  Release distances were calculated using Class F atmospheric stabvility and 1.5 m/s windspeed, and toxic endpoint of 0.14 mg/L.  Results for the WCS were modeled using EPA's RMP-Comp based on a toxic gas release that has been liquefied under pressure, and is located in an enclosed space.  The vessel is located in an enclosed area, the receiver building.  The walls of the receiver building are considered passive mitigation, and reduce the release rate to the atmosphere outside the building.  For a release of a toxic gas in an enclosed space, RMP-Comp assumes that the rate of release to the atmosphere is 55% of the release rate if the release were happening outdoors.\n\nThe alternative scenario consists of an ammonia release from a hose leak during ammonia receiver filling operations.  The diameter of the rupture in the hose is 0.50 inches.  The scenario involves a release rate of 463 lbs./minute.  In the event of an actual release, it is expected that an operator would intervene to stop the release within a 10-minute period.  EPA permits the alternative release scenarios to allow the facility to account for administrative controls and mitigation systems that could be used in case of an emergency.  To limit the duration of the release, plant personnel would make use of the following controls and mitigation systems: \nOperator detection of an ammonia release\nUse of manual isolation valves within 10 minutes of leak detection\nEmergency Response capability\n\n4 The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps \nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The ammonia refrigeration system is also subject to the OSHA PSM standard under 29 CFR 1910.119.  Our facility is also subject to EPCRA Section 302 notification"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000008113,
      "SummaryText": "Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all informaion created as part of the facility's implementation of the RMP rule, including informaiton resulting from process hazard analysis in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Quality Refrigerated Servies has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5 Five-year Accident History\nQuality Refrigerated Services has had a good record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, no reportable incidents have occurred in the last 5 years through 06/15/2008.\n\n6 Emergency Response Plan\nQuality Refrigerated Services carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure porper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nThe Spencer facility coordinates its emergency response plan with the Clay County LEPC."
    }
  ]
}