{
  "FacilityID": 1000043654,
  "FacilityName": "City of Tarpon Springs Wastewater Facility",
  "FacilityStr1": "201 East Pine Street",
  "FacilityStr2": null,
  "FacilityCity": "Tarpon Springs",
  "FacilityState": "FL",
  "FacilityZipCode": "34689",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12103",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "28.090600",
  "FacilityLongDecDegs": "-82.7544841",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 96598040,
  "ParentCompanyName": "City of Tarpon Springs",
  "Company2Name": null,
  "CompanyDUNS": 96598040,
  "Company2DUNS": 0,
  "OperatorName": "City of Tarpon Springs",
  "OperatorStr1": "324 East Pine Street",
  "OperatorStr2": null,
  "OperatorCity": "Tarpon Springs",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34689",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Marcincuk",
  "RMPTitle": "Wastewater Plant Chief Operator",
  "FTE": 18,
  "OtherEPAFacilityID": "FL0030406",
  "EPAFacilityID": "100000072574",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-01-22 00:00:00",
  "SafetyInspectionBy": "Dept. of Community Affairs",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 28.151,
  "FRS_Long": -82.75433,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053920,
      "AltID": "Chlorine",
      "FacilityID": 1000043654,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054702,
          "ProcessID": 1000053920,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065619,
          "ProcessID": 1000053920,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565619,
          "ProcessID": 1000053920,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043654,
      "SummaryText": "CITY OF TARPON SPRINGS AWTF RISK MANAGEMENT PROGRAM EXECUTIVE SUMMARY\n\n\n\nThe City of Tarpon Springs Advanced Wastewater Treatment Facility (AWTF) has been identified as a facility that is subject to reporting under the Florida Accidental Release Prevention and Risk Management Planning (ARP/RMP) Act.  The toxic chemical threshold quantities, which were met to identify the facility, relate to the stored amounts of chlorine.  The ARP/RMP Act delineates three (3) specific levels of processes.  Of the three levels defined, the City's AWTF qualifies as a Level 3 Process facility.  As a result of this designation, the facility is required to address specific process safety criteria in the Risk Management Program.  This information and other pertinent information are included in the City's RMP document.\n\n\n\nThe objective of the City of Tarpon Springs Risk Management Program (RMP) is to provide information that will define action(s) that will effectively prevent accidental releases of substances that can cause serious harm to the public and the environment and mitigate the severity of any accidental releases that might occur.\n\n\n\nIn order to achieve these objectives, the Risk Management Program presents information for the City's Level 3 processes and outlines the emergency response program for the facility.\n\n\n\nAccidental release prevention and emergency response policies:\n\n\n\nThe City of Tarpon Springs takes a proactive approach to safety and compliance with all State and Federal rules and regulations.  Pertinent AWTF staff members have completed comprehensive training courses related to the proper use, handling, storage, and emergency response procedures associated with chlorine.  The City's Risk Management Program specifically addresses staff activities for various scenarios related to potential leaks and emergency situations, while placing emphasis on predictive maintenance and preventing accidental chemical releases.  Written Standard Operating Procedures (SOPs) have been "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043654,
      "SummaryText": "developed and implemented for changing one (1) ton chlorine cylinders. \n\n\n\nEntrance into the facility is accessed using programmed magnetic identification cards, which record the time and employee number of each entry into the facility.  The entry gates are monitored at both locations within the control building using video surveillance equipment and an intercom system, which is used to grant or deny access to the facility.\n\n\n\nAdditionally,video surveillance equipment is in use at the chlorine storage building and monitors the chemical feed equipment.  Installation of this equipment has provided an effective means to monitor the storage buildings, ensuring authorized personnel are safe and providing notice of unauthorized persons in the areas.  The video monitoring also provides staff with additional ability to detect equipment malfunctions. \n\n\n\nImages of these locations are displayed on a designated monitor located in the operational control building and at a shared monitor located in the reception area.\n\n\n\nThe facility and the substances handled:\n\n\n\nThe City is permitted to operate a domestic wastewater treatment plant, permit #FL0030406, by the Florida Department of Environmental Protection (FDEP).  The City's AWTF is currently rated at 4.0 MGD Annual Average Daily Flow as a domestic wastewater treatment plant Type I, Bardenpho process, with biological nutrient removal (BNR).\n\n\n\nThe City's AWTF uses chlorine gas for disinfection of the facility's effluent and liquid sodium bisulfite is used for dechlorination prior to discharge to the Anclote River.  The chlorine storage and dosing process is located within the perimeter of the facility. The dechlorination systems are located within perimeter of facility and another redundant system located remotely at the outfall to the Anclote River, approximately 850 feet north of the AWTF.\n\n\n\nThe chlorination system uses three (3) five hundred pound per day (500 ppd) chlorinators to combine chlorine in its gaseous form with w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043654,
      "SummaryText": "ater, creating an aqueous chlorine solution.  The chlorine solution is injected into the filtered effluent flow as the water enters the chlorine contact chamber.  The chlorine solution dose is determined using an ultrasonic meter that measures the flow of the filtered effluent.\n\n\n\nThe chlorine contact chamber serves to provide the detention time needed for high level disinfection requirements.  Effluent flow from the contact chamber flows to two (2) two million-gallon (2.0 MG) reuse water ground storage tanks.  After the ground storage tanks fill to their maximum capacity, the effluent level in the chlorine contact chamber increases until it overflows, or is automatically controlled by the facility's Supervisory Control and Data Acquisition (SCADA) system, to a transmission pipe, which discharges at the Anclote River outfall.\n\n\n\nPrior to discharge to the Anclote River, the effluent is dechlorinated using liquid sodium bisulfite at two locations. \n\n\n\nThe chlorination process is subject to 40 CFR Part 68 Level 3 requirements for the following three reasons:  \n\n\n\n1.    The process stores regulated substance of chlorine above the threshold quantities;\n\n\n\n2.    The process has the potential to impact public receptors (both human and environmental) within the distance to an endpoint from a worst-case release; and \n\n\n\n3.    The process is subject to the Occupational Safety and Health Administration's (OSHA) Process Safety Management regulations.\n\n\n\nIn order to have a sufficient amount on-site for treatment, seven (7) 2,000-lbs. chlorine cylinders are present at the AWTF at all times.  The cylinder containers are stored in an elevated 17 by 31-foot concrete building, approximately 70 feet west of the operations building.  The cylinders are maneuvered using an over-head electric chain hoist and placed on trunnions to facilitate correct cylinder operating position.  The EPA threshold quantity for chlorine is 2,500 lbs.\n\n\n\nThe chlorine storage building is equipped with an exhaust fan, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043654,
      "SummaryText": "emergency-breathing apparatus, leak detection device in the storage bay / equipment room (and are protected from vehicle impacts) with audible and visual alarms along with appropriate signs warning of toxic chemicals.  Alarms are connected to SCADA system for immediate emergency notifications to operations staff.\n\n\n\nGeneral accidental release prevention program and chemical specific prevention steps:\n\n\n\nThe Risk Management Program (RMP) has been developed and implemented by the City of Tarpon Springs AWTF in accordance with Section 112(r) of the Clean Air Act and 40 CFR Part 68 - Chemical Accident Prevention Provisions.  \n\n\n\nIn-house refresher training is provided for pertinent staff members on the proper use of the \"B\" repair kit and Self Contained Breathing Apparatus (SCBA).  This training is provided annually at a minimum.  Additionally, the City's Fire Department conducts an information gathering visit annually.  These annual visits serve as a review for the Fire Department with regard to the nature of all chemicals stored on-site, and the quantities and locations of the same.\n\n\n\nPreventative maintenance is performed on all chlorination equipment by factory trained staff members on a annual basis.  The City also has a work order system to address any noted equipment problems in a timely manner.  The chlorine storage building is equipped with a leak detection device and checked monthly for proper working order.\n\n\n\nFive year accident history:\n\n\n\nIn the last five years, there have been no known releases associated with either of the Level 3 Processes located at the AWTF.  Consequently no known off-site impacts were reported as a result.  \n\n\n\nEmergency Response Program:\n\n\n\nThe City's emergency notification, response, and first aid procedures, located in Section 6 of the City's Risk Management Program, are written in accordance with 40 CFR Part 68.  The procedures take into account existing measures established by the City, emergency responders, and trained AWTF oper"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043654,
      "SummaryText": "ations staff.\n\n\n\nIn the event of a chemical release emergency at the AWTF, the following agencies are to be notified immediately:\n\n\n\n1.Both the Police Department (727-938-2849) and the Fire Department (727-938-3737);\n\n\n\n2.The Florida State Warning Point (800-320-0519);\n\n\n\n3.The National Response Center (800-424-8802); and\n\n\n\n4.The Local Emergency Planning Committee for District 8 (727-570-5151).\n\n\n\nWhile release notification may be forwarded from one agency to another, the Chief Operator of the City's AWTF is responsible for verifying that all appropriate agencies are notified in a timely manner.\n\n\n\nEmergency response procedures have been developed for stopping minor chlorine leaks.  Only trained personnel wearing appropriate breathing apparatus, personal protective equipment (PPE), and carrying a two-way radio or a cellular phone are permitted to enter the area of an accidental release.  Hazmat will be contacted to respond to any serious situation that cannot be handled immediately by AWTF staff.\n\n"
    }
  ]
}