{
  "FacilityID": 1000092393,
  "FacilityName": "Cold Storage Solutions/Shetakis Wholesalers",
  "FacilityStr1": "3840-A N. Civic Center Drive",
  "FacilityStr2": null,
  "FacilityCity": "North Las Vegas",
  "FacilityState": "NV",
  "FacilityZipCode": "89030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32003",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "36.229209",
  "FacilityLongDecDegs": "-115.111821",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "mwinburn@shetakis.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Jim L Shetakis Distributing Co",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Shetakis Civic Center LLC",
  "OperatorStr1": "3840 N. Civic Center Drive",
  "OperatorStr2": null,
  "OperatorCity": "North Las Vegas",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89030",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Winburn",
  "RMPTitle": "General Manager",
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000174526",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-11-25 00:00:00",
  "SafetyInspectionBy": "NDEP CAPP",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-02-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-02-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-02-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-02-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.229,
  "FRS_Long": -115.1128,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000114702,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000092393,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000116095,
          "ProcessID": 1000114702,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000143328,
          "ProcessID": 1000114702,
          "ChemicalID": 56,
          "Quantity": 21300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000643328,
          "ProcessID": 1000114702,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092393,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nShetakis Civic Center LLC management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for its tenants and the surrounding communities.  \n\n\n\nIt is the policy of all Shetakis Civic Center LLC facilities to conduct all operations in a safe manner.  This policy extends to all tenants, employees, and contractors at the facility.  Shetakis Civic Center LLC implements this policy towards chemical and general safety through on-going employee participation, training, written operating procedures, maintenance, inspections, and safety reviews/evaluations.  These programs are in effect at the facility to prevent the accidental release of ammonia.  In the event of an ammonia accident, the facility has an Emergency Action Plan to notify the appropriate authorities and safely evacuate the facility.  The facility is coordinated with the local fire department, who will be the facility's emergency responder.\n\n\n\nShetakis Civic Center LLC owns the facility at 3840 North Civic Center Drive and has developed management programs to assist tenants with the implementation of the risk-related regulations associated with operating an ammonia refrigerated warehouse.  Depending on the tenant, the PSM/RMP/CAPP programs may be implemented by different job titles and in slightly differing manners.\n\n\n\nCurrently, Cold Storage Solutions, Shetakis Wholesalers, and Farm Fresh occupy refrigerated spaces within the Shetakis Civic Center LLC facility.  Cold Storage Solutions is responsible for the overall maintenance of the ammonia refrigeration system and the PSM/RMP/CAPP Programs. NOTE: Employee data provided is the current total including Cold Storage Solutions and Farm Fresh.\n\n\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Shetakis Civic Center facility provides cold storage warehouse space for distribution and for private tenants.  The faci"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092393,
      "SummaryText": "lity is located at 3840 N. Civic Center Drive in North Las Vegas, Nevada bordering the Interstate 15 freeway, south of Craig Road.  The immediate area is primarily light commercial and industrial. The ammonia system was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes.\n\n\n\nThe ammonia refrigeration system uses approximately 21,300 pounds of ammonia for warehouse cold storage and food processing.  The majority of the system is located in the machine room including vessels, compressors, and associated piping.  The condensers are mounted on the engine room roof, and all of the evaporators are located in their respective cold storage rooms/areas.\n\n\n\nThe system is also equipped with a dilution tank (DT-1) and an Emergency Control Box.  All of the relief valves are set to vent at 250 psig and discharge into a common header that vents into the bottom of the dilution tank, which is kept full of water.  In addition, the pressure in the system can be reduced manually by the valving located inside the Emergency Control Box located outside the Engine Room door. This control box allows the Fire Department to transfer ammonia from one vessel to another or vent the ammonia into the water dilution tank.\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Shetakis Civic Center LLC ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the Shetakis Civic Center LLC facility operates in accordance with OSHA's Process Safety Management regulation, and Nevada's Chemical Accident Prevention Program (CAPP).  Refrigeration contractors, experts in the ammonia refrigeration industry, are contracted at the facility to maintain the system and perform any repairs.\n\n\n\nThe Shetakis Civic Center LLC facility including the ammonia system was designed a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092393,
      "SummaryText": "nd constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of an ammonia refrigeration system.  These safety features include a water diffusion tank, ammonia sensors in the machine room as well as sensors in the cold storage areas, and automatic shut down systems that prevent equipment damage and ammonia releases.  In addition, the majority of the ammonia inventory is maintained inside the machine room and just outside of the machine room (condensers).  All pressure vessels are equipped with pressure relief valves that automatically engage in case of a high pressure situation and vent through a common header to a water diffusion tank.\n\n\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no significant releases of ammonia at the facility (including previous ownership) over the past five years (February 2016 - February 2021) that exceeded the EPA RMP Definition of \"Accident\".  \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe tenants at Shetakis Civic Center LLC have an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nThe current tenants maintain a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan was reviewed and updated to ensure compliance with the PSM, RMP, and CAPP regulations.\n\n\n\nIn case of an ammonia release emergency, the current tenants plan to evacuate all employees stationed in the cold storage warehouse and alert t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000092393,
      "SummaryText": "he local emergency responders (fire department).  The emergency response efforts are coordinated with the managers of the warehouse tenants.  Shetakis Civic Center LLC and their tenants coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThrough the PSM program elements and ongoing commitment to compliance and safety, the facility continues to look for improvements. Recommendations from various inspections as well as state agency audits are tracked through to completion by the PSM Team. "
    }
  ]
}