{
  "FacilityID": 1000084320,
  "FacilityName": "Trotter Terminal dba",
  "FacilityStr1": "81216 Hwy 11",
  "FacilityStr2": null,
  "FacilityCity": "Ord",
  "FacilityState": "NE",
  "FacilityZipCode": "68862",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31175",
  "LEPC": "Valley County LEPC",
  "FacilityLatDecDegs": "41.5860763",
  "FacilityLongDecDegs": "-098.888513",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "jessetrotter@nctc.net",
  "FacilityDUNS": null,
  "ParentCompanyName": "Trotter, Inc",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Jim Trotter",
  "OperatorStr1": "PO Box 158",
  "OperatorStr2": null,
  "OperatorCity": "Arcadia",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68815",
  "OperatorZipCodeExt": "0158",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200999",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-08-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "New-Mailed Dec 2007",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-02-29 11:50:25",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-02-29 11:50:25",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-02-29 11:50:25",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-02-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 41.58613,
  "FRS_Long": -98.88827,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105328,
      "AltID": "Storage",
      "FacilityID": 1000084320,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131860,
          "ProcessID": 1000105328,
          "ChemicalID": 56,
          "Quantity": 500000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000106641,
          "ProcessID": 1000105328,
          "NAICSCode": "42491",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000089272,
              "Process_NAICS_ID": 1000106641,
              "SafetyReviewDate": "2019-11-03 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-03-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-11-19 00:00:00",
              "TrainingReviewDate": "2019-11-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Supervised hands on training",
              "MaintenanceReviewDate": "2019-11-19 00:00:00",
              "EquipmentInspectionDate": "2019-11-19 00:00:00",
              "EquipmentTested": "Storage and Nurse Tanks, associated piping, valves, hoses and related transfer equipment.",
              "ChangeMgmtDate": "2019-03-21 00:00:00",
              "ChangeMgmtReviewDate": "2019-03-21 00:00:00",
              "PreStartupReviewDate": "2019-03-21 00:00:00",
              "ComplianceAuditDate": "2019-12-28 00:00:00",
              "AuditCompletionDate": "2019-12-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-03-21 00:00:00",
              "HotWorkPermitReviewDate": "2019-11-19 00:00:00",
              "ContractorSafetyReviewDate": "2019-12-28 00:00:00",
              "ContractorSafetyEvalDate": "2019-03-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000111094,
                  "PreventionProgram3ID": 1000089272,
                  "ProcessChemicalID": 1000131860
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000084320,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Valley Co LEPC",
    "CoordinatingAgencyPhone": "3089423461",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084320,
      "SummaryText": "l hazards, operating parameters and equipment designs associated with the covered process.\r\n\r\n\tProcess Safety Information: Trotter Terminal; maintains information describing the chemical hazards, operating parameters and equipment designs associated with the storage of anhydrous ammonia\r\n\r\nProcess Hazard Analysis: Studies are conducted to ensure the hazards associated with process operations are identified, understood and controlled.\r\n\r\nOperating Procedures: Blick's Phosphate Conversions, LLC; written operating procedures are maintained for covered process operations.  The Contractor's procedures address the following activities: initial startup, normal, temporary, emergency shutdown, normal shutdown and startup following a turnaround.\r\n\t\r\n\tOperating Procedures: Trotter Terminal; written operating procedures are maintained for the storage operations which addresses the activities: initial startup, normal, temporary, emergency shutdown, normal shutdown and startup following a turnaround.\r\n\r\nHot Work Permits: In order to assure adequate controls are used in work where conditions could cause ignition of flammable or combustible materials, the Hot Work Permit System will be utilized.  Hot work involves any welding, soldering, cutting, grinding, drilling, or any type of work where sparks may occur during operation.  These permits will be utilized where Blick's Phosphate Conversions, LLC supervisor deems them necessary for job safety.  It will be the supervisor's responsibility to ensure the proper procedures are followed and keep the appropriate records.\r\n\r\nTraining: A program is in place to ensure employee(s) of Blick's Phosphate Conversions, LLC are knowledgeable and trained in procedures associated with the covered processes. Verification of contractor training has been documented. \r\n\t\r\n\tTraining: Trotter Terminal; A program is in place to ensure employee(s) of Trotter, Inc are knowledgeable and trained in procedures associated with the storage of anhydrous ammonia."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084320,
      "SummaryText": "Mechanical Integrity: Blick's Phosphate Conversions, LLC covered process equipment is maintained consistent with generally accepted engineering practices.  Covered process equipment is routinely inspected and tested.  Maintenance activities are conducted by qualified personnel.  Deficiencies are corrected in a timely manner. \r\n\r\nMechanical Integrity: Trotter Terminal; A program is in place for the storage tank and equipment and is maintained consistent with generally accepted engineering practices.  Covered storage equipment is routinely inspected.  Maintenance activities are conducted by qualified personnel.  Deficiencies are corrected in a timely manner for the equipment associated with the storage of anhydrous ammonia.\r\n\r\nManagement of Change: Written procedures are in place to manage changes in process chemicals, technology, equipment and/or procedures.  Affected personnel are informed and trained to deal with authorized system changes. \r\n\r\nManagement of Change: Trotter Terminal; Written procedures are in place to manage changes in storage process of anhydrous ammonia, equipment and/or procedures.  Affected personnel are informed and trained to deal with authorized system changes for the equipment associated with the storage of anhydrous ammonia.\r\n\r\nPre-Startup Review: Technical and operational reviews will be conducted on new processes and/or modifications to existing covered processes.  Reviews confirm the construction, equipment, operating and maintenance procedures are suitable. Reviews are completed prior to placing equipment in operation. \r\n\r\nPre-Startup Review: Trotter Terminal; Operational reviews will be conducted on any new storage process and/or modifications to existing storage process.  Reviews confirm the construction, equipment, operating and maintenance procedures are suitable.  Reviews are completed prior to placing equipment in operation for the storage of anhydrous ammonia.\r\n\r\nCompliance Audits: Trotter Terminal conducts internal audits on a"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084320,
      "SummaryText": "Trotter, Inc \r\nDBA, Trotter Terminal \r\nEPA FACILITY ID: 1000- 0020-0999\r\n81216 Hwy 11\r\nOrd, NE  68862 \r\n\r\nOur operation is committed to employee, public and environmental safety.  This commitment is demonstrated by continually improving both practices and measures to prevent the release of regulated substances.  In the event of a release, Trotter Terminal is prepared to work with the Valley County LEPC and/or other authorities to mitigate any release and minimize the impact to people and the environment.\r\n\r\nTrotter Terminal's primary covered process activity is the storage of liquid 10-34-0 fertilizer.  Trotter Terminal has two anhydrous ammonia storage tanks on site to provide product for the process of converting it into 10-34-0 non-hazardous liquid fertilizer.  This activity includes processing of anhydrous ammonia by an outside contractor, Blick's Phosphate Conversions, LLC.  Anhydrous ammonia is received and stored until it is used in the process of converting it into 10-34-0 non-hazardous liquid fertilizer.  Processing is periodic and usually occurs in the spring and fall.  This process takes anhydrous ammonia and mixes it with phosphoric acid in a mobile T-reactor owned and operated by Blick's Phosphate Conversions, LLC.  Water is used as both a reaction feed material and product stabilizer.  The emergency procedures for Trotter Terminal are coordinated with the Valley County LEPC.\r\n\r\nTrotter Terminal, has taken the necessary steps to comply with accidental release prevention requirements set forth in 40 CFR Part 68.  This process conducted at the Ord location is done entirely by Blick's Phosphate Conversions, LLC; and their process is also covered by OSHA's Process Safety Management standard.  The following briefly describes the prevention program elements in place at this location using Blick's Phosphate Conversions, LLC mobile T-Reactor equipment:\r\n\r\nProcess Safety Information: Blick's Phosphate Conversions, LLC maintains information describing the chemica"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084320,
      "SummaryText": "regular basis to determine whether the provisions specified under the RMP rule are being implemented.  At a minimum, these audits are conducted every three (3) years.  Any determined corrective actions are completed in a timely manner.\r\n\r\nIncident Investigations: If an Incident were to occur, investigations would be conducted to determine the root cause of covered process incidents.  In addition to determination and correction, investigations are directed toward preventing a reoccurrence.  Investigations become process safety information and are retained for five (5) years. \r\n\r\nEmployee Participation: Based on exchange of information with Blick's Phosphate Conversions, LLC its employee(s) actively contribute in the following: process hazard assessments, operating procedure development, maintenance procedure development, training development and implementation, pre-startup reviews, incident investigations, and compliance audits. Additionally, employee(s) have access to all information pertaining to the facility's RMP. \r\n\r\nEmployee Participation: Trotter Terminal's management review and exchange of information with its employee(s) to have them contribute in the following: storage hazard assessments, operating procedures, maintenance procedures, training development and compliance audits.  Additionally, employee(s) have access to all information pertaining to the facility's RMP program. \r\n\r\nContractors: Periodically, Trotter Terminal may hire contractors to conduct specialized operational, maintenance and/or construction activities.  Prior to work, contractors are trained on the covered storage process, relevant process safety information and emergency response actions.\r\n\t\r\n\tTrotter Terminal hires an outside contractor, Blick's Phosphate Conversions, LLC to use the anhydrous ammonia that is stored on site for the process of converting it into 10-34-0 non-hazardous liquid fertilizer.\r\n\r\nA secondary activity at the facility is the distribution of products to farmers.  T"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000084320,
      "SummaryText": "he fertilizer product, anhydrous ammonia is received, stored and distributed for direct application as a nutrient for crop production.  Anhydrous ammonia is stored in tanks designed for this purpose\r\n\r\n\r\nFive (5) Year Accident History: There have been no accidental releases of anhydrous ammonia in the past five (5) years that have resulted in deaths, injuries or significant property damage.  Nor to our knowledge, has there been any releases resulting in off-site deaths, injuries, evacuations, property damage and/or environmental damage.\r\n\r\nEmergency Action Plan: Trotter Terminal has a written emergency action plan.  This plan includes notification of Valley County LEPC.  Local authorities have been provided with emergency planning and community right-to-know information.  Blick's Phosphate Conversions, LLC also has their own  Emergency Action Plan. \r\n\t\r\n\tBoth companies exchange their Emergency Action Plans.\r\n\r\nPlanned changes to improve safety: Trotter Terminal views safety improvement as a continual process.  Periodic evaluations (both internal and external) are performed to assess the facility status.  At this time, and aside from sustaining maintenance activities, there are no additional specific safety recommendations regarding storage of anhydrous ammonia."
    }
  ]
}