{
  "FacilityID": 1000019357,
  "FacilityName": "Solvay USA Inc., Spartanburg Facility",
  "FacilityStr1": "399 Sims Chapel Road",
  "FacilityStr2": null,
  "FacilityCity": "Spartanburg",
  "FacilityState": "SC",
  "FacilityZipCode": "29306",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45083",
  "LEPC": "Spartanburg County LEPC",
  "FacilityLatDecDegs": "34.916667",
  "FacilityLongDecDegs": "-081.926944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.solvay.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 154210488,
  "ParentCompanyName": "Solvay USA Inc.",
  "Company2Name": null,
  "CompanyDUNS": 2959810,
  "Company2DUNS": 2959810,
  "OperatorName": "Solvay USA Inc.",
  "OperatorStr1": "8 Cedarbrook Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Cranbury",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08512",
  "OperatorZipCodeExt": "7500",
  "FTE": 61,
  "OtherEPAFacilityID": "29301GFCHMSIMS",
  "EPAFacilityID": "100000104479",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-12-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-09-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-03-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-03-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-03-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.916667,
  "FRS_Long": -81.926944,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000023626,
      "AltID": "Alkoxylation",
      "FacilityID": 1000019357,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000028030,
          "ProcessID": 1000023626,
          "ChemicalID": 9,
          "Quantity": 1100000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000028031,
          "ProcessID": 1000023626,
          "ChemicalID": 12,
          "Quantity": 540000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000028032,
          "ProcessID": 1000023626,
          "ChemicalID": 27,
          "Quantity": 77000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000023949,
          "ProcessID": 1000023626,
          "NAICSCode": "325613",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000020236,
              "Process_NAICS_ID": 1000023949,
              "SafetyReviewDate": "2008-01-08 00:00:00",
              "PHA_Date": "2012-06-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "LOPA",
              "PHACompletionDate": "2009-02-18 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Tridundant Interlock PLC",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Foam systems",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Video Cameras",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Video Cameras",
              "OpProceduresReviewDate": "2010-05-12 00:00:00",
              "TrainingReviewDate": "2007-12-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-01-08 00:00:00",
              "EquipmentInspectionDate": "2010-12-19 00:00:00",
              "EquipmentTested": "Instrumentation, Vessels, Electrical",
              "ChangeMgmtDate": "2010-10-01 00:00:00",
              "ChangeMgmtReviewDate": "2007-01-22 00:00:00",
              "PreStartupReviewDate": "2010-12-19 00:00:00",
              "ComplianceAuditDate": "2010-02-23 00:00:00",
              "AuditCompletionDate": "2011-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-06-25 00:00:00",
              "HotWorkPermitReviewDate": "2009-01-07 00:00:00",
              "ContractorSafetyReviewDate": "2010-10-12 00:00:00",
              "ContractorSafetyEvalDate": "2007-11-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000023860,
                  "PreventionProgram3ID": 1000020236,
                  "ProcessChemicalID": 1000028030
                },
                {
                  "PrimaryKey": 1000023861,
                  "PreventionProgram3ID": 1000020236,
                  "ProcessChemicalID": 1000028031
                },
                {
                  "PrimaryKey": 1000023862,
                  "PreventionProgram3ID": 1000020236,
                  "ProcessChemicalID": 1000028032
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000019357,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-10-05 00:00:00",
    "ERTrainingDate": "2010-10-07 00:00:00",
    "CoordinatingAgencyName": "Spartanburg County LEPC",
    "CoordinatingAgencyPhone": "8645955366",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "SARA, RMP"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000019357,
      "SummaryText": "RMP Executive Summary Insert\n\nRhodia Inc., Spartanburg, South Carolina Facility:\n\nRhodia Inc. is the United States subsidiary of Rhodia SA, a global specialty chemicals manufacturing company.  The Rhodia Inc. Spartanburg Facility is part of the company's  Novecare business enterprise.  The Spartanburg facility has been operating safely for over 30 years, producing products sold to consumer product manufacturers around the world.  Many products produced in the Spartanburg facility are used in personal care products such as soaps, body washes, shampoos, pharmaceuticals, baby wipes, and numerous other useful and hygienic products.  Another group of products manufactured at the Spartanburg facility serve industrial type markets including latex manufacture and agricultural chemicals.  The Spartanburg facility currently employs 61 dedicated and safety conscious men and women.  Facility employees are skilled at the manufacture of about 350 chemical formulations using nearly 125 raw materials.The facility uses state-of-the-art technologies to manufacture, monitor, examine and control the processes.  \n\nRhodia's Spartanburg facility's, commitment to health, safety, security and the environment is captured in the following plant HSSE Policy: \n\tHealth, Safety, Security, and Environmental (HSSE) Policy\nSpartanburg Facility\n\nThe Spartanburg facility is committed to conducting its business in a responsible manner, in the best interest of our stakeholders, including our employees, neighbors, visitors, contractors, customers, the public and the environment. This policy is consistent with our Corporate Policy and the Spirit of Rhodia. Through this policy, the management team and operating staff of the Spartanburg facility uphold the commitment to comply with all applicable HSSE rules and regulations, corporate policy & requirements, as well as the commitment to the American Chemistry Council's Responsible Care&reg; Program and continuous improvements in the site HSSE process.\n\nRhodia"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000019357,
      "SummaryText": "ter supply system; emergency alarms throughout the facility.\n \nOver 50 Risk Management procedures define the safe working practices the site uses to conduct the day to day operations.  Detailed and specific procedures for accident reporting, safe work practices/permitting, spill response and prevention, contingency planning, waste management, fire prevention , foul weather planning, and many more activities are developed and ready for use.\n\nThe stationary source and regulated substances handled:\n\nStationary source: \nRhodia Inc.,\n399 Sims Chapel Road\nSpartanburg, SC 29306. \n\nRegulated Substances Handled: \nEthylene oxide, propylene oxide and allyl alcohol.\n\nGeneral Accidental Release Prevention Program and the Chemical Specific Prevention Steps: \n\nThe site maintains Spill Pollution Control and Countermeasures program which includes secondary containment and others means to prevent the accidental release of materials to the environment.  These programs and polices are included in the Risk Management Procedures.\n\nThese issues are addressed above with respect to accidental release prevention policies, and emergency response policies.  Also the equipment design standards and the Layer Of Protection PHA describe the mitigation and prevention techniques used to prevent specific chemicals from being released.\n\nFive Year Accident History:\n\nBetween 1996-and present there have been no releases from Spartanburg's RMP-covered processes involving a regulated substance and which caused any on-site deaths, injuries, or significant property damage; nor any known off-site deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place. \n\nEmergency Response Program: \n\nThis program is a defined command and control structure that emphas the safety of the employee, community, environment and finally the company assets.  This issue is addressed above under the Emergency Response Policy topic.\n  \nPlanned Changes to Improve Safety:  \n\nPeriodic review of plant Pro"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000019357,
      "SummaryText": "cess Hazard review findings and recommendations are conducted.  Numerous techniques are used to continually advance HSSE in the Rhodia Spartanburg facility.  Some of these methods include: internal auditing, Management Of Change practices, Pre Start Up Safety Review programs, Critical Task Analysis, and thorough incident investigations using Causal Tree techniques.    Each of these practices identifies recommendations that are evaluated and acted upon as necessary to reduce risk and improve the HSSE performance of the site.   The site does participate in a Facilitated Self Assessment activity last done in 2010 that measures process safety management performance against OSHA and Rhodia standards.  The site also participates in an HSSE management systems auditing process that covers 300 points of performance.  In both auditing processes, the site exhibits excellence among its peers.  Actions developed from these audits are implemented and continuous improvement is part of the sites HSSE performance."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000019357,
      "SummaryText": "Inc. believes in ownership of work processes by every employee. Accordingly, we believe it is the responsibility of every Spartanburg employee to work safely and to maintain high standards in Health, Safety, Security, and Environmental Affairs in all aspects of our operations. This belief can only be realized through each employee's participation and ownership of the HSSE process, and continuous efforts to improve our HSSE performance.\n\nThe site has designated the following resources for their respective role:\n* Operations Manager in conjunction with an Environmental resource who oversees compliance with all environmental permits, EPA Risk Management Plan, Emergency Response, management of hazardous and non-hazardous waste, and spill control & storm water management, \n\n* Technical Manager who oversees Process Safety Management and the Process Hazard Management Program,\n\n* Materials Manager who oversees the Site Security Program.\n\nThese individuals are resources for the development and implementation of HSSE management systems and monitoring of HSSE activities. However, every employee is responsible and accountable for the HSSE performance of our site. HSSE excellence can only be achieved through employee commitment and participation. Based upon an exhaustive internal HSSE auditing process, the Spartanburg Plant continues to rank at the highest levels of performance. \n\nEmployees at the Spartanburg facility, through their commitment and participation, will achieve excellence in the HSSE process. The success of the site's HSSE process has the full commitment and support of its management staff.\n\nRhodia, Spartanburg Facility, uses many risk management tools, including process hazard analyses,  to identify, analyze, understand, reduce and otherwise mitigate possible on-site and off-site risks to people and property.  The technical, operations, and maintenance staff, working together, are trained to use these tools and devices, making every effort possible to minimize th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000019357,
      "SummaryText": "ese risks.  Rhodia Spartanburg is continually updating and improving the information and standards at the site in an effort to strive for Health Safety, Security and Environmental excellence.\n\nThe Spartanburg Facility is ISO-9001-2000 certified, and has won numerous awards for safety and environmental performance.  Each year 2004-2007 Rhodia, Spartanburg facility, received a multi-year based award from Spartanburg Sanitary Sewer District for Superior Environmental Compliance, recognizing a perfect record without any Notification of Violations.  The site continues into it's 10th year without the generation of solid waste from biologic waste treatment plant.  Rhodia's Spartanburg facility, continually works to improve safety, security, environmental concerns, and community awareness.  In 2003, 2005, and 2007, the Spartanburg facility held Plant Open Houses to help improve HSSE awareness within our community. The Spartanburg facility has and continues to conducted industrial hygiene tests and has voluntarily conducted a regime of perimeter and off site ambient air monitoring.  In 2005, 2006, and 2007 Rhodia Spartanburg received the SOCMA Achievement award for exceptional management systems.\n\nThe Rhodia site maintains a well lit, fenced, gated and video monitored security system. Extensive security plans and procedures have been implemented and plant personnel are trained to monitor the site as well as incoming shipments to insure a secure facility.  The Spartanburg site works closely with the Spartanburg County SheriffÂ¿s Department to respond to any security issue that might develop.\n\nThe Rhodia Spartanburg Facility remains an active and progressive team of dedicated employees working every hour of the day to maintain high standards of safe operations and environmentally sound activities.\nThe accidental release prevention and emergency response policies at the stationary source: \n\nThe facility accidental release prevention policy can be generally summarized as follows"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000019357,
      "SummaryText": ".   All facility personnel will be trained in and expected to comply with the site-specific policies pertaining to accidental release prevention.  Primary accidental release prevention policy documents are found in:\n                         >Site-wide risk management procedures\n                         >Engineering & Maintenance procedures\n                         >Environmental (WWTP) operating procedures\n                         >Production operating procedures\n\nThe facility emergency response policy generally can be summarized as follows.  Site facility personnel training requires personnel to comply with the site-specific policies pertaining to emergency response.  Primary emergency response policy documents are found in:     \n\n* Risk Management Procedure RM007, Emergency Response\n* Risk Management Procedure RM024-Accident and Incident and Release Reporting\n* Engineering & Maintenance procedures\n* Environmental (WWTP) operating procedures\n* Production operating procedures\n* Other Risk Management Procedures\n\nThe site's Risk Management Procedure RM007, Emergency Response, addresses response to any incident within the site utilizing an Incident Command form of management control and response. Administrative controls to limit potential off-site impact include chain of command management with specific overlapping staff assignments for release prevention, emergency response, etc.; twenty four hour a day, seven days per week facility staffing; active fire watch during holiday shut down periods; active membership in and coordination with the Spartanburg Local Emergency Planning Committee (LEPC) (Spartanburg County Emergency Preparedness Department), and active coordination with the Arkwright, Croft and Roebuck Voluntary Fire Departments.  Mitigation measures to limit potential off-site impact include state of the art leak detection and control systems; railcar unloading station equipped with a three car emergency deluge system; dedicated diesel powered emergency fire wa"
    }
  ]
}