{
  "FacilityID": 1000031558,
  "FacilityName": "Unilever - Olathe",
  "FacilityStr1": "27080 West 159th Street",
  "FacilityStr2": null,
  "FacilityCity": "New Century",
  "FacilityState": "KS",
  "FacilityZipCode": "66031",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20091",
  "LEPC": "Johnson County LEPC",
  "FacilityLatDecDegs": "38.840556",
  "FacilityLongDecDegs": "-094.895972",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1378892,
  "ParentCompanyName": "Conopco, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1375088,
  "Company2DUNS": null,
  "OperatorName": "Unilever",
  "OperatorStr1": "27080 West 159th Street",
  "OperatorStr2": null,
  "OperatorCity": "New Century",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66031",
  "OperatorZipCodeExt": null,
  "FTE": 200,
  "OtherEPAFacilityID": "KSD984970673",
  "EPAFacilityID": "100000094621",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-11-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Anhydrous ammonia refrigeration",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-11-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-11-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-11-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-11-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 38.83999,
  "FRS_Long": -94.89885,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000038586,
      "AltID": "Anhydrous Ammonia Refrig.",
      "FacilityID": 1000031558,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000046310,
          "ProcessID": 1000038586,
          "ChemicalID": 56,
          "Quantity": 33000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000038928,
          "ProcessID": 1000038586,
          "NAICSCode": "311225",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000033657,
              "Process_NAICS_ID": 1000038928,
              "SafetyReviewDate": "2010-03-02 00:00:00",
              "PHA_Date": "2009-02-16 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-11-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-08-24 00:00:00",
              "TrainingReviewDate": "2010-03-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-03-02 00:00:00",
              "EquipmentInspectionDate": "2012-10-22 00:00:00",
              "EquipmentTested": "Mechanical Integrity Audit",
              "ChangeMgmtDate": "2012-08-23 00:00:00",
              "ChangeMgmtReviewDate": "2010-03-02 00:00:00",
              "PreStartupReviewDate": "2012-08-23 00:00:00",
              "ComplianceAuditDate": "2012-02-28 00:00:00",
              "AuditCompletionDate": "2013-02-28 00:00:00",
              "IncidentInvestigationDate": "2011-09-06 00:00:00",
              "InvestigationChangeDate": "2012-02-01 00:00:00",
              "ParticipationPlansReviewDate": "2012-08-24 00:00:00",
              "HotWorkPermitReviewDate": "2012-02-18 00:00:00",
              "ContractorSafetyReviewDate": "2012-07-24 00:00:00",
              "ContractorSafetyEvalDate": "2012-10-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000039821,
                  "PreventionProgram3ID": 1000033657,
                  "ProcessChemicalID": 1000046310
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000031558,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-08-17 00:00:00",
    "ERTrainingDate": "2012-05-01 00:00:00",
    "CoordinatingAgencyName": "Johnson County Fire Department",
    "CoordinatingAgencyPhone": "9137823258",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000031558,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nUnilever Foods is strongly committed to employee, public, and environmental safety.  This commitment is reflected in a comprehensive accidental release prevention program.  This Program addresses the design, installation, operation, maintenance, and employee training associated with the process equipment at the facility.\r\n\r\nUnilever Foods senior management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  Unilever Foods' safety and environmental policies as they relate to the ammonia refrigeration system are administered by the Plant Engineering Manager, who oversees implementation of the risk prevention policies.  \r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nUnilever Foods is located at 27080 W. 159th Street, in New Century, Kansas.  The facility employs one independent refrigeration system that contains approximately 32,600 pounds of anhydrous ammonia as a refrigerant within a closed system.  The system consisting of vessels, piping, valves, and process equipment cycles ammonia through various states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for the manufacturing and storage of margarine.  Most of the ammonia equipment is located indoors.  The condensing towers, make-up air units, and some piping runs are located outdoors and on the roof of the plant.\r\n\r\nThe ammonia refrigeration system is a two-stage system consisting of a high pressure side and a low pressure side.  The margarine processing units (MPUs) operate on the low side (i.e., low pressure) to quickly freeze product on swept surface heat exchangers.  Ammonia suction from the MPUs, at about 0 psig, passes through the low accumulator before entering the booster compressors.  Any liquid"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000031558,
      "SummaryText": "ammonia in the low side suction is trapped in the low side accumulators and returned as high pressure liquid for the system.  The booster discharge passes through an intercooler before entering the high side compressors.  The high side compressor draws suction from the intercooler/high side suction accumulator at about 25 psig (booster discharge).  This accumulator receives suction from various cooler units.  Excess ammonia liquid that collects in the high side accumulator is removed and returned to the system.  The major discharge from the high side compressors (hot gas) is vented to seven condensing towers.  A portion of the hot gas is also used for defrosting and for transferring liquid.  A condensed liquid is returned to the high pressure receiver where it is fed to the low and high side equipment, including the MPUs, cooler units, and air handlers.  The liquid is pre-cooled in the intercooler vessel before entering the cooler units and a portion of the MPUs.\r\n\r\nIn 2002 to 2005, the system was expanded to include three MPUs and a water chiller, relocation of the roof-mounted air handling unit, replacement of piping on the roof, conversion of the dry warehouse to a storage cooler where three evaporators were added, relocation of one condensing tower, and the addition of two new towers with associated water sump. In 2008, the facility installed a new (Hench) monitoring and control system to improve energy efficiency.  \r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\r\n\r\nThe Unilever Foods' ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with OSHA's Process Safety Management regulation and EPA's Risk Management Program (RMP).  The facility conducts maintenance and any necessary repairs in house, but an outside contractor is contracted as needed.  \r\n\r\nThe ammonia"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000031558,
      "SummaryText": "refrigeration system is designed and constructed in accordance with all applicable federal, state, and local regulations at the time of construction as well as ANSI/IIAR-1-1984 and IIAR Bulletin Nos. 109, 110, and 111.  In addition, the facility is designed in accordance with the American Society of Heating, Refrigeration, and Air-Conditioning Engineers, Inc. (ASHRAE) standards applicable at the time.  ASHRAE publishes a safety code for mechanical refrigeration that outlines requirements for occupancy classification, refrigeration systems classification, refrigerant classification, requirements for refrigerant use, design and construction of equipment systems, pressure limiting devices, pressure relief protection, installation requirements, and field pressure test.\r\n\r\nThe ammonia refrigeration system is protected by the existence of specific safety systems/hardware, including safety relief valves, engine room ventilation, and system safety interlocks.  Safety relief valves protect the compressor discharge, condensers, transfer vessels, suction accumulators, intercooler, and pump-out system from the hazards associated with overpressure.  Safety interlocks include high pressure and high temperature alarms and cutouts for the compressors, as well as high level floats and sensors for vessels.  In addition, ammonia sensors are located in the Engine Room 1, Engine Room 2, Engine Room 3, Cooler 1, Cooler 2, Cooler 3, and King Units.  At an ammonia concentration of 50 ppm, the ammonia sensors in Engine Rooms 1, 2, and 3 will activate the audible/visual alarms and trigger exhaust fans to start on \"high\" mode.  At 150 ppm, the offsite monitoring company (ADT) is notified who then contacts all employees and/or agencies listed on the emergency contact list.  The ammonia sensors in Coolers 1, 2, 3 and King Units will activate the audible/visual alarms at 50 ppm.  At 150 ppm, these sensors automatically calls the offsite monitoring company (ADT) is notified who then contacts all"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000031558,
      "SummaryText": "employees and/or agencies listed on the emergency contact list.  There is also an \"Emergency Stop\" button with a hammer/break glass cover located outside of Engine Room 1 (south of the building) that, when actuated, kills the control circuit to the compressors, which shuts down the system on auxiliary.  The \"Emergency Stop\" button also closes the King Valve and triggers exhaust fans to start on \"high\" mode.\r\n\r\nThe facility also has exhaust fans which are located in each of the Engine Rooms 1, 2, and 3 to provide continuous ventilation and emergency (purge) ventilation.  There is an on/off switch for the Engine Room ventilation fans located outside of Engine Room 1 (south of building).  The ammonia detector alarms are interlocked to start the same exhaust fans on \"high\" speed.\r\n\r\nIn addition, the facility has developed a preventative maintenance program to complete regularly scheduled inspections and tests of the ammonia refrigeration system as well as repairs as needed to process equipment.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe facility has an Emergency Response Plan in effect.  This Plan was designed to meet the following objectives: \r\n \r\n1.  save lives;\r\n2.  minimize and avoid injuries;\r\n3.  protect the environment; and\r\n4.  minimize property damage.\r\n\r\nThe Unilever Foods facility maintains a safety committee whose members include the designated Emergency Coordinator for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\r\n\r\nUnilever Foods has a designated Emergency Action Team, whose members comprise of designated personnel, which consists of supervisors and co-work"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000031558,
      "SummaryText": "ers from the maintenance, production, and distribution departments, and whose purpose is to provide emergency response actions (fire fighting, spill control, etc.) in an attempt to further ensure employee safety and preserve company property. The Emergency Action Team members are trained to the Hazardous Materials Technician level (24-hrs) and authorized for immediate spill response, meaning a spill or release which can be safely controlled or contained in the immediate area using available personal protective equipment and spill response material/equipment.  Spills that are beyond the immediate control of the Emergency Action Team will be dealt with by an external resource.  The Emergency Coordinator / Designee will call 9-1-1 and/or other external response agencies as provided on the facility's Emergency Contact Numbers form.  \r\n\r\nIn the case of an emergency, the Plant Engineering Manager/Designee decides when an evacuation is necessary and the location of the evacuation assembly area to ensure the safety of its employees and will coordinate emergency response efforts with the fire department on a periodic and ongoing basis.  The facility holds evacuation drills at least once per year.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nThe EPA's RMP Program defines \"accident\" as the following:\r\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process. The release must have caused at least one of the following:\r\n\r\n-On-site deaths, injuries, or significant property damage (§68.42(a)); or\r\n-Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)).\"\r\n\r\nA review of the facility's accident history determined that there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds in the last five years (November 2007 - November 2012). In addition, there have been no releases of ammonia that meet the RMP definition o"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000031558,
      "SummaryText": "f \"accident\" as described above.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Process Hazard Analysis (PHA) Revalidation was conducted on February 16-17, 2009 to satisfy the five year update requirements.  The PHA Revalidation study included a \"What-if\" / checklist and a facility inspection.  The PHA Revalidation provided mitigation measures to improve safety at the Unilever Foods facility located at 27080 W. 159th Street, in New Century, Kansas.  As a result of the PHA Revalidation, a number of recommendations were made, such as some equipment upgrades and improvement of existing safety policies and procedures.  All recommendations resultant from the revalidation study were completed by November 30, 2010.\r\n\r\nThe Unilever Foods safety committee is also planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\r\n\r\n1.  Continue to train all employees in the facility Safety Plan/Programs.\r\n2.  Continue to have employee involvement in Safety Plan Development.\r\n3.  Continue employee involvement through safety team participation.\r\n4.  Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}