{
  "FacilityID": 1000061783,
  "FacilityName": "Apio Cooling",
  "FacilityStr1": "4595 West Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Guadalupe",
  "FacilityState": "CA",
  "FacilityZipCode": "93434",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06083",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.960511",
  "FacilityLongDecDegs": "-120.572078",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.apioinc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 37553864,
  "ParentCompanyName": "Apio, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Apio Cooling",
  "OperatorStr1": "P.O. Box 627",
  "OperatorStr2": null,
  "OperatorCity": "Guadalupe",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93434",
  "OperatorZipCodeExt": null,
  "FTE": 300,
  "OtherEPAFacilityID": "CAL000033907",
  "EPAFacilityID": "100000197128",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-11-23 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-01-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-01-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-01-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-01-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000077363,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000061783,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000096056,
          "ProcessID": 1000077363,
          "ChemicalID": 56,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000078548,
          "ProcessID": 1000077363,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000065068,
              "Process_NAICS_ID": 1000078548,
              "SafetyReviewDate": "2016-12-08 00:00:00",
              "PHA_Date": "2016-12-08 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": "Facility walkthrough/inspection",
              "PHACompletionDate": "2018-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "External Events, Sabatoge, Terrorism, Theft, Impact, Severe Weather",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Water Diffusion Tank",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Personal Monitors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-12-08 00:00:00",
              "TrainingReviewDate": "2016-12-08 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-01-13 00:00:00",
              "EquipmentInspectionDate": "2017-01-11 00:00:00",
              "EquipmentTested": "Tested process cutouts and alarms on recirculator.",
              "ChangeMgmtDate": "2016-06-01 00:00:00",
              "ChangeMgmtReviewDate": "2016-12-08 00:00:00",
              "PreStartupReviewDate": "2016-06-01 00:00:00",
              "ComplianceAuditDate": "2016-12-08 00:00:00",
              "AuditCompletionDate": "2017-06-01 00:00:00",
              "IncidentInvestigationDate": "2006-11-17 00:00:00",
              "InvestigationChangeDate": "2006-12-17 00:00:00",
              "ParticipationPlansReviewDate": "2016-12-08 00:00:00",
              "HotWorkPermitReviewDate": "2016-12-08 00:00:00",
              "ContractorSafetyReviewDate": "2016-12-08 00:00:00",
              "ContractorSafetyEvalDate": "2016-12-08 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000080176,
                  "PreventionProgram3ID": 1000065068,
                  "ProcessChemicalID": 1000096056
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000061783,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Santa Barbara County",
    "CoordinatingAgencyPhone": "8056868163",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061783,
      "SummaryText": "Prior to 2006, Apio Cooling used ammonia as part of a shared ammonia refrigeration system with two other facilities. Per the LEPC, one Risk Management Plan was prepared for the facilities.  In 2006, Apio Cooling developed their own independent refrigeration system.  This submittal represents Apio Cooling as an independent, stand-alone ammonia refrigeration process.\n\n\n\nA. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nApio Cooling located in Guadalupe, California, utilizes refrigeration for ice making and cold storage. Senior management at the facility is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all employees and the surrounding communities.  Senior management administers the safety and environmental policies and programs.  These programs include but are not limited to forklift safety, hazard communications, lockout/tagout, Hazardous Materials Emergency Business Plan, employee safety manuals, manufacturers documentation, Emergency Response, as well as the Risk Management Plan. A majority of the ammonia equipment is located inside the engine room.  The system is a closed loop refrigeration system similar to a residential refrigerator.  There are no emissions or planned releases of ammonia.\n\n\n\nApio Cooling has independently coordinated emergency response efforts with the Santa Barbara County Fire Department.  In the case of an ammonia-related emergency, it is the policy of Apio Cooling to evacuate the employees and to allow the fire department/HazMat team to respond to the emergency.\n\n\n\nB. STATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Apio Cooling facility is located at 4595 W. Main Street in Guadalupe, California, which is approximately 0.2 miles east of Highway 1 and 0.1 miles north of Highway 166.  The area immediately surrounding the facility is rural with a mixture of agricultural and sparse residential areas.\n\n\n\nThe primary business of Apio Co"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061783,
      "SummaryText": "oling is to provide cooling for ice making and cold storage.  In order to conduct operations, the facility maintains a refrigeration system containing approximately 24,000 pounds of anhydrous ammonia, a regulated substance.  The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for cooling and storage of vegetables.  Typical operating conditions range from approximately 15 psig on the low pressure side of the system to 150 psig on the high side.\n\n\n\nC.  ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\n\n\n?    EPA's Risk Management Program (RMP);\n\n?    OSHA's Process Safety Management (PSM); and\n\n?    California Accidental Release Prevention Program (CalARP).  \n\n\n\nAdministrative Measures:\n\n\n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n\n\n?    IIAR Bulletin 107, \"Suggested Safety and Operating Procedures When Making Ammonia  Refrigeration Tie ins\"\n\n?    IIAR Bulletin 109, \"Minimum Safety Criteria for a Safe Ammonia Refrigeration System\"\n\n?    IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\"\n\n?    IIAR, \"A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\"\n\n\n\nThe Apio Cooling ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the Apio Cooling facility operates in accordance with the Process Safety Management (PSM), Risk Management Program (RMP), and California Accidental Release Prevention (CalARP) Program.  It is "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061783,
      "SummaryText": "important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.\n\n\n\nOther safety features of the ammonia refrigeration system include: two emergency shutdown switches (located outside the engine room exit door and in the office) that stop electrical power to all engine room equipment with the exception of the exhaust fans, relief valves on all pressure vessels, and ventilation fans in the engine room which start automatically when the ammonia level or temperature in the engine room exceed designated setpoints.\n\n\n\nD.  FIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no significant releases of ammonia at the facility in the last five years (January 2012 - January 2017) that exceeded the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material.  In addition, there have been no injuries resulting from an ammonia release, nor any releases or \"near misses\" that warranted an internal incident investigation. \n\n\n\nE.  EMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility has an Emergency Action Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives:  \n\n\n\n?    save lives;\n\n?    minimize and avoid injuries;\n\n?    protect the environment; and\n\n?    minimize property damage.\n\n\n\nApio Cooling maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061783,
      "SummaryText": " to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the PSM/RMP/CalARP regulations.  \n\n\n\nApio Cooling personnel circulate throughout the plant, taking note of unusual conditions in any portion of the systems.  In the event that an ammonia leak is discovered, the person nearest to the leak will alert any personnel in the immediate area who are unaware of the danger, and the Operations Manager. The Operations Manager will determine what procedures and personnel are necessary to remedy the problem. Action is promptly taken to mitigate the leak so normal operations can resume.\n\n\n\nF.  PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nA Process Hazard Analysis Revalidation (PHA) was performed on December 7, 2016, at the Apio Cooling facility. This study generated mitigation measures (recommendations) to improve safety at the Apio Cooling facility located in Guadalupe, California.  The mitigation measures include additional training, key maintenance-related tests/inspection, and enhanced emergency response policies and procedures.  The Apio Cooling safety committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\n1. Raise relief outlets to 15'  above a working platform and 20' from same. Point upward and install rain cap. Option pipe to water diffusion.\n\n\n\n2. Upgrade central control system to annunciate and notify when an equipment failure occurs.\n\n\n\n3. Verify branch relief lines are large enough. \n\n\n\n4. Check for non-condensibles at least annually and adjust future purging schedule based on findings.\n\n\n\n5. Replace open drive ammonia pumps with hermetic on the HTR and MTR (Value Added Side) Note: this is a 5yr capitol plan.\n\n\n\n6. Label all controls and electrical panels.\n\n\n\n7. "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000061783,
      "SummaryText": "Perform additional training as to electrical and control panel locations. Train on functions of controls. Train on system parameters. Normal, high, low pressure, flow high low, temp high low normal.\n\n\n\n8. Install access ladder to king valve on HPR\n\n\n\n9. Complete/correct P&ID's. Include a valve list noting normal valve positions and location/function. Include valve tags on drawings and tag all critical valves and label all equipment per codes and industry standards.\n\n\n\n10. Label all piping, all equipment and tag all valves as required by code.\n\n\n\n11. Locate copy of last 5 yr M.I. Perform same in 2017.\n\n\n\n12. Remove all vacated piping. Vacate old underground piping by the ice maker and medium temp cooler.\n\n\n\n13.Ensure valve maintenance is part of equipment PM's (industry standard is 3-yrs or annually, depending on environment)\n\n\n\n14. Perform ammonia purity testing (industry practice is every 5 yrs.)\n\n\n\n15. Include inspection of fan blades during cleaning or more often if accessable.\n\n\n\n16. Consider installing a catwalk for access to condenser colis and eliminators.\n\n\n\n17. Install removable bollards by electrical by T-53\n\n\n\n18. Add authorized Personnel Only Signs at all Engine Room Doors\n\n\n\n19. Complete Emergency Action Plan changes and train individuals on responsibilities as required.  Perform annual evacuation training.\n\n\n\n20. Verify the area has reverse 911.\n\n\n\n21. Facilities and rail in close proximately, Location of other chemicals. Consider joint training and system for joint notification.\n\n\n\n22. Conduct First Responder Operational and RETA training (non-responding facility).  Medically clear employees for respirators, train and fit test. Perform drills.\n\n\n\n23. Label the break glass ventilation and emergency shut down switches at the engine room.\n\n\n\n24. Create SOP or PM for monthly inspections of response equipment.\n\n\n\n25. Coordinate with responding agencies.  Schedule training /facility walk through. Hazwoper drill.\n\n\n\n26. Install evacuation maps in maintenance"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000061783,
      "SummaryText": " shop and remote buildings. Add this documentation to you PSM program.\n\n\n\n27. Install additional eyewash / showers inside the engine room.\n\n\n\n28. Install panic bars on exits in the engine room and recirculator rooms.\n\n\n\n29. Install check valve and bleeder in charge line.\n\n\n\n30. Complete pump down, pump out SOP's for all major equipment.\n\n\n\n31. Initiate system entry procedures. Use line break permits and temporary SOP.\n\n\n\n32. Install caps and plugs on oil pot drains. Walk system and verify all orifices are plugged or capped. Replace as necessary.\n\n\n\n33. Procure spill kit and keep in or near mechanical room.\n\n\n\n34. Perform Seismic Walk-down in 2017\n\n\n\n35. Train personnel in the meet and greet policies. Restrict non-essential personnel from critical areas.\n\n\n\n\n\n"
    }
  ]
}