{
  "FacilityID": 1000009105,
  "FacilityName": "Quaker Chemical Company, Inc.",
  "FacilityStr1": "1212 Elmore St.",
  "FacilityStr2": "1306 Elmore St.",
  "FacilityCity": "Columbia",
  "FacilityState": "SC",
  "FacilityZipCode": "29203",
  "Facility4DigitZipExt": "6423",
  "FacilityCountyFIPS": "45079",
  "LEPC": "Richland County LEPC",
  "FacilityLatDecDegs": "34.034440",
  "FacilityLongDecDegs": "-081.039440",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3365921,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Josie Hendrix",
  "OperatorStr1": "1212 Elmore St.",
  "OperatorStr2": "1306 Elmore St.",
  "OperatorCity": "Columbia",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29203",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Copeland",
  "RMPTitle": "VP",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000117937",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-03-25 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-11-29 00:00:00",
  "DeRegistrationEffectiveDate": "2015-09-30 00:00:00",
  "AnniversaryDate": "2014-06-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.03474,
  "FRS_Long": -81.04202,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010680,
      "AltID": "Cleaning Compound MFG",
      "FacilityID": 1000009105,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011062,
          "ProcessID": 1000010680,
          "NAICSCode": "325611",
          "_desc": {
            "NAICS_CODE": "325611",
            "NAICS_DESCRIPTION": "Soap and Other Detergent Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012153,
          "ProcessID": 1000010680,
          "ChemicalID": 55,
          "Quantity": 42000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512153,
          "ProcessID": 1000010680,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000010681,
      "AltID": "Cleaning Compound MFG",
      "FacilityID": 1000009105,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011063,
          "ProcessID": 1000010681,
          "NAICSCode": "325611",
          "_desc": {
            "NAICS_CODE": "325611",
            "NAICS_DESCRIPTION": "Soap and Other Detergent Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012154,
          "ProcessID": 1000010681,
          "ChemicalID": 55,
          "Quantity": 4160.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512154,
          "ProcessID": 1000010681,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009105,
      "SummaryText": "Quaker Chemical Company, Inc.\n1212 Elmore St.\nColumbia, SC 29203\n\nExecutive Summary:\n\n*********************************************************************\n\nCompany Overview:\n\nQuaker Chemical Company, Inc. is active in maintaining proper safety procedures at its facility to insure safety for its employees, the environment, and the local community.  Quaker has been in business for 49 years producing cleaning compounds for the cleaning industry.  The blending and packaging of the Hydrofluoric Acid has become our primary business.  Our customers include national industrial distributors (NACD Certified) and large electronics manufacturing corporations.  Our safety programs and process handling equipment have been developed and maintained with help of worldwide suppliers, industry associations, and experience.\n\nAccidental Release Prevention / Emergency Response Policies:\n\nQuaker Chemical Company, Inc. currently operates with eight employees. Quaker has an active Safety Committee which consists of a Safety Director, Manufacturing Supervisor, and three production workers.  This committee meets every month to discuss current operations and safety issues.  Any concerns identified are met with a plan of action and the proper actions are made to eliminate the concern.  The Safety Director also performs Self Audits along with his manufacturing supervisor to insure proper procedures are being followed.  The fire department has visited our facility every year to review our storage locations, making them aware of the facility in case of emergency.  The Walk Through usually consists of 3-4 firefighters along with the chief from the local responding branch which is four blocks away from our facility.  Quaker also takes advantage of the Voluntary programs offered by DHEC (Department of Health and Environmental Control). DHEC (Voluntary Programs Division) performed walk thoughs at our facility covering OSHA compliance, Industrial Hygiene, and air monitoring with the most recent date o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009105,
      "SummaryText": "f March 28, 2008.\n\nFacility and Regulated Substances Handled:\n\nQuaker Chemical Company, Inc. currently blends and packages Hydrofluoric Acid.  We purchase the material in 500 pound drums and the maximum amount of material on any shipment is 80 drums.  Our process includes moving a pallet containing four drums into the mixing area, putting the pallet on a containment basin for safety, and each drum is pumped into a mixing tank.  All mixing tanks are diked and contained at 110% capacity.  Material is then blended to the proper percentage by adding water and refilled into DOT approved containers for shipment to our customers.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention:\n\nQuaker Chemical Company, Inc. operates a safe facility both for its employees and the local surrounding community.  Proper containment, tanks, piping, fittings, safety showers, and neutralizing agents are used and made available to employees.  Quaker also uses secondary safety valves on all tanks for emergency shut-off.  Operating and maintenance procedures require daily and other periodic tests to insure safety at all times.  Quaker Chemical insures adequate budgets each year to also insure all needs are met.  Many scenarios of accidental release have been identified and proper actions have been taken to insure we are prepared for a safe and prompt response to such spill or release.  Quaker currently complies with the EPA rule 29 CFR 1910.38 for Occupational Safety and Health Standards.  \n\nFive Year Accident History:\n\nQuaker Chemical Company, Inc. has had no accidents within the last five years to report.\n\nEmergency Response Program:\n\nQuaker Chemical Company, Inc. understands the importance of being prepared for emergencies and having procedures in place to properly respond to emergency situations.  Quaker currently has a written Emergency Response Program.  Each employee has been trained on the program and a copy has been made available for everyone.  \n\nIn the even"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009105,
      "SummaryText": "t of emergency, our employees are trained to notify the manufacturing supervisor or the Safety Director immediately of the current emergency situation.  Proper procedures are then followed to insure spills or leaks are contained and neutralized.  Drills have been performed to act out such an emergency situation.  Members of the Local Emergency Planning Committee (LEPC) and the local community will be contacted if a worst case scenario release occurs.  Upon arrival of the Richland County LEPC the Safety Director will advise LEPC of the situation and a plan of action will result.\n\nQuaker Chemical continues to attend meetings and stay current with the Richland County LEPC.  \n\nPlanned Changes To Improve Safety:\n\nQuaker Chemical Company, Inc. is always looking for ways to improve safety in its everyday operations.  Frequent safety training and review has been the key to our success at Quaker.  Our Safety Committee meets periodically to discuss safety issues including Personal Protective Equipment (PPE), pipes, pumps, valves, fittings, containment strategies, tanks, as well as manufacturing and storage procedures. In 2007 Quaker assigned Mr. John Copeland as Safety Director for the company to oversee all OSHA, EPA, and company safety issues.  There are no specific changes planned for normal operations, yet we continue to follow our maintenance schedule for all equipment used in handling the Hydrofluoric Acid to insure a safe working environment every day."
    }
  ]
}