{
  "FacilityID": 1000090690,
  "FacilityName": "REV LNG, SSLBC INC",
  "FacilityStr1": "492 Dolan Road",
  "FacilityStr2": null,
  "FacilityCity": "Wyalusing",
  "FacilityState": "PA",
  "FacilityZipCode": "18853",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42015",
  "LEPC": "Bradford County LEPC",
  "FacilityLatDecDegs": "41.814559",
  "FacilityLongDecDegs": "-76.287966",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.niche-llc.com",
  "FacilityEmailAddress": "info@niche-llc.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "NiCHe LNG, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "REV LNG SSL BC",
  "OperatorStr1": "6603 West  Broad Street",
  "OperatorStr2": "Attn:  Managing Counsel",
  "OperatorCity": "Richmond",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23230",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000243505",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-09-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-11-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-11-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-11-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 41.809234,
  "FRS_Long": -76.289928,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112898,
      "AltID": "Natural Gas Liquefaction",
      "FacilityID": 1000090690,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000141099,
          "ProcessID": 1000112898,
          "ChemicalID": 155,
          "Quantity": 650000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000124545,
              "ProcessChemicalID": 1000141099,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000124547,
              "ProcessChemicalID": 1000141099,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000124546,
              "ProcessChemicalID": 1000141099,
              "ChemicalID": 94
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000114250,
          "ProcessID": 1000112898,
          "NAICSCode": "22121",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000096385,
              "Process_NAICS_ID": 1000114250,
              "SafetyReviewDate": "2020-08-11 00:00:00",
              "PHA_Date": "2020-10-29 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-08-11 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-08-18 00:00:00",
              "TrainingReviewDate": "2020-11-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-11-09 00:00:00",
              "EquipmentInspectionDate": "2020-11-09 00:00:00",
              "EquipmentTested": "Cold Box Heat Exchanger",
              "ChangeMgmtDate": "2020-10-27 00:00:00",
              "ChangeMgmtReviewDate": "2020-08-24 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2020-09-17 00:00:00",
              "HotWorkPermitReviewDate": "2020-10-20 00:00:00",
              "ContractorSafetyReviewDate": "2020-10-14 00:00:00",
              "ContractorSafetyEvalDate": "2020-11-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000120304,
                  "PreventionProgram3ID": 1000096385,
                  "ProcessChemicalID": 1000141099
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000090690,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Herrick Twnshp Volunteer Fire Dept",
    "CoordinatingAgencyPhone": "5708882121",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "PA State Storage Tank Regulations at 25 PAC Chapter 245"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000090690,
      "SummaryText": "ve help prevent potential accidental scenarios that could be caused by equipment failures or human error. In addition, the RBC facility incorporates safety features on its equipment to help (a) contain/control a release (e.g., diking and enclosures); (b) quickly detect a release (e.g., hydrocarbon detectors with alarms), and (c) reduce the consequences of (mitigate) a release (e.g., fire suppression and extinguishing).\r\n\r\n4.  Five-year Accident History.\r\nRBC is a newly constructed facility.  As such, there are no incidents to report for five-year accident history.\r\n\r\n5.  Emergency Response Program.\r\nThe RBC facility has a written emergency plan to deal with accidental releases of hazardous materials. The plan is in place to protect worker and public safety as well as the environment. The plan addresses evacuations, notification of local emergency response agencies, and communication to the public. Employees receive training in emergency procedures. To ensure proper functioning, the emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within the processes that would require a modified emergency response. The emergency plan has been reviewed with the Herrick Township Fire Department, the local emergency response commission, and local law enforcement.\r\n\r\n6.  Planned Changes to Improve Safety.\r\nNiche personnel maintain and  improve safety at the facility through training, process knowledge, safe job procedures, periodic compliance audits, and encouragement of employee awareness and communication of unsafe practices or near misses.  Changes in process chemicals, technology, equipment, and procedures undergo a management of change process to identify and address safety considerations prior to implementing a facility change."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000090690,
      "SummaryText": "ve access to all information created as part of the facility's implementation of the RMP rule, including information resulting from the process hazard analyses.\r\n \r\nHot Work Permit.\r\nNiche and RBC personnel will issue a hot work permit for hot work operations conducted on or near a covered process. The permit shall document that the fire prevention and protection requirements have been implemented prior to beginning the hot work operations; it shall indicate the date(s) authorized for hot work; and identify the object on which hot work is to be performed. The permit will be kept on file until completion of the hot work operations.\r\n \r\nContractors.\r\nNiche and RBC hire contractors to conduct specialized maintenance and construction activities. Additionally, Niche has contracted a third party to provide staffing for basic site operations. The site is manned on a daily basis by three full time, contract personnel.\r\n \r\nPrior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Before any contractors are allowed to work at RBC, they undergo an orientation, including safety and environmental briefings. During this orientation contractors are made aware of the known potential hazards related the contractors work, the hazards of regulated substances within the facility, the safe work procedures required by Niche, and a review of the Hot Work Permit Policy and the Lock Out/Tag Out Procedures used at the facility. Contractors are informed of all the procedures for emergency response should an accidental release of a regulated substance occur. This information includes evacuation routes and assembly points. Plant management will document that contractors have received all relevant safety training and emergency procedures.\r\n \r\nChemical Specific Prevention Steps.\r\nThe covered processes at RBC have safety hazards that must be managed to ensure continued safe operation. Collectively, the prevention program activities described abo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000090690,
      "SummaryText": "fety reviews related to new processes and modifications in established processes, are conducted as a regular practice at RBC. Reviews are conducted to confirm that construction and installed equipment are in accordance with design specifications, and that safety, operating, maintenance, and emergency procedures are suitable for safe startup prior to placing equipment into operation.\r\n \r\nCompliance Audits.\r\nThird-party audits are  conducted at least every 3 years to determine whether the provisions set out under the RMP rule are adequately implemented. The audits are carried out by at least one person knowledgeable in the process and are conducted at least every three years. Audit findings are documented in a report. Any corrective actions noted during the audits are undertaken in a safe and prompt manner. Documentation of any corrective actions are maintained. The facility maintains documentation of the two most recent compliance audit findings and actions.\r\n \r\nIncident Investigation.\r\nNiche personnel promptly investigate any incident that results in, or could have reasonably resulted in a catastrophic release of a regulated substance. Incident investigations are initiated as promptly as possible, but no later than 48 hours after an incident, Incident investigations involve at least one person knowledgeable about the subject process. Investigations are undertaken to identify any situation leading to an incident, as well as any corrective actions needed to prevent a release from reoccurring. A report will be prepared at the conclusion of any investigation and will include any resolutions and corrective actions. All incident investigation reports are retained for a minimum of five years.\r\n \r\nEmployee Participation.\r\nNiche personnel believe that Process Safety Management (PSM) and accident prevention is a team effort. Company employees are strongly encouraged to express their views and recommend improvements with regard to accident prevention. In addition, employees ha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000090690,
      "SummaryText": "rk practices apply to employees and contractor employees.\r\n \r\nTraining.\r\nNiche requires its contracted operators to undergo training to ensure employees who are operating the regulated process are competent in the operating procedures associated with the process. Initial training for gas plant operations is provided and refresher training is conducted at least every three years or more frequently as needed. Both initial and refresher training is documented and records of training are maintained onsite for at least three years.\r\n \r\n \r\nMechanical Integrity.\r\nNiche has written procedures for (1) maintaining on-going integrity of process equipment, which incorporates training for process maintenance activities, inspection and testing, (2) corrective action for equipment deficiencies, and (3) the application of quality assurance measures. Niche and RBC operators perform and document maintenance checks on process equipment to ensure proper installation and operation. Process equipment checked for mechanical integrity may include, but is not limited to: Pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.\r\n \r\nQualified and trained personnel perform maintenance operations at the site. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. The Operating procedures also incorporate quality assurance measures to ensure that equipment and parts are suitable for the process application for which they will be used.\r\n \r\nManagement of Change.\r\nWritten procedures are in place to manage changes in process chemicals, technology, equipment, and procedures. Management of Change procedures are updated as needed. Process operators, maintenance personnel, or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to safely incorporate the modification.\r\n \r\nPre-Startup Reviews.\r\nPre-startup sa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090690,
      "SummaryText": "process safety information that describes the hazards of regulated substances, operating parameters and equipment designs associated with the regulated process. \r\n \r\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety data sheets (SDS). The OSHA Hazard Communication Standard (HCS) requires chemical manufacturers, distributors or importers to provide Safety Data Sheets (SDS) to communicate the hazards of chemical products.\r\n \r\nProcess Hazard Analysis.\r\nNiche personnel conduct comprehensive studies to ensure that hazards associated with the regulated process are identified and controlled efficiently. Niche utilizes the HAZOP method analysis techniques to perform these evaluations. The studies were undertaken by a team of qualified personnel, led by Blue Engineering & Consulting with expertise in engineering and process operations. The PHA is revalidated at regular intervals of 5 years. Any findings related to the hazard analysis are addressed in a timely manner.\r\n \r\nOperating Procedures.\r\nFor the purposes of safely conducting activities within the covered process, Niche and RBC personnel maintain written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent with process safety. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the process. Niche and RBC personnel develop and implement safe work practices to provide for control of hazards during operations such as lockout/tagout; confined space entry; opening process equipment or piping; and control over entrance into a stationary source by maintenance, contractor, laboratory, or other support personnel. These safe wo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090690,
      "SummaryText": "(USEPA) Risk Management Program (RMP) requirements.\r\n\r\n3.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps.\r\nNiche has taken all necessary steps to comply with the accidental release prevention requirements. RBC was specifically designed and built to comply with the following list of codes:\r\n\r\nNFPA 59A\t\t2013\tStandard for Production, Storage, and Handling of Liquefied Natural Gas (LNG) and in accordance with PA State Fire Code\r\n\r\nASME Section VIII,\t2007/2010\tASME Boiler and Pressure Vessel Code - 2007 referenced by NFPA 59A; 2010 with 2011 amendments enforced by PA State Law\r\nDivision 1\r\n\r\nNFPA 70\t        \t2014\tNational Electric Code (NEC)\r\n\r\nAPI STD 521\t\t2014\tPressure-relieving and De-pressuring Systems\r\n\r\nASCE 7-10\t\t2010\tMinimum Design Loads for Buildings and Other Structures\r\n\r\nACI 318-14\t\t2014\tBuilding Code Requirements for Reinforced Concrete\r\n\r\nAASHTO  \t\t2018\tDesign of Roadways and Paving\r\n\r\nAISC 360-10\t     \t2010\tManual of Steel Construction-Allowable Stress Design\r\n\r\nIBC/IFC\t        \t2015\tInternational Building Code / International Fire Code (as referenced by Comm. of PA Code)\r\n\r\nIFGC            \t2009\tInternational Fuel Gas Code\r\n\r\nASME B31.3\t\t2008/2010\tProcess Piping - 2008 referenced by NFPA 59A; 2010 enforced by PA State Law\r\n\r\nSSPC Standards\t\t2014\tPainting and Corrosion Protection\r\n\r\nNFPA 37\t        \t2018\tStandard for the Installation and Use of Stationary Combustion Engines and Gas Turbines\r\n\r\nNFPA 10\t        \t2013\tStandard for Portable Fire Extinguishers\r\n\r\nAPI 60\t        \t2011\tSpecification for Pipeline Valves\r\n\r\nAGA XL1001\t\t2011\tAmerican Gas Association:  Classification of Locations for Electrical Installation in Gas Utility Areas\r\n\r\nRBC is classified as a Program 3 process under USEPA's RMP. The following sections briefly describe the elements of the release prevention program that is in place at this stationary source.\r\n \r\nProcess Safety Information.\r\nNiche and RBC personnel maintain detailed records of"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090690,
      "SummaryText": "1.  Accidental Release Prevention and Emergency Response Policies.\r\nREV LNG SSL BC (REV Bradford County, henceforth, RBC), an entity wholly owned by Niche LNG, LLC (Niche), is committed to employee, public and environmental safety. This commitment is demonstrated by the release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at the facility. It is Niche's policy to implement appropriate controls to prevent possible releases of regulated substances. If a minor release does occur, regular personnel are at hand to control and mitigate the effects of the release.  However, in the case of a catastrophic release, as a non-responding facility, personnel are advised to evacuate and call 911 to obtain additional resources from Herrick Township and Bradford County such as local volunteer fire departments, law enforcement and emergency medical services.  Additionally, Niche has contracted Elk Environmental Services as an emergency response organization to provide additional emergency response and remediation expertise.\r\n\r\n2.  Stationary Source and Regulated Substances Handled.\r\nRBC consists of an incoming gas metering and regulation skid, gas pretreatment system, liquefaction system, process coolers, bulk liquefied natural gas (LNG) storage tanks, tractor refueling, and product trailer loading. The facility includes a motor control center building, operations control room, and natural gas-fired power generators to produce onsite electricity for the entire plant. \r\n \r\nRBC produces a nameplate capacity of 50,000 gallons of LNG per day, stored in three 60,000 gallon storage tanks, for a total storage of 180,000 gallons. LNG is loaded into trailers for distribution to customers. \r\n \r\nLNG produced and contained on site by RBC consists of greater than 95% methane and exceeds the threshold quantity (10,000 pounds) for applicability under the U.S. Environmental Protection Agency's"
    }
  ]
}