{
  "FacilityID": 1000058106,
  "FacilityName": "Milner Terminal",
  "FacilityStr1": "1345 Old 41 Highway",
  "FacilityStr2": null,
  "FacilityCity": "Milner",
  "FacilityState": "GA",
  "FacilityZipCode": "30257",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13171",
  "LEPC": "Lamar County LEPC",
  "FacilityLatDecDegs": "33.151567",
  "FacilityLongDecDegs": "-084.207125",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Enterprise Products Operating LLC",
  "Company2Name": null,
  "CompanyDUNS": 62457304,
  "Company2DUNS": 62457304,
  "OperatorName": "Enterprise Propane Termnls & Storg",
  "OperatorStr1": "1275 U. S. Highway 11 North",
  "OperatorStr2": null,
  "OperatorCity": "Petal",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39465",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165625",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-06-24 00:00:00",
  "SafetyInspectionBy": "Bureau of Explosives",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-06-10 12:50:52",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-06-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-06-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-06-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.151366,
  "FRS_Long": -84.207421,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000072623,
      "AltID": "Milner Terminal",
      "FacilityID": 1000058106,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000089597,
          "ProcessID": 1000072623,
          "ChemicalID": 105,
          "Quantity": 11000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000089598,
          "ProcessID": 1000072623,
          "ChemicalID": 98,
          "Quantity": 920000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000073803,
          "ProcessID": 1000072623,
          "NAICSCode": "42471",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000058106,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lamar County Fire Department",
    "CoordinatingAgencyPhone": "7703585159",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000058106,
      "SummaryText": "Environmental Protection Agency Risk Management Plan\r\nEnterprise Propane Terminals & Storage Milner Terminal \r\nRMP Executive Summary\r\n\r\nEPA ID:  1000 0016 5625\r\n\r\nAt the Enterprise Propane Terminals & Storage Milner Terminal  we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.\r\n\r\nThe Milner Terminal is owned by Enterprise Propane Terminals & Storage LLC and is operated by Enterprise Products Operating LLC. The Milner Terminal is a LPG pipeline terminal connected to the Dixie interstate LPG pipeline system.    The process is regulated by the OSHA Process Safety Management Standard for highly hazardous chemicals.\r\n\r\nWe use a combination of accidental release prevention programs and emergency response planning programs to help provide for the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\r\n\r\n* A description of our facility and use of substances required by EPA's RMP regulation and the processes involved\r\n* A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\r\n* Emergency Response Programs\r\n* General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n* A five-year accident history for accidental releases of chemicals at the Milner Terminal that are regulated by EPA's RMP rule.  \r\n\r\nFacility Description\r\n\r\nThe Milner Terminal engages in the pipeline receipt and storage of liquefied propane under pressure, and the loading of propane tank trucks.    The process is regulated by Federal OSHA 29 CFR 1910.119 and 40 CFR Part"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000058106,
      "SummaryText": "68.  We have entered the facility as an RMP Program Level 3 facility.\r\n\r\nThe facility receives, stores and distributes LPG.  The three propane storage tanks are administratively controlled to hold and not exceed 80% of their capacity.  The facility consists of pressure storage tanks, a truck loading dock, a propane dehydration system, an LPG odorization system and associated piping, valves and other miscellaneous equipment.    \r\n\r\nIn our process we use the following chemicals that the EPA has identified as having the potential to cause significant offsite consequence in the event of a substantial accidental release:\r\n\r\nToxics\r\n\r\nThere are no toxic materials contained on site above the threshold limits.\r\n\r\nFlammables\r\n\r\nPropane is a finished product which is received into the three storage tanks.  This material is routed from these tanks to the loading docks for  delivery into LPG tank trucks.  Ethyl mercaptan, which is used to odorize the propane delivered to the tanker trucks, is also present above the threshold quantity.\r\n\r\nKey Offsite Consequence Analysis Scenarios\r\n\r\nThe EPA's RMP rule requires that we provide information about the worst-case scenarios(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario.\r\n\r\nWorst Case Release Scenario - Regulated Toxic Chemical\r\n\r\nNo toxic material above the threshold quantity on site.\r\n\r\nAlternate Release Scenario(s) - Regulated Toxic Chemical\r\n\r\nNo toxic material above the threshold quantity on site.\r\n\r\nWorse Case Scenario - Regulated Flammable Chemicals\r\n\r\nThis simulation involves the rupture or failure of a propane storage tank resulting in a simulated vapor cloud explosion.  This scenario assumes there would be no mitigation.  All emergency response and early warning procedures to inform employees and the community would be exercised"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000058106,
      "SummaryText": "immediately if this were to occur.  The quantity and endpoint of the simulation and the specifics of the simulation are available in the reporting of the Risk Management Plan\r\n\r\nAlternate Case Scenario - Regulated Flammable Chemicals\r\n\r\nThe alternate release scenario is a simulated rupture of a delivery hose at the loading docks resulting in a two minute release and simulated vapor cloud explosion.  This scenario assumed the pump continued to operate at its normal flow rate after the hose break, with a simultaneous failure of the primary excess flow shutdown device at the loading dock.  Mitigation measures were taken into account when selecting the alternative release scenario.  These measures consisted of reviewing the use of relief valves, check valves, manual shutoff valves, automatic shutoffs, startup and operating procedures, grounding equipment, and excess flow devices.  Activation of the Emergency Shutdown system after an assumed maximum time of two  minutes would isolate the source of the material and secure the facility.  All emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to occur.  The quantity and endpoint of the simulation is contained in the RMP registration data elements.\r\n\r\nWe are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.\r\n\r\nEmergency Response Program\r\n\r\nEnterprise maintains an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning and reporting.  The program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, the plan is coordinated with the Lamar County Sheriff's Department Emergency Management District, which includes the local Police Department, Lamar Count"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000058106,
      "SummaryText": "s and\r\nincident investigation findings. Changes may also be installed as a result of employee operations or safety improvement suggestions."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000058106,
      "SummaryText": "y Sheriff's Department, Lamar County Fire Department, and Emergency Medical Service.\r\n\r\nIn the event of an accidental release, local Enterprise personnel are trained to sound the alarm, shut off the source from a safe location, contact 9-1-1 and secure the area.  The 9-1-1 system is used to notify the local Police and Fire Departments.  \r\n\r\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n\r\nEnterprise takes a systematic, protective approach to preventing accidental release of hazardous chemicals.  Our Process Safety Management systems address each of the key features of successful prevention program, including:\r\n\r\n* Process safety information\r\n* Process hazard analysis\r\n* Operating procedures\r\n* Training\r\n* Mechanical integrity\r\n* Management of change\r\n* Pre-Startup Safety Review - PSSR\r\n* Compliance audits\r\n* Incident investigation\r\n* Employee participation\r\n* Hot work permit\r\n* Contractors\r\n\r\nOperations personnel make regular inspections of the equipment and processes they operate.  If something out of the ordinary is found, it is reported to management in order to expediently resolve any problems.\r\n\r\nThe engineering and administrative controls in place have been established to reduce the risk of an accidental release of identified hazardous materials.  Enterprise is committed to operations that are safe for employees and the surrounding community.\r\n\r\nAccident History\r\n\r\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\r\n\r\nBased on the criteria set forth in 40 CFR 68.10, this facility has not had an accidental release.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nThe Milner Propane Terminal facility resolves all findings from PHA's, some of which result in modifications to the process. Changes are usually planned in response to PHA's, safety audit"
    }
  ]
}