{
  "FacilityID": 1000066910,
  "FacilityName": "Garland Logistics Pointe",
  "FacilityStr1": "2600 McCree Road",
  "FacilityStr2": null,
  "FacilityCity": "Garland",
  "FacilityState": "TX",
  "FacilityZipCode": "75041",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48113",
  "LEPC": null,
  "FacilityLatDecDegs": "32.872417",
  "FacilityLongDecDegs": "-096.668528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Westmount Realty",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Terry Brehm",
  "OperatorStr1": "2600 McCree Road",
  "OperatorStr2": null,
  "OperatorCity": "Garland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75041",
  "OperatorZipCodeExt": null,
  "RMPContact": "Terry Brehm",
  "RMPTitle": "Facilities Manager",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000041144",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-11-15 00:00:00",
  "SafetyInspectionBy": "Consultant 5 Year Independent Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-12-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-12-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-12-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-12-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.87133,
  "FRS_Long": -96.66719,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": ".1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000083990,
      "AltID": "Frick Engine Room",
      "FacilityID": 1000066910,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000085193,
          "ProcessID": 1000083990,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000104903,
          "ProcessID": 1000083990,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000604903,
          "ProcessID": 1000083990,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000083991,
      "AltID": "FES Engine Room",
      "FacilityID": 1000066910,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000085194,
          "ProcessID": 1000083991,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000104904,
          "ProcessID": 1000083991,
          "ChemicalID": 56,
          "Quantity": 23000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000604904,
          "ProcessID": 1000083991,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000066910,
      "SummaryText": "Garland Logistics Pointe, located in Garland, Texas, is a refrigerated warehouse space that provided cold storage space for tenant operations.  The ammonia refrigeration systemss are utility systemss supporting the plant by providing space conditioning for product storage.  \n\n\n\nAmmonia contained within the refrigeration systems is a regulated substance under both the EPA and OSHA regulations.  At Garland Logistics Pointe the maximum inventory of ammonia exceeds the regulatory threshold of 10,000 pounds.\n\n\n\nGarland Logistics Pointe is committed to protecting the public, its employees, and the environment from any accidental releases of hazardous materials used at its facilities.  We have implemented safety, environmental protection, and risk management programs to prevent hazardous materials releases. \n\n\n\nIf there is an accidental release, we will immediately call for emergency response to minimize the effect of the release and notify the public of any actions necessary to ensure public protection via the Garland Fire Department.\n\n\n\nWorst-Case Release Scenario\n\n\n\nGarland Logistics Pointe has conducted an offsite consequence analysis as required by the EPA regulations, including an extremely unlikely, worst-case release scenario (i.e., total release from the single largest container over a ten minute period, assuming worst case meteorological conditions).  Results of this worst-case event indicate that offsite receptors would be affected. \n\n\n\nThis type of release is not considered credible from the standpoint that an event of this nature would require the catastrophic failure of the container, resulting in a sudden release of the entire contents over a ten-minute period.  The ammonia systems components are designed to withstand pressures well in excess of normal operating conditions and Garland Logistics Pointe maintains a very rigorous maintenance and prevention program for all ammonia process equipment.\n\n\n\nIn fact, EPA release reporting databases and industry experi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000066910,
      "SummaryText": "ence suggest that the worst-case release scenario as defined in the RMP regulations is so unlikely that it should not be used as the basis for emergency planning.  A more reasonable potential release scenario for emergency planning is presented in \"The alternative release scenario(s)\" section below.\n\n\n\nAlternative Release Scenario\n\n\n\nA \"credible worst-case\" scenario, formulated in accordance with USEPA guidance, was selected as the Garland Logistics Pointe alternative release scenario. This scenario involves a one-inch diameter hole from a break in the high pressure liquid ammonia piping on the roof of the facility.   Results of this credible worst-case event indicate that there are some offsite receptors that would be affected.  \n\n\n\nThe results of the process hazard analysis (PHA) and the facility's operating history suggest that even this credible worst-case is extremely unlikely to occur, but it can serve as the basis for emergency planning. \n\n\n\nAccidental Release Prevention Steps\n\n\n\nGarland Logistics Pointe is committed to public safety, personnel safety, continued reliable operation and regulatory compliance.  Based on this commitment, the Facility Manager has assumed overall responsibility for the development and implementation of the Risk Management Program and has clearly defined accountability and responsibility for each of the prevention program elements to meet both EPA and OSHA Process Safety Management requirements.\n\n\n\nTo ensure that a worst-case or alternative release scenario does not occur, Garland Logistics Pointe maintains a release prevention program with the primary focus of protecting the public and plant employees from the hazards associated with an accident or release involving anhydrous ammonia.  The multifaceted program includes the use of:\n\n\n\nSystems instruments and alarms to rapidly alert operators to any problems;\n\n\n\nProcess safety information to document the safe process design;\n\n\n\nProcess hazards analyses to evaluate the chemical and pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000066910,
      "SummaryText": "ocess hazards;\n\n\n\nOperating procedures to ensure that the systems is operated safely;\n\n\n\nMaintenance, inspection and testing to ensure that the systems is maintained according to applicable standards and manufacturer's recommendations;\n\n\n\nTraining, Hot Work Permits, Contractor Safety, and Employee Participation Programs to ensure that all employees and contractors working on and around the processes are aware of the hazards, can perform their job duties safely and know the actions to be taken in an emergency;\n\n\n\nManagement of Change and Pre-startup Safety Reviews to ensure that changes are documented, analyzed and kept within the design basis;\n\n\n\nIncident Investigation procedure to investigate each incident and \"near misses\" to determine root causes and make needed safety improvements; and,\n\n\n\nPeriodic Compliance Audits to ensure that our programs are working as they should to protect both the public and employees.\n\n\n\nFive-Year Accident History\n\n\n\nWithin the past five years, Garland Logistics Pointe has not had any accidental releases that resulted in injuries or property damage. The plant has maintained an excellent safety record throughout its operating history and has never had a major anhydrous ammonia release that could have had adverse effects on the public.  \n\n\n\nEmergency Response\n\n\n\nIn the event that an ammonia release does occur, Garland Logistics Pointe has an emergency action plan that coordinates emergency response with the Garland Fire Department. If such a release did occur, plant personnel would contact the Garland Fire Department, who would dispatch specially trained personnel to the facility. \n\n\n\nPlanned Changes to Improve Safety and Maintaining a Safe Operation\n\n\n\nGarland Logistics Pointe continually works to safely manage the hazards of anhydrous ammonia to protect the community we serve and the employees working for us. The Risk Management Program will be maintained to reduce the risk of accidental releases and each year we will conduct training,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000066910,
      "SummaryText": " review procedures, maintain the equipment and follow safe work practices. We are implementing PHA recommendations to increase the safety of our systems.  Periodically, we will audit our program, review our Process Hazard Analysis, and coordinate with the community emergency response organization.\n\n"
    }
  ]
}