{
  "FacilityID": 1000110342,
  "FacilityName": "The Dow Chemical Company",
  "FacilityStr1": "1881 West Oak Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Marietta",
  "FacilityState": "GA",
  "FacilityZipCode": "30062",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13067",
  "LEPC": "Cobb County Resource Council",
  "FacilityLatDecDegs": "33.993067",
  "FacilityLongDecDegs": "-084.526175",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1381581,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "The Dow Chemical Company",
  "OperatorStr1": "1881 West Oak Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Marietta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30062",
  "OperatorZipCodeExt": null,
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184472",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-06-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-02-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-02-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-02-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-02-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.992563,
  "FRS_Long": -84.523875,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000137532,
      "AltID": "TDI Storage/Reaction",
      "FacilityID": 1000110342,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000172292,
          "ProcessID": 1000137532,
          "ChemicalID": 77,
          "Quantity": 130000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000139082,
          "ProcessID": 1000137532,
          "NAICSCode": "32511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000118598,
              "Process_NAICS_ID": 1000139082,
              "SafetyReviewDate": "2023-12-18 00:00:00",
              "PHA_Date": "2020-10-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "LPP workboon",
              "PHACompletionDate": "2025-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Process Control System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Portable TDI Detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-08-29 00:00:00",
              "TrainingReviewDate": "2023-02-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-03-02 00:00:00",
              "EquipmentInspectionDate": "2022-10-04 00:00:00",
              "EquipmentTested": "Sprinkler System Inspected, storage tank",
              "ChangeMgmtDate": "2023-06-07 00:00:00",
              "ChangeMgmtReviewDate": "2023-11-11 00:00:00",
              "PreStartupReviewDate": "2023-09-15 00:00:00",
              "ComplianceAuditDate": "2021-02-15 00:00:00",
              "AuditCompletionDate": "2024-02-29 00:00:00",
              "IncidentInvestigationDate": "2023-09-25 00:00:00",
              "InvestigationChangeDate": "2024-12-31 00:00:00",
              "ParticipationPlansReviewDate": "2023-12-12 00:00:00",
              "HotWorkPermitReviewDate": "2022-02-15 00:00:00",
              "ContractorSafetyReviewDate": "2023-12-13 00:00:00",
              "ContractorSafetyEvalDate": "2019-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000148657,
                  "PreventionProgram3ID": 1000118598,
                  "ProcessChemicalID": 1000172292
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000110342,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-11-30 00:00:00",
    "ERTrainingDate": "2023-12-13 00:00:00",
    "CoordinatingAgencyName": "Marietta Fire & Emergency Services",
    "CoordinatingAgencyPhone": "7707945466",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000110342,
      "SummaryText": "nd the public, as well as post-incident decontamination of affected areas.\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\r\n\r\n7. Planned Changes to Improve Safety\r\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  On an ongoing basis, elements of our accidental release prevention program are reviewed with qualified personnel from our corporate process safety function. The plant had a drill with Cobb County Hazmat Team on 8/12/2018 and extensive discussion related to the RMP chemical and has taken that learning and updated our response to this chemical. The plant has implemented the additional requirements of RMP in the 2017 changes of the RMP regulations and looking ahead to other requirements that are due in 2021"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000110342,
      "SummaryText": "es its mechanical integrity program as per the Dow\r\nChemical GMISS (Global Mechanical Integrity Safety Standard) requirements. The program was\r\nestablished to ensure the integrity of process equipment. Elements of this program include:\r\nIdentification and categorization of equipment and instrumentation\r\nInspections and tests\r\nEstablishment of inspection frequencies\r\nDevelopment and application of maintenance procedures\r\nTraining of maintenance personnel\r\nDocumentation of tests and inspection results\r\n\r\nContractor Training and safety Reviews and qualification\r\nOur company hires contractors to conduct Logistics, Administrative, Operations, specialized Maintenance and Construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The Dow Chemical Company has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\n\r\nIncident Investigation\r\nAny incidents or near misses that involve RMP chemical has to go through root cause investigation and communicated to personnel. All actions are monitored to make sure they are completed in timely manner\r\n\r\nAudits\r\nCompliance audits into our RMP program are conducted by impartial Dow corporate auditing group every three years. These audits are comprehensive and delve into all our programs that support the RMP.\r\n\r\n6. Five Year Accident History\r\nThe Marietta plant has had no events meeting the criteria established by RMP rule the past 5 years.\r\n\r\n7. Emergency Response Plan\r\nThe Dow Chemical Company carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000110342,
      "SummaryText": "agement of change is mandatory for introduction of all raw materials, any changes to processing, changes in to instruments that are not like for like\r\n\r\nOperating Procedures\r\nFor the purposes of safely conducting activities within our covered processes, The Dow Chemical Company maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes. Any changes to complete a task requires the procedures to be routed through MOC process.\r\n\r\nProcess Hazards Analysis\r\nA process hazard analysis technique known as RC/PHA (Reactive Chemical/Process Hazard Analysis) is used to identify and analyze the potential hazards associated with the chemicals and processes we use. And additional technique, Layers of Protection Analysis(LOPA) is also used to analyze potential hazards. Corrective action plans are developed and implemented as part of the analysis and updated a minimum of every three years. Safety systems are designed into the processes. These are designed to create several layers of protection, so that if one system fails other systems will maintain the process in a safe state. These engineering and administrative controls help prevent releases of chemicals:\r\nRedundant safety systems and instrumentation, particularly for tank level systems\r\nAutomatic shutdown devices that are triggered if critical safety equipment malfunctions\r\nSecondary containment for storage tanks\r\nAlarm systems and automatic shutdown devices for critical control parameters\r\nPressure relief devices to prevent over pressurization\r\nFire protection systems\r\nOperator attendance of unloading operations\r\nPermit system to control work in hazardous areas\r\nWork preplanning and safety reviews\r\n\r\nMechanical Integrity \r\nThe plant operat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000110342,
      "SummaryText": "cified isomer) [Benzene, 1,3-diisocyanatomethyl-] [CAS 26471-62-5] (TDI).  The liquid is stored in a single tank at the facility, and is used in the production polyurethane Prepolymers.\r\n\r\n5.0 Plant Accident Prevention Program and Chemical Specific Prevention Steps\r\nThe Marietta plant maintains a number of accident prevention programs in order to ensure the safe operation of all process. The plant follows corporate and plant specific safety standards to operation of all process, in which some cases are more stringent than OSHA safety standards while complying with EPA, DOT and state requirements. The following are part of our programs to prevent the release of RMP toxic chemicals and all other chemicals used in our plant.\r\n\r\nEmployee Participation\r\nThe Dow Chemical Company truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analysis. Daily checks and monitoring is done to check for leak and identify other safety hazards. \r\n\r\nEmployee Training\r\nTraining programs have been developed for all employees. The training consist of on Job training which requires the employee to go through the learning review board process so that they can be evaluated for competency. Some training is also completed through web based training. The training matrix is posted in appropriate places so all employees are aware of their training needs.Refresher training is provided at least every three years and more frequently as needed.\r\n\r\n\r\nMOC process\r\nThis procedure is in place to properly manage the changes involving processes, chemicals, technology, people, equipment or facilities. MOCs are tracked in a Web\r\nbased system developed by Dow Chemical. Man"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000110342,
      "SummaryText": "Executive Summary\r\n\r\n1.0 Introduction\r\nThe Dow Chemical Company facility in Marietta, GA is strongly committed to employee, public and environmental safety.  Our continuing work to prevent accidents and releases from occurring, as well as our preparations to respond to incidents should they occur, help to ensure the safety of our employees and the public as well as protection of the environment. This summary provides an overview of the risk management activities at the Marietta plant  and a discussion of our response to the EPAs Risk Management Plan.\r\n\r\n2. General Information\r\n\r\nThe Marietta plant is located in Marietta, Georgia in cobb county. The plant produces over 300 different formulations to commercial customers that are engaged in making polyurethanes, the products that our customers make end in applications such as insulation, automotive seats, furniture, running tracks and medical application.\r\n\r\nThe plant produces over 120 million pounds annually and use over 300 raw materials and employs about 120 people. The plant is actively engaged in community activities including membership to the Cobb County Resource Council.\r\n\r\n3.0 EPA Risk Management Program\r\nIn a series of rules promulgated between 1994 and 1998, updated in 2004 and 2017, the U.S.Environmental Protection Agency established the Risk Management Program (RMP) under the\r\nClean Air Act containing a list of toxic and flammable chemicals. Facilities that manage more than a threshold amount of a listed chemical are subject to the RMP. Covered facilities must assess the risks associated with their management of the listed chemicals and produce a plan to prevent releases and accidents. In order to assist in emergency planning, covered facilities must evaluate a worst case and alternative case scenarios that would result from the release of a listed chemical\r\n\r\n4.0 Regulated Substances\r\nThe Marietta plant has one RMP toxic chemical at threshold quantities: Toluene Diisocyanate (unspe"
    }
  ]
}