{
  "FacilityID": 1000090165,
  "FacilityName": "Hawkins Industrial Group - Rosemount",
  "FacilityStr1": "13005 Courthouse Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Rosemount",
  "FacilityState": "MN",
  "FacilityZipCode": "55068",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27037",
  "LEPC": "MN RRC Dist VI",
  "FacilityLatDecDegs": "44.761464",
  "FacilityLongDecDegs": "-93.029873",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.hawkinsinc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 33936330,
  "ParentCompanyName": "Hawkins, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 41199639,
  "Company2DUNS": 0,
  "OperatorName": "Hawkins, Inc.",
  "OperatorStr1": "2381 Rosegate",
  "OperatorStr2": null,
  "OperatorCity": "Roseville",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55113",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kristopher Johnson",
  "RMPTitle": "HSE Director",
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000220673",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-08-21 00:00:00",
  "SafetyInspectionBy": "Department of Homeland Security",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-10-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-10-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-10-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-10-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112134,
      "AltID": "Aqua Ammonia",
      "FacilityID": 1000090165,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000113467,
          "ProcessID": 1000112134,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000140156,
          "ProcessID": 1000112134,
          "ChemicalID": 57,
          "Quantity": 238000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000640156,
          "ProcessID": 1000112134,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090165,
      "SummaryText": "Introduction\n\nHawkins, Inc. is a formulator, manufacturer, blender, distributor, and sales agent for thousands of industrial chemicals and reagent grade laboratory chemicals sold to municipalities and businesses throughout Central United States.  Thousands of water treatment facilities, manufacturers, food and dairy producers, research labs and many other organizations depend on Hawkins for the chemical products they need. These products range from potassium carbonate to chlorine to FCC grade citrates and phosphates.\n\n\n\nHawkins is headquartered in Roseville, Minnesota. Our facilities are located throughout the Central United States and receive, store, distribute and, in some cases, manufacture products.  From the moment we make contact with a customer or potential customer, we work to provide the best service possible-whether it's arranging for a holiday delivery, making arrangements for unusual products, or simply just delivering on time, every time. The proof? Many of our customers have been with Hawkins for more than 20 years.  \n\n\n\nOur mission is to supply high quality products and innovative solutions with an exceptional level of customer service.  We will adapt quickly to the changing needs of our customers with a keen focus on technical expertise, teamwork, safety, and responsible care of the environment and of our community while striving to maximize long-term shareholder value.\n\n\n\nExecutive Summary \n\nPrevention and Emergency Response policies:  Hawkins' management and safety committees have set a motto of \"Think Safe! Be Safe!\" regarding accidents and injuries.  Support for this motto is manifested in several ways, including:\n\n1.    A corporate Health, Safety and Environmental (HSE) department staffed with trained professionals.\n\n2.    Training programs in chemical safety, safe material handling, accident prevention and emergency response.\n\n3.    Prompt investigation of near misses and incidents to identify root causes and implement measures to prevent future occurre"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090165,
      "SummaryText": "nces.\n\n4.    Adherence to all Federal and State regulations governing our operations.\n\n5.    Compliance with DOT requirements regarding shipping and materials.\n\n6.    Internal and 3rd party audits of Health, Safety and Environmental procedures at all Hawkins locations.\n\n7.    Members in good standing with the National Association of Chemical Distributors.\n\n\n\nStationary Source and Regulated Substances Handled:  The Hawkins - Rosemount Facility is an additive manufacturing facility that manufactures, stores, and distributes materials used by the farming industry and other uses.  The products covered in our Risk Management Plan for this facility is ammonia solution >20% concentration (NOT anhydrous ammonia).  This site is not regulated by OSHA Process Safety Management.\n\n\n\nPrevention Program:  Accident prevention is achieved through handling procedures that properly protect chemicals during shipping, manufacturing, and storage. This starts with receiving aqueous ammonia in DOT approved tank-trailers and then transferring the product into a 12,500-gallon, carbon steel aboveground storage tank (AST).   Unloading activities are conducted in a coated concrete containment area that will catch any accidental spills. The ASTs are in concrete containment basins that are equipped with high level indicators to help prevent accidental overflow.  All tanks, piping and containment areas are constructed and maintained in accordance with Minnesota Rules (?7151) and/or the requirements set forth in the facility's Aboveground Storage Tank Permit (if applicable).  \n\nPrevention continues by having employees trained in proper handling procedures and using unloading checklists. Employees are also equipped with proper equipment to safely store raw materials and manufacture and package additives for customer delivery. \n\n\n\nAdherence to OSHA workplace rules is just another part of our safety program. We also follow industry standards, such as those of the National Association of Chemical Distributors to e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090165,
      "SummaryText": "nsure that our equipment and procedures are protective of the health and safety of our employees, the environment, and the surrounding community.\n\n\n\n5-Year Accident History:  As a result of our diligence, there has not been an accidental release from ammonia that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage at this facility since the start-up of operations. \n\n\n\nEmergency Response:  In the event of an ammonia solution release, Hawkins employees are trained to investigate the situation and if needed:\n\n1.    Don proper personal protective equipment, stop the release, make necessary notifications, and clean up the release.\n\n2.    Call the local fire department for hazmat assistance, if needed.\n\n3.    Evacuate to a safe distance.  \n\nThe local fire department has toured the facility and is aware of the chemicals on site.   \n\n\n\nPlanned Changes:  While Hawkins desires to continually improve safety, there are no specific changes planned other than to continue compliance with industry standards and government regulations and our own commitment to \"Think Safe! Be Safe!\"\n\n"
    }
  ]
}