{
  "FacilityID": 1000030156,
  "FacilityName": "South Atlantic facility",
  "FacilityStr1": "1091 Remount Road",
  "FacilityStr2": null,
  "FacilityCity": "North Charleston",
  "FacilityState": "SC",
  "FacilityZipCode": "29406",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45019",
  "LEPC": "Charleston County LEPC",
  "FacilityLatDecDegs": "32.902083",
  "FacilityLongDecDegs": "-079.97946",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.nocs.com",
  "FacilityEmailAddress": "morris.clark@nocs.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "New Orleans Cold Storage",
  "Company2Name": null,
  "CompanyDUNS": 8162380,
  "Company2DUNS": 0,
  "OperatorName": "Mark Blanchard",
  "OperatorStr1": "3411 Jourdan Road",
  "OperatorStr2": null,
  "OperatorCity": "North Orleans",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70216",
  "OperatorZipCodeExt": null,
  "RMPContact": "Randy Scarpero",
  "RMPTitle": "Vice President of Operations",
  "FTE": 32,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000144122",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-02-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-11-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-11-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-11-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-11-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.89804,
  "FRS_Long": -80.03165,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": ".1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036784,
      "AltID": "2",
      "FacilityID": 1000030156,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000037166,
          "ProcessID": 1000036784,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000044408,
          "ProcessID": 1000036784,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544408,
          "ProcessID": 1000036784,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000030156,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nSOURCE AND PROCESS DESCRIPTION.\n\n\n\nThe main operation at NOCS South Atlantic facility is the warehousing and distribution of frozen bulk foodstuff. The facility consists of several cold storage rooms that are cooled by a main refrigeration system. The facility also consist of two \"blast Freezer\" systems that are used to maintain designated areas at very low temperatures (-30 degrees F.) All refrigeration units utilize Anhydrous Ammonia (100% conc.) as the system refrigerant. \n\n\n\nSUMMARY OF MAJOR HAZARDS\n\n\n\nThe primary hazard associated with a release of Anhydrous Ammonia is exposure of persons and potential environmental impact to areas surrounding facility. Anhydrous Ammonia is a toxic gas that is also a corrosive irritant to eyes, skin, respiratory tract and mucous membranes. Contact of evaporating liquid with skin will freeze the tissue, then produce a caustic burn. However, the burn hazard should be considered secondary to the toxic effects from exposure to the gas.\n\n\n\nThe toxic endpoint for ammonia is 200 ppm (0.14 mg/L). This airborne concentration has been published by the American Industrial Hygiene Association (AIHA) and is the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\n\n\n\n\n\nCONSEQUENCES OF FAILURE TO CONTROL THE HAZARDS\n\n\n\nAlthough the release of all the Anhydrous Ammonia within a 10 minute period (considering a catastrophic failure of the main receiver) is extremely unlikely, these are the parameters used in the worst case scenario.\n\nIn this case, the toxic endpoint was calculated to be 1.5 miles. Based on an interpretation of the USGS map, it is estimated that a maximum of 11,452 people reside within the vulnerable zone.\n\n\n\nThe alternative scenario is based on an actual incident at another facility "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000030156,
      "SummaryText": "at which approximately 1,000 pounds of ammonia was released into a cold storage room.  The toxic endpoint is calculated to be 0.1 miles. Within this distance the residential population is zero.\n\n\n\nThere are no designated environmental management areas within the worst case vulnerable zone, however, Cooper River and Goose Creek and associated marshlands are located within the facilities vulnerable zone.\n\n\n\nEXPLANATION OF HOW RELEASES ARE PREVENTED.\n\n\n\nAlthough a catastrophic release would have ample opportunity to be vented to the atmosphere, the engine room enclosure does not provide a significant degree of isolation in the more likely release scenario.  An active countermeasure to any leaks or releases is the ammonia sensors in the engine room and cold storage rooms. If ammonia is detected, an audible alarm is immediately sounded within the warehouse and an alert is sent to a 24 hour/day monitoring service.\n\n\n\nOther process controls include automatic cut off devices in the event of deviation from prescribed limits\n\n(pressure, temperature, process level, etc.), check valves and relief valves.\n\n\n\n\n\nTo further reduce the likelihood of an accidental release, an comprehensive inspection program has been established for all system components and operating parameters. This includes a daily inspection of compressors, pumps and associated equipment, and a weekly, monthly and annual inspection and maintenance schedule that is rigidly followed and documented, ensuring a well maintained physical plant.\n\n\n\nAll operating procedures have been recently reviewed/revised and all personnel responsible for the proper operation of the refrigeration units have received training in the procedures. The elements of this program will further reduce the possibility of an accidental release caused by human error.\n\n\n\nSTEPS TAKEN TO ADDRESS HAZARDS.\n\n\n\nThe primary methods for generating recommendations are through periodic review and/or revision of Process Hazard Analysis (PHAs), incident inves"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000030156,
      "SummaryText": "tigations and operational procedures review (Management of Change). These reviews provide a means for continuous improvement.\n\n \n\n\n\nExecutive Summary\n\n\n\n\n\nRESPONSE ACTION IN THE EVENT OF A RELEASE.\n\n\n\nThe onsite Emergency Action Plan provides specific guidance for action to be taken by First Responders, Incident Managers, Supervisors, and General Employees in the event of a release. This event, whether triggered by sensor and alarm or personnel, results in a rapid and decisive response to minimizing the potential impact to onsite personnel, off site populations, and other sensitive areas. As noted above, on site controls and mitigation, coupled with onsite personnel evacuation and accountability, provide a rapid notification plan to bring in local and state agencies for assistance in the event the local population may potentially be affected. \n\n"
    }
  ]
}