{
  "FacilityID": 1000007895,
  "FacilityName": "Sims Bayou Plant",
  "FacilityStr1": "13840 Croquet",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77085",
  "Facility4DigitZipExt": "2602",
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County/Houston LEPC",
  "FacilityLatDecDegs": "29.625833",
  "FacilityLongDecDegs": "-95.475833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.houstontx.gov",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Houston",
  "OperatorStr1": "P.O. Box 1562",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77251",
  "OperatorZipCodeExt": "1562",
  "RMPContact": "Yvonne Forrest",
  "RMPTitle": "Senior Assistant Director",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000126286",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-04-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-01-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-17 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.62375,
  "FRS_Long": -95.47346,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009126,
      "AltID": "Chlorination",
      "FacilityID": 1000007895,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000009365,
          "ProcessID": 1000009126,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000010331,
          "ProcessID": 1000009126,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000510331,
          "ProcessID": 1000009126,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000007895,
      "SummaryText": "Executive Summary for the City of Houston Sims Bayou Plant\n \n1.    Accidental Release Prevention and Emergency Response Policies\nSims Bayou Plant is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at its facility.  It is policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n2.    The Stationary Source and the Regulated Substances Handled\nThe facility's primary activities encompass treating ground water.  Sims Bayou Plant has one regulated substance present at its facility.  This substance is chlorine, which is used for disinfection. The maximum inventory of chlorine at the facility is 8,000 pounds.\n\n3.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nSims Bayou Plant has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at the stationary source.\n\nProcess Safety Information\nSims Bayou Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nSims Bayou Plant conducts comprehensive studies to ensure that hazards associated with its processes are identified and controlled efficiently.  The methodology used to carry out these analyses is inspection of the plant to identify deficiencies throughout the system.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated routinely.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperatin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000007895,
      "SummaryText": "g Procedures\nFor the purposes of safely conducting activities within the facility's covered processes, Sims Bayou Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, and normal shutdown.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nSims Bayou Plant has a comprehensive training program in place to ensure that employees who are responsible for processes are competent in the operating procedures associated with these processes.  Refresher training is provided as needed.\n\nMechanical Integrity\nSims Bayou Plant carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Sims Bayou Plant to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of maintenance procedures was performed on February 12, 2009.  Process operators, maintenance personnel, or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established processes are conducted at Sims Bayou Plant. These reviews are conducted to confirm that construction, equipment"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000007895,
      "SummaryText": ", operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nSims Bayou Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every three years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nSims Bayou Plant promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five years.\n\nEmployee Participation\nSims Bayou Plant truly believes that process safety management and accident prevention is a team effort.  Employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, Sims Bayou Plant hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Sims Bayou Plant has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n4.    Five-year Accident History\nSims Bayou Plant has had an excellent record of preventing accidental releases over the last five years.  Due to its stringent release prevention policies, there have be"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000007895,
      "SummaryText": "en no accidental releases during this period.\n\n5.    Emergency Response Plan\nSims Bayou Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, and notification of local emergency response agencies and the public.\n\nTo ensure proper functioning, the facility's emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within Sims Bayou Plant's processes that would require a modified emergency response."
    }
  ]
}