{
  "FacilityID": 1000065905,
  "FacilityName": "Siouxland Energy Cooperative",
  "FacilityStr1": "3890 Garfield Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sioux Center",
  "FacilityState": "IA",
  "FacilityZipCode": "51250",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19167",
  "LEPC": "Sioux County LEPC",
  "FacilityLatDecDegs": "43.087099",
  "FacilityLongDecDegs": "-096.230914",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.siouxlandenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 52707770,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jeff Altena",
  "OperatorStr1": "3890 Garfield Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Sioux Center",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51250",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Westra",
  "RMPTitle": "Lab Manager",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200597",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-02-22 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-03-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-10-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-10-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-10-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000082542,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000065905,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000083743,
          "ProcessID": 1000082542,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000102632,
          "ProcessID": 1000082542,
          "ChemicalID": 56,
          "Quantity": 76011.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000602632,
          "ProcessID": 1000082542,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000082543,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000065905,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000083744,
          "ProcessID": 1000082543,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000102633,
          "ProcessID": 1000082543,
          "ChemicalID": 155,
          "Quantity": 583800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000090421,
              "ProcessChemicalID": 1000102633,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000602633,
          "ProcessID": 1000082543,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000065905,
      "SummaryText": "RISK MANAGEMENT PLAN EXECUTIVE SUMMARY\n\nSiouxland Energy Cooperative (SEC)\n\n\n\nThis RMP resubmission is being submitted to fulfill the 5-year update requirement.  \n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\n\nSEC has an ongoing commitment to worker and public safety.  This commitment is demonstrated in the resources invested in accident prevention, such as training personnel on the proper operation and maintenance of plant equipment and preventative maintenance programs.  SEC has emergency response policies in place that are adressed in the facility's Heath and Safety Policies, SPCC/FRP, and Emergency Action Plan.  Most of the listed Plans have a minimum of annual training requirements to keep employees educated on emergency response procedures in place at the facility.  New employees are required to read the Plans listed above and undergo training on emergency response procedures prior to initiating responsibilities onsite.  SEC's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, plant personnel will respond to contain the release as necessary.\n\n\n\nDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED:\n\nSEC is located in Sioux Center, Sioux County, Iowa.  The facility operates 24 hours per day, 7 days per week for the purpose of manufacturing fuel grade ethanol from the natural fermentation of corn.  The regulated substances stored at the facility are anhydrous ammonia and a flammable mixture, natural gasoline (denaturant).  \n\n\n\nWORST CASE AND ALTERNATE CASE SCENARIOS:\n\nWorst Case Scenarios:\n\n1.  Anhydrous Ammonia - Anhydrous ammonia is stored as a gas liquefied by pressure in an aboveground steel tank.  The worst case scenario used is a release of the entire contents of the storage vessel, creating a toxic vapor cloud.  A determination spreadsheet is included as part of backup documentation onsite detailing the conversion from gallons to pounds of a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000065905,
      "SummaryText": "mmonia.  RMP Comp was used to determine the worst case distance to endpoint, the model results were 4.9 miles radius and are also included as part of the backup documentation maintained onsite.  The ammonia tank sits on concrete saddles. Passive mitigation was not included as part of this scenario.  Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information was obtained using Google Earth.  Sixmile Creek and Dry Creek are located in the endpoint radius for a worst case release of ammonia.\n\n\n\n2.  Flammable Mixture (Denaturant):  The flammable mixture stored onsite is natural gasoline, typically referred to as denaturant.  Natural gasoline is used onsite to denature ethanol prior to shipment off site.   Denaturant is stored in a  steel tank in the facility tank farm.  The tank is located within a diked containment structure that contains an impermeable liner with gravel overlay.  The facility's denaturant safety data sheet (SDS) was used to determine RMP applicability.  The worst case scenario used is the release of the entire contents of the denaturant tank, causing a vapor cloud explosion.  RMP Comp was used to determine the worst case distance to endpoint, the model results were 0.7 mile radius and are also included as part of the backup documentation maintained onsite.   Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information was obtained using Google Earth.  Un-named tributaries to Sixmile creek are located in the endpoint radius for a worst case release of denaturant.  \n\n\n\nAlternate Scenarios:\n\n1. Anhydrous Ammonia:  The alternate scenario used for anhydrous ammonia is a release due to a rupture disk/relief valve failure from the ammonia piping system.  This scenario is considered the most likely cause of an ammonia release onsite.  The alternate release duration assumed is 30 minutes with "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000065905,
      "SummaryText": "an atmospheric stability of D and wind speed of 3.0m/sec.  The facility control room is manned 24 hours/day and would be alerted of the relief valve failure at the ammonia tank within minutes.  RMP Comp was used to determine the alternate distance to endpoint, the model results were 0.3 mile radius and are part of the backup documentation maintained onsite.  Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information was obtained using Google Earth.  No environmental receptors are affected by an alternate case release of ammonia.  \n\n\n\nFlammable Mixture (Denaturant):  The alternate scenario used for the flammable mixture is the release of natural gasoline due to a tanker truck loadout spill, causing a vapor cloud fire.   The endpoint used was an over pressurization of 1 PSI, a worst case option.  Denaturant deliveries at the facility typically occur during normal business hours with a facility staff member overseeing loadout operations - therefore a release at the loadout area could be ceased within minutes by manual overrides.  The loadout area also has a catchment basin with underground piping to secondary containment of the tank farm.   For this scenario passive and active mitigation was not considered, as the mitigation strategies currently in place would not contain a vapor cloud fire.  RMP Comp was used to determine the alternate distance to endpoint, the model results were <0.1 mile radius and are part of the backup documentation maintained onsite. Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information was obtained using Google Earth.  No environmental receptors are affected by an alternate case release of denaturant.\n\n  \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\n\nPlease review the first section of this Executive Summary for the general acciden"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000065905,
      "SummaryText": "tal release prevention program information.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY:\n\nSEC has not had an accident related to any of the covered processes since the start-up of facility operations.\n\n\n\nEMERGENCY RESPONSE PROGRAM:\n\nSEC has several safety programs in place at the facility that incorporate emergency response, including the Health and Safety Policies and FRP.  SEC also has an Emergency Response Action Plan that details evacuation and response procedures for spills and releases, fire, etc.  The Plans listed in this section have been prepared in accordance with applicable regulations, as necessary.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nSEC will continue to provide training programs to ensure the safety of employees and contractors.  "
    }
  ]
}