{
  "FacilityID": 1000034962,
  "FacilityName": "Searles Valley Minerals - Westend Facility",
  "FacilityStr1": "80201 Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Trona",
  "FacilityState": "CA",
  "FacilityZipCode": "93562",
  "Facility4DigitZipExt": "0367",
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "35.708056",
  "FacilityLongDecDegs": "-117.393611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Nirma Limited",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Searles Valley Minerals",
  "OperatorStr1": "P. O. Box 367",
  "OperatorStr2": null,
  "OperatorCity": "Trona",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93592",
  "OperatorZipCodeExt": "0367",
  "RMPContact": "Arzell Hale",
  "RMPTitle": "Dir. Gov. and Public Relations",
  "FTE": 46,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127347",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "90002",
  "SafetyInspectionDate": "2007-03-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 35.76024,
  "FRS_Long": -117.37663,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000042770,
      "AltID": "Westend Facility Ammonia",
      "FacilityID": 1000034962,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000043152,
          "ProcessID": 1000042770,
          "NAICSCode": "212391",
          "_desc": {
            "NAICS_CODE": "212391",
            "NAICS_DESCRIPTION": "Potash, Soda, and Borate Mineral Mining"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000051344,
          "ProcessID": 1000042770,
          "ChemicalID": 56,
          "Quantity": 187416.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000551344,
          "ProcessID": 1000042770,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000034962,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis document comprises the Year 2009 Five Year Update for the Federal Risk Management Plan (Federal RMP Plan) and the California Accidental Release Prevention Program Risk Management Plan (CalARP RMP) for the Westend Facility located at 80201 Trona Road in Trona, California 93562 (hereinafter referred to as the facility or the subject facility).  The Westend Facility is owned and operated by Searles Valley Minerals which is a sub-division of Nirma Limited.  Searles Valley Minerals? initial submittal for this facility was made to USEPA and to the San Bernardino County Fire Department on June 21, 1999.\n\nThe purpose of this document is to comply with the risk management planning and update requirements as set forth in the Code of Federal Regulations, Title 40, Part 68 (also known as the Federal Risk Management Plan Regulations) and the California Code of Regulations, Title 19, Division 2, Chapter 4.5, Article 3, Section 2745.3 (also known as the California Accidental Release Prevention Program Risk Management Plan ? CalARP RMP Regulations).  The scope of the Federal RMP and CalARP RMP includes all operations conducted at the subject facility that involve the storage, handling and/or use of anhydrous ammonia (i.e., anhydrous ammonia is the only regulated substance handled at the Westend Facility above the threshold quantity).\n\nSearles Valley Minerals is strongly committed to the health and safety of its employees, the public and the environment.  This commitment is demonstrated by the comprehensive accidental release prevention program implemented at the Westend Facility covering aspects of operations such as design, installation, operations and maintenance, training, emergency response and other areas.  It is the Policy of Searles Valley Minerals to implement appropriate controls to prevent potential releases of regulated substances.  This is achieved through strong leadership, teamwork, effective communications, and by striving towards continuous i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000034962,
      "SummaryText": "mprovement in all business areas.\n\nThis commitment is consistent with the company?s environmental, health and safety policy that provides that:\n?    ALL facilities will be designed, operated, and managed to protect the health and safety of employees and the public;\n?    ALL employees will be educated on the applicable environmental, health and safety standards and procedures;\n?    Sufficient human and financial resources will be allocated to sustain these goals; and\n?    Audits will be conducted regularly to verify compliance with this Policy.\n\nThese Corporate Policies also emphasize the importance of complying with OSHA?s Process Safety Management Standard (as well as the RMP and CalARP regulations), so that ALL employees and the surrounding community will be adequately protected from potential fire, explosion, and/or toxic release hazards associated with catastrophic releases.\n\nSearles Valley Minerals is also proud to be an active participant in the Chemical Manufacturers Association ? Responsible Care Program.  As such, Searles Valley Minerals pledges to manage its business according to the principles of the Responsible Care Program.  As a member of CMA, Searles Valley Minerals is also committed to supporting a continuous effort to improve the industry?s responsible management of chemicals.  \n\nES 1.0    DESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe primary operation conducted at the Westend Facility is NAICS Code 212391 ? Potash, Soda, and Borate Mineral Mining.\n\nFacility Location\nThe Searles Valley Minerals ? Westend Facility is located in California?s Mojave Desert, in the Searles Valley, west of Searles Lake at 80201 Trona Road in Trona, California 93562.  \n\nFacility Description\nAs stated previously, the Westend Facility is part of Searles Valley Minerals, which is a subdivision of Nirma Limited.  The company's Searles Valley facilities, tap into one of the richest sources of diversified minerals and chemicals on earth ? the location contains 98 of t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000034962,
      "SummaryText": "he world's 110 known chemical elements.  Searles Valley Minerals extracts, chemically processes and ships minerals and inorganic chemical compounds to customers all over the world.  The company currently produces soda ash, sodium borates, boric acid and natural sulfate.  \n\nDescription of Regulated Substance Use\nSearles Valley Minerals? Westend Facility produces borax and sodium sulfate by processing Brines obtained from Searles Lake.  \nAnhydrous ammonia is used (in the manufacturing of borax and sodium sulfate) as a refrigerant (for cooling) in a closed loop system.  The cooling process (i.e., the use of anhydrous ammonia) is a 24-hour per day, 365-day per year operation that is essential to manufacturing operations conducted at the Westend Facility.\n\nThere are four distinct uses of anhydrous ammonia at the Westend Facility:\n1.    To cool the gas-turbine generator inlet air (thus increasing the generator?s capacity and efficiency);\n2.    To chill brine in the borax manufacturing process (thus removing the heat of crystallization);\n3.    To chill brine in the sulfate crystallization process; and\n4.    To reduce NOx emissions in a selective catalytic reduction (SCR) unit.\n\nThe anhydrous ammonia storage, handling and use system at the Westend Facility consists of the following major components:\n?    The main high pressure receiver;\n?    Four liquid recirculating units (LRUs);\n?    Seven ammonia compressors;\n?    Six evaporative condensers (i.e., cooling towers);\n?    The SCR unit and injectors, etc.;\n?    Transfer piping and supports; and\n?    Process instrumentation, detection and monitoring devices.\n\nThe anhydrous ammonia storage, handling and use system at the Westend Facility consists of an assortment of process vessels, heat exchangers and compressors connected via an extensive network of piping in a closed loop system.  Anhydrous ammonia is kept under high pressure (and therefore in a liquefied form) in the main High Pressure Receiver (HPR).  The HPR supplies four Liquid Recirculating Units (LRU"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000034962,
      "SummaryText": "s 1 through 4) each of which is dedicated to specific processes at the Westend Facility.  The LRUs in turn supply liquid ammonia to their process where the pressure of liquid ammonia is reduced through expansion valves.  This pressure reduction results in a transformation of liquid ammonia to vapor phase and results in cooling.  As the ammonia vapor moves through the process, unwanted heat is transferred from the process to the ammonia vapor indirectly (the desired end result).  This indirect heat transfer results in a warming of the ammonia vapor (thus losing its cooling value).  The ammonia vapor is therefore compressed, cooled indirectly (in condensers/cooling towers), liquefied and returned to the main High Pressure Receiver (making it available again).  LRU Nos. 1 and 2 are dedicated to cooling the inlet air for the gas turbine generators and the SCR Unit, LRU No. 3 is dedicated to the Sulfate Crystallization Process and LRU No. 4 is dedicated to the Borax Manufacturing Process.\n\nSite Security\nA chain link fence surrounds the Westend Facility.  Additionally, the Facility is protected via manned 24-hour security.  These site security provisions are intended to prevent unauthorized access to Facility areas including those areas where anhydrous ammonia is stored, handled or used, thus adding a level of safety for the storage of anhydrous ammonia at the Facility.\n\nES 2.0    ACCIDENTAL RELEASE SCENARIOS\n\nThe Federal RMP regulations and the CalARP RMP regulations require that at least two types of release scenarios be evaluated for their potential to impact off-site populations:\n\n?    the worst case release; and\n?    an alternative release (an accident scenario that is more credible than the worst-case release scenario).\n\nA number of hypothetical accidental release scenarios were postulated and evaluated for the Five Year Federal RMP/CalARP RMP Update.  These scenarios were categorized into worst-case release scenarios and alternative release scenarios.  Each of these categor"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000034962,
      "SummaryText": "ies of hypothetical accidental release scenarios is discussed below.\n\nANHYDROUS AMMONIA\n\nWorst-Case Release Scenario\nIn this scenario, the main Anhydrous Ammonia High Pressure Receiver on site experiences a catastrophic failure due to an unknown event.  This scenario could be initiated by an external event (i.e., an airplane, missile or meteorite impacting the area where the receiver located).  It is highly improbable that this scenario would be initiated by a seismic event.  However, the possibility of this scenario being initiated by a seismic event cannot be completely discarded.  This scenario is considered to be extremely unlikely.  In the extremely unlikely case that this scenario occurs, up to 85,190-pounds of anhydrous ammonia could be released (administrative controls limit the vessel?s capacity to 85-percent full).  The release of ammonia would occur outdoors.  Thus, it was assumed that the ammonia released during the catastrophic accident forms a cloud of ammonia vapor which is free to migrate off-site.  No liquid pooling was considered to occur during the release (this assumption is conservative in nature and results in the largest estimated vulnerable zone).  Utilizing the BREEZE DEGADIS PLUS MODEL, the estimated vulnerable zone for this hypothetical accidental release scenario is approximately 2.4-miles.\n\nAlternative Release Scenarios\nAlternative release scenarios which are considered to be more likely to occur are those which may result in the release of anywhere from less than one-pound to up to 43,000-pounds of anhydrous ammonia.  These scenarios include situations such as accidental releases during anhydrous ammonia delivery to- or loading of- the main high pressure receiver at the facility, pinhole leaks in either the high pressure or low pressure anhydrous ammonia transfer piping (which contain anhydrous ammonia in either liquid or vapor phase), a partial or complete failure of the anhydrous ammonia transfer lines (containing anhydrous ammonia in"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000034962,
      "SummaryText": " either liquid or vapor phase) at various points in the system (above-ground), or releases of anhydrous ammonia vapor during pressure relief events at any of a number of vessels or lines.  In order to be conservative in the estimation of the vulnerable zone, it was assumed that 43,000-pounds of anhydrous ammonia (in liquid phase) is released due to a failure of a three-inch anhydrous ammonia liquid transfer line connected to Liquid Recirculating Unit No. 3 (the vessel does not have an automatic shutoff valve.  The failure was assumed to occur within four feet of the connection to the Unit.  The resulting cloud of ammonia vapor was assumed to freely migrate off-site.  Utilizing the USEPA?s RMP*COMP Software Program, the estimated vulnerable zone for this hypothetical accidental release scenario is approximately 1.6-miles.\n\nES 3.0    FIVE YEAR ACCIDENT HISTORY\n\nDuring the five years preceding the submittal of the Year 2009 Five Year Federal RMP/CalARP RMP Update (i.e., from June 21, 2004 through June 21, 2009), the Facility has NOT had any releases of chlorine that have resulted in:\n?    Onsite deaths, injuries, or significant property damage; or\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\nES 4.0    ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe Accidental Release Prevention Program at the Westend Facility consists of a series of programs, procedures and policies designed to minimize the risk of accidental releases involving anhydrous ammonia.  These programs include design and operating controls such as compliance with specified codes, the Company?s health and safety program, numerous standard operating procedures, the equipment inspection and maintenance program (including a mechanical integrity and preventive maintenance program), the management of change program, pre-start-up review, fire protection and hot work permit programs, management of- and safety of- contractors, a"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000034962,
      "SummaryText": "ccident/incident investigation procedures, emergency response plans, the Federal RMP/CalARP RMP/OSHA PSM Program compliance auditing program, the Federal RMP/CalARP RMP/OSHA PSM Program record keeping program and a variety of personnel training programs.  Details of each of these components of the Facility?s Accidental Release Prevention Program are provided in the document entitled Federal Risk Management Plan (Federal RMP), California Accidental Release Prevention Program Risk Management Plan (CalARP RMP), OSHA Process Safety Management (OSHA PSM) Program, Volume I - Prevention Program.  \n\nThere are a number of detection and monitoring devices and alarms designed to ensure the continued safe operation of the Westend Facility?s Processes (i.e., which encompasses the storage, handling and use of anhydrous ammonia).  These devices are located throughout the Process Areas and monitor various aspects of Operations.  \n\nES 5.0    EMERGENCY RESPONSE\n\nSearles Valley Minerals recognizes that emergency preparedness, emergency planning and emergency response are an integral component of risk management.   As such, two extensive and detailed emergency response plans have been developed and implemented at the Westend Facility.  These Plans include ALL aspects of emergency response including adequate first aid and medical treatment, evacuation and notification of LERC/LEPD and the Public.\n\nALL emergency response equipment is frequently tested, inspected and serviced to ensure proper functioning.  The emergency evacuation sirens are tested every Friday at noon.  In addition, the emergency response plans are reviewed periodically and updated (as needed) to reflect pertinent changes in processes, operations and/or personnel that may require a modified emergency response.  Emergency response drills and exercises are conducted periodically to ensure rapid response and effectiveness of the emergency response team.  ALL employees and contractors are trained in the requirements of these em"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000034962,
      "SummaryText": "ergency response plans.\n\nIn the unlikely event that a release does occur, Searles Valley Minerals environmental, health and safety (EHS) staff and HazWOper trained emergency response personnel are at hand to control and mitigate the effects of the release.  Searles Valley Minerals coordinates its emergency response actions and efforts with several State and County Agencies including the San Bernardino County (Volunteer) Fire Agency.  These activities provide additional emergency response expertise to both the community and Searles Valley Minerals facilities.\n\nES 6.0    PLANNED CHANGES TO IMPROVE SAFETY\n\nA detailed hazard and operability study update (i.e., process hazards analysis update) was performed on ALL operations involving anhydrous ammonias part of the Year 2004 Five Year Update  in order to enhance the safety of the Westend Facility and to evaluate the potential for accidental releases.  For the Year 2009 Five Year Update, that work was revalidated.  As a result of the process hazards analysis update performed a number of recommendations were made.  ALL recommended actions should be implemented by May 15, 2010.  \n\nES 7.0    FOR MORE INFORMATION\n\nSearles Valley Minerals recognizes that some persons may be interested in obtaining more detailed information regarding the Five Year Federal RMP and CalARP RMP Update and various Prevention Program components not discussed herein.  Interested parties that have additional questions regarding the Westend Facility Risk Management Plan and/or the Anhydrous Ammonia Prevention Program, are directed to contact:\n\n    Mr. Donald S. Schuyler\n    Environmental Engineer\n    c/o Searles Valley Minerals\n    P.O. Box 367\n    Trona, California 93592"
    }
  ]
}