{
  "FacilityID": 1000010482,
  "FacilityName": "Allen Harim Foods, LLC - Harbeson Plant",
  "FacilityStr1": "18752 Harbeson Road",
  "FacilityStr2": null,
  "FacilityCity": "Harbeson",
  "FacilityState": "DE",
  "FacilityZipCode": "19951",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "10005",
  "LEPC": "Sussex LEPC",
  "FacilityLatDecDegs": "38.720209",
  "FacilityLongDecDegs": "-75.288753",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 64894025,
  "Company2DUNS": 64894025,
  "OperatorName": "Allen Harim Foods, LLC",
  "OperatorStr1": "Post Office Box 63",
  "OperatorStr2": null,
  "OperatorCity": "Harbeson",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19951",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Plant Manager",
  "FTE": 669,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000076348",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-05-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-08-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-08-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.71972,
  "FRS_Long": -75.28944,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1000",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000012416,
      "AltID": null,
      "FacilityID": 1000010482,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000012804,
          "ProcessID": 1000012416,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000014339,
          "ProcessID": 1000012416,
          "ChemicalID": 56,
          "Quantity": 31012.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000514339,
          "ProcessID": 1000012416,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000010482,
      "SummaryText": "Allen Harim Foods, LLC\n\n\n\nAllen Harim Foods, LLC (Allen Harim) operates and maintains a poultry-processing plant in Harbeson, Delaware.  \"Our mission is to create a safe work environment that encourages positive attitude by communicating honestly, directly and precisely with trust and respect for one another as we work and achieve a common goal which includes a quality product for our customers.\"  We empha safety in line operation, contractor selection and emergency response.  Our employees are trained to inspect, maintain and operate our equipment to prevent a release of hazardous material.  We have developed and implemented an Emergency Response Plan with a goal to minimize hazards to all employees, visitors and persons in the vicinity.\n\n\n\nPoultry processing require significant refrigeration, which is accomplished via the use of anhydrous ammonia at Allen's Harbeson Plant. \n\n\n\nThis plant has a RMP Program 3 status for the operation of its ammonia refrigeration system used for cooling.  The Program 3 requires preparation of a worse case release scenario for the toxic material stored at this site.  The worst case would be the release of a maximum of 7,076 pounds of ammonia from the System A receiver.  The toxic endpoint would be 1.0 miles downwind.\n\n \n\nThe alternative case for an ammonia release is an 0.13-pound/minute (lb/min) release for 2880 minutes from a condenser coil (e.g. EC-1 or EC-2), which developed as a pinhole leak.  Personnel knowledgeable of the site-specific refrigeration equipment and the process developed this scenario.  The release would be discovered within 2 days due to the daily inspections of the systems' sight glass gauges.  RMP comp was used to calculate the end point based on the estimated time to discover the leak, to isolate the system, and move the ammonia to another vessel. The estimated distance of the toxic end point for this release is <0.1 miles downwind, which is to be reported as O.1 miles.  Operators are trained to use self-conta"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000010482,
      "SummaryText": "ined breathing apparatus to respond to ammonia release. \n\n\n\nAn additional alternative case for an ammonia release was developed for a scenario, which although less likely to occur than the alternate scenario given above, may result in an endpoint off-site.  This alternative case for an ammonia release is a 134.1 lb/min release for 90 minutes from a pipe leak.  Personnel knowledgeable of the site-specific refrigeration equipment and the process developed this scenario.  The release would be discovered within 90 minutes.  RMP comp was used to calculate the end point based on the estimated time to discover the leak, to isolate the system, and move the ammonia to another vessel. The estimated distance of the toxic end point for this release is 0.1 miles downwind.  Operators are trained to use self-contained breathing apparatus to respond to ammonia release. \n\n\n\nAllen Harim has implemented a Process Safety Management (PSM) program, which is designed to prevent or minimize the consequences of releases of ammonia at this site, and complies with OSHA PSM regulation 29 CFR 1910.119.  We maintain up to date piping and instrument drawings, Material Safety Data Sheets, and we have a written preventive maintenance program.  We use a computerized database program to produce work orders for regular preventative maintenance, yearly inspections and to maintain a history of the refrigeration equipment.  We use the International Institute of Ammonia Refrigeration (IIAR) inspection checklist for our yearly inspections.  If any problems are identified, corrective action will be documented on the work order.  Upon completion of the work order, entry into the database will provide a permanent record.  We have developed and updated our PSM manual with extensive employee participation.  We also use the database as a means to scheduled quarterly reviews with the PSM team to ensure that our PSM manual stays \"a living document\".  The PSM manual includes our operating procedures, which are upda"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000010482,
      "SummaryText": "ted as needed and reviewed each year.  Our operators are provided training relative to their respective duties.  They receive both on the job training and outside instruction, all training is documented.  A Process Hazard Analysis (PHA) study was conducted to identify and evaluate potential hazards.  The studies are updated every 5 years or when needed due to a change in the process.  Allen Harim evaluates their PSM program by conducting compliance audits every three years using checklists developed by OSHA.  \n\n\n\nDuring the last 5 years, there have been no reportable releases associated with the ammonia refrigeration process. \n\n\n\nAll Allen Harim employees receive hazard communications training during orientation, which includes evacuation procedures, emergency release notification and alarm signal recognition.  Allen Harim also has established an Emergency Response Team (Team) which is the first line of emergency response for the Harbeson facility.  Employees designated as Emergency Response Personnel are trained at the First Responder level to respond to a release of ammonia.  The makeup of the Team is diverse and includes refrigeration technicians trained in emergency shutdown procedures for the ammonia system.  Allen Harim maintains a close relationship with the local fire company.  The Plant will use 911 to notify appropriate outside agencies.  \n\n\n\nA new alarm system was installed in July 1999 with updates in 2004 and 2005.  Allen Harim has an active PSM program at the Harbeson facility and meets regularly; therefore, Allen Harim should identify any needed safety changes."
    }
  ]
}