{
  "FacilityID": 1000039922,
  "FacilityName": "Helena Chemical Company - Elkhorn, WI",
  "FacilityStr1": "W 6406 County Road A",
  "FacilityStr2": null,
  "FacilityCity": "Elkhorn",
  "FacilityState": "WI",
  "FacilityZipCode": "53121",
  "Facility4DigitZipExt": "2929",
  "FacilityCountyFIPS": "55127",
  "LEPC": "Walworth LEPC",
  "FacilityLatDecDegs": "42.7354",
  "FacilityLongDecDegs": "-88.6172",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 23218563,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Robert Cook",
  "OperatorStr1": "W 6406 County Road A",
  "OperatorStr2": null,
  "OperatorCity": "Elkhorn",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53121",
  "OperatorZipCodeExt": "2929",
  "RMPContact": "Shane Lonze",
  "RMPTitle": "Operations Manager",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000160489",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-24 00:00:00",
  "SafetyInspectionBy": "other",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-08-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-11-14 00:00:00",
  "DeRegistrationEffectiveDate": "2018-11-13 00:00:00",
  "AnniversaryDate": "2019-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.73639,
  "FRS_Long": -88.6175,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Helena sold this location",
  "_processes": [
    {
      "ProcessID": 1000049220,
      "AltID": null,
      "FacilityID": 1000039922,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000049685,
          "ProcessID": 1000049220,
          "NAICSCode": "11511",
          "_desc": {
            "NAICS_CODE": "11511",
            "NAICS_DESCRIPTION": "Support Activities for Crop Production"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059701,
          "ProcessID": 1000049220,
          "ChemicalID": 56,
          "Quantity": 79113.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000559701,
          "ProcessID": 1000049220,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039922,
      "SummaryText": "Executive Summary\n\n\n\nAccidental Release Prevention Policies\n\n\n\nMillard Feed Mill will work to prevent accidental releases of toxic substances that could result in a safety hazard to the public or to the workers at the Facility. Millard Feed Mill will work with Occupational Safety & Health Administration (OSHA), U.S. Environmental Protection Agency (USEPA), and the Local Emergency Planning Committee (LEPC) contacts, including both fire department HAZMAT and the Walworth County Emergency Management Department, to minimize the potential for any accidental release and to help assure that the facility is prepared to respond in the event of an accidental release. The emphasis of this Risk Management Plan is on anhydrous ammonia, the currently regulated substance identified within the federal regulations. However, Millard Feed Mill has procedures in place to help minimize the chance of accidents related to other potentially hazardous substances stored or handled on site. \n\n\n\nIf an accidental release were to occur, it is the policy of Millard Feed Mill to notify the appropriate emergency contacts. The City of Elkhorn has a HAZMAT response unit that acts as a primary responder in the event of a release of ammonia. Millard Feed Mill would use their emergency response plan as a guide to direct the company's response. The facility maintains a response plan to cover potential releases of ammonia as required by the RMP rules. \n\n\n\nDescription of Facility and Regulated Substance(s)\n\n\n\nMillard Feed Mill operates a facility that markets anhydrous ammonia. Anhydrous ammonia is used as a nitrogen source by farmers in the region to promote crop growth. Millard Mill Feed stores a maximum of 78,800 pounds(18,000 gallons) of ammonia in any one storage vessel considering administrative limits at 85% of the physical storage vessel capacity to maintain a safe vapor space above the liquid surface. A second, smaller storage vessel that also stores anhydrous ammonia has an administrative limit o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039922,
      "SummaryText": "f 52,500 lbs of ammonia. Each of these storage vessels represents a separate regulated process since the tanks are not anticipated to interact as part of any accidental release and are therefore not represented as one combined process. \n\n\n\nAnhydrous ammonia is stored on-site in excess of the threshold value of 10,000 lbs, identified under the Risk Management Plan (RMP) listing rule, and the substance is therefore included in this Rick Management Plan. The Court of Appeals for the District of Columbia has acted with a 'stay of action' regarding propane storage RMP filings, thus the RMP at this time addresses only the ammonia storage.\n\n\n\nThe Off-site consequence Analysis (OCA) provided an estimated distance to the listed 0.14ug/L endpoint of concern identified by U.S. EPA. \n\n\n\nWorst-Case Release Scenario Description\n\n\n\nThe Worst-case Release Scenario modeling included the following:\n\n\n\nSubstance      Scenario                                 Treatment\n\nAmmonia       Release to the Atmosphere     Winds at 1.5 m/s, nighttime F stability class\n\n\n\nThe Worst-case Scenarios were modeled using EPA's RMP*Comp, and involved a gaseous release of the entire content of the tank. The scenarios meet the specifications described in the EPA Off-site Consequence Analysis Guidance (April 1996 and April 1999) and 40 CFR part 68 (the RMP rules), assuming a 10-minute release of the entire contents of the storage vessel. Worst-case Scenario modeling uses highest air temperatures and associated stored ammonia temperature, coupled with conservative nighttime wind speed and stability class assumptions.\n\n\n\nAlternative Release Scenario Description\n\n\n\nThe Alternative Release Scenario was selected by evaluating several more typical events and considering the resulting impact with more typical release rates and atmospheric conditions. A release of 1,000 pounds of ammonia caused by shipping container mishandling, breakage of a valve, or puncturing of the tank was selected as a more probable accident"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039922,
      "SummaryText": ". The Alternative scenario included the following conditions:\n\n\n\nSubstance      Scenario                                       Treatment\n\nAmmonia       Release at actual modeled rate      Winds at 3.0m/s, D stability class\n\n\n\nThe Alternative case was modeled using the RMP*Comp software, and utilized a conservative stability class with a 3.0m/s wind speed. Additional information on the estimates of the distance to the endpoint and the population potentially affected are contained in the Offsite Consequence Analysis report. \n\n\n\nResults Of Off-Site Consequence Analysis\n\n\n\nThe Off-site Consequence Analysis resulted in the following predicted distances to the endpoints and the population potentially affected for an accidental release of ammonia:\n\n\n\n                                                          Distance To Endpoint (mi.)                   Residential Population\n\nWorst-case Scenario                                         5.1                                                    10,200\n\nAlternative Scenario                                           0.3                                                      20\n\n\n\nThe estimated residential population potentially affected is derived using procedures described in EPA's Off-site Consequence Analysis Guidance. These procedures conservatively include the entire area inside of a circle described using the storage vessel at the center and the distance to the endpoint as the radius. Since typical events affect only a relatively narrow sector of this circle, and only a portion of the population would be present at the time, the Worst Case and Alternative estimates clearly represent an upper bound for the potentially impacted residential population. \n\n\n\nPublic receptors will also potentially be affected by the worst-case and alternate scenarios. A worst-case release would affect schools, residences, commercial properties, industrial areas, public recreational areas, and hospitals.  The closest public receptors include a farmste"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000039922,
      "SummaryText": "ad approximately 500 feet southeast of the ammonia storage area and a commercial facility located 800 feet east of the Elkhorn facility. A state forest is also within the boundary of the worst-case scenario area. The alternate-case release would affect nearby residences, a commercial facility, and public recreational areas, but would not affect any sensitive environmental receptors. \n\n\n\nGeneral Accidental Release Program and Prevention Steps\n\n\n\nMillard Feed Mill complies with EPA's Accident Prevention Provisions set forth in 40 CFR Part 68 and applicable state and local codes and regulations. \n\n\n\nThe facility also meets the EPCRA planning requirements for ammonia storage. Related discussion on the prevention initiatives is provided with the data elements in Section 8 of this plan. \n\n\n\nFive-Year Accident History\n\n\n\nNo reportable incidents related to ammonia storage have occurred in the past five years. \n\n\n\nEmergency Response Program\n\n\n\nIn the event of an emergency involving propane or ammonia storage vessels, Millard Feed Mill will notify the Elkhorn Fire Department HAZMAT unit. The emergency response plan (prepared for propane releases under 40 CFR Part 68) will be used for response activity guidance by Millard Feed Mill. Because Millard Feed Mill is not a primary responder to any ammonia release, no formal classroom training for response plans (HAZWOPER, 40-hr, etc.) is required. However, the facility limits the number of individuals that handle ammonia at the facility and provides in-house training for these individuals on proper operating and maintenance procedures for ammonia storage.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe RMP includes changes, developed in recent years, which have already been implemented to improve safety at the facility. This includes the use of 'pop-off valves' which close off the flow of ammonia from the storage vessel should a transfer line or valve be severed or if malfunction causing a sudden drop in the storage pressure occurs. Mor"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000039922,
      "SummaryText": "e recently, the facility elected to upgrade the piping and replace pumps and bulkheads for loading and unloading of the two NH3 tanks. The facility has also been regularly inspecting valves and other equipment with a major inspection occurring at the beginning of each season to determine any equipment that needs maintenance or replacement. The facility regularly performs maintenance or rebuilding of pumps at least annually or sooner if needed. New employees receive on-the-job training from senior personnel regarding equipment safety measures before operating the equipment. \n\n\n\nNo new changes to the safety plans are anticipated."
    }
  ]
}