{
  "FacilityID": 1000039853,
  "FacilityName": "Haliburton International Foods",
  "FacilityStr1": "3855 Jurupa Street",
  "FacilityStr2": null,
  "FacilityCity": "Ontario",
  "FacilityState": "CA",
  "FacilityZipCode": "91761",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.049582",
  "FacilityLongDecDegs": "-117.568645",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Haliburton International Foods",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Haliburton International Foods",
  "OperatorStr1": "3855 Jurupa Street",
  "OperatorStr2": null,
  "OperatorCity": "Ontario",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91761",
  "OperatorZipCodeExt": null,
  "FTE": 240,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000225124",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-03-26 00:00:00",
  "SafetyInspectionBy": "Champion Fire",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-04-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-04-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-04-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049084,
      "AltID": null,
      "FacilityID": 1000039853,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059569,
          "ProcessID": 1000049084,
          "ChemicalID": 56,
          "Quantity": 10300.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000049539,
          "ProcessID": 1000049084,
          "NAICSCode": "311412",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000042434,
              "Process_NAICS_ID": 1000049539,
              "SafetyReviewDate": "2014-03-07 00:00:00",
              "PHA_Date": "2014-03-04 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": "Facility Walkthrough",
              "PHACompletionDate": "2014-04-19 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Level Controls",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Ammonia Dilution Tank",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Installation of new evaporators (AU14 - AU25)",
              "OpProceduresReviewDate": "2014-03-07 00:00:00",
              "TrainingReviewDate": "2012-02-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Handbook",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-03-07 00:00:00",
              "EquipmentInspectionDate": "2014-03-04 00:00:00",
              "EquipmentTested": "Weekly system inspection of ammonia system",
              "ChangeMgmtDate": "2013-12-01 00:00:00",
              "ChangeMgmtReviewDate": "2012-02-23 00:00:00",
              "PreStartupReviewDate": "2014-03-04 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-02-23 00:00:00",
              "HotWorkPermitReviewDate": "2012-02-23 00:00:00",
              "ContractorSafetyReviewDate": "2012-02-23 00:00:00",
              "ContractorSafetyEvalDate": "2014-03-04 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000050657,
                  "PreventionProgram3ID": 1000042434,
                  "ProcessChemicalID": 1000059569
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000039853,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "San Bernardino County Fire Dept",
    "CoordinatingAgencyPhone": "9093868401",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039853,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nHaliburton International Foods is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the process equipment at the facility. \n\n\n\nHaliburton International Foods senior management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. Haliburton International Foods' safety and environmental policies as they relate to the ammonia refrigeration system are administered by the Plant Engineer, who conducts inspections of the facility to ensure compliance.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe system at 3855 East Jurupa Street in Ontario, California was constructed in accordance with all applicable federal, state, and local regulations including the 2010 California Fire Code, 2010 California Mechanical Code, 2010 California Building Code, and the Piping Insulation: 1998 ASHRAE Handbook, Chapter 32 in place at the time of construction.  The facility was constructed in 2011/2012.\n\n\n\nThe refrigeration cycle begins with the transfer of liquid ammonia from the Evaporative Condenser to the High Pressure Receiver.  The High Pressure Receiver feeds high pressure liquid ammonia to the +20?F Pump Recirculator.  \n\n\n\nThe +20?F Pump Recirculator receives high temperature recirculated suction from Evaporators AU-8 - AU-25 and the Heat Exchangers and high pressure liquid ammonia from the High Pressure Receiver.  The high pressure liquid ammonia feed to the vessel is controlled by a level controller which throttles the motorized valve to maintain operating level in the vessel.  Incoming vapor to the vessel flashes some of the liquid in the bath of the vessel; as liqu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039853,
      "SummaryText": "id flashes, the remaining liquid in the bath is sub-cooled.  Sub-cooled liquid is sent to the -20?F Pump Recirculator.  Liquid is also pumped to Evaporators AU-8 - AU-25 and the Glycol Chiller Heat Exchanger as high temperature recirculated liquid.  High stage suction is drawn from the top of the vessel by the High Stage Compressors and the Swing Compressor.  The vessel is equipped with a high level mechanical float switch that shuts down the Compressors in the event of a high level situation. \n\n\n\nThe -20?F Pump Recirculator receives low temperature recirculated suction from Evaporators AU-1 - AU-7 and sub-cooled liquid ammonia from the +20?F Pump Recirculator.  The sub-cooled liquid ammonia feed to the vessel is controlled by a level controller which throttles the motorized valve to maintain operating level in the vessel.  Liquid is also pumped to Evaporators AU-1 - AU-7 as low temperature recirculated liquid.  Low stage suction is drawn from the top of the vessel by the Low Stage Compressors and the Swing Compressor.  The vessel is equipped with a high level mechanical float switch that shuts down the Compressors in the event of a high level situation.\n\n\n\nThe Evaporators provide refrigeration to the -10?F Freezer (AU-1 - AU-7), Cooler #1 (AU-8 - AU-10), Engine Room (AU-11), +38?F Dock (AU-12 & AU-13), Produce Coolers 1 & 2 (AU-14 - AU-19), Packaging (AU-20 - AU-22), and USDA (AU-23 - AU-25).  The -10?F Freezer Evaporators receive low temperature recirculated liquid from the -20?F Pump Recirculator,  while the Cooler #1, +38?F Dock, Engine Room, Produce Coolers 1 & 2, Packaging, and USDA Evaporators receive high temperature recirculated liquid from the +20?F Pump Recirculator.  At the Evaporators, ammonia flows through the evaporator coils and is partially boiled as fans blow air over the evaporator coils.  The resulting 'wet return' (liquid/vapor mixture) from the Evaporators returns to the respective vessel.  The -10?F Freezer Evaporators receive hot gas for coil"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039853,
      "SummaryText": " defrost.\n\n\n\nThe Low Stage Compressors draw low stage suction from the -20?F Pump Recirculator and the High Stage Compressors draw high stage suction from the +20?F Pump Recirculator.  The Swing Compressor can be configured to draw suction from either Recirculator, depending on demand.  High stage discharge flows to the Evaporative Condenser and is routed to the Underfloor Heat Exchanger to warm glycol and to the Freezer Evaporators for coil defrost.  All of the Compressors are water-cooled.\n\n\n\nThe Underfloor Heat Exchanger is a plate and frame heat exchanger which is designed to be used in a separate, closed loop system for under floor heating.  The Underfloor Heat Exchanger receives hot gas from the Compressors.  As hot gas passes through the heat exchanger unit, it is condensed as the glycol absorbs heat from the ammonia.  The resulting liquid drains to the Evaporative Condenser.\n\n\n\nAt the Evaporative Condenser, air (fans) and water (pumps) are used to condense the high stage discharge from the Compressors into high pressure liquid, which then drains to the High Pressure Receiver to begin the refrigeration cycle again.  The system is also equipped with an Automatic Purger that removes non-condensables, i.e. air, from the system.\n\n\n\nAll process equipment and piping are designed according to ASME standards.  All ASME vessels are equipped with pressure relief valves that vent to the Diffusion Tank at 250 psig or 300 psig, depending on location in the system.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Haliburton International Foods ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with Cal/OSHA's Process Safety Management regulation.  The facility conducts preventative maintenance and any necessary minor repairs in house, but an outside contractor is hir"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000039853,
      "SummaryText": "ed for major repairs or maintenance.\n\n\n\nThe facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code applicable at the time of construction, which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors in the engine room as well as sensors in the cold rooms and vent line.  In addition, the majority of the ammonia is maintained inside the engine room and just outside of the engine room (condensers). All pressure vessels are equipped with pressure relief valves that are piped to an ammonia diffusion tank.\n\n\n\nIn addition to the Uniform Mechanical Code, Haliburton International Foods has developed a preventive maintenance program that utilizes the services of a professional refrigeration contractor to complete regularly scheduled inspections and tests of the ammonia refrigeration system as well as repairs as needed to process equipment.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nEPA's RMP regulation defines \"accident\" as the following:\n\n\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\n\n\n\nThe release must have caused at least one of the following:\n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\"\n\n\n\nThe refrigeration system at Haliburton International Foods began operations in February 2012.  Since system startup, there have been no significant releases of ammonia that meet the definition above; nor have there been any releases that exceeded the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material in the past five years.  In addition, there have been no releases or \"near misses\" that warranted an internal in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000039853,
      "SummaryText": "cident investigation.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Haliburton International Foods facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP/CalARP document. This Plan was designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nThe operator of the facility maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the PSM, RMP and CalARP regulations.\n\n\n\nIn case of an ammonia emergency, the facility plans to evacuate all employees and contractors and activate the facility's action plan to respond to the situation.  If necessary, they will alert the local emergency responders (fire department) for assistance. The facility plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazards Analysis, conducted on February 17, 2012, including a Hazard and Operability (HAZOP) study and a Facility Inspection, provided mitigation measures to improve safety at the Haliburton International Foods facility.  The Haliburton International Foods safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\n1. Continue to train all employees in the facility Safety Plan/Programs.\n\n\n\n2. Continue to have employee invol"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000039853,
      "SummaryText": "vement in Safety Plan Development.\n\n\n\n3. Continue employee involvement through safety team participation.\n\n\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n"
    }
  ]
}