{
  "FacilityID": 1000085389,
  "FacilityName": "El Segundo Generating Station",
  "FacilityStr1": "301 Vista Del Mar Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "El Segundo",
  "FacilityState": "CA",
  "FacilityZipCode": "90245",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.907960",
  "FacilityLongDecDegs": "-118.422620",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 127519580,
  "ParentCompanyName": "El Segundo Power, LLC",
  "Company2Name": null,
  "CompanyDUNS": 793422213,
  "Company2DUNS": 0,
  "OperatorName": "El Segundo Power LLC",
  "OperatorStr1": "301 Vista Del Mar Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "El Segundo",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90245",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ken H. Riesz, Sr.",
  "RMPTitle": "Station Manager",
  "FTE": 40,
  "OtherEPAFacilityID": "110000520213",
  "EPAFacilityID": "100000102667",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "115663",
  "SafetyInspectionDate": "2019-07-31 00:00:00",
  "SafetyInspectionBy": "El Segundo CUPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-03-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-02-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-02-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-02-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 33.91028,
  "FRS_Long": -118.42389,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000106640,
      "AltID": "SCR Ammonia System",
      "FacilityID": 1000085389,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000107913,
          "ProcessID": 1000106640,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000133482,
          "ProcessID": 1000106640,
          "ChemicalID": 57,
          "Quantity": 42470.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000633482,
          "ProcessID": 1000106640,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000085389,
      "SummaryText": " \n\nThis Risk Management Plan (RMP) describes the worst-case scenario for a release of aqueous ammonia (NH4OH) and the controls established at the El Segundo Generating Station (ELGS) to minimize the possibility of an accidental release and to mitigate the effects of a release, should one occur. These include underground storage of the Ammonia Tank and Emergency Shutdown Systems. The worst-case release scenario and alternative-case release scenario results in a predicted distance (0.1 miles) to the toxic endpoint value established for ammonia (0.14 milligrams per liter) that is within the distance to a public and environmental receptor, the shoreline adjoining ELGS to the west.  The SCR Ammonia System is not subject to the Cal/OSHA process safety management standards at 8 CCR 5189 and has been determined to be a Program Level 2 regulated process.  This RMP represents a complete 5-year update.  \n\n\n\nThe complete RMP also includes two separate and independent processes, known as the Ammonia Dosing Systems, that contain 19% NH4OH used as water treatment additive for the unit condensate.  The Ammonia Dosing Systems are not covered processes but are included in the RMP relative to release prevention as a best management practice.  Collectively, the covered SCR Ammonia System and the two Ammonia Dosing Systems are referred to in the RMP as the Aqueous Ammonia System.    \n\n\n\n1.1    Accidental Release Prevention & Emergency Response Policies\n\n\n\nThe design of the SCR Ammonia System integrates accidental release prevention controls through its features of construction, automated operation and control, and continuous monitoring of critical process conditions.  The system is controlled and monitored by the combination of equipment-specific Programmable Logic Controllers (PLC), Continuous Emissions Monitoring System (CEMS), and the power plant Distributed Control System (DCS) that is continuously monitored by operators in the Control Room.  This is supplemented with daily monitoring "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000085389,
      "SummaryText": "of the system by trained and experienced station operators and preventative maintenance.\n\n\n\nELGS adheres to the safety and environmental policies of NRG Energy, Inc. (NRG) that dictates the commitment to conducting its operations in a manner that meets or exceeds all applicable environmental laws and regulations.  Promoting compliance and environmental protection is the responsibility of the Plant Manager and all station employees.  The Emergency Preparedness and Response Plan outlines the committed level of preparedness and response readiness to potential emergency spills. For emergency releases, EPS employee response is limited to station evacuation and will rely on the local emergency response agencies and NRG specialized hazardous materials response contractors.\n\n\n\n1.2    Covered Process and Regulated Substance\n\n\n\nELGS is an electric power generating station with natural gas-fired combustion and steam turbine generator units that use NH4OH supplied by the SCR Ammonia System.  Generating Units (Units) 5 and 7 each have an air pollution control device known as Selective Catalytic Reduction (SCR).  The SCR Ammonia System supplies a 29.4 percent solution of NH4OH (29.4% NH4OH) to each unit's SCR Vaporizer Skid from a 10,000 gallon underground storage tank (UST) and the connected pipelines known as the Units 5 & 7 Pipeline.    \n\n\n\n1.3    Accidental Release Prevention Program & Chemical-Specific Prevention Steps\n\n\n\nELGS has developed a management system to plan, organize, implement and control this RMP.  The Plant Manager is the primary person with this responsibility.  Station operators and maintenance personnel are trained on the hazards and safety of aqueous ammonia, the RMP elements, the process equipment and its monitoring, normal operation, and upset conditions that include responses to a release.  System descriptions and operating and maintenance manuals provide details of design basis, process equipment, operating procedures (start-up, normal operation, shut-down, a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000085389,
      "SummaryText": "larms and corrective actions, etc.), routine maintenance, and troubleshooting.  The maintenance program has been established to ensure that the SCR Ammonia System is inspected, tested, and/or maintained to function as designed.  Experience operators monitor the system to ensure its effective and safe operation, including a series of critical alarms for quantity, pressure, temperature, flow and release detection monitoring.  Modifications to the operation or equipment requires evaluation and approval through the Management of Change (MOC) procedure to verify that changes made as designed and that new or modified safety and operating procedures, as well as training, is developed and implemented, as needed.\n\n\n\n\n\n1.4    Five-Year Accident History\n\n\n\nThere have been no accidental releases from the SCR Ammonia System that have resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, shelter in place, property damage or environmental damage since its original installation in 1993.\n\n\n\n1.5    Emergency Response Program\n\n\n\nELGS maintains written plans and procedures and provides training on the expected hazards and actions employees should take in response to an emergency, including an accidental release of NH4OH.  The emergency response program provides for evacuation, initial assessment, local and public agency notifications, emergency planning and coordination with outside agencies, personnel roles and the Incident Command System, and containment and removal actions, when safe to perform.  The emergency response program defines the highest priority as protecting human health and is generally limited to defensive actions that station employees can perform safely.  ELGS will rely on the El Segundo Fire Department and other local agencies, as well as NRG contractors to respond to emergency releases.   \n\n\n\n 1.6    Planned Changes to Improve Safety\n\n\n\nFindings and recommendations resulting from hazard reviews are logged on the "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000085389,
      "SummaryText": "RMP Recommendation Record spreadsheet that is maintained by the Environmental Specialist.  During the most recent process hazard analysis (PHA) completed October 13, 2019, there were recommendations to include bollards around Dosing Tanks that are scheduled to be completed by December 31, 2019.\n\n "
    }
  ]
}