{
  "FacilityID": 1000002997,
  "FacilityName": "3M Frenchtown Warehouse",
  "FacilityStr1": "34621 County Road K",
  "FacilityStr2": null,
  "FacilityCity": "Prairie du Chien",
  "FacilityState": "WI",
  "FacilityZipCode": "53821",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55023",
  "LEPC": "Crawford LEPC",
  "FacilityLatDecDegs": "43.065833",
  "FacilityLongDecDegs": "-091.151111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "rmp3m@mmm.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "3M Company",
  "OperatorStr1": "801 N. Marquette Road",
  "OperatorStr2": null,
  "OperatorCity": "Prairie du Chien",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53821",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199581",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-02-10 00:00:00",
  "SafetyInspectionBy": "Global Risk Consultants",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-02-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-05-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.065698,
  "FRS_Long": -91.15018,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000003701,
      "AltID": "Warehouse",
      "FacilityID": 1000002997,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000004123,
          "ProcessID": 1000003701,
          "ChemicalID": 107,
          "Quantity": 37900.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000003867,
          "ProcessID": 1000003701,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000002997,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-05-28 00:00:00",
    "ERTrainingDate": "2009-05-12 00:00:00",
    "CoordinatingAgencyName": "Bridgeport Fire Dept.",
    "CoordinatingAgencyPhone": "6083262807",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000002997,
      "SummaryText": "1. Introduction\n\nThis Executive Summary briefly reviews the major elements of the Risk Management Plan for the 3M Frenchtown Warehouse. We take seriously our safety, health and environmental responsibilities to our employees and to the community. As an operating unit of 3M, we share in a tradition of environmental, health and safety responsibility going back through much of the company's history. 3M was an early pioneer in pollution prevention and created its environmental policy in 1975. Since 1990, 3M has cut its worldwide volatile organic air emissions 92 percent, and releases to water 84 percent.\n\n2. Accidental Release Prevention and Emergency Response Policies\n\nIt is our goal to prevent accidental releases of regulated and other materials through the proper design, installation, operation and maintenance of our manufacturing processes and the proper training of our employees. If, despite our efforts, such a release should occur, our trained personnel are at hand to control the effects of the release until the local Fire Department and other emergency responders arrive. We maintain an excellent working relationship with the emergency responders to ensure rapid and effective response.\n\n3. The Stationary Source and The Regulated Substances Handled\n\nThis location is a distribution center and warehouse for finished goods, primarily in small containers intended for consumer use. Containers are not opened on-site as part of any process.  We have one substance at our facility in quantities regulated by EPA's Risk Management Program. 3M employees are trained and experienced in working with these substances and we contribute to safety by providing high quality shipping and handling processes, equipment and maintenance.\n\nThe following regulated substance is used at 3M Frenchtown Warehouse:\n-Isobutane is a flammable gas that is used as a propellant in aerosol cans. The maximum container size for this substance is approximately twenty ounces with the regulated substance bei"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000002997,
      "SummaryText": "ng approximately 13 percent by weight. \n\n4. 3M Frenchtown Warehouse - Program to Prevent Accidental Releases\n\nAt the 3M Frenchtown Warehouse, we take great care to prevent accidents, including those not covered under the EPAÂ¿s Risk Management Program. Programs are in place to address accidental release prevention measures consistent with appropriate federal, state, and local requirements. Beyond government requirements, we have 3M internal standards for continuously improving safety at our facility.\n\nReflecting the low risk and the five year history showing no accidental releases at this facility, EPA criteria for Program 1 designation are met and specific prevention program elements are not addressed in this plan.\n\n5. Five-year Accident History\n\nAt the 3M Frenchtown Warehouse no level of accident is acceptable. We work continually to reduce the number and severity of accidents at our operations. In the five years preceding submittal of this plan, there were no accidental releases with on-site or off-site consequences meeting EPA criteria for inclusion in this plan.\n\n6. Emergency Response Plan\n\n3M's first line of defense against accidents is prevention. At the 3M Frenchtown Warehouse we also work to ensure that we are prepared for any accident that might happen. We maintain a written emergency response plan that includes arrangements for immediate response from employees, notification of local emergency response agencies and the public, first aid and medical treatment, evacuations, and post-incident decontamination of affected areas. We conduct regular drills and work with the local Fire Department to ensure the proper execution of our plan. Our emergency response plan is updated to reflect any pertinent changes that would require a modified emergency response.\n\n#7 Planned Changes to Improve Safety\n\nThe 3M Prairie du Chien site along with the 3M Frenchtown Warehouse site will develop an annual Environmental, Health, and Safety Plan (EHS Plan) utilizing sources of d"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000002997,
      "SummaryText": "ata such as Injury and Illness Records, Investigation Reports and Incident Rates, Near Miss Reports, Safety Suggestions, Safety Tours, Audit findings, and Self Assessments.\n\nA Cause & Effect (C&E) analysis is conducted to prioritize issues extracted from the data sources. Action items are then developed, including target completion dates and assignments to individuals and teams. The resulting EHS Plan is approved by Prairie du Chien - 3M Company and Corporate management teams. Once approved, the annual plan is reviewed with the entire Prairie du Chien - 3M Company staff and the 3M Frenchtown staff."
    }
  ]
}