{
  "FacilityID": 1000106978,
  "FacilityName": "Red Lake Gas Plant",
  "FacilityStr1": "3456 County Road A3601",
  "FacilityStr2": null,
  "FacilityCity": "Stanton",
  "FacilityState": "TX",
  "FacilityZipCode": "79782",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48317",
  "LEPC": "Martin County LEPC",
  "FacilityLatDecDegs": "32.326298",
  "FacilityLongDecDegs": "-101.821331",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "wtgmidstream.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "WTG North Permian Midstream, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "WTG North Permian Midstream, LLC",
  "OperatorStr1": "303 Veterans Airpark Lane",
  "OperatorStr2": null,
  "OperatorCity": "Midland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79705",
  "OperatorZipCodeExt": "0000",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000250239",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "4413",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-10-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-10-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-10-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-10-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000133831,
      "AltID": "Red Lake Gas Plant",
      "FacilityID": 1000106978,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000167590,
          "ProcessID": 1000133831,
          "ChemicalID": 98,
          "Quantity": 91000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000167711,
          "ProcessID": 1000133831,
          "ChemicalID": 155,
          "Quantity": 830000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000150563,
              "ProcessChemicalID": 1000167711,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000150562,
              "ProcessChemicalID": 1000167711,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000150561,
              "ProcessChemicalID": 1000167711,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000150560,
              "ProcessChemicalID": 1000167711,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000150559,
              "ProcessChemicalID": 1000167711,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000150558,
              "ProcessChemicalID": 1000167711,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000150557,
              "ProcessChemicalID": 1000167711,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000135200,
          "ProcessID": 1000133831,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106978,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-06-01 00:00:00",
    "ERTrainingDate": "2023-03-01 00:00:00",
    "CoordinatingAgencyName": "Martin County LEPC",
    "CoordinatingAgencyPhone": "4326073557",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106978,
      "SummaryText": "and operating and maintenance safe work practices are evaluated to determine changes needed to prevent the recurrence of an incident.\n-\tInternal and third-party compliance audits will ensure that the level of safety protection at the facility is periodically evaluated for improvements with any action items tracked to completion. \n-\tAn annual dialogue with the Martin County Local Emergency Planning Committee (LEPC) will ensure a readiness to respond to potential emergencies, as well as a means to implement improvements as the need develops."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106978,
      "SummaryText": "m a regulated substance has occurred at the facility within the last five years.\n\t\n\t\n\tEmergency Response Program\n\t\n\tThe facility will conduct emergency response preparedness activities and coordinate any emergency response actions necessary with the Martin County Local Emergency Planning Committee.  Also involved in emergency response for the facility will be the Martin County Sheriff Department and the Martin County Volunteer Fire Department.  The Plant Supervisor is responsible for coordinating the emergency actions when an incident occurs within the facility.  An emergency response program is in place at the facility, which has been coordinated with local officials.  The Red Lake Gas Plant is designated as a non-responding stationary source. The emergency planning and response program provides the essential information for effectively protecting workers, the public, and the environment during emergency situations.\n\t\n\n\tContinuous Safety Improvement Efforts \n\t\n\tWTG\u0092s Environmental, Health, and Safety Management System, forms the framework for continuous process safety improvement.  Some of the key components are:\n\t\n-\tIncorporating Change Management provisions ensure that the potential safety and health impacts of any change made to process chemicals, technology, equipment or procedures are considered.\n-\tThe Hazard Assessment provisions serve as a tool to ensure timely evaluation of potential process hazards and verification of safeguards, thereby leading to continual improvements in process safety and safe work practices.\n-\tThe Preventative Maintenance program ensures that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of the safety program.\n-\tIncident Investigation procedures are in place to ensure that corrective and/or preventative measures are taken as applicable following an incident.  This ensures that process design, operating equipment,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106978,
      "SummaryText": "d with local emergency planning and response agencies.\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe accidental release prevention and emergency response programs in place at the facility are part of the high standards striven for by WTG.  These high standards include:\n\n-\tOperating in compliance with required environmental permits and regulations. \n-\tOperating and maintaining assets in such a manner that unintentional releases are minimized.\n-\tOperating and maintaining assets in such a manner that the small releases associated with normal operation and maintenance will be minimized to the extent possible.\n-\tCorrecting non-compliance found by regular audits of the facility.\n\n\nPrevention Program\n\nThe Red Lake Gas Plant is operating under a prevention program that involves identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the prevention features implemented at this program 1 facility include:\n\n-\tProviding overpressure relief valves on pressurized vessels.\n-\tProviding level transmitters and alarms on vessels to help prevent overfilling.\n-\tMinimizing the possibility of an interruption in the combustion of hydrocarbon vapors by having a continuous flare.\n-\tInstalling hydrocarbon gas detectors throughout the gas plant.\n-\tInstalling fire eye detectors throughout the gas plant to alarm personnel of a possible fire.\n-\tInstalling security lighting to facilitate observation of the entire facility.\n-\tMinimizing the possibility of emergencies by manning the facility 24/7/365.\n-\tProviding an evacuation alarm system in order to safely evacuate the facility during an emergency.\n-\tConducting periodic operational rounds to ensure problems are detected and corrected in a timely manner.\n\t\n\tFive-Year Accident History\n\t\n\tNo incident resulting in onsite injuries, death or significant property damage or known offsite impacts, such as death, injury, property damage, shelter in place, evacuation, or environmental damage fro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106978,
      "SummaryText": "the natural gas liquids and residue sales gas (methane).  Propane is used as a refrigerant in this process.  The chilled dehydrated gas is then sent to a demethanizer tower where it is separated into the residue gas product stream and the NGL product stream.  Both products leave the facility via pipeline.\n\nHydrocarbon liquids from the slug catcher and the three-phase separator are routed to a stabilizer.  In the stabilizer, water, light-end vapors, and other impurities are removed.  Natural gas liquids are then routed to the liquid amine treater where H2S and CO2 are removed.  The treated NGL leaves the facility via pipeline.\n\nWaste gas (H2S and CO2) are routed to a thermal oxidizer.  Condensate and wastewater (slop) from the various process separators, dehydration unit, cryogenic unit, and scrubbers are routed to storage tanks.  Condensate and slop are periodically loaded into tank trucks for outside sales and/or disposal.\n\nThe RMP flammable substances and mixtures stored or processed at the facility are the flammable mixture comprised of methane, ethane, propane, isobutane, butane, isopentane, and pentane, which is being processed through the plant; as well as propane, which is used as refrigerant in the cryogenic process. There are no toxic substances present at the facility in amounts greater than threshold quantity.  Hydrogen sulfide, the only RMP toxic substance found in the process, is stored in quantities far below the RMP threshold quantity.\n\nWTG has determined that RLGP Train 1 and Tran 2 is classified as a Program Level 1 facility under the RMP regulation because the nearest public receptor is beyond the worst-case scenario flammable endpoint, and the facility has not experienced an accidental release that caused offsite impacts.  This facility has one process (as defined by the regulation) consisting of a flammable mixture and propane  found in both trains.  As required by the RMP rule for Program Level 1 facilities, response actions have been coordinate"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106978,
      "SummaryText": "WTG North Permian Midstream LLC\n\nRed Lake Gas Plant\nStanton, Texas\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\n\nIntroduction and Policies\n\nWTG North Permian Midstream LLC (WTG) is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors and the public while complying with applicable laws and regulations.  WTG\u0092s management philosophy goals are achieved through the implementation of the Environmental, Health, and Safety Management Systems, by the personal commitments of employees and contractors, and by open communication with employees, customers, neighbors, and regulators.\n\nThe purpose of this Risk Management Plan (RMP) is to provide information about operations at the facility, programs to prevent accidental chemical releases, emergency planning and response plans in the event of an accidental release, the five-year accident history of the facility, and continuous improvement efforts to improve safety at the facility.  \n\nThis submission is being sent to EPA as required by 40 CFR 68.190 (b) (5), which requires an RMP update due to a revised hazard review. The revised hazard review incorporates Train 2 into the Train 1 hazard review.    \n\n\nNon-Responding Stationary Source and Regulated Substances\n\nWTG owns and operates a natural gas processing plant located near Stanton, Texas.  The Red Lake Gas Plant (RLGP) treats and dehydrates natural gas to produce residue gas (methane) and natural gas liquids (NGL).  After processing, the residue gas and NGL exit the plant via product pipelines.\n\nThe incoming raw field gas/hydrocarbon liquids mixture enters the facility and flows into a slug catcher.  Gas exits the slug catcher and is routed to a three-phase separator.  The gas is then treated to remove hydrogen sulfide (H2S), carbon dioxide (CO2), water, and excess nitrogen before being sent to the cryogenic processing unit.  In the cryogenic unit, sub-zero temperatures separate"
    }
  ]
}