{
  "FacilityID": 1000028197,
  "FacilityName": "Richland Chambers Pump Station",
  "FacilityStr1": "Route 1 Box 290F County Road SE 325",
  "FacilityStr2": null,
  "FacilityCity": "Kerns",
  "FacilityState": "TX",
  "FacilityZipCode": "75144",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48349",
  "LEPC": "Navarro County LEPC",
  "FacilityLatDecDegs": "32.043083",
  "FacilityLongDecDegs": "-96.205028",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.trwd.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tarrant Regional Water District",
  "OperatorStr1": "808 East Northside Drive",
  "OperatorStr2": null,
  "OperatorCity": "Fort Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76102",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000132395",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-02-08 00:00:00",
  "SafetyInspectionBy": "TWCA Risk Management Fund",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-11-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-11-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-11-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-11-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 32.04308,
  "FRS_Long": -96.20503,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034426,
      "AltID": null,
      "FacilityID": 1000028197,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041609,
          "ProcessID": 1000034426,
          "ChemicalID": 62,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000038626,
          "ProcessID": 1000034426,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000025589,
              "Process_NAICS_ID": 1000038626,
              "SafetyReviewDate": "2012-02-15 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Chlorine Institute Standards",
              "FR_Comments": "CH2M HILL Chlorine System Design Guide",
              "HazardReviewDate": "2012-02-15 00:00:00",
              "ChangeCompletionDate": "2013-02-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-02-15 00:00:00",
              "TrainingReviewDate": "2012-02-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "C-Kit Simulation, Emergency Response and Evacuation",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-02-15 00:00:00",
              "EquipmentInspectionDate": "2012-02-15 00:00:00",
              "EquipmentTested": "Storage Tank, Piping, Valves, Chlorinators, Instrumentation, Safety Appurtenances",
              "ComplianceAuditDate": "2012-02-15 00:00:00",
              "AuditCompletionDate": "2013-02-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The Prevention Program is comprised of Safety Information, Hazard Review, Operating Procedures, Training, Maintenance, Incident Investigation, and Compliance Audit procedures. The procedures are designed to prevent an accidental release. Presently, Richland Chambers Pump Station is in compliance with most of the procedures. The compliance audit identified several issues of noncompliance; however, these issues are being addressed.  The compliance audit provides additional information.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000025955,
                  "PreventionProgram2ID": 1000025589,
                  "ProcessChemicalID": 1000041609
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000028197,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2012-02-15 00:00:00",
    "ERTrainingDate": "2012-08-28 00:00:00",
    "CoordinatingAgencyName": "Navarro County LEMP",
    "CoordinatingAgencyPhone": "9036544960",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028197,
      "SummaryText": "Executive Summary\n\nRichland Chambers Pump Station\n\nTarrant Regional Water District\n\n\n\nApproach\n\n\n\nThe safety and health of the Tarrant Regional Water District's (TRWD) employees and facilities, and of the general public is fundamental to the District's operations. This objective can be achieved by employing safe and healthy work practices and attitudes in and to every job, activity and function performed. Safety and health objectives will not be compromised or subordinated in achieving overall District goals.\n\n\n\nThe District is committed to the safe and healthy design, construction, and operation of its chemical systems with emphasis on the prevention of releases, accidents, or injuries to personnel, the public, or the environment. This commitment, within the District's control, is supported by the following principles:\n\n\n\n?    Accidents, injuries, and occupational illnesses are preventable,\n\n?    Each manager, supervisor, and employee is responsible for administering and applying the safety and health program and will be evaluated accordingly,\n\n?    Every employee has a personal responsibility for job safety and health and for the safety and health of others both on and off the job,\n\n?    Safe conduct of operations is a condition of employment,\n\n?    Safety and health performance reviews must be a continuing process,\n\n?    Training is an essential element for a safe and healthy work environment,\n\n?    Injuries, unsafe conditions, and incidents with injury and/or damage potential must be investigated, and\n\n?    Prevention of accidents, injuries, and occupational illnesses is good business.\n\n\n\nFacility\n\n\n\nThe TRWD has constructed and operates four surface water reservoirs and is one of the largest providers of raw surface water in Texas. One of their reservoirs, Richland Chambers, is located in TRWD's eastern division. Richland Chambers Reservoir has a permitted total annual diversion of 210,000 acre feet. From Richland Chambers Reservoir, water must be pumped approximately 80 miles to reac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028197,
      "SummaryText": "h customers. Water pumped from Richland Chambers Reservoir discharges to the Kennedale Balancing Reservoirs and is then gravity-fed to the City of Arlington's Pierce-Burch Water Treatment Plant via Lake Arlington and the City of Fort Worth's Rolling Hills Water Treatment Plant.  Other customers which tap into the Richland Chamber Pump Station pipeline are the City of Ennis, City of Midlothian, City of Waxahachie (including the Rockett Special Utility District), City of Mansfield, and the City of Arlington's John Kubala Water Treatment Plant.\n\n\n\nThe Richland Chambers Pump Station is located on the northern shore of the reservoir. The pump station is unmanned; however, TRWD does maintain a residence on the property.  The pump station receives TRWD support as needed from the nearby TRWD Cedar Creek Reservoir facilities, but this support is not available 24 hours per day, seven days per week. Richland Chambers Pump Station delivers a total low capacity of 146 mgd and has a total high capacity of 240 mgd when using five pumps.\n\nDuring the warmer months, increased water temperatures promote biological growth, creating a film on the inside walls of the transmission pipeline (biofilm). Uncontrolled biofilm growth can substantially reduce capacity within the pipeline due to a decrease in pipe radius and an increase in frictional resistance, thus increasing the pumping cost. To control biofilm growth, aqueous chlorine in conjunction with ammonia is used to form chloramines. Chloramines are a stable disinfectant that inhibit biofilm growth and provide a persistent residual for transmission system protection.\n\n\n\nCurrently, the Richland Chambers Pump Station stores its chlorine in two, fixed 30-ton (60,000-pound) capacity chlorine storage tanks, each filled with 20 tons (40,000 pounds) of chlorine. The quantity of chlorine stored onsite exceeds the United States Environmental Protection Agency's (USEPA) threshold of 2,500 pounds, thus subjecting Richland Chambers to USEPA's Risk"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028197,
      "SummaryText": " Management Program (RMP) Rule. The RMP primarily consists of the following three elements: Offsite Hazard Assessment, Accident Prevention Program, and an Emergency Response Program.\n\n\n\nOffsite Hazard Assessment\n\n\n\nAn offsite hazard assessment was conducted for the Richland Chambers facility to determine the distance a toxic concentration of chlorine gas would travel in the event of a release. The toxic endpoint concentration for chlorine is three parts per million (ppm). The population within the radius of the release and sensitive receptors such as hospitals, schools, and state parks were identified. Two release scenarios-the \"Worst Case\" and an \"Alternative Case\" were considered. The Hazard Assessment also includes a five-year accident history of the Richland Chambers Pump Station.\n\n\n\nWorst Case Scenario\n\n\n\nPer Section 68.25 of the U.S. Environmental Protection Agency 40 Code of Federal Regulations (CFR) Part 68, the worst case scenario for regulated toxic substances that are normally gases at ambient temperature and are handled as a gas or as a liquid under pressure assumes the entire contents of the largest single container are released, regardless of how improbable that may be, over a period of ten minutes. This regulation takes into account administrative controls, which are defined in Section 68.3 of USEPA 40 CFR 68 as written procedural mechanisms used for hazard control.  Administrative controls at Richland Chambers Pump Station limit the maximum quantity of chlorine stored in a 60,000-pound capacity tank to 40,000 pounds.  Therefore, Richland Chambers must model offsite impacts of a 40,000-pound chlorine release over a duration of 10 minutes from a single chlorine storage tank. The resulting release rate is 2,200 pounds per minute. The worst case scenario also requires conservative meteorological conditions. A relatively slow wind speed of 1.5 meters per second and a stability class F must be assumed. Stability classes are categorized by the amount of tur"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000028197,
      "SummaryText": "bulence in the atmosphere. Class F is the lowest turbulence classification. With low wind speed and atmospheric turbulence, the chlorine plume will dilute slowly, causing an increased distance to the toxic endpoint. \n\n\n\nFurthermore, only \"passive\" mitigation methods such as buildings or dikes can be considered. Passive mitigation, as defined, requires no mechanical, electrical, or human input. The USEPA allows a mitigation factor of 0.55 to be applied to releases of chemicals stored in buildings. This mitigation factor assumes the building housing the chlorine will suppress the release rate by 55 percent. The modeled single 30-ton chlorine tank containing 20 tons of chlorine at Richland Chambers is located inside a building and therefore building mitigation is considered.\n\n\n\nBecause chlorine is heavier than air, air dispersion modeling of the worst case scenario was performed using the USEPA-approved RMP*COMP modeling program. This model is an automated \"look-up\" program to the Offsite Consequence Guidance document used previously.  To determine the population affected by each accidental release, MARPLOT Version 4.2, a USEPA-approved web-based computer program of the CAMEO system of software developed by EPA's Office of Emergency Management (OEM) and the National Oceanic and Atmospheric Administration (NOAA) Office of Response and Restoration, was used.  The population affected was also checked using an alternative web-based application called Circular Area Profiles (CAPS) Version 10C, which was developed by the Missouri Census Data Center, a partner of the U.S. Census Bureau's State Data Center.  Both programs aggregate national 2010 Census data.  The affected populations provided by CAPS were similar to those provided by MARPLOT.  Refer to the Hazard Assessment for additional details. \n\n\n\nFor the worst case scenario, the RMP*COMP model predicted a distance required for the plume of chlorine gas to dilute to 3 ppm of 4.4 miles. Based on MARPLOT results, within a 4."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000028197,
      "SummaryText": "4-mile radius of Richland Chambers Pump Station, an estimated population of 943 people would be exposed to chlorine concentrations greater than 3 ppm. There are 558 residences and one church within a 4.4-mile radius around the Richland Chambers Pump Station.   \n\n\n\nAlternative Release Scenario\n\n\n\nThe alternative release scenario reflects a type of release that is more likely to occur compared to the worst case scenario. Unlike the worst case scenario, the alternative release scenario may consider \"active\" mitigation such as automatic shutoff valves and scrubbers in addition to passive mitigation. Active mitigation is defined as requiring mechanical, electrical, or human input. \n\n\n\nThe alternative release scenario modeled for Richland Chambers Pump Station assumes that a chlorine storage tank is punctured during plant operation, causing a leak of toxic gas into the inside of the building. In such an event, active mitigation (e.g., a scrubber) was assumed to be nonfunctional, resulting in only passive mitigation due to the containment of the tanks within the building. RMP*COMP was used to model the alternative release scenario for the same reasons as the worst case scenario. A storage vessel puncture failure results in a 0.2-mile migration of chlorine gas until it reaches a toxic endpoint of 3 ppm. According to the MARPLOT analysis, within a 0.2-mile radius, no people would be impacted. There is one residence located within a 0.2-mile radius of Richland Chambers Pump Station and no other sensitive receptors.  A CAPS analysis was also performed and yielded similar results. Refer to the Hazard Assessment for additional details.\n\n\n\nBecause there is likely more error for the estimates for small toxic endpoint circles due the relatively large difference between the areas of the census block and toxic endpoint circle, the MARPLOT- and CAPS-reported affected population for the alternative release scenario may not be accurate.  Observation of the area within a 0.2-mile radius "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000028197,
      "SummaryText": "of the Richland Chambers Pump Station does reveal the presence of multiple residences.  Based on a visual count, there are approximately 12 houses within the 0.2-mile radius.  If four people are assumed to permanently reside in each household, about 48 people could potentially be affected by the alternative release scenario.   \n\n\n\nFive-year Accident History\n\n\n\nUnder the RMP Rule, a five-year accident release history must be reported for regulated substances exceeding the threshold quantity. The release must have caused at least one of the following: on-site or off-site death(s), injuries or significant property damage, off-site environmental damage, evacuations, or sheltering in place. There were no reportable accidents at Richland Chambers Pump Station between June 21, 1994, and the present date.\n\n\n\nPrevention Program\n\n\n\nThe Prevention Program is comprised of Safety Information, Hazard Review, Operating Procedures, Training, Maintenance, Incident Investigation, and Compliance Audit procedures. The procedures are designed to prevent an accidental release. Presently, Richland Chambers Pump Station is in compliance with most of the procedures described below. The compliance audit identified several issues of noncompliance; however, these issues are being addressed.  See the compliance audit for additional information.\n\n\n\nSafety Information\n\n\n\nInformation regarding process chemicals, process technology, and process equipment is compiled and included in the Prevention Program as a resource to emergency response planners and to develop training programs and operating procedures. Within the Safety Information section, one can find comprehensive chemical data including action thresholds, health hazards, chemical exposure limitations, and physical properties. Also, details such as maximum intended inventory and safe upper and lower operating limits can be found.\n\n\n\nHazard Review\n\n\n\nThe hazard review (HR) provides information that will assist Richland Chambers staff in makin"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000028197,
      "SummaryText": "g decisions for improving safety and reducing the consequences of hazardous accidental releases. An HR is a systematic effort to evaluate potential causes and consequences of accidental releases. The HR focuses on equipment, instrumentation, utilities, human actions, and external factors that might affect the process. Several improvements to the Richland Chambers facility were recommended as a result of the hazard review.\n\n\n\nOperating Procedures\n\n\n\nA copy of the Richland Chambers operating procedures is included in the RMP. These procedures are designed to ensure continuous, efficient, and safe operation of the facility. The operating procedures are also used to train new employees and to provide refresher training for existing staff.\n\n\n\nTraining\n\n\n\nThe USEPA requires that a training program be included as part of the RMP. An effective training program can significantly reduce the number and severity of accidental release incidents. The Richland Chambers RMP includes guidelines for conducting regular and structured plant training. Training records are accessed, documented, and updated in Maximo, a work order system utilized by TRWD for tracking staff training and facility maintenance.  Elements of the program include training in safety information, operating procedures, maintenance, and emergency response procedures.\n\n\n\nMaintenance\n\n\n\nMaintenance ensures equipment used to process, store, or handle chlorine is functioning properly and installed to minimize the risk of releases. An effective maintenance program is one of the primary lines of defense against a release and addresses equipment testing and inspection, preventive maintenance schedules, and personnel training. When implemented, a regular maintenance program ensures that process equipment performs properly and that documentation exists to support reliable, safe operation and maintenance of the process.\n\n\n\nIncident Investigation\n\n\n\nAn incident investigation program has been developed which outlines the invest"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000028197,
      "SummaryText": "igation team, investigation process, and implementation of changes. Ultimately, it is desired that the staff learns from incidents and takes action to prevent similar incidents in the future. Necessary forms for documentation are included and must be maintained for a minimum of five years after each incident. \n\n\n\nCompliance Audit\n\n\n\nProcedures were developed to complete a compliance audit for the Richland Chambers Pump Station. A compliance audit is a self-evaluation of the effectiveness of the RMP program that identifies deficiencies, assures corrective action, and increases safety awareness among plant staff. The compliance audit methodology for the Richland Chambers facility was modeled after OSHA guidelines for conducting regulatory Process Safety Management compliance audits. These guidelines have been modified to include the Hazard Assessment and Emergency Response requirements of the RMP rule. To ensure compliance with the program, the RMP includes a checklist that the Richland Chambers staff must complete at least once every three years.\n\n\n\nEmergency Response Program\n\n\n\nThe Emergency Response Program develops a plan for dealing with a release. The USEPA RMP regulation 40 CFR 68 Subpart E requires that an Accidental Release Emergency Response Plan be prepared. The plan must be prepared in accordance with the provisions of an overlapping OSHA regulation-Employee Emergency Plans (29 CFR 1910.38(a)). In addition, provisions of the OSHA hazardous waste and emergency response standard, 29 CFR 1910.120 (q), must also be considered. The Emergency Planning and Response Plan described in this section complies with the requirements of 40 CFR 68.95, 29 CFR 1910.38(a), and 29 CFR 1910.120(q). \n\n\n\nThe Emergency Response Program consists of HAZMAT response policy and procedures developed by TRWD. The program is part of a larger Emergency Action Plan, also developed by TRWD, which provides a framework for the District to plan and respond appropriately during a disaster or a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000028197,
      "SummaryText": "ny other emergency. The Emergency Response Program provides specific emergency response procedures for accidental releases of hazardous materials. The emergency response procedures cover a release from the initial alarm stage through HAZMAT assistance. As part of the emergency response procedures, there are plans for victim rescue, leak investigation, communication with additional support agencies, and procedures for informing the public in the event of a release. \n\n"
    }
  ]
}