{
  "FacilityID": 1000054778,
  "FacilityName": "Wisconsin Rapids Mill",
  "FacilityStr1": "950 4th Avenue North",
  "FacilityStr2": null,
  "FacilityCity": "Wisconsin Rapids",
  "FacilityState": "WI",
  "FacilityZipCode": "54495",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55141",
  "LEPC": "Wood County LEPC",
  "FacilityLatDecDegs": "44.404444",
  "FacilityLongDecDegs": "-089.825000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.versoco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 122851459,
  "ParentCompanyName": "Verso Corporation",
  "Company2Name": null,
  "CompanyDUNS": 602739877,
  "Company2DUNS": 0,
  "OperatorName": "NewPage Wisconsin System, Inc.",
  "OperatorStr1": "P.O. Box 8050",
  "OperatorStr2": null,
  "OperatorCity": "Wisconsin Rapids",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54495",
  "OperatorZipCodeExt": "8050",
  "RMPContact": "Rebecca Sommers",
  "RMPTitle": "Environmental Manager",
  "FTE": 284,
  "OtherEPAFacilityID": "54494CNSLD950FO",
  "EPAFacilityID": "100000059857",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "772010140-P01",
  "SafetyInspectionDate": "2013-12-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-02-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-02-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-02-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-12-01 00:00:00",
  "DeRegistrationEffectiveDate": "2020-07-29 00:00:00",
  "AnniversaryDate": "2021-02-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 44.40306,
  "FRS_Long": -89.825,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Mill indefinetly idled, no chlorine dioxide at the site.",
  "_processes": [
    {
      "ProcessID": 1000068566,
      "AltID": null,
      "FacilityID": 1000054778,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000069708,
          "ProcessID": 1000068566,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000084493,
          "ProcessID": 1000068566,
          "ChemicalID": 71,
          "Quantity": 20098.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000584493,
          "ProcessID": 1000068566,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000054778,
      "SummaryText": "Verso Corporation (Verso) is committed to operating in a manner that is safe for Verso workers, the public, and the environment.  As part of this commitment, Verso has established procedures to help ensure safe operation of the processes at its facilities.  The Wisconsin Rapids Mill(Mill) has developed a risk management program (RMP) that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR Part 68, Chemical Accident Prevention Provisions (the RMP rule) and helps to manage the risks of the covered substances and processes.  One of the requirements of the RMP rule is to submit a risk management plan describing the risk management program at the Wisconsin Rapids Mill.  This document is intended to satisfy the risk management plan requirements of the RMP rule.\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nVerso continues a commitment to the environment as it strives to prevent pollution and achieve the objective of operating facilities with minimal environmental impact.  The corporate sustainable development report is publicly available on Verso's Internet website.  As part of its safety first objective, Verso will strive to minimize environmental, health, and safety risks to its employees and the communities in which it operates by employing safe technologies and operating procedures.  Verso will be constantly prepared for emergencies.  Verso will continually inform its employees and public of its progress in safety and environmental issues.\n\n\n\n\n\nFACILITY DESCRIPTION AND THE REGULATED SUBSTANCES HANDLED\n\n\n\nVerso is headquartered in Memphis, Tennessee, with a business center in Miamisburg, Ohio and a Technical Center in Biron Wisconsin.  Verso is known for its rich heritage in the paper industry and for providing a workforce with a strong work ethic. Verso has approximately 5,300 employees in various locations across the United States. Verso is the leading North American producer of printing and speci"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000054778,
      "SummaryText": "alty papers, and pulp with annual sales of $3.3 billion.  The company's product portfolio is the broadest in North America and includes coated and uncoated freesheet, coated groundwood, supercalendered, and specialty papers. These papers are used for corporate collateral, commercial printing, magazines, catalogs, books, coupons, newspapers, inserts, packaging applications and direct mail advertising.\n\n\n\nVerso operates paper mills located in Kentucky, Maine, Maryland, Michigan, Minnesota, and Wisconsin. These paper mills are at least partially integrated mills, meaning that they produce paper, pulp, and energy. Most of the energy produced at these mills is for internal use. We have a total combined annual production capacity of approximately 3.6 million short tons of paper, including approximately 2.2 million short tons of coated paper, approximately 252,000 short tons of uncoated paper and approximately 504,000 short tons of specialty paper.\n\n\n\nThe kraft pulp bleaching process in the manufacture of kraft pulp involves chemically treating the wood pulp fibers to reduce or remove lignin and resin.  Verso's mechanical pulps are being bleached using a totally chlorine-free (TCF) process.\n\n\n\nChlorine dioxide is the chemical regulated by the RMP rule since it is stored or handled at this facility in total quantities greater than or equal to the threshold quantities.  Chlorine dioxide is generated onsite as a gas under a slight vacuum and absorbed into water.  The chlorine dioxide liquid solution is stored in tanks and is used to bleach pulp.  The chlorine dioxide solution is stored in three vertical aboveground tanks with design capacities of 60,000 gallons, 60,000 gallons, and 103,000 gallons.  The chlorine dioxide solution has a concentration of 1% by weight of chlorine dioxide.  Thus, the total quantity of chlorine dioxide stored at the Mill is 20,098 lb.  The three chlorine dioxide tanks are partially located inside a building.  The worst case scenario for chlorine di"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000054778,
      "SummaryText": "oxide would be a liquid spill and vaporization from the 8,600 lb-tank (103,000 gallon tank).  An alternative release scenario would be defined as an indoor 1,000-gallon spill due to a leak in the 8-inch diameter piping connecting the largest chlorine dioxide tank to the process.\n\n\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nAs part of its corporate environmental policy, Verso will continue to protect the environment and the health and well-being of fellow employees and communities by monitoring existing facilities to ensure that they meet all legal requirements through the use of safe technologies and operating procedures.\n\n\n\nThe Mill complies with the prevention and emergency response procedures from all applicable regulations including certain applicable sections of RCRA and the Occupational Safety and Health Administration (OSHA) Emergency Action Plans (29 CFR 1910.38).\n\n\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThere have been no accidents at the Mill in the past five years that resulted in any adverse offsite impacts.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Mill's emergency response program includes a written Emergency Response Plan that discusses procedures to be followed in the case of a general emergency and specific procedures for the handling of chlorine dioxide spills to prevent and minimize the effects of an emergency involving this chemical.\n\n\n\nThe Mill's current Emergency Response Plan works with the Incident Command System.  The Incident Command System is designed to provide both public and private sector emergency response personnel with a logical building block system for managing hazardous material emergencies.\n\n\n\nThe system is designed to begin at the point where emergency response personnel recognize that they are in fact, dealing with a hazardous material emergency, even when the exact hazardous material has not been identified.\n\n\n\nThe local fire department is also trained to the Incident Command System and wi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000054778,
      "SummaryText": "ll join with the Mill team members and co-command on an incident.\n\n\n\nThe Incident Command System identifies a chain of command in response situations.  It also identifies specific responsibilities for the various levels in that chain.  The Mill has trained incident commanders, specialists, and technicians.\n\n\n\nAdditionally, Verso has a spill reporting policy that addresses the notification requirements in the event of an accidental release.  The spill reporting policy also identifies contacts and notification responsibilities.\n\n\n\nThe Mill conducts incident investigations for all events, including minor situations that involve chlorine dioxide.\n\n\n\n\n\nPLANNED CHANGES FOR SAFETY IMPROVEMENTS\n\n\n\nThis facility will undergo regular scheduled maintenance and update to meet any new or revised applicable regulation and industry standard to continue to operate safely.\n\n"
    }
  ]
}