{
  "FacilityID": 1000028186,
  "FacilityName": "Sun Pacific Shippers",
  "FacilityStr1": "1250 East Myer Road",
  "FacilityStr2": null,
  "FacilityCity": "Exeter",
  "FacilityState": "CA",
  "FacilityZipCode": "93221",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.275333",
  "FacilityLongDecDegs": "-119.128616",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sun Pacific",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sun Pacific",
  "OperatorStr1": "P.O. Box 1125",
  "OperatorStr2": null,
  "OperatorCity": "Exeter",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93221",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ramiro Velarde",
  "RMPTitle": "Plant Manager",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000190606",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-12-21 00:00:00",
  "SafetyInspectionBy": "Tulare Health Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-05-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-05-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-05-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-12-17 00:00:00",
  "DeRegistrationEffectiveDate": "2019-12-03 00:00:00",
  "AnniversaryDate": "2017-05-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034412,
      "AltID": "Chlorination",
      "FacilityID": 1000028186,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000034714,
          "ProcessID": 1000034412,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041603,
          "ProcessID": 1000034412,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000541603,
          "ProcessID": 1000034412,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028186,
      "SummaryText": "SUN PACIFIC SHIPPERS\nEXETER FACILITY\nEXECUTIVE SUMMARY\n\nAccidental Release Prevention and Emergency Response Policies\n\nChlorine is utilized as a biocide to disinfect the process water at the Sun Pacific facility in Exeter, California.  The chlorination system utilizes one ton containers for the chlorine source.  Since the chlorination process handles more than the 2,500 pound threshold quantity, Sun Pacific has developed a PSM program for the chlorination process.  \n\nThe chlorination system incorporates many inherently safe design features.  These features include fail safe (vacuum open and spring close) flow valves in the vacuum feed regulator and the ejectors that fail in the closed position.  As such, the equipment complies with recognized and generally accepted good engineering practices.\n\nAs part of the PSM programs, Sun Pacific completed a process hazard analysis, developed written operating procedures, and trained employees on the chlorination system.  Sun Pacific utilizes qualified contractors to maintain the chlorination system and ensure the mechanical integrity of the chlorination equipment.  Properly maintained equipment reduces the risk of an accidental release.\n\nAdditionally, Sun Pacific emphasizes safe and environmentally sound operating practices and procedures through their employee training programs.  In addition to job specific and process specific training, operators and maintenance personnel receive training in fire prevention, fire control, accident prevention, safety, and first aid.  \n\nWhile it is Sun Pacific?s objective to be a responsible citizen of the community in all of its business activities, the limited staff at the packing facility precludes emergency response operations.  As such, an emergency action plan has been prepared for the Sun Pacific packing facility and a chain of command to respond to emergencies has been established.\n\nSun Pacific has developed a detailed Compliance Audit Checklist which is used to evaluate compliance with"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028186,
      "SummaryText": " the Process Safety Management (PSM) and CalARP regulations.  At least every three years, Sun Pacific audits these programs and any findings of noncompliance are documented and responded to and the deficiencies are corrected.\n\n\n\n\nDescription of the Stationary Source and Regulated Substances \n\nSun Pacific owns and operates the packing facility located at 1250 East Myer Road, approximately one mile southeast of the city of Exeter, California.  The rural facility is surrounded by agricultural land uses.  \n\nSun Pacific?s chlorination system is operated in a batch process that generates chlorinated water which is stored in a holding tank prior to being metered into process water at the packing plant.  In the chlorination process,, chlorine is drawn from ton containers through vacuum feed regulators by a vacuum created by ejectors installed on the process water line.  Rotameters are installed in the vacuum tubing between the vacuum feed regulator and each ejector to regulate the flow of chlorine into the process water.   This arrangement chlorinates the process water only when there is water flow through the ejectors.  During normal operation, two one ton containers are connected to the process water chlorination system.  The maximum quantity in a one ton container is 2000 pounds of chlorine.  \n\nFor purposes of the offsite consequence analyses, the RMP regulations define the toxic endpoint for chlorine as 0.0087 mg/l (3 ppm).  This concentration has been established by the American Industrial Hygiene Association as the Emergency Response Planning Guideline Level 2 (ERPG-2).  \n\nERPG-2 is the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual?s ability to take protective action.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nA PSM program, wh"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028186,
      "SummaryText": "ich meets the requirements of the general accidental release prevention program, is being implemented by Sun Pacific to address the chlorination system.  The PSM program includes the following chemical-specific prevention steps:\n\n?    Written process safety information, including information pertaining to the hazards of chlorine, the technology of the process, and the equipment in the process has been compiled.\n\n?    Process Hazard Analyses (PHA) have been completed and will be updated and revalidated at least every five years.\n\n?    Written operating procedures will be reviewed at least annually.\n\n?    Safe work practices, such as lockout/tagout, confined space entry, opening process equipment or piping, and control over entrance into the facility are implemented as needed.\n\n?    If employees are involved in operating the chlorination system, they will receive initial training and refresher training at least every three years.\n\n?    Written mechanical integrity procedures have been established and implemented.\n\n?    A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the chlorination system.\n\n?    Pre-startup safety reviews will be performed when a modification is made to the chlorination system that is significant enough to require a change in the process safety information.\n\n?    Audits will be conducted at least every three years to evaluate compliance with the CalARP regulations.\n\n?    Incident investigation procedures have been established.\n\n?    A written plan of action regarding the implementation of employee participation has been developed and implemented.\n\n?    Hot work permits will be issued for all hot work operations conducted on or near the chlorination system, as needed.\n\n?    A Contractor Safety Policy has been developed and implemented.\n\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, Sun Pacific. has assigned overall responsibility for the RMP elements to "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000028186,
      "SummaryText": "the Plant Manager.  The Plant Manager has the overall responsibility for the development, implementation, and integration of the RMP elements.\n\nFive-Year Accident History\n\nThe Sun Pacific facility has not had any accidental releases from chlorination system that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\n\n\n\nEmergency Response Program\n\nSun Pacific has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  However, an emergency response program does not need to be developed for the facility since Sun Pacific employees will not respond to accidental releases of chlorine, the facility is included in the community emergency response plan, and appropriate mechanisms are in place to notify emergency responders.  \n\nPlanned Changes To Improve Safety\n\nSun Pacific relies on the expertise of qualified contractors to regularly evaluate the need for any changes to the chlorination equipment and to improve safety.  Currently, Sun Pacific does not have any changes planned to improve safety associated with the chlorination system."
    }
  ]
}