{
  "FacilityID": 1000036184,
  "FacilityName": "Air Liquide Large Industries U.S. LP-Freeport HPU",
  "FacilityStr1": "Highway 332",
  "FacilityStr2": "Gate 9",
  "FacilityCity": "Freeport",
  "FacilityState": "TX",
  "FacilityZipCode": "77541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48039",
  "LEPC": "Brazoria County LEPC",
  "FacilityLatDecDegs": "28.980354",
  "FacilityLongDecDegs": "-95.353421",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": "www.airliquide.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 180015062,
  "ParentCompanyName": "Air Liquide Large Industries U.S. LP",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Air Liquide LI U.S. LP",
  "OperatorStr1": "2120 Victoria Street",
  "OperatorStr2": null,
  "OperatorCity": "Freeport",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77541",
  "OperatorZipCodeExt": "3436",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000222715",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-09-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-09-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-09-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-09-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 28.980354,
  "FRS_Long": -95.353421,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044375,
      "AltID": "Hydrogen purification",
      "FacilityID": 1000036184,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000053419,
          "ProcessID": 1000044375,
          "ChemicalID": 155,
          "Quantity": 22000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000046522,
              "ProcessChemicalID": 1000053419,
              "ChemicalID": 149
            },
            {
              "FlamMixChemID": 1000046521,
              "ProcessChemicalID": 1000053419,
              "ChemicalID": 93
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000044818,
          "ProcessID": 1000044375,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000038622,
              "Process_NAICS_ID": 1000044818,
              "SafetyReviewDate": "2013-07-12 00:00:00",
              "PHA_Date": "2011-09-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-12-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Water Monitors",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Portable gas detection monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-07-11 00:00:00",
              "TrainingReviewDate": "2013-05-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training (CBT)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-06-26 00:00:00",
              "EquipmentInspectionDate": "2013-04-01 00:00:00",
              "EquipmentTested": "Hydrogen Compressor C-1802",
              "ChangeMgmtDate": "2013-06-18 00:00:00",
              "ChangeMgmtReviewDate": "2012-10-28 00:00:00",
              "PreStartupReviewDate": "2013-06-28 00:00:00",
              "ComplianceAuditDate": "2012-07-10 00:00:00",
              "AuditCompletionDate": "2013-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-10-15 00:00:00",
              "HotWorkPermitReviewDate": "2013-02-28 00:00:00",
              "ContractorSafetyReviewDate": "2008-05-02 00:00:00",
              "ContractorSafetyEvalDate": "2013-02-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000045791,
                  "PreventionProgram3ID": 1000038622,
                  "ProcessChemicalID": 1000053419
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000036184,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-04-15 00:00:00",
    "ERTrainingDate": "2013-05-10 00:00:00",
    "CoordinatingAgencyName": "Brazoria County LEPC",
    "CoordinatingAgencyPhone": "9798641201",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036184,
      "SummaryText": "OVERVIEW\r\nAir Liquide Large Industries, L.P. (Air Liquide) operates a hydrogen recovery and purification unit (HPU) process in Freeport, Texas.  The HPU is considered the covered process, as defined in the accidental release prevention regulations, having a flammable mixture in the process in excess of 10,000 pounds.  The HPU process involves recovering and purifying byproduct hydrogen from various host processes.  The purified hydrogen is then exported to end user customers via a hydrogen pipeline.  The hydrogen purification process is closely monitored and controlled to prevent accidental releases to the environment.  Air Liquide's commitment to safety and environmental protection must extend beyond its gates.  As part of the community, we have a responsibility to our customers and to those who live in the surrounding area.  Through safety, concern for the environment, and community involvement, we can develop a true partnership with our customers and neighbors.\r\n\r\nRegulated Chemical\r\nThe HPU process is designed to provide an efficient production of high purity hydrogen product using various byproduct feedstocks.  Purified hydrogen is sold to industrial customer(s).  The Freeport HPU is designed for continuous operation and is designed for inherently safe operation.\r\n\r\nHydrogen Purification Process \r\nHydrogen purification is a recovery and purification process using various hydrogen rich streams as feedstock.  The purification process takes place under elevated pressure.  The process has two sub-processes, each set up to purify the incoming byproduct hydrogen to meet pipeline quality specification as suitable for end customer.  The Grade 1 by product feedstock is near pure hydrogen stream, which is washed, filtered, compressed and then passed through an adsorption step to remove trace impurities.  The Grade 2 byproduct stream, a 70% hydrogen stream, is compressed and passed through a pressure swing adsorption (PSA) unit to concentrate and purify the hydrogen s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036184,
      "SummaryText": "o it can then be exported via a hydrogen pipeline to customers.  The remainder of the Grade 2 stream rejected by the PSA, a primarily methane and other light hydrocarbon mix, is recovered and sent back to the host to be used as fuel.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM STEPS\r\nAir Liquide's Freeport HPU is covered by EPA's accidental release prevention program regulations and is subject to OSHA's process safety management (PSM) standard.  The flammability of some of the chemicals in the process makes it necessary for Air Liquide to observe certain safety precautions to prevent unnecessary human and environmental exposure and to reduce the potential threat to personnel and nearby members of the community.  Air Liquide's policy is to comply with all applicable federal and state rules and regulations. The summary below discusses some of the management system in place to implement the accidental release prevention program.\r\n\r\nProcess Safety Information (PSI)\r\nAir Liquide keeps a variety of technical documents onsite and in the company's electronic document control system (SMARTSOLVE) that are used to help maintain safe operation of its processes.  These documents address chemical properties and associated hazards, equipment design/configuration information, specific chemical inventories and operation limits for key process parameters - all key information for operating the process safely.  Process operators are trained to operate the process using process controls and instrumentation within these operating limits.\r\n\r\nThe Plant Manager is responsible for maintaining up-to-date process safety information.  A table summarizing the reference documents and their location is readily available as part of the written employee participation plan described below.  \r\n\r\nProcess Hazard Analysis\r\nAir Liquide has a risk management program to help ensure that hazards associated with the various processes are identified and control.  The covered process underwent an initial"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036184,
      "SummaryText": "process hazard analysis (PHA) in 02/20/2006 and will continue to undergo periodic review/re-validations at least every five years.  The PHA team consists of members with the appropriate experience to define the hazards and mitigating controls of the process and also represents a cross-section of the employees working in the process.  For upcoming PHA reviews, local and corporate management will review the PHA team findings and develop a resolution action plan for each item, which will be documented, tracked and ultimately closed in the Air Liquide action item database tracking system (SIMON).  The Freeport HPU manager is responsible for prioritizing and tracking implementation of the action plan.\r\n\r\nOperating Procedures\r\nAir Liquide maintains written procedures that address various modes of hydrogen purification process operations, such as (1) unit initial startup; (2) unit normal and temporary operations; (3) unit shutdown; (4) emergency shutdown; (5) startup following an emergency shutdown; and (6) process deviation, consequence and action.  These procedures are used by experienced operators and provide a basis for consistent training of new operators. These procedures are reviewed and annually certified as current and accurate.\r\n\r\nTraining\r\nAir Liquide has implemented a training program for all employees involved in operating the hydrogen purification process.  All employees receive a combination of classroom, computer-based training (CBT) and hands-on training that addresses such topic as: general orientation, site rules and practices, process safety information, normal and emergency operating procedures, health and safety consideration, use of safety procedures and equipment, incident investigation and emergency response.  In addition, all operators are required to attend refresher training at least every three years.  Training is documented and tracked in the electronic document system SMARTSOLVE. \r\n\r\nMechanical Integrity\r\nAir Liquide has established mechanica"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036184,
      "SummaryText": "l integrity (MI) practices and procedures, based on preventative philosophy, to maintain pressure vessels, piping systems, and relief valves and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests; (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process equipment.  \r\n\r\nThe MI program assists with the verification and suitability of new and existing process equipment and, as well as quality control of spare parts and modifications to existing process equipment.\r\n\r\nManagement of Change\r\nAir Liquide's management of change (MOC) procedure has established the requirements for ensuring that proposed process or equipment changes or changes indirectly affecting processes are evaluated, approved and documented prior to implementation through the use of a management of change process.  The MOC procedure outlines the requirements for documenting, evaluating the impact, and approving planned deviations from procedure.  All MOCs are submitted, reviewed by subjective matter specialist (such as Engineering, Risk Management, Operations, Health and Safety), approved, tracked and closed using the SmartCAPA system in the electronic document control system SMARTSOLVE.  Upon closure, personnel whose assigned job functions are impacted by the MOC, are briefed and /or trained in the MOC requirements. \r\n\r\nPre-startup Safety Reviews\r\nAir Liquide ensures the safety of new/modified facilities or processes before placing those facilities or processes into service through the use of pre-startup safety reviews (PSSRs).  PSSRs are intended to ensure safety through confirmation that:  (1) construction and equipment are in accordance with design specifications; (2) safety, o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036184,
      "SummaryText": "perating, maintenance and emergency procedures are in place and adequate; (3) PHAs have been performed and recommendations resolved before startup of new plants or processes; (4) MOC requirements have been satisfied for modified facilities; and (5) training has been completed for affected employees.\r\n\r\nCompliance Audits\r\nTo help ensure the accident prevention program is functioning properly, Air Liquide conducts an audit to determine whether the procedures and practices required by the accidental release prevention program are being implemented.  Compliance audits are conducted at least every three years.  Resolutions to the recommendations are documented, tracked and closed in SIMON.  Once the resolutions have been completed, chances are communicated to operating, maintenance and other employees whose work assignments are in the process and who may be affected by the recommendations or actions.\r\n\r\nIncident Investigation\r\nAir Liquide defines management systems and establishes the requirements for communicating, investigating and reporting of incidents at all facilities through the use of an Incident Investigation and reporting procedure.  Air Liquide documents incident and subsequent investigation, follow up actions, and closure in the electronic document system SMARTSOLVE.  The Plant Manager is responsible for maintaining a log and tracking incidents and corrective actions through completion.  Results of findings and corrective actions are shared with employees who could be affected by the findings.  Reports are retained for at least five years to be reviewed during future PHAs and PHA revalidations.\r\n\r\nEmployee Participation\r\nAt the Freeport HPU, employees are expected to participate in accidental release prevention program (PSM/RMP).   Employees are trained on and are provided access to the hydrogen process safety information.  The specific ways an employee can be involved in the accident prevention program are documented in the Employee Participation plan.  Form"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000036184,
      "SummaryText": "s of participation include being part of a PHA, a PSSR, and/or being involved in incident investigation. Employees participate in monthly safety meetings where process safety issues are discussed and corrective actions are developed, and they are involved in the review of the covered process operating procedures annually to ensure they are correct and recommend any necessary changes. \r\n\r\nSafe & Hot Work Permit System\r\nAir Liquide has a safe & hot work permit system in place to help ensure worker and process safety.  This system is comprised of a group of corporate procedures and standards under the life safety program.  Procedures in place included: (1) energy control; (2) safe work; (3) hot work; (4) confined space entry.  Facility personnel are trained on these safe work practices to ensure that operations and maintenance activities are performed safely.\r\n\r\nContractors\r\nAir Liquide uses contractors to supplement its own work force when maintenance activities exceed the capabilities or time available for their own operators.  Contractors are made aware of the potential dangers involved with a system covered by PSM/RMP.  Procedures are in place to make sure that contractors:  (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, and (4) understand what they should do in the event of an emergency, prior to their beginning work. Periodically contractors are evaluated to ensure that both their safety performance and training required for work on the hydrogen purification process meet Air Liquide's safety standards.\r\n\r\nCHEMICAL SPECIFIC PREVENTION STEPS\r\nAir Liquide's accidental release prevention program activities helps prevent potential accident scenarios that could be caused by equipment failures and human errors.  The following are examples of the types of safety features in place:\r\n\r\nRelease Detection\r\n¿\tPersonal/portable ambient air monitors\r\nRelease Mitigation\r\n¿\tPressure safety v"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000036184,
      "SummaryText": "alve (PSV)\r\n¿\tFlare\r\n¿\tFire water monitor\r\n¿\tSpecial personal protective equipment (e.g., Fire protective clothing)\r\n¿\tAutomatic control and manual valves that provide for isolation of the process equipment  \r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nThe Freeport HPU has an excellent record of accident prevention and there have been no accidents to date resulting in onsite or offsite impacts.\r\n\r\nEMERGENCY RESPONSE PROGRAM INFORMATION\r\nThe Freeport HPU employees are trained to first responder's awareness level in case of accidental releases of regulated substance and maintain a written emergency action plan (EAP) to be followed.  The EAP describes coordination with Dow Oyster Creek Emergency Response, local response agencies, and outside agency notification procedures in the event of a hydrogen /flammable substance release.  The EAP provides details of the evacuation of facility personnel and visitors.\r\n\r\nShould an emergency involving the release from the covered process occur that will have off-site consequences, Air Liquide will contact the Dow Oyster Creek Emergency Response, who shall determine and coordinate action for the affected community.  Freeport HPU maintains communication with the Dow Oyster Creek Emergency Response to ensure that that they are familiar with the facility's EAP.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY \r\nThe Air Liquide Freeport HPU resolves the findings of its PHA and other hazard reviews some of which result in modifications of the process.   Most recently Air Liquide increased staff to enhance safety and reliability.  The increased staff adds greater flexibility to cover normal day to day operations and increase operator participation in design hazard and other management reviews."
    }
  ]
}