{
  "FacilityID": 1000104282,
  "FacilityName": "PFG Springfield",
  "FacilityStr1": "1 Performance Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "MA",
  "FacilityZipCode": "01104",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25013",
  "LEPC": "Springfield LEPC",
  "FacilityLatDecDegs": "42.13384",
  "FacilityLongDecDegs": "-72.54967",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "https://performancefoodservice.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 17431466,
  "ParentCompanyName": "Performance Food Group",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "PFG Springfield",
  "OperatorStr1": "1 Performance Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01104",
  "OperatorZipCodeExt": null,
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000227578",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-08-12 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-02-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-02-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-02-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-02-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 42.1373,
  "FRS_Long": -72.5471,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000129869,
      "AltID": "NH3 Refrigeration System",
      "FacilityID": 1000104282,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000162791,
          "ProcessID": 1000129869,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000131302,
          "ProcessID": 1000129869,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000111898,
              "Process_NAICS_ID": 1000131302,
              "SafetyReviewDate": "2022-10-31 00:00:00",
              "PHA_Date": "2019-12-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-01-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Dispersion Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-01-27 00:00:00",
              "TrainingReviewDate": "2020-12-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-01-27 00:00:00",
              "EquipmentInspectionDate": "2023-02-08 00:00:00",
              "EquipmentTested": "Pumps, water treatment, vessels, auto-purger, condenser, evaporators, temp sensors, eyewash/shower",
              "ChangeMgmtDate": "2022-08-18 00:00:00",
              "ChangeMgmtReviewDate": "2020-12-16 00:00:00",
              "PreStartupReviewDate": "2022-10-25 00:00:00",
              "ComplianceAuditDate": "2020-12-16 00:00:00",
              "AuditCompletionDate": "2021-08-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2020-12-16 00:00:00",
              "HotWorkPermitReviewDate": "2020-12-16 00:00:00",
              "ContractorSafetyReviewDate": "2023-01-27 00:00:00",
              "ContractorSafetyEvalDate": "2020-12-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000140497,
                  "PreventionProgram3ID": 1000111898,
                  "ProcessChemicalID": 1000162791
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000104282,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Springfield Fire Department",
    "CoordinatingAgencyPhone": "4137876400",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000104282,
      "SummaryText": "Executive Summary\nPFG - Springfield, MA\nRisk Management Plan Executive Summary General Executive Summary:\n\n1. Accidental Release Prevention and Emergency Response Policies:\nWe at PFG - Springfield, MA are committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as the design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Unforeseeable, if such a release does occur; our highly trained employees are on hand to control and mitigate the effects of the release. We are also completely coordinated with Springfield Fire Department which provide our emergency response services.\n\n2. The Stationary Source and the Regulated Substances Handled:\nPFG - Springfield, MA utilizes an anhydrous ammonia refrigeration system to keep products at temperature and preserve food safety standards. Anhydrous ammonia is the only regulated substance present at PFG - Springfield, MA. The maximum intended inventory of anhydrous ammonia that is expected to be present in this system is 13,424 pounds.\n\n3.  The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps:\nPFG - Springfield, MA has taken the following steps as required by 40 CFR Part 68 of the EPA, and the OSHA PSM Standard under 29 CFR 1910.119. PFG - Springfield, MA is also subject to EPCRA Section 302 reporting requirements. The following sections briefly describe the elements of the release prevention program that is in place.\n\nProcess Safety Information:\nPFG - Springfield, MA keeps comprehensive Process Safety Information (PSI) documentation for the ammonia refrigeration system. This PSI assists the employee operators and outside contractors in understanding the ammonia refrigeration system so they can operate and maint"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000104282,
      "SummaryText": "ain the ammonia refrigeration system in a safe efficient manner. PSI is available to all employees.\n\nProcess Hazard Analysis:\nOur facility conducts comprehensive studies to ensure that hazards associated with our process are identified and controlled efficiently. The methodology used to carry out these analyses is the What if/Checklist Study. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every five years. The process hazard analysis is also revalidated when there is an extensive change in the process. Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures:\nPFG - Springfield, MA maintains written operating procedures. These procedures address various modes of operation such as initial start-up, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and start-up after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the process.\n\nTraining:\nPFG - Springfield, MA has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. New employees involved in the process receive basic training in process operations, followed by on-the-job supervision until they are deemed competent to work independently. Refresher training is provided at least every 3 years and more frequently as needed.\n\nMechanical Integrity:\nPFG - Springfield, MA carries out highly documented maintenance checks on process equipment to ensure proper operation. Process equipment examined by these checks includes pressure vessels, storage tanks, piping system, relief and vent systems, emergency shutdown systems, controls and pumps. Qualified personnel carry out maintenance operations with special training in maintenance practices. Furthermore, these per"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000104282,
      "SummaryText": "sonnel are given specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a timely manner.\n\nManagement of Change:\nWritten procedures are in place at PFG - Springfield, MA to manage change in process chemicals, technology, equipment and processes. Process operators, maintenance personnel, or any other employees whose job tasks are affected by a modification in process operations, are promptly made aware of, and given, training to deal with the modifications.\n\nPre-Startup Reviews:\nPre-startup reviews related to new processes, and to modifications in established processes are conducted as a regular practice at PFG - Springfield, MA. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe start-up prior to placing equipment into operation.\n\nCompliance Audits:\nPFG - Springfield, MA conducts audits on a regular basis to determine whether the provisions set out under the RMP Rule are being implemented. These audits are carried out at least every three years and any corrective actions required as a result of the audits are undertaken in a safe and timely manner.\n\nIncident Investigation:\nPFG - Springfield, MA promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident, as well as any corrective actions to prevent the release from recurring. All reports are retained for a minimum of 5 years.\n\nEmployee Participation:\nPFG - Springfield, MA believes that process safety management and accident prevention are a team effort. Employees are strongly urged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule; including information resulting"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000104282,
      "SummaryText": "from process hazard analysis, in particular.\n\nContractors:\nOn occasion, PFG - Springfield, MA hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of the contractor's safety performance is completed. PFG - Springfield, MA has a strict policy of informing contractors of known potential hazards related to the contractor's work and the process. Contractors are also informed of all the procedures for emergency notification and evacuation, should an accidental release of a regulated substance occur.\n\n4.   5-Year Accident History:\nThis facility has not had any accidental releases from covered processes that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage during the past 5 years.\n\n5.  Emergency Response Plan:\nPFG - Springfield, MA has a written emergency action plan to deal with accidental releases of hazardous materials. The emergency action plan includes specific actions to be taken in response to accidental releases of regulated substances. The emergency action plan includes procedures for informing the public and local response agencies of a chemical release. The emergency action plan includes information on emergency health care. PFG - Springfield, MA works closely with the Springfield Fire Department for response to emergency situations including releases of anhydrous ammonia.\n\n6. Planned Changes to Improve Safety:\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. We will continue our annual facility evacuation drills and planning/training site visits with Springfield Fire Department in the future."
    }
  ]
}