{
  "FacilityID": 1000043859,
  "FacilityName": "Harcros Chemcials Inc. - Muscle Shoals",
  "FacilityStr1": "300 Pepi Drive",
  "FacilityStr2": null,
  "FacilityCity": "Muscle Shoals",
  "FacilityState": "AL",
  "FacilityZipCode": "35662",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01033",
  "LEPC": "Colbert County LEPC",
  "FacilityLatDecDegs": "34.76704",
  "FacilityLongDecDegs": "-087.61854",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": "harcros.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Harcros Chemicals Inc.",
  "Company2Name": null,
  "CompanyDUNS": 194128765,
  "Company2DUNS": null,
  "OperatorName": "Harcros Chemicals Inc.",
  "OperatorStr1": "P.O. Box 2930",
  "OperatorStr2": null,
  "OperatorCity": "Kansas City",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66110",
  "OperatorZipCodeExt": "2930",
  "FTE": 16,
  "OtherEPAFacilityID": "35662HRCRS300PE",
  "EPAFacilityID": "100000011505",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-10-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.76632,
  "FRS_Long": -87.61727,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054187,
      "AltID": "Chlorine & SO2",
      "FacilityID": 1000043859,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065949,
          "ProcessID": 1000054187,
          "ChemicalID": 62,
          "Quantity": 1528000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000065950,
          "ProcessID": 1000054187,
          "ChemicalID": 49,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000054995,
          "ProcessID": 1000054187,
          "NAICSCode": "42469",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000045454,
              "Process_NAICS_ID": 1000054995,
              "SafetyReviewDate": "2013-10-02 00:00:00",
              "PHA_Date": "2014-06-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Zurich Hazard Analysis",
              "PHACompletionDate": "2013-10-02 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Security",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Piping & Valve modifications",
              "OpProceduresReviewDate": "2013-11-04 00:00:00",
              "TrainingReviewDate": "2012-12-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-10-01 00:00:00",
              "EquipmentInspectionDate": "2014-06-06 00:00:00",
              "EquipmentTested": "Piping, valves & actuators, hoses, scales, expansion chamber, dew point instrument",
              "ChangeMgmtDate": "2013-11-04 00:00:00",
              "ChangeMgmtReviewDate": "2012-12-03 00:00:00",
              "PreStartupReviewDate": "2010-01-19 00:00:00",
              "ComplianceAuditDate": "2013-01-10 00:00:00",
              "AuditCompletionDate": "2013-03-25 00:00:00",
              "IncidentInvestigationDate": "2008-07-31 00:00:00",
              "InvestigationChangeDate": "2008-08-05 00:00:00",
              "ParticipationPlansReviewDate": "2008-06-06 00:00:00",
              "HotWorkPermitReviewDate": "2003-08-01 00:00:00",
              "ContractorSafetyReviewDate": "2014-01-16 00:00:00",
              "ContractorSafetyEvalDate": "2011-08-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000054835,
                  "PreventionProgram3ID": 1000045454,
                  "ProcessChemicalID": 1000065949
                },
                {
                  "PrimaryKey": 1000054836,
                  "PreventionProgram3ID": 1000045454,
                  "ProcessChemicalID": 1000065950
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043859,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Colbert County Emergency Management",
    "CoordinatingAgencyPhone": "2563868558",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043859,
      "SummaryText": "EXECUTIVE SUMMARY - MUSCLE SHOALS\r\n\r\n\r\n1. Accidental release prevention and emergency response policies\r\n\r\nIn this distribution facility, we handle chlorine and sulfur dioxide, which are considered hazardous by the EPA.  The same properties that make chlorine and sulfur dioxide valuable as commodity chemicals also make it necessary to observe certain safety precautions to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as that of our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and State rules and regulations.  Safety depends upon the manner in which we handle chlorine and sulfur dioxide, and the training of our personnel.\r\n\r\nOur emergency response program is based upon The Chlorine Institute's Pamphlet 64, Emergency Response Plans for Chlorine Facilities.  The emergency response plan includes procedures for notification of the local fire authority and notification of our immediate neighbors.  See Emergency Response (Section 5) for more information.\r\n\r\n\r\n2. The stationary source and regulated substances handled\r\n\r\nOne of the primary purposes of this facility is to repackage and distribute chlorine and to distribute sulfur dioxide to water treatment facilities and general industry.  We also manufacture sodium hypochlorite (bleach) as a byproduct of the chlorine repackaging operation.  Chlorine is received by rail car and sulfur dioxide is received in Department of Transportation (DOT) approved 150 pound cylinders and ton containers.  No packaging of sulfur dioxide is done at this facility, but both sulfur dioxide and chlorine containers are cleaned and tested here.  Chlorine from rail cars is used to fill DOT approved containers.  Access to the site is restricted to Harcros employees, and authorized contractors and visitors.  The packaging of chlorine and manufacture of sodium hypochlorite is subject to RMP Program Level 3.  \r\n\r\n\r\n3. The gener"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000043859,
      "SummaryText": "ate emergency response personnel if required.\r\n\r\n\r\n6. Planned changes to improve safety\r\n\r\nThis distribution facility was constructed in 1969.  We continue to participate in The Chlorine Institute and the National Association of Chemical Distributor programs, and to continue to improve our operations in accordance with Responsible Distribution Guidelines.  \r\n\r\nThere are no specific safety improvements planned at this time for the RMP covered processes at this facility, but we will continue to review our security procedures in accordance with Department of Homeland Security requirements."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043859,
      "SummaryText": "al accidental release prevention program and the specific prevention steps\r\n\r\nThis distribution facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility is operated in accordance with recommendations from The Chlorine Institute and with the Responsible Distribution Code of Management Practice of the National Association of Chemical Distributors.\r\n\r\nA summary of our Prevention Program\r\n\r\nPROCESS SAFETY INFORMATION - Our facilities maintain current copies of Material Safety Data Sheets (soon to be known as Safety Data Sheets) for all hazardous chemicals stored including Chlorine and Sulfur Dioxide.  In addition, this facility has current copies of all relevant Chlorine Institute pamphlets.  Much of the information in these pamphlets is applicable to the storage of sulfur dioxide also.  Additional safety information includes Piping and Instrumentation Diagrams, process chemistry for the manufacture of sodium hypochlorite, descriptions of safety systems, and the safe upper and lower limits of process variables.\r\n\r\nPROCESS HAZARD ANALYSIS - A process hazard analysis has been conducted and it is updated at least every 5 years.  We perform a Zurich Process Hazard Analysis which evaluates potential risks caused by human and mechanical failures.  In addition, we have used checklists to evaluate risks caused by Human and Source Siting factors.  At least one hourly employee (warehouse personnel or driver) takes part in these analyses.  Corrective or preventative actions discovered during these analyses are documented and addressed in a timely manner.  Results of these analyses are shared with all operators.\r\n\r\nOPERATING PROCEDURES - We have Standard Operating Procedures covering all aspects of handling chlorine and sulfur dioxide at this facility.  The procedures are based on and are augmented by Pamphlet 17 of The Chlorine Institute (Packaging Plant Safety and Operational Guidelines).  Chlorine packa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043859,
      "SummaryText": "ging procedures include information necessary for normal startup, typical operations, emergency shutdown, and the conditions that may make an emergency shutdown necessary.  Operations conducted at this facility are simple packaging and batch operations and are easily started and shut down.\r\n\r\nTRAINING - All new drivers and operating personnel attend a 3 or 4 day training workshop covering a variety of safety, environmental, and regulatory topics.  Workers at facilities that handle chlorine and sulfur dioxide receive additional training on the hazards, health effects, and operating procedures specific to those chemicals.  Operators directly involved with the repackaging and related operations of chlorine work under the immediate supervision of an experienced operator until they are deemed fit by management to work independently.  Refresher training is conducted at least every 3 years.\r\n\r\nMECHANICAL INTEGRITY - The Harcros Chemicals Muscle Shoals plant maintains the mechanical integrity of our equipment to prevent equipment failures that could endanger employees, the public, or the environment.  Our inspection and testing program helps identify damage or deterioration before equipment fails.  Daily and longer period checklists are used to assist operators checking critical equipment.  Some equipment is replaced on a periodic basis and others are replaced or repaired when problems are discovered during inspections or normal operations.  Inspections and most simple maintenance activities at this facility are performed by the experienced plant operators and managers.  Qualified contractors are used for maintenance activities that require special skills or when otherwise needed.\r\n\r\nMANAGEMENT OF CHANGE - We review all changes to our processes to determine if new hazards are introduced or existing prevention measured are threatened.  Except for replacements-in-kind, all changes are subject to review to ensure that (1) new hazards are not inadvertently introduced, (2) safet"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043859,
      "SummaryText": "y consequences resulting from the change are addressed, (3) operators are notified of the change, and (4) training material, process safety information, and operating procedures are updated if required.\r\n\r\nPRE-STARTUP SAFETY REVIEW - If a change requires updating the process safety information, we will perform a pre-startup safety review.  This review would ensure safety features, procedures, personnel, and equipment are prepared for service before startup.  This review will generally include field verification of new construction and also serves as a quality assurance function by verifying that accident prevention measures are implemented correctly.\r\n\r\nINCIDENT INVESTIGATION - We have an Incident Investigation SOP which requires operation managers to document and investigate incidents involving injuries and environmental releases, as well as near-misses that could have lead to injuries and releases.  These reports are reviewed by Corporate safety personnel and are shared with all operators at the facility.  Hourly employees take part in all investigations.  Corrective actions proposed as a result of these investigations are addressed in a timely manner.\r\n\r\nEMPLOYEE PARTICIPATION - Harcros Chemicals encourages employees to be involved in all aspects of process safety management and accident prevention.  Employees participate in process hazard analyses, incident investigations, and management of changes.  Employees have access to all information developed as part of this prevention program and are informed of any changes in process areas.\r\n\r\nHOT WORK PERMITS - Our Hot Work procedures requires reviews and a daily permit be issued for any work involving flames or spark producing equipment in process areas.\r\n\r\nCONTRACTORS - The Harcros Chemicals Muscle Shoals plant occasionally uses contractors for short-term maintenance and construction activities.  All contractors are evaluated to ensure they are able to perform the required tasks safely.  We provide training to con"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043859,
      "SummaryText": "tractors to ensure they perform work in a safe manner, are aware of the hazards of the process, understand the emergency response procedures, and report hazards they discover during their work.  We periodically monitor contractor activities to ensure they are performing their work in a safe manner.\r\n\r\nCOMPLIANCE AUDITS - A compliance audit is conducted at least every 3 years to assure the documentation and procedures fully comply with the RMP regulations.  Deficiencies discovered during audits are corrected in a timely manner.\r\n\r\n\r\n4. Five year accident history\r\n\r\nWithin the past 5 years, this facility has had no accidental releases that have resulted in deaths, injuries or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\r\n\r\n\r\n5. The emergency response program\r\n\r\nDue to recent personnel changes, this facility does not currently have a trained emergency response team. In the meantime, any emergency requiring a response will be performed by public and private responders, and by trained members from other Harcros locations. Experienced Harcros-Muscle Shoals personnel will be available to provide assistance. Our plan is to have the appropriate response training completed within a couple of months after this submittal.  The emergency response program is based upon The Chlorine Institute's Pamphlet 64, Emergency Response Plans for Chlorine Facilities.  This plan is reviewed annually and updated when required.  All response team members will attend annual refresher training including the use of response equipment on simulated leaks.  We work closely with our suppliers, customers, public responders, and The Chlorine Institute to continuously improve our emergency response capabilities.\r\n\r\nOur response program, when fully re-implemented, will be for chlorine and sulfur dioxide leaks only.  We will not respond to other types of emergencies but will assist trained public and priv"
    }
  ]
}