{
  "FacilityID": 1000060762,
  "FacilityName": "BASF Corporation",
  "FacilityStr1": "100 Bridgeport Rd",
  "FacilityStr2": null,
  "FacilityCity": "West Memphis",
  "FacilityState": "AR",
  "FacilityZipCode": "72301",
  "Facility4DigitZipExt": "6413",
  "FacilityCountyFIPS": "05035",
  "LEPC": "Crittenden County LEPC",
  "FacilityLatDecDegs": "35.130556",
  "FacilityLongDecDegs": "-090.106944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "https://www.basf.com/us/en.html",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1307032,
  "ParentCompanyName": "BASF Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1307032,
  "Company2DUNS": 0,
  "OperatorName": "BASF",
  "OperatorStr1": "100 Bridgeport Rd",
  "OperatorStr2": null,
  "OperatorCity": "West Memphis",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72301",
  "OperatorZipCodeExt": "6413",
  "FTE": 75,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000127178",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "860-AR8",
  "SafetyInspectionDate": "2016-08-23 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-03-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-12-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-12-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2022-01-26 00:00:00",
  "DeRegistrationEffectiveDate": "2021-12-13 00:00:00",
  "AnniversaryDate": "2021-12-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.13056,
  "FRS_Long": -90.10694,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ZIP CODE-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000075932,
      "AltID": "EPI/Polyol",
      "FacilityID": 1000060762,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094083,
          "ProcessID": 1000075932,
          "ChemicalID": 21,
          "Quantity": 323541.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000077114,
          "ProcessID": 1000075932,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000063813,
              "Process_NAICS_ID": 1000077114,
              "SafetyReviewDate": "2017-08-06 00:00:00",
              "PHA_Date": "2017-08-29 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 1,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-07-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "DCS, SIS,",
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "SIS",
              "OpProceduresReviewDate": "2019-12-20 00:00:00",
              "TrainingReviewDate": "2016-10-03 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer Based",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-08-01 00:00:00",
              "EquipmentInspectionDate": "2016-10-14 00:00:00",
              "EquipmentTested": "107VO, 701VO",
              "ChangeMgmtDate": "2016-10-26 00:00:00",
              "ChangeMgmtReviewDate": "2014-09-19 00:00:00",
              "PreStartupReviewDate": "2016-10-26 00:00:00",
              "ComplianceAuditDate": "2019-09-28 00:00:00",
              "AuditCompletionDate": "2020-09-27 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-01-27 00:00:00",
              "HotWorkPermitReviewDate": "2016-01-27 00:00:00",
              "ContractorSafetyReviewDate": "2016-01-27 00:00:00",
              "ContractorSafetyEvalDate": "2016-07-19 00:00:00",
              "CBI_Flag": 0,
              "Description": "Polyamines P1 & EPI/polyol Reactions.\n\nThis process involves reactions of epichlorohydrin (listed RMP chemical) with either an amine, Dimethyl amine, (listed RMP chemical) or the reaction of epichlorohydrin with a polyol.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000078453,
                  "PreventionProgram3ID": 1000063813,
                  "ProcessChemicalID": 1000094083
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000060762,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2016-01-13 00:00:00",
    "ERTrainingDate": "2016-10-14 00:00:00",
    "CoordinatingAgencyName": "Crittenden County",
    "CoordinatingAgencyPhone": "8707393534",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060762,
      "SummaryText": "BASF Corporation\n\nWest Memphis, AR.\n\n\n\n\n\n1.0) Introduction:\n\n\n\nRisk Management Plan (RMP)  \n\nExecutive Summary - November 2016\n\nBASF Corporation \n\nWest Memphis, AR.\n\n\n\n1.0) Introduction:\n\n\n\n1.1) Site History \n\n\n\nBASF Corporation, West Memphis, Arkansas manufacturing facility is located at the junction of interstate highway I-55 and the Mississippi river.  The site is approximately 150 acres in size and was originally an Army Corp of Engineers barge repair facility during the 1930's.  During the 1970's the site manufactured agricultural chemicals for Chemform, Inc. In 1981, CPS Chemical Co. acquired the site and originally had 10 employees.  The site grew to 240 employees by 1997 when CPS was purchased by Allied Colloids.  Ciba Specialty Chemical Co. acquired the site in 1998 with the purchase of Allied Colloids. The site was used by CPS and later Allied Colloids and Ciba Corporation and now BASF Corporation for the production of water treatment chemicals.   In 2016 BASF realigned the site eliminating the manufacture of water treatment chemicals and focused on  production of Epichlorohydrin based products as additives in the paint and ink industry.\n\n\n\n1.2) BASF Corporation's Accidental Release and Emergency Response Policies \n\n\n\nBASF has established an Emergency Response Team (ERT) composed of experienced chemical operators and shift supervisors who are trained to respond to an accidental release, fire, spill, or other emergency at the West Memphis site. In accordance with 29 CFR 1910, Hazardous Waste and Emergency Response (Hazwoper) training requirements, all employees receive Awareness Level training. Chemical operators receive Technician Level training and shift supervisors receive Incident Command Level training. The site ERT operates under the same Incident Command Structure as the West Memphis Fire Department (Designated Mutual Aid Provider).\n\n\n\nIf an incident requires the site's Emergency Response Team to be activated, the incident commander will determine if"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060762,
      "SummaryText": " the West Memphis Fire Department should be notified. BASF  ensures that local authorities are made aware of our efforts to continuously improve the West Memphis site's Emergency Response Plan (ERP) through annual site inspections and walk through reviews with the West Memphis Hazardous Material (HAZMAT) responders and the fire fighters who would be called on to respond to an emergency at our facility.\n\n\n\n\n\n2.0) Regulated Substances Summary\n\n\n\nThe following RMP chemicals are used in excess of threshold quantities at this plant:  \n\n\n\nEpichlorohydrin (EPI)\n\n\n\n\n\nProduction area P1 produces Epi/polyol products. These products are produced as solutions in water.  These monomers and polymers are used, as additives in the paint and ink industry and in paper making. \n\n\n\n3.0 ) Worst-Case and Alternate-Case Release Scenarios  \n\n\n\nContact Site Emergency Coordinator for additional details.\n\n\n\n4.0) General Accident Prevention Program & Chemical Specific Prevention Steps  \n\n\n\n4.1) Accident Prevention Program \n\n\n\nThe chemical processes subject to the Risk Management Plan(RMP) regulation are also subject to the Occupational Safety and Health Administrations,(OSHA) Process Safety Management (PSM) standard. Both regulations establish specific guidelines for safe chemical plant operations.  Recommended practices are designed both to prevent accidents from occurring and to effectively respond if an incident or accident does occur. BASF has a specific course of action and procedures in place to address the PSM and RMP  Requirements. These measures are discussed below:\n\n  \n\nSpecific Chemical information is contained in  Safety Data Sheets (SDS). Information regarding toxicity, reactivity, physical data, reactivity data, corrosivity data, thermal and chemical stability data, and hazardous effects of inadvertent mixing is developed for all covered processes. Information regarding process chemistry, block-flow diagrams, safe upper and lower operating limits for process parameters, and conse"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060762,
      "SummaryText": "quences of deviations are included in the standard operating procedures (SOP's). \n\n\n\nThe Maintenance Department maintains fabrication data for all process plant equipment and tracks equipment repair history to ensure ongoing equipment reliability. A preventative maintenance program requires periodic inspection and testing of all vessels, protective equipment, and interlocks on processes containing hazardous materials.\n\n\n\nA Process Hazard Analysis (PHA) is conducted on each PSM and RMP covered process.  PHA information is maintained by the EH&S Department and the PSM committee,  including the priority order and schedule of future PHA's.  Process Safety Information (PSI) and PHA's are available to all employees for their review, input, and training. \n\n\n\nStandard Operating Procedures (SOP's) are routinely reviewed and updated as needed. Process training is provided prior to new process introduction.  Refresher training is conducted at a minimum of every 3 years. \n\n\n\nA Mechanical Integrity program is in place and is administered by the Maintenance Department. Changes to covered processes are implemented in accordance with the Site's Management of Change (MOC) procedure. MOC documentation including Hazard Assessment and Pre-Startup safety reviews, is maintained by the Engineering department. \n\n\n\nIncident Investigation Procedures include employee participation to ensure that the fundamental causes of all incidents are correctly identified, corrective actions are identified, appropriate, and implemented in a timely manner to prevent a recurrence. \n\n\n\n4.2) Chemical Specific Prevention Steps \n\n\n\nThe  epichlorohydrin (EPI) storage tank is equipped with a spill containment basin and fire monitors and foam deluge system to extinguish a fire if necessary. The EPI tank also has high pressure and high level alarms and shut-off to prevent over filling of the tank.  \n\n\n\nThe maintenance department administers a preventative maintenance (PM) program at the site which ensures that all "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000060762,
      "SummaryText": "safety critical equipment associated with these tanks is routinely inspected and repaired or replaced before failures occur. \n\n\n\nA distributed control system (DCS) is in place at the site and alarms and interlocks have been set up to alert employees and automatically shut off transfers of hazardous materials from these tanks should a leak or over pressure release occur. \n\n\n\n5.0) Five Year Accident History\n\n\n\nDuring the past 5 years (November 2011 to October  2016) there have been no accidents or releases involving a RMP regulated chemical which qualified for notification under EPA's 40 CFR part 68 rule.\n\n\n\nIn conjunction with the current RMP and PSM programs in place at BASF's West Memphis facility, there is a standard management practice in place that requires immediate internal reporting of all unusual events, including those in which any abnormal emissions of regulated chemicals are observed or suspected. Supervisory staff review all incident information and determine whether a release has exceeded a reportable quantity including notification of authorities as appropriate.\n\n\n\n6.0)  Emergency Response Program \n\n\n\nIf an abnormal event were to occur which releases or has the potential to release a chemical quantity which could lead to an emergency condition, the site's Incident Commander (IC) will activate the Emergency Response Team (ERT) and notify the West Memphis Fire Department. The Emergency Response Plan (ERP) describes how specific events will be managed and the appropriate action to be taken by the Incident Commander and emergency responders. The West Memphis Fire Department is provided a copy of BASF's emergency response plan for review and comment. BASF encourages the West Memphis Fire Department and other Emergency Agencies to participate in an annual practice drill and routine site inspections to enable Emergency Responders to become more familiar with the facility and response capabilities. BASF is an active member of the Local Emergency Planning Commi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000060762,
      "SummaryText": "ttee (LEPC) and participates in the emergency response planning for Crittenden County, Arkansas.   \n\n\n\n7.0)  Planned Changes to Improve Safety\n\n\n\nThe BASF West Memphis facility, under the Process Safety Management (PSM) and Risk Management Planning (RMP) programs, has organized a management system to effectively identify and control hazards in the workplace and reduce potential risks. Planning aspects of process design, operating procedures, emergency preparedness, the operational elements of system maintenance, safe operating practices, and ongoing personnel training are an integral part of and considered necessary to support a continuous improvement in facility safety. Periodic reviews of the management systems and rigorous internal audits ensure continuing compliance. \n\n\n\nThe management system provides the required and necessary information about the safe handling of all chemicals present at the facility. This information is available to all employees and can be made readily available to emergency responders and the community. \n\n\n\nRisk Management Planning (RMP) and the integrated risk management program at BASF's West Memphis Site help to ensure operations that are safe today, and will be even safer tomorrow by providing methods to continue to identify and address potential risks to employees and the community.\n\n\n\n8.0)  Conclusion - RMP Data Elements\n\n\n\nEach facility covered by the RMP Rule must submit one Risk Management Plan (RMP) that covers all its RMP regulated processes. The plan is submitted electronically to the EPA and follows the format provided by the RMP Data Elements Guidance Document published by the EPA on June 20, 1996.  The BASF West Memphis Accident Prevention Program is adopted directly from OSHAA's PSM Standard compliance program which is consistent with EPA's Level 3 RMP Program requirements under 40 CFR part 68.  The RMP was filed electronically on June 21, 1999 and was resubmitted in June 2004, January 2006, April 2010, and September 2014. "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000060762,
      "SummaryText": "  \n\nThe 2016 submission includes\n\n\n\n?Changes in Emergency Coordinator, \n\n?Eliminating the following RMP chemicals to below TPQ limits:Dimethyl Amine, Methyl Chloride,and Toluene Diisocyanate. \n\n\n\n?The elimination of Dimethyl Amine removes the Worst Case Flammable, as there are no additional RMP Flammable Chemicals above the threshold. \n\n \n\n?The elimination of Methyl chloride as Worse case TOXIC replaced by Epichlorohydrin"
    }
  ]
}