{
  "FacilityID": 1000039709,
  "FacilityName": "Wlibur-Ellis Company (Sedgwick, KS)",
  "FacilityStr1": "9001 South West Road",
  "FacilityStr2": null,
  "FacilityCity": "Sedgwick",
  "FacilityState": "KS",
  "FacilityZipCode": "67135",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20079",
  "LEPC": "Harvey Couny LEPC",
  "FacilityLatDecDegs": "37.933863",
  "FacilityLongDecDegs": "-097.391275",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "http://ag.wilburellis.com/pages/Home.aspx",
  "FacilityEmailAddress": "CMatson@wilburellis.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Wilbur-Ellis Company LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Clint Matson",
  "OperatorStr1": "100 Wheatland Drive",
  "OperatorStr2": null,
  "OperatorCity": "Sedgwick",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67135",
  "OperatorZipCodeExt": null,
  "RMPContact": "Clint Matson",
  "RMPTitle": "Branch Manager",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000015173",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-04-30 00:00:00",
  "SafetyInspectionBy": "Kansas Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-02-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-03-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-03-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-03-08 00:00:00",
  "DeRegistrationEffectiveDate": "2019-09-01 00:00:00",
  "AnniversaryDate": "2019-03-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.93393,
  "FRS_Long": -97.39025,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000048861,
      "AltID": "Storage and Transfer",
      "FacilityID": 1000039709,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000049298,
          "ProcessID": 1000048861,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059280,
          "ProcessID": 1000048861,
          "ChemicalID": 56,
          "Quantity": 280000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000559280,
          "ProcessID": 1000048861,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039709,
      "SummaryText": "The Plan describes procedures implemented by Wilbur-Ellis Company, Agribusiness Division (\"Wilbur-Ellis\") to prevent accidental releases of ammonia that could cause harm to the public and the environment from short-term exposures.  The Plan includes an analysis of the potential offsite consequences of an accidental release, a five-year accident history, and a release prevention and emergency response program.  \n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nWilbur-Ellis has implemented release prevention and emergency response procedures to minimize the potential for accidental releases of hazardous materials.  Emergency response procedures including evacuation procedures and notification procedures have been implemented by Wilbur-Ellis.  In addition, Wilbur-Ellis has developed operating procedures and preventative maintenance activities to reduce the likelihood of accidental releases.\n\n\n\nThis Plan and the emergency response procedures document the accidental release prevention, safety, and emergency policies in place at Wilbur-Ellis.\n\n\n\nDescription of Stationary Source and Regulated Substances\n\n\n\nWilbur-Ellis is located at 9001 South West Road in Sedgwick, Kansas (the \"facility\").  Wilbur-Ellis is a retailer of fertilizer in the form of anhydrous ammonia stored under pressure.  There is one anhydrous ammonia storage tank located at the facility with a capacity of approximately 30,000 gallons.  The anhydrous ammonia is transferred from the storage tank into nurse tanks owned by Wilbur-Ellis and operated by local farmers for the application of ammonia fertilizer to the farmers' fields.  A maximum of 29 nurse tanks (1,000 gallons each) may be stored at the facility at a given time.  The contents of the storage tank are sold to the local farming community for use as fertilizer.  \n\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n  \n\nWilbur-Ellis has developed and implemented this Plan with the objective of com"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039709,
      "SummaryText": "plying with the requirements and guidelines set forth by the Federal Risk Management Plan program.  The Plan's purpose is to enhance the facility's existing safety programs implemented at the site to reduce the possibility of accidental releases of anhydrous ammonia that could cause harm to employees, the public and the environment.  The emergency response program, documented in the emergency response procedures, includes accidental release prevention and chemical specific prevention steps.\n\n\n\nWilbur-Ellis ensures that equipment meets the appropriate industry standards prior to use.  Wilbur-Ellis implements operating procedures and maintenance procedures in accordance with manufacturer and industry specifications to prevent accidental releases at the facility.  Chemical specific release prevention steps implemented at the site include the use of excess flow valves, pressure relief valves, emergency shut off valves with cables that run along the length of the horizontal storage tank for quick access, and ammonia training for personnel.\n\n \n\nFive-Year Accident History\n\n\n\nThere have been no qualifying accidents involving ammonia in the five-year period prior to the completion of this Plan.\n\n\n\nEmergency Response Program\n\n\n\nThe facility coordinates with the Sedgwick Country Fire Department (\"fire department\") regarding specific actions to be taken in response to an accidental release of anhydrous ammonia.  The facility has established emergency evacuation procedures to evacuate the site and notify the appropriate agencies regarding a release.  The facility's emergency response program is documented in the facility's Emergency Response Procedures.  The emergency procedures contain the following key elements:\n\n\n\n1.    Procedures for informing local agencies responsible for responding to accidental releases.\n\n2.    Information on emergency health care.\n\n3.    Emergency response training for employees.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nPlans to improve safety at the facility wer"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039709,
      "SummaryText": "e developed based on the results of compliance audits, hazard reviews, and a Risk Management Plan (RMP) site inspection conducted by an outside contractor.  The Branch Manger is currently working on an implementation schedule for the recommended actions.  Recommended actions include the following:\n\n\n\n1.    Evaluate potential to place concrete barriers further away from the storage tanks to further reduce potential for impact with anhydrous ammonia storage tank from vehicle collisions. \n\n2.    Install bulkheads for the load-in and load-out valves.\n\n3.    Evaluate potential installation of a fenced perimeter for added security.\n\n4.    Treat the rusted surfaces of the piping and associated equipment handling anhydrous ammonia vapor and liquid by applying approved coating.\n\n5.    Install a wind sock in a prominent location for emergency response and evacuation. \n\n6.    Modify the existing storage tank saddles to extend to 1/3 of the circumference of the ammonia storage tank and secure the tank to the saddles.\n\n7.    Ensure all valves are properly labeled or color-coded.\n\n8.    Ensure that signage displaying emergency contact information is visible at the entrance of the facility.\n\n9.    Replace the pipe supports on the ammonia system with approved supports.\n\n10.    Evaluate potential to install catholically protected underground piping.\n\n11.    Compile and maintain a completed approved anhydrous ammonia system equipment list with specifications onsite."
    }
  ]
}