{
  "FacilityID": 1000001635,
  "FacilityName": "Birds Eye Foods - Fulton, NY",
  "FacilityStr1": "607 Phillips Street",
  "FacilityStr2": null,
  "FacilityCity": "Fulton",
  "FacilityState": "NY",
  "FacilityZipCode": "13069",
  "Facility4DigitZipExt": "1520",
  "FacilityCountyFIPS": "36075",
  "LEPC": "Oswego County LEPC",
  "FacilityLatDecDegs": "43.317222",
  "FacilityLongDecDegs": "-076.427778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2212611,
  "ParentCompanyName": "Birds Eye Foods",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Daryl Pike",
  "OperatorStr1": "607 Phillips Street",
  "OperatorStr2": null,
  "OperatorCity": "Fulton",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13069",
  "OperatorZipCodeExt": null,
  "RMPContact": "Raymond Hauser",
  "RMPTitle": "Facility Manager",
  "FTE": 288,
  "OtherEPAFacilityID": "13069GNRLF607PH",
  "EPAFacilityID": "100000048209",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-06-04 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-01-30 00:00:00",
  "DeRegistrationEffectiveDate": "2013-01-10 00:00:00",
  "AnniversaryDate": "2014-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.31883,
  "FRS_Long": -76.4272,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002155,
      "AltID": null,
      "FacilityID": 1000001635,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000006075,
          "ProcessID": 1000002155,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002361,
          "ProcessID": 1000002155,
          "ChemicalID": 56,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000502361,
          "ProcessID": 1000002155,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001635,
      "SummaryText": "Birds Eye Foods\nFulton, NY Plant\n\nBirds Eye Foods and the Fulton facility recognize that the use of anhydrous ammonia in the plant operations carries an inherent responsibility in its safe handling and the safety and well-being of our associates, our community and the environment.\n\nBirds Eye - Fulton is committed to and supports all appropriate compliance regulations, OSHA's Process Safety Management Standard and the EPA's Risk Management Program as well as ongoing improvement in engineering, processes, alarms, training of all affected and authorized associates, and response methods to best enable the facility to safely utilize anhydrous ammonia.\n\nThe factory manager and staff, as direct participants in employee safety and in their communities, take active and aggressive interest in safe handling, operation, proper containment and emergency preparations should problems arise with this hazardous chemical.\n\nTools to effect this safeguarding and preparedness involve employee awareness training and operator training, as well as various levels of response training.  Engineering and technical upgrades and improvements also impact sound and reliable systems.  Censors, alarm systems, and varying levels of human monitoring provide ongoing prevention and early detection.  Internal/ external audits, inspections and record keeping are active systems for evaluation - revealing gaps and determining areas for improvement.\n\nEmergency action plans, hazard communications, and emergency evacuation programs address awareness, alarms and the safe response of employees to potential leaks.  Evacuation drills, emergency response training, response drills and involvement with the Fulton Fire Department, the Oswego County Hazardous Materials team, and other outside agencies,  furthers our ability to respond and effectively contain and mitigate potential releases.\n\n\nThe Birds Eye Foods plant in Fulton, NY is a fresh/frozen vegetable packaging facility linked to a large cold storage warehouse "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001635,
      "SummaryText": "for shipping and receiving materials.  The plant receives vegetables that have been previously frozen at another another facility and package them into retail sizes and prepare them to be shipped to markets across the United States.  Several of the products produced  require sauces or other ingredients, such as pasta or bean sprouts, to be added.  These items are made and flash frozen at this facility.  \n\nRefrigeration is required to maintain a high quality product during the process and packaging operations.  Anhydrous ammonia is used at quantities above the reporting quantity of 10,000 pounds.  Anhydrous ammonia is used as the refrigerant of choice for several reasons:  It is economical and efficient to use, and it provides low operating temperatures that are needed for rapid freezing of the product.  Also located at this site is a 100,000 square foot 0 degree cold storage warehouse and shipping facility.  The warehouse is also cooled through the use of anhydrous ammonia.   \n\nSafety programs and procedures have been developed to decrease the amount of hazardous chemicals being used at the plant in an effort to reduce the risk of possible releases to the environment.  Compliance to environmental responsibilities is achieved by the assignment of responsibilities to the plant management staff.\n\n\nThe Birds Eye - Fulton facility is subject to and and complies with the OSHA Process Safety Management (PSM) program.  As such, the plant resides within the Prevention Program for Program 3 Processes of the Risk Management Program (RMP).\n\nEach of the PSM components are followed and used toward safeguarding and prevention.  Levels and releases of all types are documented and evaluated for future prevention.  When practicable, engineering enhancements are made as equipment is restored or new equipment is put in place. \n\n\nIn the event an ammonia event occurs, the factory's first response team is activated.  The team is made of up of 10 facility associates, 9 of whom are trained "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001635,
      "SummaryText": "as level A emergency responders.  The Team trains annually with the Fulton Fire Department, and the most recent drill took place on May 17, 2009. The Fulton Fire Department would notify the Oswego County Hazardous Materials Team for any situations requiring further assistance."
    }
  ]
}