{
  "FacilityID": 1000037922,
  "FacilityName": "Dollarhide Gas Plant",
  "FacilityStr1": "35 miles s.w. of Andrews, Texas",
  "FacilityStr2": "State Hwy 128",
  "FacilityCity": "Andrews",
  "FacilityState": "TX",
  "FacilityZipCode": "79714",
  "Facility4DigitZipExt": "0029",
  "FacilityCountyFIPS": "48003",
  "LEPC": "Andrews County LEPC",
  "FacilityLatDecDegs": "32.146944",
  "FacilityLongDecDegs": "-103.056667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 877634014,
  "ParentCompanyName": "Chevron MidContinenet L.P.",
  "Company2Name": null,
  "CompanyDUNS": 1345164,
  "Company2DUNS": 1345164,
  "OperatorName": "Chevron MidContinenet L.P.",
  "OperatorStr1": "15 Smith Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Midland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79705",
  "OperatorZipCodeExt": null,
  "RMPContact": "Andrew Olson",
  "RMPTitle": "Gas Plants Superintendent",
  "FTE": 26,
  "OtherEPAFacilityID": "TXD980747588",
  "EPAFacilityID": "100000087498",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00841",
  "SafetyInspectionDate": "2013-11-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-11-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-12-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-12-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-12-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.14667,
  "FRS_Long": -103.05722,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000046533,
      "AltID": "Natural Gas Liquid Extrac",
      "FacilityID": 1000037922,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000046958,
          "ProcessID": 1000046533,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000056478,
          "ProcessID": 1000046533,
          "ChemicalID": 155,
          "Quantity": 681873.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000048670,
              "ProcessChemicalID": 1000056478,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000048671,
              "ProcessChemicalID": 1000056478,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000048672,
              "ProcessChemicalID": 1000056478,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000048673,
              "ProcessChemicalID": 1000056478,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000048674,
              "ProcessChemicalID": 1000056478,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000048675,
              "ProcessChemicalID": 1000056478,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000048676,
              "ProcessChemicalID": 1000056478,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000056479,
          "ProcessID": 1000046533,
          "ChemicalID": 98,
          "Quantity": 55039.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000556478,
          "ProcessID": 1000046533,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000556479,
          "ProcessID": 1000046533,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000037922,
      "SummaryText": "Dollarhide Gas Plant Risk Management Plan:\n\nExecutive Summary\n\n\n\nChevron is committed to excellence in our operations. We will provide a safe and productive workplace for our employees, conduct our operations in an environmentally responsible manner, comply with applicable laws and regulations and improve the communities where we live and work. We recognize that operating excellence does not just happen, and that we need to have management tools in place to organize and sustain the effort. \n\nAchieving excellence in our operations is the responsibility of every employee.  Operations line management must ensure the development and implementation of procedures which guide employee actions as appropriate.\n\n\n\nAccidental Release Prevention and Response Policies\n\nThe Dollarhide Gas Plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, personnel training, engineering controls in the design, installation, operation, and maintenance of our process.  Our policy is to implement reasonable controls to prevent accidental and uncontrolled releases of regulated substances.\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\nThe Dollarhide Gas Plant is located in Andrews County, Texas 35 miles southwest of Andrews.  The plants dehydration and cryogenic operational process a dry residue gas from accumulated casing head gas production.   The Dollarhide Gas Plant does not use and/or process any regulated toxic substances above threshold quantities.\n\n\n\nOffsite Consequence Analysis Results (based on Van plant example)\n\n       The worst case scenario (WCS) associated with the release of flammable substances in the Program Level 1 process at the gas plant is a vapor cloud explosion (VCE) involving the maximum intended inventory of the largest storage tank containing NGL flammable mixture. The maximum distance to the 1-psi endpoint for this WCS is 0.44 mile, resulting in no offsite i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000037922,
      "SummaryText": "mpact and impact only to the Dollarhide field property outside the gas plant fence line but with no public access.\n\n       The alternative release scenario (ARS) for flammable substances at the gas plant is a vapor cloud explosion involving the maximum intended inventory of the propane refrigerant storage tank, which constitutes the largest inventory of refrigerant grade propane onsite. The maximum distance to the 1-psi endpoint for this ACS is 0.29 mile, resulting in no offsite impact and impact only to the Dollarhide field property outside the gas plant fence line but with no public access.\n\n            \n\nGeneral Accidental Release Prevention Program\n\nProgram Level 1 processes do not require an accident prevention program. The Dollarhide Gas Plant has implemented an accident prevention program to satisfy the Occupational Safety and Health AdministrationA?s (OSHA) Process Safety Management (PSM) standard.  PSM requirements are consistent with the regulations outlined in the Environmental Protection AgencyA?s (EPA) Risk Management Program (RMP).\n\n\n\nThe following is a summary of the accident prevention program in place at the Dollarhide Plant.\n\n\n\nEmployee Participation\n\nThe Dollarhide Gas Plant encourages employees to participate in all facets of PSM and accident prevention.  Employees participate in review, compilation and updating technical documents and chemical inventories.  Employees participate as Process Hazard Analysis (PHA) team members.\n\n\n\nEmployees have access to all information created as part of the gas plant accident prevention program. In addition, the gas plant has a number of initiatives that address process safety and employee safety issues. These initiatives include monthly safety meeting, planned inspections and operation improvement meetings which include affected plant personnel and management.   \n\n\n\nProcess Safety Information (PSI)\n\nThe Dollarhide Gas Plant keeps a variety of technical documents that are used to help maintain safe operation of the proce"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000037922,
      "SummaryText": "ss. These documents address chemical properties   and associated hazards, limits for key process parameters, specific chemical inventories, and equipment design criteria.  Chemical specific information, including exposure hazards, emergency response, PPE requirements and exposure treatment considerations are provided in material safety data sheets (MSDS) as part of the HAZCOM program.\n\n\n\nTechnical documents providing design and construction information of process equipment are maintained on site. This information includes construction materials, design limits, and electrical rating of equipment. The combination of appropriately trained personnel, written procedures and PSI data provides the basis for establishing inspection and maintenance intervals and procedures. Proposed design or process modifications are reviewed through the Management of Change (MOC) process to ensure that safety features and material of construction in the process are not compromised. \n\n\n\n \n\nProcess Hazard Analysis (PHA)\n\nThe Dollarhide Gas Plant has a comprehensive program to ensure that hazards associated with the process are identified and controlled.  This program systematically examines the process to identify hazards and ensure adequate controls are in place to manage the identified hazards.\n\n\n\nThe Dollarhide Gas Plant personnel use various PHA processes including the Hazard and Operability (HAZOP) analysis and Check List techniques to perform these evaluations. The analyses are conducted using a team of personnel who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates process hazards as well as accident prevention and mitigation measures.  Approved mitigation options in response to PHA team findings are initiated and tracked until completion. The final resolution of each finding is documented and retained.\n\n\n\nReviews are conducted at least  every  five years  and  will  be conducted at  this  frequency until  the  process  is n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000037922,
      "SummaryText": "o longer  operating.  The results and findings from these updates are documented and retained. The team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\n\n\n\nOperating Procedures\n\nThe Dollarhide Gas Plant maintains written procedures that address various modes of process operations. These procedures are used as operating references by operations personnel and serve as training procedures for new operators. These procedures are periodically reviewed and annually certified as current and accurate. The procedures are kept current and accurate by revising them as necessary to reflect changes made through the MOC process. In addition, the Dollarhide Gas Plant maintains a Key Process Parameter in the DCS System that provides alarm notification for excess process control deviations. This information, along with written operating procedures is readily available to operators in the process unit and for other personnel to use as necessary to safely perform their job tasks.\n\n \n\nTraining\n\nComplemented by the written procedures the Dollarhide Gas Plant personnel maintain job proficiency through mentoring and training opportunities. New employees are initiated to the process operations through their involvement in the maintenance responsibilities.  Once operations fundamentals are established, the new employees are mentored by a senior plant operator or the plant Operations Supervisor.  Process operating responsibilities are transferred to the new employee after observations indicate the new employee exhibits sufficient proficiency in the process operations. All operators  periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 years. \n\n\n\n\n\n \n\nContractors\n\nThe Dollarhide Gas Plant uses contractors to supplement its work force during periods of increased maintenan"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000037922,
      "SummaryText": "ce or construction activities. Because some contractors work on or near process equipment, the gas plant has procedures in place to ensure that contractors:\n\n\n\n1.    Participate in Contractor / Visitor Orientation   \n\n2.    Perform their work in a safe manner\n\n3.    Have appropriate knowledge and skills\n\n4.    Aware of the hazards in their workplace\n\n5.    Understand what they should do in the event of an emergency\n\n6.    Understand and follow site safety rules\n\n7.    Inform gas plant personnel of any hazards that they find during their work. \n\n\n\nDollarhide Gas Plant evaluates contractor safety programs and performance during the selection of a contractor. Gas plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety and performance obligations. \n\n\n\nPre-startup Safety Reviews (PSSR)\n\nThe Dollarhide Gas Plant conducts a PSSR for any new facility or facility modification   that requires a    change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides a final check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready. The PSSR review uses checklists to verify all aspects of readiness.  A PSSR involves verification of the construction and serves a quality assurance function by requiring verification that prevention requirements are properly implemented.\n\n\n\nMechanical Integrity\n\nThe  Dollarhide  Gas  Plant has  well-established practices and  procedures to maintain  pressure vessels,  piping systems, pressure relief, vent systems, operating controls, pumps, compressors,  and  emergency shutdown  systems  in a safe operating  condition. The basic aspects of this include:\n\n \n\n1.    Conducting training\n\n2.    Following manufactures written procedures\n\n3.    Performing inspections and tests\n\n4.    "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000037922,
      "SummaryText": "Correcting identified deficiencies\n\n\n\nThese activities form a system that maintains the mechanical integrity of the process. Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels). Application of various elements of Chevron Operating Management System (OE) program ensures mechanical integrity is maintained on existing and new installations.\n\n\n\nSafe Work Practices\n\nThe Dollarhide Gas Plant has long-standing safe work practices and procedures in place to ensure worker and process safety.  Through compliance with Chevron Dollarhide established policy and procedures and adherence to appropriate OSHA regulations the safe work compliance standards of PSM / RMP are met. \n\n\n\nManagement of Change\n\nThe Management of Change (MOC) process is used to identify, evaluate, and control hazards in the workplace that may be introduced because of change.  The process establishes the minimum procedures necessary to provide for the safety of personnel and facilities due to these changes or modifications.  The MOC process applies to all work done by Chevron employees or contractors.  Changes to equipment or operations which are not replaced A?in kindA? require appropriate review and approval prior to implementation.  This review is necessary to ensure the safety of personnel and the integrity of the facilities.  The established procedure should communicate changes or modifications to effected employees or contractors.\n\n\n\nIncident Investigation\n\nChevron is committed to investigating all incidents regardless of severity to prevent recurrence and ensure employee safety.  Incidents are defined as undesired events that resulted in harm to people, damage to the environment, damage to the property, or loss to process and/or the environment.  These include but are not limited to personal injuries, unplanned product releases, equipment malfunction, spills, "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000037922,
      "SummaryText": "fires, etc.  Near-misses are defined as undesired events which, under slightly different circumstances, could have resulted in harm to people, significant damage to property, or loss to process and/or the environment. Employees and contractors are required to report all incidents regardless of their severity immediately to their supervisor or as soon as feasibly possible but no later than the end of the work shift in which the incident occurred. \n\n\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, the Dollarhide Gas Plant periodically conducts an audit to determine whether the established policies, procedures and practices are implemented, followed and adequate. Compliance audits are conducted at least every 3 years. Personnel from other facilities who are knowledgeable in the audit process participate as audit team members. The audit team develops findings that are forwarded to gas plant management for resolution. \n\n\n\nGeneral Accidental Release Prevention and Chemical Specific Prevention Steps\n\nPreviously mention programs, policies and procedures outlines the primary emphasis of Chevron procedural and administrative measures to prevent accidental hazardous releases at the Dollarhide Plant.\n\n\n\nSite specific equipment and technology utilized for prevention of accidental releases of regulated substances and provide warning and protection to affected personnel in the facility include:\n\nA?    Centralized monitoring and control system with remote access capability.   \n\nA?    Critical Process Safety Valves that discharge to a closed flare to capture and incinerate episodic releases or atmospheric release as appropriate. \n\nA?    Isolation Valves to isolate and control releases as appropriate (manual and automated)\n\nA?    Automated shutdown systems for critical process deviations.\n\nA?    Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system, backup).\n\nA?    Personal protective equipment (e.g., FR "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000037922,
      "SummaryText": "protective clothing, safety glasses, splash proof goggles, Nitril disposable gloves, self-contained breathing apparatus )\n\nA?    Personal H2S Monitors\n\nA?    Fixed H2S Monitors\n\n\n\nFive Year Accident History\n\nThe Dollarhide Gas Plant has had no regulated release events that resulted in onsite or offsite response or effect.\n\n\n\nEmergency Response Program Information\n\nThe  Dollarhide  Gas  Plant maintains  a  written emergency response program, which is in  place  to protect  worker and public safety as well  as  the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all  aspects  of emergency response, including proper first aid and medical treatment for exposures, evacuation  plans and  accounting for personnel after an evacuation, notification of local emergency response  agencies and  the  public  if a release occurs,  and  post incident cleanup requirements. In addition, the plant has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties. The emergency response program is updated when necessary based on modifications made to the gas plant process or other Dollarhide Gas Plant facilities.\n\nThe overall emergency response program for the Dollarhide Gas Plant is coordinated with the local Emergency Agencies located in the adjacent communities.\n\n\n\nThis coordination includes periodic updates to the local emergency response officials, and industry Representatives.  The Dollarhide Gas Plant has around-the-clock communications capability with appropriate officials and emergency response organizations. This provides a means of notifying the public of an incident, if necessary, as we"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000037922,
      "SummaryText": "ll as facilitating quick response to an incident. The Dollarhide Gas Plant conducts a table top or physical emergency drill on an Annual basis.\n\n\n\nPlanned Changes to Improve Safety\n\nThe primary vehicle for the continued development of a comprehensive safety program at the Dollarhide Plant is the implementation of the Chevron OE program.  Under the direction of the OE program, where applicable new technology, equipment and practices will be utilized to eliminate, control or mitigate site specific risk exposures to affected personnel, the public and the environment.\n\n"
    }
  ]
}