{
  "FacilityID": 1000081347,
  "FacilityName": "City of Idaho Falls Water Pollution Control Plant",
  "FacilityStr1": "4055 Koester Road",
  "FacilityStr2": null,
  "FacilityCity": "Idaho Falls",
  "FacilityState": "ID",
  "FacilityZipCode": "83402",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16019",
  "LEPC": "Bonneville County LEPC",
  "FacilityLatDecDegs": "43.462778",
  "FacilityLongDecDegs": "-112.068889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "1917 S. 67th Street",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Idaho Falls",
  "OperatorStr1": "4055 Koester Road",
  "OperatorStr2": null,
  "OperatorCity": "Idaho Falls",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83402",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000102435",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-07-24 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-08-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-08-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-08-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-08-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 43.46191,
  "FRS_Long": -112.069881,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101665,
      "AltID": "Chlorine Process",
      "FacilityID": 1000081347,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127415,
          "ProcessID": 1000101665,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000102926,
          "ProcessID": 1000101665,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000063075,
              "Process_NAICS_ID": 1000102926,
              "SafetyReviewDate": "2024-06-06 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2024-06-06 00:00:00",
              "ChangeCompletionDate": "2024-10-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Sabatoge and terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "automatic scrubber",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-06-18 00:00:00",
              "TrainingReviewDate": "2024-06-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-06-06 00:00:00",
              "EquipmentInspectionDate": "2024-06-18 00:00:00",
              "EquipmentTested": "chlorine detectors",
              "ComplianceAuditDate": "2024-06-06 00:00:00",
              "AuditCompletionDate": "2025-01-01 00:00:00",
              "IncidentInvestigationDate": "2024-06-06 00:00:00",
              "InvestigationChangeDate": "2024-10-01 00:00:00",
              "MostRecentChangeDate": "2024-06-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000063843,
                  "PreventionProgram2ID": 1000063075,
                  "ProcessChemicalID": 1000127415
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000081347,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-06-06 00:00:00",
    "ERTrainingDate": "2024-06-06 00:00:00",
    "CoordinatingAgencyName": "Idaho Falls Fire Department",
    "CoordinatingAgencyPhone": "2086128495",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081347,
      "SummaryText": "PROCESS BACKGROUND\nThe Idaho Falls WWTP uses compressed gaseous chlorine to disinfect an average of 9.5 million gallons per day of wastewater prior to its discharge to the Snake River or reclamation for agricultural use. All chlorine is stored in one-ton containers in the Tank Room with a maximum inventory of 12 one-ton containers, or 24,000 pounds, which exceeds EPA\u0092s 2,500 pound regulatory thresholds and OSHA\u0092s 1,500 pound regulatory threshold.\n?\nAPPROACH\nHDR\u0092s objective was to evaluate the RMP procedures, documentation, and practices being used at the WWTP and determine if they are being effectively implemented per the regulations.  The audit included a review of the facility\u0092s management system and a review of each RMP program element (files/sections).  EPA\u0092s 40 CFR Part 68 \u0096 Chemical Accident Prevention Provisions audit checklist was used as the audit guide (May 18, 2021).  To better assess employee awareness of the safety procedures, program rules and emergency assignments, two persons whose job duties involved the chlorination system were interviewed: Chris Briggs, a Process Operator with 10 years\u0092 experience in the role (23 at the plant) and Gatlan Waters, a Maintenance Worker with 4 months experience in the role (6 years at the plant). \nAs a record of the event, HDR prepared this report to present the audit findings and observations, and associated recommendations.  City personnel participating in the audit were: Frank Rogers, Maison Durfee, Chris Briggs, Rolando Garcia, Mike Iraola, Gatlan Waters, Tony Raffetto, Shane Adams, Tatum Barnes, Mike Nash, and Mike Henricksen.\nThe audit (interviews, site visit and walk through, document review) was performed on June 6, 2024.\n\nFINDINGS/RECOMMENDATIONS\nPrior to the audit findings and recommendations, a brief synopsis of the element requirement has been provided.\n\n1.0 Management System {40 CFR 68.15}\nThe owner or operator of a stationary source with processes subject to Program 2 or Program 3 shall develop a managem"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081347,
      "SummaryText": "ent system to oversee the implementation of the risk management program elements.\nFindings\n\u0095\tThe PSM Manual complies with this requirement. The PSM Manual currently includes the title of the responsible position and provides names for each position in the Emergency Action Plan and other locations. \nRecommendations\n\u0095\tVerify the organization chart and responsible positions provided as an attachment to the PSM Manual. \n\u0095\tTransition to electronic file storage for RMP documents.\n\n2.0 Hazard Assessment {40 CFR 68 Subpart B} / Risk Management Plan {40 CFR 68}\nThe owner or operator of a stationary source with a chemical amount greater than a threshold quantity shall prepare worst-case and alternate-case release scenarios and a five-year accident history.  Re-submit a Risk Management Plan to EPA every five years.\nFindings\n\u0095\tThe facility conducted an off-site consequence analysis and reported this information to EPA in the 2019 RMP ESubmit. \n\u0095\tThe facility has had one accident over the past five-year period. Documentation for the incident and incident closure was provided. The accident was within the chlorine building but was not a chlorine related incident. \nRecommendations\n\u0095\tContact neighboring facilities and businesses about potential releases of chlorine and emergency response by contacting the Local Emergency Planning Committee (LEPC). \n\n3.0 Process Safety Information (PSI) {40 CFR 68.65 \u0096 29 CFR 1910.119(d)}\nMaintain complete and accurate information on the process technology, process equipment, hazardous characteristics, and physical properties of the regulated chemical.\nFindings\n\u0095\tThe Process Safety Information section of the document which provides a written description of the chemical characteristics, the process technology and the process equipment is adequate.  \nRecommendations\n\u0095\tNone\n\n4.0 Process Hazard Analysis (PHA) {40 CFR 68.67 \u0096 29 CFR 1910.119(e)}\nIdentify and assess process hazards for the regulated process and take action to manage risk.  The process haza"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081347,
      "SummaryText": "rd analyses must be updated at least every five years and retained for the life of the process.\nFindings\n\u0095\tMultiple PHA reports from 2014 and 2019 were in the folder and the more recent documents appear to be complete.\n\u0095\tThe following action items generated during the 2019 PHA were not complete: chlorine signage was not updated, personnel and identification sheets were not provided, and the ammonia check standard was added within the building, but not at the man-hatch.\nRecommendations\n\u0095\tComplete 2019 action items from 2019 PHA (chlorine signage was not updated, personnel and identification sheets were not provided, and the ammonia check standard was added within the building, but not at the man-hatch).\n\n5.0 Standard Operating Procedures {40 CFR 68.69 \u0096 29 CFR 1910.119(f)}\nWritten Standard Operating Procedures (SOPs) must provide clear instructions for safely conducting activities involving the regulated process and must also be consistent with the PSI.  The OPs must include steps for each operating phase, operating limits, safety and health considerations and safety systems and their functions.  SOPs must also be available to implement safe work practices to provide for special circumstances such as lockout/tagout, confined space entry, and line break.\nFindings\n\u0095\tDirections and procedures regarding safety and health considerations and exposure control measures were provided in the latest version of the SOPs.  \n\u0095\tAn updated Chlorine Tank Changing Procedure was provided on June 18, 2024. \nRecommendations\n\u0095\tUpdate annually and make review readily available online.\n\u0095\tComplete annual chlorine and SOP/EAP updates with employees.\n\u0095\tVerify personnel have been trained on the new Chlorine Tank Changing Procedure and place documentation within the training records. \n\n6.0 Training {40 CFR 68.71 \u0096 29 CFR 1910.119(g)}\nEmployees involved with operation of the regulated process must be provided process overview and standard operating procedure training.  Training must also emphasiz"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081347,
      "SummaryText": "e specific safety and health hazards, emergency operations, and safe work practices.  Documented refresher training is required at least every three years.\nFindings\n\u0095\tTraining records are present in the files and are available as hardcopies/scans or in the Thatcher training system. \n\u0095\tThe training system sends training requirement updates to personnel and managers. \n\u0095\tSome personnel are concerned about use of a B-kit for a chlorine release. \nRecommendations\n\u0095\tVendor training done onsite annually. Include the sign-in-sheets in training records.\n\u0095\tComplete B-Kit training and provide documentation within the training records. \n\n7.0 Mechanical Integrity {40 CFR 68.73 \u0096 29 CFR 1910.119(j)}\nA mechanical integrity program must include identifying and categorizing equipment and instrumentation, inspections and tests and their frequency; maintenance procedures; training of maintenance personnel; criteria for acceptable test results; documentation of test and inspection results; and documentation of manufacturer recommendations for equipment and instrumentation.\nFindings\n\u0095\tThe Preventative Maintenance program at WPCF addresses the elements of maintenance, inspection, cleaning, replacement and testing in the work order database.\n\u0095\tStock of maintenance supplies is available, and most items have enough supplies for redundancy. \n\u0095\tChlorine related maintenance is provided within a logbook within the Maintenance Supervisors office. \nRecommendations\n\u0095\tThe PSM manual should have a list of critical equipment and supplies that is made using the last year\u0092s data. \n\u0095\tDocumentation and records on maintenance training should be kept along with the computer work orders in the Maintenance Supervisors office.  \n\u0095\tVerify the work orders are maintained in the electronic folders. \n\n8.0 Management of Change (MOC) {40 CFR 68.75 \u0096 29 CFR 1910.119(l)}\nEstablish written procedures to manage changes and inform and train affected employees on the changes prior to start-up.\nFindings\n\u0095\tThe PSM Manual doc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081347,
      "SummaryText": "uments the MOC process.  \n\u0095\tThe MOC indicates who or how the Process Safety Information will be reviewed for revision resulting from a facility change.\n\u0095\tMOC changes are posted, and photo documented for staff review. \n\u0095\tMOC was last updated in 2015.\nRecommendations\n\u0095\tThe forms for documentation should be present in electronic folders the next time a MOC is conducted.\n\n9.0 Pre-Startup Safety Review {40 CFR 68.77 \u0096 29 CFR 1910.119(i)}\nA safety review for new and significantly modified work sites to confirm that the construction and equipment of a process are in accordance with design specifications; to assure that adequate safety, operating, maintenance and emergency procedures are in place; and to assure process operator training has been completed. \nFindings\n\u0095\tThe Pre-Startup Safety Review (PSSR) process is spelled out in the procedure manual from 2015. \nRecommendations\n\u0095\tThe forms for documentation should be present in electronic folders the next time a PSSR is conducted.\n\n10.0 Program Audits {40 CFR 68.79 \u0096 29 CFR 1910.119(o)}\nEvaluate compliance with process safety requirements at least every three years.  \nFindings\n\u0095\tDocumentation was available concerning follow-up to the action items or recommendations identified in the 2019 and the work completed to bring them to closure. \nRecommendations\n\u0095\tVerify electronic folders are updated after 2019 and 2024 action items are completed.\n\n11.0 Incident Investigation {40 CFR 68.81 \u0096 29 CFR 1910.119(m)}\nInvestigate as soon as possible (but no later than 48 hours after) incidents which did result or could have resulted in catastrophic release of regulated chemicals. \nFindings\n\u0095\tOne incident occurred January 1, 2022, when a leak in the vacuum regulator occurred, however, no chlorine was released. The incident was investigated, and it was found that there was an equipment failure in the regulator system. \n\u0095\tThe incident report and follow-up training of personnel were properly completed and filed electronically. \nRecommendations"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000081347,
      "SummaryText": "\u0095\tContinue training personnel on the SOPs and involve staff with their preparation and revision.  \n\u0095\tNotify personnel of incidents after their occurrence and hold open discussions for staff post incident.\n\n12.0 Employee Participation {40 CFR 68.83 \u0096 29 CFR 1910.119(c)}\nDevelop a written plan of action regarding employee participation; consulting with employees and their representatives on the conduct and development of process hazard analyses and on the development of other elements of process safety management required under the rule; providing to employees and their representatives access to process hazard analyses and to all other information required to be developed under the rule.  \nFindings\n\u0095\tWWTP provides a written plan to include employees in the process safety program and based upon the interviews has included staff members in the PHA and other facility planning. \n\u0095\tEmployee interviews were conducted with maintenance and operations personnel. \nRecommendations\n\u0095\tVerify Emergency Action Plan (EAP), SDS and PM Manual are current, or removed from circulation. \n\u0095\tDocument training with Fire Department personnel. \n\u0095\tDocument EAP training within the training folder. \n\n13.0 Hot Work Permit {40 CFR 68.85 \u0096 29 CFR 1910.119(k)}\nHot work permits must be issued for hot work operations conducted on or near the regulated process.\nFindings\n\u0095\tThere is a written plan for hot work in the proximity of the regulated process in the PSM Manual.\nRecommendations\n\u0095\tCoordinate the PSM Manual\u0092s approach and language with other City procedures that are established for Contractors regarding hot work plan reviews and permit issuance.  \n\u0095\tEmployees should take hot work training course.\n\u0095\tEstablish a \u0093no fire zone\u0094 for contractors working onsite to prevent fire and flammable material accidents.\n\n14.0 Contractors {40 CFR 68.87 \u0096 29 CFR 1910.119(h)}\nContract employees involved in maintenance, repair, turnaround, major renovation or specialty work, on or near covered processes are required t"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000081347,
      "SummaryText": "o have training to safely perform their jobs, and document that they have received and understood training, and assure that they know about potential process hazards and the work site employer's emergency action plan and assure that employees follow safety rules of the facility.\nFindings\n\u0095\tContractor\u0092s safety performance is evaluated by the City of Idaho Falls contracting personnel.  \n\u0095\tConstruction administrators oversee project work and have stop work authority.\nRecommendations\n\u0095\tWork with City Administration and the Resident Project Representatives to find out if and how contractor oversight is being done.  Once the workflow is determined, decide how to best capture and document contractor management and oversight especially with reference to their evaluation pertaining to safety, information exchange (orientation), and City inspection.  Revise the PSM Manual section to reflect how the City works with and monitors its contractors.  \n\u0095\tContractors should take chlorine-specific training, the Chlorine Institute Guidance is suggested.\n\n15.0 Emergency Planning and Response {40 CFR 68.90 \u0096 29 CFR 1910.119(n)}\nDevelop and implement an emergency action plan. The emergency action plan must include procedures for handling small releases.\nFindings\n\u0095\tThe Emergency Action Plan (EAP) for incidents involving chlorine such as an incidental release, a significant release, an uncontrolled release and when the employees will contact the local community emergency response organizations is in good order.\n\u0095\tHold chlorine release drills to identify method of mass communication and locations of sirens that will start in event of fire or chlorine release.\nRecommendations\n\u0095\tVerify the call list in the EAP is updated annually.\n\u0095\tCopies of the EAP documents at operation and maintenance locations should contain the latest updates."
    }
  ]
}