{
  "FacilityID": 1000059119,
  "FacilityName": "ROYAL MADERA VINEYARDS",
  "FacilityStr1": "30957 Avenue 8",
  "FacilityStr2": null,
  "FacilityCity": "Madera",
  "FacilityState": "CA",
  "FacilityZipCode": "93637",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06039",
  "LEPC": null,
  "FacilityLatDecDegs": "36.865845",
  "FacilityLongDecDegs": "-119.983149",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Steve Volpe",
  "OperatorStr1": "30957 Avenue 8",
  "OperatorStr2": null,
  "OperatorCity": "Madera",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93637",
  "OperatorZipCodeExt": null,
  "RMPContact": "Matthew Cerniglia",
  "RMPTitle": "Operations Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000216535",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-05-26 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-08-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-08-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-08-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000073727,
      "AltID": "Ammonia (Anhydrous)",
      "FacilityID": 1000059119,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000074889,
          "ProcessID": 1000073727,
          "NAICSCode": "111332",
          "_desc": {
            "NAICS_CODE": "111332",
            "NAICS_DESCRIPTION": "Grape Vineyards"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000091014,
          "ProcessID": 1000073727,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000591014,
          "ProcessID": 1000073727,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059119,
      "SummaryText": "EXECUTIVE SUMMARY: \n\nProcess Safety Management (PSM) and Emergency Response Policies \n\nAnhydrous ammonia is utilized as a refrigerant (Refrigerant R-717) in the Royal Madera Vineyards located in Madera, California. As it is Royal Madera Vineyards policy to comply with all applicable governmental regulations, the cold storage facility was designed and constructed in accordance with the Uniform Building Code and Uniform Mechanical Codes. \n\nAdditionally, Royal Madera Vineyards has developed and implemented a PSM program for the refrigeration systems. As part of the PSM program Royal Madera Vineyards completed process hazard analyses. Royal Madera Vineyards utilizes contractors to implement a preventative maintenance program and mechanical integrity program to ensure that the refrigeration equipment is maintained in good operating condition. Properly maintained equipment reduces the risk of an accidental release. \n\nPersonnel from Royal Madera Vineyards monitor the daily operation of the refrigeration systems. All service, maintenance, and repairs to the ammonia refrigeration systems are contracted to a qualified and licensed refrigeration contractor specializing in ammonia refrigeration. Utilizing an experienced qualified contractor to perform routine service, maintenance, and repairs ensures that the equipment is in excellent operating condition. \n\nWhile it is Royal Madera Vineyards objective to be a responsible citizen of the community in all of its business activities, the limited staff at the cold storage facility precludes emergency response operations. As such, an emergency action plan has been prepared for the Royal Madera Vineyards facility and a chain of command to respond to emergencies has been established. \n\nRoyal Madera Vineyards has developed a detailed Compliance Audit Check list which is used to evaluate Compliance with the CalOSHA regulations. At least every three years, Royal Madera Vineyards audits these programs and any findings of non-compliance are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059119,
      "SummaryText": " documented and responded to and the deficiencies are corrected. General Process Safety Management and Chemical-Specific Prevention Steps a PSM program, which meets the requirements of the general Process Safety Management program, has been implemented by Royal Madera Vineyards to address the anhydrous ammonia refrigeration system. The PSM program includes the following chemical-specific prevention steps: \n\n\n\n1.    Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process is being compiled. \n\n2.    Process Hazard Analyses (PHA) will be up dated and revalidated at least every five years. \n\n3.    Written operating procedures will be reviewed at least annually. \n\n4.    Safe work practices, such as lockout/ragout, confined space entry, opening process equipment or piping, and control over entrance into the facility are implemented as needed. \n\n\n\n5.    If employees are involved in operating the ammonia system, they will receive initiaI training and refresher training at least every three years. \n\n6.    Written mechanical integrity procedures have been established and implemented. \n\n7.    A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system. \n\n8.    Pre-startup safety reviews will be performed when a modification is made to the ammonia system that is significant enough to require each in the process safety information. \n\n9.    Audits will be conducted at least every three years to evaluate compliance with the CalOSHA regulations. \n\n10.    Incident investigation procedures have been estab lished. \n\n11.    A written plan of action regarding the implementation of employee participation has been developed and implemented. \n\n\n\n12.    Hot work permits will be issued for all hot work operations conducted on or near the ammonia system, as needed. \n\n13.    A Contractor Safety Policy has been developed and implemented. \n\n\n\nTo ensure that the genera"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059119,
      "SummaryText": "I accidentaI release prevention program and the chemicaI-specific prevention steps are implemented, Royal Madera Vineyards has assigned overall responsibility for the PSM elements to a partner in the firm. The partner has the overall responsibility for the development, implementation, and integration of the PSM elements. \n\nFive-Year Accident History; \n\nRoyal Madera Vineyards has not had any accidental releases from the ammonia-based refrigeration system that have resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years. \n\nEmergency Response Program; \n\nRoyal Madera Vineyards has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response. However, an \n\nemergency response program does not need to be developed for the facility since Royal Madera Vineyards employees will not respond to accidental releases of ammonia, the facility is included in the com munity \n\nemergency response plan, and appropriate mechanisms are in place to notify emergency responders. \n\nPlanned Changes to Improve Safety; \n\nRoyal Madera Vineyards relies on the expertise of qualified ammonia refrigeration contractors to regularly evaluate the need for any changes to the refrigeration equipment and to improve safety. Currently, Royal Madera Vineyards does not have any changes planned to improve safety associated with the ammonia refrigeration system.\n\n\n\nIn conclusion; Royal Madera Vineyards considered \"earthquakes\" as an external event on the Process Hazard Analysis (PHA). The recommendation resulting from this is to have a licensed PE or company that specializes in Ammonia Refrigeration Systems conduct a Mechanical Integrity Audit every 3 years. Royal Madera has done so and has now adapted this recommendation into their safe work practices (SWP).\n\n"
    }
  ]
}