{
  "FacilityID": 1000024756,
  "FacilityName": "Nashua Corporation - Merrimack Facility",
  "FacilityStr1": "59 Daniel Webster Highway",
  "FacilityStr2": null,
  "FacilityCity": "Merrimack",
  "FacilityState": "NH",
  "FacilityZipCode": "03054",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33011",
  "LEPC": "Merrimack LEPC",
  "FacilityLatDecDegs": "42.803333",
  "FacilityLongDecDegs": "-071.473333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1079433,
  "ParentCompanyName": "Cenveo Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nashua Corporation",
  "OperatorStr1": "59 Daniel Webster Highway",
  "OperatorStr2": null,
  "OperatorCity": "Merrimack",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03054",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard Cardin",
  "RMPTitle": "Environmental Manager",
  "FTE": 85,
  "OtherEPAFacilityID": "03054NSHCR57DA",
  "EPAFacilityID": "100000127579",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "TV-OP-051",
  "SafetyInspectionDate": "2011-02-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-11-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-11-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-11-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-09-30 00:00:00",
  "DeRegistrationEffectiveDate": "2016-09-30 00:00:00",
  "AnniversaryDate": "2016-11-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.805,
  "FRS_Long": -71.476,
  "FRS_Description": null,
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "23",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000030364,
      "AltID": "3RB50 Polymerization",
      "FacilityID": 1000024756,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000030666,
          "ProcessID": 1000030364,
          "NAICSCode": "322222",
          "_desc": {
            "NAICS_CODE": "322222",
            "NAICS_DESCRIPTION": "Coated and Laminated Paper Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000036488,
          "ProcessID": 1000030364,
          "ChemicalID": 29,
          "Quantity": 84000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000536488,
          "ProcessID": 1000030364,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024756,
      "SummaryText": "    Executive Summary\n\nThe Nashua Merrimack facility, owned and operated by Cenveo is located at 59 Daniel Webster Hwy., Merrimack, NH  03054. The management and employees of the Merrimack facility are committed to the prevention of any accidental releases of highly hazardous materials.  If an accidental release should occur, the facility is prepared to work with the local fire department, or other authorities to mitigate any release and minimize the impact of the release to the community and the environment.\n\nThe facility's primary operations are the production of paper coatings where the covered material, vinyl acetate, is used as a starting material in the production of a vinyl acetate - vinyl pyrrolidone acetate copolymer called 3RB50. This material is an ingredient in a label adhesive coated at the facility under the name of DAVAC\n\n\n\nVinyl Acetate is received in 41000 lb  bulk trailer delivery to a 12,000 gal. UST from the  Supplier. The  system \n\ncontains a maximum of 39,000 pounds of vinyl acetate.  The vinyl acetate is then sent to other parts of the process for the manufacturing of a copolymer 3RB50.\n\n.\n\n    \n\nThe worst-case scenario, based on the EPA's definition for a toxic liquid conducted and endpoints were determined using RMP*Comp Ver. 1.07 The endpoint of EPRG-2 Level was determined to be 0.4 miles. The weather conditions used were a wind speed of 1.5 meters/sec., Stability Class F, an air     temperature of 77 degrees F and urban topographical terrain.\n\n    \n\nThe impacted area would affect 135 residents and business based on the 2000 US Census data.  No environmental receptors are affected.  A dike and spill containment area was the passive/active mitigation or administrative controls were considered in this assessment.\n\n    \n\nThe alternative release scenario  involved the release of 396 pounds from a reactor. This release would result in the release of 396 lb of liquid onto a contained area within color room #3. Vinyl acetate would release at a rate of 3.3 lb/min"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024756,
      "SummaryText": " over 120 minutes. The release would be contained within a building and it containment area. These were the  passive ane active mitigation measures  considered.\n\n            \n\nThe release endpoint of EPRG-2 Level was determined to be less than  0.1 miles using the RMP*Comp. (1.07) software. The Weather conditions used were a wind speed of 3.0 meters/sec., Stability Class D, and air temperature of 77 degrees F and urban topographical terrain. The affected area would include 0 residents and  no industrial facility based on actual observations.\n\n\n\n    \n\nMitigation systems     Passive and Active Mitigation systems are in place that would reduce the likelihood of a release or the release itself. These include check valves in the fill lines, spill containment areas in tank farm and process areas, a preventive maintenance schedule for the system, and safeties.\n\n\n\n\n\nPrevention program     The facility has developed a comprehensive prevention program designed to prevent accidental releases of Vinyl acetate, toluene and other highly hazardous chemicals.  The program utilizes, sound engineering practices, administrative controls and active employee participation.  Employees serve on task groups and teams in developing and maintaining risk management program elements.  They are frequently consulted concerning the various aspects of the program and ways to continually improve the safety of the process. \n\n\n\nPage 9 of  11\n\nProcess safety information     Written process safety information was developed for the 3RB50/Davac system to enable managers, supervisors, and employees to identify and understand the process hazards.  This information was utilized to develop a Process Hazard Analysis (PHA) which assists management and employees in making decisions for improving safety and reducing the consequences of releases of vinyl acetate and other chemicals. The PHA focuses attention on equipment, instrumentation, utilities, human actions, (routine and non-routine), and external factors that might impact the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024756,
      "SummaryText": "process by identifying potential failure points or failure modes in the process. The PHA was conducted in July, 2011 and will be updated at least every five years. \n\n\n\n\n\nOperating procedures     Detailed operating procedures exist which describe tasks to be performed, dates to be recorded, operating conditions to be maintained, and safety and health precautions to be taken.  The procedures were reviewed/approved to ensure they are technically accurate by employees, managers and personnel with the technical expertise/knowledge of the process.  The operating procedures were reviewed in October 2011 and are annually reviewed/revised as necessary to reflect current operations. \n\n\n\n\n\nEmployee training     Employees are thoroughly trained, including maintenance and contractor employees.  The training meets and exceeds the requirements as outlined in OSHA's hazard communication standard 29 CFR 1910.1200.  Training includes operating procedures, safe work practices, emergency procedures (including alarms), special assignments, evacuation and emergency response; safety rules and procedures, routine and non-routine work authorization and other pertinent process safety information.  Each employee trained has a defined and documented program based on job duties.  The training goals and objectives have been established and written in clear and measurable terms.  Hands-on training is provided to employees to enhance their senses beyond listening.  In addition, employees receive traditional classroom instruction.  Employees are encouraged to actively participate.  The employees are periodically evaluated to ensure they possess the necessary skills and knowledge via written tests, observation and/or oral interviews. The training program was last reviewed on October 2011. \n\n    \n\nContractor screening     A contractor screening process has been established and is designed to ensure that contractors hired or used can accomplish their assigned tasks without compromising the safety and health of em"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024756,
      "SummaryText": "ployees and the public.  The screening program involves obtaining information on the contractor's safety performance, including injury and illness rates, and experience.  In addition, the contractor's safety performance, job skills, knowledge, and certifications are also verified. The contractor safety procedures were last reviewed in September 2011. \n\n\n\n\n\nPre-Start up safety reviews     Pre-Start up Safety Reviews (PSSR) are used for new or modified processes to improve the design and construction of the process from a reliability and quality standpoint.  The PSSR recommendations are resolved before final installations are complete. Other items completed prior to initial process start up include piping and instrument diagrams, operating procedures, and ensuring operating personnel are fully trained.  The initial start up and normal operating procedures are fully evaluated as part of the PSSR to assure a safe transfer into the normal operating mode for meeting the process parameters. The last Pre-Start up Safety Review was conducted in October 2011. \n\n\n\n\n\nMechanical integrity program     An on-going mechanical integrity program (maintenance) is used to ensure safe process operations. Equipment used to store, process, or handle vinyl acetate and other chemicals have been designed, constructed, installed, and maintained to minimize releases.  The mechanical integrity program includes the identification and categorization of equipment/instrumentation, inspection/tests and their frequencies, development of maintenance procedures and training of maintenance personnel, criteria for acceptable test results, documentation of test/inspection results, and documentation of manufacturer's recommendations to prevent failure of equipment and instrumentation. This program was reviewed in October of 2011. \n\n\n\n\n\n\n\n\n\n\n\n\n\nPage 10 of  11\n\nNon-routine work \n\n(Hot work, LOTO)    Non-routine work is controlled in a consistent manner.  The hazards identified is communicated to those performing the "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000024756,
      "SummaryText": "work and to operating personnel whose work could affect the safety of the process.  The Hot Work and Lockout/Tagout Program describe the steps that a supervisor, contractor representative or other authorized issuer needs to follow to manage hazardous work. The program references and coordinates applicable lockout/tagout procedures, line breaking, hot work authorization, elevated work/fall protection, controlling access to covered process areas, and excavation procedures. Confined Space Entry Program is a separate permitting system designed to manage it's employees/contractors in performing this type of work. This Program was reviewed in October 2011 for employees and contractors. \n\n\n\n\n\nManagement of change     Management of Change (MOC) procedures have been developed for permanent changes to process chemicals, technology, equipment and facilities.  MOC procedures are designed to ensure that prior to any change occurring, that technically qualified personnel with knowledge and expertise of the chemical process, reviews and approves the proposed changes. This would include both technical and mechanical changes. Process changes include all modifications to equipment, procedures, raw materials and processing conditions other than \"replacement in kind.\"  A Process Change Authorization is required for all changes.  Management of Change procedures were reviewed in October of 2011. \n\n     \n\n    \n\nProcess incidents     Process incidents which result in or could reasonably have resulted in a release of vinyl acetate and other hazardous chemicals are investigated, including \"near misses\", within 48 hours of the incident.  The purpose of the incident investigation is to identify the underlying causes of the incident and to implement corrective action to prevent similar incidents and avoid past mistakes.  Process incidents are investigated by a Team which include both management and employees and is multidisciplinary. An incident report is prepared following the investigation which includes"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000024756,
      "SummaryText": " the findings, conclusions, and recommendations. The Facility Manager is responsible for ensuring that all report recommendations are completed or resolved by those individuals responsible for follow-up. All resolutions are communicated to all affected employees. \n\n\n\nSite emergency plan     The facility has an emergency preparedness/response plan.  The plan outlines what actions employees are to take in the event of an vinyl acetate and other chemical release.  The plan complies with OSHA standard 29 CFR 1910.38 and has been integrated with local emergency response agencies.  The facilities HAZPLAN was reviewed in October of 2011.\n\nAll employees and contractors are trained in the plan prior to commencement of work.  The plan is tested and critiqued at least once a year to ensure that it is current. Changes are made and reviewed if deficiencies are found. The site does not have trained Emergency Responders at the technician level. \n\n\n\n\n\nCompliance audit     The facility receives a Compliance Audit in accordance with EPA Risk Management Standard Part 68 at least once every three years.  The audit includes an evaluation of the design and effectiveness of the risk management system and a field inspection of the safety and health conditions, and practices to ensure compliance.  The Team uses an audit tool to document each audit step and ensure an effective audit is conducted.  A Protocol Policy has been developed to ensure that proper follow-up is accomplished.  A compliance audit was conducted in April 2011\n\n\n\n\n\nAvailability of information     Nashua will make available all information, including any trade secret information as it relates to compliance with this regulation. \n\n\n\n\n\nSafety information     Safety improvement is an on-going process at the facility.  Periodic evaluations are performed to assess the maintenance of safe conditions.  There are no additional specific vinyl acetate safety recommendations for implementation at this time. \n\n"
    }
  ]
}