{
  "FacilityID": 1000044523,
  "FacilityName": "SABIC Innovative Plastics-Ottawa",
  "FacilityStr1": "2148 N. 2753rd Road",
  "FacilityStr2": null,
  "FacilityCity": "Ottawa",
  "FacilityState": "IL",
  "FacilityZipCode": "61350",
  "Facility4DigitZipExt": "9766",
  "FacilityCountyFIPS": "17099",
  "LEPC": "Lasalle County LEPC",
  "FacilityLatDecDegs": "41.336944",
  "FacilityLongDecDegs": "-088.761111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.sabic.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79135133,
  "ParentCompanyName": "SABIC US Holdings LP",
  "Company2Name": null,
  "CompanyDUNS": 78612482,
  "Company2DUNS": 0,
  "OperatorName": "SABIC Innovative Plastics US LLC",
  "OperatorStr1": "One Plastics Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Pittsfield",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01201",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bruce Glombicki",
  "RMPTitle": "Process Safety Management Leader",
  "FTE": 230,
  "OtherEPAFacilityID": "61350BRGWRCANAL",
  "EPAFacilityID": "100000078523",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "099829AAA",
  "SafetyInspectionDate": "2016-02-01 00:00:00",
  "SafetyInspectionBy": "US Coast Guard",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-05-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-05-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-05-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-05-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.337,
  "FRS_Long": -88.7559,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055021,
      "AltID": "Butadiene Handling",
      "FacilityID": 1000044523,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055865,
          "ProcessID": 1000055021,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067004,
          "ProcessID": 1000055021,
          "ChemicalID": 120,
          "Quantity": 5800000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 120,
            "ChemicalName": "1,3-Butadiene",
            "CASNumber": "106-99-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567004,
          "ProcessID": 1000055021,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000055022,
      "AltID": "Acrylonitrile Unloading",
      "FacilityID": 1000044523,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055866,
          "ProcessID": 1000055022,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067005,
          "ProcessID": 1000055022,
          "ChemicalID": 25,
          "Quantity": 6600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567005,
          "ProcessID": 1000055022,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000055023,
      "AltID": "Resin B, C",
      "FacilityID": 1000044523,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055867,
          "ProcessID": 1000055023,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067006,
          "ProcessID": 1000055023,
          "ChemicalID": 25,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567006,
          "ProcessID": 1000055023,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000071831,
      "AltID": "GELOY ASA Process",
      "FacilityID": 1000044523,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000073032,
          "ProcessID": 1000071831,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000088718,
          "ProcessID": 1000071831,
          "ChemicalID": 25,
          "Quantity": 4100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000588718,
          "ProcessID": 1000071831,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044523,
      "SummaryText": "EXECUTIVE SUMMARY\n\n0.1 INTRODUCTION\n\n\n\nThis Risk Management Plan is part of the continuing commitment of SABIC Innovative Plastics US LLC (SABIC) to minimize the potential impact from our Ottawa, IL facility on our workers, our community neighbors, and the environment. It is the stated policy of SABIC to safely manage our site operations. In addition, we have prepared contingency plans to be used in the unlikely event that a major accident should occur. \n\nThe efforts at our facility have been recognized by the US Occupational Safety and Health Administration (OSHA), which oversees our programs, as among the best in the nation for worker safety. \n\nWe believe it is important for all interested parties to have access to information that can help them better understand our business and our facility. If you have any questions about this document, or any other aspect of our Company or our plans, please contact our Human Resources Department at (815) 433-7427. \n\n \n\n0.2 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nOur company is committed to operating safe and environmentally sound chemical and plastics production facilities everywhere we do business. Protection of our neighbors and workers is the highest priority. This ongoing commitment to worker and public safety is demonstrated through resources invested for safe design, operation, and maintenance of our facilities. \n\nIn order to provide top-quality products for our customers, the Ottawa facility uses in its manufacturing process some raw materials that are classified as toxic or flammable. We are committed to complying with governing laws, regulations, and engineering standards as well as conducting systematic assessments to manage and maintain a safe operation. Our operating practices and procedures ensure that numerous controls are implemented to prevent an accidental release of a chemical. However, if a major release does occur, our trained on-site emergency response organization will be activate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044523,
      "SummaryText": "d. This organization includes a fire brigade as well as medical, rescue and chemical emergency response teams.\n\nThe outstanding safety programs at the Ottawa facility have earned the site OSHA Voluntary Protection Program (VPP) STAR status, presented by OSHA for exemplary safety management. This is OSHA's highest recognition for safety performance. Because of this exemplary performance, the OSHA Training Institute has chosen to use the Ottawa plant site eight times for Process Safety Management (PSM) training.\n\n\n\n0.3 DESCRIPTION OF THE FACILITY AND REGULATED SUBSTANCES\n\n\n\nThe SABIC plant is located on a 215-acre tract along the Illinois River about three miles east of Ottawa, IL. It was built in 1967 and currently employs about 230 people. The plant manufactures engineered thermoplastic resins and pellets. Our products are used in the automotive, medical, electronics, computer, and appliance industries, to name a few. \n\nIn order to ensure quality products, quality service and quality of life, the SABIC has invested more than $55 million since June, 2014 for expansion, capital improvement, and safety and environmental protection.\n\nThe Ottawa, IL plant uses two chemicals that are regulated under the EPA's Risk Management Program (RMP) rule: acrylonitrile, a regulated toxic substance, and 1,3-butadiene, a regulated flammable substance. Acrylonitrile and 1,3-butadiene are raw materials used to manufacture our products. \n\n \n\n0.4 GENERAL ACCIDENTAL RELEASE PREVENTION / CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nSABIC has implemented a comprehensive PSM program to prevent accidental releases of highly hazardous chemicals. PSM is an integral part of working safely at SABIC facilities. PSM ensures that proper safety information is in place; operating procedures are followed; chemical hazards are identified; employees and contractors are trained; and, critical equipment is properly inspected and maintained. PSM satisfies the accidental release prevention program requirements of th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044523,
      "SummaryText": "e RMP.\n\nSome of the many, specific safety features to prevent a chemical accident include:\n\n- Railroad tank cars are regulated and inspected under U.S. Department of Transportation (USDOT) regulations that require periodic pressure testing and are built to stringent safety standards that provide protection in the event of a rail accident;\n\n- Safety instrumentation, tank high-level shutoffs, and procedures that reduce the potential for human error which could lead to a storage tank overfill;\n\n- Shut-off valves for the butadiene and acrylonitrile storage tanks that can be closed from a remote location, if needed;\n\n- Secondary containment dikes around storage tanks to contain a spill;\n\n- Butadiene and acrylonitrile gas sensors to detect and warn of a release in the tank farm and latex operating areas;\n\n- Local spill containment around acrylonitrile railcars at the unloading station to mitigate the impact of a leak;\n\n- Acrylonitrile railcar and butadiene barge unloading operations are continuously attended by Tank Farm Technicians who have received specialized training in USDOT as well as USCG-MARSEC requirements;\n\n- An inherently safer process for latex manufacturing. Under this process, the amount of butadiene is controlled such that if a problem were to be detected that required the process to be shut down, the chemical reaction would immediately cease before an unsafe condition could develop;\n\n- A computer-controlled Safety Instrumented System (SIS) on the latex manufacturing process to ensure that any deviations from the intended operating conditions are immediately identified and corrected;\n\n- Backup cooling water systems in the plastic resin manufacturing processes that can be activated both automatically and manually;\n\n- Backup shutdown systems for the plastic resin manufacturing processes;\n\n- Extensive safety information about the processes reviewed with employees and contractors;\n\n- A comprehensive reliability review program for all pressure safety relief devi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044523,
      "SummaryText": "ces;\n\n- Written operating procedures that empha safe operating practices and include emergency response actions;\n\n- Comprehensive employee and contractor training programs to promote consistently safe work practices;\n\n- Maintenance programs to ensure ongoing equipment reliability - includes equipment testing, inspection, and repair;\n\n- Site-wide piping and electrical standards for the design, installation, and repair of equipment;\n\n- Safety pre-qualification for all contractors;\n\n- A safety procedure to review proposed plant modifications before they are implemented for possible hazards (\"Management of Change\");\n\n- Safety reviews prior to startup of our processes;\n\n- Safety permit procedures that control hazards during special operations, such as welding and other maintenance activities; and, \n\n- Ongoing corporate compliance audits for PSM as well as RMP to ensure standards are being followed.\n\n\n\n\n\n 0.5 FIVE YEAR ACCIDENT HISTORY\n\n\n\nThe Ottawa, IL site has an outstanding record of accident prevention, which demonstrates its commitment to public and worker safety. Even minor incidents are investigated to identify what went wrong and to learn how to prevent future occurrences.\n\nEPA requires that all incidents involving regulated chemicals that resulted in any off-site impact or significant on-site impact be reported in this document. Since the previous RMP submittal, no such accidents have occurred at the Ottawa site. \n\n\n\n 0.6 EMERGENCY RESPONSE PROGRAM\n\n\n\nThe Ottawa, IL site maintains a written emergency response program designed to protect workers, the public, and the environment in the event of a major accidental release. All of our employees are trained in the proper response to an incident. We also invest in the equipment needed to respond to emergencies, both on-site and off-site. Our trained fire brigade, medical, rescue and chemical response teams work closely with area hospitals, industries, and other response organizations in the Marseilles-Ottawa, IL area. "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044523,
      "SummaryText": "\n\nThe Ottawa Site Emergency Response Team (ERT) has received extensive training from the Illinois Fire Academy at the University of Illinois and Rock Island Arsenal Fire Department over the last 5 years. Training is conducted at the site on the Ottawa Site Emergency Response Plan, firefighting methods and operations, hazardous material response, and advanced rope rescue.\n\nEmergency medical response is a part of the Ottawa Site ERT system. These personnel have been trained by the Ottawa Site Nurse under the direction and requirements of the OSF St. Elizabeth Hospital Emergency Room Staff and Ottawa Fire Department personnel to respond to potential medical emergency conditions at the Emergency Medical System - First Responder level. An ongoing training program has been in place for these personnel since 1992 inception. In order to ensure prompt medical attention for serious conditions, the Ottawa Site has coordinated with Life Flight medical helicopter support centers (St. Francis-Peoria and Loyola-Chicago).\n\nThe Ottawa Site ERT has a Mutual Aid Agreement with the Marseilles Area Fire Protection District. Since the beginning of this relationship, SABIC, the District, and the Ottawa Fire Department have conducted joint training to further develop emergency response skills. Current plans call for:\n\n- Redeveloped relationships with the Ottawa Chamber of Commerce on an annual basis.  Also, the Site General Manager participates as a Chamber Member; and,\n\n- Working closely with the LaSalle County Local Emergency Planning Commission.\n\nOngoing training exercises are important to the company's emergency response organization and help better prepare our partners in the community for emergency response necessary in the unlikely event of a major industrial incident. \n\nSABIC personnel are assisting the LaSalle County Local Emergency Planning Commission in the development of a county-wide emergency plan. As is consistent with the LaSalle County emergency plan, SABIC will work throu"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000044523,
      "SummaryText": "gh the Marseilles Area Fire Department to communicate any appropriate actions to be taken by the public in the event of a chemical emergency. \n\n\n\n\n\n 0.7 PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nSABIC is committed to continuously improving the overall safety and environmental performance record at the Ottawa, IL facility. Some of the specific planned changes aimed at improving safety are: \n\n- Continuing development of best management practices under OSHA's VPP program;\n\n- Improved safety procedures and practices for control of hazardous emergency during maintenance activities;  \n\n- Growing behavioral-based safety systems for employees to reduce the chance of human error leading to a workplace injury or an accidental release; and,\n\n- An ongoing employee exposure monitoring and reduction program for 1,3-butadiene and acrylonitrile.\n\n"
    }
  ]
}