{
  "FacilityID": 1000047611,
  "FacilityName": "The Andersons Maumee Terminal",
  "FacilityStr1": "523 Illinois Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Maumee",
  "FacilityState": "OH",
  "FacilityZipCode": "43537",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39095",
  "LEPC": "Lucas County LEPC",
  "FacilityLatDecDegs": "41.571389",
  "FacilityLongDecDegs": "-083.670278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.andersonsinc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7903628,
  "ParentCompanyName": "The Andersons, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7903628,
  "Company2DUNS": null,
  "OperatorName": "The Andersons, Inc.",
  "OperatorStr1": "1947 Briarfield Blvd",
  "OperatorStr2": "PO Box 119",
  "OperatorCity": "Maumee",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43537",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059349",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-09-17 00:00:00",
  "SafetyInspectionBy": "3rd Party Insurance Inspection",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-05-01 15:53:14",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-11-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-11-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-11-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.571389,
  "FRS_Long": -83.670278,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059442,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000047611,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000072746,
          "ProcessID": 1000059442,
          "ChemicalID": 56,
          "Quantity": 131325.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000060504,
          "ProcessID": 1000059442,
          "NAICSCode": "42491",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000049486,
              "Process_NAICS_ID": 1000060504,
              "SafetyReviewDate": "2014-10-09 00:00:00",
              "PHA_Date": "2014-10-17 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-10-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installed fence & additional lights around storage tank",
              "OpProceduresReviewDate": "2018-02-14 00:00:00",
              "TrainingReviewDate": "2014-09-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-11-22 00:00:00",
              "EquipmentInspectionDate": "2013-12-09 00:00:00",
              "EquipmentTested": "Five-year ammonia tank inspection and all appurtenances",
              "ChangeMgmtDate": "2014-09-23 00:00:00",
              "ChangeMgmtReviewDate": "2014-09-23 00:00:00",
              "PreStartupReviewDate": "2014-09-23 00:00:00",
              "ComplianceAuditDate": "2016-11-09 00:00:00",
              "AuditCompletionDate": "2018-11-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-11-18 00:00:00",
              "HotWorkPermitReviewDate": "2014-11-01 00:00:00",
              "ContractorSafetyReviewDate": "2014-09-01 00:00:00",
              "ContractorSafetyEvalDate": "2014-09-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000060332,
                  "PreventionProgram3ID": 1000049486,
                  "ProcessChemicalID": 1000072746
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000047611,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Maumee Fire Department",
    "CoordinatingAgencyPhone": "4198977000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047611,
      "SummaryText": "Maumee Complex RMP Executive Summary\r\n\r\nSource and Product Description\r\nThe Andersons Maumee Wholesale Fertilizer facility is engaged in the handling, storage, shipping and receiving of bulk agricultural fertilizers (liquid and granular) and miscellaneous farm supplies.  The Liquid Poly Phosphate Processing facility began operations in the fall of 1994.  Key personnel at the Maumee facility are Ted Fillmore - senior manager and Joe Schweitzer - operations manager.\r\n\r\nThe facility manufactures a liquid ammonium polyphosphate fertilizer called 10-34-0 (N-P-K analysis) which is produced by combining anhydrous ammonia, phosphoric acid and water, in a controlled environment.  While the process is exothermic, the resulting heat is managed through a closed-loop process that virtually eliminates the production of a steam plume.  Production rates average 18,000 tons of 10-34-0 fertilizer per year.\r\n\r\nThe Liquid Plant occupies approximately 2.5 acres and is situated on the west side of The Andersons Complex and northeast of the intersection of Ford Street and Illinois Ave.  There are two businesses directly to the north, Williams Brothers Concrete and StoneCo.  Charlie's Dodge Dealership is located to the west, on the other side of Ford St.  The Andersons General Store is southeast of the plant, across Illlinois Ave.  \r\n\r\nThe only RMP-regulated material stored at the Maumee Complex is anhydrous ammonia at the Wholesale Fertilizer facility.  A 30,000 gallon tank is used for bulk storage of  the material. When filled to the maximum 85% capacity, this tank can hold 25,500 gallons of anhydrous ammonia.  This material is a gas at ambient temperature and pressure.  It is a liquid when stored under pressure inside the tanks.\r\n\r\nAnhydrous ammonia is not a poison, but it is an inhalation / respiratory hazard.  Ammonia is a toxic material but it has no cumulative toxic effects on the human body.  However, it is acutely corrosive when it comes in contact with mucous membranes, in partic"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047611,
      "SummaryText": "ular.  Anhydrous ammonia is a non-flammable gas.  Anhydrous ammonia has a strong chemical affinity for water and therefore, an abundant supply of water is our best defense against a small or large-scale ammonia release.\r\n\r\nSummary of Major Hazards\r\nThe principal causes of ammonia and propane emergencies are ruptured hoses and defective valves, as indicated by the alternative release scenario. The most probable time for an exposure or release to occur will be during a transfer from a delivery unit (a tanker truck) to the bulk storage tank.  All other product transfers from the storage tank to production are hard-plumbed.  Flexible hoses are provided by the trucking company and must be connected properly.  Hoses are date-stamped and replaced by the transporter or The Andersons in advance of the expiration date or when defects are observed.  All transfers of ammonia are observed by Anderson personnel at delivery site or via camera.                               \r\n\r\nUnder normal circumstances for the alternative release scenario, the amount released would not be based on the total volume of both the storage tank and the delivery truck.  Instead, it would be limited by the volume of the delivery vessel.  The plumbing at the storage vessel receiving bulkhead has backflow preventers which would prevent the tank from emptying its contents if a transfer hose ruptured.  Therefore, the product that would be released would have to come from the delivery vessel.  \r\n\r\nThe primary method for receiving anhydrous ammonia is by truck, which holds 20 tons (40,000 pounds) of ammonia.  Product is transferred via rubber hoses to the storage tank at a rate of 1,000 pounds / minute.  The truck has an excess flow valve and the receiving system at the storage tank also has one.  Typically, a release would immediately trigger the excess flow valve to slam shut.  However, if the release was too slow to trigger the excess flow valve, it would continue to leak until the transfer system could be"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047611,
      "SummaryText": "shut down.  Over the course of a ten minute period, approximately 10,000 pounds of ammonia would be released.                                                                                          \r\n\r\nTransfers of anhydrous from the bulk storage tank to the processing system occur inside fixed steel pipes and are automated from the control room.  No hoses are utilized in the operation.  Mass meters are used to indicate the rate of flow.\r\n\r\nWith elevated temperatures that occur during mid-to-late summer, the ammonia gas inside the bulk storage tank can expand, and possibly cause the relief valve to open in order to equalize the pressure inside the tank.  The relief valve will reseal itself when pressure is relieved.  These events are very short in duration lasting a few seconds at the most.  \r\n\r\nA complete tank failure, as indicated by the worst case scenario, is highly unlikely.  The bulk storage tank for anhydrous ammonia was built under strict guidelines established in the ASME pressure vessel code. The National Board Certificates for the tank is on file.   The storage tank is protected by concrete traffic barriers, guardrails and fencing.  All welding and structural work done on the tanks or appendages are performed by certified welders and stamped accordingly.  The worst case scenario depicts a catastrophic loss of the anhydrous ammonia storage tank which is a 30,000 gallon capacity tank.  The maximum fill level of the tank is 85% which is 25,500 gallons and at 5.15 pounds/gallon the maximum amount that could be lost is 131,325 pounds.\r\n\r\nExplanation of How Hazard Releases are Prevented.\r\nPassive mitigation refers to equipment, devices, or technologies that function without human, mechanical or other energy input.  The passive mitigation systems in place at the Maumee facility are:\r\nSecondary containment dikes that meet or exceed regulatory standards.\r\nBulkhead breakaway units located on the connection points to the storage tanks. If a truck driver were to dri"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000047611,
      "SummaryText": "ve off without disconnecting from the tank(s), the concrete structure would cause the hose to break at the outside of the connection point.  At this point, active mitigation would take effect and an excess flow valve, just to the inside of the breakaway would prevent the tank from emptying to the atmosphere.\r\n \r\nActive mitigation refers to equipment, devices or technologies that require human, mechanical or other energy input to function.  The active mitigation systems in place at the Maumee facility are:\r\nExcess flow valves are located on all outgoing liquid and vapor valves on both storage tanks.  They close automatically if the volume of gas or liquid flowing through the line exceeds the normal flow rate.  They won't reopen until the downstream shutoff valve is closed and the pressure equalizes on both sides of the valve seat.  Two principal causes of the excess valve closing are a ruptured hose or a broken pipe or shutoff valve downstream that is opened too quickly.\r\nBack check valves are located on the unloading lines of delivery trucks and are designed to ensure that the flow goes in one direction only.  This prevents anhydrous ammonia or propane from flowing to a transport tank from the storage tank.\r\nPressure-relief valves are located on the top of the bulk storage tanks, fixed steel piping and on the vaporizer to relieve pressure that is too great.  This can be caused by elevated temperatures in the summer or overfilling.  They open directly to the atmosphere at 250 psig and close when the pressure inside the tank drops below this pressure.\r\nAn emergency shutoff cord, located along the side of the anhydrous ammonia bulk storage tank activates the emergency shutoff valves (snappy joes) on the discharge side of the ammonia pump.  This stops the flow of ammonia by remote activation of a spring loaded valve.\r\nAn ample supply of water is available near the bulk storage tank from a nearby water tank and a water hydrant to help knock down a vapor cloud.\r\nSpill con"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000047611,
      "SummaryText": "trol kits are located at the facility and include sorbent material, shovels, PPE and disposal containers.\r\nOperator and truck drivers supervise all anhydrous transfers to and from the bulk storage tank.\r\n\r\nPrevention Program\r\nPreventive maintenance is an integral piece of this facility's hazard management program.  All hoses, tanks, valves and storage units are inspected at least monthly, and usually daily during the production season.  A good PM program is our strongest defense against a release of anhydrous ammonia.  All hose replacements are documented in the maintenance files.  Records of all maintenance tasks performed on the tank or appendages are also on file.\r\n\r\nThis facility uses a certified contractor for all welding and construction performed on the anhydrous ammonia tank or transfer pipes.  Copies of all reports are on file. The Maumee processing plant undergoes a complete ammonia inspection by a third party at least every five years.\r\n\r\nSee Steps Taken to Address Hazards for more information on prevention measures and identification.\r\n\r\nFive Year Accident History\r\nThe facility has not had any accidents or incidents in the last five years.\r\n\r\nPlanned Changes to Improve Safety\r\nAt the time of filing there are no planned changes to improve safety.\r\n\r\nManagement System\r\n(see Steps Taken to Address Hazards)\r\n\r\nEquipment maintenance\r\nAll equipment maintenance is formally documented. See the Prevention Program section for further explanation.\r\n\r\nTraining\r\nAll employees receive annual training on anhydrous ammonia, emergency action plan and spill procedures, and hazard communication.  Documentation and attendance rosters are on file at the facility.  \r\n\r\nContractors\r\nAll contractors receive a contractor safety review prior to performing work at the facility.  During this review, they are informed of any potential hazards at the facility, emergency procedures, site-specific safety rules and the ability to request an MSDS for any product at any time.\r\n\r\nSteps Tak"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000047611,
      "SummaryText": "en to Address Hazards\r\nThe Andersons Maumee Wholesale Fertilizer facility has many systems in place for hazard assessment and mitigation.  \r\n\r\nThe Safety Department performs annual hazard management audits at the facility.  The audits include a physical walk through of the entire facility and a review of all EPA, OSHA and DOT paperwork and training documentation.  Action items are noted and recommendations are made. The audits consist of five major topical areas:  Safety & Health, Environmental, Fire Protection & Security, Administrative and Housekeeping & Storage.  Issues are documented in a report and sent to the facility manager and upper management.  Updates on action item status must be made regularly.\r\n\r\nA Process Hazard Analysis (PHA) has been made at the Maumee facility, as part of their Process Safety Management Program.  The analysis will be updated every five years, or as changes in the process are made.  PHA's are performed using the HAZOP technique and analyze all aspects involved in the production of 10-34-0 fertilizer.  The evaluation team includes representatives from the corporate Safety Department, group Management and Operations employees.\r\n\r\nEach situation is discussed and possible causes are listed.  Unless otherwise noted, situations are evaluated under the assumption that safety controls are in effect.  Potential consequences are listed and given a rating of 1 to 4 for severity and likelihood; with 1 being the worst case and 4 being none or very low.  When plotted, a risk value is assigned from A to D; again with A being the highest priority and most critical item and D being of least consequence with no mandatory follow up.  Finally, the recommendations and follow up are assigned to personnel and after completion the results are documented.\r\n\r\nFormal investigations are performed for all environmental or safety incidents.  Documentation is kept on file at the facility and the corporate Safety Department.\r\n\r\nA formal Management of Change (MOC)"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000047611,
      "SummaryText": "and Pre Startup Safety Review (PSSR) system is administered by the Safety Department.  An MOC/PSSR form is filled out whenever a change is planned to the 10-34-0 production system and finalized before startup.  Forms are routed from the facility operator to the Engineering and Safety personnel for review and remarks.  All forms are kept and routed in a database.\r\n\r\nMonthly Safety Committee meetings allow employees to discuss any concerns they may have with the operation of the facility.  Issues are documented and assigned to employees for follow-up. Records of all meetings are kept in a database.\r\n\r\nThe Maumee facility also participates in a best practices task force meeting at least annually to discuss production and quality issues, as well as training and methods for continuous improvement of the process.  Operators and management, together with representatives from the Safety and Engineering Departments spend the day discussing any and all issues related to the production of 10-34-0 and aqua ammonia.\r\n\r\nResponse Action in the Event of a Release\r\nIn the event of a burst hose or defective valve, employees are instructed to shut down the conversion process and, if possible, approach the shutoff valve from upwind and attempt to turn it off. \r\n\r\nFor an uncontainable release, employees will immediately call the police and fire department or other first responders, as appropriate.  All employees, customers and contractors are to be evacuated to an upwind location. Once the response team has arrived, we will work in concert with them to close the valves between the tank and the leak.  In the meantime, a steady spray of water will deluge the ammonia gas plume and knock it to the ground, while chemically binding any free ammonia.\r\n\r\nThe employees are instructed to make emergency phone calls in this order:  the Facility Manager, 911, the corporate Safety Department emergency phone number.  The corporate Safety Department will notify the Ohio Emergency Response Hotline hotli"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000047611,
      "SummaryText": "ne and the National Spill Response Center phone number.  All applicable contact names and numbers are found in the facility spill and emergency response plan.\r\n\r\nCommunication procedures with responders \r\nThe local fire department is invited to tour the Maumee facility on an annual basis.  Facility management, employees and fire department personnel have jointly discussed the location of the anhydrous ammonia and response procedures on a regular basis.  They know the location of all emergency shutoff valves and on-site response equipment.  We believe that a strong relationship with first responders is our best defense.\r\n\r\nThe LEPC and state regulatory agencies receive a copy of our hazardous materials storage information, every February, in accordance with our community right to know obligations.  A copy of the Maumee Emergency Action Plan is on file with the LEPC and the local fire departments.\r\n\r\nSecurity Plans\r\nThe Department of Transportation (DOT), Research and Special Programs Administration (RSPA) 49 CFR Part 172, requires all facilities that offer or transport hazardous materials to document a security plan and perform employee awareness training.  \r\n\r\nA security assessment plan has been created to describe all security measures at this facility, identify any vulnerable areas and then document the measures taken to address those risks.  The plan is intended to work in conjunction with the Emergency Action and Spill Control Plan to meet all required criteria.\r\nAll potential employee candidates are interviewed prior to hiring. References may be verified depending on the level of familiarity with the person.\r\n\r\nLiquid Plant personnel have keys to the buildings.  Management controls key distribution.  There is no electronic security system at this location.  All buildings and vehicles are secured during non-business hours.\r\n\r\nThere is one bulk anhydrous ammonia storage tank at the west end of the property in the Liquid Plant.  The tank is surrounded by a fence a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000047611,
      "SummaryText": "nd there is additional lighting.  Tank valves are locked when not in use.  Phosphoric acid is transported to the facility by railcar and staged at the tracks until product is transferred to the liquid fertilizer production area.  A video camera provides additional visibility of the acid car during production.  Inbound railcars are sealed and these seals are inspected as part of the receiving process.  Broken seals would be reported to the railroad.  \r\n\r\nInbound shipments of all products are inspected prior to storage or resale.  Any suspect product would be segregated and investigated.  Outbound shipments of hazardous materials are accompanied by DOT shipping papers and placards, if necessary. Any suspicious product sales or inquiries would be investigated by The Andersons Safety and Security Department and shared with local authorities. \r\n\r\nEmergency procedures have been documented in the attached Emergency Action Plan and have been shared with the local Fire Department and LEPC.  Emergency phone numbers are posted outside the office.  All potential employee candidates are interviewed prior to hiring. References may be verified depending on the level of familiarity with the person.\r\n\r\nTraining is performed with all employees annually and within 90 days of employment."
    }
  ]
}