{
  "FacilityID": 1000023785,
  "FacilityName": "BASF Corporation  -  McIntosh Plant",
  "FacilityStr1": "1379 Ciba Road",
  "FacilityStr2": null,
  "FacilityCity": "McIntosh",
  "FacilityState": "AL",
  "FacilityZipCode": "36553",
  "Facility4DigitZipExt": "0113",
  "FacilityCountyFIPS": "01129",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "31.267617",
  "FacilityLongDecDegs": "-088.000267",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.basf.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1221902,
  "ParentCompanyName": "BASF Corporation",
  "Company2Name": null,
  "CompanyDUNS": 964253439,
  "Company2DUNS": 0,
  "OperatorName": "George L Vann Jr.",
  "OperatorStr1": "1379 Ciba Road",
  "OperatorStr2": null,
  "OperatorCity": "McIntosh",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36553",
  "OperatorZipCodeExt": "0113",
  "FTE": 611,
  "OtherEPAFacilityID": "36653CBGGYGEIGY",
  "EPAFacilityID": "100000089012",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "108-0003-",
  "SafetyInspectionDate": "2011-02-07 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-05-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-11-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-11-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-11-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 31.279,
  "FRS_Long": -87.9955,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029032,
      "AltID": "Additives Area 1",
      "FacilityID": 1000023785,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034740,
          "ProcessID": 1000029032,
          "ChemicalID": 59,
          "Quantity": 80000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000029315,
          "ProcessID": 1000029032,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000025085,
              "Process_NAICS_ID": 1000029315,
              "SafetyReviewDate": "2012-09-25 00:00:00",
              "PHA_Date": "2012-11-26 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "Mechanical Integrity System",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Foam spray system",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Change in cooling medium",
              "OpProceduresReviewDate": "2012-01-20 00:00:00",
              "TrainingReviewDate": "2011-07-26 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-09-17 00:00:00",
              "EquipmentInspectionDate": "2012-07-24 00:00:00",
              "EquipmentTested": "V-09 Phosphorus Trichloride Vent Knockout Tank",
              "ChangeMgmtDate": "2012-09-16 00:00:00",
              "ChangeMgmtReviewDate": "2010-12-01 00:00:00",
              "PreStartupReviewDate": "2012-09-16 00:00:00",
              "ComplianceAuditDate": "2011-02-07 00:00:00",
              "AuditCompletionDate": "2013-03-29 00:00:00",
              "IncidentInvestigationDate": "2012-08-21 00:00:00",
              "InvestigationChangeDate": "2012-11-01 00:00:00",
              "ParticipationPlansReviewDate": "2012-03-01 00:00:00",
              "HotWorkPermitReviewDate": "2012-11-26 00:00:00",
              "ContractorSafetyReviewDate": "2012-04-01 00:00:00",
              "ContractorSafetyEvalDate": "2012-11-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Additives Area 1, Phosphorous Trichloride",
              "_chemicals": [
                {
                  "PrimaryKey": 1000029832,
                  "PreventionProgram3ID": 1000025085,
                  "ProcessChemicalID": 1000034740
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000023785,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2012-05-01 00:00:00",
    "ERTrainingDate": "2012-11-19 00:00:00",
    "CoordinatingAgencyName": "EMA",
    "CoordinatingAgencyPhone": "2518472668",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023785,
      "SummaryText": "This Risk Management Plan (RMP) has been prepared by the BASF Corporation (BASF), McIntosh site to satisfy the requirements of the Clean Air Act Amendments (CAAA) Section 112 (r) mandated by the U.S. Environmental Protection Agency (40 CFR-part 68).\n\n\n\nThe BASF McIntosh site is located at 1379 Ciba road in McIntosh, Washington County, Alabama.  The site occupies approximately 1,500 acres and has approximately 600 BASF and contract employees on site. Production at the McIntosh site began in 1952 with 32 employees manufacturing one product.  Currently, the site produces additives for plastics, paints, and oils, and chemicals used in household products.  \n\n\n\nThe McIntosh site continues to be a leader in safety.  Employees at the site have formed unit safety teams (USTs) which are dedicated to addressing unit safety and environmental issues.  The OSHA VPP Star Designation program requires stringent inspections and an excellent safety and health program.  In 1989, the McIntosh site became the 64th industrial site out of five million in the U.S. to receive the coveted designation.  The site was re-certified as an OSHA VPP Star site in 2009.  The site has also received numerous environmental excellence awards at both the state and local levels.\n\n\n\nThe line of products at McIntosh may vary in response to market demand. A brief description of each production area follows below:\n\n\n\nThe Antioxidants and Metilox Area 1 is designed to produce Irgafos (process stabilizers used primarily as blend components) and Irganox (antioxidants).  In this Area, raw materials and solvents are fed to reactors.  The reaction mass undergoes additional processing steps such as stripping, crystallizing, centrifuging, blending, and drying.  The products are then either packaged dry or transferred to the granulations area.  Solvents used in the process are recovered and reused. \n\n\n\nThe Tinuvins Area 17/18 is designed to produce various additives by diazotizing o-nitroaniline with sodium nitrite in a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023785,
      "SummaryText": "n acidic medium.  The resulting diazonium salt is reacted with one of several substituted phenols.  The intermediate is then separated from the reaction mass and dissolved in a solvent before being reacted with hydrogen in the presence of a catalyst to form the corresponding additive product.  The catalyst is then removed from the reaction mass and the solvents partially stripped off.  The product is finally purified, isolated and dried to the finished form for packaging. \n\n\n\nThe HALS Area 20 is a multi-product batch processing unit that produces a variety of additives that are used in other finished products.  Some of the chemicals produced in Area 20 include light stabilizers, antioxidants, and oil additives. \n\n\n\nThe Energy and Environmental Operations Unit controls all the boilers and utililties, as well as the hydrogen storage and distribution, and wastewater system. \n\n\n\nA waste management facility (Area 15) also exists on site which includes an aboveground wastewater treatment plant (WWTP) that treats sanitary and process wastewater generated at the plant. \n\n\n\nThe RMP-regulated substance at the site in quantity exceeding the threshold planning quantity is phosphorus trichloride.\n\n\n\nAs of September 2012 the shutdown of the Area 8 Stilbenics unit removed previous RMP chemicals ammonia (aqueous and anhydrous) and Oleum.\n\n\n\nThe first key element in the RMP regulations is that a facility must identify all processes that contain any RMP-regulated substances above their designated threshold quantities.\n\n\n\nThe second key element in the RMP regulations, is to determine program levels for the RMP-regulated processes.  These levels range from a Program 1 that imposes minimal requirements on a process to a Program 2 or 3 which require a much greater level of effort.  The McIntosh site is subject to the OSHA Process Safety Management (PSM) standard, 29 CFR 1910.119.  The sites processes are also included in the nine SIC codes specified by the RMP rule.  Therefore, the facil"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000023785,
      "SummaryText": "ity has designated all of its RMP-subject processes to be in the Program 3 level of the RMP.\n\n\n\nThe third key element in the RMP regulations is that Program 3 facilities must conduct an offsite consequence analysis.  BASF opted to use the EPA, RMP Comp because it is more conservative than most commercial models. BASF also used the toxic endpoint concentrations specified in the RMP Comp tool, which represent concentrations below those believed to cause serious health effects after thirty to sixty minutes of exposure. \n\n\n\nA worst-case and an alternative release scenario were considered for the RMP-regulated toxic chemical on site.  The alternative release scenario was based on process knowledge, accident history or the process hazard analysis conducted for the unit.\n\n\n\nOperators are always present during unloading operations of phosphorus trichloride to ensure the safety of the operation. The unloading operation is also monitored by a computer and by control room operator. Should a problem with the unloading occur, the tank trucks are equipped with an emergency cut off valve that can quickly be closed from the front of the truck.  Also, the unloading area is surrounded by a concrete dike that is large enough to hold the contents of an entire truckload of material. This diked area is equipped with a foam spray system that can be used to provide a protective barrier to prevent vapors from a spill from being released to the air. Procedures, training, safety systems and preventive maintenance programs are all in place to prevent spills, but should a spill occur, this unit is well prepared to effectively and safely respond.\n\n\n\nAnother key element of the RMP regulations is to develop and submit a five-year accident history involving RMP-regulated substances.  \n\n\n\nThere have been no accidents or incidents which have any offsite impact or on site injury during the last five years. \n\n\n\nIn order to deal with potential accidents and emergencies, BASF has an Emergency Action and "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000023785,
      "SummaryText": "Response Plan in place.  In addition, there is a written contingency plan for the Area 15 treatment, storage and disposal (TSD) facility.  The contingency plan is part of the RCRA part B permit application.  The BASF site also has its own fire department with its own fire fighters, hazmat team, emergency medical technicians and paramedics in addition to having a fully staffed health services facility with the most modern medical technology available. The BASF hazmat team is utilized by the county for any hazmat incidents. BASF's emergency response coordinator is also the chairman of the Local Emergency Planning Committee.  A community sheltering drill was conducted on November 15, 2012.  A community and industrial park drill was held on May 2, 2012. Access control to the industrial park was conducted.  The McIntosh Industrial Park (MIP) Community Notification System is a series of sirens located around the McIntosh community to alert residents to listen for an emergency message from one of the MIP plants over the Local Interest Safety Network (LISN) system.  The LISN system is a method of providing urgent messages to community residents regarding incidents at MIP plants.  Messages are played by calling 944-LISN.  MIP companies cooperatively manage the MIP Community Notification System.  Each MIP company can activate the community sirens (by phone or computer).  Then they follow established procedures (through the phone to First Call) to send prerecorded voice messages to the LISN system.  In addition, a Ring Down call system is used to automatically send the LISN message to all homes and businesses within a 3 mile radius of the MIP.  There is also a public broadcast AM radio (1610 AM) located in McIntosh that can be used as a tertiary level of community messaging and notification."
    }
  ]
}