{
  "FacilityID": 1000012748,
  "FacilityName": "Coastal Cooling, LLC",
  "FacilityStr1": "11000 Blackie Road",
  "FacilityStr2": null,
  "FacilityCity": "Castroville",
  "FacilityState": "CA",
  "FacilityZipCode": "95012",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.756944",
  "FacilityLongDecDegs": "-121.744722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Coastal Cooling, LLC",
  "OperatorStr1": "11000 Blackie Road",
  "OperatorStr2": null,
  "OperatorCity": "Castroville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95012",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000063414",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-02-26 00:00:00",
  "SafetyInspectionBy": "CUPA/Monterey Co Env Health",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-03-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-03-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-03-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-03-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.756944,
  "FRS_Long": -121.744722,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000015825,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000012748,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000018651,
          "ProcessID": 1000015825,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000016206,
          "ProcessID": 1000015825,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000012990,
              "Process_NAICS_ID": 1000016206,
              "SafetyReviewDate": "2010-03-02 00:00:00",
              "PHA_Date": "2008-02-26 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-12-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ammonia-Water Diffusion",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "PHA 2/26/08 done by prior Operator (Dole).  This re-submission is part of the registration of a new Operator.  New Operator reviewing RMP for further changes, including PHA rec. verifications",
              "OpProceduresReviewDate": "2010-03-02 00:00:00",
              "TrainingReviewDate": "2010-03-02 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-03-02 00:00:00",
              "EquipmentInspectionDate": "2010-03-02 00:00:00",
              "EquipmentTested": "Main System-Prestartup Review",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2010-03-02 00:00:00",
              "PreStartupReviewDate": "2010-03-02 00:00:00",
              "ComplianceAuditDate": "2010-03-02 00:00:00",
              "AuditCompletionDate": "2010-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-03-02 00:00:00",
              "HotWorkPermitReviewDate": "2010-03-02 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2010-03-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000015495,
                  "PreventionProgram3ID": 1000012990,
                  "ProcessChemicalID": 1000018651
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000012748,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-02-24 00:00:00",
    "ERTrainingDate": "2010-02-24 00:00:00",
    "CoordinatingAgencyName": "CUPA/Monterey County Health Dept",
    "CoordinatingAgencyPhone": "8317554511",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Calif. Chapter 6.95 Article 1 Section 25500"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012748,
      "SummaryText": "CAL/ARP RISK MANAGEMENT PLAN LEVEL III\nCOASTAL COOLING, LLC\nRegistration Update and Amendment to Dole Fresh Vegetables RMP/PSM Plan\n\n1\tEXECUTIVE SUMMARY - INTRODUCTION\n1.1\tAccidental Release Prevention and Emergency Response Policies.\n1.2\tGeneral Description of  the Stationary Source And Regulated Substances.\n1.3\tSummary of the General Accidental Release Prevention Program and Chemical-        Specific Prevention Steps\n1.4\tSummary of the Five-Year Accident History.\n1.5\tSummary of the Emergency Response Program.\n1.6\tPlanned Changes To Improve Safety.\n\nINTRODUCTION\n\nThis Executive Summary & associated RMP submission is an update to the existing Program Level 3 Risk and Process Safety Management (RMP/PSM) Plan at the Coastal Cooling site in Castroville, CA.  The prior Operator Dole Fresh Vegetables developed a comprehensive RMP/PSM Plan in March, 2008, but has since terminated operations and site lease agreement.  Coastal Cooling, LLC is updating the Registration and reviewing the existing RMP for changes, as allowed under Section 68.190, Part 68, Title 40, Code of Federal Regulations and Section 25531, CA Health and Safety Code.  California has adopted the Federal RMP Program with additional state-specific requirements; the Program is known as the California Accidental Release Prevention Program or CalARP.  In the Program Level 3 designation, CalARP includes CA Title 8, Section 5189 Process Safety Management as the basis for the Prevention Program component of the Plan. \n\n1.1  Accidental Release Prevention and Emergency Response Policies\n\nThe Coastal Cooling Accidental Release Prevention and Emergency Response Policies are simply not to have accidental releases or emergencies.  The Company endeavors to execute these policies through the daily implementation of its Safety Programs.  Company safety programs include, but are not limited to the Process Safety Management Program (PSM).  The PSM Program is an integrated, holistic approach to the safe operation of processes"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012748,
      "SummaryText": "using Regulated Substances.  The design of the Process in use and the PSM Program are specifically intended to prevent accidental releases, and to deal safely with emergencies if and when they do happen.  It is the primary goal of Coastal Cooling to protect its employees, visitors and neighbors from harm due to Company operations.  With this in mind, the priorities of protection of life, the environment, and then property have been established.   \n\nThe Company also recognizes the need to be prepared for accidental releases that could occur should established prevention programs fail. In addition to a Fire Alarm and Sprinkler System, the siteÂ¿s main ammonia refrigeration process is equipped with an ammonia monitoring, control and alarm system.  The system is supervised on-site and remotely by a third party alarm company.  If and when an ammonia leak is detected, notifications and alarms are triggered.  Our policy is to regularly test and maintain emergency safety systems per our Mechanical Integrity Program, which is intended to ensure proper operation, actuation and function of the refrigeration-related systems and components.  The Plant is also equipped with Ammonia-Water Diffusion Tank Systems (ADT).  The function of an ADT system is to prevent ammonia from venting to atmosphere should a Pressure Relief Valve lift.  \n\nThe Company has adopted a Â¿Non-responding Facility Emergency Response PolicyÂ¿.  The PlantÂ¿s California Hazardous Material Business Plan was developed to be consistent with Emergency Action Plan requirements (i.e. notify and evacuate).  Emergency response pre-planning is coordinated through the local Certified Unified Program Agency (Monterey County Health Department/CUPA). The CUPA inspects the plant and receives copies of the Business Plan updated at regular intervals.  It is our policy to maintain RMP/PSM compliance, a good working relationship with the Monterey County Health Department/CUPA, and other Public Emergency Responders that are part"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012748,
      "SummaryText": "of the Monterey County Emergency Response Mutual Aid Agreement.\n\nCoastal CoolingÂ¿s ammonia refrigeration is supported by its partner company, Western Precooling Systems (WPS).  WPS is a well-known and reputable supplier of portable ammonia refrigeration equipment and services.  WPS has offices and staff in Castroville within two miles of the Coastal Cooling facility.  WPS employs experienced ammonia technicians that are trained beyond 1910.120 Â¿AwarenessÂ¿ level.  WPS supports training and certifications for its technicians via the Refrigerating Engineers and Technicians Association (RETA).  WPS technicians are Â¿on callÂ¿ to the facility 24/7/365.  WPS assists Coastal Cooling with implementation of its RMP/PSM Accidental Release Prevention Program elements, and would serve as a technical resource in an emergency situation.\n\nIt is through these measures, policies and pre-planning that Coastal Cooling endeavors to maintain effective Accidental Release Prevention and Emergency Response.    \n\n1.2  General Description of the Stationary Source and Regulated Substances\n\nCoastal Cooling, LLC is a California Limited Liability Company made up of Western Cooling and Logistics, LLC-50% and Western Precooling Systems-50%.  Coastal Cooling is leasing an existing ammonia refrigeration facility located in Castroville, CA, in a commercial/industrial area on the SE side of the city.  The ammonia refrigeration process was built in 1985 with expansions in 1994 and 1998.  From 1999 to 2006, this facility was registered under the DÂ¿Arrigo Bros. Company.  In December 2006 the facility closed and DÂ¿Arrigo Bros. de-registered from the RMP Program.  In 2008, the facility was re-opened by Dole Fresh Vegetables (Dole).  On-site documentation indicates an RMP re-submission was part of the re-registration of the facility.  The RMP Plan prepared by Snowden Engineering was certified by Dole on 03/18/2008.  Snowden Engineering has a reputation for developing detailed and thorough RMP/PSM Plans"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000012748,
      "SummaryText": ", and the local CUPA was involved in the development of the 2008 RMP/PSM Plan, including involvement in 2008 Process Hazard Analysis (PHA).  Coastal Cooling has notified the local CUPA that it is now leasing the site and has taken responsibility for the Cal/ARP Program.         \n\nThe refrigeration process is used for the cooling and short-term storage of fresh produce.  The facility plans to be open year-around with a busy season from early March through the summer months.  The remaining months may see little fresh product, however the refrigeration equipment is still operative.  Annual refrigeration equipment maintenance is performed during low-season winter months.\n\nThe Regulated Substance in use is anhydrous ammonia (NH3) CAS #7664-41-7, which is used in an inter-connected mechanical refrigeration system.  Refrigeration equipment consists of Pressure Vessels, Compressors, Evaporative Condensers, Evaporators (Room Units), Pressure Cooler Units, Ice-making equipment and associated valves, instrumentation and piping.  Pressure and temperature controls are installed in accordance with appropriate codes & standards, including isolation and overpressure relief valves.  Pressure relief valves are piped to a common header that terminates at an ammonia- water diffusion tank.  Pre-qualified personnel regularly check the refrigeration system. \n\nA portable HydroVacÂ¿ Vacuum Tube closed-loop system is a planned future addition.  Vacuum cooling is used to rapidly remove field heat from certain types of agricultural product; removal of this heat extends product shelf-life.  The Vacuum Tube system and supporting high-side (compression) equipment is portable and may move seasonally depending on market conditions & demand.  This system is to be located away from other refrigeration equipment.  The currently planned portable equipment will contain less than the federal threshold planning quantity of 10,000 lbs. ammonia.\n\n1.3 General Accidental Release Prevention Program and Chemica"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000012748,
      "SummaryText": "l Specific Prevention Steps\n\nAccidental Release Prevention Program\n\nAs noted above a PSM (CCR 8, 5189) Plan has been established within the existing RMP.  The PSM Program is specifically intended to promote the safe operation of the ammonia-handling equipment and process, and to prevent accidental releases.  Coastal Cooling strives to make the PSM Program an integral part of daily Plant operation.  Other safety programs are integrated with the PSM Program, to the extent practicable, appropriate and/or required (such as the California Injury and Illness Prevention Program/IIPP).  \n\nWPS is the company that inspects and performs mechanical maintenance of the ammonia refrigeration equipment.  Schedules and written procedures for the operation and maintenance of ammonia-handling equipment, including the steps to be taken in the event of a release or threatened release, have been developed.  Written procedures include necessary safety precautions for operations, inspection, maintenance, and moving of portable equipment (Hydro-VacÂ¿ Vacuum Tubes).  In addition to existing equipment technical documentation and procedures, WPS also maintains an extensive library of refrigeration equipment technical documentation including written manufacturer reference manuals and technical bulletins.  As maintenance needs are determined, the need is expressed at the workload meetings conducted by the WPS Area Manager.  The specific task for the expressed need is decided by the WPS Area Manager and entered into the WPS work order system. Tasks are then tracked to completion through the work order system.  Through this regular routine of inspect, discuss, assign and confirmation of completion, Coastal Cooling and WPS reduce equipment operational problems and potential for releases.\n\nWPS actively encourages its ammonia technicians to seek Certification through the Refrigerating Engineers and Technicians Association (RETA).  Technicians only perform tasks for which they have been pre-qualified."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000012748,
      "SummaryText": "Chemical-Specific Prevention Steps\n\nIt has become apparent in the industry that a mishap while draining oil from a system was one of the most common ammonia release incidents to occur.  To correct this issue special self-closing valves are installed as a permissive for oil drain flow.  If a release were to develop during the oil-draining task, the mechanic simply releases the handle of the self-closing valve and flow is terminated.  These types of valves are installed at the PlantÂ¿s oil drain points.\n\nOther release prevention steps taken at the Plant:\n\n-New management has acknowledged and is taking ownership of the existing RMP.  The RMP is being evaluated for needed changes (see also #1 INTRODUCTION above).\n-Continue to implement the current Prevention Program and update it as needed.  The current prevention program is equivalent to PSM including Process Safety Information, Process Hazard Analysis, Written Procedures, Training, Mechanical Integrity, Management of Change, Prestartup Safety Review, Employee Participation, Incident Investigation, Compliance Audits, Contractor Safety, and Employee Injury and Illness Prevention.\n-The facility is protected by fencing and gates to limit access by potential Â¿wrong-do-ersÂ¿.\n-A sign-in/sign-out program is vigorously enforced.\n-Employees are trained for ammonia awareness and hazard communication (discovery and communicating) for un-authorized personnel, suspicious activity, fires, releases or other hazardous/suspicious condition.   \n-A strong relationship exists with the local implementing agency (Monterey County Health Department/CUPA).  Coastal Cooling and WPS personnel have worked closely with this CUPA at other locations within its jurisdiction.  \n-Staff is trained in the fire and accident prevention benefits of good housekeeping.  The general appearance of the facility is maintained on a day-to-day basis.\n\n1.4  Five-Year Accident History\n\nThere have been no accidents or releases, there is no data to report\n\n1.5  Em"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000012748,
      "SummaryText": "ergency Response Program\n\nThis plant is engineered to provide for life safety and effective emergency response.  Building space is equipped with fire-alarm stations & fire-sprinklers.  Cold Rooms are equipped with ammonia sensors and associated alarm system.  The refrigeration processÂ¿ Control, Monitoring and Alarm System (described above) includes manual backup systems (kill switches).  Currently, authorized personnel can access critical process system controls via the PlantÂ¿s Electrical Rooms.  This may be enhanced in the future via remote wireless access.  The refrigeration process is equipped with a Fire Department Emergency Control Box and a KNOX BOX has been installed.  The KNOX is to be kept up-to-date via regular communications with the City of Castroville Fire and Police Departments.  Automated systems and safety cut-outs are regularly inspected, tested and maintained at pre-determined intervals. Personnel are experienced in manual discovery, emergency shutdown, evacuation and notification procedures in the highly unlikely event of a failure of the engineered safety and emergency systems.  \n\nThe Plant does not require its employees to participate in conducting emergency response activities under the HAZWOPER standard; a Â¿Non-responding Facility PolicyÂ¿ has been adopted for the Plant as a whole.  In the event of an ammonia emergency, the response is to follow the procedures in the Equipment SOPÂ¿s and the California Hazardous Material Business Plan.  The overall procedure is to shutdown if it can be done safely by qualified personnel, evacuate, and notify the local response agencies and WPS (technical support).  Plant employees are to implement hazard communications, provide for the safety of visitors and report to the established Evacuation Staging Area(s) for a head count.  Emergency response is coordinated with the City of Monterey County Health Department/CUPA and local Fire Department.  Coastal Cooling was verifying that the facility is included in"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000012748,
      "SummaryText": "the Monterey County Area Emergency Plan as of 2/28/10.    \n\n1.6  Planned changes to improve safety\n\nThe primary mechanisms to identify and plan safety improvements include (but are not limited to):\n-Process Hazard Analysis review;\n-Compliance Audits;\n-Routine inspections, tests & maintenance (Mechanical Integrity Program);\n-IIAR Bulletin 109 Inspections (IIAR Minimum Safety Criteria For The Safe Operation Of Ammonia Refrigeration Process);\n-Coastal Cooling and WPS Internal Inspection Protocols\n\nThe Programs above may result in recommendations ranging from capital improvements to routine maintenance of the plant.  Work Orders are established in parallel to identified needs.  Current planned changes to improve safety include:\n\n-An updated and documented RMP Management System has been developed and acknowledged by Coastal Cooling Management.\n-An administrative RMP/PSM Compliance Audit was performed in late February & reviewed with Coastal Cooling Management March 2, 2010.  The Review included the existing RMP/PSM Plan; with emphasis on the PHA recommendations resulting from the PHA conducted by the prior Operator February 26, 2008.\n-Repair and re-deploy the PlantÂ¿s CCTV System.\n-Complete a Pre-startup Safety Review  03/02/2009\n-Complete an updated IIAR Bulletin 109 Inspection\n-Revise the RMP/PSM document as needed to reflect Coastal Coolings policies, procedures and practices. \n\nThese items are to be executed according to the schedule set by Coastal Cooling Management."
    }
  ]
}