{
  "FacilityID": 1000084117,
  "FacilityName": "City Of Coalinga WTP",
  "FacilityStr1": "25034 W Palmer Ave",
  "FacilityStr2": null,
  "FacilityCity": "Coalinga",
  "FacilityState": "CA",
  "FacilityZipCode": "93210",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.210000",
  "FacilityLongDecDegs": "-120.248889",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 30999361,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Coalinga",
  "OperatorStr1": "155 W Durian",
  "OperatorStr2": null,
  "OperatorCity": "Coalinga",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93210",
  "OperatorZipCodeExt": null,
  "RMPContact": "Sean Brewer",
  "RMPTitle": "Director, Public Works & Utilities",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000243275",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-10-24 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105063,
      "AltID": "Disinfection of Potable W",
      "FacilityID": 1000084117,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000106396,
          "ProcessID": 1000105063,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131538,
          "ProcessID": 1000105063,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000631538,
          "ProcessID": 1000105063,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084117,
      "SummaryText": "The City of Coalinga (City) has instituted a Risk Management Program for its water treatment plant as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68. The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substance (RS), chlorine, handled at this facility above Federal threshold quantities. It describes the structured assessment of hazards conducted to assess possible effects on employees and offsite public and environmental receptors and provides the results of an offsite consequences analysis. It defines a prevention program, emergency response program, and mitigation measures to reduce the RS's probability and magnitude of accidental releases. Finally, it establishes a schedule and responsibilities to implement mitigation measures and auditing of program elements. \n\n\n\nThis Risk Management Program (RMP) is being filed as required by ARP regulations to report the newly developed Risk Management Program prevention elements and to describe further measures planned to mitigate or prevent accidental releases of RS's. This filing provides the required information for its initial submission of both the Federal and California ARP programs. \n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED \n\n\n\nThe City of Coalinga provides water supply and distribution to the City as well as state hospital and prison facilities. Its water supply facility is located at 25034 W. Palmer Ave., Coalinga, CA, in Fresno County. It uses chlorine for disinfection in quantities greater than the Federal threshold quantity for this RS. The facility is located on the west bank of the Coalinga Canal in agricultural land area. There are six full-time and two part-time employees at this site. Chlorine is received in ton containers by truck, handled with an electric hoist, and stored on ton container scales and trunion sets inside the building. The chlorine is used to partially dis"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084117,
      "SummaryText": "infect the water pumped from the canal. \n\nPressurized chlorine gas within a ton container is reduced to vacuum at a vacuum regulator valve mounted directly onto the ton container's gas valve. The chlorine under vacuum is metered through rate valves and rotameters and drawn into water solution by the vacuum created from the passage of pressurized water through an injector. It becomes dilute hypochlorous acid at this point and is no longer acutely hazardous.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \n\n\n\nThe City's policy is that the receipt, storage and handling of chlorine gas is done in a manner that meets regulatory requirements and minimizes the probability and severity of releases of chlorine into the atmosphere to protect the health and safety of its workers, the public, and the environment. To accomplish this goal, the City has gathered safety information on chlorine and on the process equipment and procedures involving chlorine.  The City performed a structured assessment of the process's hazards and external events that might affect the process. An offsite consequences analysis defined the limit of release scenarios. It established a chlorine specific written emergency action program coordinated it with emergency response agencies. \n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS \n\n\n\nGeneral accidental release prevention programs instituted by the City are categorized as administrative (management) programs; procedures, training, and engineering controls; and emergency response programs.  The City has created a Process Safety Management (PSM) Program meeting Federal and State requirements at 29 CFR 1910.119 (GISO 5189), covering its gas chlorine disinfection process. This program constitutes the general accidental release prevention program for the City's water treatment plant operations. The program and document management procedures included in the PSM Program are used as the Risk Management Program management system. \n\n\n\nCHEMICAL-S"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084117,
      "SummaryText": "PECIFIC RELEASE PREVENTION STEPS \n\n\n\nRelease prevention steps specific to chlorine have been identified and implemented. These include, among other things, the creation of numerous facility-specific procedures, and trained facility personnel \n\n\n\nFIVE YEAR ACCIDENT HISTORY \n\n\n\nThere have been no accidents involving chlorine at this facility within the past five years resulting in injuries or offsite consequences. \n\n\n\nEMERGENCY RESPONSE PROGRAM \n\n\n\nThe City's Emergency Response Program applicable to chlorine has been coordinated with the Fresno County Department of Environmental Health, the local agency responsible for hazardous materials inventory reporting and release response coordination.  Water treatment personnel are not trained in emergency response for chlorine and will rely on Fresno County's hazmat teams (Fresno and Clovis fire) to provide support if needed. \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY \n\n\n\nAll of the improvements and mitigation measures identified in the process hazard analysis which  The City has committed to accomplish have been completed or are in progress. Any other measures identified by employees during workplace hazard surveys or as a result of audit activities will be thoroughly reviewed and considered for implementation.\n\n"
    }
  ]
}