{
  "FacilityID": 1000042139,
  "FacilityName": "Associated Wholesale Grocers, Inc.",
  "FacilityStr1": "3201 E. Division St",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "MO",
  "FacilityZipCode": "65802",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29077",
  "LEPC": "Greene County LEPC",
  "FacilityLatDecDegs": "37.225998",
  "FacilityLongDecDegs": "-093.229629",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6943062,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Associated Wholesale Grocers Inc.",
  "OperatorStr1": "3201 E. Division St",
  "OperatorStr2": null,
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "65802",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eric Hill",
  "RMPTitle": "Safety/Risk ManagementManager",
  "FTE": 500,
  "OtherEPAFacilityID": "MOD006865935",
  "EPAFacilityID": "100000093347",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-08-13 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-08-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.22425,
  "FRS_Long": -93.22978,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051917,
      "AltID": "Ammonia refrigeration sys",
      "FacilityID": 1000042139,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000052526,
          "ProcessID": 1000051917,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062983,
          "ProcessID": 1000051917,
          "ChemicalID": 56,
          "Quantity": 18824.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000562983,
          "ProcessID": 1000051917,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042139,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis Risk Management Program is designed to comply with the Environmental Protection Agency regulations detailed in 40 CFR Part 68.  The stationary source is the Associated Wholesale Grocers distribution center located at 3201 E. Division Street, Springfield, MO.  The site is owned by Associated Wholesale Grocers. The only RMP regulated substance at this facility is anhydrous ammonia--which is classified as a toxic substance, liquefied under pressure. \n\nThis is a RMP Update for an existing cold storage warehouse. \n\nThe refrigeration systems were originally designed to have an inventory of approximately 27,290 pounds of anhydrous ammonia. This process does not meet the requirements of Program 1. It is subject to OSHA's PSM standard.  Therefore, this RMP is written to meet the EPA Program 3 level of compliance.\n\nThe quantity of ammonia in the refrigeration system has been systematically reduced by routine maintenance processes, IE purging non condensables, oil pot draining, strainer cleaning, valve maintenance etc. Each reduction of ammonia has been calculated and accounted for both monthly and yearly. No process or maintenance on the ammonia refrigeration system has resulted in greater than 100 pounds reduction. We currently have 18,594 pounds as per pumped down inventory (IIAR method 3) calculations by UF ammonia Services, Inc.\n\nACCIDENTAL RELEASE PREVENTION POLICY\n\nThis facility follows a rigorous fourteen volume Process Safety Management Program to prevent the accidental release of ammonia. The PSM program is in compliance with Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of 29 CFR 1910.119. Employees and management participate and cooperate in the PSM program to maintain a work environment that is safe to employees, the community, and the environment.\n\nEMERGENCY RESPONSE POLICY\n\nThe facility has a comprehensive emergency response plan that meets established criteria. The plan is being provided to the loc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042139,
      "SummaryText": "al LEPC for review.\n\nPROCESS OVERVIEW \n\nThis food distribution facility operates a 1985 Engine Room, built in 1985 and a 1992 Engine Room.  Both Engine Rooms are interconnected. The refrigeration system is a liquid re-circulation system and is designed to operate at with overfeed ratio of approximately 3:1 for all evaporators. Anhydrous ammonia (R-717) refrigerant is a Group II refrigerant. Rotary screw compressors are used in this refrigeration system.\n\n\n\n\n\nThe refrigeration system in the 1985 Engine Room contains the following equipment and sub-systems:\n\n1. FES duplex package consisting of 2 Mycom compressors. Number 1 is a single stage compressor configured to run at 3.5 pounds suction or -20 degree Fahrenheit. Number 2 is also a single stage compressor and is configured as a swing machine to run at 3.5 pounds or -2 inches HG for the Ice Cream Holding Freezer.\n\n2.  Compressor 3 is a FES single compressor and is also a swing machine that can be configured to operate at 3.5 pounds or -2 inches and is normally set to operate for Ice Cream storage at -20 degrees Fahrenheit.\n\n3. Compressor 7 is a FES package with a single compressor single stage and is a swing compressor. It can be configured to operate at 3.5 (-20 degrees Fahrenheit) pound suction or 15 pounds suction (26 degree Fahrenheit) to assist compressor 5 or 6 in the 1992 engine Room.\n\n4. There are 2 Evaporative Condensers on the roof of the 1985 engine Room and their rated capacity at (95?F C.T. 78?F Wet Bulb Temperature) 398 and 214 tons heat rejection. \n\n5. There is a high pressure receiver in the 1985 Engine Room which receives condensed liquid from the evaporative condensers above the 1985 Engine room.\n\n6. There is a Mueller Plate & Frame de-super heater which warms glycol that is pumped under the freezer floor to prevent soil freezing and floor heaving.\n\nThe refrigeration system in the 1992 Engine Room contains the following equipment and sub-systems.\n\n1. Compressor 4 is a FES Booster and is configured "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042139,
      "SummaryText": "to operate at 3.5 pounds suction. This compressor and others, mentioned above, operate for the -40 degree F holding freezers. The discharge of number four is released to the suction of high side compressors 5 or 6.\n\n2. Compressors 5 & 6 are high side or 26 pound suction machines and one or the other operates to provide suction to the cooler evaporators.\n\n3. The 1992 Engine room contains both the 3.5 pound or low side recirculator and the 26 pound or high side recirculators. The low side has 2 liquid ammonia pumps that operate 1 a primary and auxiliary at 40 PSI to supply liquid to the freezer evaporators & the Ice Cream surge drum. The high side recirculator contains 2 pumps that supply 70 PSI liquid ammonia to the cooler evaporators. \n\n4. The 1992 Evaporative Condenser is positioned above the 1992 Engine Room and condenses ammonia gas to liquid which is stored in the 1992 high pressure receiver, also on the roof.\n\n5. The 1992 Engine Room houses a de-super heater for warming glycol which is pumped under freezer floor to prevent soil freezing and floor heating in the below freezing 1992 freezers.\n\n6. The 1992 Engine Room has the non-condensable gas purger to all 3 Evaporative condensers.\n\n\n\nMITIGATION MEASURES\n\nThere are some mitigating measures in place. The location of the ammonia vessels is inside the engine room. Although there are doors and windows, the overall enclosure acts as a dike creating liquid pooling and limiting the liquid run-off. Ammonia leak detection is installed in this area that sounds audible and strobe alarms and starts emergency ventilation. The emergency ventilation is automatically controlled and discharges the engine room air and creates a lower level of concentration in the engine room for responders. It also starts air dispersion at lower concentration levels and disperses the ammonia with greater air turbulence.\n\nACCIDENT PREVENTION PROGRAM\n\nThis facility follows the OSHA Process Safety Management Program. Various special elements have b"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000042139,
      "SummaryText": "een incorporated into this program to meet the additional EPA requirements for the RMP. Following is an overview.\n\nParticipation - The Participation Program is an asset to both employees at the site and to the community as a whole.  As a general rule, employees who are fully involved have a greater sense of responsibility; they are more likely to catch the problems that can cause accidents. Employee awareness is for employees, not directly involved with the process, this includes knowing the hazards, the safety rules, warning signs, and evacuation procedures. All employees have access to the PSM Program. There are no AWG hourly employees involved in operation or maintenance of the refrigeration system. Employees do participate directly in a rolling or continuous PHA alongside The Hazardous Materials Response Team.\n\nCommunity involvement is through coordination and cooperation with the local Fire department and Local Emergency Planning Commission (LEPC).\n\nProcess Safety Information - Process Safety Information includes a wide variety of books, manuals, and process information. These are available to persons that operate, maintain, or repair the process equipment or piping. There are three major categories of information: ammonia data such as MSDS, safety information, first aid, chemical properties, IIAR safety bulletins, etc.; process information such as piping & instrumentation diagrams (P&ID's), block flow diagram, mass flow balance, design codes and standards, pressure safety relief settings, safety system/devices, ventilation system design, operating procedures, safe operating limits, and ramification of process deviation; and process equipment information such as equipment specifications, electrical classifications, materials of construction, installation manuals, operating and maintenance manuals, and manufacturer's manuals.\n\nProcess Hazard Analysis - A Process Hazard Analysis (PHA) was completed using the \"What-if\" technique.  This addressed hazards, engineeri"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000042139,
      "SummaryText": "ng and administrative controls, consequences of failure of engineering and administrative controls, facility siting, human factors, and a qualitative evaluation of the possible safety and health impact. The results of the PHA are prioritized and incorporated into follow up processes and steps to correct are installed into the CMMS correction process, sometime requiring capital money to be requested or allocated and all follow through takes place.\n\nStandard Operating Procedures - SOPs are provided for each compressor, condenser, ammonia vessel and oil pot, and evaporator. Topics include general information such items as objectives, hazards, location, equipment needed, P&ID's, task flow diagrams, and step-by-step procedures with specific warnings and comments. The SOPs cover different phases of operations such as: initial startup; normal, temporary and emergency operations; emergency shutdowns; and startup following a shutdown.\n\nTraining - There are no hourly employees are involved with anhydrous ammonia process but they have been properly trained, at a minimum, in understanding the MSDS, evacuation,  emergency and normal ammonia  safety practices, and, if appropriate, the individual's role in the emergency response plan.\n\nContractors - This site follows strict guidelines for qualifying contractors who directly influence the safety of the process or the system. The contractor qualification procedure ensures that contractors and their employees are fully aware of the potential dangers involved with the ammonia process, that contractors understand their responsibility and train their people, and that a contractor's safety record is considered in reviewing the bids. \n\nPre-Startup Review - Pre-startup safety reviews are required on all new or modified equipment/systems. This involves process safety information, process hazard analysis, training, safety procedures, operating procedures, and verification that construction and equipment are in accord with the design specific"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000042139,
      "SummaryText": "ations.\n\nMechanical Integrity Audits - The purpose of the Mechanical Integrity Audit program is to ensure that the equipment is maintained in good working condition.  These are performed on all compressors, condensers, evaporators, pressure vessels, piping system, and relief and vent systems and devices, emergency shutdown systems, controls, and pumps.\n\nHot Work Permits - This permit process is to protect against fire, explosion and other dangers resulting from hot work (welding and cutting outside the designated areas).  Hot work permits must be obtained before any work is done outside the shop area. The Maintenance Supervisor reviews and issues the permits to insure all fire prevention and protection rules are met. Permits indicate the appropriate dates and the work to be done. The permits are kept on file until workers have completed the hot work operations.\n\nManagement of Change - The Management of Change (MOC) procedure requires that all changes (even \"replacement in kind\") be reviewed to see if there is a possible negative effect. The MOC review addresses the technical basis for the change, the impact on safety and health, modifications to operating procedures, and authorization requirements for the proposed change.  Employees affected by the change are informed of the change before startup and trained in the proper procedures.\n\n\n\n\n\n\n\nIncident Investigation - An incident investigation shall be performed any time there is an incident which resulted in, or which could reasonably have resulted in, a catastrophic release of ammonia. The purpose is to gain information that could prevent further accidents and to identify weaknesses in the emergency response plan that need to be addressed. Investigations are initiated promptly using a trained team. The findings and recommendations will be studied and appropriate corrective action taken.\n\nEmergency Response Plan - This facility has a comprehensive emergency response plan that meets established criteria.  This plan wil"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000042139,
      "SummaryText": "l be provided to the local fire department and the Local Emergency Planning Committee (LEPC).\n\nCompliance Audits and RMP Revisions - To insure that all the other 12 areas of PSM program are followed, the company requires compliance audits.  At a minimum, these must be completed every three years. Resubmission of the RMP shall be done according to Section 6.2 to meet the OCA requirements.\n\nACCIDENT HISTORY - LAST FIVE YEARS\n\nThere have not been any RMP reportable accidents within the past five years.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAssociated Wholesale Grocers, Inc. (AWG) has installed ammonia alarm systems inside the facility for all areas that have the potential for ammonia release.  These alarms are both audible and visual that will afford better response time and the safety of personnel in case of an emergency.\n\nAWG has removed all ammonia valves from inside the building and installed all valves on the roof of the building.\n\nAWG has installed additional tempered drench hose stations along the parameter of the freezers and coolers.\n\nAWG has removed the conventional hard defrost stations form the 1985 evaporator controls and has installed soft defrost controls.\n\nAWG has installed pass code protected offsite computerized controls that can be utilized to operate the Engine Rooms from a remote location via the Internet.\n\nAWG has conducted a comprehensive non destructive examination of all refrigeration vessels and piping system. All pipe or vessels that were at or greater than 24% wall thickness have been removed or replaced.\n\n"
    }
  ]
}