{
  "FacilityID": 1000000184,
  "FacilityName": "Lake Linganore Water Treatment Plant",
  "FacilityStr1": "Eagle Head Drive",
  "FacilityStr2": "Quinn Road @ the Lake Linganore Dam",
  "FacilityCity": "New Market",
  "FacilityState": "MD",
  "FacilityZipCode": "21774",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24021",
  "LEPC": "Frederick County LEPC",
  "FacilityLatDecDegs": "39.249160",
  "FacilityLongDecDegs": "-077.196460",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.co.frederick.md.us/Water_Sewer",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Frederick CountyBoard of County Commissioners",
  "Company2Name": "Frederick County DUSWM",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Fredrick County DUSWM",
  "OperatorStr1": "4520 Metropolitan Court",
  "OperatorStr2": null,
  "OperatorCity": "Frederick",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21704",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000041055",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-05-22 00:00:00",
  "SafetyInspectionBy": "Frederick County DFRS",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-05-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-05-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-11-05 00:00:00",
  "DeRegistrationEffectiveDate": "2013-10-01 00:00:00",
  "AnniversaryDate": "2014-05-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.411944,
  "FRS_Long": -77.328333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "15.2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000207,
      "AltID": "Water Supply & Irrigation",
      "FacilityID": 1000000184,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000210,
          "ProcessID": 1000000207,
          "ChemicalID": 62,
          "Quantity": 2000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000000234,
          "ProcessID": 1000000207,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000000181,
              "Process_NAICS_ID": 1000000234,
              "SafetyReviewDate": "2009-02-04 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-02-04 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-01-02 00:00:00",
              "TrainingReviewDate": "2009-01-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Training is ongoing throughout the year with the Division's OJT and POST training process.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Mentoring",
              "MaintenanceReviewDate": "2008-10-16 00:00:00",
              "EquipmentInspectionDate": "2008-10-16 00:00:00",
              "EquipmentTested": "Chlorine Sensors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2008-08-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2008-05-01 00:00:00",
              "AuditCompletionDate": "2008-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-03-18 00:00:00",
              "HotWorkPermitReviewDate": "2008-05-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000000185,
                  "PreventionProgram3ID": 1000000181,
                  "ProcessChemicalID": 1000000210
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000000184,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-02-04 00:00:00",
    "ERTrainingDate": "2009-04-07 00:00:00",
    "CoordinatingAgencyName": "Freereick  County DFRS",
    "CoordinatingAgencyPhone": "3016002073",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000184,
      "SummaryText": "FREDERICK COUNTY DIVISION OF UTILITIES & SOLID WASTE MANAGEMENT\nLAKE LINGANORE WATER TREATMENT FACILITY \nEAGLEHEAD DRIVE, NEW MARKET, MARYLAND   21774\nFACILITY ID # 1000 0004 1055\n\nSECTION I\t\n\nFrederick County Division of Utilities & Solid Waste Management (DUSWM) owns and operates several Water and Wastewater treatment facilities in Frederick County Maryland.  This RMP covers facility #1000 0004 1055 (Lake Linganore Water Treatment Plant).  Please note this facility has no street number for this facility address.  This facility is the second largest WTP owned and operated by Frederick County.\n\nThis facility is now only used for emergency water supply.  Even though this facility is not operated daily distribution and operation staff routinely checks this facility.  In late 2007 Frederick County completed water line extensions from its New Design Road WTP and in January 2008 this facility was stopped daily water production.  The Lake Linganore WTP is now operated one day a month with its water being re-circulated.  Residential and commercial customers are now being served by the New Design Road WTP and are included in the summary for that facility.  \n\nAt this time there are +/- 2000 pounds of Chlorine at this facility.  Plans are to lower that amount even further.  The division is also evaluating the use of alternatives to using gas chlorine for disinfection.  There are no other hazardous chemicals used or stored at or above reportable quantities at this facility.  There has never been a release of Chlorine at this facility.  This is one (1) of two (2) DUSWM facilities required to submit RMP data; therefore, much of the data contained in this report is duplicated or similar for both facilities.\n\nFrederick County insurance carriers make site inspections of DUSWM facilities including the Lake Linganore WTP.  These inspections include a review of policies, procedures, training programs, environmental permits, contingency and emergency plans, and Tire II inventories.  As"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000184,
      "SummaryText": "a result of the last audit Frederick County Division of Fire and Rescue conducted a Hazardous Materials Pre-Emergency Response Plan on May 22, 2007.  \n\n\nSECTION II & III\n\nBoth Release scenarios used in this RMP use a single ton container of chlorine.  With the policies, procedures, current equipment including the chlorine scrubber system, and the safety record of this facility, it is believed that this is the largest amount of chlorine that would be released in a single incident.  \n\nThe first scenario in this RMP is a chlorine gas release that takes place over a 10 Minute period of time.  This time is the estimated time that it would take the sensors on the scrubber system to activate and alarm, personnel to respond with appropriate PPE and equipment and then begin a valve or line repair, or seal the container.  It should be noted that this facility uses vacuum regulators and in the unlikely event that a line were to break the chlorine feed system would lose vacuum and the system would shut down thus no chlorine leak through a line break.\n \nThe second scenario is a rupture of a fusible plug (relief valve with the total contents of the container empting in eight (8) minutes.  \n\n\nSECTION IV & V\n\nFrederick County DUSWM does not use or store flammable chemicals/materials subject to RMP reporting requirements, therefore there are no scenarios submitted for flammable materials.\n\n\nSECTION VI\t\n\nThe Lake Linganore WTP has an excellent safety record.  No accidental releases of chlorine have occurred in the 20 plus years of operation. \n\n\nSECTION VII & VIII\n\nWhat-if & What-if/Checklists were used to update the PHA for this facility.  Review of the facility specific SOPÂ¿s and Division policies and procedures are conducted annually.\n\nBecause of the critical nature of water supply, Frederick County DUSWM has built redundancy into many of its most critical processes.  This redundancy includes dual power and generators for power failure incidences, duplicate pumps, controls, and s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000184,
      "SummaryText": "Bloodborne Pathogens\nFirst Aid, CPR & AED\nAtmospheric Testing & Respiratory Protection\nConfined Space Entry\nSafe Lifting\nFork Lift Operation and Safety\nDefensive Driving\nHeat Stress\n\nAll Division personnel have also taken the Incident Management course ICS 100 through FEMAs Web based training.  \n\nReview of all policies is an ongoing throughout the year.  Formal review of policies takes place once a year.  Informal review for RMP takes place annual as well.  An on-the-job training program using both job performance checklists as well as POST training is used for employee evaluation.\n\nContractors hired to work on projects must demonstrate that their personnel are competent to work in confined spaces, have atmospheric testing equipment that is properly calibrated and maintained, have respiratory protection and comply with other County and division safety policies.\n\nThe Division has an active Safety Committee.  This committee inspects DUSWM facilities on a periodic basis and also assists in policy review.\n\nThe Division also has a Computerized Maintenance Management System (CMMS) for tracking equipment, repairs (emergency as well as routine), preventive maintenance tasks, and calibration.  This system also tracks resources (man-hours, parts, and equipment).  \n\n\nSECTION IX\n\nThe Division is a Frederick County agency that works closely with other County agencies to maintain its Emergency Response preparedness. The Division recently worked with these agencies to prepare the CountyÂ¿s Man Made Hazards plan.  COOP (Continuity of Operations Plan) plans have been completed along with all accompanying documents and annexes.   All Division staff have completed ICS 100 with some staff completing other Emergency \nManagement IC classes.  Emergency Response Plans for the Division include notification, evacuation and accountability requirements as well as health and safety instructions that are to be used in the event of a release.  Each facility location is required to maintain sit"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000184,
      "SummaryText": "e specific SOPs for facility shutdown, evacuation, staff notification, and accountability.  The DivisionÂ¿ ERP (Emergency Response Plan) contains a rotational on-call supervisors.  This list included home phone numbers, pager numbers, and cell phone numbers.  Each on-call supervisor has a two-way radio for communication as well.  The DivisionÂ¿s radios have interoperability allowing staff to contact other county agencies including Frederick County ECC (Emergency Communication Center), highway department and other agencies that might be needed during emergencies.\n\nCopies of any and all policies, plans, procedures and maintenance records are available for review.\n\n\nCERTIFICATION \n\nTo the best of my knowledge, information and belief formed after reasonable inquiry, the information submitted is true, accurate and complete."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000184,
      "SummaryText": "ensors of other equipment.  Audible and visual alarms and procedures are in place for routine and emergency process control.  Automatic controls and shutoffs are equipped with manual backups in the event of power failure or other emergencies that may cause equipment control failure.  This facility is also monitored by a SCADA (Supervisor Control And Data Acquisition) System.  The system is monitored at the DivisionÂ¿s Maintenance shop, with plans to add another monitoring station at the DivisionÂ¿s Administration building in the very near future.\n\nChlorine container and chlorine feed is located in a room separate from the administration, laboratory, and administration and process areas.  The Chlorine storage area is not ventilated to the outside atmosphere.  Chlorine detectors are stationed at critical areas and connected to audible and visual alarms.  This system and its sensors are tested routinely in accordance with established manufacture protocols.\n\nStandard Operating Procedures are continually reviewed and revised as necessary.  All policies and procedures are reviewed annually as well as for this RMP.  Frederick County DUSWM has an extensive Occupational Health & Safety Program.  This program has set the bench mark for many other safety committees and programs within other Frederick County divisions and departments.  Policies and plans are in place and training takes place throughout the year.  The Division uses a POST (Periodic Occupational Safety Training) training concept.  Training is repeated monthly with the day of training changing so as to get all employees trained no matter what their shift is.  Currently training and plans/policies include the following:\n \nPPE (Personal Protective Equipment)\nHazard Communications (RTK Â¿ Right to Know)\nEmergency Action \nLock-Down & Shelter In Place\nFire Prevention & Fire Extinguisher Use\nLOTO (Lock Out Tag Out)\nChlorine safety/Chlorine Repair Kit Â¿AÂ¿ & Â¿BÂ¿\nEmergency response to Chlorine & Sulfur Dioxide Releases"
    }
  ]
}