{
  "FacilityID": 1000037596,
  "FacilityName": "Ingevity South Carolina, LLC, Chas. Chem. Plant",
  "FacilityStr1": "5598 Virginia Avenue",
  "FacilityStr2": null,
  "FacilityCity": "N. Charleston",
  "FacilityState": "SC",
  "FacilityZipCode": "29406",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45019",
  "LEPC": "Charleston County LEPC",
  "FacilityLatDecDegs": "32.897222",
  "FacilityLongDecDegs": "-079.969722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ingevity.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 830976291,
  "ParentCompanyName": "Ingevity Corporation",
  "Company2Name": null,
  "CompanyDUNS": 79929405,
  "Company2DUNS": null,
  "OperatorName": "Ingevity Corporation",
  "OperatorStr1": "5525 Virginia Avenue",
  "OperatorStr2": null,
  "OperatorCity": "North Charleston",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29406",
  "OperatorZipCodeExt": null,
  "FTE": 190,
  "OtherEPAFacilityID": "29411WSTVC5600A",
  "EPAFacilityID": "100000103988",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "TV-0560-0164",
  "SafetyInspectionDate": "2012-09-24 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-12-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-11-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-11-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-11-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 32.8995,
  "FRS_Long": -79.9667,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000046124,
      "AltID": "Formaldehyde (solution)",
      "FacilityID": 1000037596,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000055788,
          "ProcessID": 1000046124,
          "ChemicalID": 1,
          "Quantity": 270000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000046526,
          "ProcessID": 1000046124,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000040156,
              "Process_NAICS_ID": 1000046526,
              "SafetyReviewDate": "2013-05-23 00:00:00",
              "PHA_Date": "2013-11-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-11-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-10-11 00:00:00",
              "TrainingReviewDate": "2012-03-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-06-27 00:00:00",
              "EquipmentInspectionDate": "2013-10-27 00:00:00",
              "EquipmentTested": "Mechanical preventive maintenance on formalin scrubber",
              "ChangeMgmtDate": "2013-08-30 00:00:00",
              "ChangeMgmtReviewDate": "2013-09-12 00:00:00",
              "PreStartupReviewDate": "2013-09-09 00:00:00",
              "ComplianceAuditDate": "2012-01-27 00:00:00",
              "AuditCompletionDate": "2012-11-05 00:00:00",
              "IncidentInvestigationDate": "2013-04-16 00:00:00",
              "InvestigationChangeDate": "2013-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2013-11-19 00:00:00",
              "HotWorkPermitReviewDate": "2013-10-29 00:00:00",
              "ContractorSafetyReviewDate": "2012-08-06 00:00:00",
              "ContractorSafetyEvalDate": "2013-01-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000047660,
                  "PreventionProgram3ID": 1000040156,
                  "ProcessChemicalID": 1000055788
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000037596,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-07-01 00:00:00",
    "ERTrainingDate": "2012-06-01 00:00:00",
    "CoordinatingAgencyName": "North Charleston Fire Department",
    "CoordinatingAgencyPhone": "8437402616",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000037596,
      "SummaryText": "Ingevity owns and operates a specialty chemicals manufacturing facility in North Charleston, South Carolina which is subject to U.S. EPA regulations governing Accidental Release Prevention (ARP) Requirements: Risk Management Programs under Section 112(R) of the Clean Air Act (40 CFR Part 68).  This Risk Management Plan (RMP) has been developed in accordance with the requirements specified under 40 CFR Part 68, Subpart G.  The RMP certifies that Ingevity has instituted a Risk Management Program at the North Charleston, South Carolina facility that is in compliance with U.S. EPA ARP requirements. \r\n\r\nThe RMP includes an Executive Summary and Data Elements following the format published by U.S. EPA.  In addition to identifying the applicable corporate policies and risk management systems, including comprehensive accident prevention and emergency response programs, this RMP document identifies the worst case release scenario, alternate release scenario, and the facility's five year accidental release history. \r\n\r\n\r\n1.0   INGEVITY ACCIDENTAL RELEASE AND EMERGENCY RESPONSE POLICIES\r\n\r\n1.1 Control of Hazardous Materials\r\n\r\nIngevity strives to conduct its business in strict conformity with all applicable \r\nlaws and in a safe and responsible manner.  Ingevity has always placed the very \r\nhighest priority on the safety and health of its employees and members of the \r\ncommunities in which it operates.\r\n\r\nThis policy applies to the North Charleston, SC facility and to each location of \r\nIngevity and its subsidiaries and to all materials which may be hazardous to health \r\nand/or the environment, whether solid, liquid or gaseous.\r\n\r\nIt is the responsibility of the Ingevity CEO and to those to whom he delegates to ensure that each\r\nlocation is in full compliance with the provisions of this policy.\r\n\r\nManagement at each company facility, by utilizing effective process safety management, \r\nis knowledgeable on a current basis as to materials which are present and aware of the \r\npossi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000037596,
      "SummaryText": "ble risk associated with their handling, storage, use, discharge, spill, disposal, or \r\nrelease.  Safety Data Sheets (SDS) are maintained as required and reviewed. \r\n\r\nIngevity facilities are designed, constructed, inspected, maintained and operated in \r\na manner so as to minimize the risk of exposure to employees and the public at large to \r\nhazardous materials and in conformity with all governmental regulations and corporate \r\nguidelines.  Each facility maintains inspection records, up-to-date procedures and \r\nchecklists to ensure that the control of hazardous materials is maintained at all times.  The \r\nprocedures and checklists include provisions for the periodic testing, review, and update \r\nof the emergency response programs.  Changes in protective technology are monitored, \r\nand when found to be more effective, the need for change is promptly considered.  In \r\naddition, at a minimum of every three years, each affected facility undergoes a \r\ncomprehensive process safety management compliance review.\r\n\r\nThe functions of environmental protection, property conservation and safety and health \r\nare coordinated at each facility so that the most effective and practical protection of \r\nemployees, public and environment from hazardous materials is achieved and regulatory \r\nreporting requirements are met.\r\n\r\nAll employees are trained and periodically retrained in a manner appropriate to their \r\npossible exposure to materials which are considered hazardous.  This training includes \r\nmethods of detection of the presence or release of hazardous materials, the physical and \r\nhealth hazards of the materials, and methods for protecting themselves, co-workers, and \r\nthe public.  The information provided by SDSs is reviewed with employees on a \r\ncurrent basis.\r\n\r\nEach location coordinates its safety and emergency response program with local \r\ncommunity emergency response officials to ensure safe, effective, and swift response to \r\nemergencies in the workplace.  This process inc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000037596,
      "SummaryText": "ludes forthrightly disclosing to the \r\ncommunity, through its emergency response officials, facts regarding the hazards and \r\nrisks in operating the facilities, the prevention techniques in place, and assistance in \r\ndevising the most appropriate and effective protection plans for the community and the \r\nplant.\r\n\r\nEach location promptly investigates, corrects, and reports in writing all incidents \r\ninvolving hazardous materials having caused, or having the potential for causing, injury \r\nor loss.\r\n\r\nClear understanding and careful observance of this policy throughout the organization is \r\nof great importance to Ingevity, its employees, and the public.  While line \r\nmanagement has the primary responsibility for providing safe conditions and for creating \r\na climate in which the whole organization shares in the concern for both employee and \r\ncommunity safety and health, each member of the organization plays a key role in \r\nassuring success.\r\n\r\n1.2 Emergency Response Coordination with the Adjacent Mill\r\n\r\nAs a Program 3 facility, a worst case scenario will impact the adjacent KapStone facility which is not owned or operated by Ingevity.  The Ingevity North Charleston Plant has a program in place to notify them in the event of an accidental release.  \r\n\r\n1.3 Risk Management System\r\n\r\nIngevity has developed a management system to \r\nimplement and maintain compliance with the ARP and related chemical safety and \r\nemergency response programs.  This management system identifies lines of responsibility \r\nfor the entire program and each of its key elements.\r\n\r\n\r\n2.0   PROCESSES AND SUBSTANCES SUBJECT TO 40 CFR PART 68\r\n\r\nThe Ingevity North Charleston Plant manufactures industrial intermediates (crude tall oil, modified rosin and fatty acids and lignin-based products) \r\nusing raw material supplied via pipeline by the neighboring KapStone Mill facility and other raw materials supplied by truck and rail from other sources.  Chemical manufacturing processes at the facility utiliz"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000037596,
      "SummaryText": "e a number of chemicals, some of which are regulated under 40 CFR Part 68.  At the Ingevity North Charleston Plant, only the lignin-based production area contains a threshold amount of a regulated substance, formaldehyde solution.\r\n\r\nThe lignin production area includes a number of reactors that produce a variety of products. Formaldehyde solution is delivered to the site via tank truck in the form of a 37% aqueous solution and stored at slightly elevated temperature in an above ground tank with a 30,000 gallon (270,000 lb) capacity.  The tank is surrounded by a 30 ft x 30 ft dike that provides passive mitigation by limiting the surface area of a spill.\r\n\r\nThe EPA Risk Management Regulation identifies three levels of requirements defined as \"programs\".  Ingevity has determined that the production process that uses formaldehyde sois a Program 3.  Program 3 applies to processes that are subject to Occupational Safety and Health Administration (OSHA) Process Safety Management Standard (PSM) or listed among nine North American Industrial Classification System (NAICS) codes.  The process belongs to a listed NAICS code (325199, industrial organics), is subject to PSM and the worst case release scenario has the potential to impact the KapStone facility.\r\n\r\nThe Risk Management Plan requirements for Program 3 processes are the same as those for the PSM standard.\r\n\r\n\r\n3.0   HAZARD ASSESSMENT RELEASE SCENARIOS\r\n\r\nThe Hazard Assessment under the ARP program consists of two parts; 1) a review of the five-year accident history involving regulated substances in the covered process and 2) a modeling evaluation of the impact associated with an accidental release.  There have been no accidental releases during the most recent five-year period that had an off-site impact, however, modeling of a worst-case release shows that off-site concentrations of formaldehyde would exceed the toxic endpoint concentration.  The Ingevity North Charleston plant is subject to Program 3 ARP requirements"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000037596,
      "SummaryText": ".\r\n\r\n3.1 Five-Year Accident History\r\n\r\nIn conjunction with the current ARP programs in place at the Ingevity facilities, there is a standard management practice that requires immediate internal reporting of unusual events, including those in which any abnormal emission of regulated chemicals is observed or suspected. The incident information is reviewed by environmental and supervisory staff and a determination is made as to whether a reportable quantity of any listed chemical requiring reports to regulatory authorities is involved.  If so, the appropriate authorities are promptly notified. \r\n\r\nDuring the past 5 years, there have been no accidents involving formaldehyde that qualify for reporting under 40 CFR Part 68.  This means that no accident has resulted in \r\nreportable on-site injury, off-site injury, off-site evacuation or sheltering in place, or off-site damage to property or the environment.  \r\n\r\n3.2 Program 3 Applicability\r\n\r\nThe formaldehyde solution system in at the Ingevity North Charleston Plant is subject to Program 3 Accidental Release Prevention (ARP) Requirements under CFR Part 68.  \r\n\r\n4.0   ACCIDENT PREVENTION\r\n\r\nThe process is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management Standard (PSM) with which the Ingevity facility is \r\nin compliance. This program minimizes the potential for accidental releases and helps Ingevity maintain a safe facility.  Ingevity has in-place specific operational programs to address PSM Prevention Program requirements.  These include:\r\n\r\n*Preventive Maintenance Program\r\n\r\n*Tank Integrity Program\r\n\r\n*Regular Process Hazards Analysis (HAZOP Studies) and Pre-Startup Safety Checks for Changes as Part of Management of Change Program\r\n\r\n*Incident Review, Diagnosis and Correction (to Prevent Recurrence)\r\n\r\n*Written Operating Procedures\r\n\r\n*Operator Training and Testing Program\r\n\r\n\r\n5.0   EMERGENCY RESPONSE PROGRAM\r\n\r\nConsistent with Program 3 requirements, the Ingevity North Charles"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000037596,
      "SummaryText": "ton Plant has trained Emergency Response Teams and coordinates emergency response with the local emergency planning and response agencies, including the North Charleston police and fire departments. \r\n\r\nThe Ingevity North Charleston Plant maintains a formal emergency response program that contains the elements in terms of plans, procedures, equipment, and training required to deal with chemical emergencies. The IngevityNorth Charleston Plant's emergency response plan is contained in the Integrated Contingency Plan (ICP).  This plan identifies the protocols and procedures utilized in an abnormal release or spill event when there is concern that it may lead to an emergency condition.  These plans define the criteria for identifying, classifying, and notifying appropriate emergency response staff of potential emergency events.  This ensures that those with more significant possible consequences receive immediate priority for appropriate emergency response.  If an abnormal event indicates the potential for the release of a chemical and quantity that may lead to an emergency condition, the plant emergency response team is notified and the most appropriate mode of response is determined by the Plant Emergency Coordinator or Incident Commander, with support from available emergency response and technical advisory staff.  \r\n\r\nTraining of responsible staff from both the North Charleston Chemical Plant and the Plant Emergency Response Teams (Rescue Team and Fire Brigade) is designed to ensure that reliable communication and coordination occurs in any emergency situation.  The North Charleston Chemical Plant has a continuous safety improvement program which includes prompt investigation and reporting of all spill- or release-related events, even when there is no immediate threat of off-site exposure.  \r\n\r\n6.0 PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nIngevity, under the EPA Accidental Release Prevention program, as well as its PSM and SARA Title III Community Right-to-Know Act comp"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000037596,
      "SummaryText": "liance programs has organized its management system to effectively address hazards and potential risks.  These programs are documented so that needed information about the safe handling of chemicals present at the facility is continuously available to employees, and can be readily interpreted by emergency response team staff and the Site Emergency Coordinator / Incident Commander when questions arise from public safety officials on potential risks to the community.  All of these features of the RMP and the integrated risk management program at this site lead to operations that are safe today, but will be even safer tomorrow."
    }
  ]
}