{
  "FacilityID": 1000050325,
  "FacilityName": "SE Tylose",
  "FacilityStr1": "26270 Highway 405 (River Rd. South)",
  "FacilityStr2": null,
  "FacilityCity": "Plaquemine",
  "FacilityState": "LA",
  "FacilityZipCode": "70764",
  "Facility4DigitZipExt": "6818",
  "FacilityCountyFIPS": "22047",
  "LEPC": null,
  "FacilityLatDecDegs": "30.2666666",
  "FacilityLongDecDegs": "-91.1775000",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78756883,
  "ParentCompanyName": "SE Tylose Holding GmbH",
  "Company2Name": null,
  "CompanyDUNS": 331704226,
  "Company2DUNS": 0,
  "OperatorName": "Tim Gill",
  "OperatorStr1": "PO Box 298",
  "OperatorStr2": null,
  "OperatorCity": "Addis",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70710",
  "OperatorZipCodeExt": null,
  "FTE": 44,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000229549",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1280-00161-V1",
  "SafetyInspectionDate": "2015-05-05 00:00:00",
  "SafetyInspectionBy": "Office of State Fire Marshall",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-10-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-10-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-10-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-10-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000063300,
      "AltID": "HEC Plaquemine Plant",
      "FacilityID": 1000050325,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000078264,
          "ProcessID": 1000063300,
          "ChemicalID": 9,
          "Quantity": 509267.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000064612,
          "ProcessID": 1000063300,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000052721,
              "Process_NAICS_ID": 1000064612,
              "SafetyReviewDate": "2015-04-15 00:00:00",
              "PHA_Date": "2015-04-18 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-08-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Yokogawa",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-04-15 00:00:00",
              "TrainingReviewDate": "2015-04-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-05-04 00:00:00",
              "EquipmentInspectionDate": "2015-04-09 00:00:00",
              "EquipmentTested": "3 Air Compressors and 3 Air Dryers",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2015-05-14 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-05-22 00:00:00",
              "HotWorkPermitReviewDate": "2014-04-23 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000064746,
                  "PreventionProgram3ID": 1000052721,
                  "ProcessChemicalID": 1000078264
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000050325,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2015-06-23 00:00:00",
    "ERTrainingDate": "2015-06-23 00:00:00",
    "CoordinatingAgencyName": "Iberville Parish LEPC",
    "CoordinatingAgencyPhone": "2256875140",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050325,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nSE Tylose is committed to operating in a manner that is safe for the plant workers, the public, and the environment. SE Tylose strives to protect and promote the health and safety of its employees, its neighbors, and others who may be affected by activities at the facility. SE Tylose also strives to limit adverse effects on the physical environment in which its activities are carried out. The facility has established systems to help ensure safe operation of the process at this facility. One part of these systems is the risk management program which helps manage the risks at the facility and complies with the requirements of the EPA's Rule 40 CFR Part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule). One of the requirements of the RMP rule is to submit an RMP describing the risk management program at the facility. \n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nSE Tylose's goal at its Program 3 stationary source is accidental release prevention while maintaining emergency response procedures to minimize consequences in the event of any such release. SE Tylose maintains a Process Safety Manual directing employees to process safety information in accordance with respective Occupational Safety and Health Administration (OSHA) process safety management and EPA chemical accident prevention provisions. SE Tylose also maintains an Emergency Procedures Manual providing necessary information and guidelines to utilize in the event of an emergency situation resulting in accidental release of a regulated substance. SE Tylose's objective is to train employees and contractors in emergency response procedures, and requires that emergency response actions are supported by proper consideration for safety, health, and welfare of employees, contractors, the surrounding community, and property.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\n\nSE Tylose has developed a management system to oversee implementation "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050325,
      "SummaryText": "of the RMP elements. SE Tylose assigns responsibility for implementing individual requirements of the program to identified persons exhibiting respective qualifications. SE Tylose's system includes:\n\n\n\n*Compiling process safety information to support completing process hazard analyses\n\n*Issuing written operating procedures that provide instructions for safely conducting activities in the covered process, and training employees involved in operating the process\n\n*A mechanical integrity program\n\n*Management of change procedures and pre-startup safety reviews\n\n*Compliance audits in order to evaluate compliance with provisions of the program\n\n*Incident investigation for incidents which resulted in, or could reasonably have resulted in, a release of a regulated substance\n\n*An established hot work permit program\n\n*Employee participation and training\n\n*Contractor pre-qualification, participation, and training.\n\n\n\nSE Tylose's prevention steps include engineering and administrative controls. SE Tylose's engineering designs include overpressure protection for pressurized vessels including a closed vent capture and control system, as well as capture and control technology for atmospheric operations. Redundant equipment and instrumentation is installed where applicable. SE Tylose uses a Distributed Control System to control production in covered process units. Control buildings are engineered to be blast-resistant for protection of control systems and personnel. Administratively, SE Tylose engages in periodic inspection and maintenance practices consistent with industry standards, as well as OSHA and EPA regulatory provisions. SE Tylose's covered process units also include fire suppression, containment, and mitigation systems. \n\n\n\nEMPLOYEE PARTICIPATION\n\n\n\nEmployee participation is a goal at SE Tylose. Keeping employees informed and involved creates a team unity atmosphere. Employees participate on Process Hazards Analysis (PHA) teams and have access to all hazard and operabili"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050325,
      "SummaryText": "ty (HAZOP) information and recommendations. This information along with updated Operation Manuals is available in assigned locations throughout the facility. Operation manuals are developed, updated, and reviewed by Operations personnel and the Training Department. These Operation Manuals assist employees in refresher training and Operator Recertification Programs.\n\n\n\nSafety meetings are held on a regular basis for Operations, Maintenance, Terminal, Administration, and Contract personnel. Topics chosen are relevant to respective personnel assigned duties, and general and specific information is provided as informational instruments to enhance employee participation in facility-wide safety performance.\n\n\n\nPROCESS SAFETY INFORMATION\n\n\n\nSE Tylose keeps a variety of technical documents that are used to help maintain safe process operations. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. Specific departments within SE Tylose are assigned responsibility for maintaining up-to-date process safety information.\n\n\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety data sheets. For specific process areas, SE Tylose has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in the operation manuals for each process unit. SE Tylose promotes maintaining process parameters within limits by using process controls and monitoring instruments, operating procedures, trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n\n\n\nSE Tylose also maintains technical documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, etc. T"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050325,
      "SummaryText": "his information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to enhance safety features in the process.\n\n\n\nPROCESS HAZARD ANALYSIS\n\n\n\nSE Tylose has a comprehensive PHA program to recognize and control hazards associated with the process. Within this program, the existing covered process and potential future processes are systematically examined.\n\n\n\nSE Tylose primarily uses the HAZOP analysis technique to perform these evaluations. HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques available. The analyses are conducted using a team of personnel who exhibit operating, maintenance, and process engineering experience and expertise. This team identifies and evaluates hazards of the process as well as recommends accident prevention and/or mitigation measures when the team believes such measures are warranted.\n\n\n\nSE Tylose periodically updates its PHAs of affected units. These periodic reviews will be conducted at least every five years and will be conducted at this frequency until the process is no longer operating. \n\n\n\nOPERATING PROCEDURES\n\n\n\nSE Tylose maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. Procedures are periodically reviewed and annually certified as current and accurate. Procedures are maintained current by revising them as necessary to reflect changes made to the process. In addition, the SE Tylose operating procedures provide guidance on how to respond to events that result in exceeding safe operating limits for specific process or equipm"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050325,
      "SummaryText": "ent parameters. The written operating procedures are readily available to operators in the process units and for other personnel to use as necessary to safely perform their job tasks.\n\n\n\nTRAINING\n\n\n\nTo complement the written procedures for process operations, SE Tylose has implemented a training program for all employees involved in operating a process. New employees receive basic training in SE Tylose operations. After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks. After operators demonstrate (e.g., through tests, skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures in order to maintain skills and knowledge at an acceptable level. \n\n\n\nCONTRACTORS\n\n\n\nSE Tylose uses contractors to supplement its work force during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, SE Tylose has procedures in place to provide that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform SE Tylose personnel of any hazards that they find during their work. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, (4) safe work practices, and (5) a work permit process (i.e., for hot work, confined space, etc.) prior to their beginning work. In addition, SE Tylose evaluates contractor safety programs and performance during the selection of a contractor. SE Tylose personnel monitor contractor performance to evaluate the level at which contrac"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000050325,
      "SummaryText": "tors are fulfilling their safety obligations.\n\n\n\nPRE-STARTUP SAFETY REVIEWS\n\n\n\nSE Tylose conducts a pre-startup safety review for any new facility or facility modification that requires a change in the process safety information. This review provides that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to corroborate that construction is in accordance with the design specifications and that all supporting systems are operationally ready. The review team uses checklists to verify all aspects of readiness. A review involves field verification of the construction and serves a quality assurance function.\n\n\n\nMECHANICAL INTEGRITY\n\n\n\nSE Tylose uses established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: \n\n\n\n*Conducting training\n\n*Developing written procedures\n\n*Performing inspections and tests\n\n*Correcting identified deficiencies \n\n*Applying quality assurance measures \n\n\n\nIn combination, these activities form a system that maintains the mechanical integrity of the process equipment. To help ensure that they can perform their job in a safe manner, maintenance personnel receive training on: \n\n\n\n*An overview of the process\n\n*Safety and health hazards\n\n*Applicable maintenance procedures\n\n*Emergency response plans\n\n*Applicable safe work practices \n\n\n\nWritten procedures are used in order that work is performed in a consistent manner and provide a basis for training. Inspections and tests are completed to evaluate equipment functioning as compared to that intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equ"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000050325,
      "SummaryText": "ipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\n\n\nAnother integral part of the mechanical integrity program is quality assurance. SE Tylose incorporates quality assurance measures into equipment purchases and repairs. This practice assesses suitability of new equipment for its intended use and establishes that proper materials and spare parts are used when repairs are made.\n\n\n\nMANAGEMENT OF CHANGE\n\n\n\nSE Tylose has a comprehensive system to manage process changes. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards, and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process technology information, equipment information, and procedures are updated to incorporate these changes. In addition, operating and maintenance personnel are provided with any necessary training on the change.\n\n\n\nINCIDENT INVESTIGATION\n\n\n\nSE Tylose will investigate incidents that resulted in, or could have reasonably resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team, which can include contractors, will document its findings, develop recommendations to prevent a recurrence, and forward these results to SE Tylose's management for resolution. Corrective actions will be taken in response to the investigation team's findings, and recommendations will be tracked until they are complete."
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000050325,
      "SummaryText": " The final resolution of each finding or recommendation will be documented, and the investigation results will be reviewed with all employees (including contractors) who could be affected by the findings. \n\n\n\nCOMPLIANCE AUDIT\n\n\n\nSE Tylose is a new site that has recently started operations; therefore, there are no relevant compliance audits to report at this time. Compliance audits will be conducted at least every three years to confirm the procedures and practices required by the chemical accident prevention program are being implemented. \n\n\n\nHOT WORK PERMIT\n\n\n\nThe facility's hot work procedure requires that detailed permitting activities take place before, during, and after any job that has the potential to provide a source of ignition. The permit is followed through to completion of the work and those permits are maintained on site. The facility implements other work permits as necessary to assure safe work conditions are communicated to maintenance and contract personnel.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nSE Tylose is a new site that has recently started operations; therefore, there is no relevant accident history to report at this time. In accordance with the requirements of 40 CFR 68.42, information relating to any accidental release that results in death, injury, significant property damage, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage will be documented for the facility and provided in future RMP submittals.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nSE Tylose maintains a comprehensive written emergency response program to protect the safety of workers, the public, and the environment. The plan includes procedures for responding to a release of a regulated substance, including the possibility of a fire or a toxic gas release. The procedures address all aspects of emergency response, including first aid and medical treatment, evacuation plans and accounting for personnel after an evacuation, notification o"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000050325,
      "SummaryText": "f local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements. In addition, the plan has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties. \n\n\n\n\n\n\n\n"
    }
  ]
}