{
  "FacilityID": 1000062225,
  "FacilityName": "Del Monte Fresh Produce (Southwest), Inc.",
  "FacilityStr1": "14550 W. La Estrella",
  "FacilityStr2": null,
  "FacilityCity": "Goodyear",
  "FacilityState": "AZ",
  "FacilityZipCode": "85338",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.410170",
  "FacilityLongDecDegs": "-112.373060",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 42559138,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Carlos Garcia",
  "OperatorStr1": "14550 W. La Estrella",
  "OperatorStr2": null,
  "OperatorCity": "Goodyear",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85338",
  "OperatorZipCodeExt": null,
  "RMPContact": "Shawn Young",
  "RMPTitle": "Warehouse Manager",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000048281",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-10-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-02-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-02-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-02-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-02-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 33.41025,
  "FRS_Long": -112.37219,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078012,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000062225,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000079215,
          "ProcessID": 1000078012,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        },
        {
          "Process_NAICS_ID": 1000079216,
          "ProcessID": 1000078012,
          "NAICSCode": "49313",
          "_desc": {
            "NAICS_CODE": "49313",
            "NAICS_DESCRIPTION": "Farm Product Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000096999,
          "ProcessID": 1000078012,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000596999,
          "ProcessID": 1000078012,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062225,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThe attached Registration contains a summary of the Del Monte Fresh Produce, Inc. administrative and operational programs to prevent ammonia-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is anhydrous ammonia.  The following Data Elements sections are attached:\n\n\n\nSection 1:    Registration Information\n\nSection 2:    Toxics - Worst Case Release\n\nSection 3:    Toxics - Alternative Release\n\nSection 4:    Flammables - Worst Case Release (NOT APPLICABLE)\n\nSection 5:    Flammables - Alternative Release (NOT APPLICABLE)\n\nSection 6:    Five Year Accident History\n\nSection 7:    Prevention Program 3 Component \n\nSection 8:    Prevention Program 2 Component (NOT APPLICABLE)\n\nSection 9:    Emergency Response Component\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nSenior management at the facility is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all employees and the surrounding communities.  Senior management administers the safety and environmental policies and programs.  These programs include but are not limited to forklift safety, hazard communications, lockout/tag out, employee safety manuals, manufacturers' documentation, Emergency Response, as well as the Risk Management Plan.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Del Monte Fresh Produce, Inc. facility is located at 14550 La Estrella. The facility is approximately 0.4 miles south of the State Highway 85 in on the south side of Goodyear, Arizona.  The area immediately surrounding the facility is rural with a mix of farm land, offices, manufacturing, and an airport.\n\n \n\nThe Del Monte Fresh Produce facility was constructed in 1998. The primary business of this location is cooling, cold storage and ripening of produce.  \n\n\n\nThe facility uses 16,000 pounds of ammonia in a single closed-loop ammonia refrigeration system.  \n\n\n\nThe refrigeratio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062225,
      "SummaryText": "n system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration to accommodate the cooling and storage of various agricultural products.  \n\n\n\n\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nAdministrative Measures:  The facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n\n\n\n\n?    IIAR Bulletin 109, \"Minimum Safety Criteria for a Safe Ammonia Refrigeration System\"\n\n?    IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\"\n\n\n\nPrevention programs are in place to minimize the risk of hazardous chemical releases in accordance with Process Safety Management (PSM) standard and the EPA Risk Management Program.  \n\n\n\nEngineering Measures: It is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia. For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.\n\n\n\n Pressure relief valves on all pressure vessels protect the equipment from over-pressurization. The pressure relief valves vent to a water diffusion tank to prevent an atmospheric release of ammonia.\n\n\n\nAn emergency pressure control box allows control of system pressures during an emergency such as an ammonia release or fire.   This system will allow pressure to be controlled by relieving ammonia into the water diffusion tank.\n\n\n\nThe refrigeration mechanical room and coolers are equipped with an ammonia de"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062225,
      "SummaryText": "tection system designed to activate the following actions:\n\n\n\n Level 1: 50 ppm:     Activate a visual and audible evacuation alarms throughout the facility\n\n\n\n Level 2; 250 ppm;     Level 1 remains active\n\nClose valves in refrigerant supply line to refrigerated room;\n\nStart emergency purge ventilation/scurbbing in mechanical room\n\nProvide signal to fire alarm monitoring \n\n\n\nLevel 3; 500 ppm;      Level 1 & 2 remain active\n\n            De-energize of refrigeration equipment in affective area\n\n            Provide additional signal to fire alarm monitoring for high level alarm.\n\n\n\n\n\n\n\nThe ammonia alarm signals are monitored by an off-site security company which will notify appropriate facility management and emergency responders.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Del Monte Fresh Produce facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document. This Plan was designed to meet the following objectives:\n\n\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nThe operator of the facility maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia and, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year. \n\n\n\nIn case of an ammonia emergency, the operator plans to evacuate all employees in the facility and alert the local emergency responders (fire department).  The operator of the facility plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere are no accidental releases to report.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Hazards Review w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062225,
      "SummaryText": "as conducted April 3 & 4 2012 and provided mitigation measures to improve safety at the Del Monte Fresh Produce facility. In addition to recommendations from the Hazard Review, the facility safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\n1. Continue to train all employees in the facility safety plan/programs.\n\n2. Continue to have employee involvement in safety plan development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n"
    }
  ]
}