{
  "FacilityID": 1000000575,
  "FacilityName": "Boskovich Farms Inc.",
  "FacilityStr1": "711 Diaz Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93030",
  "Facility4DigitZipExt": "1352",
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.114241",
  "FacilityLongDecDegs": "-119.100825",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.boskovichfarms.com",
  "FacilityEmailAddress": "ggrayson@boskovichfarms.com",
  "FacilityDUNS": 58017401,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "George Boskovich, Jr.",
  "OperatorStr1": "711 Diaz Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Oxnard",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93030",
  "OperatorZipCodeExt": "1352",
  "FTE": 208,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000026928",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.19394,
  "FRS_Long": -119.16836,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000716,
      "AltID": "Cold Storage",
      "FacilityID": 1000000575,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000756,
          "ProcessID": 1000000716,
          "ChemicalID": 56,
          "Quantity": 33625.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000000753,
          "ProcessID": 1000000716,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000000432,
              "Process_NAICS_ID": 1000000753,
              "SafetyReviewDate": "2009-05-26 00:00:00",
              "PHA_Date": "2009-05-26 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-05-26 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-05-26 00:00:00",
              "TrainingReviewDate": "2009-05-26 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-05-26 00:00:00",
              "EquipmentInspectionDate": "2009-05-26 00:00:00",
              "EquipmentTested": "compressor",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-05-26 00:00:00",
              "PreStartupReviewDate": "2009-05-26 00:00:00",
              "ComplianceAuditDate": "2009-05-26 00:00:00",
              "AuditCompletionDate": "2009-05-26 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-05-26 00:00:00",
              "HotWorkPermitReviewDate": "2009-05-26 00:00:00",
              "ContractorSafetyReviewDate": "2009-05-26 00:00:00",
              "ContractorSafetyEvalDate": "2009-05-26 00:00:00",
              "CBI_Flag": 0,
              "Description": "Introduction\n\nThe Boskovich fourteen (14) step Process Safety Management (PSM) program provides information and procedures to prevent or minimize an accidental release of ammonia.  This program attempts to anticipate future problems by identifying, evaluating, and preventing failures of the processes that could result in a release of this chemical.  Every element of the PSM program applies to all units in the process\n\nBoskovich Farms, Inc. owns and operates a refrigeration facility to cold treat and store produce (fresh vegetables) and manufacture ice. Anhydrous ammonia is used as a refrigerant in the refrigeration systems.   In addition, an Aqua Ammonia Absorption Refrigeration Plant (AAARP) located on the north-east corner of property, which is owned and operated by Sithe Energies, Inc. also supplies refrigeration capacity to Boskovich.\n\nThe facility is in operation seven days per week, 24 hours per day.  Watchmen are present at all times.\n\nThe ammonia refrigeration facility consists of ten connected/or separate units as listed in Table 1.\n\nTable 1\nList of Refrigeration Units\n     Facility                  Ammonia Inventory (lb)\n\nAAARP    15,755\nEast Freezer                    3,000\nWest Freezer/Pressure Cooler    2,820\nPressure Cooler                    3,440\n\nIce Plant #1                    1,725\nIce Plant #2                    1,725\nHydrocooler                    2,125\n\nHydrovac#l                    890\nHydrovac #2                    1,645\n\nBuilding 10                    500\nTotal                            33,625\n\nThe location of each unit is shown in the facility Site Plan.\n\nSome ammonia units are either interconnected or located in close proximity, so that an ammonia release could affect adjoining vessels. \n\nTherefore, the refrigeration units listed in Table 1 are considered a single process.\n\nThe term \"employees\" refers to all workers of the units listed in Table 1 above.\n\n\nHazards of Ammonia\n\nAnhydrous Ammonia, chemical symbol NH3, is third in terms of volume of chemicals produced in the United States. Ammonia is used for fertilizer production and is a common industrial refrigerant.  At atmospheric temperatures and pressures, ammonia is a colorless gas with a sharp, intensely irritating odor.  Depending on the concentration and duration of exposure, the health effects of ammonia gas can range from mild to severe irritation to the lining of the nose, throat, eyes, and lungs.  Inhalation of concentrations above 1000 ppm may injure the lungs with potentially fatal results.  Due to its low odor threshold of 5 ppm, ammonia has very good A?warning propertiesA?.  The A?level of concernA?, EPRG-2, is 200 ppm. At this concentration it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or otherwise serious health effects or symptoms which could impair an individualA?s ability to take protective action.  \n\nProcess Chemistry\n\nAmmonia is used strictly as a refrigerant at the Boskovich site.  There are no chemical reactions that occur in a closed loop mechanical refrigeration system.  Ammonia is used only as a heat transfer medium.  The ammonia liquid from the refrigeration system(s) is vaporized as it absorbs heat from the process, in this case produce cooling.  Ammonia vapor is returned to the refrigeration(s) system where it is compressed, cooled and condensed back into the liquid phase.  It is then sent back to the process to repeat the cooling cycle.\n\nProcess Technology and Equipment\n\nAqua Ammonia Absorption Refrigeration Plant (AAARP) - the function of the AAARP is to obtain refrigeration by steam.   Steam is sent to the re-boiler to heat a concentrated solution of ammonia in water.  This drives off the ammonia to be rectified to high quality anhydrous ammonia in the rectification column.  The ammonia vapor is then liquefied under pressure changing the state of the product from vapor to liquid.  The expanded ammonia is absorbed in the weak aqueous solution that enters the absorbers.  The absorbers combine a weak aqueous solution with ammonia vapor to produce a strong aqueous solution that is pumped back to the re-boiler to start the cycle over again.  Detailed Piping and Instrumentation Diagrams (P&ID) showing the location of the AAARP are kept on-site.\n\nRefrigeration, Ice Making Units, Coolers, Freezers, Hydrocoolers A? Refrigeration can be accomplished by either running the AAARP system or by operating Boskovich FarmsA? refrigeration systems.  When running the refrigeration systems, the suction gas from the liquid recirculator or accumulator flows to the compressor.  The high-pressure, high-temperature gas from the compressor flows to evaporative condensers condensing the gas into a liquid.  The high pressure liquid drains into the high-pressure receiver.  The receiver top is equalized to the common discharge header of each evaporative condenser.  This maintains the pressure in the receiver to the inlet pressure of the condensers.  The high-pressure liquid from the receiver flows to the recirculator or accumulator to separate the refrigerant liquid from the suction vapor.  The liquid is held in the vessel until it is returned to the evaporators via pump or gravity.\n\nThe refrigeration system capacity is automatically controlled by measuring the suction pressure.  When the pressure increases, the compressor capacity is increased, when the pressure decreases, the compressor capacity is reduced.\n\nIf the system is run on the AAARP system, the liquid valve from the AAARP would feed ammonia to the liquid recirculator on demand.  Detailed P&ID for each refrigeration unit are kept on-site.  Drawings showing the location of the AAARP are kept on site.\n\nHydrovac Tube Pre-cooling Unit A? The low pressure pump accumulator is attached by piping to a refrigeration compression and condensing unit.  This unit is a custom design, flat-bed semi-truck trailer that has the compressors, condensing tower, and high pressure receiver mounted on the trailer.  The tube, low-pressure accumulator, and compressing trailer is easily disassembled and transportable.  The system is designed to be rugged.  A detailed P&ID is kept on-site. \n\n\nEmployee Involvement\n\nThe intent of this procedure is to involve employees at an elemental level of the PSM Plan. The purpose of employee participation is improved safety for all employees. Process Safety Management will not be effective without the involvement of the employees and/or their representatives.  Boskovich Farms, Inc. provides for employee participation in their process safety management plans by consulting with employees in developing the PSM program. \n\nAwareness\n\nEach new refrigeration employee is made aware of ammonia refrigeration PSM as a part of their initial orientation process, in conjunction with hazards communication required by 29 CFR 1910.1200. New refrigeration employees are given a document titled Hazards of Ammonia and a one page document entitled Process Safety Management.  The PSM document is a simple explanation of what the Process Safety Management program for ammonia refrigeration is all about.  It is reviewed with each new refrigeration employee and they acknowledge their awareness of PSM by signing the document.  If necessary, the PSM orientation is given in Spanish.  PSM awareness documents are available in both English and in Spanish.\n\nInvolvement\n\nBoskovich Farms, Inc. involves operations or maintenance employees in meetings or discussions concerning the PSM policies and procedures.  In addition, several other PSM procedures are reviewed by or conducted with the involvement of at least one employee or a representative of the employees:\n\nA?    Process Safety Information is reviewed for accuracy and thoroughness.\nA?    Operating Procedures are developed with input from refrigeration employees. In addition, refrigeration employees check the written procedures to ensure they are accurate.\nA?    Training programs and needs for refresher training are reviewed with affected employees. More experienced refrigeration employees participate in the training process by observing the demonstration of job tasks conducted by the less experienced employees.\nA?    Pre-Startup Safety Reviews are conducted with involvement of at least one refrigeration employee.\nA?    Mechanical Integrity Audits are conducted with the involvement of at least one refrigeration employee.\nA?    Refrigeration employees participate in the development of the mechanical integrity program and procedures.\nA?    All affected refrigeration employees are made aware of ammonia refrigeration process changes prior to commencement of work. \nA?    Incident Investigation reports are reviewed with all affected refrigeration employees. An employee may be asked to serve on the investigation team.\nA?    Emergency Planning and Response procedures are reviewed with affected employees.\n\nBoskovich Farms, Inc. also provides a means of allowing employees to voice concerns about process safety to management. To meet this provision, we have established a management system to address, resolve, follow-up and document employee concerns.  This management system includes provisions to:\n\nA?    Assure that the concerns are resolved in a timely manner.\nA?    Document the actions that are to be taken to resolve the concerns.\nA?    complete the actions as soon as possible; when necessary, interim measures are taken when the\nA?    Actions will require significant time to implement.\nA?    Develop a written schedule of when actions are to be completed.\nA?    Monitor the implementation of the actions and verify and document their completion.\nA?    communicate the actions to operating, maintenance, and other employees whose work\nA?    Assignments are in the process and who may be affected by the recommendations or actions.\n\nAccess to Information\n\nRefrigeration employees, including contractor refrigeration employees, are provided access to the process hazard analyses (PHA) and any other information required by the PSM Standard.  They have access to all Process Safety Information, including:\n\nA?    piping and instrumentation drawings\nA?    equipment information\nA?    chemical information such as MSDS\nA?    technological information such as process chemistry\nA?    operating and maintenance procedures\n\nThe Environmental Compliance manager is responsible for controlling access to PSM information. All affected employees are provided access to ammonia refrigeration PSM files and information at all times (not just during day shift) but access is available under the following limitations:\n\nA?    Approval must be given to remove any documents from the file.\nA?    Original copies of documents are not to be removed from the file area.\nA?    No markings are be made on original documents.\nA?    Previously unfiled documents are only added with proper authorization.\n\nAll employees directly involved with operation and maintenance of the ammonia refrigeration system are encouraged to periodically review the process safety information and most recent process hazard analysis.  Such reviews are considered to be a training activity and can be conducted on company time.\n\nProcess Hazard Analysis\n\nThe Process Safety Management Standard requires employers to perform a process hazard analysis (PHA) for each covered ammonia refrigeration process. The purpose of performing a PHA is to identify and analyze the significance of potential hazards associated with the process and to provide information to assist employers in making decisions for improving safety and reducing the chances of a catastrophic ammonia release.\nThe PHA addressed the following:\nA?    The hazards of the process.\nA?    Previous incidents with likely potential for catastrophic consequences.\nA?    Consequences of failure of engineering and administrative controls.\nA?    Engineering and administrative controls applicable to the hazards and their interrelationships.\nA?    Facility siting.\nA?    Human factors.\nA?    A qualitative evaluation of a range of possible safety and health effects of failure of controls on employees in the workplace.\nThe process hazard analysis was performed by teams with expertise in engineering and process operations, knowledgeable in the specific PHA methodology used, and included employees with experience and knowledge specific to the processes being evaluated.  The most recent analysis was completed in May 2009.\n\nOperating Procedures\n\nThe intent of these procedures is to provide clear instructions for conducting activities involved in handling ammonia that are consistent with the process safety information. The operating procedures address steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions.\n\nTraining\n\nThe intent of this procedure is to help employees understand the nature and causes of problems arising from ammonia operations, and increase employee awareness with respect to their hazards. An effective training procedure significantly reduces the number and severity of incidents arising from process operations, and can be instrumental in preventing small problems from leading to a catastrophic release. The training procedures include: Initial Training, Refresher Training, and Documentation.\n\nContractors\n\nThe intent of this procedure is to establish a screening process so that contractors, hired and used, accomplish the desired job tasks involving ammonia without compromising the safety and health of employees at a facility. The contractor must assure that contract employees are trained on performing the job safely, on the hazards related to the job, and on applicable provisions of the emergency action plan.\n\nPre-Startup Safety Review\n\nThe intent of this procedure is to make sure that, for new facilities and for modified facilities when the modification necessitates a change to process safety information, important considerations are addressed before ammonia introduced into the process; namely, the pre-startup safety review must confirm the following: construction and equipment is in accordance with design specifications; safety, operating, maintenance, and emergency procedures are in place and adequate; for new facilities, a PHA has been performed and recommendations resolved or implemented; modified facilities meet the requirements of paragraph (1), \"Management of Change\"; and training of each employee involved in the process has been completed.\n\nNew Facilities or Systems\n\nBecause a process hazard analysis must be performed before the startup of a new facility or system, all required process safety information will be compiled and readily available. This includes information concerning the hazards of ammonia, the technology of the process, and the equipment in the process.  The process hazard analysis shall be in full compliance with the requirements of 1910.119, paragraph (e). All recommendations from the process hazard analysis must be either resolved or implemented prior to startup, and properly documented. \n\nDocumentation will be established to verify completion of this activity. Boskovich will ensure that:\n\nA?    All safety, operating, maintenance and emergency procedures are written, implemented, and are adequate. Recognized standards or codes, manufacturersA? instructions, and other applicable regulations, may be considered in drafting procedures. \nA?    Construction and equipment is in accordance with the design specifications. The construction codes and standards used must be documented in the process safety information.\nA?    Training for each employee involved in operating the process has been completed. The modifications or additions reflected in the PSSR may create a need for additional training in other areas such as maintenance, emergency response or HAZCOM.  \nA?    Changes or revisions in the process safety information, the PHA and operating proceduresA?like all other required PSM documents A? must be available to employees.\n\nModified Facilities or Systems\n\nAll process safety information must be updated. Boskovich will ensure that:\n\nA?    The requirements for a Management of Change have been completed. The Management of Change shall be in substantial compliance with the requirements of 1910.119, Paragraph (l). \nA?    The relevant safety, operating, maintenance and emergency procedures are in place and adequate. All procedures shall follow, where applicable, recognized standards or codes, manufacturersA? instructions, and other applicable regulations. \nA?    Construction and equipment is in accordance with the design specifications. \nA?    Training for each employee involved in operating the new equipment in the process has been completed. The modifications reflected in the PSSR may create a need for additional training in other areas such as maintenance, emergency or HAZCOM. Training for employees operating a process that has been modified will include reviewing any changes to relevant procedures. \nA?    Startup of new equipment is conducted in accordance with applicable industry standards, manufacturersA? recommendations, and plant procedures.\n\nVerification Forms\n\nA Pre-Startup Safety Review Verification form will be used to sign off acceptance of the pre-startup safety Review.  The form must be signed by the Operations Manager and the Refrigeration Engineer.\n\nMechanical Integrity\n\nThe intent of this procedure is to assure that equipment used to process, store, or handle ammonia is designed, constructed, installed, and maintained to minimize the risk of ammonia releases. A mechanical integrity program is in place to assure the continued integrity of ammonia equipment.  A maintenance schedule was compiled to track and log the process.\n\nHot Work Permit\n\nThe intent of this procedure is to control, in a consistent manner, non-routine work conducted in ammonia process areas. Specifically, this subparagraph is concerned with the permitting of hot work operations in process areas.\n\nHot work permits for hot work operations, such as the ones associated with welding and cutting conducted on or near an ammonia process, will be in compliance with the fire prevention and protection requirements of 29 CFR 1910.252(a).\n\nManagement of Change\n\nThe intent of this procedure is to require management of all modifications to equipment, procedures, raw materials and processing conditions concerning ammonia other than \"replacement in kind,\" by identifying and reviewing them prior to implementation.\n\nIncident Investigations\n\nAn incident investigation will be performed any time there is an incident which results in, or which could reasonably have resulted in (near-miss), a catastrophic release of ammonia. A catastrophic release can be defined as a major uncontrolled emission, fire, or explosion involving ammonia that presents serious danger to employees, including contract employees working on-site.\n\nThe following is a list of the criteria that will be used to determine whether an incident investigation should be performed. (Note: In the case of a near-miss, judgment must be made as to the potential results as opposed to the actual results.)\n\nA? Quantity of Ammonia Released \nA? Property Damage \nA? Fire or Explosion \nA? Injuries or Deaths \n\nEmergency Planning and Response\n\nThe intent of this procedure is to address actions employees are to take when there is and unwanted release of ammonia.  Boskovich Farms Inc. has prepared an Emergency Response Plan for this facility.  The plan is documented in Section 6 of the Risk Management Plan (RMP).\n\nCompliance Audits\n\nBoskovich Farms, Inc. has developed a compliance audit program to verify implementation of all PSM elements. The audits are conducted at least every three years. A Compliance Audit Checklist will be used to conduct and document the audit.  \n\nThe Refrigeration Engineer performs the audits on the ammonia facilities and verifies that the audit records are included in the PSM Files.  A written report of the audit findings is prepared.  Responses to the audit findings are promptly addressed and documented, and any deficiencies found during the audit promptly corrected.  Once the audit form is completed, the appropriate actions to address the recommendations are taken and documented.\n\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000000459,
                  "PreventionProgram3ID": 1000000432,
                  "ProcessChemicalID": 1000000756
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [
    {
      "AccidentHistoryID": 1000000285,
      "FacilityID": 1000000575,
      "AccidentDate": "2008-06-30 00:00:00",
      "AccidentTime": "1010",
      "NAICSCode": "49312",
      "AccidentReleaseDuration": "00050",
      "RE_Gas": 1,
      "RE_Spill": 0,
      "RE_Fire": 0,
      "RE_Explosion": 0,
      "RE_ReactiveIncident": 0,
      "RS_StorageVessel": 0,
      "RS_Piping": 0,
      "RS_ProcessVessel": 0,
      "RS_TransferHose": 0,
      "RS_Valve": 1,
      "RS_Pump": 0,
      "RS_Joint": 0,
      "OtherReleaseSource": null,
      "WindSpeed": null,
      "WindSpeedUnitCode": null,
      "WindDirection": null,
      "Temperature": null,
      "StabilityClass": null,
      "Precipitation": 0,
      "WeatherUnknown": 1,
      "DeathsWorkers": 0,
      "DeathsPublicResponders": 0,
      "DeathsPublic": 0,
      "InjuriesWorkers": 0,
      "InjuriesPublicResponders": 0,
      "InjuriesPublic": 0,
      "OnsitePropertyDamage": 0.0,
      "OffsiteDeaths": 0,
      "Hospitalization": 0.0,
      "MedicalTreatment": 0.0,
      "Evacuated": 0.0,
      "ShelteredInPlace": 0.0,
      "OffsitePropertyDamage": 0.0,
      "ED_Kills": 0,
      "ED_MinorDefoliation": 0,
      "ED_WaterContamination": 0,
      "ED_SoilContamination": 0,
      "ED_Other": null,
      "InitiatingEvent": "a",
      "CF_EquipmentFailure": 1,
      "CF_HumanError": 0,
      "CF_ImproperProcedure": 0,
      "CF_Overpressurization": 0,
      "CF_UpsetCondition": 0,
      "CF_BypassCondition": 0,
      "CF_Maintenance": 0,
      "CF_ProcessDesignFailure": 0,
      "CF_UnsuitableEquipment": 0,
      "CF_UnusualWeather": 0,
      "CF_ManagementError": 0,
      "CF_Other": null,
      "OffsiteRespondersNotify": "Notified and Responded",
      "CI_ImprovedEquipment": 1,
      "CI_RevisedMaintenance": 0,
      "CI_RevisedTraining": 0,
      "CI_RevisedOpProcedures": 0,
      "CI_NewProcessControls": 0,
      "CI_NewMitigationSystems": 0,
      "CI_RevisedERPlan": 0,
      "CI_ChangedProcess": 0,
      "CI_ReducedInventory": 0,
      "CI_None": 0,
      "CI_OtherType": null,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "AccidentChemicalID": 1000000449,
          "AccidentHistoryID": 1000000285,
          "ChemicalID": 56,
          "QuantityReleased": 50.0,
          "PercentWeight": 100.0,
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "AccidentHistoryID": 1000000439,
      "FacilityID": 1000000575,
      "AccidentDate": "2007-01-24 00:00:00",
      "AccidentTime": "0200",
      "NAICSCode": "49312",
      "AccidentReleaseDuration": "00100",
      "RE_Gas": 1,
      "RE_Spill": 0,
      "RE_Fire": 0,
      "RE_Explosion": 0,
      "RE_ReactiveIncident": 0,
      "RS_StorageVessel": 0,
      "RS_Piping": 1,
      "RS_ProcessVessel": 0,
      "RS_TransferHose": 0,
      "RS_Valve": 0,
      "RS_Pump": 0,
      "RS_Joint": 0,
      "OtherReleaseSource": null,
      "WindSpeed": null,
      "WindSpeedUnitCode": null,
      "WindDirection": null,
      "Temperature": null,
      "StabilityClass": null,
      "Precipitation": 0,
      "WeatherUnknown": 1,
      "DeathsWorkers": 0,
      "DeathsPublicResponders": 0,
      "DeathsPublic": 0,
      "InjuriesWorkers": 0,
      "InjuriesPublicResponders": 0,
      "InjuriesPublic": 0,
      "OnsitePropertyDamage": 0.0,
      "OffsiteDeaths": 0,
      "Hospitalization": 0.0,
      "MedicalTreatment": 0.0,
      "Evacuated": 0.0,
      "ShelteredInPlace": 0.0,
      "OffsitePropertyDamage": 0.0,
      "ED_Kills": 0,
      "ED_MinorDefoliation": 0,
      "ED_WaterContamination": 0,
      "ED_SoilContamination": 0,
      "ED_Other": null,
      "InitiatingEvent": "a",
      "CF_EquipmentFailure": 1,
      "CF_HumanError": 0,
      "CF_ImproperProcedure": 0,
      "CF_Overpressurization": 0,
      "CF_UpsetCondition": 0,
      "CF_BypassCondition": 0,
      "CF_Maintenance": 0,
      "CF_ProcessDesignFailure": 0,
      "CF_UnsuitableEquipment": 0,
      "CF_UnusualWeather": 0,
      "CF_ManagementError": 0,
      "CF_Other": null,
      "OffsiteRespondersNotify": "Notified and Responded",
      "CI_ImprovedEquipment": 1,
      "CI_RevisedMaintenance": 0,
      "CI_RevisedTraining": 0,
      "CI_RevisedOpProcedures": 0,
      "CI_NewProcessControls": 0,
      "CI_NewMitigationSystems": 0,
      "CI_RevisedERPlan": 0,
      "CI_ChangedProcess": 0,
      "CI_ReducedInventory": 0,
      "CI_None": 0,
      "CI_OtherType": null,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "AccidentChemicalID": 1000000450,
          "AccidentHistoryID": 1000000439,
          "ChemicalID": 56,
          "QuantityReleased": 100.0,
          "PercentWeight": 100.0,
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_emerg_resp": {
    "FacilityID": 1000000575,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-05-26 00:00:00",
    "ERTrainingDate": "2003-12-02 00:00:00",
    "CoordinatingAgencyName": "Oxnard Fire Department",
    "CoordinatingAgencyPhone": "8053857722",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000575,
      "SummaryText": "SECTION 1\n\nEXECUTIVE SUMMARY \n\n\nWe at Boskovich Farms Incorporated are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers such areas as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  This program has been prepared pursuant to Part 68 of Title 40 of the Code of Federal Regulations.\n\nThis RMP has been prepared for the Boskovich Farms Incorporated facility located at 711 Diaz Avenue, Oxnard, California.  The facility is a produce preparation, storage and distribution facility which operates various ammonia refrigeration systems to cool produce prior to distribution.  Boskovich has approximately 33,600 pounds of anhydrous ammonia refrigerant on site in several refrigeration systems including portable HydroVac units, the Hydrocooler, two ice machines, and in the main refrigeration systems for the cooler buildings.\n\nIn July 1993 Boskovich prepared a Process Safety Management (PSM) Plan and a Risk Management and Prevention Program (RMPP).  The documents have been updated periodically as required.  These documents are referenced by this RMP because they contain some of the elements required by the EPA for the RMP\n\n1.1 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE\n\nTo prevent the accidental release of ammonia, Boskovich has developed the following:\n-    Maintenance and inspection procedures to ensure the equipment is properly maintained and functioning properly\n-    Operating procedures to ensure that equipment is operated in a maner that minimizes the possibility of an ammonia release.\n-    Employee training to ensure that operators know how to properly use the equipment and non-operators are aware of the dangers of ammonia and the necessary steps to take in the event of an amm"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000575,
      "SummaryText": "onia release.\n-    The facility is secured by fencing around the site and a 24-hour guard to minimize the possibility of a third party damaging equipment or releasing ammonia.\n\nThe programs are contained in the RMP and Binders 1 and 2 of the PSM.\n\nBoskovich has prepared an Emergency Response Plan to respond to ammonia releases.  In general the plan includes:\n-    A list of safety equipment available at the Boskovich facility.\n \n-    Response procedures for minor leaks.\n-    Response procedures for major leaks.\n-    Agency notification procedures.\n-    Emergency procedures.\n\nA copy of the Emergency Response Plan (ERP) can be found in the RMP, Section 6.  \n\n1.2 STATIONARY SOURCE AND SUBSTANCE HANDLED\n\nAs explained above, Boskovich operates various ammonia cooling systems that cool produce prior to storage and shipment.  The systems contain approximately 33,600 pounds of anhydrous ammonia.\n\n1.3 ACCIDENTAL RELEASE SCENARIOS\n\nThe Worst Case Scenario is the release of 1,725 pounds of liquid ammonia from one of the ice machine refrigeration accumulators.  This scenario is considered very improbable and would result in offsite impacts.  The Alternate Scenario considers a leaking valve.  This is a scenario that could realistically happen but should not result in offsite consequences.\nIn order to reduce the distance to the toxic endpoint from an accidental release the following administrative controls and mitigation measures are in place at Boskovich:\n-    System operation and emergency response training.\n-    routine maintenance schedule and procedures.\n-    Written operating procedures.\n-    Release detection sensors promote early detection of a release\n-    Security personnel who monitor the facility to ensure that no unauthorized  personnel are on site.\n\nDetails regarding the offsite consequence analysis for the worst case and alternative release scenarios can be found in Section 3 of the RMP.\n\n1.4 GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\nThe following components are contained in this RMP:\n-    Registr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000575,
      "SummaryText": "ation.\n-    Offsite Consequence Analysis\n-    Five-year Accident History\n-    Program 3 Prevention Program\n-     Emergency Response\n-    Certification\n-    Update Procedure\n\nIn order to further mitigate the effects of an ammonia release, the following risk management components are in place:\n-    Maintenance and standard operating procedures for the ammonia systems.\n-    The site is prevented from being accessed by trespassers with the use of fencing and on-site security personnel.\n-    Emergency response plan.\n-    Training for employees.\n-    Incident investigation documentation and procedures.\n-    Automatic system shutdowns.\n-    Windsocks for direction of wind visible on-site and from neighboring property.\n-    Ammonia sensors at various location at the facility.\n\n1.5 FIVE-YEAR ACCIDENT HISTORY\n\nBoskovich has had no incidents in the past five years from the ammonia system that resulted in on site injuries that required medical attention.  Boskovich has had two accidental ammonia releases in the past 5 years.\n\n1.6 EMERGENCY RESPONSE PLAN\n\nThe Emergency Response/Action Plan (ERP) for the Boskovich facility has been prepared and contains information for responding to an ammonia release.  The general emergency response policy for the site when ammonia is released is to:\n-    Determine the severity of the release.\n-    Evacuate non-emergency response personnel to a safe area.\n-       For minor leaks, isolate and fix the leak. \n-    Notify the appropriate response personnel and authorities.\n\n1.7 PLANNED CHANGES TO IMPROVE SAFETY\n\nSeveral developments and findings have resulted from the implementation of this RMP and the various elements of our accidental release prevention program.  Recommendations from the Hazard Review and Seismic Assessment are expected to be implemented."
    }
  ]
}