{
  "FacilityID": 1000012924,
  "FacilityName": "Hoku Materials, Inc.",
  "FacilityStr1": "One Hoku Way",
  "FacilityStr2": null,
  "FacilityCity": "Pocatello",
  "FacilityState": "ID",
  "FacilityZipCode": "83204",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16005",
  "LEPC": "Bannock County LEPC",
  "FacilityLatDecDegs": "42.896944",
  "FacilityLongDecDegs": "-112.346944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.hokucorp.com",
  "FacilityEmailAddress": "info@hokucorp.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Hoku Scientific, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 27495642,
  "Company2DUNS": 0,
  "OperatorName": "Hoku Materials, Inc.",
  "OperatorStr1": "One Hoku Way",
  "OperatorStr2": null,
  "OperatorCity": "Pocatello",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83204",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tiffani Wilson",
  "RMPTitle": "Technical Associate",
  "FTE": 25,
  "OtherEPAFacilityID": "IDR000203843",
  "EPAFacilityID": "100000210853",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-03-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-03-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-03-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-11-26 00:00:00",
  "DeRegistrationEffectiveDate": "2013-11-26 00:00:00",
  "AnniversaryDate": "2015-03-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "EPA has administratively marked this facility as 'Closed'.",
  "_processes": [
    {
      "ProcessID": 1000016132,
      "AltID": "Polysilicon Production",
      "FacilityID": 1000012924,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000016521,
          "ProcessID": 1000016132,
          "NAICSCode": "331419",
          "_desc": {
            "NAICS_CODE": "331419",
            "NAICS_DESCRIPTION": "Primary Smelting and Refining of Nonferrous Metal (except Copper and Aluminum)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019081,
          "ProcessID": 1000016132,
          "ChemicalID": 153,
          "Quantity": 208000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 153,
            "ChemicalName": "Trichlorosilane  [Silane, trichloro-]",
            "CASNumber": "10025-78-2",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000519081,
          "ProcessID": 1000016132,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012924,
      "SummaryText": "Executive Summary\nProcess Overview and Regulated Materials \nHoku Materials, Inc. (Hoku) is a clean energy company focused on the development of solar grade polysilicon feedstock exclusively for the photovoltaic (PV) industry. Hoku is constructing a plant for manufacturing polysilicon. Hoku needs to demonstrate that it has the equipment, facilities, and knowledge required to produce polysilicon. In order to demonstrate this, Hoku will perform an Equipment Demonstration (Demo) that will produce approximately 1,000 kilograms of polysilicon and utilize both permanent and temporary pieces of equipment. The duration of the test is expected to take approximately five (5) days.  During the Demo, chemicals will be brought on site and Hoku will operate two Chemical Vapor Deposition reactors that will utilize trichlorosilane (TCS) and hydrogen to produce polysilicon.   The main process areas that will be used during the Demo include: \nA?    Chemical Vapor Deposition Reactors \nA?    Emergency Vent Scrubber \nA?    Process Vent Scrubber \nA?    Chlorosilane Recovery \nA?    Hydrogen Supply \nA?    Nitrogen Supply \nA?    Electricity Substation\n\nThe Hoku polysilicon manufacturing technology uses a process where pure TCS gas and hydrogen are combined at high temperature in a reactor. The silicon from the TCS is released during the reaction and is deposited onto multicrystalline silicon filaments inside the reactor. The deposition process is called chemical vapor deposition (CVD). Over time the filament or A?rodA? grows in diameter. Once the desired size is reached, the reactor is taken offline to recover the silicon rod.  The polysilicon rods are then processed and packaged for sale. \nThe ultimate goal of the Equipment Demonstration is to produce 500 kg of polysilicon from each of two polysilicon CVD reactors.  \nAccident Release and Emergency Response Policy\nIt is the policy of Hoku to operate the facility in a manner that protects the environment and the health and safety of HokuA?s employees and the publ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012924,
      "SummaryText": "ic. HokuA?s commitment to safe operation of the facility during the Demo is evidenced by the implementation of numerous safety features and mitigation measures.\nTCS Worst-Case Release Scenario\nFor the Demo, TCS will be delivered to the site in tank trucks and will be transferred to on-site TCS storage tanks.  Upon delivery, the tank truck will contain approximately 40,000 lbs of TCS.  The maximum quantity of TCS within any vessel and/or pipe within the process at any time will be 208,000 lbs. For the Demo, the worst-case release scenario is represented by a vapor cloud explosion associated with the instantaneous release of the entire contents of a TCS tank truck and the associated storage and process equipment. It is assumed that there are no administrative controls that limit the amount of TCS in the tank truck and no passive mitigations systems that would limit the impact if the tank ruptured. No other worst-case scenarios are considered because the chemical processes are generally confined to the center of the facilityA?s property.\nThe worst-case release parameters entered into the RMP*CompA? software and the model results are presented in Table 3-1 of the RMP. The RMP*CompA? output indicates that 7,730 lbs of flammable liquid would be released and evaporated into the vapor cloud within a period of 10 minutes.\nThe distance to the explosion endpoint for the worst-case release scenario of flammable liquids was determined from the RMP*CompA? software to be 0.07 miles. LandViewA?5 was then used to identify the population within a circular area centered on the TCS tanker location (42.897A?N / 112.497A?W) and having a rounded up radius of 0.10 miles, as opposed to 0.07 miles. The population within this area was estimated to be zero (0) people. Included within this distance are a railroad right-of-way and undeveloped land. The population count does not include on-site workers, but only permanent residents. The nearest residence is estimated to be at a distance of 0.2 mi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012924,
      "SummaryText": "les. There are no environmental receptors within this distance.\nTable 3-1. RMP*CompTM Model results for worst-case release scenario.\nInput    Chemical:                     Trichlorosilane [Silane, trichloro-]\nCAS #:                    10025-78-2\nCategory:                     Flammable Liquid\nScenario:                     Worst-case\nQuantity Released:                 208,000 pounds\nRelease Type:                 Vapor Cloud Explosion\nLiquid Temperature:             103A?F\nMitigation Measures:             Diked area: 2400 square feet\n Diked height: 2 feet\nAssumptions    Wind Speed:                     1.5 meters/second (3.4 miles/hour)\nAtmospheric Stability Class:             F (stable)\nAir Temperature:                 77A?F (25A?C)\nOutput    Release Rate to Outside Air:             773  pounds per minute\nQuantity Evaporated in 10 Minutes:         7730  pounds\nEstimated Distance to 1 psi overpressure:     0.07 miles (0.2 km)\n\nAlternative Release Scenarios\nFor the Demo, two alternative release scenarios were considered as part of the hazard assessment based on quantity and temperature/pressure considerations. In both cases, passive or active mitigation systems were not considered in order to provide the most conservative evaluation.\nInjection Vessel Failure\nFor the first alternative scenario, a vapor cloud fire is assumed to occur after the failure of an Injection Vessel that releases its entire contents of 33,500 lbs of TCS onto the ground over a 10-minute period. This vessel is designed for 189 psig at 302A?F and will be equipped with a pressure relief and vent system that would route any releases to the vent gas recovery system via a relief header system. Although a failure of this system is unlikely, it is being included as an alternative release because this part of the process contains the second largest quantity of a regulated substance.\nTCS is listed as a flammable liquid in the regulation, but it is also highly volatile with a wide flammability range (7 to 80% by volume in air). It was conservatively assumed that the entire liquid pool evaporates into the air. The vapors readily ignite and burn rapidly in air when exposed "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000012924,
      "SummaryText": "to heat or fire. The vapor cloud fire consequence was selected for this alternative release in order to evaluate impact of radiant heat exposure (versus the overpressure exposure associated with the vapor cloud explosion in the worst-case scenario).\nDeposition Reactor Failure\nFor the second alternative scenario, a BLEVE is assumed to occur due to failure of a Deposition Reactor under high temperature (2,000A?F) and moderate pressure (87 psi) containing 108 lbs of a mixture comprised of 53% TCS. The only other flammable component in this mixture is hydrogen gas at 5%. The reactor is equipped with a pressure relief valve, but an explosion could occur if the pressure relief valve fails.  Although it does not contain a large quantity of chemicals, the temperature and pressure associated with this vessel may contribute to a higher likelihood of process failure and greater distance to a radiant heat endpoint. \nThe greatest distance to an endpoint for the alternative release scenarios of flammable liquids was determined from the RMP*CompA? software to be less than 0.10 miles, which is smaller than the impact area for the worst-case scenario. The greatest distance to a radiant heat endpoint for the alternative release scenario is also less than 0.10 miles.\nSince the worst-case impact area (with a distance of 0.2 miles) has a population of zero people, the two alternative scenario impact areas (each with a distance of 0.1 miles) also have a population of zero people. There are no environmental receptors within this distance.\nLevel 3 Prevention Program\nHoku has prepared a written RMP plan which addresses the 12 elements in the Level 3 Prevention Program.\nFive-Year Accident History \nThis RMP has been prepared for a newly constructed facility. There have been no releases of covered materials from this facility.\nEmergency Response Program \nDuring the Demo, Hoku will coordinate emergency response support with the Pocatello Fire Department. Hoku will have a trained vapor cloud mon"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000012924,
      "SummaryText": "itor assigned to each shift. The plant siren will be used to notify of a vapor cloud or other emergency situation. All employees will be trained in the plant evacuation procedure. The worst-case impact scenario area has a population of zero people and no environmental receptors.\nPlanned Safety Changes\nThis RMP has been prepared for a newly constructed facility, which has been designed to prevent releases of covered materials. Lessons learned during the Demo will be used, as appropriate, in the design and operation of the full-scale production facility.\n"
    }
  ]
}