{
  "FacilityID": 1000120151,
  "FacilityName": "Blossman Buchanan Terminal",
  "FacilityStr1": "3015 Bus. Hwy 27 South",
  "FacilityStr2": null,
  "FacilityCity": "Buchanan",
  "FacilityState": "GA",
  "FacilityZipCode": "30113",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13143",
  "LEPC": "West Georgia Regional LEPC",
  "FacilityLatDecDegs": "33.7529354",
  "FacilityLongDecDegs": "-85.188866",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.itslegend.com",
  "FacilityEmailAddress": "swittig@nglsupply.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "NGL Supply Terminals Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Legend LLC",
  "OperatorStr1": "1601 US-11",
  "OperatorStr2": null,
  "OperatorCity": "Petal",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39465",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000256929",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2024-10-21 00:00:00",
  "SafetyInspectionBy": "Fire Marshall",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2025-03-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2025-03-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2025-03-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2030-03-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000149901,
      "AltID": "LPG Bulk Terminal",
      "FacilityID": 1000120151,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000187303,
          "ProcessID": 1000149901,
          "ChemicalID": 118,
          "Quantity": 794531.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000151923,
          "ProcessID": 1000149901,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000128379,
              "Process_NAICS_ID": 1000151923,
              "SafetyReviewDate": "2025-02-12 00:00:00",
              "PHA_Date": "2025-02-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2025-03-24 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Engineering controls, automatic shutdown, automatic isolation valves with thermal fuses, special safety transfer hoses, hydrocarbon detection, regular inspection and maintenance",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2025-02-12 00:00:00",
              "TrainingReviewDate": "2025-02-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2025-02-12 00:00:00",
              "EquipmentInspectionDate": "2025-02-13 00:00:00",
              "EquipmentTested": "vaporizers",
              "ChangeMgmtDate": "2025-03-11 00:00:00",
              "ChangeMgmtReviewDate": "2025-02-12 00:00:00",
              "PreStartupReviewDate": "2024-08-08 00:00:00",
              "ComplianceAuditDate": "2025-02-13 00:00:00",
              "AuditCompletionDate": "2025-03-24 00:00:00",
              "IncidentInvestigationDate": "2025-03-03 00:00:00",
              "InvestigationChangeDate": "2025-03-28 00:00:00",
              "ParticipationPlansReviewDate": "2024-12-19 00:00:00",
              "HotWorkPermitReviewDate": "2025-02-12 00:00:00",
              "ContractorSafetyReviewDate": "2025-02-12 00:00:00",
              "ContractorSafetyEvalDate": "2025-02-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000160799,
                  "PreventionProgram3ID": 1000128379,
                  "ProcessChemicalID": 1000187303
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000120151,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2025-02-12 00:00:00",
    "ERTrainingDate": "2024-12-31 00:00:00",
    "CoordinatingAgencyName": "Harelson County Fire Department",
    "CoordinatingAgencyPhone": "7706462036",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "NFPA58",
    "ExercisePlan": "Yes",
    "ExercisePlanDate": "2024-12-31 00:00:00",
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "Yes",
    "LEPCCoordinationDate": "2025-03-25 00:00:00",
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "Yes",
    "LocalResponseAgencyCoordinationDate": "2024-10-21 00:00:00",
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000120151,
      "SummaryText": "The following RMP is based on the guidelines set by the Environmental Protection Agency (EPA) for facilities handling hazardous chemicals, specifically under the Risk Management Program Rule (40 CFR Part 68). \nRisk Management Plan for Butane Terminal \u0096 Buchanan, Georgia\n1. Facility Description\n\u0095\tFacility Name: Blossman Buchanan Terminal \n\u0095\tLocation: 3015 Bus. Hwy 27 South, Buchanan, Georgia\n\u0095\tOwnership: Blossman Buchanan Terminal operated by Legend, LLC\n\u0095\tOperations Overview: The wholesale butane terminal stores, handles, and distributes liquefied petroleum gas (butane). The facility includes tanks for storage, loading/unloading areas, pumps, compressors, and safety systems. \n\u0095\tProcess Description: The butane terminal receives butane from suppliers, stores it in six 30,000-gallon pressurized tanks, and distributes it to customers via trucks. A maximum of 12 rail cars (either full or empty) may be stored on the siding at a time. The process involves the transfer of butane to and from storage tanks. \n2. Management Structure\nLegend LLC is the operator of the Blossman Buchanan Terminal.  The Director of Operations has the responsibility for personnel involved in safety, incident management, and emergency response at the facility and implementation of all facets of the RMP and PSM.  The Terminal Manager oversees the day-to-day operations and ensures compliance with safety and regulatory standards.\n3. Accidental Release Prevention Program\nSafety of the public and environment as well as the safety of the employees is paramount. The facility complies with the NFPA 58.  Additionally, the facility complies with applicable federal, state and local laws with respect to the safe handling of butane. The facility meets or exceeds these requirements to ensure there is minimal risk of an accidental release. \n4. Emergency Response Program\nIf an emergency were to occur, procedures are in place to notify the local Police and Fire Department and request that they respond to the emergenc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000120151,
      "SummaryText": "y. The terminal has a registered emergency response plan with CHEMTREC that provides information and assistance in the event of an emergency. There is also a 24-hour company emergency number that can assist with coordinating emergency responders and recommend courses of action in emergency scenarios.  The local fire department has participated in terminal walk throughs. The terminal plans to have joint exercises with the Buchanan police and fire departments and LEPC as per the requirements of the RMP.\n4. Worst-Case and Alternative Release Scenarios\n\u0095\tWorst-Case Scenario: As defined by the EPA, is the failure of a single largest tank, in this case, one 30,000-gallon storage tank when filled to the greatest amount allowed (88% at 77°F), resulting in a vapor cloud explosion. The resulting distance to the endpoint extends offsite, and public receptors are within the distance to the endpoint.\n\u0095\tAlternative Release Scenario: as determined by the Potential Failure Modes and Effects Analysis (PFMEA), a quantitative study of all potential hazards, is a 1\u0094 break in a 4-inch diameter pipe leading to a 10-minute release and explosion. \n5. General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\u0095\tMechanical Integrity Program: Regular inspections of equipment, maintenance of tanks and equipment, and replacement of aging components to prevent leaks and failures.\n\u0095\tProcess Hazard Analysis (PHA): Use of hazard analysis tools (FMEA) to evaluate risks, identify hazards, and implement risk mitigation measures. The team performing the PFMEA consisted of a professional engineer, regional terminal manager, terminal manager, two senior operators and a director of operations with experience in the design, operation, logistics, trucking and rail transport and maintenance of butane facilities and the risk assessment process. \n6. Emergency Response Program\n\u0095\tTraining and Drills: Regular training for all employees on emergency response procedures, first aid, and the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000120151,
      "SummaryText": "use of emergency equipment. Drills are conducted every 5 years with local emergency responders and an annual tabletop exercise is conducted with other Terminal Managers and Operators.\n\u0095\tResponse Coordination: The terminal maintains an emergency contact list that includes local, state, and CHEMTREC. \n\u0095\tIncident Management System: A clear incident reporting system that allows employees to document and review all incidents, near misses, and emergency response actions.\n7. Operational and Process Safety Systems Required\n\u0095\t\"Query System\": The truck driver must be in attendance during any butane transfer operation. The query system will periodically prompt the attendant via green flashing light to ensure they are present and alert; if no response is received, the query system will automatically shut down the transfer of the truck loading rack.\n\u0095\tManual and electronic shutdown: When an emergency stop button is pressed, all pneumatic lines are emptied closing the ESV and ISV valves isolating each tank, pump and compressor operations cease, an alarm sounds, and the motorized entrance gate opens. The emergency shutdown system is tied into a central Programmable Logic Controller (PLC) that is tied to multiple safety devices.  In the event of a power failure or PLC shutdown, 3-way solenoid valves supplying air to all ESV\u0092s and ISC\u0092s close, releasing pressure, closing these valves, and isolating the tanks.  There are hydrocarbon detectors that will activate the emergency shutdown system when excess concentrations of butane are detected. \n\u0095\tHeat sensitive (thermal) devices: In the event of a fire, the tubing and / or the thermal fusible links/plugs installed in the valves melt, releasing pressure, closing the ESVs and ISC valves and isolating each tank. The pneumatic lines are supplied by an air compressor.  \n\u0095\tFire and Explosion Prevention Systems: Installation relief valves, fire extinguishers, LEL monitors are employed to mitigate the risks associated with butane.\n\u0095\tHose assem"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000120151,
      "SummaryText": "blies with rupture protection: The transfer hoses on the truck rack are equipped with an internal spring and closing flapper valves at both ends which will close the hose ends during a hose rupture or pull-away event, to greatly reduce product loss. \n8. Training Requirements\n\u0095\tGeneral Safety Training: All employees are trained in general safety practices, including the safe handling of butane, emergency evacuation procedures, and personal protective equipment (PPE) usage. \n\u0095\tSpecific Process Training: Operators and maintenance personnel undergo specialized training in operating procedures, maintenance, and emergency response. Operators must complete including having a record of training for completing butane specific Certified Employee Training Program (CETP) or PERC Education Program (PEP) courses as designated by the Propane Education & Research Council (PERC). All drivers must have completed the necessary CETP courses to transfer butane as well as be trained in the site-specific transfer and emergency procedures. Only approved drivers will be able to perform loading operations at the facility. Records of personnel, driver, and contractor training are kept on file. \n\u0095\tRefresher Training: Refresher courses and drills to ensure all employees stay updated on procedures and regulations.\n9. Operating Procedures\n\u0095\tStandard Operating Procedures (SOPs): Detailed SOPs cover all aspects of facility operation, including receiving, storage, loading/unloading, and emergency shutdown.\n\u0095\tSafety Procedures: Clear guidelines for hazard identification, reporting, and mitigation during daily operations.\n10. Maintenance Procedures\n\u0095\tPreventive Maintenance: All equipment is subject to regular preventive maintenance, including tank inspection, pump servicing, and valve calibration. This ensures early detection of issues and reduces the risk of failures.\n11. Incident Reporting\n\u0095\tInternal Reporting System: Employees are encouraged to report any incidents or near-misses through a formal r"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000120151,
      "SummaryText": "eporting system. Each report is evaluated, and corrective actions are implemented as necessary.\n\u0095\tFive Year Accident History: The butane terminal has never had an accident involving butane that caused deaths, injuries, property or environmental damage, evacuations, or dwellings in place.\n\u0095\tExternal Reporting: As required by law, incidents that meet certain criteria (e.g., significant releases, fatalities) are reported to local authorities, the EPA, and OSHA within specified timeframes.\n\u0095\tIncident Investigation: Every reported incident is thoroughly investigated to identify root causes and prevent recurrence. Corrective and preventive actions are documented and tracked to closure.\n12. Conclusion\nThis Risk Management Plan outlines the proactive steps the butane terminal in Buchanan, Georgia, has taken to prevent accidental releases and prepare for emergency responses. It also defines the procedures, safety systems, and regulatory compliance requirements to ensure the facility operates safely and in line with all relevant environmental and safety standards.\nThis plan is to be updated regularly and customized to reflect changes in operations, equipment, and safety regulations. Regular training, audits, and emergency drills are essential to ensure the plan\u0092s effectiveness."
    }
  ]
}