{
  "FacilityID": 1000003894,
  "FacilityName": "Goal Line, LP",
  "FacilityStr1": "555 N. Tulip St",
  "FacilityStr2": null,
  "FacilityCity": "Escondido",
  "FacilityState": "CA",
  "FacilityZipCode": "92025",
  "Facility4DigitZipExt": "2532",
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.118611",
  "FacilityLongDecDegs": "-117.098889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 861499762,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "PurEnergy, LLC",
  "OperatorStr1": "1732 W. Genesee St",
  "OperatorStr2": null,
  "OperatorCity": "Syracuse",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13204",
  "OperatorZipCodeExt": "1904",
  "FTE": 10,
  "OtherEPAFacilityID": "Cal000122995",
  "EPAFacilityID": "100000122173",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "911504",
  "SafetyInspectionDate": "2007-06-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-06-03 00:00:00",
  "DeRegistrationEffectiveDate": "2020-08-28 00:00:00",
  "AnniversaryDate": "2014-06-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.11862,
  "FRS_Long": -117.09927,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000004797,
      "AltID": "SCR Ammonia System",
      "FacilityID": 1000003894,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000005379,
          "ProcessID": 1000004797,
          "ChemicalID": 57,
          "Quantity": 41400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000004991,
          "ProcessID": 1000004797,
          "NAICSCode": "221119",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000003006,
              "Process_NAICS_ID": 1000004991,
              "SafetyReviewDate": "2008-09-11 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "Yes",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2009-03-04 00:00:00",
              "ChangeCompletionDate": "2009-09-04 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-09-11 00:00:00",
              "TrainingReviewDate": "2008-09-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-01-15 00:00:00",
              "EquipmentInspectionDate": "2006-06-15 00:00:00",
              "EquipmentTested": "Ultrasonic Tests",
              "ComplianceAuditDate": "2008-09-11 00:00:00",
              "AuditCompletionDate": "2009-03-11 00:00:00",
              "IncidentInvestigationDate": "2007-07-10 00:00:00",
              "InvestigationChangeDate": "2008-08-31 00:00:00",
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000003094,
                  "PreventionProgram2ID": 1000003006,
                  "ProcessChemicalID": 1000005379
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000003894,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fire Department, HAZMAT Division",
    "CoordinatingAgencyPhone": "6193382222",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000003894,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe facility has developed a risk management program and emergency response plan to address California Accidental Release Prevention (CalARP) Program requirements (California Health & Safety Code, Title 19, Division 2, Chapter 4.5, Â§2735-2785) .  Goal Line LP is extremely diligent in the handling of all chemicals and is dedicated to the safety of its employees and the neighboring community. Goal Line LP staff are highly trained and utilize modern equipment to monitor the facility and provide safeguards, while effectively and safely using ammonia as a refrigerant and for controlling NOx emissions. \n\nThe Goal Line LP facility has a long standing commitment to its workers and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the Ammonia Absorption Refrigeration and Ammonia Injection Systems. Goal Line LPÂ¿s policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.\n\nThe facilityÂ¿s charge of aqueous ammonia is 41,400 lbs.  Therefore, it is over the 20,000 lbs threshold (20% or greater concentration) for EPA RMP and the 500 lbs (all concentrations) state threshold for California Accidental Release Prevention (CalARP) Program.  Goal Line LP is not subject to Cal/OSHA PSM or Program 3 requirement due to the fact that the concentration of aqueous ammonia managed at the Facility is 30% and the Cal/OSHA PSM threshold quantities of aqueous ammonia is only for concentrations greater than 44%. For the reasons mentioned above, the Ammonia Injection System is subject to CalARP Program Level 2 and EPA RMP Program Level 2.\n\nThe Absorption Refrigeration UnitÂ¿s charge of anhydrous ammonia is 5,160 lbs.  The regulated substance is over the 500 lb threshold for the California Accidental Release Prevention (CalARP) Program but under the E"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000003894,
      "SummaryText": "PA RMP and Cal/OSHA PSM Program threshold quantity of 10,000 lbs.  Therefore, the Absorption Refrigeration Unit is only subject to CalARP Program Level 2.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Goal Line LP facility is located at 555 Tulip Street, Escondido, California. The facility is a combined cycle cogeneration facility that provides 50mW of energy and capacity to the local utility and employs 10 people at this location. The plant produces electrical power and supplies steam for operation of the ice arena.  The remaining electrical power, after satisfying the facility auxiliary energy needs, is sold to San Diego Gas and Electric Company (SDG&E).\n\nThe regulated substances in use are: anhydrous ammonia for the Ammonia Absorption \nRefrigeration Unit and 30% aqueous ammonia for both the Ammonia Injection System and the Ammonia Absorption System.\n\nThe maximum inventory and storage for the regulated substances are contained in the following vessels:\nÂ¿\tAqueous Ammonia Storage Tank (T-1902-1) Â¿ 41,400lbs\nÂ¿\tAnhydrous Ammonia Storage Receiver (V-1804-14) Â¿ 5,160 lbs\n\n\n\nHAZARD ASSESSMENT SUMMARY/OFFSITE CONSEQUENCE ANALYSIS\n\nAmmonia Injection System Â¿ 30% Aqueous Ammonia\n\nWorst-Case Release Scenario Results Summary\n\nScenario Description: One worst case analysis has been defined as a release of the maximum quantity of aqueous ammonia that can be stored in the largest equipment item in a ten (10) minute period.\n\nAlternative Release Scenario Results Summary\n\nScenario Description: A more realistic alternative release scenario was modeled as a release of aqueous ammonia as a result of a rupture of a transfer hose used to fill aqueous ammonia to the SCR Ammonia Storage Tank. \n\n\nRisk Considerations\n\nAlthough the storage and use of anhydrous and aqueous ammonia has inherent potential risks, and worst-case release scenarios can potentially reach the community; Goal Line LP has recognized these potential risks and structured its safety programs to make the worst case t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000003894,
      "SummaryText": "ype of event non-credible.  In addition to the safety practices of the company and plant personnel to make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event (e.g., In the event of a release, sudden rupture and flashing of ammonia would be highly turbulent.  Turbulence causes entrainment of air and the released vapor dilutes much more quickly than is shown in the model).\n\nIn addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with an ammonia release:\n\nÂ¿\tAlthough, the facility is not subject to Cal/OSHA PSM, the facility prevention program meets and exceeds the PSM requirements.\nÂ¿\tAmmonia sensors are located in the process area.\nÂ¿\tAutomatic/Manual shutdowns in place.\nÂ¿\tPersonal Protective Equipment (PPE) is used by plant personnel, as necessary.\nÂ¿\tThe history of the Goal Line LP facility (i.e., no CalARP-applicable ammonia releases) reflects the adequacy of the design and diligence of the plant staff in safely operating the Ammonia Absorption Refrigeration and Selective Catalytic Reduction Units. \n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAs part of the implementation of this CalARP Program, even though the Ammonia Absorption Refrigeration Unit and The Ammonia Injection System for Selective Catalytic Reduction are only subject to Prevention Program 2 requirements, Prevention Program 3 elements were implemented by Goal Line LP to manage process safety issues associated with the use of ammonia for the NOx abatement, as well as for the refrigeration system. In addition, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000003894,
      "SummaryText": "The required CalARP Prevention Program 2 elements include:\nÂ¿\tSafety Information\nÂ¿\tHazard Review\nÂ¿\tOperating Procedures\nÂ¿\tTraining\nÂ¿\tMaintenance\nÂ¿\tCompliance Audits\nÂ¿\tIncident Investigation\n\nFurthermore, key emergency response elements are addressed in the facilityÂ¿s Emergency Action Plan.  See EMERGENCY RESPONSE PROGRAM below.\n\nFIVE-YEAR ACCIDENT HISTORY\nThere have been no CalARP-applicable releases of ammonia at Goal Line LP in the past five years.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Goal Line LP facility is owned by PurEnergy and operated by PurEnergy Operating Services, LLC (PEOS). Goal Line LP supplies thermal coolant to the Iceoplex Sports Facility for the operation of its equipment/facility and supplies surplus electricity to San Diego Gas & Electric.  \nThe Goal Line LP facility has filed a Chemical Inventory Business Emergency Plan with the San Diego county Hazardous Materials Division and this plan includes:\n\nÂ¿\tEmergency Alarm Procedures\nÂ¿\tEvacuation Procedures\nÂ¿\tSafety and Health Considerations\nÂ¿\tNotification Procedures\n\nThis Plan meets the requirements of the Emergency Action Plan (EAP) of the CCR Title 8 Â§3220.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\nThe Hazard Review study has been conducted to examine mitigation measures to improve safety at the facility.  Planned changes to improve safety are listed as recommendations in the March 4th, 2009 Hazard Review Report.  Any outstanding recommendations will have been addressed by September 2009.\n\n\nREGISTRATION INFORMATION\nA copy of the RMP Submittal printout is provided in section 6.0.\n\n\nFLAMMABLES: WORST CASE\nThe use of flammable materials Goal Line LP is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable. \n\nFLAMMABLES: ALTERNATIVE RELEASE\nThe use of flammable materials at the facility is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable.\n\n\nPREVENTION PROGRAM LEVEL\nThe Ammonia Absorption"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000003894,
      "SummaryText": "Refrigeration System is a CalARP Program Level 2 process, the Ammonia Injection System is a CalARP Program Level 2 and EPA RMP Program Level 2 process but Goal Line LP implements a Â¿Prevention Program 3Â¿ for both processes. Supplemental information for Program 3 elements is located in the Goal Line LP CalARP Compliance Workbook; the relevant references are listed in Table 1.\n\n\nEXTERNAL EVENTS ASSESSMENT\n\nPursuant to the requirements of California Health & Safety Code, Title 19, Division 2, Chapter 4.5, Â§2745.6(l), the following are the external events that are requisite by the regulations:\n\nÂ¿\tThe types of natural and human caused external events considered in PHA Section 2760.2 or Hazard Review Section 2755.2.  \nÂ¿\tThe estimated magnitude or scope of external events which were considered. If not known, the owner or operator of the stationary source shall work closely with the AA to determine what is required. If seismic events are applicable, the parameters used in the consideration of the seismic analysis and which edition of the Uniform Building Code was used when the process was designed.\n\n\nÂ¿\tFor each external event, with a potential to create a release of a regulated substance that will reach an endpoint offsite, apply \no\tThe expected date of completion of any changes resulting from the PHA;\no\tMajor hazards identified;\no\tProcess controls in use;\no\tMitigation systems in use;\no\tMonitoring and detection systems in use; and,\no\tChanges since the last Hazard Review.\nÂ¿\tThe date of the most recent field verification that equipment is installed and maintained as designed.\n\nAll of the regulatory requirements for external events that can conceivably cause a release of ammonia at Goal Line LP where addressed during the March 4th 2009 Hazard Review. The results can be found in the Hazard Review documentation located in the CalARP Compliance Workbook."
    }
  ]
}