{
  "FacilityID": 1000002269,
  "FacilityName": "Super Store Industries Turlock Dairy Division",
  "FacilityStr1": "2600 Spengler Way",
  "FacilityStr2": null,
  "FacilityCity": "Turlock",
  "FacilityState": "CA",
  "FacilityZipCode": "95380",
  "Facility4DigitZipExt": "8591",
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.486572",
  "FacilityLongDecDegs": "-120.879486",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 809982911,
  "ParentCompanyName": "Super Store Industries",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Super Store Industries/Yancy Hopper",
  "OperatorStr1": "2600 Spengler Way",
  "OperatorStr2": null,
  "OperatorCity": "Turlock",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95380",
  "OperatorZipCodeExt": "8591",
  "FTE": 205,
  "OtherEPAFacilityID": "95380MDVLL2600",
  "EPAFacilityID": "100000043552",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-12-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-05-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-05-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.48371,
  "FRS_Long": -120.87999,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002936,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000002269,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000003218,
          "ProcessID": 1000002936,
          "ChemicalID": 56,
          "Quantity": 120000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000003045,
          "ProcessID": 1000002936,
          "NAICSCode": "31151",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000001882,
              "Process_NAICS_ID": 1000003045,
              "SafetyReviewDate": "2009-01-28 00:00:00",
              "PHA_Date": "2009-01-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-01-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installation of new condenser.",
              "OpProceduresReviewDate": "2009-01-28 00:00:00",
              "TrainingReviewDate": "2009-01-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Educational Software",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-01-28 00:00:00",
              "EquipmentInspectionDate": "2009-01-17 00:00:00",
              "EquipmentTested": "Cleaning of condensers.",
              "ChangeMgmtDate": "2008-04-28 00:00:00",
              "ChangeMgmtReviewDate": "2009-01-28 00:00:00",
              "PreStartupReviewDate": "2008-07-16 00:00:00",
              "ComplianceAuditDate": "2009-01-28 00:00:00",
              "AuditCompletionDate": "2010-01-28 00:00:00",
              "IncidentInvestigationDate": "2008-12-26 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-01-28 00:00:00",
              "HotWorkPermitReviewDate": "2009-01-28 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2009-01-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000002225,
                  "PreventionProgram3ID": 1000001882,
                  "ProcessChemicalID": 1000003218
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000003046,
          "ProcessID": 1000002936,
          "NAICSCode": "31152",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000003047,
          "ProcessID": 1000002936,
          "NAICSCode": "311411",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000002269,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-01-28 00:00:00",
    "ERTrainingDate": "2008-05-21 00:00:00",
    "CoordinatingAgencyName": "Stanislaus County",
    "CoordinatingAgencyPhone": "2095256700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000002269,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Super Store Industries Turlock Dairy Division abides by the emergency response procedures and policies detailed in the Emergency Response Plan manual.  This Plan was designed to meet the following objectives:\n\n - To save lives.\n - To minimize and avoid injuries.\n - To protect the environment.\n - To minimize property damage.\n\nSuper Store Industries maintains an emergency response committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes. \n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Super Store Industries facility is located at 2600 Spengler Way in Turlock, California.  This location is situated along Kilroy Road, approximately 0.6 miles south of West Main Street and 0.7 miles west of Highway 99.  The area is primarily industrial with sparse residential areas to all sides. \n\nThe facility manufactures food products such as orange juice, flavored drinks, ice cream, sour cream, cheese, and yogurt.  The facility was originally built in 1988.  The facility was later expanded in 1994 to install additional processing equipment.  The facility currently covers approximately 148,000 square feet.  \n\nThe Super Store Industries Turlock Dairy Division uses anhydrous ammonia as a refrigerant within a closed system.  The system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cold storage rooms and process equi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000002269,
      "SummaryText": "pment.  Changes in pressure are directly related to changes in temperature.  For example, lowering the ammonia pressure lowers its temperature.  Low pressure (cold) liquid ammonia provides refrigeration by removing ambient heat.  Removal of ambient heat causes the liquid ammonia (contained within the system) to vaporize.  Heat is later removed from the ammonia as it is condensed back into a liquid.  Typical operating conditions range from vacuum (approximately 14.4\" Hg) on the low pressure side of the system to 150-160 psig on the high side.\n\nAmmonia is used as the refrigerant in the refrigeration process.  The total ammonia inventory is 117,500 pounds.  \n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted and repaired immediately.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAdministrative Measures\n\nThe Super Store Industries ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the Super Store Industries facility operates in accordance with Cal-OSHAÂ¿s Process Safety Management regulation.\n\nThe Super Store Industries facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia leak detectors in the machine room and the cold storage areas, and automatic shut down mechanisms that protect the integrity of the machinery.  All pressure vessels are equipped with pressure relief valves"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000002269,
      "SummaryText": "that vent pressure in case of an extremely high pressure situation.\n\nEngineering/Design Measures\n\nSuper Store Industries operates the ammonia refrigeration system to maintain appropriate temperatures for manufacturing and storing various food products.  The system has several inherent features including:\n\n1. Ammonia, when properly handled, has proven to be a reliable and safe refrigerant.  Industry has used ammonia as a refrigerant for over 100 years.\n\n2. The facility is manned 24 hours a day with qualified ammonia personnel.  Having personnel always on-site shortens the response time in the event that an ammonia-related emergency occurs at the facility.\n\n3. An off-site company is used to monitor system alarms.  In the event of an alarm, the offsite company contacts the plant and also designated off-duty personnel (as necessary).  \n\n4. The facility is located in an industrial area away from concentrated residential populations.  This location decreases the probability of impacting sensitive populations in the event of an ammonia release.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nAn investigation into the Super Store Industries Â¿ Turlock facility accident history revealed that there have been no releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds over the past five years (March 2004 Â¿ March 2009). In addition, there have been no injuries resulting from an ammonia release.  However, the facility had two ammonia releases, which are both summarized below: \n\n2007 Ammonia Incident\n\nOn August 9, 2007, at approximately 11:30 PM, an employee in the Ice Cream Department smelled ammonia in the Ice Cream Fill Room and notified system engineers.  Two engineers entered the Fill Room wearing air purifying respirators (APRs) to look for the leak.  They noticed that a large amount of ice had accumulated inside the access panels of Ice Cream Freezer No. 800-2.  The engineers decided to spray water on the panels to remove the ice.  At the time, the engineers were un"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000002269,
      "SummaryText": "aware that the source of the leak was coming from a broken sight glass tube on the Freezer.  Thus, while they were spraying water, the ice on the sight glass tube had melted as well, allowing liquid ammonia to jet out onto the floor.  The engineers immediately exited the Fill Room since the ammonia concentration in the area overwhelmed the protection capability of their APRs.  The engineers notified the supervisors of the situation and then went to the Engine Room to shut off the valve controlling the ammonia flow to the ice cream room.  The supervisor instituted the Incident Command System and evacuated employees who were working around the Fill Room. \n\nCalifornia OES was notified of the release.  There were no employees injured during this event.  Some ice cream product was contaminated.  Other than the sight glass, no machinery was damaged.  Action items that resulted from the incident investigation include enhanced emergency response policies and procedures and improved training for system engineers.\n\n2008 Ammonia Incident\n\nOn December 26, 2008, at approximately 4:20 AM, an engineer who was conducting maintenance on Ice Cream Freezer No. 800-2 turned on the hot gas valve to check for leaks.  The engineer smelled ammonia and immediately closed the hot gas valve.  The engineer left the area to retrieve the handheld ammonia detector.  Upon his return, he checked the ammonia concentration in the room and the detector gave a readout of 12 ppm.  The ammonia in the room had vented through the roof via the HVAC system for the Ice Cream Room.  After further investigation, the engineer discovered that a piece of metal was caught in the seat of the oil drain valve.  The engineer replaced the defective valve and successfully leak tested the freezer.\n\nAt approximately 4:30 AM, a truck driver informed the engineer that a facility security guard had smelled ammonia in the alley outside northwest portion of the new freezer.  The engineer went to the area with the ammonia detect"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000002269,
      "SummaryText": "or on hand.  The detector did not pick up any ammonia in the vicinity.  The engineer asked the security guard to show him the location where she had smelled the ammonia.  In the area that she indicated was a tank containing waste oil drained from PR2.  The ammonia in the oil was gassing off and a mild scent was present.  The detector did not produce a readout since the ammonia concentration was so slight.  It was determined that the source of the smell reported by the security guard came from the waste oil tank and also potentially from the ammonia that had vented off from the Ice Cream Room.  The amount of ammonia released was approximately 0.1 pounds.  \n\nCalifornia OES and the Stanislaus County Health Department were notified of the release.  There were no employees injured during this event.  Action items that resulted from the incident investigation include enhanced emergency response training for system engineers regarding immediate internal notification of any sized release and evaluation of the feasibility of moving the waste oil tank to a less traveled area of the facility. \n\n\nEMERGENCY RESPONSE PROGRAM\n\nSuper Store Industries has implemented an Emergency Response Team that is trained to handle an ammonia release.  All refrigeration operators are OSHA Technician Level trained (24 hours) and all supervisors are OSHA First Responder Operations Level trained (8 hours).  The Super Store IndustriesÂ¿ Â¿Emergency Response PlanÂ¿, is designed to meet the requirements for \"Process Safety ManagementÂ¿, and give our employees and community the maximum protection in the event of an ammonia release.\n\nThe contents of this plan are used in the Hazardous Materials Management Plan which is filed with the Stanislaus County Department of Environmental Resources, as well as to update the existing plan in the Training Program Manual. The process for developing the best possible mitigation to any release large or small is through employee participation using the Â¿Process Safety"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000002269,
      "SummaryText": "Management CommitteeÂ¿, and any site specific documented plan previously used. \n\nThe Â¿Response PlanÂ¿ includes continuously changing scenarios that are discussed during those meetings to always improve Response Safety.  An Â¿Emergency Response TeamÂ¿ located at this facility as well as Â¿First Responders Operational ProgramÂ¿ gives Super Store Industries both defensive and offensive protection.\n\nSuper Store Industries conducts on-site emergency drills to provide training and to evaluate employee response in the event of a potential release. Fire drills can be incorporated using the scenarios that the wind may have disrupted the designated area on occasion.  \n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe facility has worked to address safety issues as they arise in a continued effort to ensure a safe work environment.  A Compliance Audit and a PHA Revalidation was completed in January 2009 that generated recommendations to improve safety at the facility.  These include updating the PSM/RMP documentation, updating the preventive maintenance practices to conform more-closely with industry standards, and implementing policies to regularly test emergency shut off control systems.  Super Store Industries is proceeding with the few remaining mitigation measures associated with these studies.  \n\nThe corporate Safety Manager is working with the plant engineers to ensure appropriate safety programs are implemented and that identified safety issues are resolved.\n\nREGISTRATION NOTE:\n\nThe Super Store Industries Â¿ Turlock facility uses 117,500 pounds of ammonia in the refrigeration system.  However, EPA requires that the quantity be reported to two significant digits.  Therefore, for Section 1.17 of the RMP submittal, the quantity was reported as 120,000 pounds."
    }
  ]
}