{
  "FacilityID": 1000044963,
  "FacilityName": "Salinas River Cogeneration Facility",
  "FacilityStr1": "Star Route 42",
  "FacilityStr2": "Sargent Canyon Road",
  "FacilityCity": "San Ardo",
  "FacilityState": "CA",
  "FacilityZipCode": "93450",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "35.951667",
  "FacilityLongDecDegs": "-120.868056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 947392395,
  "ParentCompanyName": "Chevron",
  "Company2Name": null,
  "CompanyDUNS": 947392395,
  "Company2DUNS": 947392395,
  "OperatorName": "Chevron Power Holdings Inc.",
  "OperatorStr1": "P.O. Box 81438",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93380",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": "CA0000853176",
  "EPAFacilityID": "100000074705",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "TV73-01",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-04-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-12-11 00:00:00",
  "DeRegistrationEffectiveDate": "2020-12-08 00:00:00",
  "AnniversaryDate": "2019-06-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.9516,
  "FRS_Long": -120.8679,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055656,
      "AltID": "SCR System",
      "FacilityID": 1000044963,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067906,
          "ProcessID": 1000055656,
          "ChemicalID": 56,
          "Quantity": 69960.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000056575,
          "ProcessID": 1000055656,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000046562,
              "Process_NAICS_ID": 1000056575,
              "SafetyReviewDate": "2013-11-11 00:00:00",
              "PHA_Date": "2011-07-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-07-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Error",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-07-24 00:00:00",
              "TrainingReviewDate": "2013-11-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-08-15 00:00:00",
              "EquipmentInspectionDate": "2012-04-11 00:00:00",
              "EquipmentTested": "Storage Tank",
              "ChangeMgmtDate": "2013-08-01 00:00:00",
              "ChangeMgmtReviewDate": "2012-08-16 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2014-01-28 00:00:00",
              "AuditCompletionDate": "2014-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-11-30 00:00:00",
              "HotWorkPermitReviewDate": "2013-01-31 00:00:00",
              "ContractorSafetyReviewDate": "2013-01-01 00:00:00",
              "ContractorSafetyEvalDate": "2013-04-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000056382,
                  "PreventionProgram3ID": 1000046562,
                  "ProcessChemicalID": 1000067906
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000044963,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-12-31 00:00:00",
    "ERTrainingDate": "2013-09-19 00:00:00",
    "CoordinatingAgencyName": "Monterey County Health Department",
    "CoordinatingAgencyPhone": "8317554511",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044963,
      "SummaryText": "1.  The Accidental Release Prevention And Emergency Response Policies At Your Facility\r\nThe Salinas River Cogeneration Company (SRCC) accidental release prevention policy involves a unified approach that integrates proven technology, staff training on operation and maintenance practices, and tested management system practices. Applicable procedures of the State of California and United States Environmental Protection Agency (US-EPA) are adhered to, including training, systems management, and emergency response procedures. SRCC recognizes its responsibility to make employee, community and environmental protection an integral part of daily operations. It is committed to being a responsible member within the community by giving top priority to conducting operations in a safe and environmentally sound manner.\r\n\r\nIt is the policy of SRCC that every employee is entitled to a safe and healthful place in which to work. SRCC incorporates the concepts of environmental responsibility and with safety into all aspects of base operations. As part of SRCC's obligation to protect the integrity of human, environmental, physical, and financial resources, and to conserve and efficiently utilize those resources, SRCC will: comply fully with laws regulating environmental protection and employee health and safety; furnish work places free of recognized hazards likely to cause injury to people and the environment; train employees in safe and environmentally conscious practices and require compliance with environmental, health, and safety regulations, policies, and procedures; and provide professional staff to maintain and support environmental, health, and safety programs.\r\n\r\n2.  Your Facility And The Regulated Substances Handled\r\nSRCC located in San Ardo, California in the County of Monterey. SRCC operates one natural gas fired combustion turbine generator. SRCC is a cogeneration plant that produces electricity and steam which is utilized for enhanced oil recovery. SRCC utilizes Selectiv"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044963,
      "SummaryText": "e Catalytic Reduction (SCR) technology to reduce combustion Oxides of Nitrogen (NOx) emissions. SCR is a post-combustion flue gas NOx emission control technology that removes NOx from the flue gas downstream from the combustion process. A reducing agent is used to reduce NOx emissions by oxidation-reduction reactions in the presence of a catalyst. Injection of the reducing agent/air mixture into the combustion exhaust stream before the catalyst initiates the reactions and achieves the desired removal of NOx emissions upstream from the stack. \r\n\r\nThe SRCC uses anhydrous ammonia (Chemical Abstracts Service #7664-41-7) as the reagent for the SCR system. The maximum amount stored on site is 69,960 lbs.  A single 15,000-gallon (69,960 lbs) anhydrous ammonia tank is provided to support the SCR at the SRCC. Maintenance and loading of the anhydrous ammonia storage tank has been contracted out. Transport of anhydrous ammonia to SRCC is accomplished using tanker trucks, with individual deliveries of about 5,000 to 7,000 gallons. Deliveries are scheduled every three to five weeks. The storage tank lies within an enclosed dike and is equipped with a deluge system. The deluge system is currently not in use.  In addition, the ammonia-handling facility is equipped with process area detectors to protect workers and equipment in the event of a malfunction. \r\n\r\nThe use of equipment for the storage and handling of anhydrous ammonia in support of the SRCC SCR system will require compliance with federal Risk Management Program (RMP), California Accidental Release Prevention (CalARP), Federal Occupational Health and Safety Administration (OSHA) Process Safety Management (PSM) and California OHSA PSM. The quantity of ammonia on-site exceeds Federal RMP and CalARP threshold quantities. SRCC is required to implement a federal RMP plan pursuant to Code of Federal Regulations (CFR), Title 40, Section 68. SRCC is also required to implement a CalARP plan pursuant to California Code of Regulatio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044963,
      "SummaryText": "ns (CCR), Title 19, Division 2, Chapter 4.5. The quantity of ammonia on-site exceeds Federal and California PSM threshold quantities. SRCC is required to implement a federal PSM plan pursuant to CFR, Title 29, Section 1910.119. The California PSM requirement is implemented pursuant to CCR, Title 8, Division 1, Chapter 4, Section 5189.  \r\n\r\nThe SRCC federal RMP plan is administered by US-EPA.  The CalARP plan is administered by the local administering agency (AA). In Monterey County, the AA is the local Certified Unified Program Agency - the Monterey County Health Department (MCDH). The RMP plan is submitted to both the US-EPA and MCDH. Additional information specific to CalARP is submitted to the MCDH. The RMP plan is submitted to US-EPA using the RMP*eSubmit program for online reporting. Copies are available on-site inside the Control Room Building at SRCC and easily accessible to employees and emergency personnel.\r\n3.  The General Accidental Release Prevention Program And Chemical-Specific Prevention Steps\r\nSRCC complies with federal and state RMP and PSM requirements, and is a key component of the SRCC prevention program. SRCC applies RMP and PSM processes to the entire plant. The SRCC RMP and PSM plans are located in the control room and are updated as required to reflect changes in operating procedures. The plans at SRCC are based on the following key elements:\r\n¿\tDetailed management system and clear levels of responsibilities and team member roles.\r\n¿\tComprehensive process safety information that is readily available to staff, emergency responders, and contractors.\r\n¿\tComprehensive preventive maintenance program.\r\n¿\tPerformance of process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\r\n¿\tUse of state-of-the-art process and safety equipment.\r\n¿\tUse of accurate and effective operating procedures, written with the participation of the operators.\r\n¿\tHigh level of training of the operators and maintenance"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044963,
      "SummaryText": "staff.\r\n¿\tImplementation of an incident investigation, inspection, and auditing program using qualified staff.\r\n\r\nThe anhydrous ammonia storage and injection system has also been designed to minimize the risk of releases. Some of the chemical specific prevention and mitigation safeguards are described below:\r\n¿\tThe storage area is equipped with process area detectors with both audible and control room alarms.\r\n¿\tThe storage area is equipped with pressure relief devices, check valves, manual and automatic shutoff valves, interlocks, alarms and procedures to prevent or limit the severity of a release.\r\n¿\tThe storage area is encircled by a dike that contains any spills and leaks.\r\n\r\n4.  The Five-Year Accident History\r\nSRCC has had no accidents with offsite consequences within the past five years.\r\n\r\n5.  The Emergency Response Program\r\nAn Emergency Action Plan is stored in the SRCC Control Room which includes specific actions to be taken by employees in response to the event of an accidental release of a regulated substance. SRCC employees do not respond to accidental releases of regulated substances. The emergency responder is the Monterey County Fire Department and MCDH. The plan includes procedures for informing the public and local agencies responsible for responding to accidental releases, information on emergency health care, date of the most recent review or update of the emergency response plan, and date of the most recent emergency response training for employees. The name and telephone number of the local agency with which emergency response activities and the emergency response plan is coordinated is provided, along with a list of other federal or state emergency plan requirements to which SRCC is subject.\r\n\r\n6.  Planned Changes To Improve Safety\r\nThe hazards of the process were identified through interviews with plant personnel and during a HAZOP Process Hazard Analysis (PHA) conducted on July 27, 2011. Since no major equipment modifications or operational c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044963,
      "SummaryText": "hanges have occurred to the ammonia system, the PHA findings were substantively similar to previous PHA investigations."
    }
  ]
}