{
  "FacilityID": 1000054721,
  "FacilityName": "Crown Cooling",
  "FacilityStr1": "995 S 9th Street",
  "FacilityStr2": null,
  "FacilityCity": "Brawley",
  "FacilityState": "CA",
  "FacilityZipCode": "92227",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.965555",
  "FacilityLongDecDegs": "-115.533055",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Five Crowns Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Crown Cooling",
  "OperatorStr1": "995 S. 9th Street",
  "OperatorStr2": null,
  "OperatorCity": "Brawley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92227",
  "OperatorZipCodeExt": null,
  "RMPContact": "Luciano Cortez",
  "RMPTitle": "General Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000220655",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-07-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-02-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-01-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-01-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-01-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000068509,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000054721,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000069651,
          "ProcessID": 1000068509,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000084436,
          "ProcessID": 1000068509,
          "ChemicalID": 56,
          "Quantity": 30840.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000584436,
          "ProcessID": 1000068509,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000054721,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies\n\nCrown Cooling conducts inspection procedures to review refrigeration equipment prior to startup and during operations. These procedures identify potential sources of release and equipment corrections required to prevent these releases. On-site personnel and certified refrigeration contractors review the equipment as required.\n\nOn-site personnel provide initial emergency response. On-site personnel will make a preliminary assessment in the event of a release and will provide first response. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an off-site release. No emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel. Local fire and police departments with mutual aid response will provide emergency response for a major release event. The refrigeration contractors would also be on-call to provide emergency response.\n\nEmergency response training will be conducted yearly for current employees and as required to for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\n\n\n\n2. Stationary Source and Regulated Substances Handled\n\nCrown Cooling uses anhydrous ammonia as a refrigerant in their operations. The ammonia system is used for fresh produce and citrus cold storage, pressure cooling,hydrocooling and ice generation. There are three separate systems on the Crown Cooling Site. Crown Cooling I Facility, Crown Cooling II Facility, and Ice Maker Trailer. Crown Cooling II Facility is the largest system with the potential of greatest off-site consequence. \n\n\n\nCrown Cooling I facility refrigeration system is composed of both fixed and portable equipment. Fixed system includes, cold room evaporative cooling coils, pressure cooler system, pressure vessels, screw and reciprocating compressors, evaporative condensers, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000054721,
      "SummaryText": "brine chiller, and diffusion tank. Portable system is the hydrocooler skid. Facility has refrigeration machinery room housing reciprocating and screw compressors. \n\n\n\nCrown Cooling II facility refrigeration system is composed of fixed refrigeration equipment including screw compressors, evaporative condensers, pressure vessels, flooded type evaporative cooling coils and diffusion tank. Flooded type evaporative cooling coils provide cooling for one large pre-cooling room with two zones, one smaller pre-cooling room and one cold storage room which was added in November 2014.  Facility has refrigeration machinery room housing three screw compressors with thermosyphon oil cooling, high pressure receiver and dump transfer vessel. Suction accumulator is located on the refrigeration machinery room roof. \n\n\n\nIce Maker Trailer is owned by Crown Cooling company and composed of screw compressor, evaporative condenser, low pressure receiver, ammonia pump and an ice maker. \n\nThe total charge for all the refrigeration systems is approximately 30,840 lb Only Crown Cooling II facility has over 10,000 lbs of ammonia in the system which requires EPA RMP compliance.\n\nThe refrigeration system at this facility is a single-stage vapor compression cycle. \n\nAnhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/ or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. \n\n\n\n3. General Accidental Release Prevention Program\n\nCrown Cooling maintains a release prevention program to eliminate or minimize releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled mainte"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000054721,
      "SummaryText": "nance, and operator training. Incident Investigation program is also in place to analyze releases for ways to prevent a similar future release.\n\nThe ammonia refrigeration system has specific safety procedures to prevent a release. Operators and mechanics are trained for safe operation and maintenance of the refrigeration system. Qualified outside refrigeration contractors are used for maintenance other than minor procedures. They are also trained in emergency response procedures in the event of an ammonia release. There is emergency shut-off switch outside of the Crown Cooling II mechanical room for shutting down the system. Ammonia detectors are installed in all refrigerated rooms and the refrigeration machinery rooms. Personnel will automatically be notified if any detector exceeds its set point. Monitoring is done 24 hours per day. Both Crown Cooling I and II refrigeration machinery rooms are installed with automatic crossover valves that allows pressure to be relieved from high side to low side in case of emergency situations. All relief valves are tied into an ammonia diffusion tank to prevent high-pressure releases to ambient.\n\n\n\n4. Five-Year Accident History\n\nAccording to Crown Cooling personnel, in the past five years there have been no releases of anhydrous ammonia.\n\n\n\n5. Emergency Response Program\n\nCrown Cooling is a \"Non-Responding\" facility. Facility is only respond to situations that are within their capabilities. No emergency response actions or site clean-up that are beyond the capabilities of the refrigeration personnel will be performed. In case of an emergency, incident will be reported immediately to Facility Managers, RMP administrator and designated Emergency Responders as outlined in emergency response program.\n\nFacility manager will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if off-site evacuations are required.\n\n\n\n6. Planned Changes to Improve Safety\n\nSpecific recommen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000054721,
      "SummaryText": "dations resulting from the PHA and safety inspection are listed in the beginning of the Appendix as \"Correction Items\". All refrigeration equipment is well maintained and operated in a safe manner by trained personnel. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation.\n\n\n\n"
    }
  ]
}