{
  "FacilityID": 1000101243,
  "FacilityName": "Boghosian Raisin Packing Co., Inc.",
  "FacilityStr1": "726 S. 8th Street",
  "FacilityStr2": null,
  "FacilityCity": "Fowler",
  "FacilityState": "CA",
  "FacilityZipCode": "93625",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": null,
  "FacilityLatDecDegs": "36.621008",
  "FacilityLongDecDegs": "-119.674516",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Boghosian Raisin Packing Co., Inc.",
  "OperatorStr1": "726 S. 8th Street",
  "OperatorStr2": null,
  "OperatorCity": "Fowler",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93625",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000248797",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-06-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-06-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-06-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000125572,
      "AltID": "Sulfur Dioxide",
      "FacilityID": 1000101243,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000156935,
          "ProcessID": 1000125572,
          "ChemicalID": 49,
          "Quantity": 22000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000126965,
          "ProcessID": 1000125572,
          "NAICSCode": "311423",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000108239,
              "Process_NAICS_ID": 1000126965,
              "SafetyReviewDate": "2022-06-07 00:00:00",
              "PHA_Date": "2024-12-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-06-06 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-05-12 00:00:00",
              "TrainingReviewDate": "2022-06-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-06-09 00:00:00",
              "EquipmentInspectionDate": "2022-06-06 00:00:00",
              "EquipmentTested": "PHA Walkthrough",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2022-06-09 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2022-06-09 00:00:00",
              "HotWorkPermitReviewDate": "2022-06-09 00:00:00",
              "ContractorSafetyReviewDate": "2022-05-09 00:00:00",
              "ContractorSafetyEvalDate": "2022-06-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000135579,
                  "PreventionProgram3ID": 1000108239,
                  "ProcessChemicalID": 1000156935
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000101243,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fresno County Environmental Health",
    "CoordinatingAgencyPhone": "5596003271",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000101243,
      "SummaryText": "ll continue to maintain overall plant worker, public, and environmental safety."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000101243,
      "SummaryText": "t the necessary notification is performed. Additionally, if a notification is made in response to an accidental release, this would also satisfy the notification requirement.\r\n\r\n1.6 Planned Changes to Improve Safety\r\n\r\nBoghosian Raisin Packing Co. has implemented many policies and procedures to promote overall plant, worker, public, and environmental safety. Nevertheless, Boghosian Raisin Packing Co. continually strives to improve in all areas, including safety.\r\n\r\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP/PSM/CalARP Program. This has improved Boghosian Raisin Packing Co.'s ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP/PSM/CalARP related events so that Boghosian Raisin Packing Co.'s management team can ensure that the RMP/PSM/CalARP Program is being implemented.\r\n\r\nBoghosian Raisin Packing Co. has implemented all aspects of the RMP/PSM/CalARP Program. When a RMP/PSM/CalARP Program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\r\n\r\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Boghosian Raisin Packing Co. has also entered into a contract with Resource Compliance to obtain help with RMP/PSM/CalARP Program implementation.\r\n\r\nBoghosian Raisin Packing Co. considers the RMP/PSM/CalARP Program a living document. It is an interactive framework that guides safe action for Boghosian Raisin Packing Co. employees, but allows for feedback and continual improvement. Through the RMP/PSM/CalARP Program Boghosian Raisin Packing Co. wi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000101243,
      "SummaryText": "ergency Response Coordination Activities\r\nThe purpose of emergency response coordination activities is to coordinate response needs with local emergency planning and response organizations. The intent is for local response organizations to be made aware of the regulated substance at Boghosian Raisin Packing Co., the quantity, the risks presented by the covered process, and the resources and capabilities at our facility to respond to an accidental release of a regulated substance. The emergency response coordination activities will consist of the following:\r\nCoordinations will be completed at least annually. Additional coordinations will be made to account for changes at our facility that may affect the community emergency response plan.\r\n\r\nCoordinations will include Boghosian Raisin Packing Co.'s emergency response plan, updated emergency contact information, and any other information necessary for developing and implementing the local emergency response plan.\r\n\r\nCoordination activities will be appropriately documented. The coordination records will include the names of individuals involved and their contact information (phone number, email address, and organizational affiliations), dates of coordination activities, and nature of coordination activities.\r\n\r\nThe disclosure of information classified or restricted by the Department of Defense or other Federal agencies or contractors of such agencies is controlled by applicable laws, regulations, or executive orders concerning the release of that classified or restricted information.\r\n\r\n1.5.2 Emergency Response Notification Exercises\r\n\r\nAt least once per calendar year, Boghosian Raisin Packing Co. will conduct an exercise of the facility's emergency response notifications mechanism. The facility will record each notification exercise utilizing PSMWriter.\r\n\r\nAlternatively, the facility may meet the notification requirements through other exercises conducted to meet other Federal, state or local requirements, provided tha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000101243,
      "SummaryText": "s and transactions. In addition, the process is checked frequently during the season by the outside contractor that supplies the SO2 cylinders. The contractor also assists in performing the annual mechanical integrity review of our process equipment. \r\n\r\n1.4 Five Year Accident History\r\n\r\nBoghosian Raisin Packing Co. has had no accidental release within the last five (5) years.\r\n\r\n1.5 Emergency Action and Response Plan\r\n\r\nBoghosian Raisin Packing Co.'s emergency action and response program has been developed to satisfy the following requirements:\r\n- Cal/OSHA's Emergency Action Plan - Title 8 CCR §3220\r\n- U.S. Occupational Safety and Health Administration's (OSHA) Emergency Action Plans - Title 29 CFR §1910.38\r\n- Cal/OSHA's Process Safety Management [Emergency Response Program Requirements] - Title 8 CCR §5189(n)\r\n- U.S. Occupational Safety and Health Administration's (OSHA) Process Safety Management [Emergency Planning and Response Requirements] - Title 29 CFR §1910.119(n)\r\n- California Accidental Release Prevention (CalARP) Program [Emergency Response Program Requirements] - Title 19 CCR, Division 2, Chapter 4.5 §2765.1-2765.2\r\n- USEPA Risk Management Program [Emergency Response Program Requirements] - Title 40 CFR §68.90-96\r\n- California Hazardous Materials Business Plan (HMBP) [Emergency Response Plans and Procedures] - Title 19 CCR, Division 2, Chapter 4 §2731\r\n- California Hazardous Waste Operations and Emergency Response (HAZWOPER) - Title 8 CCR Title 8 §5192(q)\r\nFederal Hazardous Waste Operations and Emergency Response (HAZWOPER) - Title 29 CFR §1910.120(q)\r\n\r\nStrategically, Boghosian Raisin Packing Co. has chosen to be a non-responding stationary source. Our employees will not respond to accidental releases of sulfur dioxide. In lieu of responding to accidental releases, Boghosian Raisin Packing Co. is implementing the following protocols:\r\n- The facility is included in the community emergency response plan developed under Title 42 USC §11003.\r\n\r\n1.5.1 Em"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000101243,
      "SummaryText": "ntainers (in storage)\r\n(1) Scale\r\n(20) Manifold Isolation Valves\r\n(lot) Pipe\r\n\r\n1.2.4 Process Chemistry\r\n\r\nBoghosian Raisin Packing utilizes sulfur dioxide as an antioxidant to protect the color and flavor in the dried fruit products that are produced. The sulfur dioxide is injected into the sulfur dioxide chambers through piping connected to a sulfur dioxide ton container. All sulfur dioxide gas permeates into the fruit and acts as a color preserving agent. \r\n\r\n1.2.5 Process Classification\r\n\r\nThe sulfur dioxide system at Boghosian Raisin Packing consists of vessels, equipment, and valves which are interconnected by piping. As such, the sulfur dioxide system at Boghosian Raisin Packing is treated as a single process.\r\n\r\n1.3 General Accident Release & Chemical Specific Prevention Steps\r\n\r\n1.3.1 General \r\n\r\nWe inform our employees engaged in process operations of the dangers of an accidental release of sulfur dioxide in annual safety meetings. During these meetings we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\r\nBoghosian Raisin Packing Co. has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the sulfur dioxide process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \r\n\r\n1.3.4 Sulfur Dioxide\r\n\r\nThe sulfur dioxide process at the Boghosian Raisin Packing Co. facility is an integral part of overall business and lasts for approximately five months out of the year. It is extremely important that these areas and associated injection processes are maintained and operated in a safe and efficient manner. Boghosian Raisin Packing Co. is committed to making sure that employees are made aware of the potential danger of exposure to sulfur dioxide.\r\n\r\nOur personnel also monitor the sulfur dioxide fumigation process and keep an active log of all associated procedure"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000101243,
      "SummaryText": "ared a unified program based on the PSM regulation to meet CalARP and RMP obligations as well\r\n2. Organized the program so that it meshes closely with general business practices\r\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\r\n\r\nThe RMP/PSM/CalARP Program sets forth rules, procedures, and practices that will help our employees and neighbors protect themselves.\r\n\r\n1.2 Process Description\r\n\r\n1.2.1 Facility Overview\r\n\r\nBoghosian Raisin Packing operates a raisin packing facility in Fowler, CA. The facility utilizes sulfur dioxide to inject into twenty (20) gassing chambers.\r\n\r\n1.2.2 Facility Location\r\n\r\nBoghosian Raisin Packing is located at 726 S 8th St, Fowler, CA 93625. The latitude and longitude of the ton container storage area is 36.621008, -119.674516. The facility is located adjacent to state highway 99 (to the south and west) and Golden State Blvd (to the north and east) in an area surrounded by other industrial businesses.\r\n\r\nAccording to FEMA Flood Map Service, the facility is located in an area of minimal flood hazard.\r\n\r\nBoghosian Raisin Packing is not located in an Alquist-Priolo Fault Zone as defined by the California Department of Conservation. In addition, a review of United States Geological Survey (USGS) fault maps revealed that there are no faults in close proximity to the site. The USGS 2018 One-Year Model revealed that Boghosian Raisin Packing had a 1-2% chance of experiencing potentially minor-damage due to ground shaking in 2018.\r\n\r\n1.2.3 Description of Covered Process\r\n\r\nBoghosian Raisin Packing operates a dehydrating facility that utilizes sulfur dioxide chambers for color preservation in the fruit drying process. Sulfur dioxide is piped from a ton-container to each chamber using pipe and ball valves. When in use, each chamber receives 80-90 lb of sulfur dioxide gas.\r\n\r\nA partial list of system components includes: \r\n(1) Ton Container (active)\r\n(10) Ton Co"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000101243,
      "SummaryText": "1. Executive Summary\r\n\r\nThis program is intended to meet the spirit and intent of the following regulations:\r\n- California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\r\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR §68\r\n- California Process Safety Management (PSM) Program - Title 8 CCR §5189\r\n- Federal Process Safety Management (PSM) Program - Title 29 CFR §1910.119\r\n\r\nHereafter this program will be referred to as the RMP/PSM/CalARP Program.\r\n\r\nThis program is intended to be a living document. As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Boghosian Raisin Packing Co. has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP/PSM/CalARP related activities. \r\n\r\n1.1 Boghosian Raisin Packing Co., Risk and Process Safety Management Program\r\n\r\nThis is to inform all interested persons, including employees, that Boghosian Raisin Packing Co. has developed their unified RMP/PSM/CalARP Program. This program has been prepared to address the risks involved in operating and maintaining the following process which have the presence of hazardous chemicals above threshold quantities: \r\n\r\nProcess Name                |   Process Chemical      | Process Quantity(lbs.)\r\nSulfur Dioxide                  Sulfur Dioxide          22,000\r\n\r\nOur RMP/PSM/CalARP Program promotes overall plant, worker, public, and environmental safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses, and physical property damage.\r\n\r\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \r\n1. Prep"
    }
  ]
}