{
  "FacilityID": 1000081477,
  "FacilityName": "Hillshire Brands Company--Haltom City, TX",
  "FacilityStr1": "3900 Meacham Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Haltom City",
  "FacilityState": "TX",
  "FacilityZipCode": "76117",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.822500",
  "FacilityLongDecDegs": "-097.289200",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.tyson.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 66378670,
  "ParentCompanyName": "Hillshire Brands Company",
  "Company2Name": "Tyson Foods, Inc.",
  "CompanyDUNS": 5213962,
  "Company2DUNS": 0,
  "OperatorName": "Hillshire Brands Company",
  "OperatorStr1": "3900 Meacham Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Haltom City",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76117",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eddie Zendejas",
  "RMPTitle": "Plant Manager",
  "FTE": 760,
  "OtherEPAFacilityID": "76117KBLRC3900M",
  "EPAFacilityID": "100000094122",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-06-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-11-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-07-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.82425,
  "FRS_Long": -97.29041,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101823,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000081477,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000103104,
          "ProcessID": 1000101823,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127678,
          "ProcessID": 1000101823,
          "ChemicalID": 56,
          "Quantity": 94029.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000627678,
          "ProcessID": 1000101823,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081477,
      "SummaryText": "Hillshire Brands, Haltom City, Texas plant is engaged in the wholesale production of corn dogs for human consumption.  Raw materials received are beef, pork franks, turkey franks, corn, flour, sugar, cooking oil, sticks, and packaging materials.  The corn dogs are processed, cooked, frozen, packaged, and stored for shipment.  The facility processes beef franks from frozen beef, but does not handle live animals or carcasses.  The facility is located at 3900 Meacham Blvd. Haltom City, Texas 76117.  The NAICS code is 311612 (meat processed from carcasses.  Normal hours of operation are 5:45 a.m. to 11:15 p.m. six days per week.  Normal hours for sanitation operations are 11:15 p.m. to 5:45 a.m. six days per week.  The facility currently has 760 full time employees onsite, including plant and administrative personnel.\n\n\n\nThe facility operates an ammonia refrigeration system as part of the process to keep products and raw materials fresh and preserve food safety standards.  40 CFR 68.130 lists anhydrous ammonia as a hazardous chemical subject to RMP regulation with a threshold quantity of 10,000 pounds.\n\n\n\nThe current anhydrous ammonia inventory in the system exceeds the 10,000 pound threshold.  Anhydrous ammonia recirculates in the system as a liquid and gas depending on system operating pressures and temperatures.  The refrigeration system is designed, installed and operated in accordance with the applicable guidelines and standards of the American Society of Mechanical Engineers (ASME), the American National Standards Institute (ANSI), the International Institute of Ammonia Refrigeration (IIAR), the American Society of Heating, Refrigerating, and Air-conditioning Engineers, Inc. (ASHRAE).  \n\n\n\nThe facility has developed and implemented a Process Safety Management Program (PSM) in accordance with the Occupational Safety and Health Administration (OSHA) Standard, 29 CFR 1910.119.  Qualified outside contractors are used for construction and major repairs or modifications"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081477,
      "SummaryText": " to the system.  The facility's PSM program includes provisions for process hazard analyses, management of change, pre-start up safety reviews, safe work practices, inspections, testing, maintenance, compliance audits, and contractor qualifications.  The PSM program is reviewed annually and updated as necessary.  All significant changes to the system are reviewed in accordance with the PSM / RMP management of change provisions in the facility's plan.  This process is a program level 3 as defined by the Risk Management Program rule (40CFR68). \n\n\n\nThe system is continuously monitored and inspected by technicians that are trained, qualified, and experienced in ammonia refrigeration in accordance with the facility's PSM program.  The system is inspected periodically for proper operation 24 hours per day.  Walking inspections are conducted on intervals not longer than 8 hours.  System parameters are logged in a permanent record, as are routine maintenance activities.\n\n\n\nThe system is equipped with a series of redundant failsafe devices, sensors, ammonia detectors, and overrides.  In the event a malfunction occurs that could result in an ammonia release, these protective devices shut the system down.  The system can't be restarted until the cause of the shutdown is identified and corrected.  The system is equipped with a shutdown system that is triggered by the presence of ammonia in the engine room.  The system shutdown can be manually operated using a kill switch located outside the engine room.\n\n \n\nThe facility has made arrangements with the local fire department to respond to emergencies involving ammonia.  The facility conducts periodic drills.  The facility has never experienced an ammonia release that resulted in any onsite or offsite injuries or any offsite environmental damages.\n\n\n\nHillshire Brands, Haltom City,Texas plant has complied with the requirements of section 302 and 303 of the Emergency Planning and Community Right to Know Act (EPCRA) by notifying the S"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081477,
      "SummaryText": "tate Emergency Response Commission (SERC), the Local Emergency Planning Committee (LEPC), and the Fire Department of the presence of ammonia at the site.  The facility files a Tier 2 Chemical Inventory each year with the SERC, LEPC and the Fire Department as required by sections 311 and 312 of EPCRA.  The facility's Emergency Response Plan includes procedures for notifying the proper agencies in the event of a reportable release of ammonia.  A release of 100 pounds or more must be reported to the National Response Center, the SERC, and LEPC, in accordance with section 304 of EPCRA.  The Fire Department has been provided with a copy of the facility's Emergency Response Plan."
    }
  ]
}