{
  "FacilityID": 1000058877,
  "FacilityName": "Gillespie Ag Services",
  "FacilityStr1": "15301 Road 192",
  "FacilityStr2": null,
  "FacilityCity": "Porterville",
  "FacilityState": "CA",
  "FacilityZipCode": "93257",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.068200",
  "FacilityLongDecDegs": "-119.143600",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Gillespie Ag Services",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dana Gillespie",
  "OperatorStr1": "15301 Road 192",
  "OperatorStr2": null,
  "OperatorCity": "Porterville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93257",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Pemelton",
  "RMPTitle": "General Manager",
  "FTE": 21,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000195308",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-07-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-07-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-12-01 00:00:00",
  "DeRegistrationEffectiveDate": "2017-11-10 00:00:00",
  "AnniversaryDate": "2021-07-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000073465,
      "AltID": "Agricultural Fertilizer",
      "FacilityID": 1000058877,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000074647,
          "ProcessID": 1000073465,
          "NAICSCode": "11511",
          "_desc": {
            "NAICS_CODE": "11511",
            "NAICS_DESCRIPTION": "Support Activities for Crop Production"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000090752,
          "ProcessID": 1000073465,
          "ChemicalID": 56,
          "Quantity": 61800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000590752,
          "ProcessID": 1000073465,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000058877,
      "SummaryText": "Gillespie Ag Service is committed to employee, public and environmental safety as demonstrated by its Process Safety Management program. This program addresses management practices in areas such as operating procedures, equipment maintenance, hazard analysis and employee training associated with the process at our facility. \n\nIt is the policy of Gillespie Ag Service to implement appropriate controls to prevent releases of regulated substances to the greatest extent possible.\n\n\n\nRegulated Substances    \n\nAnhydrous Ammonia is present above threshold amounts at the Facility.\n\n \n\nWorst-Case and Alternative Scenarios    \n\nA Process Hazard Analysis was conducted to determine the specific hazards associated with the Anhydrous Ammonia system. Two release scenarios were modeled: a Worst-Case scenario involving the total loss of inventory and an alternative high-pressure gas release (the most common cause of Anhydrous Ammonia releases nationwide).  Each scenario includes population impacts and a map showing the potential sphere of influence.\n\n\n\nProcess Safety Management Program and Chemical-Specific Prevention Steps    \n\nGillespie Ag Service has taken all the necessary steps to comply with the Occupational Safety and Health Standards 29 CFR Part 1910.119 Process Safety Management of highly hazardous chemicals, and California's Accidental Release Prevention requirements set forth by CCR Title 19, Division 2, Chapter 4.5.  The following sections briefly describe the elements of Gillespie Ag Service release prevention program for the Facility.\n\n  \n\nProcess Safety Information\n\nGillespie Ag Service maintains a detailed record of safety information that includes the chemical hazards, operating parameters and equipment designs associated with all process. This documentation is available in the office of the General Manager.\n\nProcess Hazard Analysis\n\nGillespie Ag Service conducts comprehensive studies to ensure that hazards associated with the covered process are identified and controlled eff"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000058877,
      "SummaryText": "iciently using the What If methodology. The studies are conducted by a team of qualified personnel with expertise in engineering and process operations and are revalidated every five years. Any findings related to the hazard analysis are addressed and mitigated in a timely manner.\n\nOperating Procedures\n\nGillespie Ag Service maintains written operating procedures to ensure maintenance and operation of the covered process are conducted in a safe and efficient manner. These procedures address various modes of operation such as initial startup, normal, temporary and emergency operations, normal and emergency shutdown, and startup after a shutdown. The information is regularly reviewed and is readily accessible to operators involved in the process.\n\nTraining\n\nGillespie Ag Service has a comprehensive training program in place to ensure employees are competent to perform the operational duties, tasks and procedures associated with the covered process. Refresher training is provided at least annually and more frequently as needed. Training documentation is maintained in the main business office.\n\n \n\nMechanical Integrity\n\nTo ensure proper operation, Gillespie Ag Service performs highly documented maintenance checks on process equipment such as the pressure vessel, piping systems, relief and vent systems, emergency shutdown systems, compressor and pumps.  Maintenance operations are performed by qualified personnel who have received training in maintenance practices.  Additional specialized training is provided as needed. Any identified equipment deficiency is corrected in a safe and timely manner.\n\n Established written procedures address managing changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly notified. Additional training is provided as required.\n\nPre-Startup Safety Reviews\n\nPre-Startup Safety Reviews related to "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000058877,
      "SummaryText": "new process and modifications to established process are conducted on a regular basis to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\n\nGillespie Ag Service conducts audits every 2.5 years to verify that the provisions set forth under the Risk Management Plan (RMP) rule are being implemented.  Any corrective actions identified in the audits are completed in a safe and timely manner.\n\nIncident Investigation\n\nGillespie Ag Service promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of a regulated substance.  These investigations are conducted to identify the situation leading to the incident as well as any corrective actions to prevent a reoccurrence.  All reports are retained for a minimum of five years.\n\nEmployee Participation\n\nGillespie Ag Service believes that process safety management and accident prevention is a team effort. Therefore, employees are encouraged to express their views concerning accident prevention issues and recommend improvements.  In addition, employees have access to all information associated with the facility's implementation of the RMP rule, including information resulting from Process Hazard Analysis.\n\nContractors\n\nContractors are utilized for specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of their safety performance is conducted. Gillespie Ag Service has a strict policy of informing contractors of known potential hazards related to their work and the associated process. Contractors are also informed of emergency response procedures should an accidental release of a regulated substance occur.  The Contractor Qualification Program is firmly adhered to for everyone's safety.\n\n\n\nEmergency Response Program    \n\nA written Emergency Response Program addressing accidental release of hazardous materials has been im"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000058877,
      "SummaryText": "plemented addressing all aspects associated with emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. This Plan is promptly updated to reflect any pertinent changes that require a modified emergency response. \n\n\n\nFive-Year Accident History    \n\nGillespie Ag Service has an excellent record of preventing accidental releases. As such, there have been no accidental releases within the last five years.    \n\n\n\nPlanned Changes to Improve Safety    \n\nThe implementation of the various elements of our Process Safety Management Program have identified that documented periodic safety inspections and ongoing employee training, including updated operating procedures can be enhanced in order to improve safety at the facility. A more focused coordination with the local Emergency Responders will also be pursued.  These changes are expected to be executed no later than January 1, 2018.\n\n"
    }
  ]
}