{
  "FacilityID": 1000074043,
  "FacilityName": "Wilbur-Ellis Company (Monte Vista, CO)",
  "FacilityStr1": "2701 East Road 1 South",
  "FacilityStr2": null,
  "FacilityCity": "Monte Vista",
  "FacilityState": "CO",
  "FacilityZipCode": "81144",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08105",
  "LEPC": "Rio Grande County LEPC",
  "FacilityLatDecDegs": "37.561749",
  "FacilityLongDecDegs": "-106.100220",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "http://ag.wilburellis.com/Locations/Pages/MonteVista.aspx",
  "FacilityEmailAddress": "DBECKER@wilburellis.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Wilbur-Ellis Company LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Wilbur-Ellis Company",
  "OperatorStr1": "2701 East Road 1 South",
  "OperatorStr2": null,
  "OperatorCity": "Monte Vista",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81144",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dale Becker",
  "RMPTitle": "Operations Manager",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000223313",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-08-07 00:00:00",
  "SafetyInspectionBy": "CO Department of Ag",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-11-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-11-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092300,
      "AltID": "Storage and Transfer",
      "FacilityID": 1000074043,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093542,
          "ProcessID": 1000092300,
          "NAICSCode": "325312",
          "_desc": {
            "NAICS_CODE": "325312",
            "NAICS_DESCRIPTION": "Phosphatic Fertilizer Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000093543,
          "ProcessID": 1000092300,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115470,
          "ProcessID": 1000092300,
          "ChemicalID": 56,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000615470,
          "ProcessID": 1000092300,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000074043,
      "SummaryText": "Executive Summary\n\n\n\nThe Plan describes procedures implemented by Wilbur-Ellis Company, Agribusiness Division (\"Wilbur-Ellis\") to prevent accidental releases of ammonia that could cause harm to the public and the environment from short-term exposures.  The Plan includes an analysis of the potential offsite consequences of an accidental release, a five-year accident history, and a release prevention and emergency response program.  \n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nWilbur-Ellis has implemented release prevention and emergency response procedures to minimize the potential for accidental releases of hazardous materials.  Emergency response procedures including evacuation procedures and notification procedures have been implemented by Wilbur-Ellis.  In addition, Wilbur-Ellis has developed operating procedures and preventative maintenance activities to reduce the likelihood of accidental releases.\n\n\n\nThis Plan and the emergency response procedures document the accidental release prevention, safety, and emergency policies in place at Wilbur-Ellis.\n\n\n\nDescription of Stationary Source and Regulated Substances\n\n\n\nWilbur-Ellis is located at 2701 East Road 1 South in Monte Vista, Colorado (the \"facility\").  Wilbur-Ellis is a retailer of fertilizer.  There is one anhydrous ammonia tanker temporarily located at the facility for approximately four to eight days per year with a capacity of approximately 10,200 gallons.  The anhydrous ammonia is used by a mobile third party contractor in a reaction process for the production of ammonium polyphosphate.  The contents of the tank are consumed in entirety during the reaction process.  \n\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n  \n\nWilbur-Ellis has developed and implemented this Plan with the objective of complying with the requirements and guidelines set forth by the Federal Risk Management Plan program.  The Plan's purpose is to enhance the facility's ex"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000074043,
      "SummaryText": "isting safety programs implemented at the site to reduce the possibility of accidental releases of anhydrous ammonia that could cause harm to employees, the public and the environment.  The emergency response program, documented in the emergency response procedures, includes accidental release prevention and chemical specific prevention steps.\n\n\n\nWilbur-Ellis ensures that equipment meets the appropriate industry standards prior to use.  Wilbur-Ellis and the third party contractor implement operating procedures and maintenance procedures in accordance with manufacturer and industry specifications to prevent accidental releases at the facility.  Chemical specific prevention steps implemented at the site include pressure relief valves, emergency shut off valves and ammonia training for personnel.\n\n \n\nFive-Year Accident History\n\n\n\nThere have been no qualifying accidents involving ammonia in the five-year period prior to the completion of this Plan.\n\n\n\nEmergency Response Program\n\n\n\nThe facility coordinates with the Monte Vista Fire Protection District (\"fire department\") regarding specific actions to be taken in response to an accidental release of anhydrous ammonia.  The facility has established emergency evacuation procedures to evacuate the site and notify the appropriate agencies regarding a release.  The facility's emergency response program is documented in the facility's Emergency Response Procedures.  The emergency procedures contain the following key elements:\n\n\n\n1.    Procedures for informing local agencies responsible for responding to accidental releases.\n\n2.    Information on emergency health care.\n\n3.    Emergency response training for employees.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nPlans to improve safety at the facility were developed based on the results of the process hazard analysis (PHA) and a Risk Management Plan (RMP) site evaluation conducted by an outside contractor.  The Branch Manger is currently working on an implementation schedule for the recommend"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000074043,
      "SummaryText": "ed actions.  Recommended actions include the following:\n\n\n\n1.    Evaluate implementation of Contractor Safety Program.\n\n2.    Discuss methods used for venting the liquid transfer with the contractor.\n\n3.      Discuss potential scenarios with contractor and recommend they consider adding those to their PHA. \n\n\n\nTo improve the safety of ammonia and all other aspects of operations, Wilbur-Ellis has implemented a comprehensive, risk-based safety management process to help guide employees to improved safety performance. The safety management process, branded Guiding People to Safety (GPS), is designed to be implemented in four steps, step one comprising of the foundational and fundamental elements of a strong safety program and positive safety culture. The GPS process provides guidelines for each safety program that describe methods for effective implementation. The GPS program includes measures for tracking progress and success and for addressing opportunities for improvement within the process and individual safety programs. These measures include action tracking software to facilitate timely corrections of deficiencies and recommended improvements identified during inspections, audits, and hazard analyses. Wilbur-Ellis is committed to preventing incidents cultivating a positive safety culture throughout the company. The mission of our\n\nEnvironmental Health, Safety and Security (EHSS) team is to drive effective results in reducing incidents and employee injuries by combining the GPS process with a positive safety culture.\n\n"
    }
  ]
}