{
  "FacilityID": 1000092953,
  "FacilityName": "Archer Daniels Midland-Marshall",
  "FacilityStr1": "400 West Erie Road",
  "FacilityStr2": null,
  "FacilityCity": "Marshall",
  "FacilityState": "MN",
  "FacilityZipCode": "56258",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27083",
  "LEPC": null,
  "FacilityLatDecDegs": "44.470560",
  "FacilityLongDecDegs": "-095.784170",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.adm.com",
  "FacilityEmailAddress": "emergency@adm.com",
  "FacilityDUNS": 1307586,
  "ParentCompanyName": "Archer Daniels Midland",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Archer Daniels Midland",
  "OperatorStr1": "400 West Erie Road",
  "OperatorStr2": null,
  "OperatorCity": "Marshall",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56258",
  "OperatorZipCodeExt": null,
  "FTE": 262,
  "OtherEPAFacilityID": "MND981793839",
  "EPAFacilityID": "100000068605",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "08300038",
  "SafetyInspectionDate": "2018-03-13 00:00:00",
  "SafetyInspectionBy": "Federal Rail Administration",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-04-14 12:11:10",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-04-14 12:11:10",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-04-14 12:11:10",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-04-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 44.474067,
  "FRS_Long": -95.783679,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115374,
      "AltID": "Denaturant",
      "FacilityID": 1000092953,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144242,
          "ProcessID": 1000115374,
          "ChemicalID": 125,
          "Quantity": 240000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000116807,
          "ProcessID": 1000115374,
          "NAICSCode": "325193",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000116808,
          "ProcessID": 1000115374,
          "NAICSCode": "311221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000098713,
              "Process_NAICS_ID": 1000116808,
              "SafetyReviewDate": "2020-11-13 00:00:00",
              "PHA_Date": "2020-08-18 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-08-18 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Alarm",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-11-17 00:00:00",
              "TrainingReviewDate": "2020-11-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-07-29 00:00:00",
              "EquipmentInspectionDate": "2017-10-25 00:00:00",
              "EquipmentTested": "Storage Tank",
              "ChangeMgmtDate": "2015-07-29 00:00:00",
              "ChangeMgmtReviewDate": "2019-01-01 00:00:00",
              "PreStartupReviewDate": "2015-12-07 00:00:00",
              "ComplianceAuditDate": "2020-11-13 00:00:00",
              "AuditCompletionDate": "2021-12-31 00:00:00",
              "IncidentInvestigationDate": "2015-11-04 00:00:00",
              "InvestigationChangeDate": "2016-03-01 00:00:00",
              "ParticipationPlansReviewDate": "2017-05-23 00:00:00",
              "HotWorkPermitReviewDate": "2020-10-22 00:00:00",
              "ContractorSafetyReviewDate": "2019-01-04 00:00:00",
              "ContractorSafetyEvalDate": "2019-01-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000123720,
                  "PreventionProgram3ID": 1000098713,
                  "ProcessChemicalID": 1000144242
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000092953,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-04-02 00:00:00",
    "ERTrainingDate": "2020-11-01 00:00:00",
    "CoordinatingAgencyName": "Lyon County Emergency Management",
    "CoordinatingAgencyPhone": "5079296615",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092953,
      "SummaryText": "ment\r\nThe certifications that EPA's RMP rule requires us to provide\r\nThe detailed information (called data elements) about our risk management program\r\n \r\n\t\r\n2.0 Stationary Source and Regulated Substances\r\n\t\r\nADM operates a wet corn milling facility in Marshall, Minnesota.  Operations at the site include raw material receiving and storage, corn processing and co-product separation, product storage and shipping.  The primary products are corn sweeteners, cornstarch, and ethanol.  In our processes, we use a toxic chemical stored in quantities greater than the EPA RMP Threshold Quantity limit.  The EPA has identified that toxic chemicals exceeding Threshold Quantities have the potential to cause significant off-site consequences in the event of a substantial accidental release.  The chemical and quantity is identified below.\r\n\t\r\nToxics / Quantity / Use\r\n\t\r\n1.\tDenaturant \t     42,417 gal Denaturant AST\tAdditive to ethanol\t\t\t\t\t\r\n\t\r\nDenaturant is blended with ethanol.   \r\n\t\r\n3.0 Key Off-Site Consequence Analysis Scenarios\r\n\t\r\nEPA's RMP rule requires that we conduct a hazard assessment and provide information about the worst-case release scenario(s) and alternative release scenario(s) for our facility.  This information identifies the potential hazards and the potential risks they pose.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit exposure distances for each scenario.\r\n\t\r\nWorst-Case Release Scenario\r\n\t\r\nThe worst-case scenario (WCS) is an evaluation of the impact of a release of a flammable substance from a complete failure (catastrophe) of the largest vessel, releasing the entire contents over a ten-minute period under the most stable weather conditions.  The probability of a release meeting these conditions is extremely small.\r\n\t\r\nThe worst-case flammable substance release scenario at ADM's Marshall Facility is the rupture of a denaturant tank inside the tank farm and t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000092953,
      "SummaryText": "or personnel\r\nPre-startup review: Check equipment and make sure everyone knows what to do before starting a process\r\nCompliance audits: Evaluate whether any safety hazards exist\r\nIncident investigation: Procedures for investigating the cause of an accident and developing measures to prevent future accidents\r\nEmployee participation\r\nHot work permit\r\nContractors\r\n\t\r\nPSM modifications necessary to further account for protection of public health and the environment will be made when PSM elements are updated under the existing schedule as required by OSHA.  The PSM Program is maintained by the Safety Manager.\r\n\t\r\n\t\r\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the potential hazards that are posed to our employees, the public, and the environment by our use of these chemicals.  Administrative controls, mitigation systems, and preventive measures used at ADM include:\r\n\t\r\nRelease sensors and alarms\r\nOn-site emergency response team\r\nA preventative maintenance program to ensure equipment integrity and proper operation\r\nStandard operating procedures\r\nWater fog/stream for vapor cloud\r\nHigh level tank alarm for filling operations (denaturant)\r\nMonitoring of unloading operations\r\nDaily visual inspections of Denaturant tank piping and fittings\r\nInternal and external inspections for Denaturant tank conforming to API Standard 653\r\n\r\n5.0 Five-Year Accident History\r\n\r\nWe keep records for accidental chemical releases and near misses that occur at our facility.  Incident reports are completed and the appropriate emergency response agencies are notified by ADM for any accidental chemical release exceeding federal or state Reportable Quantities.  Reporting and notification procedures are documented in the ADM Environmental Incident Reporting Sheet Standard Operating Procedure (SOP).  Reports are also completed for First Aid or chemical release near misses that occur on-site.  Appropriate corrective measures are taken to hel"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000092953,
      "SummaryText": "p prevent similar situations from occurring in the future.  \r\n\r\nThere has not been an accidental release of an RMP covered chemical process in the last five years that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage which requires to be reported here as per 68.155 and 68.42\r\n\r\n6.0 Emergency Response Program \r\n\r\nADM has developed and maintains an Emergency Action Plan for Fire Prevention, Hazardous Chemical Spills, Leaks and Releases.  The Plans consolidate various federal, state, and local regulatory requirements for emergency response planning.  Our emergency response program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  The Emergency Action Plan includes written procedures to follow in the event of an incident.  \r\n\r\n7.0 Planned Changes to Improve Safety\r\n\r\nThe following is a list of improvements that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:\r\n\r\n-\tSulfur dioxide is removed.\r\n-\tChlorine is removed: December 18th 2012.\r\n\r\nIn addition, recommended changes identified during Process Hazard Analysis will be implemented as necessary."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092953,
      "SummaryText": "EXECUTIVE SUMMARY\r\n \r\n1.0 Introduction\r\n\r\nThis Risk Management Plan (RMPlan) was prepared to meet the requirements of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) Rule (40 Code of Federal Regulation (CFR) 68).  Archer Daniels Midland (ADM) is a covered facility under the rule because processes at the Marshall, MN facility contain more than a threshold quantity of a regulated substance.  The ADM processes meet Program Level 3 criteria.  The actual components of the required RMP include:\r\n\r\nConduct a hazard assessment (release scenarios)\r\nDevelop and implement an accident prevention program\r\nDevelop and implement an emergency response program\r\nDevelopment and implementation of a management system organizational structure\r\nSubmittal of a RMP Plan\r\n\t\r\nThe purpose of the RMP is to prevent the accidental release, and to minimize the consequences of any such release of hazardous substances.\r\n\t\r\nAt ADM, we are committed to operating and maintaining our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\r\n\t\r\nA description of our facility and use of substances regulated by EPA's RMP regulation\r\nA summary of results from our assessment of the potential off-site consequences from accidental chemical releases\r\nA five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\r\nAn overview of our accident prevention program\r\nAn overview of our emergency response program\r\nAn overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092953,
      "SummaryText": "he entire contents (full tank = 42,417 gals) were released.   The worst release would occur over a 10-minute period and the distance to 1 psi overpressure end-point is 0.3 miles..  The exposure distance was obtained using EPA Risk Management Program Guidance (EPA 550-B-98-010) and the associated RMPComp software program.  There is no mitigation measures included in this scenario.  Public and environmental receptors in this WCS include:  residences, schools, hospitals, public recreational areas, commercial / industrial areas and officially designated wildlife management areas.  The population was estimated and public receptors were identified using CAMEO-MARPlot from the Environmental Protection Agency (EPA).  Environmental receptors were identified using Minnesota Department of Natural Resources Landview Maps.  Additional information regarding the WCS is included in a scenario report attached as part of Section 9.0 and on a scenario map included in Attachment 1.\r\n\t\r\nAlternate Release Scenarios\r\n\t\r\nAn Alternate Release Scenario (ARS) is the evaluation of the impact of a more likely release of smaller quantities of material.  The causes and the amount in these scenarios were determined based on site-specific data.  The probability of this scenario is higher than worst-case scenarios and therefore is the primary focus for on- and off-site emergency planning.  \r\n\t\r\nThe selected ARS for denaturant is described below.   Denaturant could be released at the facility if the tank was punctured.  The puncture area would be a ¼ inch hole half way up the tank; 7.07 gallons per minute of denaturant for 600 minutes (4,242 gallons) could be release.  The release would take place inside the clay lined diked berm.  The distance to heat radiation endpoint (5 kilowatts/square meter) is .1 miles.  Active mitigation in this scenario includes a level transmitter, daily visual inspections of the tanks piping and fittings, the liquid being released in to a clay lined diked berm and on-site"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000092953,
      "SummaryText": "response team help limit release duration.  The exposure distance was obtained using EPA Risk Management Program Guidance (EPA 550-B-98-010) and the associated RMPComp software program.  Public receptors include commercial/industrial areas.  There are no environmental receptors within the denaturant ARS exposure distance.\r\n\t\r\nWe are using this information to help us to ensure that our emergency response plan and the community emergency response plan address all reasonable contingency scenarios.\r\n\t\r\n4.0 General Accidental Release Prevention and Chemical Specific Prevention Steps.\r\n\t\r\nADM takes a systematic, proactive approach to evaluating chemical processes.  Using this approach, the design, technology, operation and maintenance activities, emergency preparedness plans, training, process changes, and other elements that affect processes are all considered.  Through evaluation, the consequences of catastrophic releases can be prevented or minimized.\r\n\t\r\nThe Process Safety Management (PSM) Standard (29 CFR 1910.119) PSM Program addresses chemical accident prevention in a way that protects employees as well as the public, and the environment.  The purpose of the PSM Program is to prevent unwanted releases or minimize the impacts of accidental releases of hazardous chemicals, especially into locations that could expose employees and others to serious hazards.  Our management systems address each of the key features of successful prevention programs including:\r\n\t\r\nProcess safety information: Technical information about how a process operates\r\nProcess hazard analysis: Technical analysis of the plants processes in order to anticipate what might go wrong\r\nOperating procedures: Technical and administrative procedures used to operate the plant safely\r\nTraining: Provide employees with information necessary to ensure safe operation\r\nMechanical integrity: Proper care on an ongoing basis\r\nManagement of change: Analyze and understand the impact of changes in equipment, procedures"
    }
  ]
}