{
  "FacilityID": 1000027703,
  "FacilityName": "AkzoNobel Surface Chemistry LLC",
  "FacilityStr1": "909 Mueller Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Chattanooga",
  "FacilityState": "TN",
  "FacilityZipCode": "37406",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47065",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "35.085278",
  "FacilityLongDecDegs": "-085.257778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.akzonobel.com/sc",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 605763952,
  "ParentCompanyName": "AkzoNobel NV",
  "Company2Name": null,
  "CompanyDUNS": 62999347,
  "Company2DUNS": 0,
  "OperatorName": "AkzoNobel Surface Chemistry LLC",
  "OperatorStr1": "909 Mueller Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Chattanooga",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37406",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brent Burke",
  "RMPTitle": "Site Manager",
  "FTE": 100,
  "OtherEPAFacilityID": "TND052003159",
  "EPAFacilityID": "100000071272",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-06-15 00:00:00",
  "SafetyInspectionBy": "Oneida Total Integrated Enterprises",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-04-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-04-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "Paper",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-04-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-04-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 35.08346,
  "FRS_Long": -85.24982,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000033832,
      "AltID": null,
      "FacilityID": 1000027703,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000034094,
          "ProcessID": 1000033832,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000034107,
          "ProcessID": 1000033832,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000040914,
          "ProcessID": 1000033832,
          "ChemicalID": 8,
          "Quantity": 540331.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 8,
            "ChemicalName": "Carbon disulfide",
            "CASNumber": "75-15-0",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000040915,
          "ProcessID": 1000033832,
          "ChemicalID": 26,
          "Quantity": 141053.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 26,
            "ChemicalName": "Ethylenediamine  [1,2-Ethanediamine]",
            "CASNumber": "107-15-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000040916,
          "ProcessID": 1000033832,
          "ChemicalID": 133,
          "Quantity": 183742.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 133,
            "ChemicalName": "Dimethylamine  [Methanamine, N-methyl-]",
            "CASNumber": "124-40-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000040917,
          "ProcessID": 1000033832,
          "ChemicalID": 29,
          "Quantity": 193361.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000540914,
          "ProcessID": 1000033832,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000540915,
          "ProcessID": 1000033832,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000540916,
          "ProcessID": 1000033832,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000540917,
          "ProcessID": 1000033832,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000027703,
      "SummaryText": "                                                     AkzoNobel Surface Chemistry LLC\n\n                                                         RISK MANAGEMENT PLAN\n\n                                                          EXECUTIVE SUMMARY\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\n\n\nWe at AkzoNobel are strongly committed to employee, public and environmental safety. This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent potential releases of regulated substances.\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled\n\n\n\nOur facility's primary activities encompass water based batch reactions. We have four regulated substances present at our facility. These substances include 1) Carbon Disulfide, 2) Ethylenediamine, 3) Vinyl Acetate Monomer, and 2) Dimethylamine solution in water. The regulated substances at our facility are involved in several uses. The primary use of all substances is in producing additives for industrial cooling water treatment for prevention of disease causing bacterium and algae and industrial water treatment. They are also used to reduce harmful bacterial growth in the sugar manufacturing industry and in household detergents.\n\n\n\n3.    The Worst Case Release Scenarios and the Alternate Case Scenarios including administrative control and mitigation measures to limit the distances for each reported scenario:\n\n\n\nTo perform the required offsite consequence analysis for our facility, we have used SLAB models and US EPA OCA look up tables.\n\n\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68. Our release prevention plan involves both fixed systems and various elements described in OSH"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000027703,
      "SummaryText": "A's Process Safety Management standard. All of these are discussed in greater details in Section 4. \n\n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps:\n\n\n\nWe have fixed systems such as deluge system, sprinklers, fire monitor nozzles, elevated monitor nozzles, remotely operated nozzles, dikes, and run off collection system. Any or all of these would be activated depending upon the gravity of situation. However, we also have other components to our Prevention Program. These are briefly described below.\n\n\n\n4.1    PROCESS SAFETY INFORMATION\n\n----------------------------\n\nAkzoNobel maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with covered processes. \n\n-----------------------------\n\n4.2    PROCESS HAZARD ANALYSIS\n\n-----------------------------\n\nWe conduct comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is What-If/Checklist and HAZOPS. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and revalidated at a regular interval of 5 years. Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\n4.3    OPERATING PROCEDURE\n\n-----------------------------\n\nFor the purpose of safely conducting activities within our covered processes, AkzoNobel maintains written operating procedures. These procedures address various modes of operation such as initial start up, normal operations, emergency shut down, emergency operations, and normal shut down.  AkzoNobel does not use temporary mode of operations. The information is readily accessible to operators involved in the processes. AkzoNobel is an ISO 9001 and RC14001 certified facility. These accreditations require the site to maintain current operating procedures and establish internationally recognized pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000027703,
      "SummaryText": "otocols by which AkzoNobel conducts its business. As a requirement for maintaining AkzoNobel's ISO and RC certifications, AkzoNobel reviews its operating procedures of a regular basis.\n\n\n\n4.4    TRAINING\n\n-----------\n\nAkzoNobel has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. \n\n\n\n4.5    MECHANICAL INTEGRITY\n\n----------------------------\n\nAkzoNobel carries out highly documented maintenance inspections on process equipment to ensure proper operations. Process equipment examined by these inspections include among others; pressure vessels, storage tanks, piping systems, relief and vent systems,  emergency shut down systems, controls, and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices and elements of OSHA's Process Safety Management standard. Furthermore, these personnel are provided specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\n4.6    MANAGEMENT OF CHANGE\n\n---------------------------\n\nWritten procedures are in place at AkzoNobel to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and are trained to deal with the modification.\n\n\n\n4.7    PRE-START UP SAFETY REVIEWS\n\n-------------------------------------\n\nPre-start up safety reviews related to new processes and modifications in established processes are conducted as a regular practice at AkzoNobel. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe start up prior to placing equipment into operation.\n\n\n\n4.8    COMPLIANCE AUDITS\n\n-------------------------\n\nAkzoNobel conducts audits on regular basi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000027703,
      "SummaryText": "s to determine whether the provisions set out under the OSHA PSM Standard rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\n4.9    INCIDENT INVESTIGATION\n\n-----------------------------\n\nAkzoNobel promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are maintained for a minimum of 5 years. \n\n\n\n4.10    EMPLOYEE PARTICIPATION\n\n------------------------------------\n\nAkzoNobel truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the OSHA PSM Standard rule, including information resulting from process hazard analyses in particular.\n\n\n\n4.11    CONTRACTORS\n\n-----------------------\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. AkzoNobel has a strict policy of informing the contractors of known potential hazards related to the contractor's work and processes. Contractors are also informed of all the procedures for emergency for response should an accidental release of regulated substance occur. At no time, are contractors allows to perform non-routine activities such as welding, entering info confined space, and opening process lines without a permit from AkzoNobel maintenance personnel. The permitting procedures require that all safety measure have been taken prio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000027703,
      "SummaryText": "r to performing such tasks.\n\n\n\n5.    Five Year Accident History\n\n\n\nAkzoNobel has had an excellent record of preventing accidental releases over the last 5 years. We have not had a release reportable under the RMP program.\n\n\n\n6.    Emergency Response Plan\n\n\n\nAkzoNobel carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well post-incident decontamination of affected areas.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and services. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response. \n\n\n\n\n\n\n\n"
    }
  ]
}