{
  "FacilityID": 1000017543,
  "FacilityName": "New Castle Wastewater Treatment Plant",
  "FacilityStr1": "512 Montgomery Avenue",
  "FacilityStr2": "U.S. Route 18 South",
  "FacilityCity": "New Castle",
  "FacilityState": "PA",
  "FacilityZipCode": "16102",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42073",
  "LEPC": "Lawrence County LEPC",
  "FacilityLatDecDegs": "40.967778",
  "FacilityLongDecDegs": "-080.384444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "New Castle Sanitation Authority",
  "OperatorStr1": "110 E. Washington Street",
  "OperatorStr2": null,
  "OperatorCity": "New Castle",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16102",
  "OperatorZipCodeExt": "1404",
  "RMPContact": "Richard Christofer",
  "RMPTitle": " Manager",
  "FTE": 12,
  "OtherEPAFacilityID": "PA 0027511",
  "EPAFacilityID": "100000123626",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-10-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-10-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-10-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-10-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.97047,
  "FRS_Long": -80.38305,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000021673,
      "AltID": "Chlorine",
      "FacilityID": 1000017543,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000021974,
          "ProcessID": 1000021673,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000025617,
          "ProcessID": 1000021673,
          "ChemicalID": 62,
          "Quantity": 7500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000525617,
          "ProcessID": 1000021673,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000017543,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policy\n\nThe New Castle Sanitation Authority (NCSA) has an emergency response plan on file with the Local Emergency Planning Council (LEPC) of Lawrence County as well as the Pennsylvania Emergency Management Council. This plan is updated annually. The NCSA also receives information pertaining to the monthly meetings of the LEPC. This response plan is posted at the plant and plant staff has been advised on how the response plan is to be implemented and operate accordingly.\n\nThe New Castle Sanitation Authority Wastewater Treatment Plant (NCSAWWTP) stores and uses chlorine amounts which exceed the 40 CFR Part 68 threshold limit of 2,500 pounds. The State of Pennsylvania has not been granted delegation by Federal OSHA and therefore, the NCSAWWTP is not subject to OSHA standards. As such, the NCSAWWTP falls under the Program 2 requirements for preparation of a Risk Management Program as defined under 40CFR Part 68. The NCSAWWTP does not store or use any other chemicals listed by 40CFR Part 68 as a regulated substance in a quantity that exceeds the threshold quantities.\n\nDescription of the New Castle Wastewater Treatment Plant\n\nThe NCSAWWTP is capable of providing grit removal and primary treatment for 38.5 million gallons per day (mgd) and up to 18 mgd of secondary treatment. The plant uses anaerobic digestion to reduce the volatile solids in the sludge produced at the plant and then uses the digester gas to run the raw sewage lift pumps at the head of the plant. The plant has a secondary electrical power supply with an automatic switchover for operation during a power outage. In addition, certain key components such as the raw sewage lift pumps and the final effluent pumps have dual or alternate power sources for complete redundancy.\n\nAt the head of the plant are two bar screens followed by grit tanks equipped with comminutors to chop up stringy material and solids that might otherwise damage plant components downstrea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000017543,
      "SummaryText": "m. Raw sewage is pumped from a wet well downstream of the comminutors to the primary tank influent channel where plant flow is distributed between four available primary tanks. All plant flow receives primary treatment. As previously stated, the plant is currently rated to provide secondary treatment for 18 mgd. Plant flow in excess of the 18 mgd is diverted through a by-pass channel and then mixed with secondary treated effluent before it enters into the chlorine contact tank. \n\nThe secondary treatment train consists of six double pass aeration tanks fitted with fine-bubble diffuser panels followed by six secondary or final clarifiers. The two largest final clarifiers are 90 feet in diameter and were added with the last plant expansion. These clarifiers provide 54 percent of the plant's total secondary treatment capacity. The remaining four final tanks are all 60 feet in diameter. Treated secondary effluent is then chlorinated prior to entering the chorine contact tanks. Flow and chlorine concentrations are continuously monitored by sensors to insure that plant effluent limits are met. In addition, a dechlorination system has also been installed to inject sodium bisulfite into the effluent leaving the chlorine contact tank. This acts to neutralize the chlorine in the effluent prior to its discharge into the Mahoning River.\n\nThe NCSAWWTP has been equipped with a Supervisory Control and Data Acquisition (SCADA) system that allows the plant operators to remotely monitor plant operations. Plant alarms which detect equipment malfunctions have been tied into the SCADA system.\n\nThe chlorine system itself has been designed in accordance with the recommendations of the Chlorine Institute to insure safe operation. The chlorine storage room is designed to house up to ten one-ton chlorine containers. These containers are connected to two piping manifolds each fitted to receive chlorine from up to five one-ton containers. However, the plant currently has no more than one one-to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000017543,
      "SummaryText": "n container connected to each manifold and no more than four one-ton containers are on-site at any one time. The two piping headers are connected to vacuum regulators and an automatic switchover. Thus, whenever one of the chlorine containers is emptied, the system can automatically switch to the other chlorine container. The plant operates this system manually thus only one tank's contents can be released by breaking the manifold system.  Chlorine is withdrawn from the containers as a gas and is under pressure for less than 30 feet of total combined length of piping between the two headers within the chlorine storage room. Chlorine gas is fed under vacuum from the vacuum regulators to the chlorinators located in the chlorine feed room. The vacuum type system was chosen for its inherent safety. In the event of a leak, air will be drawn into the piping under vacuum thus preventing release of chlorine gas. Both the chlorine storage and feed rooms are fitted with chlorine leak detectors that constantly monitor the air within the room for traces of chlorine. Upon detection of a leak the exhaust fans stop. This provides a form of passive containment to prevent the release of chlorine to the outside.\n\nWorst Case Release Scenarios and Alternative Release Scenarios\n\nThe RMP*COMP model was used to determine the offsite impact of the release. In all cases, the model results provide a limit or distance from the release point where under given atmospheric conditions, the concentration of chlorine would no longer be considered a serious hazard given a person's exposure at that level for a period of up to one hour. In accordance with the guidelines presented in 40CFR Part 68, the worst case scenario for chlorine would be the complete release of the largest container on-site (in this case one ton) over a ten minute period (a rate of 200 pounds per minute.) While this type of event is highly unlikely, it certainly represents the \"worst case\". Passive mitigation was not used in model"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000017543,
      "SummaryText": "ing this event as the most likely time for this to occur is during the unloading of a chlorine container from a delivery truck when the door to the chlorine storage room is open. The results indicate that the release could affect up to a radius of 3 miles. It should be noted that the chlorine supplier is required by contract to hydrostatically check the chlorine one-ton containers before refilling them.  Likewise the valves are also regularly checked and reconditioned. In addition, plant staff are trained to inspect (and reject) any containers exhibiting any questionable characteristics. Thus, this type of release is highly unlikely.\n\nThree more realistic scenarios were modeled. All dealt with breaks in chlorine connections or valves. Alternative No. 1 reflected a rupture in the 1\" chlorine header that connects a one-ton container to a vacuum regulator. The second container attached to this header is valved off and only activated manually when the first empties.  Since this header is located within the chlorine storage room, passive mitigation was allowed. This reduced the release rate by 45 percent to 105.0 pounds per minute. The radius of unsafe exposure under this scenario was 0.4 miles. Since the chlorine header is protected and supported by a steel I-beam, it is unlikely that the pipe itself would be damaged by impact. However, it is possible that such a leak could occur if the header pipe itself were to corrode.\n\nAlternative No. 2 modeled the rupture of a 3/8\" flexible connection of a ton cylinder to the header. Again, because this connection is located within the storage room the reduction in release rate by 45 percent was allowed. Thus, the modeled release rate was 26.3 pounds per minute. Based on a total release, over a 60 minute period, of 1,578 pounds of chlorine, the radius of unsafe exposure was found to be 0.2 miles. This release is viewed as the most likely type of leak in that the flexible connectors are the most frequently handled connections and th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000017543,
      "SummaryText": "erefore the most likely to be damaged. Also, since there are valves at both ends of each flexible connection, it is unlikely that a release of this nature would last for such a prolonged period.\n\nAlternative No. 3 modeled the shearing off of the top valve fitting on a ton cylinder to the header. While it is unlikely that the valve would actually shear off, it is possible that its packing would fail. Under such an event, it becomes much more difficult to control the release. For this scenario, we assumed that the container would be contained within the storage room and therefore utilized the passive containment mitigation reduction of 45 percent. The modeled release rate was 105 pounds per minute and, based on a total release of 2,000 pounds (i.e. the contents of the container) the radius of unsafe exposure was found to be 0.4 miles.\n\nAccidental Release Prevention Program\n\nThe NCSA trains its employees to handle chlorine in accordance with the recommended practices of the Chlorine Institute and the equipment manufacturers for the specific equipment used onsite. In addition to the continuous monitoring of the chlorination system, staff also is instructed to visually check on the chlorination system several times per shift and to record operational parameters to insure the integrity of the system. Staff has been trained to inspect the chlorine containers before accepting them for delivery and in their handling during loading and unloading from the delivery truck. Staff has also been trained in the use of emergency repair kits and the use of self -contained breathing apparatus (SCBA's) and personal protection equipment. During shift changes staff meets regularly to discuss operational concerns.\n\nFive-Year Accident History\n\nThere have been no recorded accidental releases within the last five years. No chlorine related injuries have occurred within that time frame.\n\nEmergency Response Program\n\nThe NCSAWWTP Superintendent is the Facility Emergency Coordinator. In his absen"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000017543,
      "SummaryText": "ce, the Chief Operator is the next responder. The Off-Site Response Plan is posted and staff is aware of who is to be contacted and in what order. Specific procedures have been established. After the nature of the release has been identified, the NCSA Facility Emergency Coordinator will first notify the New Castle Fire Dispatch and advise them of the nature of the incident, the materials involved and whether evacuation is recommended. Additional notification will be given to LEPC, the Pennsylvania Emergency Management Council, and the National Response Center. Primary and secondary staging areas have been established in the event of a catastrophic release.\n\nPlanned Changes to Improve Safety\n\nCurrently, there are no planned changes to improve safety."
    }
  ]
}