{
  "FacilityID": 1000046399,
  "FacilityName": "Acid Products Company Inc.",
  "FacilityStr1": "600 West 41st Street",
  "FacilityStr2": null,
  "FacilityCity": "Chicago",
  "FacilityState": "IL",
  "FacilityZipCode": "60609",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.821040",
  "FacilityLongDecDegs": "-087.641780",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 148314503,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Acid Products Company Inc.",
  "OperatorStr1": "600 West 41st Street",
  "OperatorStr2": null,
  "OperatorCity": "Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60609",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dawn Brownlee",
  "RMPTitle": "HSSE Director",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000160256",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-08-15 00:00:00",
  "SafetyInspectionBy": "Department of Homeland Security",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-02-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-12-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-12-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-12-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.82033,
  "FRS_Long": -87.64106,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000057790,
      "AltID": "Formaldehyde Transfers",
      "FacilityID": 1000046399,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000058710,
          "ProcessID": 1000057790,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000070552,
          "ProcessID": 1000057790,
          "ChemicalID": 1,
          "Quantity": 36360.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000570552,
          "ProcessID": 1000057790,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000057791,
      "AltID": "Hydrofluoric Acid Transfe",
      "FacilityID": 1000046399,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000058711,
          "ProcessID": 1000057791,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000070553,
          "ProcessID": 1000057791,
          "ChemicalID": 55,
          "Quantity": 47098.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000570553,
          "ProcessID": 1000057791,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046399,
      "SummaryText": "Acid Products Company Inc. (APCO) has been doing business in Chicago, IL since 1916, and was incorporated in 1956.  APCO has a long history of serving many industry segments with chemical products and blends used in the plating, finishing, formulating and maintenance industries - to name a few.  \n\n\n\nAPCO is a member in good standing of the National Association of Chemical Distributors (adhering to the Responsible Distribution Code of Conduct), and are certified as an International Standards Organization (ISO).\n\nThe management of APCO has strived to instill in its workforce a work ethic that ensures the protection of its workers, the public, our property and the environment.  We take our commitment to safety and the Responsible Distribution Code of Conduct very seriously.\n\n\n\nIn the past, the management member responsible for Risk Management Program (RMP) had moved the program level from a Level 3 to a Level 2.  In the time since Tom Nisler replaced the prior manager as the Director, EH&S, is the operation increased the strength of product (Formaldehyde 36-12 went to Formaldehyde 37-11), AND the volume of material handled decreased and a Quantity control level of 4000 gallons set.  The change in strength of product handled was based upon marketplace demands because the weaker material was actually disliked by customers as not being as effective, thus we reverted to the higher strength and eliminated the weaker material.\n\nUnder RMP, APCO handles two products --- Formaldehyde 37-11 (see previous discussion on strength) and Hydrofluoric Acid 70%.  Prior RMP management had submitted a RMP discussing the utilization of tanks for both products; however, the Hydrofluoric Acid is no longer received or held in a tank.  The demand from our customer base no longer warranted the bringing in of bulk HF material, and the economics became such that there was no advantage to buying in bulk.  Thus, the tank used for HF 70% was emptied, triple rinsed, closed and \"sealed\" (with a number"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046399,
      "SummaryText": "ed seal documenting closing of the tank) to ensure It will not be used.  At one time, previous management responsible for RMP stated APCO wanted to keep the option open of potentially reinstituting the use of the tank sometime in the future.  After review by current management, the possibility of reverting back to bulk storage of HF 70% is not an option.  The market does not warrant reinstituting the use of this tank, and it has been purged, marked as \"out of service\", and sealed.\n\n\n\nFormaldehyde 37-11 product is brought in by tank truck, and off-loaded into a bulk storage tank.  The product is then transferred to drums and totes for transfer to customers.  \n\nAPCO has all necessary elements applicable to prevent accidental releases and has in place emergency response procedures in the event of an unintentional release of any product handled at the facility.  Our Operation Standards Manual contains procedures outlining proper unloading, transfer, and packaging procedures for the products in question.  In addition, we have Management of Change, Pre-Startup, and Process Hazard Analysis protocols for any newly developed processes, or change to an existing process.  New processes are not frequently employed by the facility, so routine reviews of the standard procedures are conducted and certified as being unchanged.  Periodic visits by emergency responders (i.e. Fire Department) are conducted to keep them continually aware of the operations conducted at the facility.  \n\nA review of our five-year accident history was conducted to find that no incident or accidents lead to off-site endpoints beyond the facility boundaries.  Regardless, we have updated our accident investigation process to represent \"best practice\" methods, and have updated our site contingency plan and emergency action plan to include improved material information --- including health and safety data, product reactivity information, and PPE and spill response information critical to increasing the knowledg"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046399,
      "SummaryText": "e base on the chemicals we work with.\n\nImprovements have been made to the mechanical integrity program to include inspection and/or testing of equipment such as holding tanks, valves, piping, pumps, containment, etc.  Replacement \"in kind\" has been undertaken to maintain a level of \"spare parts\" for immediate repair and/or replacement of equipment that is crucial to the safe and productive operation of our business.  \n\nThe EHS manager is designated as the person with overall responsibility for maintaining the integrity of the Risk Management Plan; overseeing the development; implementation and integration of the Risk Management Plan and Process Safety Management on behalf of Acid Products Company, Inc. and Prairie Packaging, LLC. \n\nThe Plant Managers of each facility have direct responsibility of reviewing, improving and directing the staff in implementation.\n\n"
    }
  ]
}