{
  "FacilityID": 1000013858,
  "FacilityName": "Cisco Natural Gas Plant",
  "FacilityStr1": "Grand County Road 175 &",
  "FacilityStr2": "Interstate 70",
  "FacilityCity": "Cisco",
  "FacilityState": "UT",
  "FacilityZipCode": "84515",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49019",
  "LEPC": "Grand County LEPC",
  "FacilityLatDecDegs": "38.99271",
  "FacilityLongDecDegs": "-109.29209",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G7",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.runningfoxes.com/",
  "FacilityEmailAddress": "stedesco@runningfoxes.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Running Foxes Petroleum, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Running Foxes Petroleum, Inc.",
  "OperatorStr1": "7060B S. Tucson Way",
  "OperatorStr2": null,
  "OperatorCity": "Centennial",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80112",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dan Brewer",
  "RMPTitle": "Production Supervisor",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000211594",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-07-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-07-06 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-07-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-07-07 00:00:00",
  "DeRegistrationEffectiveDate": "2015-07-01 00:00:00",
  "AnniversaryDate": "2015-07-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017346,
      "AltID": "Natural gas processing",
      "FacilityID": 1000013858,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017736,
          "ProcessID": 1000017346,
          "NAICSCode": "211111",
          "_desc": {
            "NAICS_CODE": "211111",
            "NAICS_DESCRIPTION": "Crude Petroleum and Natural Gas Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020644,
          "ProcessID": 1000017346,
          "ChemicalID": 155,
          "Quantity": 196121.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 99188,
              "ProcessChemicalID": 1000020644,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 99189,
              "ProcessChemicalID": 1000020644,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 99190,
              "ProcessChemicalID": 1000020644,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 99191,
              "ProcessChemicalID": 1000020644,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 99192,
              "ProcessChemicalID": 1000020644,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 99193,
              "ProcessChemicalID": 1000020644,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 99194,
              "ProcessChemicalID": 1000020644,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000520644,
          "ProcessID": 1000017346,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013858,
      "SummaryText": "Revised May 3, 2010\n\nAccidental Release Prevention and Response Policies\nThe Cisco Gas Plant is an existing facility located in a rural area south of Grand County Road 175/Old State Road 128 in Grand County, Utah.  The facility is a non-fractioning processing plant that receives natural gas by pipeline from nearby producing wells.  The facility removes condensable natural gas liquids (NGLs) and nitrogen from the inlet gas stream and ultimately delivers the natural gas to a sales pipeline for additional processing at a gas plant.  \n\nOperators of the facility have an on-going commitment to safety and accident prevention.  A program was implemented as part of the installation of a remote alarm and monitoring system for EH&S purposes.  The facility was constructed by skilled tradesmen who, in many cases, were required to demonstrate their skills and pass certification requirements prior to working on the project.  Shop-fabricated equipment mounted on skid units were used where possible to minimize field construction.\n\nAt this facility, critical process parameters are monitored remotely using supervisory control and data acquisition technologies. The Allen Bradley Panel View 1000 system allows monitoring of the site remotely while the satellite alarm sends a text message to the Facility Manager indicating when an alarm has been tripped or a compressor goes down.  Plant personnel are trained to respond to remote alarm conditions with on-scene responses.  \n \nDescription of the Stationary Source and Regulated Substances\nThe Cisco Gas Plant consists of several pieces of equipment.  The facility has two natural gas compressors driven by internal combustion engines engines, an engine driven generator, a glycol dehydration unit, a Joules Thompson (JT) skid used for natural gas liquid (NGL) extraction, a nitrogen rejection unit (NRU) and two storage vessels, one 400-bbl atmospheric tank for produced water and slop liquids and one 18,000 gallon pressurized tank for NGLs, in addit"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013858,
      "SummaryText": "ion to piping and other various pieces of infrastructure.  Natural gas enters the facility to be processed first through an inlet separator. Liquids collected in the inlet separator are directed to the 400-bbl atmospheric storage tank.  From the inlet separator the pressure of the natural gas is increased by a compressor before being sent to the dehydration unit.  Following glycol dehydration, the gas is piped through the JT skid to remove NGLs from the gas stream.  The extracted NGLs are piped from the JT Skid to the pressurized storage tank.  Following NGL extraction, excess nitrogen is removed from the gas stream via the NRU before being re-compressed by the 2nd compressor engine and routed to the sales gas pipeline.  Currently the facility processes approximately 150 thousand standard cubic feet per day (Mscf/day) of dehydrated natural gas and the JT expansion unit extracts approximately 17 gallons of NGL per day.   \n \nThe extracted NGL is a flammable mixture consisting of multiple regulated flammable substances including methane, ethane, propane, butane, and pentane.  Included with the regulated flammables are additional non-regulated flammables in the C-6 through C-10+ range.  The NGL is currently stored at ambient temperatures in a single 18,000 gallon pressure vessel maintained at approximately 125 psig to control vapor release.  Various production units and scrubbers remove produced water and condensate from the process stream and direct the liquids to a 400 barrel (bbl) vertical atmospheric storage tank (slop tank).  The slop liquids mixture contains multiple regulated flammable substances including methane, ethane, propane, butane, and pentane.  Included with the regulated flammables are additional non-regulated flammables in the C-6 through C-10+ range.\n\nThe flammable material storage capacity for the facility totals approximately 35,100 gallons including piping.  At full capacity, the planned storage volume will equate to approximately 196,121 lbs of fl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013858,
      "SummaryText": "ammable liquids, including materials contained within process piping.  No regulated toxic materials are stored at the facilities.  \n\nOffsite Consequence Analysis\nAt the subject facility, regulated flammable substances are generated and stored as a result of two separate processes; the separation of slop liquids and the extraction of NGL.  Storage vessels for the two processes are not connected; however the vessels are located in close proximity.  Due to the lack of intervening distance between the process vessels, a fire or explosion involving the vessel for one process could potentially spread to the second storage vessel. Therefore, for the purposes of the offsite consequence analysis, the slop and NGL vessels are all considered to be one process.\n\nThe worst-case scenario (WCS) associated with a release of flammable substances from the subject facility is a vapor cloud explosion (VCE) involving the full inventory of flammable materials for the two processes, including any flammable materials in the associated piping.  The endpoint for a VCE consequence analysis is the limit of the resulting 1 pound per square inch (psi) overpressure.\n\nAt the subject facility, the total volume of flammable materials is estimated at 35,100 gallons, assuming that the associated piping contains 1% of the storage volume.  For the WCS, the entire flammable material inventory is assumed to release and ignite resulting in a VCE.  There are numerous safety systems and administrative controls to prevent such releases, including physical isolation of the tanks, pressure relief valves, remotely operated shut-off valves, and remote level, pressure, and temperature monitoring; however no credit for administrative or passive mitigation measures was considered for the evaluation of the WCS.\n\nThe offsite consequence analysis for the subject facility (see attachment) indicates that the WCS distance to the 1 psi overpressure endpoint is 0.5 miles.  The figures included in the consequence analysis pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013858,
      "SummaryText": "esent the location of the subject facility and the boundaries of the WCS consequence endpoint.  As indicated, there no public receptors within the endpoint boundary, therefore the facility is eligible for Program 1 status. Since the facility is eligible for Program 1, no alternative release scenarios (ARS) were considered in the consequence analysis. \n\nGeneral Accidental Release Prevention Program\nThe Cisco Gas Plant facility is located in a remote area with no identified residential occupancies within one-half mile of the location of regulated flammable storage vessels.  There are no full-time employees assigned to the facility.  The estimated presence of onsite personnel is 4 hours per day.  As such, this facility is considered to be a normally unoccupied remote facility (NURF) and is not covered by the OSHA Process Safety Management (PSM) standard.\n\nEmployee Participation. All employees are trained in accident prevention and emergency response as part of their formal training.  Employees are expected to participate in the CompanyA?s Hazard Identification Program.    \n\nDesign Codes and Standards.  The facility is newly designed and constructed.  The design standards follow the most recent code requirements including, where appropriate, ASTM, ASME, API, and NEC. \n\nProcess Hazard Analysis.  An initial hazard review has been performed by facility personnel to identify major hazards that might be encountered.  This hazard identification includes the following potential items: fire, explosion, overpressurization, corrosion, overfilling, equipment failure, and loss of plant utilities.  Following the initial hazard review, periodic updates at least every 5 years and after any major process change, unplanned event, or release will be conducted.\n\nVarious process controls are in place to regulate the process and prevent any unplanned events.  The process equipment includes various vents, relief valves, check valves, manual shutoffs, automatic shutoffs, equipment interlocks,"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000013858,
      "SummaryText": " level monitors, and flow meters to maintain normal control.  Unexpected excess vapor can be relieved through safety relief valves.  Alarm systems continuously monitor the process.  The monitoring information can be accessed on-site, and is also transmitted remotely where it can be accessed by personnel at anytime. \n\nThere are no dikes or containment structures for the pressurized flammable substance storage tanks.  This provision is intentional and designed to allow volatile liquid spills to dissipate and spread over the greatest possible area and evaporate.  Use of dikes around the pressure tanks would contain a liquid pool, and a resulting pool fire could overheat the pressure tanks causing a greater hazard than the original evaporating spill.  With respect to the pressurized storage tank, no direct mitigation systems are in general use.  No area release monitoring or detection systems are in use other than the unit and tank process alarms from equipment failure, high level, high temperature, or high pressure. \n\nOperator Training.  Regular safety meetings are held by plant personnel to ensure proper safety measures are met while onsite.     \n\nContractors.   The facility uses various contractors for major plant modifications and for specific scheduled preventative maintenance and unscheduled maintenance operations.  Contractors are responsible for their own safety training and site safety briefings.\n\nCompliance Audits.  Compliance audits of the general facility including reporting and recordkeeping, operator, maintenance, and contractor compliance are planned.  To-date, no audits have been performed other than those associated with construction quality assurance.\n\nIncident Investigation.  Incidents (involving a catastrophic release) will be documented and investigated.  The investigation will begin within 48 hours of the release, and a written analysis of the cause and recommendations for future prevention will be prepared, discussed with affected personnel, and r"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000013858,
      "SummaryText": "etained for a minimum of 5 years.  To-date, there have been no catastrophic incidents.\n\nFive-Year Accident History\nThe facility is newly constructed and to-date there have been no accidents involving regulated substances that have resulted in any onsite injuries or significant property damage or any offsite response.\n\nEmergency Response Program\n\nThe subject facility has only Program 1 processes, therefore the operator is not required to prepare an Emergency Response Program compliant with 40 CFR 68.95.  No Emergency Response Program has been developed for the Cisco plant.\n"
    }
  ]
}