{
  "FacilityID": 1000111532,
  "FacilityName": "Harkins Street Holdings LLC",
  "FacilityStr1": "1040 Growers Street",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.655220",
  "FacilityLongDecDegs": "-121.631895",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Harkins Street Holdings LLC",
  "OperatorStr1": "P.O. Box 81091",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000166438",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-01-11 00:00:00",
  "SafetyInspectionBy": "Monterey County CUPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-03-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-03-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-03-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-03-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.652778,
  "FRS_Long": -121.627778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000138919,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 1000111532,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000174021,
          "ProcessID": 1000138919,
          "ChemicalID": 56,
          "Quantity": 120000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000140432,
          "ProcessID": 1000138919,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000119499,
              "Process_NAICS_ID": 1000140432,
              "SafetyReviewDate": "2023-09-11 00:00:00",
              "PHA_Date": "2023-09-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2026-03-27 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Lack of Maintenance, physical damage & vandalism/terrorism, design deficiency",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Diffusion Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Non-destructive testing, profiler used",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-02-23 00:00:00",
              "TrainingReviewDate": "2024-02-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Tailgate",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-02-23 00:00:00",
              "EquipmentInspectionDate": "2023-09-11 00:00:00",
              "EquipmentTested": "All refrigeration equipment",
              "ChangeMgmtDate": "2022-05-01 00:00:00",
              "ChangeMgmtReviewDate": "2024-02-23 00:00:00",
              "PreStartupReviewDate": "2022-05-01 00:00:00",
              "ComplianceAuditDate": "2022-08-10 00:00:00",
              "AuditCompletionDate": "2024-02-10 00:00:00",
              "IncidentInvestigationDate": "2021-10-03 00:00:00",
              "InvestigationChangeDate": "2021-10-07 00:00:00",
              "ParticipationPlansReviewDate": "2024-02-23 00:00:00",
              "HotWorkPermitReviewDate": "2024-02-23 00:00:00",
              "ContractorSafetyReviewDate": "2024-02-23 00:00:00",
              "ContractorSafetyEvalDate": "2024-02-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000149838,
                  "PreventionProgram3ID": 1000119499,
                  "ProcessChemicalID": 1000174021
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000140433,
          "ProcessID": 1000138919,
          "NAICSCode": "312113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000111532,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-02-23 00:00:00",
    "ERTrainingDate": "2024-03-15 00:00:00",
    "CoordinatingAgencyName": "Monterey County Health Dept.",
    "CoordinatingAgencyPhone": "8317554511",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 1000111532,
      "SummaryText": "complete location of leak detectors is found in the RMP with appropriate maps and location detail. \nThe Harkins Street Holdings LLC facility has implemented the state and county mandated Emergency Response Plan (a.k.a. Hazardous Material Business Response Plan (HMBP)). This plan outlines procedures for emergency ammonia release response as well as general facility response. Local community and business notification phone numbers are also found in the Emergency Response Plan.\n\nPlanned Changes to Improve Safety\nRecommended corrective actions to mitigate the potential for an accidental ammonia release are proposed on the tables located in RMP Binder Chapter 0.0. The table items result from recommendations made during the Process Hazard Analysis, a Code Compliance Review, Seismic Review, and a Safety Inspection performed by a qualified person. Some recommendation items in the recommendation table originate from multiple codes but are listed only once. Specific facility areas and systems categorize recommendations resulting from the Safety Inspection; some of which may repeat general Process Hazard Analysis and Code Compliance Review items. \nBased on the severity of the hazards identified, implementation deadlines are also recommended. All refrigeration equipment is well maintained and operated in a safe manner by trained personnel. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000111532,
      "SummaryText": "certified operations personnel are trained in safe operating practices of the basic engine rooms and refrigeration systems. Certificates of Achievement copies are maintained in the employee files.\n\nFive-Year Accident History\nAccording to Harkins Street Holdings LLC personnel, there has been no releases of anhydrous ammonia in the last 5 years that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nEmergency Response Program\nEmergency response policies are specifically noted in the RMP, with respect to a general overview; on-site personnel provide initial response. Harkins Street Holdings LLC facility is a Non-Responding facility On-site personnel will make a preliminary assessment in the event of a release and will provide first response (Harkins Street Holdings LLC personnel are trained in response). First response may include emergency shut down of equipment, system isolation, controlled operations, such as pump down to prevent or reduce an off-site release. Local fire and police departments will provide emergency response for a major release event with mutual aid from Harkins Street Holdings LLC response employees. Emergency response notification phone numbers are found in detail in the RMP reporting procedures. Detailed phone numbers are updated yearly. Phone numbers are located in the RMP binders and on the face of the Business Response Plan (which contains Harkins Street Holdings LLC emergency response information), Evacuation maps are provided, and windsocks are strategically located on the property to aid in determining prevailing wind and escape routes. Ammonia detection systems consist of detectors located throughout the property. These detectors are monitored by a computerized monitoring system. An automatic dialing system notifies Harkins Street Holdings LLC personnel and supervisors depending on the severity of the leak. A"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000111532,
      "SummaryText": "addresses is local PLC and computer (Andover) controlled. Operators record and monitor these locations on a shift basis or more frequently as required. The Andover System monitors on a real time basis and records data as needed and responds to out of parameter conditions.\n\nGeneral Accidental Release Prevention Program\nHarkins Street Holdings LLC facility utilizes visual inspections procedures prior to starting and stopping of on-line cooling equipment. This equipment includes compressors, condensers, and evaporation equipment as well as ice makers, vacuum tubes and air handling equipment. General visual inspections are done throughout the workday as the starting/stopping of the equipment is required. Inspections identify potential sources of problems and potential releases of ammonia. Equipment corrections are then resolved by on-site personnel, registered engineers and refrigeration contractors as required. Refrigeration equipment will be reviewed for updates and changes when changes occur or when new equipment is brought on site. As described above, Accidental Release Prevention is a continuing- ongoing process involving system inspection emergency response program and employee hazardous response training is also performed yearly. All new hires are trained in safety and operational safeties specific to the operation of the refrigeration equipment. Business Response Procedures and Emergency Response Procedures are updated yearly. Portable equipment, new to the site, is tested for operational safeties at the time of specific installation. All ammonia refrigeration maintenance and operations personnel are required to be trained and become familiar with the company's Safety and Operational Procedures and Emergency attendance records are maintained in the RMP binders. Yearly local community hazardous response training is made available to all employees, refrigeration personnel attend on an availability assigned basis. Records of attendance are in the RMP binders. RETA"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000111532,
      "SummaryText": "epeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. A Safety Data Sheet (SDS) for Ammonia is included in Chapter 8 Appendix 8.4 of RMP binder, which details the chemical properties, health hazards and exposure limits of anhydrous ammonia.\nAcutely Hazardous Material Uses: Anhydrous ammonia is used as the refrigerant in the refrigeration systems. The ammonia refrigeration system is a single-stage with a central plant and a piping loop distributing refrigerant throughout the site. The system contains approximately 120,000 lb. of ammonia. This is an engineering estimate based on calculations of the system volume. The exact ammonia volume is not known due to the system's age and the fact that the ammonia was not measured into the system. The TPQ for ammonia is 500 lbs. The main engine room is located at 1040 Growers Street. The main condensers and receivers and the main liquid shutoff valve (King Valve) are located at 1140 Meeks Street. The emergency ammonia high pressure diffusion system consists of a high to low pressure manual relief valve system; a low pressure to high pressure relief valve system, and a water diffuser system located at 1140 Meeks Street. Each system is only to be used in an absolute catastrophic emergency to relieve excess pressure. There are windsocks located around the main property as an aid for evacuation. A facility-wide computer system manufactured by Andover Corporation controls the temperature of the cold rooms, and operation of evaporators, compressors, and condensers. Safeties are monitored on a real time basis and the computer will test the appropriate responder in the event of an ammonia leak, and related safety hazards. Presently there are three (3) locations where portable compressor/condenser refrigeration trailer units are tied into the main refrigeration piping loop: 1166 Growers St, 1101 Merrill St, and H-10 1069 Growers St. Equipment located at these"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000111532,
      "SummaryText": "getables. The post-harvest cooling processes that are utilized include vacuum cooling, pressure cooling, hydro cooling, hydro vacuum cooling, ice making and ice injection. Harkins Street Holdings LLC also provides refrigeration to NINE (9) facility groupings (addressed sites and buildings) that are used for fresh vegetable processing and cold storage for various customers. Cold Storage facilities are located inside the basic foot print of all nine facilities. The 1060 Growers Street and the 1055 Merrill Street address do not have a cold room. 1060 Growers Street building was the administrative office for Harkins Street Holdings LLC. 1055 Merrill Street is currently a receiving/loading dock. The facility legal addresses are as follows:\n•\t1040 Growers Street (includes Main Engine Room and Condenser Stand located at 1140 Meeks St.)\n•\t1055 Merrill Street (Loading and Receiving Dock)\n•\t1080/1100 Growers Street (Cold Storage and Cooling Yards)\n•\t1069 Growers Street (Cold Storage and Cooling Yards)\n•\t1140 Growers Street (Small Freon Cold Room and Processing Building)\n•\t1060 Growers Street (Old Administrative Office)\n•\t1166 Growers Street (Cold Storage and Cooling Yards)\n•\t1067 Merrill Street (Cold Storage and Cooling Yards)\n•\t1101 Merrill Street (Portable Refrigeration Equipment)\n•\t1107 Merrill Street (Cold Storage and Cooling Yards)\n•\t1155 Merrill Street (Cold Storage and Packing Facility and Cooling Yards)\nNature of Hazard: Harkins Street Holdings LLC, Salinas, CA, produce cooling and shipping facility uses anhydrous ammonia as a refrigerant for their produce pre-cooling, ice making, cold storage and pressure cooling operations. Anhydrous ammonia (NH3) is a gas in its natural state and attacks mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and or pneumonia, with some residual reduction in pulmonary functions. R"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000111532,
      "SummaryText": "ecific safety procedures to prevent a release. Operators and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency response procedures in the event of an ammonia release. There are emergency shut off switches for shutting down the system. Personnel will automatically be notified if any detector exceeds set point. Monitoring is 24 hours a day. An emergency control box and diffusion tank allows system pressure to be relieved manually. Relief valves at the 1140 Meeks St. facility are tied to an ammonia diffusion tank to prevent high pressure releases to ambient.\nOn-site personnel provide initial emergency response. On-site personnel will make a preliminary assessment in the event of a release and will provide first response. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an offsite release.\nNo emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel and for releases above an ammonia concentration of 300 ppm.\nLocal fire and police departments with mutual aid response will provide emergency response for a major release event. The refrigeration contractors would also be on-call to provide emergency response.\nEmergency action training will be conducted yearly for current employees and as required for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\n\nStationary Source and Regulated Substances Handled\nPurpose: To provide the owner, operator and employees a means of identification and understanding of the hazards posed by the processes involving regulated substances, in this case, ammonia.\nNature of Business: Harkins Street Holdings LLC is an industrial refrigeration and ice manufacturing company specializing in the manufacturing of ice and providing refrigeration for process cooling of fresh fruits and ve"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000111532,
      "SummaryText": "of the refrigeration equipment.\n•\tBusiness Response Procedures and Emergency Response Procedures are updated yearly. The Business Response Plan includes the Emergency Action Procedures which are updated yearly.\n•\tPortable equipment, new to the site, is tested for operational safeties at the time of specific installation, typically at least once a year.\n•\tAll ammonia refrigeration maintenance and operations personnel are required to be trained and become familiar with the company's Safety and Operational Procedures and Emergency Response Plan (also referred to as Emergency Response Program). Regular department safety meetings with recorded employee participation are required. Records of attendance are maintained in the RMP binders. Ammonia Leak' response training occurs at company safety department meetings when meetings occur, typically on 12 times a year schedule. Yearly local community hazards response training is made available to all refrigeration on an assigned basis, work shifts and specific operations dictate actual attendance. Updated fit tests, and medical qualifications are done yearly; records are maintained.\n•\tRefrigerating Engineers & Technicians Association (RETA) certified personnel are trained in safe operating practices of the basic engine rooms and refrigeration systems. Certificate of Achievement copies are maintained in employee files.\n\nAccidental Release Prevention and Emergency Response Policies\nHarkins Street Holdings LLC will maintain a release prevention program to eliminate or minimize any releases. The program will include regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases for ways to prevent a similar future release, see Incident Investigation Forms. A Risk Management Program, which includes accident prevention procedures for the ammonia refrigeration system, is maintained onsite along with this RMP.\nThe ammonia refrigeration system has sp"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000111532,
      "SummaryText": "EXECUTIVE SUMMARY [CALARP: 19 CCR §2745.3, RMP: 40 CFR §68.155]\nThe Risk Management Program at Harkins Street Holdings LLC facility is designed to prevent the occurrence and minimize the consequences of releases of anhydrous ammonia from the refrigeration process. The following is a summary of the programs, policies, and procedures in place to reduce the risk of a hazardous materials release.\nThe purpose of the RMP is threefold: 1.) to prevent unwanted releases of hazardous chemicals, especially into locations that could expose employees and others to serious hazards, 2.) to identify hazards associated with the use of anhydrous ammonia, and 3.) to provide procedures to minimize the risks involved with handling this material.\nHarkins Street Holdings LLC has implemented the RMP at the Salinas, CA facility in order to comply with regulations and to fulfill this facility's responsibility to protect its employees, equipment, property, the surrounding community, and the environment from accidental releases of anhydrous ammonia.\nIn addition to the mandated prevention program elements listed in the RMP:\n•\tHarkins Street Holdings LLC facility utilizes visual inspection procedures prior to startup and shutdown of on-line cooling equipment. This equipment includes compressors, condensers, and evaporation equipment as well as ice makers, vacuum coolers and air handling equipment.\n•\tGeneral visual inspections are done throughout the day as starting or stopping of the equipment is required.\n•\tInspections identify potential sources of problems and potential releases of ammonia. On-site personnel, registered engineers and refrigeration contractors as required then resolve equipment corrections.\n•\tAccidental Release Prevention is a continuing ongoing process involving system inspection, emergency response program reviews and employee hazardous response training (performed yearly). All new operating technicians are trained in safety and operational safeties specific to the operation"
    }
  ]
}