{
  "FacilityID": 1000046938,
  "FacilityName": "Cullman Water Treatment Plant",
  "FacilityStr1": "US Highway 278 East",
  "FacilityStr2": null,
  "FacilityCity": "Cullman",
  "FacilityState": "AL",
  "FacilityZipCode": "35055",
  "Facility4DigitZipExt": "0278",
  "FacilityCountyFIPS": "01043",
  "LEPC": "Cullman County LEPC",
  "FacilityLatDecDegs": "34.199167",
  "FacilityLongDecDegs": "-086.810833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.cullmanpowerboard.com",
  "FacilityEmailAddress": "cwtp@hiwaay.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Utilities Board of the City of Cullman,",
  "Company2Name": "Alabama",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cullman City of Utilities Board",
  "OperatorStr1": "P. O. Box 278",
  "OperatorStr2": null,
  "OperatorCity": "Cullman",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35056",
  "OperatorZipCodeExt": "0278",
  "RMPContact": "David Freeman",
  "RMPTitle": "Manager",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000074359",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-02-14 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-10-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-10-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-09-13 00:00:00",
  "DeRegistrationEffectiveDate": "2019-07-01 00:00:00",
  "AnniversaryDate": "2019-10-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.1825,
  "FRS_Long": -86.81111,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058526,
      "AltID": "Chlorine Gas",
      "FacilityID": 1000046938,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000059508,
          "ProcessID": 1000058526,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000071490,
          "ProcessID": 1000058526,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000571490,
          "ProcessID": 1000058526,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046938,
      "SummaryText": "                             SUMMARY\n\n\n\n                       RISK MANAGEMENT PLAN\n\n              CULLMAN, ALABAMA WATER TREATMENT PLANT\n\n\n\n\n\nDescription of the Cullman Water Treatment Plant and Regulated Substances in Use\n\n\n\nIn 1996, the U.S. EPA promulgated titled Part 68 - Chemical Accident Prevention Provisions, after this,\n\ncall the \"Regulations\".  The Regulations in part, require owners of Water Treatment Plants using toxic\n\nsubstances, to take efforts to prevent and/or reduce accidental releases of those substances, and to\n\ndocument those efforts in a Risk Management Plan (RMP).  This summary highlights the main points of\n\nthe City of Cullman Water Treatment Plant RMP.\n\n\n\nThe Utilities Board of the City of Cullman, Cullman, Alabama, Water Divisions operates and maintains a\n\nwater treatment facility located on Highway 278.  At present, the plant can and does, on occasion,\n\nproduce up to 24 million gallons/day (MGD).  The plant currently serves approximately 90,000 people.\n\n\n\nCullman accomplishes disinfection of the water through the addition of chlorine.  Chlorine is the only\n\nregulated substances used at the Cullman WTP.  Cullman stores the chlorine at the WTP in one-ton\n\ncontainers.\n\n\n\nThe threshold amount for chlorine is 2,500.  The facility either stores or has in use at times up to 10-14\n\none-ton cylinders or 20,000 to 28,000 pounds of chlorine on hand.  It was determined that there is no\n\ntransportation of chlorine or manufacturing of a regulated substance in the plant operation.  Therefore, the\n\nthreshold amount is exceeded.\n\n\n\nPlant Changes to Improve Safety\n\n\n\nCullman has successfully operated their chlorine equipment to disinfect water for many years.  As\n\npart of the management program, certain items of construction have been accomplished.\n\n\n\nAll chlorine cylinders, whether in operation or storage, are contained in an airtight structure.  The airtight\n\nstructure is designed so that the loading of new or full cylinders will be passed directly to the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046938,
      "SummaryText": " receiving\n\nfacility prior to acceptance from the vendor.  The vendor is covered under the Department of\n\nTransportation and not the CAA(r)(7).\n\n\n\nThe facility, as stated above, will be airtight and shall have at a minimum:  (1) chlorine leak detectors,\n\n(2) automatic valve shut-off system, and (3) air scrubbing unit.\n\n\n\nThe chlorine leak detectors have been located strategically so as to detect a leak in any part of the facility\n\nwith a minimum amount of lapsed time.\n\n\n\nA system of automatic valve shut-offs have been installed and will be triggered by a signal from a leak\n\ndetector or by a panic button.  Panic buttons are located in the chlorine room itself and at other locations\n\noutside the room.\n\n\n\nAn air scrubbing unit or air filter has been installed to clean the air of any chlorine as it exhausts from the\n\nfacility.  The unit will be designed so as to clean the air in the entire facility based on the cubic feet of air\n\nin the facility.  The unit will be automatically triggered into action when a leak is detected.  When the air is\n\nclean in the facility, an \"All Clear\" signal will alarm.\n\n\n\nThe program, as designed, will contain any leak that may occur, warn personnel of the leak, shut off the\n\ncylinder valves, and clean the air through filters so that no chlorine gas may escape outside of the\n\ncontained area.\n\n\n\nFive Year Accident History\n\n\n\nThere has been no accidental releases of chlorine in the past five years that have caused onsite or offsite\n\npersonal injury or property damage, and offsite environmental damage, evaluation, or in-place sheltering.\n\n\n\nWorst Case and Alternative Release Services\n\n\n\nTo develop a worst-case scenario to the release of toxic substances like chlorine deciding the maximum\n\namount of substance that could be released is necessary and at what rate of release.  For the Cullman\n\nWTP, the regulations require that the effects of the release of the contents of a full one-ton container\n\nduring a ten minute period be evaluated.  This rele"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046938,
      "SummaryText": "ase volume and rate are used to develop the location of\n\nthe toxic end point.\n\n\n\nThe toxic end point is the maximum airborne concentration below which the EPA believes that nearly all\n\nindividuals can be exposed for up to one hour without experiencing or developing irreversible or other\n\nserious health effects or symptoms that could impair an individual's ability to take protective action.  The\n\nRegulations estimate the distance to the toxic endpoint, from the Cullman WTP for chlorine in a forested\n\narea, will be approximately 1.3 miles.\n\n\n\nAlternative release scenarios were developed for chlorine.  We assumed that a valve or fuse plugs, either\n\nof which are 1\"-diameter and can be below the liquid level in the one-ton cylinder, failed completely.  The\n\nRegulations predict that the release rates for the chemical is approximately 2,500 pounds per minute to\n\nchlorine.  Under the conditions described in the Regulations for the alternative scenarios, the distance to\n\nthe toxic endpoint would be approximately 0.7 mile for chlorine.\n\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention\n\nSteps\n\n\n\nThe City of Cullman compiled and maintains safety information related to chlorine and associated process\n\nequipment.  Material Safety Data Sheets (MSDASs) provide important data on the composition and\n\ncharacteristics of the chemicals.  Cullman maintains extensive operation and maintenance data on all\n\nchemical equipment and piping.  Operators can reference this material to ensure that they maintain all\n\npressures, temperatures, and flows within safe limits.\n\n\n\nPeriodically, operating procedures and equipment are reviewed to identify specific hazards and\n\nsafeguards.  Opportunities for equipment malfunctions or human errors are identified that lead to\n\ndevelopment of safeguards to control and/or prevent those malfunctions and errors.  Finally, all devices\n\nand steps that will detect and/or monitor releases are evaluated.\n\n\n\nStandardized procedures develo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000046938,
      "SummaryText": "ped by the chemical industry are used wherever appropriate.  These\n\nprocedures allow employees to work safely and are a source of information to prevent or mitigate the\n\nrelease of toxic substances.\n\n\n\nAll employees undergo on-the-job training in the safe handling of chlorine.  Additionally, at a minimum of\n\napproximately once every two years, employees attend training conducted by outside organizations.\n\n\n\nPreventive maintenance, inspection, and testing of equipment critical to safe operations have a high\n\npriority for the Cullman WTP.  This program reduces downtime due to equipment failures and lessons the\n\nrisks of accidental substance releases.\n\n\n\nAccidental Release Prevention and Emergency Response Policies at the Cullman\n\nWTP\n\n\n\nThe City of Cullman, Alabama strives to prevent accidental releases of toxic chemicals at its WTP.  They\n\nhave accomplished this through adherence to recommendations from the chemical manufacturers and\n\nequipment suppliers, periodic training of water treatment employees, and an ongoing preventive\n\nmaintenance program on the equipment.\n\n\n\nDavid Freeman, Manager, oversees implementation of the RMP and has overall responsibility for\n\nthe development, implementation, and integration of the RMP into Water Treatment Plant operators.  The\n\nCity has trained and properly equipped Water Plant staff to respond to small leaks whether in the\n\nchemical containers, container valves and fuse plugs, or system piping.  To date, Cullman's efforts have\n\nbeen successful.  Only a very few minor releases have occurred, were due to minor system leaks, and\n\nWater Treatment Plant staff repaired those leaks without any injuries or property damage.\n\n\n\nEmergency Response Program\n\n\n\nIf release of chlorine is beyond the capabilities of Water Treatment Plant staff should occur, the Cullman County Emergency Management Agency (EMA) will immediately be contacted.  The Cullman County EMA\n\nserves as a single-point coordination of fire, police, rescue, and all other agenci"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000046938,
      "SummaryText": "es that may be necessary\n\nto respond to both natural and man-made emergencies.  For a significant chemical release at the Cullman\n\nWTP, the City's hazardous material response team, that is part of the fire department, will respond to the\n\nWTP site.  The City has trained this group in all emergency response procedures regarding chlorine and\n\nsulfur dioxide.  Cullman County also has a hazardous material response team that the EMA can contact, if\n\nnecessary."
    }
  ]
}