{
  "FacilityID": 1000001550,
  "FacilityName": "Pool Chlor of Tucson",
  "FacilityStr1": "3116 East Pennsylvania Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Tucson",
  "FacilityState": "AZ",
  "FacilityZipCode": "85714",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04019",
  "LEPC": "Pima County LEPC",
  "FacilityLatDecDegs": "32.171455",
  "FacilityLongDecDegs": "-110.926003",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 799043021,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 785633058,
  "Company2DUNS": 0,
  "OperatorName": "Que Hale",
  "OperatorStr1": "3116 East Pennsylvania Ave",
  "OperatorStr2": null,
  "OperatorCity": "Tucson",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85714",
  "OperatorZipCodeExt": null,
  "RMPContact": "Que Hales",
  "RMPTitle": "General Manager",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000117982",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-31 00:00:00",
  "SafetyInspectionBy": "EPA Region 9",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-08-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-08-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-03-19 00:00:00",
  "DeRegistrationEffectiveDate": "2015-12-31 00:00:00",
  "AnniversaryDate": "2015-08-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.17165,
  "FRS_Long": -110.92568,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002048,
      "AltID": "Chlorine Transfer",
      "FacilityID": 1000001550,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000002138,
          "ProcessID": 1000002048,
          "NAICSCode": "56179",
          "_desc": {
            "NAICS_CODE": "56179",
            "NAICS_DESCRIPTION": "Other Services to Buildings and Dwellings"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002238,
          "ProcessID": 1000002048,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000502238,
          "ProcessID": 1000002048,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001550,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nPool Chlor of Tucson provides chlorination for recreational swimming pools in the Tucson, Arizona area.  Pool Chlor of Tucson has ensured a safe operation dating back to 1967.\n\nPool Chlor's general manager and owner are personally committed to offer superior service and to maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  The general manager administers the company's safety and environmental policies. He is also responsible for various inspections to ensure compliance, and oversees the entire safety and environmental programs.  These programs include, hazard communications, employee safety manuals, manufacturers documentation, Emergency Response, as well as the Risk Management Plan.\n\nFACILITY AND REGULATED SUBSTANCE HANDLED\n\nStartup of the chlorine system occurred in 1967.  The process is located at 3116 East Pennsylvania Ave., Tucson, Arizona 85714.  The chlorine system for Pool Chlor of Tucson consists of chlorine one-ton containers which are the storage vessels.  Chlorine gas is drawn from the ton container to 20-pound cylinders.  The following is a list of the chlorine equipment.\n\nChlorine Tanks (one-ton containers)\n(7 - Maximum that can be stored) Located at the south end of the facility\n\nChlorine Tanks (20-pound containers)\n(150 - Maximum that can be stored): Located on operators' trucks\n\nFilling Manifold: Located at the south end of the facility.\n\nScrubber System: Located at the south end of the facility.\n\nChlorine Sensor: Located at the south end of the facility.\n\nThe maximum quantity of chlorine that can be stored on site is 14,000 pounds.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nPool Chlor of Tucson has a Process Safety Management program in place to manage the handling of chlorine.  In addition, common industry standards, policies, and procedures are utilized to ensure safe pra"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001550,
      "SummaryText": "ctices are being performed.  This includes common practices outlined by the Chlorine Institute and the National Association of Gas Chlorinators.  In addition to the Management Programs, there is a scrubber system that is used to neutralize residual chlorine after the transfer process.\n\nFIVE YEAR ACCIDENT HISTORY\n\nAn investigation into the Pool Chlor of Tucson facility's accident history revealed that there have been no reportable chlorine releases over the past five years (March 2004 - March 2009) that exceeded the Federal Reportable Quantity of 10 pounds.  In addition, there have been no injuries resulting from a chlorine release.\n\nEMERGENCY RESPONSE PROGRAM\n\nPool Chlor of Tucson is a designated non-responding facility.  In the event of an accidental release of chlorine, Pool Chlor of Tucson will call 911 in order to reach the Tucson Fire Department's HAZMAT team.  Pool Chlor of Tucson has a B-kit available at the facility for emergency responder to use to mitigate a chlorine release.  Employees will evacuate the facility to a point that is upwind of the hazard.  Evacuation drills are performed annually.  The emergency action plan provides the response organization and notification procedures, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, and to ensure that the plan is kept current.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nPool Chlor of Tucson has revalidated the Process Hazard Analysis (Februrary 2009) which generated mitigation measures (recommendations) to improve safety at the Pool Chlor facility.  The scheduled completion date of all changes resulting from the PHA Revalidation is February 2010.  In the meantime, Pool Chlor of Nevada's safety committee has completed several items, including some recommendations, in a continual effort to provide a safe work environment for their employees.  The"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001550,
      "SummaryText": "se changes include the following items:\n\n1. Continue to train all employees in Process Safety Management and the facility's Safety Plan/Programs.\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}