{
  "FacilityID": 1000015021,
  "FacilityName": "Americold- Belvidere",
  "FacilityStr1": "6765 Imron Drive",
  "FacilityStr2": null,
  "FacilityCity": "Belvidere",
  "FacilityState": "IL",
  "FacilityZipCode": "61008",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17007",
  "LEPC": "Boone County LEPC",
  "FacilityLatDecDegs": "42.251528",
  "FacilityLongDecDegs": "-088.882500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Americold Logistics LLC",
  "Company2Name": "Americold Realty Trust",
  "CompanyDUNS": 85149378,
  "Company2DUNS": 0,
  "OperatorName": "Americold Logistics LLC",
  "OperatorStr1": "6765 Imron Drive",
  "OperatorStr2": null,
  "OperatorCity": "Belvidere",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61008",
  "OperatorZipCodeExt": null,
  "FTE": 67,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000061844",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-07-22 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-08-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-08-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-08-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-08-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.25154,
  "FRS_Long": -88.88276,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018912,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000015021,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000022499,
          "ProcessID": 1000018912,
          "ChemicalID": 56,
          "Quantity": 20636.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000019254,
          "ProcessID": 1000018912,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000015601,
              "Process_NAICS_ID": 1000019254,
              "SafetyReviewDate": "2009-12-09 00:00:00",
              "PHA_Date": "2008-07-31 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-02-26 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Ammonia, fire, smoke, refrigeration failure, burgular detection",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-08-18 00:00:00",
              "TrainingReviewDate": "2010-02-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-07-02 00:00:00",
              "EquipmentInspectionDate": "2010-04-30 00:00:00",
              "EquipmentTested": "ammonia detectors",
              "ChangeMgmtDate": "2010-03-16 00:00:00",
              "ChangeMgmtReviewDate": "2010-02-10 00:00:00",
              "PreStartupReviewDate": "2010-03-23 00:00:00",
              "ComplianceAuditDate": "2010-03-31 00:00:00",
              "AuditCompletionDate": "2010-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-11-06 00:00:00",
              "HotWorkPermitReviewDate": "2009-12-18 00:00:00",
              "ContractorSafetyReviewDate": "2010-02-10 00:00:00",
              "ContractorSafetyEvalDate": "2010-03-29 00:00:00",
              "CBI_Flag": 0,
              "Description": "There is one closed ammonia refrigeration system housed in one facility. The OSHA PSM standard and EPA RMP prevention program elements applies to this facility and is the basis for the prevention program implementation. The entire facility is sprinklered for added fire protection.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000018669,
                  "PreventionProgram3ID": 1000015601,
                  "ProcessChemicalID": 1000022499
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000015021,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Boone County Sheriff's Department",
    "CoordinatingAgencyPhone": "8155449322",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000015021,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nIt is the policy of all Americold facilities to conduct all operations in a safe manner.  This policy extends to all employees and contractors at the facility.  Americold implements this policy towards chemical and general safety through on-going employee participation, training, written operating procedures, maintenance, inspections, safety committee meetings, and safety reviews/evaluations.  These programs are in effect at the facility to prevent the accidental release of ammonia.  In the event of an ammonia accident, the facility has an Emergency Action Plan to notify the appropriate authorities and safely evacuate the facility. The facility has an emergency action plan.  The facility has trained employees that will provide emergency response support when required.  The facilty emergency response is coordinated with the local fire department, who will be the facility's emergency responder.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe ammonia refrigeration system is located at 6765 Imron Drive in Belvidere, Illinois. The main business of Americold Belvidere is cold storage and distribution of food products. \n\nThe regulated material present at the facility is anhydrous ammonia. The facility uses approximately 20,655.92 pounds of ammonia as a refrigerant within a closed system.  The system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cold storage, freezer storage, and dock areas. The majority of the system is located in the engine room including vessels and compressors.  The condensers are mounted on the roof, and the evaporators are located in their respective cold storage areas.\n\n\n\nENGINE ROOM DETAILS\n\n\n\nThe refrigeration cycle begins with the transfer of condenser drain liquid ammonia from "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000015021,
      "SummaryText": "the Condenser to the Thermosyphon Receiver.  The Thermosyphon maintains a level of priority liquid feed for compressor oil cooling and drains the excess liquid ammonia to the +60F Control Pressure Receiver.  The Control Pressure Receiver feeds liquid ammonia to Dock Evaporators AU1, AU2, AU3, AU11, AU12, AU13, AU22, AU23 and Maint. Shop AU10.  Pressure moves high temperature liquid from the Intercooler to the Dock Evaporators (AU1, AU2, AU3, AU11, AU12, AU13, AU22, AU23 and the Maint. Shop AU10) from which a liquid/vapor mix returns to the Intercooler Vessel as high temperature suction.  High temperature suction is drawn off the top of the vessel by the High Temperature Compressors RC-1 and RC-2. \n\n\n\nThe +60F Control Pressure Receiver also feeds the +15F Intercooler Vessel. The ammonia level in the Intercooler is maintained with a level probe and 2 solenoid valves. The Intercooler Vessel feeds the -28F Low Temperature Recirculator by using a level probe and 2 solenoid valves.  Pumps drive low temperature recirculated liquid from the LTR to the -2F to -17F Freezer Evaporators (AU5, AU6, AU7, AU8, AU9, AU14, AU15, AU16, AU17, AU18, AU19, AU20, AU21) from which a liquid/vapor mix returns to LTR as low temperature recirculated suction. \n\n\n\n  The Low Temperature Compressors RC-4 and RC-5 draw low stage suction from the top of the Low Temperature Recirculator. \n\n\n\nCompressor RC-3 is a swing compressor and is tied in to the high stage and low stage; it can operate at low or high pressure conditions depending on system need.  During normal operation, RC-3 is run off of the +15F suction line.\n\n\n\nThe high temperature and pressure discharge from all of the compressors is piped to a common high stage discharge line that feeds to the Condensers.  The high stage discharge is also utilized by all of the evaporators for hot gas defrost and by the plate and frame heat exchangers to heat glycol that is used for under-floor heating in the freezer rooms. At the Condensers, water (pumps"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000015021,
      "SummaryText": ") and air (fans) are used to condense the high stage discharge back to liquid ammonia, from which point the condenser drain feeds into the Thermosyphon Receiver and the cycle begins again.\n\n \n\nThe system is also equipped with an Automatic Purger.  The Auto Purger removes non-condensables (i.e., air and water) from the system.  Four purge points are located at the Condensers.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Americold - Belvidere ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with OSHA's Process Safety Management regulation.  \n\n\n\nThe facility including the ammonia system was designed and constructed in accordance with specifically outlined requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors in the engine room as well as sensors at each evaporator, and automatic shut down systems.  In addition, the majority of the ammonia is maintained inside the engine room.  All pressure vessels are equipped with pressure relief valves that are piped to 2 common headers and they are both equipped with ammonia sensors.\n\nThe facility operates in accordance with many of the International Institute of Ammonia Refrigeration (IIAR) guidelines. \n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have not been any accidents in the last 5 years. \n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nIt is the policy of Americold to implement the requirements of the company's Ammonia Emergency Action Plan to minimize the risk of injury due to exposure to ammonia. Company employees who have been trained in Ammonia Emergency Response will provide support other trained responders from the local fire department to protect employees and the surrounding community from harmful exposures to ammonia. In conjunction with this effort, traine"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000015021,
      "SummaryText": "d refrigeration operators with all the requirements of the PSM Standard and general good operating practices will be used to prevent a release of ammonia.\n\n\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazards Analysis (performed on July 31, 2008) study and a Facility Inspection, provided mitigation measures to improve safety at the Americold - Belvidere facility located at 6765 Imron Drive, Belvidere, Illinois. The Americold - Belvidere safety committee meets monthly to discuss safety items and implement measures to improve safety.\n\n\n\n"
    }
  ]
}