{
  "FacilityID": 1000119968,
  "FacilityName": "Wyckoff Farms, Inc",
  "FacilityStr1": "164806 W Lemley",
  "FacilityStr2": null,
  "FacilityCity": "Prosser",
  "FacilityState": "WA",
  "FacilityZipCode": "98930",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53005",
  "LEPC": null,
  "FacilityLatDecDegs": "46.252053",
  "FacilityLongDecDegs": "-119.841294",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "David Pierce",
  "OperatorStr1": "165808 W Lemley",
  "OperatorStr2": null,
  "OperatorCity": "Grandview",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98930",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000228522",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-08-01 00:00:00",
  "SafetyInspectionBy": "Prosser Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2025-03-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2025-03-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2025-03-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2030-03-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 46.253072,
  "FRS_Long": -119.843336,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000149721,
      "AltID": "MR4",
      "FacilityID": 1000119968,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000187123,
          "ProcessID": 1000149721,
          "ChemicalID": 56,
          "Quantity": 16200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000151314,
          "ProcessID": 1000149721,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000127870,
              "Process_NAICS_ID": 1000151314,
              "SafetyReviewDate": "2024-12-17 00:00:00",
              "PHA_Date": "2024-12-17 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2026-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Personal hand held meters",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-12-17 00:00:00",
              "TrainingReviewDate": "2024-12-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-12-17 00:00:00",
              "EquipmentInspectionDate": "2024-06-03 00:00:00",
              "EquipmentTested": "All equipment as part of IIAR 6 audit",
              "ChangeMgmtDate": "2020-01-06 00:00:00",
              "ChangeMgmtReviewDate": "2024-12-17 00:00:00",
              "PreStartupReviewDate": "2014-07-30 00:00:00",
              "ComplianceAuditDate": "2023-08-31 00:00:00",
              "AuditCompletionDate": "2024-08-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2024-12-17 00:00:00",
              "HotWorkPermitReviewDate": "2024-12-17 00:00:00",
              "ContractorSafetyReviewDate": "2025-01-08 00:00:00",
              "ContractorSafetyEvalDate": "2024-12-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000160220,
                  "PreventionProgram3ID": 1000127870,
                  "ProcessChemicalID": 1000187123
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000119968,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Prosser Fire Dept",
    "CoordinatingAgencyPhone": "5097863873",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "Yes",
    "NotificationDrillDate": "2025-02-21 00:00:00",
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "Yes",
    "LEPCCoordinationDate": "2024-06-06 00:00:00",
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "Yes",
    "LocalResponseAgencyCoordinationDate": "2025-02-19 00:00:00",
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000119968,
      "SummaryText": "The EPA RMP regulation requires that an Executive Summary be provided as part of the registration submitted to the EPA. \n\nThis process does not meet the requirements of Program 1. The process is subject to OSHA\u0092s PSM standard.  Therefore, this RMP is written to meet the EPA Program 3 level of compliance. \n\nThe following areas are addressed in this summary:\n\n1.\tAccidental release prevention and emergency response policies at the stationary source\n2.\tThe stationary source and regulated substances handled\n3.\tThe worst-case release scenario(s) and the alternative release scenario(s), including   \n         administrative controls and mitigation measures \n4.\tThe accidental release prevention program and chemical-specific prevention steps\n5.\tThe five-year accident history\n6.\tThe emergency response program\n7.\tPlanned changes to improve safety\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \n\nWyckoff Farms, Inc. abides by the emergency action procedures and policies detailed in the Emergency Action Plan manual. This Plan was designed to meet the following objectives:\n\n- To save lives.\n- To minimize and avoid injuries.\n- To protect the environment.\n- To minimize property damage.\n\nIn the unlikely event that a chemical release does occur at the facility, facility personnel are trained in the appropriate mitigation measures, relying on emergency services provided by the fire department and the Hazardous Materials Response team for releases requiring emergency response. Wyckoff Farms, Inc. maintains a team whose members are trained to be First Responder at the Operations Level and perform defensive actions. Wyckoff Farms, Inc. will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP/PSM program.\n\nThe Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to situations tha"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000119968,
      "SummaryText": "t may arise at the facility. This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes.\n\nSTATIONARY SOURCE ACTIVITIES AND REGULATED SUBSTANCES HANDLED\n\nThe Wyckoff Farms, Inc. facility is located at 164806 W. Lemley Road in Prosser, Washington. This location is situated at the intersection of Lemley and Williams Road, approximately 0.5 miles north of Interstate 82. The surrounding area is largely agriculture fields.  \n\nWyckoff Farms, Inc. built the facility in 2012. The facility receives, chills, freezes and stores berries. \n\nWyckoff Farms, Inc. uses anhydrous ammonia as a refrigerant within one closed system. In prior submittals, it was thought that the two systems that occupy the same building were tied together, creating one covered process with two separate engine rooms. Through a detailed and throughout walk and inspection of each system, it was determined that the two systems are not tied together. The inventory for only MR4 was used for this 5-year re-submit. \n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nKey objectives of Wyckoff Farms, Inc. prevention program are briefly described below:\n\nProcess Safety Information\nMaintain current and complete refrigeration system technical and equipment information. The facility has worked to locate and keep on file the original manufacturer OEM manuals, material of construction, equipment drawings, etc. for reference purposes and to aid in maintenance activities. \n\nNew equipment data is requested through the MOC process and is part of the contactor\u0092s package upon installation. The facility has also worked to further develop the information pertaining to the equipment in the covered process.  \n\nProcess Hazard Analysis\nProvide thorough team analysis of the Wyckoff Farms, Inc. refrigeration system. The team analyzed such scenarios as an overpressure situation, high and/or lower pressures or temperatures, corrosion, equipment failure, equipment siting,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000119968,
      "SummaryText": "emergency situations and human factors. The types of natural and human caused external events considered in the process hazard analysis include: \n\u0095\tearthquake, tornado, extreme severe weather, flood \n\u0095\tinadequate physical security devices (locks, lighting, fences) may lead to outside threats which \n        may lead to an anhydrous ammonia leak \n\u0095\tlack of security awareness training for employees to help identify internal threats\n\u0095\tlack of workplace violence policy and/or procedures could lead to a potential anhydrous \n        ammonia release \n\u0095\ta suspicious package is delivered with the intent to cause an anhydrous ammonia release \n\u0095\ta bomb threat that could cause an ammonia release \n\nAll recommendations developed by the team are reviewed and addressed by facility management. A priority list is developed, and target dates are set for the recommendations to reduce or eliminate hazards.\n\nOperating Procedures\nWritten procedures and policies are in place that establish how the refrigeration system is operated and maintained. Wyckoff Farms, Inc. has developed standard operating procedures for the required operating phases such as the safe and normal operation and shutdown of the Wyckoff Farms, Inc. refrigeration system. The manufacturer\u0092s OEM manual may be used for reference. The standard operating procedures are periodically reviewed to ensure they reflect the current operating practices and certified to such annually.\n\nMechanical Integrity\nPrevention is the primary reason regular and scheduled inspection, testing, and maintenance is performed on the Wyckoff Farms, Inc. refrigeration system. The system shall follow manufacturer recommendations, industry RAGAGEP, and/or industry practice to help maintain the system. The facility utilizes a mix of authorized and trained personnel and outside contractors to perform routine and emergency maintenance on the system.\n\nIncident Investigation\nWritten procedures and forms are in place detailing how and when the facility must inve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000119968,
      "SummaryText": "stigate releases. Wyckoff Farms, Inc. investigates releases and near misses that could have resulted in a catastrophic release of anhydrous ammonia. Recommendations are addressed and corrected by facility management. Reports are kept for five years. \n\nTraining\nWyckoff Farms, Inc. certifies operators following completion of operator training and confirmation of the operator's ability to apply what they have learned. Refrigeration operators are given initial training on hazards of anhydrous ammonia, an overview of the Wyckoff Farms, Inc. refrigeration system, and emergency operations to name a few. To ensure compliance with the procedures, refresher training is conducted as required.  Where possible, training utilizes direct experience in the field to facilitate task understanding and address multiple learning methods.\n\nEmployee Participation\nWyckoff Farms, Inc. employees help to improve and maintain the prevention program in multiple ways. Refrigeration operators participate in the process hazard analysis by providing system expertise. Refrigeration operators help develop operating procedures as well as ensure they reflect the true operating instruction. This involvement encourages ownership of the prevention program and positively affects the operators' day-to-day activities.  \n\nAll Wyckoff Farms, Inc. employees receive ammonia awareness training and their responsibilities within the Emergency Response Plan.  Additionally, they have access to the complete RMP / PSM, the IIPP and more for review, comment, and input. Together these activities improve the overall safety of the employees, environment, and the surrounding community.\n\nCompliance Audit\nThe audit process is a valuable tool to confirm Wyckoff Farms, Inc. compliance with the RMP / PSM program and whether each of the elements in the prevention program has been implemented and properly documented. Wyckoff Farms, Inc. has established a Management System to address any shortcomings which the audit may find. A pri"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000119968,
      "SummaryText": "ority list is developed, and target dates are set for any changes or corrections.  \n\nFIVE YEAR ACCIDENT HISTORY\n\nThe regulations require a review of the 5-year accident history at the regulated facility. The accident history must include \"all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\" (40 CFR 68.42). \n\nAn investigation into the Wyckoff Farms, Inc. facility accident history revealed that there have been no releases of ammonia that met the above requirements over the past five years (March 2010 \u0096 March 2025). \n\nEMERGENCY RESPONSE PROGRAM\n\nThis Emergency Action Plan, otherwise referred to as the EAP, has been developed to ensure adequate preparedness with rapid and appropriate response to emergency situations. The purpose of this Plan is to protect Wyckoff Farms, Inc. employees, contractors, visitors, the environment, and assets. \n\nThis plan was designed to be applicable to those types of emergencies that may affect Wyckoff Farms, Inc. and provides an organizational and procedural framework for the management of emergency incidents. The EAP also describes the coordination of Wyckoff Farms, Inc. and outside agencies to further protect employees and property, as well as the surrounding community and environment. \n\nThe EAP is based on the concept that the elements of emergency response are similar, regardless of the hazard. However, the EAP contains certain hazard-specific information in cases where the hazard requires a response that is unique and not covered by other elements of the EAP.\n\nWyckoff Farms, Inc. has implemented a team that is trained to respond defensively to ammonia releases. All refrigeration operators are trained at the First Responder Operation level. The Wyckoff Farms, Inc. EAP is designed to meet the regulatory requirements and give our employees and community the maxi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000119968,
      "SummaryText": "mum protection in the event of an ammonia release.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nEmployees, community safety, the environment and product care are primary concerns at this facility. Several PHA studies have been conducted at Wyckoff Farms, Inc., and each time the study team made recommendations for additional safety. During the most recent PHA, the team identified items that they hope will further improve safety at the facility. Refer to the master tracking log for the responsible individual, estimated and actual completion dates, status, etc.  \n\nWyckoff Farms, Inc. will respond to all suggested mitigation measures promptly. Wyckoff Farms, Inc. has established completion schedules for the proposed actions. Management responses and support will be consistent with Wyckoff Farms, Inc.\u0092s commitment to safe and environmentally responsible operations.\n\nWyckoff Farms, Inc. recognizes that the RMP / PSM is performance based and has processes in place to ensure the program is a living document. As such, this document and related attachments and program elements will evolve as Wyckoff Farms, Inc. continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community. Wyckoff Farms, Inc. will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the RMP/PSM, related attachments, and program elements will be incorporated consistently with Wyckoff Farms, Inc. internal review practices, and Wyckoff Farms, Inc. will maintain the most current versions onsite. Thus, the most current version RMP/PSM and related documents and elements maintained onsite may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    }
  ]
}