{
  "FacilityID": 1000105130,
  "FacilityName": "NV Regional Wastewater Treatment facility",
  "FacilityStr1": "507 Highway 85 North",
  "FacilityStr2": null,
  "FacilityCity": "Niceville",
  "FacilityState": "FL",
  "FacilityZipCode": "32578",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12091",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "30.531417",
  "FacilityLongDecDegs": "-086.493028",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": "nvrsbadmin@embarqmail.com",
  "FacilityDUNS": 796545861,
  "ParentCompanyName": "NV Regional Sewer Board, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "NV Regional Sewer Board",
  "OperatorStr1": "507 Highway 85 North",
  "OperatorStr2": null,
  "OperatorCity": "Niceville",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32578",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000060257",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-10-20 00:00:00",
  "SafetyInspectionBy": "Okaloosa County Emergency Management Agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-02-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-02-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-02-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-02-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 30.531417,
  "FRS_Long": -86.493028,
  "FRS_Description": "PLANT ENTRANCE (FREIGHT)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000131196,
      "AltID": "chlorination",
      "FacilityID": 1000105130,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000164458,
          "ProcessID": 1000131196,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000132664,
          "ProcessID": 1000131196,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000113044,
              "Process_NAICS_ID": 1000132664,
              "SafetyReviewDate": "2018-03-27 00:00:00",
              "PHA_Date": "2023-03-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-03-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Update All RMP Operating Procedure",
              "OpProceduresReviewDate": "2023-03-01 00:00:00",
              "TrainingReviewDate": "2023-03-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-03-01 00:00:00",
              "EquipmentInspectionDate": "2023-03-01 00:00:00",
              "EquipmentTested": "daily inspectoins of regulators, lines, vent fan and feed systems",
              "ChangeMgmtDate": "2018-03-27 00:00:00",
              "ChangeMgmtReviewDate": "2018-03-27 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2021-10-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-03-01 00:00:00",
              "HotWorkPermitReviewDate": "2023-03-01 00:00:00",
              "ContractorSafetyReviewDate": "2023-03-01 00:00:00",
              "ContractorSafetyEvalDate": "2023-03-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000141902,
                  "PreventionProgram3ID": 1000113044,
                  "ProcessChemicalID": 1000164458
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000105130,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-06-01 00:00:00",
    "ERTrainingDate": "2015-06-01 00:00:00",
    "CoordinatingAgencyName": "District 1 LEPC",
    "CoordinatingAgencyPhone": "8505958910",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000105130,
      "SummaryText": "1.\tExecutive Summary  68.155\t3\r\n1.1.\tAccidental Release Prevention And Emergency Response Policies     (a)\t3\r\n1.2.\tNV Stationary Source and Regulated Substance (b)\t5\r\n1.3.\tHazard Assessment (c)\t5\r\n1.4.\tAccidental Release Prevention Program  (d)\t6\r\n1.5.\tFIVE-YEAR ACCIDENT HISTORY  (e)\t8\r\n1.6.\tEMERGENCY RESPONSE PROGRAM  (f)\t9\r\n1.7.\tCHANGES TO IMPROVE SAFETY  (g)\t10\r\n \r\n1.\tEXECUTIVE SUMMARY  68.155\r\nThe Niceville - Valparaiso(NV) Regional Sewer Board, Inc.  operates a wastewater treatment facility in an mixed/residential industrial area in Niceville.  NV Regional Wastewater Treatment Plant at 507 Highway 85 North, Niceville, Okaloosa County, Florida.  The facilities EPA identification number is 1000 0006 0257 and the NAICS code for the site is 22132, sewage treatment facility.  The general commercial function of the facility is to treat raw wastewater and render acceptable discharge or reuse.  This plant is one of two plants operated by the City.  Both the water plant and waste water plant have quantities of regulated hazardous chemicals above the EPA threshold.  NV has a unified Risk Management Program which applies to each plant.  Only Wastewater Treatment Plant operations and policies are presented in this Plan.\r\n1.1.\tACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES     (A)\r\nNV Regional Wastewater Treatment facility is operated by NV staff.  The facility has regulated hazardous chemicals above the EPA threshold.  NV accidental release prevention policy involves a unified approach that integrates technologies, procedures and management program which applies to chlorination operation.  NV Treatment Facility operations and policies are presented in this Plan.  The plant prevention program complies with all applicable procedures of the U.S.  Environmental Protection Agency (EPA) Risk Management Program (RMP) 40 CFR-68,  Prevention Program.\r\n1.1.1.\tManagement System  (a)(1)\r\nNV has a management system in place which is lead by the NV Plant Manager, who over"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000105130,
      "SummaryText": "sees the implementation and on-going use of the RMP elements.  This program, along with other specific policies, eliminates and /or reduces the likelihood of a chlorine release at the Facility.  An organizational chart defining the lines of authority and responsible staff is included in the Facility RMP Process Safety Information.\r\n1.1.2.\tPrevention Program Level (2)\r\nNV has implemented and maintains policies, procedures and systems as part of our prevention program.  These are applied to each treatment plant and specifically the Wastewater Treatment Plant.  The program addresses each of  the EPA Program Level 3-listed 12 elements, plus  RMP elements needed to implement the program, and the like elements in place in the facility, OSHA PSM program.  RMP also requires the following elements as management system, hazards assessment off site, and RMP plan submittal needed to implement the program.  These are maintained in by NVOC¿s Wastewater Treatment Facility Document Management System.\r\n1.2.\tNV STATIONARY SOURCE AND REGULATED SUBSTANCE  (B)\r\nNV Regional Wastewater Treatment Plant employs 12 full-time employees engaged in wastewater treatment facility and field operations.  NV also employs contractors and consultants for specialized  tasks.  Chlorine is used as part of the treatment process.\r\n1.2.1.\tSite Description  (b)(1)\r\nThe site is owned and operated by NV Regional Sewer Board.  The Wastewater Treatment Plant is located at 507 Highway 85 North, Niceville, Okaloosa County, Florida.  The site is located in a block area, boarded by Highway 85, North, on the west, an undeveloped commercial property on the north, the Egland Golf Course on the east and an undeveloped commercial property on the south.  The site has a security fence that surrounds the plant site.\r\nThe Plant includes an elevated chlorine storage area and adjacent control distribution system that contains the wastewater plant, administrative and lab building.  The boundaries of the chlorine system subject"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000105130,
      "SummaryText": "to the RMP regulation include the Bulk Chlorine Storage and Feed Control room and the associated vent makeup and exhaust system.  These are detailed in the Process and Instrument Drawings (P&ID) which are part of the plant Process Safety Information (PSI).\r\n1.2.2.\tRegulated Substance  (b)(2)\r\nChlorine is the only regulated substance on site which exceeds the EPA 40 CFR-68 rule threshold quantity.  NV chlorine process was installed as part of the process of purifying wastewater for public consumption.  It operates under permit from the State of Florida Department of Environmental Protection (FL DEP).  The chlorine is received, stored and distributed to five process control systems.  \r\nChlorine is an EPA and OSHA-listed toxic chemical.  It is an irritant and it is corrosive.  Chlorine is a halogen with the formula Cl2.  It is a chlorinating or oxidizing agent that is not flammable.  It has a 1 ppm OSHA ceiling Permissible Exposure Limit (PEL) and a NFPA health rating of 4, severe; with immediate and delayed health hazards.  Chlorine is not a carcinogen.\r\n1.3.\tHAZARD ASSESSMENT (C)\r\nA hazard assessment was performed to determine the effects a release would have on the public and environment.  For chlorine, the distance the endpoint concentration of the gas could travel was determined.  In addition, an estimate of the population that could be affected by a release of Chlorine was determined, and sensitive receptors such as hospitals, schools, and churches were identified.  \r\nThe offsite consequence analyses was conducted included two chemical release case scenarios.  The first is a ¿worst case flammable release¿.  The second is a worst case toxic release scenario¿.  Both scenarios are defined by EPA, which states that ¿the operator shall assume that the maximum quantity in the largest vessel is released within 10 minutes¿ due to an unspecified failure.  The alternative case scenario were based on plant experience and process hazards analysis.  the alternative case scena"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000105130,
      "SummaryText": "rio is defined as ¿more likely to occur then the worst case scenario¿.  Atmospheric dispersion modeling was performed using RMP Comp to determine the distance traveled by the chemicals released before its concentration decreases to the ¿toxic endpoint.¿  Land view 6.0 was used.  This program contains the latest US census date.  \r\nAtmospheric dispersion modeling was performed to determine the distance traveled by the chlorine released before its concentration decreases to the ¿toxic endpoint.¿  ¿\r\n1.3.1.\tWorst Case   (c)(1)\r\nAtmospheric dispersion modeling for the worst case scenario was performed using the EPA RMP Comp Program.  Results demonstrate a distance of excluded( * )   miles to the toxic endpoint.  The residential population that could potentially be affected by the release is estimated at excluded. ( * )  people.  There are numerous public receptors included in that release area.  These Figures are included in the RMP report maintained on site by NV.\r\n* distance to the end point and population are excluded.  They are included in the Executive Summary as part of the facility records.\r\n1.3.2.\tAlternative Case   (c)(2)\r\nThe alternative release scenario involves the failure of the yoke assembly regulator of the pressure system connected to one of the one-ton containers.  This failure is equal to creating a 1/16 inch diameter hole in either the yoke assembly, the drip tube, a pipe, or even the container.  Modeling using the EPA  water guidance demonstrated the rate of chlorine release is 59.3 lb./min.  The toxic endpoint distances determined is excluded( * )  miles.  The residential population that would be impacted by this release is estimated at excluded( * ), by touring the area around the plant as Landview 6.0 had a excluded( * )  estimate.\r\n1.4.\tACCIDENTAL RELEASE PREVENTION PROGRAM  (D)\r\nNV accidental release prevention program is based on OSHA's PSM program and EPA's RMP Level 3 prevention program.  The PSM program has been in place and effectively used"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000105130,
      "SummaryText": "for several years.  It is part of the plants operating culture.  NV is a municipal entity and is exempt from OSHA regulation.  There are two parts to the program.  The first is the general overall NV wide Wastewater Treatment Plant site program.  The second is the chlorine-specific actions within the site program.  This is coordinated with the Niceville Fire Department as well as Florida District 1 L.E.P.C.\r\n1.4.1.\tGeneral Accidental Release Prevention Program   (d)(1)\r\nFacility-wide and on site prevention program is used for all operations.  An overview of the generally written programs is listed below:\r\nNV has detailed process safety information on each of its operations.  \r\nHave detailed operating procedure which is kept in a document maintenance system, this system is integral to the management of change for all operations on site.  \r\nTraining is the backbone of employee knowledge, job operations and is ongoing in each area.  Employee training in operations and maintenance emphas awareness of the hazardous and toxic properties of all chemicals used, or handled.  \r\nMaintenance and preventive maintenance are used for all operations making mechanical integrity a part of each piece of equipment.  \r\nIncident investigations of accidents and near-miss incidents ensure we learn from each event as well as correct the causes of the incident.  \r\nEmployees participate in all aspects of the development and implementation of our health, safety and environmental and air program as emergency response program.  \r\nSafe work practices are used throughout the facility including:  1) Hot Work Permits, 2) Lock Out Tag Out Permits, 3) Vessel Entry Permits, 4) Site Security, and 5) Breaking Into Chemical Lines procedures.  \r\nContractors must meet NV's high safety and technical standards as part of selection and ongoing evaluations.  In addition, NV demands training of contractors to our standards.\r\n1.4.2.\tChlorine-Specific Response Program  (d)(2)\r\n1.4.2.1.\tChlorine-Specific Policies a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000105130,
      "SummaryText": "nd Procedures\r\nChemical-specific prevention features of the plant include: the policies and procedures listed above and those of the chlorine specific program.  These include:\r\nSpecific procedures for the operation of the chlorine process.  \r\nUse of a Pre-startup Safety Review prior to startup of modifications to the chlorine system.  \r\nSpecific emergency response procedures for chlorine releases as outlined below under both operating procedures and in the emergency response procedures.  \r\nSpecific training in the properties, hazards, handling requirements, and leak repair for chlorine.  \r\nFinally, the details of both facility and equipment design are key to the safe operations of the chlorine system.\r\n1.4.2.2.\tFacility Design\r\nThe plant and support equipment of the chlorine storage building and chlorine feed room meet and exceed design codes standards and good engineering practices.  The building is equipped with ambient ventilation area.  The control room has a fan ventilation system\r\n1.4.2.3.\tEquipment Design\r\nThere are two types of chlorine pipe systems, high and low (vacuum) pressure.  The high pressure chlorine piping system is made of chlorine compatible steel pipes or equipment.  These materials are steel or chlorine compatible non-metallic compound (not corroded by chlorine) rated to 500 psig.  The maximum pressure of the chlorine in the high pressure system is only 150 psig giving a 3 to 1 safety factor.  The low pressure system operates under a vacuum pressure of 13 inches of mercury.  All the pipe, tubes, and equipment are also chlorine compatible.  The system is designed to 150 psig or complete vacuum giving it a large safety factor over the typical vacuum or positive pressure in it.  There is a chlorine monitor which detects the presence of chlorine in the storage and control building room.  The alarms and lights in the plant alert employees of a potential chlorine leak.  Plus, the alarm automatically turns on the vent fan for the room.\r\n1.5.\tFIVE-YEAR"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000105130,
      "SummaryText": "ACCIDENT HISTORY  (E)\r\nNV Regional Sewer Board, Wastewater Treatment Plant had no accidental releases of chlorine in the past five years per EPA 40 CFR 67.42 (a).  \r\n\r\n1.6.\tEMERGENCY RESPONSE PROGRAM  (F)\r\nEmergency response procedures are contained in NV Emergency Response Plan.  The plan includes an emergency response ¿decision tree¿ and a notification plan.  The Plant site specific emergency actions defined in the plants operating procedures.  Emergency response drills and drill evacuations are conducted annually by the operating department.  Emergency operation and response procedures are also reviewed at that time.\r\nThe emergency response program is coordinated (reviewed by) with the Niceville Fire Department which coordinates with Local Okaloosa County Emergency Response Planning Committee (LEPC) and Niceville Fire Department HazMat Team and with the Okaloosa County HazMat Team.  All are located in Okaloosa County, Florida.  Copies of the program are given to key local agencies including: fire, medical, rescue,  management, and police departments in NV.  Besides the specific emergency response program, key elements of the prevention programs are incorporated in the operating culture of NV Regional wastewater plant.\r\nThe procedures detail the actions and responses to chlorine spills (releases).  The plan includes training of all chlorine-area operators,  The primary response team include the Niceville Fire and Rescue, plus the Okaloosa County Haz Mat Teams.  All of these respond to severe chlorine leak situations.  Actions include catastrophic, severe, and moderate leaks.  A Chlorine ¿B¿ Leak Repair Kit is maintained at the waste water treatment plant to aid in stopping leaks.  Public notification is facilitated through the City of Niceville Police's Office, which has an automated emergency dialing message system for public notification.\r\n1.6.1.\tPersonnel  (f)(1)\r\nPersonnel are the key resource of  NV's prevention program.  NV employees make up the operators a"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000105130,
      "SummaryText": "nd emergency first response teams.  NV fosters a high level of involvement in every aspect of the chlorine system operations including participation in :\r\n1.6.1.1.\tRMP Safety Team, \r\n1.6.1.2.\tProcess hazards Analysis Team,\r\n1.6.1.3.\tDevelopment of the operation procedures, \r\n1.6.1.4.\tHazard evaluations, and \r\n1.6.1.5.\tOn-going training of the operators and other involved staff.\r\n1.7.\tCHANGES TO IMPROVE SAFETY  (G)\r\nChanges to improve safety (recommended actions) were identified in the August 21, 2006, internal safety HazOp, tour, and audit of the RMP program to meet requirements of the Risk Management Prevention Program.  These recommended actions have now been evaluated and implemented as required.  An Audit was conducted to review the PSM program.  The key safety action items were completed.  See the ¿Update¿ Section 6 of this report.\r\nNV continually reviews implemented operating procedures for potential safety improvements for all of its operations.  Currently, NV management team and process safety team are reviewing potential upgrades to the existing design of the chlorine operations to make the system even safer to prevent a release and minimize consequences in the event of a release of chlorine."
    }
  ]
}