{
  "FacilityID": 1000039324,
  "FacilityName": "DWSD - NORTHEAST WATER TREATMENT PLANT",
  "FacilityStr1": "11000 East Eight Mile Road",
  "FacilityStr2": null,
  "FacilityCity": "Detroit",
  "FacilityState": "MI",
  "FacilityZipCode": "48205",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26163",
  "LEPC": "City of Detroit Fire Dept.",
  "FacilityLatDecDegs": "42.448056",
  "FacilityLongDecDegs": "-083.014444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.glwa.org",
  "FacilityEmailAddress": "public.affairs@dwsd.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Detroit Water and Sewerage Department",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Great Lakes Water Authority",
  "OperatorStr1": "735 Randolph",
  "OperatorStr2": null,
  "OperatorCity": "Detroit",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48226",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": "110000718652",
  "EPAFacilityID": "100000112923",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-06-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-02-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-02-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-02-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-02-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.451,
  "FRS_Long": -83.00697,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000048275,
      "AltID": "Chlorination of Water",
      "FacilityID": 1000039324,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000058662,
          "ProcessID": 1000048275,
          "ChemicalID": 62,
          "Quantity": 84000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000048717,
          "ProcessID": 1000048275,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000041903,
              "Process_NAICS_ID": 1000048717,
              "SafetyReviewDate": "2012-04-10 00:00:00",
              "PHA_Date": "2014-04-22 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-10-21 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Process operates under vacuum",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Detector at outlet of scrubber",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-03-23 00:00:00",
              "TrainingReviewDate": "2013-04-03 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-05-30 00:00:00",
              "EquipmentInspectionDate": "2014-01-24 00:00:00",
              "EquipmentTested": "Scrubber",
              "ChangeMgmtDate": "2011-03-25 00:00:00",
              "ChangeMgmtReviewDate": "2011-04-08 00:00:00",
              "PreStartupReviewDate": "1999-05-17 00:00:00",
              "ComplianceAuditDate": "2012-04-10 00:00:00",
              "AuditCompletionDate": "2012-06-05 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-04-09 00:00:00",
              "HotWorkPermitReviewDate": "2012-03-01 00:00:00",
              "ContractorSafetyReviewDate": "2012-05-29 00:00:00",
              "ContractorSafetyEvalDate": "2013-03-12 00:00:00",
              "CBI_Flag": 0,
              "Description": "This prevention program applies to the use of chlorine from one ton containers through evaporators, chlorinators, and associated piping to the chlorine injectors, where the gaseous chlorine is dissolved in process water.  The distribution of chlorine as a solution of water is not included.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000049948,
                  "PreventionProgram3ID": 1000041903,
                  "ProcessChemicalID": 1000058662
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000039324,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2011-12-12 00:00:00",
    "ERTrainingDate": "2012-03-14 00:00:00",
    "CoordinatingAgencyName": "City of Detroit Fire Dept.",
    "CoordinatingAgencyPhone": "3135962906",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039324,
      "SummaryText": "Clean Air Act Amendments Section 112 (r)(7)\nAccidental Release Prevention Programs:\n40 CFR Part 68 Subpart G\nRisk Management Plan\n\nEXECUTIVE SUMMARY\n\nThe Detroit Water and Sewerage Department's Northeast Water Treatment Plant is a stationary source that is subject to the Risk Management Programs under the Clean Air Act, Section 112 (r)(7) (as promulgated in 40 Code of Federal Regulations Part 68).  The Northeast Water Treatment Plant stores chlorine in quantities in excess of the 2,500 pound Risk Management Program threshold.\n\nPursuant to 40 CFR A? 68.150, the Northeast Water Treatment Plant is required to submit a single Risk Management Plan (RMP) that includes the information required by A?A? 68.155 through 68.185.  The Northeast Water Treatment Plant is also required to provide an executive summary in the RMP.  The following is a brief description of various elements of the facility's Risk Management Program, as required by 40 CFR A? 68.155:\n\n(a)THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\n\nThe Detroit Water and Sewerage Department (DWSD) operate five water treatment plants in the Southeast Michigan area.  While the production of potable drinking water is vital to the welfare of the community, DWSD recognizes that the safe handling of the chlorine used in the water disinfection process is also critical to the welfare of the community.  DWSD recognizes that the U.S. Environmental Protection Agency lists chlorine as a regulated toxic substance pursuant to the Accidental Release Prevention and Risk Management Program regulations.\n\nDWDS is committed to the implementation of stringent safety precautions for chlorine handling at all of its water treatment facilities.  These safety precautions are necessary to prevent accidental releases of chlorine that could threaten the health of DWSD employees, DWSD contractors, and the members of the community DWSD serves.  To this end, DWSD implements routine equipment maintenance and "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039324,
      "SummaryText": "process improvements, operational procedures, employee training programs, and emergency response procedures, and is committed to compliance with all applicable state and federal regulation.\n\n(b)THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe Northeast Water Treatment Plant treats water from the Detroit River to produce potable drinking water.  The plant typically produces 125 million gallons per day (MGD) of treated water.\n\nThe plant adds aluminum sulfate (alum) to the water to aid in the removal of particulate matter.  The alum produces a precipitate that binds to fine particles; the resulting larger particles settle out.  On an as-needed basis, the plant uses its carbon system to add activated carbon to the water.  Activated carbon can remove tastes and odors that may exist in the influent water.  The plant uses its fluoride system to add fluoride to the water.  The fluoride provides water consumers with protection against tooth decay.  The plant also adds phosphoric acid to the water to minimize the leaching of lead from water distribution piping.  The plant's alum, carbon, fluoride, and phosphoric acid systems do not contain chemicals that are designated as regulated toxic or flammable substances pursuant to the Accidental Release Prevention and Risk Management Program regulations.\n\nWater disinfection using chlorine occurs at the beginning of the treatment process (pre-chlorination) and as a final treatment step (post-chlorination).  The primary components of the plant's chlorine system include a maximum of forty-two (42) 2,000 pound containers of chlorine, two (2) evaporators, eight (8) chlorinators, and the associated chlorinated water distribution components (e.g., polyvinylchloride piping).  The facility is also equipped with a chlorine abatement system (scrubber) that is capable of neutralizing the contents of one (1) 2,000 pound container of chlorine.\n\nChlorine is designated as a \"regulated toxic substance\" pursuant to the Accidental Release Pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039324,
      "SummaryText": "evention and Risk Management Program regulations.  The Northeast Water Treatment Plant has more than the threshold quantity (2,500 pounds) of chlorine in its water disinfection process; therefore, the attached Risk Management Plan addresses this single covered process.\n\n(c)THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Northeast Water Treatment Plant stores, handles, and uses chlorine in its water purification process.  The Northeast Water Treatment Plant has established a Process Safety Management Plan (PSM).  The information contained within this PSM Plan establishes the protocols needed to safely handle and use chlorine.  The plan is designed to prevent and minimize the effects of an unplanned, sudden or non-sudden incidents involving chlorine.  This plan is designed to meet the regulatory requirements of MIOSHA, Rule #40819102 Process Safety Management Program.\n\nSpecifically this plan protects the community using a combination of operating procedures and safe work practices, equipment design, emergency operations and shut-down procedures, building design, containment, chlorine scrubbing equipment, and employee training and education.\n\nThe requirements of the Process Safety Management Plan will be implemented as an on-going compliance policy to ensure that chlorine is safely stored, handled, and used by the Northeast Water Treatment Plant.  This plan provides direction for the current and future use and handling of chlorine, and ensures that any release of chlorine can be safely contained and neutralized so as to minimize its impact on the community.\n\n(d)THE FIVE-YEAR ACCIDENT HISTORY\n\nIn the last five (5) years at the Northeast Water Treatment Plant, there have not been any reportable releases of chlorine or chlorine releases that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000039324,
      "SummaryText": "(e)THE EMERGENCY RESPONSE PROGRAM\n\nThe Northeast Water Treatment Plant has a documented Chlorine Emergency Response Plan.  The Northeast Water Treatment Plant is also included in an Emergency Response Plan that was developed for all Detroit Water and Sewerage Department (DWSD) facilities.  The DWSD Emergency Reponses Plan has an appendix that specifically addresses accidental releases of chlorine.  The plans address the notification of local emergency response agencies and the public, emergency first aid and medical treatment, response strategies and incident command, and specific procedures for responding to chlorine releases.\n\nNortheast Water Treatment Plant personnel that have the potential for responding to accidental releases of chlorine have received formal emergency response training (e.g., 40-Hour HAZMAT training). In addition, the personnel receive 8 hour HAZMAT refresher training annually.  \n\nThe Northeast Water Treatment Plant is equipped with electronic chlorine detectors.  If the detector senses chlorine at a concentration of 1 part per million or greater, an audible alarm will sound and flashing red lights will be activated.  Three operators are on site at all times to respond to an alarm.  During off shifts, a fourth person would be requested. The external notification of local emergency response agencies and the public would be conducted on an as-needed basis, in accordance with the facility's Emergency Response Plan.\n\nIn the event of a release, the Northeast Water Treatment Plant is equipped with a scrubber that is capable of neutralizing the contents of one 2,000 pound container of chlorine.  \n\n(f)PLANNED CHANGES TO IMPROVE SAFETY\n\nThe Northeast Water Treatment Plant completed a major renovation of its chlorine system in 2004; therefore, no major process changes are expected at the plant in the near future."
    }
  ]
}