{
  "FacilityID": 1000002080,
  "FacilityName": "Springfield - 3M Company",
  "FacilityStr1": "3211 East Chestnut Expy",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "MO",
  "FacilityZipCode": "65802",
  "Facility4DigitZipExt": "2592",
  "FacilityCountyFIPS": "29077",
  "LEPC": "Greene County LEPC",
  "FacilityLatDecDegs": "37.213097",
  "FacilityLongDecDegs": "-093.228012",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "rmp3m@mmm.com",
  "FacilityDUNS": 43937895,
  "ParentCompanyName": "3M",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "3M Company",
  "OperatorStr1": "3211 East Chestnut Expy",
  "OperatorStr2": null,
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "65802",
  "OperatorZipCodeExt": "2592",
  "FTE": 334,
  "OtherEPAFacilityID": "65802M3211E",
  "EPAFacilityID": "100000157643",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "OP2006-056",
  "SafetyInspectionDate": "2012-10-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.2121,
  "FRS_Long": -93.3418,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002723,
      "AltID": "Bulk Storage Tank",
      "FacilityID": 1000002080,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002958,
          "ProcessID": 1000002723,
          "ChemicalID": 77,
          "Quantity": 86000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000002829,
          "ProcessID": 1000002723,
          "NAICSCode": "32552",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000002080,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-04-01 00:00:00",
    "ERTrainingDate": "2008-12-11 00:00:00",
    "CoordinatingAgencyName": "Greene County LEPC",
    "CoordinatingAgencyPhone": "4178696040",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000002080,
      "SummaryText": "1.  Introduction\n\nThis Executive Summary briefly reviews the major elements of the Risk Management Plan of Springfield - 3M Company.  We take seriously our safety, health and environmental responsibilities to our employees and to the community.  As an operating unit of 3M, we share in a tradition of environmental, health and safety responsibility going back through much of the Company's history.  3M was an early pioneer in pollution prevention and created its environmental policy in 1975.  Since 1990, 3M has cut its worldwide volatile organic air emissions 95 percent.  Since 1975, 3M has prevented over 115 million pounds of water releases (based on aggregated data from the first year of each project).\n\n2. Accidental Release Prevention and Emergency Response Policies\n\nIt is our goal to prevent accidental releases of regulated and other materials through the proper design, installation, operation and maintenance of our manufacturing processes and the proper training of our employees.  If, despite our efforts, such a release should occur, our trained emergency response personnel are at hand to control the effects of the release until the local Fire Department and other emergency responders arrive.  We maintain an excellent working relationship with the emergency responders to ensure rapid and effective response. \n \n3.  The Stationary Source and The Regulated Substances Handled\n\nAt this location, we manufacture adhesive systems for use in a wide variety of products from aerosols to structural adhesives films.   We have one regulated substance at our facility in quantities regulated by EPA's Risk Management Program.  3M employees are trained and experienced in working with this substance and we contribute to safety by providing high quality manufacturing processes, equipment and maintenance. \n\nThe following regulated substance is used at Springfield - 3M Company:\n\nTDI (Toluene diisocyanate) is a chemical used in the production of urethanes.  \n\n4. Program to Prevent Accid"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000002080,
      "SummaryText": "ental Releases \n\nAt Springfield - 3M Company, we take great care to prevent accidents, including those not covered under the EPA's Risk Management Program.  Programs are in place to address accidental release prevention measures consistent with appropriate federal, state, and local requirements.  Beyond government requirements, we have 3M internal standards for continuously improving safety at our facility.  \n\nReflecting the low risk and the five year accident history showing no accidental releases, our facility meets the EPA criteria for program 1.\n\n5. Five-year Accident History\n \nAt Springfield - 3M Company, no level of accident is acceptable.  We work continually to reduce the number and severity of accidents at our operations. In the five years preceding submittal of this plan, there were no accidental releases with on-site or off-site consequences meeting EPA criteria for inclusion in this plan.\n\n6. Emergency Response Plan\n\n3M's first line of defense against accidents is prevention.   At Springfield 3M, we also work to ensure that we are prepared for any accident that might happen. We maintain a written emergency response plan that includes arrangements for immediate response from employees, notification of local emergency response agencies and the public, first aid and medical treatment, evacuations, and post-incident decontamination of affected areas.   We conduct regular drills and work with the Springfield Fire Department to ensure the proper execution of our plan.  Our emergency response plan is updated to reflect any pertinent changes that would require a modified emergency response. \n\n7. Planned Changes to Improve Safety\n\nThe Springfield - 3M plant develops an annual Environmental, Health, and Safety Plan (EHS Plan) utilizing sources of data such as Injury and Illness Records, Incident Investigation Reports and Incident Rates, Operational Improvement and Safety Suggestions, Safety Tours, Audit findings, and Self Assessments.\n\nA yearly analysis is conduct"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000002080,
      "SummaryText": "ed to prioritize issues extracted from the data sources. Action items are then developed, including target completion dates and assignments to individuals and teams. The resulting EHS Plan is approved by 3M Springfield and Corporate management teams.\n"
    }
  ]
}