{
  "FacilityID": 1000102240,
  "FacilityName": "Lear Corporation",
  "FacilityStr1": "6 Meadowcraft Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Selma",
  "FacilityState": "AL",
  "FacilityZipCode": "36701",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01047",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.332122",
  "FacilityLongDecDegs": "-86.989622",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "LF",
  "FacilityURL": "www.lear.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 175592476,
  "ParentCompanyName": "Lear Corporation",
  "Company2Name": null,
  "CompanyDUNS": 175592476,
  "Company2DUNS": null,
  "OperatorName": "Lear Corporation",
  "OperatorStr1": "21557 Telegraph Road",
  "OperatorStr2": null,
  "OperatorCity": "Southfield",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48033",
  "OperatorZipCodeExt": null,
  "FTE": 97,
  "OtherEPAFacilityID": "36701RNSLS6MEAD",
  "EPAFacilityID": "100000200016",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-11-03 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Selma, Alabama",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-08-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-08-31 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-08-31 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-08-31 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 32.3307,
  "FRS_Long": -86.99278,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000126954,
      "AltID": "TDI Seating Line",
      "FacilityID": 1000102240,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000158869,
          "ProcessID": 1000126954,
          "ChemicalID": 20,
          "Quantity": 48864.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000158870,
          "ProcessID": 1000126954,
          "ChemicalID": 44,
          "Quantity": 195456.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000128344,
          "ProcessID": 1000126954,
          "NAICSCode": "33636",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000102240,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-07-03 00:00:00",
    "ERTrainingDate": "2021-10-11 00:00:00",
    "CoordinatingAgencyName": "Dallas County LEPC",
    "CoordinatingAgencyPhone": "3348742515",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000102240,
      "SummaryText": "RISK MANAGEMENT PLAN -  EXECUTIVE SUMMARY\n\nLEAR CORPORATION\n6 MEADOWCRAFT PARKWAY\nSELMA, ALABAMA\n\n\nAccidental Release Prevention and Emergency Response Policies at the Facility\n\nLear Corporation endeavors in all its activities to promote a quality environment. Lear Corporation recognizes that our activities may impact our employees and the surrounding community. Because of this, Lear Corporation is dedicated to environmental protection, employee health and safety, regulatory compliance and pollution prevention through a strategy of continual improvement and teamwork.\n\nLear Corporation, Selma, Alabama plant is ISO-14001 certified.  ISO 14001 is an internationally recognized environmental standard. The ISO-14001 management system provides the structure for continuing to examine and improve our environmental impact. Through these and other initiatives, Lear Corporation has implemented a system that holds each employee accountable for the safety and environmental performance of the company.\n\n\nStationary Source and the Regulated Substances Handled\n\nThe Selma, Alabama facility produces polyurethane seating, headrest, armrest and console cushions for the automotive industry. Two types of foam lines are utilized at the facility: an MDI line (Methylene diphenyl diisocyanate) and a TDI line (toluene diisocyanate). The other major chemical component to the product is polyol.  Only the TDI process is subject to the RMP requirement. TDI is the key component of the foaming line.  TDI, a mixture of toluene-2,4-diisocyanate and toluene-2,6-diisocyanate is received at the plant via  railcar or  tanker truck, and is stored in two storage tanks located inside the building. The TDI storage tank area is completely segregated from the rest of the building and has a concrete containment to collect and contain TDI in case of a spill.   Both storage tanks have a maximum capacity of 12,000 gallons each for an onsite maximum capacity of 24,000 gallons. From the indoor storage tanks, TDI is tr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000102240,
      "SummaryText": "ansferred via hard plumbed lines to smaller retaining tanks for daily use.\n\nThe TDI foaming line consists of a multi-station race track design line with each station containing one bench seat or two bucket seat molds. At the first station, the foam (mixture of TDI and polyol) is mechanically poured into the mold. The lid to the mold is then immediately closed and clamped shut. The foam is cured as it rotates through the various stations. The lid is then opened and the foam seat is removed. The mold is vacuumed clean and a wax release agent is applied to the mold so that it can be used again.\n\nThe \"covered process\" (TDI) starts at the unloading area and ends at the robot head of the pouring station, where TDI and polyol mixture is mechanically poured into molds. The mixing of TDI and polyol occurs within the robotic head.\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe facility complies with all applicable federal and state codes and regulations. The facility conducts safety meetings and safety training periodically. The process safety management at the facility for the TDI-related activities and equipment represents one of the facility's main active commitments to an accidental release prevention program. \nThe Lear Corporation, Alabama Plant complies with a variety of environmental and safety programs including waste management, storm water pollution prevention, spill prevention, community right-to-know programs (EPCRA), hazardous materials management, and emergency response. \n\nThe TDI is stored indoors within a concrete containment system constructed in an integral fashion with the building. Strict procedures are followed when materials are unloaded including the requirement that a person observes the unloading of the delivery tanker truck or rail car.\n\nFixed air monitoring equipment is installed within the building to provide an early warning of any TDI release. These monitors are inspected and tested on a regular basis"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000102240,
      "SummaryText": "to ensure their accuracy and functioning ability. The principle of detection is based on a chemical reaction caused by the presence of TDI on a chemically impregnated paper tape. A sample of plant air is drawn through the tape by a pump. When TDI is present in the sample, it causes a stain to form on the paper tape. The intensity of the stain is proportional to the concentration of TDI in the sample. A photo diode monitors the stain intensity as a chemical reaction occurs on the paper. If the intensity of the stain is above a pre-set level, the alarm relays are initiated and an indication is shown on the LCD display. The display shows flashing bells to indicate that the instrument is in alarm mode. Employees are immediately evacuated to a safe and designated gathering area outside the building. The alarm condition persists until a reading below the alarm set point is reached. No employee is allowed back into the area until a reading of below the set alarm is reached (5 ppb is the alarm level).\n\n\nFive-Year Accident History\n\nThere have been no accidents involving TDI in the last five years.\n\n\nEmergency Response Program\n\nThe Emergency Response Program is focused on the internal HAZWOPER trained team to handle accidental spills of TDI. Release events that are too large to be handled by the internal team are to be handled by the local emergency responders.  Lear Corporation has made a significant effort to communicate the elements of its response program with local emergency responders. Members of the local fire department and Local Emergency Planning Commission have visited the facility. Facility personnel involved with the TDI process receive regular training on pollution prevention and emergency response. This training includes participating in an emergency drill which is documented. Alert systems are also in place at the facility. As previously described the facility is equipped with TDI air monitoring devices to provide early warning of a TDI release.\n\n\nPlanned Chan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000102240,
      "SummaryText": "ges to Improve Safety\n\nLear Corporation continues to review its programs and procedures and make improvements where necessary. At this time, no significant improvement needs have been identified."
    }
  ]
}