{
  "FacilityID": 1000048965,
  "FacilityName": "City of Avenal Water Treatment Plant",
  "FacilityStr1": "33115 Avenal Cutoff Road",
  "FacilityStr2": null,
  "FacilityCity": "Avenal",
  "FacilityState": "CA",
  "FacilityZipCode": "93204",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06031",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.094171",
  "FacilityLongDecDegs": "-120.059771",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 39080528,
  "Company2DUNS": 0,
  "OperatorName": "City of Avenal",
  "OperatorStr1": "919 Skyline Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Avenal",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93204",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ronald Brumley",
  "RMPTitle": "Utilities Supervisor",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000150365",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-07-21 00:00:00",
  "SafetyInspectionBy": "Kings County CUPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-03-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-03-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-03-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.07275,
  "FRS_Long": -120.09909,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000061401,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 1000048965,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000062584,
          "ProcessID": 1000061401,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000075306,
          "ProcessID": 1000061401,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000575306,
          "ProcessID": 1000061401,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048965,
      "SummaryText": "RISK MANAGEMENT PLAN 2015\n\n\n\nEXECUTIVE SUMMARY AND DATA ELEMENTS PACKAGE\n\n\n\nCITY OF AVENAL WATER TREATMENT PLANT\n\n33115 AVENAL CUTOFF ROAD\n\nAVENAL, CALIFORNIA 93204\n\n\n\n1.0    Background Data\n\n\n\nIn accordance with Title 40 of the Code of Federal Regulations, Chapter 68 (40 CFR 68), promulgated by the Environmental Protection Agency (EPA) and Article 2, Chapter 6.95 of the California Health and Safety Code (HSC), the City of Avenal (Avenal) submits this Risk Management Plan (RMP) for operations at their Water Treatment Plant (WTP) in Avenal, California.  Avenal provides potable water to their service area, the City of Avenal.\n\n\n\n\n\n\n\n\n\n2.0    Accidental Release Prevention and Emergency Response Policy\n\n\n\nAvenal is committed to protecting the health and safety of its employees, the surrounding community, and the environment; therefore, it is Avenal's policy to manage a safe and healthy workplace, protect the environment and maintain compliance with safety, health, and environmental regulations: Federal Risk Management Plan (RMP), 40 CFR 68; OSHA Process Safety Management (PSM), 29 CFR Part 1910.119; and California Accidental Release Prevention (CalARP) Program, 29 CCR, Title 19, Division 2, Chapter 4.5.  This commitment is demonstrated by the comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at the facility.  It is the policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n\n\n2.1    Stationary Sources and Regulated Substances\n\n\n\nAvenal is subject to the Federal Risk Management Plan (RMP) program because chlorine, a regulated substance, is present at the facility in amounts greater than 2,500 pounds.  Avenal is required to treat the water supply so that it meets or exceeds the drinking water quality standards of the California Department of Health Services (DHS).  Avenal uses chlorine to disinfect the wa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048965,
      "SummaryText": "ter.  Avenal's chlorine disinfection process consists of one-ton chlorine cylinders, chlorinators, and a piping system that is all under vacuum.  The process and storage cylinders can contain a maximum amount of 6,000 pounds of chlorine.\n\n\n\n\n\n2.2    Worst-Case and Alternative-Case Release Scenario\n\n\n\nThis section has been deleted to comply with 2004 regulatory updates to address homeland security.  Information regarding the Offsite Consequence Analysis (OCA) is located with the CalARP Program Manager at the City of Avenal, Water Treatment Plant.\n\n\n\n\n\n\n\n\n\n3.0    Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nThe facility has taken all the necessary steps to comply with the accidental release prevention program requirements set out under 40 CFR Part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at the stationary source.\n\n\n\n\n\n3.1    Process Safety Information\n\nAvenal Water Treatment Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\n\n\n3.2    Process Hazard Analysis\n\n\n\nAvenal has conducted comprehensive studies to ensure that hazards associated with the process are identified and controlled efficiently.  The methodology used to carry out these analyses is a what-if/checklist.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA Revalidation was performed on February 18, 2015.\n\n\n\n\n\n3.3    Operating Procedures\n\nFor the purposes of safely conducting activities within the covered process, Avenal Water Treatment Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily access"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048965,
      "SummaryText": "ible to operators involved in the processes.  Operating Procedures were recently reviewed.\n\n\n\n\n\n3.4    Training\n\n\n\nAvenal Water Treatment Plant has a training program in place to ensure that employees who are operating the processes are competent in the operating procedures associated with these processes.  Refresher training is provided regularly as needed.  \n\n\n\n\n\n3.5    Mechanical Integrity\n\n\n\nAvenal Water Treatment Plant carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others: one-ton chlorine cylinders, piping systems, relief and ventilation systems, leak detectors, and controls.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  Mechanical Integrity checks are conducted during chlorine change-out and one-ton chlorine delivery.\n\n\n\n\n\n3.6    Management of Change\n\n\n\nWritten procedures are in place at Avenal Water Treatment Plant to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel, and any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\n\n\n3.7    Pre-startup Reviews\n\n\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Avenal Water Treatment Plant.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n \n\n\n\n3.8    Compliance Audits\n\n\n\nAvenal Water Treatment Plant conducts audits every three years to ensure a safe and secure working place for the emplo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048965,
      "SummaryText": "yees.  Any corrective actions required as a result of the triennial audits are undertaken in a safe and prompt manner.\n\n\n\n3.9    Incident Investigation\n\n\n\nAvenal Water Treatment Plant promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\n\n\n3.10    Employee Participation\n\n\n\nAvenal Water Treatment Plant truly believes that process safety management and accident prevention is a team effort.  Agency employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, the employees have access to all information created as part of the facility's implementation of the regulations, including information resulting from process hazard analyses.\n\n\n\n\n\n3.11    Contractors\n\n\n\nOn occasion, Avenal hires contractors to conduct specialized maintenance and construction activities.  Avenal Water Treatment Plant has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n\n\n3.12    Five-year Accident History\n\n\n\nAvenal Water Treatment Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to Avenal's stringent release prevention policies, there has been no accidental release during this period that caused any onsite death, injury or significant property damage, or known offsite death, injury, property damage, environmental damage, evacuations, or sheltering in place.\n\n \n\n\n\n3.13    Emergency Response Plan\n\n\n\nAvenal Water Treatment Plant carries a written emergency response plan to deal with accid"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048965,
      "SummaryText": "ental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  To ensure a high level of safety, the emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within the processes that would require a modified emergency response.  \n\n\n\n\n\n\n\n\n\n4.0    Planned Changes to Improve Safety \n\n\n\nThe City of Avenal is taking additional steps to increase public safety.  In preparation for this submittal, City of Avenal conducted a revalidation of the Process Hazard Analysis and Seismic Review of the system and associated structures.\n\n\n\n\n\n\n\n"
    }
  ]
}