{
  "FacilityID": 1000030141,
  "FacilityName": "Formosa Plastics Corp., LA",
  "FacilityStr1": "End of GSU Road",
  "FacilityStr2": null,
  "FacilityCity": "Baton Rouge",
  "FacilityState": "LA",
  "FacilityZipCode": "70805",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22033",
  "LEPC": "East Baton Rouge LEPC",
  "FacilityLatDecDegs": "30.501722",
  "FacilityLongDecDegs": "-091.185944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 106238108,
  "ParentCompanyName": "Formosa Plastics Corp., USA",
  "Company2Name": null,
  "CompanyDUNS": 39944004,
  "Company2DUNS": 0,
  "OperatorName": "Formosa Plastics Corp., LA",
  "OperatorStr1": "PO Box 271",
  "OperatorStr2": null,
  "OperatorCity": "Baton Rouge",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70821",
  "OperatorZipCodeExt": "0271",
  "RMPContact": "Kelly B. Serio",
  "RMPTitle": "Vice President/Plant Manager",
  "FTE": 219,
  "OtherEPAFacilityID": "70805FRMSPGULFS",
  "EPAFacilityID": "100000132812",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1004-V1",
  "SafetyInspectionDate": "2009-03-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-08-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-08-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-08-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-08-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.4982,
  "FRS_Long": -91.18915,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "8.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036769,
      "AltID": "VCM",
      "FacilityID": 1000030141,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000037152,
          "ProcessID": 1000036769,
          "NAICSCode": "32511",
          "_desc": {
            "NAICS_CODE": "32511",
            "NAICS_DESCRIPTION": "Petrochemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000044394,
          "ProcessID": 1000036769,
          "ChemicalID": 101,
          "Quantity": 17000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 101,
            "ChemicalName": "Vinyl chloride  [Ethene, chloro-]",
            "CASNumber": "75-01-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000044395,
          "ProcessID": 1000036769,
          "ChemicalID": 54,
          "Quantity": 530000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000044396,
          "ProcessID": 1000036769,
          "ChemicalID": 129,
          "Quantity": 92000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000044397,
          "ProcessID": 1000036769,
          "ChemicalID": 62,
          "Quantity": 560000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000044448,
          "ProcessID": 1000036769,
          "ChemicalID": 4,
          "Quantity": 53000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 4,
            "ChemicalName": "Chloroform  [Methane, trichloro-]",
            "CASNumber": "67-66-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544394,
          "ProcessID": 1000036769,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544395,
          "ProcessID": 1000036769,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544396,
          "ProcessID": 1000036769,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544397,
          "ProcessID": 1000036769,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544448,
          "ProcessID": 1000036769,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000036770,
      "AltID": "PVC",
      "FacilityID": 1000030141,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000037153,
          "ProcessID": 1000036770,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000044398,
          "ProcessID": 1000036770,
          "ChemicalID": 101,
          "Quantity": 2400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 101,
            "ChemicalName": "Vinyl chloride  [Ethene, chloro-]",
            "CASNumber": "75-01-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544398,
          "ProcessID": 1000036770,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000030141,
      "SummaryText": "Facility Description:\n\n\n\nFormosa Plastics, LA is a producer of basic industrial chemicals and materials. Chlorine, ethylene dichloride, anhydrous hydrogen chloride, and vinyl chloride are the major materials used and/or produced at the facility. The primary commodity produced at the facility is polyvinyl chloride resin. Polyvinyl chloride is used to manufacture food wrap, children's toys,medical devices, garden hoses, piping, vinyl siding, floor tiles, roofing shingles, electrical wiring insulation, furniture, clothing articles, automotive parts, etc. The facility is certified to ISO international quality and environmental management standards and employs approximately 219 employees and approximately 89 full-time contractors.\n\n\n\nThe Baton Rouge plant consists of three operating units; two of which are covered under the Risk Management regulation. These are Polyvinyl Chloride (PVC) and Vinyl Chloride Monomer (VCM). A description of the covered processes is included in this summary.\n\n\n\nRMP-Covered Materials:\n\n\n\nThe facility has five RMP-covered materials on site exceeding the RMP-specified regulatory threshold quantities. These materials are chlorine, anhydrous hydrogen chloride, vinyl chloride, propylene, and chloroform.\n\n\n\nChlorine is a greenish-yellow gas; it's heavier than air; it has the strong odor of household bleach; it is corrosive. Chlorine is used as a drinking water disinfectant; making household bleach; making plastics and other chemicals. Formosa uses this material in the manufacture of vinyl chloride.\n\n\n\nVinyl Chloride monomer is a colorless gas; it is heavier than air; it has a sweet odor; it is flammable. Formosa manufactures and uses this material in the production of polyvinyl chloride.\n\n\n\nAnhydrous Hydrogen Chloride is a colorless gas; it is heavier than air; it has an irritating, pungent odor; it is corrosive. It is used in food processing and brewing operations, metal treatment for electroplating, rubber manufacture, metal ore extraction and redu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000030141,
      "SummaryText": "ction, leather manufacture, plastic and resin production, etc. Formosa produces this material, maintained as a pressurized liquid, in the vinyl chloride manufacturing process.\n\n\n\nPropylene is a colorless gas; it is heavier than air; it is flammable; it is virtually odorless. Propylene is used as a non-CFC refrigerant and in the manufacture of plastics, antifreezes, and food additives. Formosa uses this material as a refrigerant.\n\n\n\nChloroform is produced as a byproduct/impurity in the VCM manufacturing process.\n\n\n\nAccidental Release Prevention Policy:\n\n\n\nThe facility's commitment to the safety of its employees, the community and the environment is exemplified by their EHS policy statement. The facility recognizes that it operates under privilege and acknowledges that protection and safety of the environment, community, and our employees is integral to its continued success as an organization. As such, a holistic approach consisting of sound design, engineering and administrative measures is utilized in preventing accidental releases.\n\n\n\nAccidental Release Prevention Programs and Measures:\n\n\n\nIn the prevention of accidental releases, the facility employs numerous engineering and administrative controls to ensure the chance of a hazardous material release is minimized. Engineering controls utilized include, but are not limited to, conservative process design safety factors, check valves that limit/prevent releases in the event of reverse excess flow, pressure and level alarms on primary storage vessels, redundant level detection for overfill protection, relief valves to prevent vessel overpressurization, insulated vessels to prevent solar overpressurization, shut-down systems, automatic/manual valves to isolate/limit releases, and redundant mechanical seals to prevent leaks.\n\n\n\nAdministrative controls utilized include certification to ISO international quality and environmental management standards, Process Safety Management programs, Safety Permitting programs, Hot W"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000030141,
      "SummaryText": "ork Procedures, Hazardous Energy Control programs, regular equipment inspections and maintenance, Preventive Maintenance programs, Standard Operating and Troubleshooting procedures, training programs, standards for overfill protection, VOC emissions monitoring program, etc.\n\n\n\nEmergency Response Policy:\n\n\n\nIt is the policy of the facility to prevent, minimize, control, and mitigate accidental releases. The facility recognizes that quick response to an incident is instrumental in assuring protection of the environment, community, and employees. To assist with this, the facility utilizes numerous engineering and administrative controls for early detection, communication, and response to incidents.\n\n\n\nEmergency Response Programs and Measures:\n\n\n\nThe facility employs numerous engineering and administrative controls to ensure the chance of a hazardous material release is minimized. Engineering controls which aid in the identification and/or communication of such incidents including atmospheric leak detection systems, portable hand-held atmospheric detection equipment, facility alarm and siren systems, public address systems, and portable hand-held two way radios.\n\n\n\nAdministrative controls include an Emergency Response plan, Spill Prevention plan, Emergency Notification procedures, and Emergency Shutdown procedures. An exercise testing the response plan and the communication procedures is conducted annually and a critique is held following the event.\n\n\n\nThe site has an emergency response team which consists of employees who have been trained in the areas of fire fighting, hazardous materials response, rescue, and injury treatment. Larger emergency response activities are coordinated under the Shift Safety Coordinator.\n\n\n\nEmergency preplanning and response coordination with external agencies and responders is accomplished via membership and/or participation in organizations such as the Baton Rouge Area Mutual Aid Society and the North Baton Rouge Chemical Industry Task Fo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000030141,
      "SummaryText": "rce.\n\n\n\nThe facility is part of an emergency hotline network, through which a system is in place to notify our immediate industrial neighbors and emergency response agencies with a single notification. Upon notification, the agencies can activate the community alert systems as necessary. The systems are tested on a regular basis.\n\n\n\nFixed fire suppression systems consisting of fire water pumps, fire hydrants and hydrant/monitor assemblies, water deluge systems, and foam blanket systems on specific storage vessels help protect the facility in the event of fire. Additionally, there are fire hose houses which contain fire hose, fire water nozzles, and various wrenches and adapters that provide mobile fire fighting capability. The site also has a fire truck and foam trailer which can be utilized by the emergency response team members. Additional fire water capacity can be accessed through a neighboring industry's fire water system as needed and/or required.\n\n\n\nFor hazardous materials incidents, a supply of emergency equipment is kept on-hand, including protective clothing, fresh air systems, capping kits, absorbent pads, leak dams, etc. For incidents requiring external assistance, manpower is provided by the Baton Rouge Fire Department. The facility can also use the services of contract leak mitigation services as required.\n\n\n\nFive Year Accident History:\n\n\n\nThe facility has had no releases in the last 5 years which require RMP reporting within the criteria specified by the Risk Management rule.\n\n\n\nPlanned Changes to Improve Safety:\n\n\n\nThe facility operates under a credo of continuous improvement and planned changes include such things as program enhancements, procedural evaluations, and other items as identified through various internal mechanisms, as warranted.\n\n\n\nFacility RMP-Covered Process Unit Descriptions:\n\n\n\nVinyl Chloride Monomer (VCM) Unit Process Description\n\n\n\nThe VCM Unit produces VCM from 1,2-dichloroethane (EDC) and chlorine. EDC is fed to furnaces where i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000030141,
      "SummaryText": "t is converted to VCM and hydrochloric acid (HCI). A series of columns, heat exchangers, and vessels, interconnected by piping and ancillary transfer equipment, are used to purify the VCM to required specifications for use as a produced feedstock. Several by-products, such as HCl and unreacted EDC, are recycled for reuse in the process, with a small portion of the HCL being diverted for sale as a commodity. Product VCM is stored for subsequent transfer to the PVC Unit or may otherwise be shipped via rail cars. Feedstocks and finished products are stored in fixed roof tanks and spheres. Raw materials may be received via barge, truck, and rail. Rail cars and tank trucks are used to deliver finished products to customers from the facility. Fugitive emissions from piping components and transfer equipment in the VCM Unit, as well as facility-wide wastewater emissions, are included as part of the process.\n\n\n\nThe VCM Unit also maintains necessary utilities equipment to aid in process operations, such as cooling towers and control and recovery devices. Incinerators at the FPC Baton Rouge Facility receive vent streams from reactors, columns, and tanks as well as vents from decontamination of equipment in the VCM Unit and other parts of the facility. As part of the incinerator systems, there are also hydrochloric acid (HCI) absorber towers and caustic scrubber columns used to recover and remove HCI and chlorine.\n\n\n\nPolyvinyl Chloride (PVC) Unit Process Description\n\n\n\nThe PVC Unit produces PVC using suspension polymerization. The plant currently produces more than six grades of suspension PVC and is able to manufacture up to three grades simultaneously.\n\n\n\nPolymerization occurs in batch reactors to convert the VCM charged in each batch to PVC in a water slurry. The unreacted VCM gas is recovered from the reactors for recycle. The PVC slurry is pumped to blowdown tanks, where additional unreacted VCM flashes overhead to be reclaimed by condensation. The blowdown tanks also serv"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000030141,
      "SummaryText": "e as holding tanks for continuous feed of the slurry stripping columns Residual VCM is steam stripped from the PVC slurry in slurry stripping columns. Residual VCM is recovered from the equipment upstream of and including the slurry stripper. Condensed VCM is recycled to the process. Noncondensable gases are routed to the VCM Unit Incinerators.\n\n\n\nThe stripped PVC slurry is then pumped through heat exchangers to dryer feed holding tanks and centrifuges, where the slurry is dewatered and the PVC wet cake is produced. Water is pumped to the biotreatment plant. PVC wet cake is dried in either cyclone or fluidized bed dryers. Air vented from the cyclone dryers is passed through a water scrubber and PVC resin is screened by sieves and pneumatically conveyed to storage silos for loading operations. Each silo vent is controlled with a bag or cartridge filter dust collector. Rail cars and trucks are used to deliver finished products to customers from the facility. Fugitive emissions from piping components and transfer equipment in the PVC Unit are included as part of the process.\n\n\n\nIn-process water from the PVC Unit is transported to a storage tank and is then steam stripped in the wastewater stripping columns. The stripped water is sent to the biotreatment plant to treat any remaining organic compounds. The PVC Unit also maintains necessary utilities equipment to aid in process operations, such as cooling towers.\n\n"
    }
  ]
}