{
  "FacilityID": 1000115313,
  "FacilityName": "Cold-Link Logistics Hattiesburg",
  "FacilityStr1": "609 Dacetown Road",
  "FacilityStr2": null,
  "FacilityCity": "Ellisville",
  "FacilityState": "MS",
  "FacilityZipCode": "39437",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28067",
  "LEPC": "Jones County LEPC",
  "FacilityLatDecDegs": "31.578996",
  "FacilityLongDecDegs": "-89.224472",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "https://cold-linklogistics.com/",
  "FacilityEmailAddress": "cllteam@coldlinklogistics.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Mandich Group Investments, LLC",
  "Company2Name": null,
  "CompanyDUNS": 10344056,
  "Company2DUNS": null,
  "OperatorName": "Cold-Link Logistics Hattiesburg",
  "OperatorStr1": "609 Dacetown Road",
  "OperatorStr2": null,
  "OperatorCity": "Ellisville",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39437",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000254431",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000143801,
      "AltID": "Refrigeration System",
      "FacilityID": 1000115313,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000179799,
          "ProcessID": 1000143801,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000145375,
          "ProcessID": 1000143801,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000122965,
              "Process_NAICS_ID": 1000145375,
              "SafetyReviewDate": "2024-06-07 00:00:00",
              "PHA_Date": "2024-04-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2025-04-18 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Emergency Pressure Control System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-04-18 00:00:00",
              "TrainingReviewDate": "2024-04-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-05-31 00:00:00",
              "EquipmentInspectionDate": "2024-05-09 00:00:00",
              "EquipmentTested": "Entire System Inspection",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2024-05-31 00:00:00",
              "PreStartupReviewDate": "2024-05-09 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2024-05-31 00:00:00",
              "HotWorkPermitReviewDate": "2024-05-31 00:00:00",
              "ContractorSafetyReviewDate": "2024-06-17 00:00:00",
              "ContractorSafetyEvalDate": "2024-05-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000154073,
                  "PreventionProgram3ID": 1000122965,
                  "ProcessChemicalID": 1000179799
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000115313,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Ellisville Fire Department",
    "CoordinatingAgencyPhone": "6014472120",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000115313,
      "SummaryText": "vities; and \n\u0095\tCold-Link Logistics Hattiesburg performs the annual notification exercises.\n\n5.2 Emergency Response Coordination Activities\nCold-Link Logistics Hattiesburg will complete emergency response coordination activities as follows:\n\u0095\tCoordination will occur at least annually, and more frequently if necessary, to address changes:\no\tAt Cold-Link Logistics Hattiesburg;\no\tIn Cold-Link Logistics Hattiesburg\u0092s emergency response and/or emergency action plan; and/or\no\tIn the community emergency response plan.\n\u0095\tCoordination will include providing to the local emergency planning and response organizations:\no\tCold-Link Logistics Hattiesburg\u0092s emergency response plan if one exists;\no\tEmergency action plan;\no\tUpdated emergency contact information; and\no\tOther information necessary for developing and implementing the local emergency response plan. \n\u0095\tCold-Link Logistics Hattiesburg will document coordination with local authorities, including:\no\tThe names of individuals involved and their contact information (phone number, email address, and organizational affiliations);\no\tDates of coordination activities; and \no\tNature of coordination activities.\n\u0095\tThe disclosure of information classified or restricted by the Department of Defense or other Federal agencies or contractors of such agencies is controlled by applicable laws, regulations, or executive orders concerning the release of that classified or restricted information.\n\n5.3 Emergency Response Program\nSince Cold-Link Logistics Hattiesburg has elected to be a non-responding stationary source, they need not develop a full emergency response program for the purpose of protecting public health and the environment.\n\n5.4 Emergency Response Exercises\n5.4.1 Notification Exercises\nAt least once each calendar year, Cold-Link Logistics Hattiesburg will conduct an exercise of the emergency response notification mechanisms as appropriate, before December 19, 2024, and annually thereafter. Cold-Link Logistics Hattiesburg will mainta"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000115313,
      "SummaryText": "ade Secrets\nEnsure any trade secrets (confidential business information) are legitimate and properly substantiated. Ensure trade secrets information does not prohibit personnel from developing and implementing the program.\n\n3.15 Emergency Response\nAs a non-responding facility, ensure Cold-Link Logistics Hattiesburg is included in the community emergency response plan, verify appropriate mechanisms are in place to notify emergency responders when there is a need for a response, document annual coordinations with local emergency planning and response organizations, and perform annual notification exercises.\n\n3.16 RMP Submit\t\nPrepare and certify (with or without the help of a consultant) an RMP Submit initially and every five (5) years. Ensure the RMP Submit is updated as necessary (e.g., within 6 months of an updated Hazard Assessment, PHA, or a change in program level). Submit a de-registration if Cold-Link Logistics Hattiesburg is no longer subject. Ensure the RMP Submit is corrected as necessary (e.g., within 6 months of new five-year accident history information or within one month of a change in the emergency contact information).\n\n4. Five-Year Accident History\nCold-Link Logistics Hattiesburg has no five-year accident history.\n\n5. Emergency Response Program \n5.1 Applicability\nCold-Link Logistics Hattiesburg will not respond to accidental releases of regulated substances (e.g., ammonia). Since Cold-Link Logistics Hattiesburg has elected to be a \u0093non-responding stationary source\u0094 a full emergency response program does not need to be developed. In lieu of being a responding stationary source, Cold-Link Logistics Hattiesburg will do the following:\n\u0095\tCold-Link Logistics Hattiesburg is included in the community emergency response plan developed under Title 42 U.S.C. §11003; \n\u0095\tAppropriate mechanisms are in place to notify emergency responders when there is a need for a response; \n\u0095\tCold-Link Logistics Hattiesburg performs the annual emergency response coordination acti"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000115313,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies at the Stationary Source\n1.1 Program Overview\nCold-Link Logistics Hattiesburg has developed and is implementing a consolidated program to meet the spirit and intent of the following regulations:\n\u0095\tTitle 40 CFR Part 68\u0097EPA\u0092s Risk Management Program\n\u0095\tTitle 29 CFR §1910.119\u0097OSHA\u0092s Process Safety Management Program\n\nThe Occupational Safety and Health Administration\u0092s (OSHA) process safety management (PSM) program has fourteen (14) major program elements. The Environmental Protection Agency\u0092s (EPA) risk management program (RMP) has the same major fourteen (14) program elements, but also has additional requirements for offsite consequence analyses and risk management plan submissions. Since the requirements in these two (2) regulations have substantial crossover, Cold-Link Logistics Hattiesburg has elected to develop and implement one (1) consolidated program to meet the requirements of both regulations. This consolidated program is referred to as the RMP/PSM program. \n\n1.2 Cold-Link Logistics Hattiesburg RMP/PSM Program Philosophy\nCold-Link Logistics Hattiesburg is not developing and implementing the RMP/PSM program to simply \u0093check a box\u0094 or avoid regulatory penalties. Rather, Cold-Link Logistics Hattiesburg is committed to promoting the overall safety and health of employees, contractors, and visitors onsite. Furthermore, Cold-Link Logistics Hattiesburg has a duty to protect people and the environment in the surrounding community. Cold-Link Logistics Hattiesburg management and employees understand that a properly developed and implemented RMP/PSM program will help avoid accidental releases of anhydrous ammonia. While Cold-Link Logistics Hattiesburg, works hard to serve their clients, nothing takes precedence over maintaining the safety of the ammonia refrigeration system.\n\n2. Stationary Source and Regulated Substances Handled\nCold-Link Logistics Hattiesburg is cold storage and freezer distribution center"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000115313,
      "SummaryText": "located in Ellisville, MS which is twenty (20) miles north of Hattiesburg. In order to keep product at the desired temperature, Cold-Link Logistics Hattiesburg utilizes an industrial closed-loop ammonia refrigeration system. This ammonia refrigeration system is considered one (1) covered process having an ammonia inventory of approximately 30,000 lbs. Appendix A to Title 29 CFR §1910.119 lists the threshold quantity of anhydrous ammonia (CAS #: 7664-41-7) as 10,000 lbs. Since the quantity of the Ammonia Refrigeration System exceeds this quantity, it is subject to OSHA\u0092s Process Safety Management standard found in Title 29 CFR §1910.119.\n\nThe list of substances provided in Title 40 CFR §68.130 also lists the threshold quantity of anhydrous ammonia (CAS #: 7664-41-7) as 10,000 lbs. Since the quantity of the Ammonia Refrigeration System exceeds this quantity, it is subject to EPA\u0092s Risk Management Program standard found in Title 40 CFR Part 68.\n\nFinally, the Program Level of the covered process needed to be determined. Since the worst-case release scenario for the Ammonia Refrigeration System would affect public receptors, it is not eligible for Program 1. Further, since the Ammonia Refrigeration System is subject to Title 29 CFR §1910.119 it is not eligible for Program 2. The result is that the Ammonia Refrigeration System is subject to Program 3 requirements.\n\n3. General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nWhile Cold-Link Logistics Hattiesburg has a thorough RMP/PSM policy, a description of the requirements associated with each program element are summarized in the sections below.\n\n3.1 Hazard Assessment\nCoordinate with a consultant to complete a Hazard Assessment initially, every five (5) years, and if a change necessitates it. Maintain Cold-Link Logistics Hattiesburg\u0092s five-year accident history in the event that an incident meets the stringent criteria.\n\n3.2 Process Safety Information\t\nEnsure all elements of Process Safety"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000115313,
      "SummaryText": "Information are developed, accurate, in alignment with recognized and generally accepted good engineering practice (RAGAGEP), accessible, and updated when a change occurs.\n\n3.3 Process Hazard Analysis\nEither lead or hire a consultant to lead a Process Hazard Analysis (PHA) initially, every five (5) years, and if a change necessitates it. Ensure the PHA scope, methodology, and team are sufficient and align with RAGAGEP. Ensure all PHA recommendations are addressed and resolution actions are documented. Ensure all PHA reports and recommendation resolutions and retained and accessible.\n\n3.4 Operating Procedures\nEither develop or hire a consultant to develop Operating Procedures (SOPs) which cover steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions. Make the SOPs accessible, keep them current, and certify them annually. Develop and implement safe work practices.\n\n3.5 Training\t\nEnsure all operators receive initial and refresher training at least every three (3) years on an overview of the process and the SOPs. Properly document training activities.\n\n3.6 Mechanical Integrity\nEnsure all equipment in the covered process is included in the Mechanical Integrity program. Establish or hire a consultant to establish written procedures. Ensure operators are trained for process maintenance activities. Ensure the procedures and frequency for inspections and testing align with RAGAGEP. Ensure inspections and tests are properly documented. Ensure equipment deficiencies which are outside acceptable limits are corrected before further use or in a safe and timely manner (when necessary means are taken to assure safe operation). In the construction of new plants and equipment, oversee quality assurance through checks and inspections and verifying proper materials of construction.\n\n3.7 Management of Change\t\nOversee the implementation of the Management of Change procedures for all changes except replacements in kind.\n\n3"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000115313,
      "SummaryText": ".8 Pre-Startup Safety Review\t\nOversee Pre-Startup Safety Review for new facilities and for modified facilities when the modification is significant enough to require a change in the Process Safety Information.\n\n3.9 Compliance Audit\nEither conduct or hire a consultant to conduct a Compliance Audit every three (3) years. Ensure at least one person knowledgeable in the process participates and that a written report is developed. Certify the Compliance Audit report. Ensure all Compliance Audit recommendations are addressed and resolution actions are documented. Retain the two (2) most recent Compliance Audit reports.\n\n3.10 Incident Investigation\nIn the event of an accidental release or near-miss, initiate an incident investigation within 48 hours and assemble an investigation team. Develop a written report and address all findings from the report. Review the report with affected personnel and retain the report for five (5) years. Make any necessary accidental release notifications as soon as possible (within the first 15 minutes if possible). If an accidental release has offsite impacts, hold a public meeting within 90 days.\n\n3.11 Employee Participation\t\nOversee this written employee participation plan and ensure employees participate in the PHA and have access to necessary PSM program documentation.\n\n3.12 Hot Work Permit\nEnsure hot work permits are issued and observed for all hot work performed on or near covered processes.\n\n3.13 Contractors\t\nOversee contractors who work on or adjacent to covered processes (excluding those providing incidental services). Obtain and evaluate each contractor\u0092s safety performance and programs. Inform contractors of known hazards onsite. Explain to contractors their responsibility under this program. Develop and implement safe work practices to control the entrance, presence, and exit of contractors to covered process areas. Periodically evaluate the performance of the contractor in fulfilling their obligations under this program.\n\n3.14 Tr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000115313,
      "SummaryText": "in a written record of each notification exercise conducted over the last five (5) years.\n\n5.4.2 Emergency Response Exercise Program\nSince Cold-Link Logistics Hattiesburg is a non-responding stationary source, they need not develop an emergency response exercise program with field and tabletop exercises.\n5.4.3 Alternative Means of Meeting Exercise Requirements\nCold-Link Logistics Hattiesburg may satisfy the requirement to conduct notification, field and/or tabletop exercises through: \n\u0095\tExercises conducted to meet other Federal, state or local exercise requirements, provided the exercise meets the requirements of the above bullet-point lists. \n\u0095\tResponse to an accidental release, provided the response includes the actions included in the bullet-point lists above, as appropriate. When used to meet field and/or tabletop exercise requirements, Cold-Link Logistics Hattiesburg will prepare an after-action report comparable to the exercise evaluation report, within 90 days of the incident.\n\n5.5 Emergency Planning and Response\nCold-Link Logistics Hattiesburg will establish and implement an emergency action plan for the entire plant in accordance with the provisions of Title 29 CFR §1910.38. In addition, the emergency action plan will include procedures for handling small releases. Cold-Link Logistics Hattiesburg may also be subject to the hazardous waste and emergency response provisions contained in Title 29 CFR §1910.120 (a), (p) and (q).\n\n6. Planned Changes to Improve Safety\nCold-Link Logistics Hattiesburg strives for and embraces a culture of openness to change\u0097especially as it relates to safety. Rather than seeking methods apart from the RMP/PSM program, Cold-Link Logistics Hattiesburg anticipates necessary changes becoming apparent as part of implementing the various elements and requirements of the process safety management and risk management program regulations. When a program activity is completed (e.g., process hazard analysis, compliance audit, mechanical integ"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000115313,
      "SummaryText": "rity inspection), there are normally corresponding recommendations to improve the safety of the ammonia refrigeration system. Cold-Link Logistics Hattiesburg takes the findings from these activities and tracks all of them to completion. In rare circumstances, the recommendation may not be resolved in the manner prescribed by the recommendation. In those instances, sufficient justification will be provided for the variance.\n\nIn addition to the structured method of routinely improving the safety of the ammonia refrigeration system, Cold-Link Logistics Hattiesburg is always open to suggestions from employees and contractors regarding methods of improving safety. In general, openness in communication is extremely valuable to Cold-Link Logistics Hattiesburg. By strategically and routinely working toward increased levels of safety, Cold-Link Logistics Hattiesburg strives to maintain the safest ammonia refrigeration system as possible."
    }
  ]
}