{
  "FacilityID": 1000011518,
  "FacilityName": "Tioga Gas Plant",
  "FacilityStr1": "10340 68th Street NW",
  "FacilityStr2": "PO Box 459",
  "FacilityCity": "Tioga",
  "FacilityState": "ND",
  "FacilityZipCode": "58852",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38105",
  "LEPC": "Williams County LEPC",
  "FacilityLatDecDegs": "48.400278",
  "FacilityLongDecDegs": "-102.917778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 80238470,
  "ParentCompanyName": "Hess Corporation",
  "Company2Name": null,
  "CompanyDUNS": 6979785,
  "Company2DUNS": 0,
  "OperatorName": "Hess Corporation",
  "OperatorStr1": "10340 68th Street NW",
  "OperatorStr2": "PO Box 459",
  "OperatorCity": "Tioga",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58852",
  "OperatorZipCodeExt": null,
  "FTE": 64,
  "OtherEPAFacilityID": "NDD986272060",
  "EPAFacilityID": "100000158991",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "T5-082002",
  "SafetyInspectionDate": "2008-04-22 00:00:00",
  "SafetyInspectionBy": "Department of Transportation",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-02-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-02-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-02-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-02-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 48.39806,
  "FRS_Long": -102.91639,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013770,
      "AltID": "Natural Gas Processing",
      "FacilityID": 1000011518,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015792,
          "ProcessID": 1000013770,
          "ChemicalID": 98,
          "Quantity": 5500000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000015793,
          "ProcessID": 1000013770,
          "ChemicalID": 118,
          "Quantity": 3350000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000015794,
          "ProcessID": 1000013770,
          "ChemicalID": 155,
          "Quantity": 70000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 97904,
              "ProcessChemicalID": 1000015794,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 97905,
              "ProcessChemicalID": 1000015794,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 97906,
              "ProcessChemicalID": 1000015794,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 97907,
              "ProcessChemicalID": 1000015794,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 97908,
              "ProcessChemicalID": 1000015794,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 97909,
              "ProcessChemicalID": 1000015794,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 97910,
              "ProcessChemicalID": 1000015794,
              "ChemicalID": 137
            }
          ]
        },
        {
          "ProcessChemicalID": 1000015795,
          "ProcessID": 1000013770,
          "ChemicalID": 155,
          "Quantity": 430.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 97911,
              "ProcessChemicalID": 1000015795,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 97912,
              "ProcessChemicalID": 1000015795,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 97913,
              "ProcessChemicalID": 1000015795,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 97914,
              "ProcessChemicalID": 1000015795,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 97915,
              "ProcessChemicalID": 1000015795,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 97916,
              "ProcessChemicalID": 1000015795,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 97917,
              "ProcessChemicalID": 1000015795,
              "ChemicalID": 115
            }
          ]
        },
        {
          "ProcessChemicalID": 1000015796,
          "ProcessID": 1000013770,
          "ChemicalID": 155,
          "Quantity": 144000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 97918,
              "ProcessChemicalID": 1000015796,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 97919,
              "ProcessChemicalID": 1000015796,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 97920,
              "ProcessChemicalID": 1000015796,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 97921,
              "ProcessChemicalID": 1000015796,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 97922,
              "ProcessChemicalID": 1000015796,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 97923,
              "ProcessChemicalID": 1000015796,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 97924,
              "ProcessChemicalID": 1000015796,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000014134,
          "ProcessID": 1000013770,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000011518,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2007-03-05 00:00:00",
    "ERTrainingDate": "2008-05-14 00:00:00",
    "CoordinatingAgencyName": "Tioga Fire Department",
    "CoordinatingAgencyPhone": "7016642200",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011518,
      "SummaryText": "Amerada Hess Corporation\nAmericas and West Africa E&P\n\nUnited States Environmental Protection Agency - Risk Management Program\n\nEXECUTIVE SUMMARY\n\nCERTIFICATION LETTER\n\nBased on the criteria in 40 CFR 68.10, the distance to the specified endpoint for the worst-case accidental release scenario for the following process is less than the distance to the nearest public receptor.  Tioga Gas Plant identified potential candidates for worst-case scenarios and utilized the services of the Baker Engineering and Risk Consultants, Inc. of San Antonio, Texas to perform consequence analyses using the commercially available DNV Technica PHAST professional version 5.01 dispersion program and the Baker-Strehlow-Tang (BST) methodology for determining the RMP designated 1-psi overpressure contour.  According to the analyses, the greatest maximum end point for a 1-psi vapor cloud explosion (VCE) is 820 feet from the center of the explosion, resulting from the instantaneous release of the inventory contained in the Butane storage bullet when filled to the greatest amount allowed (274,429 pounds).  This worst-case release would not affect any public or environmental receptor beyond property owned and occupied by Tioga Gas Plant. \n\n\nWithin the past five years, Tioga Gas Plant has had no accidental release that caused offsite impacts as defined by the Risk Management Program rule (40 CFR 68.10(b)(1).  No additional measures beyond those stated in the Planned Changes to Improve Safety section of the executive summary are necessary to prevent offsite impacts from accidental releases. In the event of fire, explosion, or a release of a regulated substance from the process, entry within the distance to the specified endpoints may pose a danger to public emergency responders.  Therefore, public emergency responders should not enter this area except as arranged with the emergency contact indicated in the RMP.  \n\nThe undersigned certifies that, to the best of my knowledge, information, and belief "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011518,
      "SummaryText": "formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\n\n                                                   Rory Nelson \n________________________________                           ________________________________\nSignature                                                                             \n\nPLANT MANAGER \n_______________________________________            _________________________________\nTitle                                                                                    Date \n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Tioga Gas Plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the investment of significant resources in accident prevention, such as personnel training, mechanical inspection, process control systems and by recognition of safety as a primary factor in the design, installation, operation and maintenance of our processes. However, if an accidental release does occur, trained plant personnel will respond to control and contain the release.\n\nTo prevent accidental releases, the Tioga Gas Plant achieves control of hazardous materials by:\nA? A commitment to OSHA's PSM and HAZWOPER standards, EPA's RMP, and the Department of Transportation's Hazardous Materials Transportation Act regulations which promote and require adherence to process safety activities designed to prevent accidental releases.\nA? Development and use of Hess Corporation and Tioga Gas Plant safety, operating, maintenance, emergency response, engineering design and construction policies, procedures and practices designed to prevent accidents and potential releases.\nA? Knowledge of and adherence to applicable industry recognized standards, specifications and recommended practices that address and provide guidance for the proper design, construction and operation of facilities containing hazardous materials.\nA? A comprehensive equipment inspection and testing program.\n\n\n\n\n\nDESCRIPTION OF THE "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011518,
      "SummaryText": "STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Tioga Gas Plant, located at 10340 68th Street NW, Williams County, North Dakota processes raw natural gas from area oil/gas wells to produce Propane, Butane, Natural Gasoline, Sulfur, and clean Natural Gas for industrial and residential use.  The plant has several regulated flammables, such as Methane, Ethane, Propane, Butane, and Natural Gas Condensate.  In addition, the plant produces and contains as by-products of processing, Hydrogen Sulfide (H2S) and Sulfur Dioxide (SO2) at levels below the listed RMP threshold quantities.\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nProcesses at the plant that are regulated by the Environmental Protection Agency's (EPA's) Risk Management Program (RMP) regulation are also subject to the Occupational Safety & Health Administration's (OSHA's) Process Safety Management (PSM) standard. The Tioga Gas Plant adheres to all applicable federal and state regulatory statutes.    \n\n\n\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nWithin the past five years, the Tioga Gas Plant has had no accidental release that caused off site impacts as defined by the Risk Management Program rule (40 CFR 68.10(b)(1).  Within the past 5 years the plant has not experienced an incident involving regulated flammables that caused deaths, injuries, property or environmental damage, evacuations or sheltering in place.\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Tioga Gas Plant maintains a written emergency response program, which is designed to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is involved.  The procedure addresses emergency response, proper first aid and medical treatment, evacuation plans, accounting for personnel, notification of local emergency response agencies and the public. In addition, the plant has procedures that address maint"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011518,
      "SummaryText": "enance, inspection and testing and instructions in the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to gas plant processes or other plant facilities.  \n\n\nWORST CASE RELEASE SCENARIO\n\nThe Tioga Gas Plant identified potential candidates for worst case scenarios and utilized the services of the Baker Engineering and Risk Consultants, Inc. of San Antonio, Texas to perform consequence analyses using the commercially available DNV Technica PHAST professional version 5.01 dispersion program and the Baker-Strehlow-Tang (BST) methodology for determining the RMP designated 1 psi overpressure contour.  According to the analyses, the greatest maximum end point for a 1-psi vapor cloud explosion (VCE) is 820 feet from the center of the explosion, resulting from the instantaneous release of the inventory contained in the Butane storage bullet when filled to the greatest amount allowed (274,429 pounds). This worst-case release would not affect any public or environmental receptor beyond property owned and occupied by Tioga Gas Plant.  \n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Tioga Gas Plant conducts ongoing efforts to reduce risk through the Risk Management Program and Process Safety Management. These include recommendations from process hazards analyses, employee suggestions, and recommendations from incident investigations, recommendations from compliance audits and review of the preventative maintenance and mechanical integrity program information."
    }
  ]
}