{
  "FacilityID": 1000052577,
  "FacilityName": "Titan Cold Storage, Inc. Bakersfield",
  "FacilityStr1": "6001 Snow Road",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93308",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.424536",
  "FacilityLongDecDegs": "-119.066396",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Titan Cold Storage, Inc.",
  "OperatorStr1": "6001 Snow Road",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93308",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carel Els",
  "RMPTitle": "Vice President",
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000061354",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-03-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-10-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-10-09 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-10-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-10-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.42666,
  "FRS_Long": -119.07518,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000066245,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000052577,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000067407,
          "ProcessID": 1000066245,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000081972,
          "ProcessID": 1000066245,
          "ChemicalID": 56,
          "Quantity": 49000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000581972,
          "ProcessID": 1000066245,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000052577,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n    Titan Cold Storage uses anhydrous ammonia to maintain a cold environment per our client's needs.  As such, we recognize our responsibility to ensure the refrigeration system is run safely for the protection of our employees, our neighbors, and the environment.  To this end, we have conducted several in-depth studies (including Process Hazard Analyses and Compliance Audits) to assure we are both in compliance with regulations and operating as safely and efficiently as possible.  \n\n    All refrigeration system operators are fully trained in their duties prior to assignment to prevent accidental releases or incidents that could cause a release.  In addition, all facility employees have been trained per our emergency response program should an emergency situation arise.\n\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\n    The facility at Titan Cold Storage was constructed in 1970 and has undergone a few modifications to make it more efficient.  The most recent modification was performed in 2000.  The system consists of: a high pressure receiver (capable of holding 60,200# of ammonia); three evaporative condensers; five compressors; a glycol chiller; refrigeration coils; and numerous recirculation accumulators and evaporators (In individual cold rooms). The system is charged with 48,830# of anhydrous ammonia, our only regulated substance.\n\n\n\nTitan Cold Storage operates a commercial cold storage for a variety of fruit and vegetables in Bakersfield, CA. The facility has an ammonia refrigeration system that provides refrigeration capacity to the following:\n\n\n\n(6) Rooms\n\n(8) Precools\n\n(1) Glycol Chiller\n\n\n\nThe refrigerated spaces are equipped with air-cooling evaporators and accumulators as required for flooded operation.\n\n\n\nThe control valve groups are located either inside the bunker or outside the room in the hallway. The refrigeration machinery is contained within or directly adjacent to the machi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000052577,
      "SummaryText": "nery room. A partial list of system components includes:\n\n\n\nMachinery Room\n\n(1) Reciprocating compressor\n\n(4) Screw compressors\n\n(3) Oil separators\n\n(1) Liquid transfer vessel\n\n(1) Main suction accumulator\n\n(1) Auto purger\n\n\n\nOld Boiler Room\n\n(1) Oil separator\n\n(1) Oil Pot\n\n\n\nCondenser Area\n\n(3) Evaporative condensers\n\n(1) Liquid transfer vessel\n\n(1) High pressure receiver\n\n\n\nChiller Area\n\n(1) Accumulator\n\n(1) Shell and tube heat exchanger\n\n(1) Oil pot\n\n\n\nRoom 15\n\n(2) Accumulators\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 16\n\n(2) Accumulators\n\n(5) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 18 (Precool)\n\n(1) Accumulator\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 19 (Precool)\n\n(1) Accumulator\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 20 (Precool)\n\n(1) Accumulator\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 21 (Precool)\n\n(1) Accumulator\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 24 (Precool)\n\n(1) Accumulator\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 25 (Precool)\n\n(1) Accumulator\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 26 (Precool)\n\n(1) Accumulator\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 27 (Precool)\n\n(1) Accumulator\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 29\n\n(3) Accumulators\n\n(6) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 33\n\n(2) Accumulators\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 34\n\n(3) Accumulators\n\n(6) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nRoom 38\n\n(2) Accumulators\n\n(4) Air-cooling evaporators (bunker-mounted, plate fin)\n\n\n\nThe flooded system operates as follows: high pressure liquid from the high pressure receiver is piped to each cold room, where it passes through an expansion valve into low temperature and pressure accumulator mounted behind the bunker wall. From the accumulators,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000052577,
      "SummaryText": " low pressure liquid is circulated through evaporator coils. As heat is absorbed, the liquid ammonia vaporizes to form low temperature and pressure gas which is returned to the accumulator vessels. The suction gas is returned from the accumulators through a suction return line to the main suction accumulator.  From the main suction accumulator, ammonia is piped to the suction inlet on the compressors. The high pressure discharge from the compressors is sent to water-cooled evaporative condensers where the high pressure gas ammonia is cooled, liquefied and returned to the high pressure receiver.\n\n\n\nThe system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and pressure relief valves which vent to the atmosphere if the pressure in the system exceeds their set point. \n\n\n\nThere are two ammonia detectors installed inside the refrigeration machinery room. One sensor is set at the California OSHA permissible exposure limit of 25 ppm and the other is set at 50 ppm. Both sensors will activate the mechanical ventilation system and activate an audible alarm and strobe. Each refrigerated room and chiller area are equipped with an ammonia detector that is set at the California OSHA permissible exposure limit of 25 ppm, which will activate an audible alarm and strobe.\n\n\n\nAn emergency control box is installed on the east exterior wall of the refrigeration machinery room, which contains three valves. The high and low side of the system each have a valve that would discharge to a water diffuser, which drains to a pond basin on the west side of the property. The connecting pipe between the high and low side has one equalizer valve that would equalize the system.\n\n\n\nThe ammonia refrigeration system at Titan Cold Storage consists of vessels, equipment, and valves which are interconnected by piping.  As such, the refrigeration system at Titan Cold Storage is treated as a single process.\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000052577,
      "SummaryText": "\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n    To ensure the ongoing safety of our facility, we have instituted a Process Safety Management program.  We have compiled written process safety information that includes the hazards of the process, the technology being utilized and detailed information on our equipment.  We conduct a Process Hazard Analysis every five years, ensuring to track all recommendations to closure.  All operators assist in the annual review of our operating procedures to ensure that both the SOPs are accurate, and to ensure each employee has been provided refresher training on them.  We also utilize safe work practices such as Lock-Out, Block-Out, Tag-Out, Confined Space Entry, Hot Works, Line Breaking, etcetera.\n\n    To assure Mechanical Integrity, we perform detailed inspections on each piece of equipment in the system on an annual basis.  All inspections are performed per International Institute of Ammonia Refrigeration Bulletin 109.  To assure the longevity of the process, we have also developed and implemented a Management of Change program.  Pre-Startup Safety Reviews are performed as needed.\n\n    Compliance Audits are conducted every three years to ensure our ongoing compliance with regulations.  We have also instituted procedures for Incident Investigations, Employee Participation, and Contractor Safety.\n\n    Development, implementation, and documentation of the entire plan is the responsibility of the Plant Manager.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n    Titan Cold Storage has not had an accidental release nor any incident that could have resulted in the release of anhydrous ammonia in the last five years.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n    Titan Cold Storage has developed an emergency response program to ensure: Employee safety, Notification of agencies, and informing the general public.  This plan includes a chain of command, evacuation procedures, a notification list, and First Aid for exposure to either liquid"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000052577,
      "SummaryText": " or gaseous ammonia.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n    No additional changes are planned at this time.\n\n\n\n\n\n\n\n"
    }
  ]
}