{
  "FacilityID": 1000001693,
  "FacilityName": "Quest Separation Technologies, Inc.",
  "FacilityStr1": "12500 Bay Area Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77507",
  "Facility4DigitZipExt": "1308",
  "FacilityCountyFIPS": "48201",
  "LEPC": "LaPorte",
  "FacilityLatDecDegs": "29.640556",
  "FacilityLongDecDegs": "-095.040278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 858728389,
  "ParentCompanyName": "Chusei U.S.A.",
  "Company2Name": null,
  "CompanyDUNS": 858728389,
  "Company2DUNS": 0,
  "OperatorName": "Quest Separation Technologies, Inc.",
  "OperatorStr1": "12500 Bay Area Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77507",
  "OperatorZipCodeExt": "1308",
  "RMPContact": "James P. Novak",
  "RMPTitle": "EH & S Manager",
  "FTE": 50,
  "OtherEPAFacilityID": "TXD988071643",
  "EPAFacilityID": "100000089771",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-01-27 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.63861,
  "FRS_Long": -95.04028,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "0.2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002233,
      "AltID": "SAA Resin Manufacturing",
      "FacilityID": 1000001693,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000002336,
          "ProcessID": 1000002233,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002454,
          "ProcessID": 1000002233,
          "ChemicalID": 27,
          "Quantity": 250000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 27,
            "ChemicalName": "Allyl alcohol  [2-Propen-1-ol]",
            "CASNumber": "107-18-6",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000502454,
          "ProcessID": 1000002233,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000002234,
      "AltID": "Polyether Polyol Manufact",
      "FacilityID": 1000001693,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000002337,
          "ProcessID": 1000002234,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002455,
          "ProcessID": 1000002234,
          "ChemicalID": 12,
          "Quantity": 238000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 12,
            "ChemicalName": "Propylene oxide  [Oxirane, methyl-]",
            "CASNumber": "75-56-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000502455,
          "ProcessID": 1000002234,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001693,
      "SummaryText": "\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAt Quest Separation Technologies, Inc., we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n *  A description of our facility and use of substances regulated by EPA's RMP regulation\n *  A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n *  An overview of our accidental release prevention programs\n *  A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n *  An overview of our emergency response program\n *  An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and   adversely   affecting our employees, the public, and the environment\n *  The certifications that EPA's RMP rule requires us to provide\n *  The detailed information (called data elements) about our risk management program\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nOur facility Toll Manufactures Polyols, Polymers and Co-Polymers using a variety of chemicals and processing operations.  Quest Separation Technologies, Inc. produces these products through batch reaction technologies utilizing state of the art equipment and controls. The company has the capability to manufacture such products from the raw material conponents all the way through packaging in solid and liquid forms. In our processes, we use the following chemicals that EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial accidental "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001693,
      "SummaryText": "release:\n\nToxics\nAllyl Alcohol    Production of Polymer Resins        250,000 lbs.\nPropylene Oxide    Production of Polyols            238,000 lbs.\n\nFlammables\n\nNone of the listed flammable substances handled at this facility.\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of these chemicals.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nWe take a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address each of the key features of successful prevention programs including:\n\n *  Process safety information\n *  Process hazard analysis\n *  Operating procedures\n *  Training\n *  Mechanical integrity\n *  Management of change\n *  Pre-startup review\n *  Compliance audits\n *  Incident investigation\n *  Employee participation\n *  Hot work permit\n *  Contractors\n\nAs part of our prevention efforts, we have implemented the following chemical-specific prevention steps:\n\n1. All storage tanks are equiped with level and pressure transmitters and alarms.\n\n2. All storage vessels are minimum 15 psig rated, automatic pressure controls and rupturedisks are provided to prevent tank rupture due to overpressure.\n\n3. All reactors used in Allyl Alcohol or Propylene Oxide service have redundant pressure relief valves that vent to a 16,500 gallon liquid knockout vessel prior to venting to the plant flare. This prevents a release of liquid from the flare due to any upset conditions.\n\n4. Reactor vessels in Allyl Alcohol or Propylene Oxide service have control interlocks for raw material flow, temperature, high pressure, differential temperature and pressure, agitator operation and Cooling Water pump operation. These all serve to prevent release due to upsets or uncontrolled reactions.\n\n5. Storage tanks in Allyl Alcohol service are limited by administrative controls to a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001693,
      "SummaryText": " maximum volume of 80% of capacity and the volume of pure Allyl Alcohol between campaigns is reduced to 2,000 pounds or less.\n\n6. Storage of Propylene Oxide is limited to 80% of full volume administratively and 85% maximum volume by automatic level control devices. The storage vessel level is lowered to a maximum level of 3,000 gallons or less between product campaigns and where practical the tank is deinventoried when not in use.\n\n7. All reactor vessels and piping are pressure and vacuum tested prior to project startup as part of the Safe Operating Procedure.\n\n8. Fugitive emissions testing is conducted on all equipment in VOC service on a minimum of a quarterly basis.\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention. We currently adhere to the principals of SOCMA's Chemstewards Program and will be implementing the SOCMA Responsible Care Management System at our facility by 2009. Our facility is also ISO-9002 certified providing tracking and documentation for all Quality issues.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\n\nQuest Separation technologies, Inc. has not had any Reportable Spills or Releases of RMP regulated chemicals in the last five years.\n\nEMERGENCY RESPONSE PROGRAM\n\nWe maintain an emergency response plan that allows for the integration of other outside agencies when needed. We are currently amending the Emergency Response Plan to the format of the One Plan currently used by most federal, state and local response agencies.  Our pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000001693,
      "SummaryText": "ogram provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the community emergency response plan.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe following is a list of improvements that we are planning to implement at the facility to help prevent and/or better respond to accidental chemical releases:\n\n1. Install an new Emergency Notification System to speed notification of off site locations and residential are as of a chemical spill or release.\n\n2. Consider installation of VOC and Flammable detection systems in process and plant areas where remote detection would provide plant personnel early warning of leaks in remote areas of the plant and process.\n\n3. Install a new process control system that will allow us to have true batch control and improve our safety response time to process variations and help prevent spills and releases.\n\n4. Improve reactor sampling devices and systems to further eliminate leaks and equipment failures.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             "
    }
  ]
}