{
  "FacilityID": 1000080636,
  "FacilityName": "Prestige Fabricators, Inc.",
  "FacilityStr1": "2206 Dumont St",
  "FacilityStr2": null,
  "FacilityCity": "Asheboro",
  "FacilityState": "NC",
  "FacilityZipCode": "27203",
  "Facility4DigitZipExt": "0816",
  "FacilityCountyFIPS": "37151",
  "LEPC": "Randolph County LEPC",
  "FacilityLatDecDegs": "35.761476",
  "FacilityLongDecDegs": "-079.773884",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "8392 Six Forks Road, Suite 101",
  "FacilityEmailAddress": "rgrigg@prestigefab.com",
  "FacilityDUNS": 39254594,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Richard Moore",
  "OperatorStr1": "405 Lewallen Road",
  "OperatorStr2": null,
  "OperatorCity": "Asheboro",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27205",
  "OperatorZipCodeExt": null,
  "FTE": 37,
  "OtherEPAFacilityID": "27203PRSTG2206D",
  "EPAFacilityID": "100000101301",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-28 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.76083,
  "FRS_Long": -79.77424,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100753,
      "AltID": "Polyurethane Foam Manufac",
      "FacilityID": 1000080636,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000126170,
          "ProcessID": 1000100753,
          "ChemicalID": 77,
          "Quantity": 203000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101999,
          "ProcessID": 1000100753,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080636,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-02-01 00:00:00",
    "ERTrainingDate": "2018-09-14 00:00:00",
    "CoordinatingAgencyName": "Asheboro City Fire Department",
    "CoordinatingAgencyPhone": "3366254244",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080636,
      "SummaryText": "Prestige Fabricators, Inc.\n\n2206 Dumont St\n\nAsheboro NC. 27203\n\n\n\nGeneral Information: We have designed our strategy for implementing these elements to work together to provide effective planning for and control of emergency response actions.\n\n\n\nOur plan begins with a brief overview of facility operations and describes the physical area and nature of hazards/events to which our plan is applicable.  This overview helps plan users quickly assess the relevance of the plan to particular types of emergencies in specific locations.  We maintain a list of applicable emergency response regulations to be certain that we meet our regulatory obligations.  We also maintain a brief profile of the facility and its key personnel to facilitate rapid identification of key administrative information that may be needed during an emergency.\n\n\n\nThe core of our plan focuses on the range of emergency response actions from discovery of an incident through termination and follow-up actions at the end of emergency response.\n\n\n\nFinally, our plan addresses how and when a response action ends (and potentially other regulatory requirements begin).  The plan also outlines demobilization of response resources (including decontamination), as well as follow-up activities such as incident investigation, response critique, plan review, and follow-up reports.\n\n\n\nWe use annexes to our plan to provide key supporting information for conducting emergency response under the core plan as well as to document compliance with regulatory requirements. These annexes (1) augment our plan with information too detailed for direct inclusion in our plan and (2) highlight linkages with other internal/external response plans.\n\n\n\nThis annex contains a general description of the facility's response management system, as well as specific information necessary to guide or support the actions of each response management function. We address all response management functions in this annex, including:\n\n\n\nThis annex outlines th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080636,
      "SummaryText": "e procedures for updating the plan based on critiques of incidents/exercises (lessons learned) and formal reviews of the plan.  This annex includes procedures for critiquing an actual or simulated response.  This annex is part of our continuous improvement philosophy at the facility.\n\n\n\n We coordinate our emergency response plans with local emergency planning committees and other emergency response officials, (Fire Department, Asheboro City Police Dept. Randolph Hospital. Covanta Environmental Solutions) providing all of the information they request for inclusion in community emergency response plans.  The following are some examples of other coordination activities:\n\n\n\nQuarterly meetings are held to address Risk Management program plan issues. Tours for outside emergency response personnel are conducted annually. Further we conduct annual emergency response exercises with company employees.\n\n\n\n1.  INTRODUCTION\n\n\n\nIn accordance with Sections 68.90 and 68.95 of the RMP rule, we maintain an integrated contingency plan (ICP), which consolidates all of the various federal regulatory requirements for emergency response planning.  Our ICP provides the essential planning for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with applicable community emergency response plans and local responders.\n\n\n\n2.  EMERGENCY RESPONSE PLAN ELEMENTS\n\n\n\nOur emergency response plan addresses all of the elements of a comprehensive, integrated contingency plan, including:\n\n\n\n3.  MANUFACTURING OPERATIONS:\n\n\n\nPrestige Fabricators Inc. is located at 2206 Dumont St., in the city of Asheboro, North Carolina 27203, in Randolph County. The facility produces polyurethane foam for use in the furniture manufacturing industry by a blowing process which uses toluene diisocyanate. \n\n \n\nPrestige Fabricators moved into the facility in 1983. The facility resides on approximately 39.4 acres and is located in the city limits of As"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080636,
      "SummaryText": "heboro, North Carolina.  The surrounding area consists of a small town known as Central Falls with 15-20 residential homes next to the plant. The Plant is located on a small hill next to the Deep River. The plant sets approximately 50 feet above the river where Old Liberty Road crosses the bridge, and is regulated under the authority of U.S. Coast Guard and is the nearest significant body of water or navigable waterway.\n\n\n\n4.  SECURITY:\n\n\n\nThe facility is divided into 3 levels and has a chain link fence around the property. There are several gates along the fence, which remain locked. The gates are manually controlled by security guards, for visitors, employees entering and exiting and daily delivery and shipping traffic. The gates are monitored by security 24 hours a day. Security checkpoint stations are strategically located throughout the facility to ensure all areas are covered. Chemical storage areas are checked hourly during non-operating hours.  \n\n\n\n5.  SPILL CONTAINMENT ACTIONS\n\n\n\nAll chemical storage tanks are numbered and labeled as to contents, all areas are enclosed and any chemicals spilled can be contained within each storage facility. The TDI storage tank is also equipped with a high and low level alarm. Minor spills are contained by the use of absorbent pads and chemical absorbent materials. Emergency response would be determined by the size of the spill and chemical product involved. An emergency response team would respond from within the facility. Additional assistance would be provided by the local fire department and response personnel from Covanta Environmental Solutions, Asheboro NC. (1 hour response time).\n\n\n\n6.  SPILL PREVENTION, DETECTION, AND CONTROL\n\n\n\nProvisions have been made to reduce the risk of a catastrophic event due to a release of hazardous waste or petroleum based material.  These include utilizing spill control kits within the facility. A Hazardous Waste storage room is dedicated to the storage of raw and waste drum material. T"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080636,
      "SummaryText": "he storage areas are inspected daily for evidence of leaking or damaged equipment.\n\n\n\n7.  EMERGENCY RESPONSE            \n\n\n\nThe Facility Contingency Plan details the guidelines to be followed in the event of a non-routine occurrence such as a fire, explosion, or release of hazardous substance into the air, water, soil, or groundwater which poses or potentially poses a threat to human health and/or the environment. Any person discovering a fire, explosion, or release of hazardous substance into the air, water, soil, or groundwater is to report the event to their immediate supervisor or the front office receptionist by dialing 2009, portable radio transmission, or manual alarm activation. Should the emergency involve a fire, the local fire department will be notified immediately if the manual alarm activation has not already been triggered. \n\n\n\n8.  COORDINATION\n\n\n\nWe coordinate our emergency response plans with local emergency planning committees and other emergency response officials (Fire Department, Asheboro City Police Dept, Randolph Hospital, and Covanta Environmental Solutions). All plant employees have been trained. \n\n\n\nCurrent Revision Date: Revised September 2018 by Jeremy Shelton"
    }
  ]
}