{
  "FacilityID": 1000064139,
  "FacilityName": "Ozark Southside WWTP",
  "FacilityStr1": "2872 South Alabama Highway 123",
  "FacilityStr2": "P. O. Box 1125",
  "FacilityCity": "Ozark",
  "FacilityState": "AL",
  "FacilityZipCode": "36361",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01045",
  "LEPC": "Dale County LEPC",
  "FacilityLatDecDegs": "31.388382",
  "FacilityLongDecDegs": "-85.609618",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Utilities Board of the Cityof Ozark",
  "OperatorStr1": "2872 South Alabama Highway 123",
  "OperatorStr2": "P.O. Box 1125",
  "OperatorCity": "Ozark",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36361",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000208777",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-10-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-06-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-06-26 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-06-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-06-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000080476,
      "AltID": "Waste Water Treatment",
      "FacilityID": 1000064139,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000100304,
          "ProcessID": 1000080476,
          "ChemicalID": 62,
          "Quantity": 4400.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000081718,
          "ProcessID": 1000080476,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000050250,
              "Process_NAICS_ID": 1000081718,
              "SafetyReviewDate": "2009-07-29 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 1,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2017-06-21 00:00:00",
              "ChangeCompletionDate": "2017-06-21 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Leak sensors, Hydro Gas detector",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-06-21 00:00:00",
              "TrainingReviewDate": "2016-11-13 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-07-29 00:00:00",
              "EquipmentInspectionDate": "2017-05-25 00:00:00",
              "EquipmentTested": "exhaust fan, valves, leak sensors, gas detector, scales",
              "ComplianceAuditDate": "2017-06-21 00:00:00",
              "AuditCompletionDate": "2017-06-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The process included in this prevention program is a publically owned wastewater treatment facility.  The wastewater is treated using chlorine and sulfur dioxide.  The process consists of two (2), one-ton chlorine cylinders and two (2), one-ton sulfur dioxide cylinders.  The prevention program and standard Risk Management Plan consists of the following actions and will be conducted in accordance to the regulations in 40 CFR 68 A? Chemical Accident Prevention.  The RMP is further explained in the Executive Summary.\n 1) Plan:  conduct reviews, develop and implement procedures, and conduct training for the prevention program.\n2) Monitor & Control:  Implement maintenance and operational process controls.\n3) Identify:  Identify potential hazards and incidents resulting from the process.  Identify mitigation methods to prevent hazards from occurring as a result of the process.\n4) Analyze:  Conduct compliance audits and inspections to verify the effectiveness of the prevention program.  Implement incident corrective actions and/or process improvements to mitigate incidents.  Conduct incident investigations and implement corrective actions when necessary.\n\nThe program will be revised, as necessary, based on results of regular reviews of risk identification and analysis.  Process controls include leak sensors, a hydro gas detector, manual shutoffs, alarms and procedures, and emergency air supply.  Everything in this prevention program applies to all components of the process.\n\nNote:  Sulfur Dioxide is an RMP regulated substance.  However, sulfur dioxide at this facility/process does not exceed the RMP reportable threshold quantity; therefore, it is not included in this RMP.                                       \n                  \n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000050976,
                  "PreventionProgram2ID": 1000050250,
                  "ProcessChemicalID": 1000100304
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000064139,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Dale Co Emergency Management Agency",
    "CoordinatingAgencyPhone": "3347742214",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000064139,
      "SummaryText": "10.    Executive Summary\n\n\n\n10.1.    Risk Management Program Approach\n\nThe Risk Management Plan describes how risks will be assessed and managed for the Ozark Southside Wastewater Treatment Plant.  The facilityA?s overall approach to chemical safety is an integral part of the risk management program.  The program model consists of five elements functioning in a continous cycle to ensure the safety of the facility and the surrounding communities.  The Risk Management program model is comprised of the following elements.\n\n1.  Risk Identification\n\n2.  Risk Analysis \n\n3.  Emergency Response & Planning\n\n4.  Risk Monitoring & Control \n\n5.  Continuous Improvement\n\n\n\nThe project manager is the person responsible for RMP (part 68) implementation.  The project manager may delegate certain tasks and responsibilities associated with the RMP to other facility employees, as necessary.  The responsibilities of the project manager, or designee, include:\n\no Conduct regular risk review for the facility\n\no Review the status of all risk mitigation efforts\n\no Identify and analyze any new risks\n\no Identify steps to mitigate risks\n\no Identify and rank most critical risks\n\no Assess the exposure and probability for the risk\n\no Maintain the facilityA?s Risk Register\n\no Report risk status to necessary key individuals and stakeholders\n\n                                           \n\n10.1.1.    Risk Identification\n\nDuring risk identification, potential sources of risk and potential risk events are developed.  Each risk is then ranked or categorized, based on the risk analysis.  After identifying and categorizing the risk event, it is entered into the risk register.  Risk identification is conducted at regularly defined intervals throughout the life of the facility and/or process.  The known risks are identified immediately so proper response planning and monitoring can occur.  All identified risks will be documented and entered into the Risk Register (an Excel spreadsheet), which is kept in a commonly acce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000064139,
      "SummaryText": "ssible location.  The Risk Register will be the ultimate source for tracking and documentating all activities associated with the RMP.  \n\n\n\n10.1.2.    Risk Analysis\n\nDuring risk analysis, the process will be reviewed and analyzed for potential threats that could result from failures and or accidents in the process.  The process will be reviewed and analyzed at regular intervals in conjunction with the risk identification.  The Risk Register will be updated, as necessary, to track additional potential risks as they are identified.  During the risk analysis, the following information will be gathered and documented on the Risk Register:\n\n1.  Potential Risk Event\n\n2.  Probability of Occurrence (recorded as High-Medium-Low)\n\n3.  Impact (recorded as High-Medium-Low)\n\n4.  Trigger/Symptom A? the risk trigger/symptom is the event that would need to happen in order for the potential outcome to occur.  Risk triggers are usually expressed with some sort of qualifier.  When the risk trigger/symptom occurs, the risk is no longer a risk, but has materialized into a problem/issue that needs resolution.  \n\n5.  Response  (recorded as Avoid, Transfer, Mitigate, Accept, Other)\n\n6.  Response/Mitigation/Contingency Plan\n\n\n\nAll identified risks will be documented and maintained on the Risk Register.  Potential risks that currently exist at the facility/process that could result in an accidental release include:\n\no Equipment failures\n\no Equipment leaks\n\no Weather events such as Tornados or Hurricanes\n\n\n\n10.1.3.    Emergency Response & Planning\n\nWhen a risk is identified, the appropriate response is indicated for the risk.  A customized mitigation and/or response plan is developed and implemented to respond to the particular risk or emergency situation.  Further, the facility is covered under the local community emergency response plan A? Dale County EMA Emergency Response Plan.  Under this plan, in the event that an emergency occurs at the facility, the Ozark Fire Department and/or the Fort Ruc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000064139,
      "SummaryText": "ker Hazardous Materials Team would be called to respond.\n\n\n\n10.1.4.    Risk Monitoring and Control\n\nRisk monitoring and control tracks and evaluates the performance of risk-handling actions against established metrics throughout the lifecycle of the facility/process.  During risk monitoring and control, the Risk Register is reviewed for accuracy.  At this time, any new or additional identified risks not included on the risk register will be added.  Risk Monitoring and Control will be performed during the regularly scheduled risk review conducted by the RMP Project Manager and/or their designee.  Documentation is an integral part of risk monitoring and control.  Documentation will include risk review dates, any changes to the risk register, etc.  Each regularly scheduled risk review and all monitoring and control activities will be documented on the Risk Register.  A revision date for any changes made to the Risk Register must be recorded under Revision History of the register.  The revision history will record each time the plan is updated and revised.\n\n\n\n10.2.    Ozark Southside WWTP and regulated substances handled\n\nThe Ozark Southside Wastewater Treatment Plant is a publically owned wastewater treatment facility.  The facility is located at 2872 South Alabama Highway 123 in Ozark, Dale County, Alabama at latitude 31.388382 North and  longitude -85.609618 West, in the southwest corner of the Ewell 7.5 Minute Series Quadrangle Map in Section 23, Township 5N, and Range 24E.  The regulated substances handled at the facility include chlorine and sulfur dioxide.  The maximum onsite quantity for each regulated substance is 4,400 lbs.  Chlorine is a reportable substance at the site, because it exceeds the RMP reportable threshold quantity of 2,500 lbs.  Sulfur dioxide does not exceed the RMP reportable threshold quantity of 5,000 lbs; therefore, at this time it is not included in this RMP.  \n\n\n\n10.3.    General Accidental Release Prevention Program\n\nThe facility implements measur"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000064139,
      "SummaryText": "es, both technological and procedural, to ensure prevention of accidental release of regulated substances.  Process controls have been designed into the process to prevent and/or minimize accidental releases of regulated substances.  These controls include leak detectors, a gas sensor, manual shutoffs, alarms and procedures, and emergency air supply.  In addition, the process is enclosed within a building as a method of accidental release mitigation.  RMP and accidental release prevention training is provided to all facility employees.  In addition, regular monitoring and maintenance is performed on all equipment to ensure optimum operating conditions and minimize accidents.  \n\n\n\n10.4.    Five-Year Accident History\n\nThere is no history of accidents at the Ozark Wastewater Treatment Plant.  \n\n\n\n10.5.    Emergency Response Program\n\nThe Ozark Wastewater Treatment Plant is covered under the Dale County EMA Emergency Response Plan.  In the event of an accident, the Dale County EMA Emergency Response Plan would be activated.  Under this plan, the Ozark Fire Department and/or the Fort Rucker Hazardous Materials Team would be the first responders.  The facility has identified an emergency contact.  The emergency contact for the facility is listed as the General Manager of the Utilities Board of the City of Ozark.\n\n\n\n10.6.    Planned Changes to improve safety\n\nContinuous Improvement is an integral part of the Ozark Southside WWTP RMP.  This includes proactive planning and implementation of safety and process improvement ideas to further mitigate accidents at the facility.  Along with the other aspects of the RMP, safety and process improvement ideas and plans will be reviewed at the regularly scheduled risk review conducted by the RMP Project Manager and/or their designee.  Each improvement will be documented in the Continuous Improvement section of the Risk Register with target implementation timing and responsibility.  The progress of improvement idea implementation will also be re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000064139,
      "SummaryText": "viewed during the regular risk review.\n\n"
    }
  ]
}