{
  "FacilityID": 1000056578,
  "FacilityName": "Sweetwater Creek Gas Plant",
  "FacilityStr1": "322 Private Rd. 4520",
  "FacilityStr2": null,
  "FacilityCity": "Decatur",
  "FacilityState": "TX",
  "FacilityZipCode": "76234",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48497",
  "LEPC": "Wise County LEPC",
  "FacilityLatDecDegs": "33.171030",
  "FacilityLongDecDegs": "-097.398110",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.1849energy.com",
  "FacilityEmailAddress": "tgardner@1849energy.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "1849 Energy Partners Operating, LLC",
  "Company2Name": "1849 Energy Partners, LLC",
  "CompanyDUNS": 0,
  "Company2DUNS": 97675374,
  "OperatorName": "1849 Energy Partners Operating, LLC",
  "OperatorStr1": "6000 Western Place Suite 730",
  "OperatorStr2": null,
  "OperatorCity": "Fort Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76107",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ron Dahle",
  "RMPTitle": "Production Supervisor",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000171253",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-03-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-07-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-05-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-05-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-05-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.17222,
  "FRS_Long": -97.4,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000070627,
      "AltID": "Cryogenic Gas Plant",
      "FacilityID": 1000056578,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000071828,
          "ProcessID": 1000070627,
          "NAICSCode": "21111",
          "_desc": {
            "NAICS_CODE": "21111",
            "NAICS_DESCRIPTION": "Oil and Gas Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000087333,
          "ProcessID": 1000070627,
          "ChemicalID": 155,
          "Quantity": 736896.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000074765,
              "ProcessChemicalID": 1000087333,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000074766,
              "ProcessChemicalID": 1000087333,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000074767,
              "ProcessChemicalID": 1000087333,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000074768,
              "ProcessChemicalID": 1000087333,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000074769,
              "ProcessChemicalID": 1000087333,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000076246,
              "ProcessChemicalID": 1000087333,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000076247,
              "ProcessChemicalID": 1000087333,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000587333,
          "ProcessID": 1000070627,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056578,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\n1849 Energy Partners Operating, LLC and its affiliates(\"1849\") accidental release prevention policy involves a unified approach that integrates procedures and management practices. Applicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to. 1849's emergency response policy involves the preparation of response plans that are tailored to the facility and to the emergency response services available in the community and that comply with the EPA Emergency Response Program requirements. 1849's spill policy seeks to implement appropriate controls to prevent accidental releases of regulated substances. If such a release does occur, company personnel are prepared to work with the local fire department, Local Emergency Planning Commission, and other authorities to control and mitigate the effects of the release.\n\n\n\nFacility And Regulated Substance Handled\n\nThe primary activity of 1849's Sweetwater Creek Gas Plant is the extraction of natural gas liquids (NGLs) from a stream of natural gas that flows into the facility through a system of pipelines.  The facility has two cryogenic gas processing plants which cool the incoming gas to extremely cold temperatures.  At low temperature, the heavier hydrocarbons condense into liquid form and are removed from the gas stream.  Residual gas is then compressed and shipped offsite via pipeline while any liquids extracted are pumped to a pressurized tank onsite for storage.  The liquids consist of a mixture of ethane, propane, butane, isobutene, pentane, and isopentane.  This mixture (also known as natural gas liquid or NGL) is a regulated NFPA-4 flammable substance.  It is stored onsite in four 60,000 gallon tanks until it is sold, loaded into a tank truck, and transported to a refiner.  With all tanks at maximum capacity of 85% full, the total potential volume of NGLs stored onsite is 204,000 gallons with a weight of approximate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056578,
      "SummaryText": "ly 737,000 lbs.  \n\n\n\nGeneral Accidental Release Prevention Program And Chemical Specific Prevention Steps \n\n1849 has taken the necessary steps to comply with the accidental release prevention requirements of 40 CFR 68. This facility was designed and constructed in accordance with applicable state and federal regulations.  The following sections briefly describe the elements of the release prevention program that are in place at the stationary source. \n\n\n\nProcess Safety Information and Hazard Review \n\n1849 maintains a written Emergency Response Plan regarding safety information that describes the chemical hazards associated with regulated substances at the facility.  Additionally, operating procedures and equipment design codes and standards associated with the operations at the facility are maintained on-site. The facility conducts regularly scheduled safety inspections to identify and control the hazards associated with the process.  Inspections include the bulk storage vessels, pipes, valves, gauges, pumps, and any other process related equipment.  Any findings related to the hazard analysis are addressed in a timely manner. \n\n\n\nOperating Procedures \n\nFor the purposes of safely conducting activities at the facility associated with regulated substances, 1849 maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, emergency shutdown, emergency operations, normal shutdown and startup after an emergency shutdown. The information is reviewed as needed and is readily accessible to operators involved with the processes. \n\n\n\nTraining\n\n1849 has an operator safety-training program in place to train employees involved in the process. New employees receive tabletop and on-the-job training in process operations followed on-the-job supervision until they are deemed competent to work independently. Refresher training is provided every three years or more frequently as needed.\n\n\n\nMaintenance Procedure"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056578,
      "SummaryText": "s \n\n1849 performs regular maintenance checks on the facility equipment to ensure proper function. Only qualified personnel carry out the maintenance operations. Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. When outside contractors are required for maintenance and construction activities, those personnel are accompanied by 1849 employees or are briefed by company personnel on the rules, regulations, and emergency procedures outlined in the emergency response plan before initiating work. \n\n\n\nCompliance Audits \n\n1849 conducts audits to determine whether the provisions of the RMP rule are being implemented. These audits are performed at least every 3 years as required by 40 CFR 68. Corrective actions required as a result of the audits are undertaken in a safe and prompt manner. \n\n\n\nIncident Investigation \n\n1849 promptly investigates any incident that has resulted in, or could have reasonably resulted in a catastrophic release of a regulated substance. These investigations are performed to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. Reports are retained for a minimum of 5 years. \n\n\n\nFive-year Accident History\n\nThe Facility has never had a reportable accident of covered processes. \n\n\n\nEmergency Response Program\n\nThis facility has a site-specific emergency response plan. The plan describes response procedures to minimize hazards to human health and the environment in the event of a regulated substance accidental release. Aspects of emergency response include adequate first aid and medical treatment, evacuations, notifications of local emergency response agencies and the public, as well as post-incident cleanup of affected areas.  A general emergency practice drill will be performed at least annually and includes an invitation to the local authorities. The emergency response also plan contains procedures for notifying company staff and mana"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000056578,
      "SummaryText": "gement for the sustained response.  A site map, SDSs, and a list of on-site chemicals are kept at the facility. \n\n\n\nPlanned Changes to Improve Safety\n\nThere are planned enhancements to training programs and emergency response plans.  Maintenance checks, compliance audits, management of change procedures, and incident investigations will identify any physical changes to improve safety.  1849 has a continued commitment to update equipment and improve safety regarding the covered process when necessary.  \n\n"
    }
  ]
}