{
  "FacilityID": 1000030326,
  "FacilityName": "Airgas Specialty Gases, Inc.",
  "FacilityStr1": "12202 Fairmont Parkway",
  "FacilityStr2": null,
  "FacilityCity": "La Porte",
  "FacilityState": "TX",
  "FacilityZipCode": "77571",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Bay Area LEPC",
  "FacilityLatDecDegs": "29.651389",
  "FacilityLongDecDegs": "-95.042778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Airgas, Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Airgas, Inc.",
  "OperatorStr1": "259 N. Radnor-Chester Road",
  "OperatorStr2": null,
  "OperatorCity": "Radnor",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19087",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lynda Bennicoff",
  "RMPTitle": "Plant Manager",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000214065",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-10-25 00:00:00",
  "SafetyInspectionBy": "Environmental Services Group, Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-10-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-10-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-10-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-06-17 00:00:00",
  "DeRegistrationEffectiveDate": "2013-06-11 00:00:00",
  "AnniversaryDate": "2017-10-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "0.2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036966,
      "AltID": null,
      "FacilityID": 1000030326,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000037331,
          "ProcessID": 1000036966,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000044592,
          "ProcessID": 1000036966,
          "ChemicalID": 93,
          "Quantity": 50598.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544592,
          "ProcessID": 1000036966,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000030326,
      "SummaryText": "Airgas Specialty Gases operates an Industrial Gas distribution and storage facility for Methane.  The primary purpose of the facility is to repackage and distribute industrial gases to wholesale customers. This is the only product at this location which falls under risk management plan requirements. The flammable characteristics of methane make it necessary to observe certain precautions when handling. Overall, the prevention of exposures and reducing the threat to associates personal health, as well as reducing the threat to nearby members of the community is the main goal of incorporating this Risk Management Plan into our daily operations. It is Airgas Specialty Gases policy to adhere to all applicable local, state, and federal rules and regulations. Overall safety of the facility depends upon the manner in which products are stored and handled, combined in coordination with the operations and maintenance procedures provided to all personnel responsible for the use of the systems. \n\n\n\nWritten policies and procedures for handling Methane are followed each day. Maintenance when necessary is contracted out to pre-qualified companies who have trained personnel in the proper maintenance of the systems. The mechanical integrity of the systems is maintained in accordance with all good engineering practices. Contractors have access to the Operations & Maintenance manuals for all systems.\n\n\n\nThis facility has a Process Safety Management plan which is incorporated into the daily routine to comply with the Level 3 Prevention Program requirements. The facility follows the Airgas Safety Management System that includes items such as Lockout/Tag out, Hazard Communication, Contractor Safety, etc. The facility has an Emergency Action Plan in place to aid in the prevention of accidental releases and natural disasters that may affect the facility. \n\nThe Harris County LEPC and the La Porte Fire Department have been provided copies of this plan. If a release were to occur at this loc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000030326,
      "SummaryText": "ation, associates would be notified of the release by activation of the audible alarm and muster at the evacuation point for a head count and notify the La Porte Fire Department if necessary.  The La Porte Fire Department is the primary response agency to a release at this location and is trained in Hazardous Materials operations. \n\n\n\nThis facility has a flammable worst case scenario. The flammable worst case scenario for a flammable release would be tank failure of the 9,000 gallon refrigerated storage tank storing methane. This release if the vessel were full would have a release of 31,500 pounds of methane. \n\n\n\nActive mitigation was not considered for this release scenario. Passive mitigation was not considered for this release scenario. \n\n\n\nThe distance to endpoint for the worst case scenario is 0.3 miles. The area surrounding the facility is considered urban (Industrial). This release scenario could impact approximately zero persons in a 0.3 mile radius. This information was determined using RMP*Comp and MARPLOT software. \n\n\n\nAn alternate flammable release of methane from a cylinder pressure relief device would be the most probable release for this location. If this were to happen with methane, an estimated release rate would be approximately 1.2 pounds per minute for 10 minutes, for a total of a 12 pound release.  Cylinder valves are the weakest point of the cylinder and if there was a release it most likely would occur due to a failed valve or the valve was knocked off. \n\n\n\nThe distance to endpoint for the alternate release scenario is 0.1 miles. The area surrounding the facility is considered to be urban (industrial). This release scenario could impact approximately zero persons in a 0.1 mile radius. This information was determined using RMP*Comp and MARPLOT software. \n\n\n\nThere have been no accidental releases from this facility in the past five year.\n\n"
    }
  ]
}