{
  "FacilityID": 1000022256,
  "FacilityName": "Harrison Poultry",
  "FacilityStr1": "107 Smith Mill Road",
  "FacilityStr2": null,
  "FacilityCity": "Bethlehem",
  "FacilityState": "GA",
  "FacilityZipCode": "30620",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13013",
  "LEPC": "Barrow County LEPC",
  "FacilityLatDecDegs": "33.9299740",
  "FacilityLongDecDegs": "-083.705849",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3292281,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "David Bleth",
  "OperatorStr1": "PO Box 550",
  "OperatorStr2": null,
  "OperatorCity": "Bethlehem",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30620",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Kennedy",
  "RMPTitle": "Plant Engineer",
  "FTE": 808,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000133964",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-04-27 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-05-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-05-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-05-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-05-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.93014,
  "FRS_Long": -83.70542,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CENSUS BLOCK-1990-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000027124,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000022256,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000027426,
          "ProcessID": 1000027124,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000032248,
          "ProcessID": 1000027124,
          "ChemicalID": 56,
          "Quantity": 35139.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000532248,
          "ProcessID": 1000027124,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000022256,
      "SummaryText": "Risk Management Submission Statement\n\nHarrison Poultry\nP.O. Box 550\nBethlehem, GA 30620\n\nThis is to inform all interested persons, including employees that Harrison Poultry, Bethlehem, Georgia is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program or RMP), Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals. In this way, we promote overall plant, worker, and public safety. These programs enable our facility to prevent the occurrence, and minimize the consequences of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents. Overall, these programs prevent accidental fatalities, injuries, and illnesses and avoid physical property damage. Our safety programs are applied to any activity involving hazardous chemicals including any use, storage, manufacturing, handling, or the on-site movement of such vessels which are interconnected.  Separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.\n\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment. These rules are detailed and improved as necessary. They are also communicated to and accepted by all employees at the facility.\n\nWORST CASE SCENARIO:\n\nThe worst case scenario involves the failure of the high pressure receiver, which is the largest vessel in the system.  This scenario is unlikely for the following reasons: worst-case weather conditions are uncommon; the vessel located in a protected area below the evaporative condensers, was recently installed with all new valves and piping to industry standards for the manufacture and quality cont"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000022256,
      "SummaryText": "rol of pressure vessels, thus a mechanical failure is unlikely; ammonia is not corrosive in this service; pressure safety valves limit operating pressure in this vessel; the accident prevention program in place at the facility including the mechanical integrity program for regular maintenance, inspection and testing, and replacement of equipment, if necessary; and the emergency response plan and equipment in place at the facility.\n\nALTERNATIVE RELEASE SCENARIO:\n\nThe Alternative release scenario involves a failure of a compressor or high pressure cutout switch which causes a safety valve to release ammonia to the atmosphere.  This particular case was chosen as an alternative scenario because of the number of compressors with pressure switches that could be stuck or possibly mechanically fail. This scenario is unlikely for the following reasons: failure of the pressure switch on one machine will not affect the control functions on the other machines, travel and activity within the compressor room is restricted; the facility accident prevention program in place including operating procedures require maintenance personnel to be present 24 hours a day, and the mechanical integrity program for regular maintenance, inspection, and testing, and the replacement of equipment if necessary; and the emergency response plan and equipment in place at the facility.\n\nACCIDENT HISTORY:\n\nWithin the past five years, the ammonia refrigeration processes have had no accidental releases that have caused onsite or offsite impacts as defined in the risk management program rule {40 CFR 68.10(b)(1)}.  Therefore, there are no RMP reportable incidents.\n\nEMERGENCY RESPONSE PROGRAM: \n\nThis facility emergency response program is based on the OSHA requirements for Emergency Action Plans (29 CFR 1910.38 and 1910.119) This plan is coordinated with the Local Emergency Planning Committee (LEPC) and the local fire department. We conduct annual drills for implementation of the emergency response plan at t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000022256,
      "SummaryText": "he facility with the participation of the LEPC and the fire department. The facility has an action plan to alert the community of an emergency. The last training exercise at the plant was on April 11, 2010."
    }
  ]
}