{
  "FacilityID": 1000062281,
  "FacilityName": "Flint Hills Resources Longview, LLC",
  "FacilityStr1": "118 Huntsman Way",
  "FacilityStr2": null,
  "FacilityCity": "Longview",
  "FacilityState": "TX",
  "FacilityZipCode": "75602",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48183",
  "LEPC": "Gregg County LEPC",
  "FacilityLatDecDegs": "32.434887",
  "FacilityLongDecDegs": "-94.711771",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.fhr.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 962724535,
  "ParentCompanyName": "Koch Industries Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": 0,
  "OperatorName": "Flint Hills Resources Longview, LLC",
  "OperatorStr1": "118 Huntsman Way",
  "OperatorStr2": null,
  "OperatorCity": "Longview",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75602",
  "OperatorZipCodeExt": null,
  "RMPContact": "William Shelton",
  "RMPTitle": "Plant Manager",
  "FTE": 50,
  "OtherEPAFacilityID": " TXR000020842",
  "EPAFacilityID": "100000178087",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-1282",
  "SafetyInspectionDate": "2016-11-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Longview,  Texas",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-03-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-02-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-02-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-02-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.43806,
  "FRS_Long": -94.69,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078089,
      "AltID": "Propylene Unloading",
      "FacilityID": 1000062281,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000079271,
          "ProcessID": 1000078089,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000097076,
          "ProcessID": 1000078089,
          "ChemicalID": 129,
          "Quantity": 4300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000597076,
          "ProcessID": 1000078089,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062281,
      "SummaryText": "2.1.1    Introduction and Policies\n\nThe Flint Hills Resources Longview, LLC - Longview Facility (FHR) is located at 118 Huntsman Way in Longview, Texas. \n\n\n\nFHR is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors, and the public while fully complying with applicable laws and regulations. FHR's management philosophy goals are achieved through the implementation of its Environmental Health and Safety Management Systems, by the personal commitments of employees and contractors, and by open communication with employees, customers, neighbors, and regulators. \n\n\n\nThe purpose of this Risk Management Plan is to provide information about operations at the facility, programs to prevent accidental chemical releases, emergency response plans in the event of an accidental release, the five-year accident history of the facility, and planned changes to improve safety at the plant.\n\n\n\n2.1.2    Stationary Source and Regulated Substances\n\nThe Longview facility, operated by FHR, is a propylene unloading and storage facility located in Longview, Texas. The facility is operated for offloading propylene from railcars into a storage tank until transferred via pipeline to a nearby polymers plant. \n\n\n\nAs part of its unloading and storage operations, the facility uses propylene, an EPA RMP covered chemical, in quantities greater than the threshold quantity of 10,000 lbs. The facility consists of three double-sided railcar unloading racks for a total of six offloading spots, in addition to a storage tank, compressor system, and associated piping and instrumentation. Railcars are offloaded into the storage tank, and propylene is transferred via pump from the storage tank into a Department of Transportation (DOT) pipeline that transfers propylene to a nearby Polymers plant. The Longview facility does not have any EPA RMP-regulated toxic chemicals.\n\n\n\nThe facility is subject to the OSHA Process Safety Manageme"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062281,
      "SummaryText": "nt Standard, 29 CFR 1910.119, and regulated under EPA Risk Management Program 40 CFR Part 68 - Program Level 3 requirements.\n\n\n\n2.1.3    Accidental Release Prevention and Emergency Response Policies\n\nThe accidental release prevention and emergency response programs in place at the facility are part of the high standards adopted by FHR.  These standards include:\n\n\n\n?    Operating in compliance with required environmental permits and regulations. \n\n?    Operating and maintaining the assets such that unintentional releases are minimized.\n\n?    Operating and maintaining assets in such a manner that the small releases associated with normal operation and maintenance will be minimized to the extent possible.\n\n?    Correcting findings identified in regular audits of the facility.\n\n\n\nFHR is committed to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our processes. The Longview facility adheres to process safety policies, guidelines, and best practices that have been developed based on company and industry experience over the years. FHR's practice is to implement the controls necessary to prevent releases of regulated substances to the environment. However, if a release does occur, trained FHR personnel will respond, to control and contain the incident. Details on the emergency response program are outlined in Section 2.1.6.\n\n\n\n2.1.4    Prevention Program\n\nThe FHR Longview Facility is operating under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program.  Ongoing analysis of the potential hazards of the process, detailed training of employees and emphasis on safety has contributed to process safety.  The facility has had no RMP chemical release accidents over the last 5 years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062281,
      "SummaryText": "eleases, as part of a detailed prevention program.  A few examples of the prevention features implemented at this facility include:\n\n\n\n?    Minimizing the possibility of an interruption in power supply to the process control system by having a backup power generator.\n\n?    Providing preventive maintenance and testing of vessels through the Mechanical Integrity program to ensure that structural failures do not occur in process equipment.\n\n?    Minimizing the possibility of a release of propylene, using shutdown interlocks installed on process equipment.\n\n?    Reducing the severity of fires when operating automatic sprinkler and manual deluge systems.\n\n?    Reducing the risk of overfilling by including level alarms and/or indicators on the storage tank.\n\n?    Implementing operating procedures for unloading and transfer operations.\n\n?    Installing combustible gas detectors in the facility.\n\n\n\n2.1.5    Five-Year Accident History\n\n    EPA requires that all incidents involving regulated chemicals that resulted in any off-site impact or significant on-site impact be reported in this document. Within the last five years (February 17 2012 - February 17, 2017), there were no releases of hazardous materials that met the criteria for an RMP accident.\n\n     \n\n2.1.6    Emergency Response Program\n\nThe facility continues to conduct emergency response preparedness activities and coordinate any emergency response actions necessary with the local Longview Fire Department and Gregg County Local Emergency Planning Committee (LEPC). As appropriate, the Texas State Police, local hospitals and other coordinating agencies also continue to be involved in emergency response for the facility.  \n\n    \n\n    The FHR Longview Plant Manager is responsible for coordinating the emergency actions.  A written and specific Emergency Response Plan coordinated with local officials is in place for the facility.  The Emergency Response Program provides the essential planning for effectively protecting workers, the public, and the environment du"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062281,
      "SummaryText": "ring emergency situations.\n\n    \n\n2.1.7    Planned Changes to Improve Safety\n\n    Compliance with the RMP Prevention Program forms the framework for continuous safety improvement.  Some of the key components of the safety program are:\n\n?    The Management of Change provisions ensure that the potential safety and health impacts of changes made to process chemicals, technology, equipment or procedures are considered.\n\n?    The Process Hazard Analysis (PHA) provisions serve as a tool to ensure \n\ntimely evaluation of potential hazards, thereby leading to continual improvements in safety standards.\n\n?    The Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed, and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of the safety program."
    }
  ]
}