{
  "FacilityID": 1000051257,
  "FacilityName": "Hexcel Corporation",
  "FacilityStr1": "3300 Mallard Fox Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Decatur",
  "FacilityState": "AL",
  "FacilityZipCode": "35601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01103",
  "LEPC": "Morgan County LEPC",
  "FacilityLatDecDegs": "34.655833",
  "FacilityLongDecDegs": "-087.07111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.hexcel.com",
  "FacilityEmailAddress": "shan.rolin@hexcel.com",
  "FacilityDUNS": 948102835,
  "ParentCompanyName": "Hexcel Corporation",
  "Company2Name": null,
  "CompanyDUNS": 9118563,
  "Company2DUNS": null,
  "OperatorName": "Hexcel Corporation",
  "OperatorStr1": "3300 Mallard Fox Drive",
  "OperatorStr2": null,
  "OperatorCity": "Decatur",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35601",
  "OperatorZipCodeExt": null,
  "FTE": 256,
  "OtherEPAFacilityID": "35603HSPNC3300M",
  "EPAFacilityID": "100000148388",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-09-13 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-06-07 11:41:21",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-07 11:41:21",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-07 11:41:21",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.655833,
  "FRS_Long": -87.071111,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064745,
      "AltID": "Acrylonitrile",
      "FacilityID": 1000051257,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000080132,
          "ProcessID": 1000064745,
          "ChemicalID": 25,
          "Quantity": 684000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000065867,
          "ProcessID": 1000064745,
          "NAICSCode": "32522",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000053712,
              "Process_NAICS_ID": 1000065867,
              "SafetyReviewDate": "2019-04-17 00:00:00",
              "PHA_Date": "2020-12-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-10-13 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-03-20 00:00:00",
              "TrainingReviewDate": "2019-03-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training, Pre-shift Meetings",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-04-01 00:00:00",
              "EquipmentInspectionDate": "2019-04-22 00:00:00",
              "EquipmentTested": "T-101-A Acrylonitrile Storage Tank",
              "ChangeMgmtDate": "2019-02-19 00:00:00",
              "ChangeMgmtReviewDate": "2019-04-10 00:00:00",
              "PreStartupReviewDate": "2018-10-12 00:00:00",
              "ComplianceAuditDate": "2018-11-16 00:00:00",
              "AuditCompletionDate": "2019-12-31 00:00:00",
              "IncidentInvestigationDate": "2017-01-12 00:00:00",
              "InvestigationChangeDate": "2017-01-12 00:00:00",
              "ParticipationPlansReviewDate": "2019-04-17 00:00:00",
              "HotWorkPermitReviewDate": "2019-03-22 00:00:00",
              "ContractorSafetyReviewDate": "2018-10-10 00:00:00",
              "ContractorSafetyEvalDate": "2018-06-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000066070,
                  "PreventionProgram3ID": 1000053712,
                  "ProcessChemicalID": 1000080132
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000051257,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-04-10 00:00:00",
    "ERTrainingDate": "2019-04-10 00:00:00",
    "CoordinatingAgencyName": "Decatur Fire Department",
    "CoordinatingAgencyPhone": "2563414862",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000051257,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\nFacility Overview\r\n\r\nHexcel Decatur facility manufactures polyacrylonitrile (PAN) fiber that is converted into carbon fiber at Hexcel facilities in Salt Lake City, Utah and Illescas, Spain.  Carbon fiber is utilized in many important applications such as commercial and military aircraft structural components, satellites, recreation products (golf shafts, fishing rods and tennis rackets), and infrastructure applications (bridges) and industrial products (air tanks, computer housings, etc.). \r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nHexcel Decatur is strongly committed to employee, public and environmental safety.  This commitment is the foundation of our comprehensive accidental release prevention program.  Hexcel's program covers areas such as design, installation, operation procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  For example, our critical control valves are design to fail closed, meaning in a loss of power or other incident they would close preventing a release.  In the unlikely event of a release, we have direct communications to the Emergency Management Association (EMA) who would coordinate an orderly response to minimize the impact.  We have a business relationship with the formerly named SWS Environmental Services currently named National Response Corporation (NRC) to contain and mitigate any onsite emergency event.  Through NRC, the EMA, and the Decatur Fire Department adequate emergency response will be provided.\r\n\r\nStationary Source and the Regulated Substances Handled\r\n\r\nThe Hexcel Decatur facility is regulated under RMP due to onsite acrylonitrile storage being in excess of the 20,000-lb. toxicity above RMP applicability threshold.   The acrylonitrile storage system provides raw materials to the process and consists of a series of tanks for storage,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000051257,
      "SummaryText": "feed, and recovery.  The single largest vessel stores a maximum of 100,000 gallons (675,540 lb.).    \r\n \r\nThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s)\r\n\r\nWorst-case and alternative release scenario assessments were conducted for the facility's vessels and piping based on US EPA's Offsite Consequences Analysis guidance.    \r\nFor acrylonitrile, both release scenarios were considered.  Public receptors were determined to be located within the impact zone of both the worst-case and alternative releases.  The impact zones were determined to be 2.2 miles for worst case, 0.4 miles and 0.2 miles for alternate releases.\r\n\r\nThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\r\n\r\nThe facility's overall approach and commitment to chemical safety is demonstrated by 1) the existing procedural, training, management and maintenance systems already in place at the facility, and 2) the hazard assessment, prevention program and emergency response provisions implemented specifically for acrylonitrile in response to the RMP requirements.  The management structure ensures safety is documented in the facility's RMP and includes compliance with applicable regulations, codes and standards (US EPA 40 CFR 68). The plant manager is designated as the position responsible for the overall RMP. An organization chart is maintained in document control designating the position's lines of authority that have responsibility for implementing individual RMP requirements. \r\nThe following outlines the elements of the release prevention program that are in place at Hexcel Decatur.  Hexcel Decatur complies with OSHA standard 29CFR1910.119 (PSM).\r\n\r\nProcess Safety Information\r\n\r\nHexcel Decatur maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.  This information is updated through a comprehensive Management of Change program. The eng"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000051257,
      "SummaryText": "ineering manager is responsible for development, implementation and integration of process safety information. \r\n\r\nProcess Hazard Analysis\r\n\r\nThe facility conducts comprehensive studies to ensure that hazards associated with the processes are identified and controlled efficiently.  The methodologies used to carry out these analyses are HAZOP-LOPA. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of no more than five (5) years.  Any findings related to the hazard analysis are addressed in a timely manner. The environmental, health and safety manager is responsible for development, implementation and integration of process hazard analysis.\r\n\r\nOperating Procedures\r\n\r\nHexcel Decatur maintains written operating procedures for the purposes of safely conducting activities within our processes.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a shutdown.  The information is reviewed at least annually and revised as necessary, and is readily accessible to operators involved in the processes.  All document changes and revisions are approved by a document control system. The operations manager is responsible for development, implementation and integration of Operating Procedures.\r\n\r\nTraining\r\n\r\nHexcel Decatur has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Job orientation and transfer training, as well as, competency testing is used. The environmental, health and safety manager is responsible for development, implementation and integration of training.\r\n\r\nMechanical Integrity\r\n\r\nHexcel Decatur performs documented maintenance checks on process equipment to ensure proper operations.  Process equipment exami"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000051257,
      "SummaryText": "nt, implementation and integration of Contractors.\r\n\r\nFive-year Accident History\r\n\r\nThe Decatur facility has had no RMP accidents/releases of acrylonitrile that are reportable as defined in 40 CFR Part 68.42 (a) within the five years preceding RMP submittal.  The environmental, health and safety manager is responsible for development, implementation and integration of the Five-year incident history.\r\n\r\nEmergency Response Plan\r\n\r\nHexcel Decatur has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. The environmental, health and safety manager is responsible for development, implementation and integration of Emergency Response Plan.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nSeveral improvements have resulted from the implementation of the various elements of our risk management program.  Hexcel Decatur is constantly striving for continuous improvement of all safety programs and processes and will continue to do so in the future. The Plant manager is responsible for development, implementation and integration of Planned Changes to Improve Safety.\r\n\r\nSummary\r\n\r\nIn summary, Hexcel Decatur is dedicated to safe and responsible operation in our community.  We have demonstrated this commitment through our excellent record to-date.  We strive to prevent releases through proper design, procedures, training, audits, and maintenance.  In the unlikely event of a release, we are prepared to respond in a safe and orderly manner including notification to the Emergency Management Association to minimize any impact to our plant and the community."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000051257,
      "SummaryText": "ned by these checks includes among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Only qualified personnel with appropriate training carry out maintenance operations.  These personnel receive specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. The maintenance manager is responsible for development, implementation and integration of Mechanical Integrity.\r\n\r\nManagement of Change\r\n\r\nWritten procedures and a MOC control database are in place at Hexcel Decatur to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and provided training to deal with the modification. The environmental, health and safety manager is responsible for development, implementation and integration of Management of Change.\r\n\r\nPre-startup Reviews\r\n\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice of the Management of Change system at Hexcel.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation. The environmental, health and safety manager is responsible for development, implementation and integration of Pre-Startup Reviews.\r\n\r\nAudits\r\n\r\nHexcel Decatur conducts compliance audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every three (3) years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  We also conduct other safety, environmental, and health audits at least annually. The environment"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000051257,
      "SummaryText": "al, health and safety manager is responsible for development, implementation and integration of Audits.\r\n\r\nIncident Investigation\r\n\r\nHexcel Decatur promptly investigates any incident or near miss incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  Corrective Actions are documented and followed to completion by the use of the EHS Incident database systems. The environmental, health and safety manager is responsible for development, implementation and integration of Incident Investigation.\r\n\r\nEmployee Participation\r\n\r\nHexcel Decatur believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  An electronic database is provided for employees to submit incident, improvements, etc., and to review past incidents.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, in particular information resulting from process hazard analyses. The environmental, health and safety manager is responsible for development, implementation and integration of Employee Participation.\r\n\r\nContractors\r\n\r\nHexcel utilizes trained contractors to conduct select maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Hexcel Decatur has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur. The environmental, health and safety manager is responsible for developme"
    }
  ]
}