{
  "FacilityID": 1000043490,
  "FacilityName": "Temple-Belton Wastewater Treatment Plant",
  "FacilityStr1": "2405 East 6th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Belton",
  "FacilityState": "TX",
  "FacilityZipCode": "76513",
  "Facility4DigitZipExt": "9602",
  "FacilityCountyFIPS": "48027",
  "LEPC": "Bell County LEPC",
  "FacilityLatDecDegs": "31.045139",
  "FacilityLongDecDegs": "-097.437776",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "http:www.brazos.org/home.htm",
  "FacilityEmailAddress": "information@brazos.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Temple",
  "Company2Name": "City of Belton",
  "CompanyDUNS": 68968510,
  "Company2DUNS": 59941708,
  "OperatorName": "Brazos River Authority",
  "OperatorStr1": "PO Box 7555",
  "OperatorStr2": null,
  "OperatorCity": "Waco",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76714",
  "OperatorZipCodeExt": "7555",
  "RMPContact": "Kyle Headley",
  "RMPTitle": "Deputy Regional Superintendent",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000119169",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-02-23 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 31.05814,
  "FRS_Long": -97.44916,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "6",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053658,
      "AltID": "Chlorination",
      "FacilityID": 1000043490,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054441,
          "ProcessID": 1000053658,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065302,
          "ProcessID": 1000053658,
          "ChemicalID": 62,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565302,
          "ProcessID": 1000053658,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000053659,
      "AltID": "Dechlorination",
      "FacilityID": 1000043490,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054442,
          "ProcessID": 1000053659,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065303,
          "ProcessID": 1000053659,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565303,
          "ProcessID": 1000053659,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043490,
      "SummaryText": "Brazos River Authority\n\nTemple-Belton Wastewater Treatment PLant\n\n\n\n\n\nThe Temple-Belton Wastewater Treatment Plant is an innovative and cost-effective regional sewerage system that serves the wastewater treatment needs of the urban areas in and around the cities of Temple and Belton, Texas. The plant was opened in 1975 and expanded in 1989. It has a system capacity of 10.0 million gallons per day permitted average flow; and 30.0 million gallons per day permitted peak flow- It currently treats an average daily flow of 5.54 million gallons per day. Plant awards include: two Environmental Excellence awards in 1994 from EPA Region VI; the Operations and Maintenance Excellence Award in 1992 from EPA Region VI; the Operations and Maintenance Excellence Award in 1992 from the Texas Water Commission; and 1st place in the 1992 Operations Challenge and 2nd place in the 1991 Operations Challenge from the TWPCA/TWUA.\n\n\n\nOnly chlorine and sulfur dioxide, used to disinfect the water, are stored above the allowable threshold quantity.\n\n\n\nCHLORINE\n\n\n\nChlorine serves to destroy disease-causing organisms and for prevention of algae growth in the Treatment Plant effluent. It is essential that all plant effluent have a chlorine residual of at least 1.0 mg/L after 20 minutes contact. The recommended dose for application to effluent from the activated sludge process is eight mg/L.\n\n\n\nThe chlorine is stored in one-ton cylinders, and is used in groups of two and one. One group is in use and the other is held as backup. The second group is engaged by an automatic switchover module when the first group is exhausted. Each group is connected to a header that is provided with a separate vacuum regulator, which reduces the gas from a varying supply pressure to a constantly regulated vacuum. Chlorine gas feeder cabinets are wall mounted in the Chlorination Room. One feeder is equipped with an automatic rate control valve. The other feeders are equipped with a manual rate control valve located on "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043490,
      "SummaryText": "and adjusted from the front of the cabinet. Valve assembly has been provided to allow different feeders to serve different junction boxes.\n\n\n\nInduction units provide the vacuum required to pull the chlorine gas to the various points of application. These induction units create a vacuum through a motor driven open propeller, located 24 inches below the minimum water surface, which also provides mixing of the chlorine gas with the wastewater and feeds directly into the Chlorine Contact Chambers. Chlorine feed rates are adjusted by the automatic rotameters in response to changes in the flow rate and residual. There are three chlorine contact chambers at the Temple-Belton Plant:Chlorine Contact Chambers No.1and No. 2 will each detain a flow of seven million gallons per day (mgd) for 20 minutes.Chlorine Contact Chamber No. 3 will detain a flow of 23 mgd for 20 minutes.\n\n\n\nSULFUR DIOXIDE\n\n\n\nThe concentration of the chlorine residual measured at the effluent weirs of the Chlorine Contact Chambers is used to determine the amount of sulfur dioxide dosed at the Effluent Structure. The plant effluent flow is to be dechlorinated to less than 0.1 mg/L for discharge.\n\n\n\nSulfur dioxide is stored in a maximum of four one-ton cylinders (usually three are on site at any given time), also connected to separate headers that are mounted on anchored supports. Almost all of the equipment used for sulfur dioxide feeding and induction, with the exception of the rotameters and some materials of construction, is identical to the equipment used for chlorine induction.\n\n\n\nSulfur dioxide gas feeders, or manual rotameters, are wall-mounted. One rotameter is equipped with an automatic rate control valve- The other rotameters are equipped with a manual rate control valve. Two of these rotameters have been supplied, each capable of delivering the maximum recommended dose of sulfur dioxide. Valve assembly has been provided so that either induction unit for this system may be fed through either rotame"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043490,
      "SummaryText": "ter.\n\n\n\nSulfonation (the process of sulfur dioxide reduction of the chlorine residual) takes place almost instantly. For this reason, it is not necessary to provide a contact chamber for detention of the flow. Sulfur dioxide is introduced into the flow at the Effluent Structure.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nAuthority policies include the need for a written emergency action plan, exercises and reviews of the plan, emergency response training for facility personnel, and coordination with local responders.  In addition, monthly safety inspections are conducted by the Authority's Safety Training Officer.  Risk management consultants from our insurance company are used as resources.\n\n\n\nAccidental Release Prevention Program\n\n\n\nPlant personnel are trained to handle chemical containers in such a manner as to prevent leaks or spills while connecting or disconnecting containers. Personnel are also trained to shut down the system by closing the cylinder valve in the event of an emergency or anticipated emergency.\n\n\n\nFive-Year Accident History\n\n\n\nThere were no reportable accidental releases of regulated chemicals in the last five years.\n\n\n\nEmergency Response Program\n\n\n\nTBRSS has the capability to respond to and mitigate the release of on-site hazardous chemicals that present a moderate health and/or safety threat to TBRSS and responding personnel, present a moderate potential for adverse environmental impact, are of limited , and have low fire/explosion potential. If the spill/release is beyond the capability of onsite personnel, the City of Belton and Bell County HAZMAT teams will respond by calling 911. Training and exercises are conducted periodically, especially since 9-11. The city and county have been conducting regional WMD-terrorist exercises, which included response to hazardous chemical releases. \n\n\n\nPlanned Changes to Improve Safety\n\n\n\nWe anticipate joint training with local first responders and conducting additional internal HA"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043490,
      "SummaryText": "ZMAT and chemical safety training for operators, maintenance, and administrative personnel. Security enhancements and procedures have been made since 9-11 and continuous improvements are made as resources become available."
    }
  ]
}