{
  "FacilityID": 1000086346,
  "FacilityName": "Chain of Rocks Water Treatment Plant",
  "FacilityStr1": "10450 Riverview Drive",
  "FacilityStr2": null,
  "FacilityCity": "St. Louis",
  "FacilityState": "MO",
  "FacilityZipCode": "63137",
  "Facility4DigitZipExt": "4399",
  "FacilityCountyFIPS": "29510",
  "LEPC": "St. Louis City LEPC",
  "FacilityLatDecDegs": "38.7556",
  "FacilityLongDecDegs": "-090.1838",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.stlwater.com",
  "FacilityEmailAddress": "water_questions@stlwater.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of St. Louis Water Division",
  "Company2Name": null,
  "CompanyDUNS": 148058253,
  "Company2DUNS": null,
  "OperatorName": "City of St. Louis Water Division",
  "OperatorStr1": "1640 So. Kingshighway Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "St. Louis",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63110",
  "OperatorZipCodeExt": "2230",
  "FTE": 140,
  "OtherEPAFacilityID": "MOT300010774",
  "EPAFacilityID": "100000072299",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-12-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-11-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-11-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-11-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-11-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 38.754333,
  "FRS_Long": -90.183583,
  "FRS_Description": null,
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107794,
      "AltID": "water supply systems",
      "FacilityID": 1000086346,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000134796,
          "ProcessID": 1000107794,
          "ChemicalID": 62,
          "Quantity": 108000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000109107,
          "ProcessID": 1000107794,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000067353,
              "Process_NAICS_ID": 1000109107,
              "SafetyReviewDate": "2022-11-08 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "American Water Works Association, Chlorine Institute Standards, and Ten States Standards",
              "FR_Comments": null,
              "HazardReviewDate": "2022-11-08 00:00:00",
              "ChangeCompletionDate": "2022-11-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-11-08 00:00:00",
              "TrainingReviewDate": "2022-11-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-11-08 00:00:00",
              "EquipmentInspectionDate": "2022-11-08 00:00:00",
              "EquipmentTested": "All chlorine system equipment is inspected hourly; preventive maintenance is performed on a schedule. In October 2022, staff conducted annual inspection &  performed any necessary maintenance.",
              "ComplianceAuditDate": "2021-10-29 00:00:00",
              "AuditCompletionDate": "2022-03-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2012-03-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000068141,
                  "PreventionProgram2ID": 1000067353,
                  "ProcessChemicalID": 1000134796
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000086346,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-10-10 00:00:00",
    "ERTrainingDate": "2022-11-07 00:00:00",
    "CoordinatingAgencyName": "St. Louis City Fire Department",
    "CoordinatingAgencyPhone": "3145333406",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000086346,
      "SummaryText": "partcipation of the operators\n-Performance of a hazard review of equipment and procedures, including corrective action follow-up requirements\n-Implementation of an auditing and inspection program\n\nThe Chain of Rocks Water Treatment Plant additionally complies with the EPA RMP rules and follows Chlorine Institute and American Water Works Association standards for equipment, design and installation of chlorination equipment.\n\nG. Emergency Response Program\nThe Chain of Rocks Water Treatment Plant has an emergency response program, which includes the following measures:\n-Early warning, highly sensitive leak detection equipment\n-Written detailed emergency response plans\n-Plant alarms\n-Trained, in-house emergency responders\n-Protective gear and chlorine container repair kits on-site\n\nThe emergency response plan has been supplied to the City Fire Department.  Plant personnel notify local agencies when emergency response is needed.  Local agencies determine if the public needs to be notified.  If it is determined that the public needs to be notified, the local agencies have systems in place to perform the notification task.\n\nH.  Five-Year Accident History\nNo accidents in last five years\n\nI.  Planned Changes to Improve Safety\nThe City of St. Louis Water Division continually strives to continue to improve all operation procedures and duties in conjunction with public and employee health and safety.  We continue to use approved industry best practice standards in our quest for continuous improvement.  Some of these accepted industry standards are, but not limited to, American Water Works Association, Occupational Safety and Health Administration, The Chlorine Institute and the Handbook of Chemical Hazard Analysis Procedures."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000086346,
      "SummaryText": "ermining the distance from the point of release that an accidental release could pose a hazard to the public or the environment, and 2) identifying what is vulnerable within that distance.  To determine the distance over which releases could pose a hazard to the public or the environment, the EPA has established endpoint exposure concentrations.  The endpoint for chlorine is based on the American Industrial Hygiene Association (AIHA) Emergency Reponse Planning Guideline (ERPG)-2.  This value represents the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects of symptoms which could impair an individual's ability to take protective action.  The chlorine toxic endpoint used in offsite consequence analysis is 3 parts per million (0.0087 milligrams/liter).  The population potentially effected is defined as the population within a circle that has as its center point of release, and its radius equals that distance to the endpoint. The offsite consequence analysis for the Chain of Rocks Water Treatment Plant was conducted using the latest version of EPA's RMP*Comp atmospheric modeling software.\n\nF. Accidental Release Prevention Program\nThe Chain of Rocks Water Treatment Plant has implemented a comprehensive program to prevent accidental releases.  Designed to reduce both the likelihood and severity of releases of chlorine, this program integrates technologies, procedures and management practices.  This prevention program ensures that safe handling principles as well as ensuring proper operation, maintenance and control of hazards.  The Chain of Rocks Water Treatment Plant accidental release prevention program is based on the following key elements:\n-High levels of operator training\n-Preventive maintenance program is in place to ensure mechanical integrity\n-Use of accurate and effective operating procedures, written with the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000086346,
      "SummaryText": "ks Plant complies with this regulation, as well as others, to ensure that the risks involved in handling, use and storage of chlorine and other potentially hazardous chemicals are minimized.\n\nD. Risk Management Plan\nWe recognize there are risks associated with handling and using chlorine.  We have been, and will continue, working very hard to minimize these risks.  Our Risk Management Plan is the latest step in our continuing efforts to improve the safety of our plant.  The Water Division has conducted hazard reviews and has implemented an accidental release prevention program which integrates technologies, procedures and management practices.  Additionally, the Chain of Rocks Plant has trained employees for emergency response and maintains an Emergenency Response Plan which has been supplied to the St. Louis City Fire Department.  These programs enable the Chain of Rocks Plant to prevent the occurence, and minimize the consequences of hazardous releases of chlorine.\n\nE. Offsite Consequence Analysis\nUnder the RMP rule, the Chain of Rocks Water Plant is required to conduct and document an offsite consequence analysis, which includes consideration of two chlorine release scenarios, identified as a worst-case release scenario and an alternative release scenario.  The first scenario is defined by EPA as the maximum quantity in the largest vessel...released as a gas over 10 minutes during worst-case weather conditions (no wind, low humidity), due to an unspecified failure.  This worst-case scenario assumes that all safety systems fail and that there is no emergency respose.  The alternative release scenario is a different, more realistic scenario, which depicts a failure defined by the facility.  In the alternative release scenario, facilities are allowed to include active mitigation systems in calculating the distance that an accidental release of this type could pose as a hazard to the public or the environment.\n\nThe offsite consequence analysis is done by 1) det"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000086346,
      "SummaryText": "A. Chain of Rocks Water Treatment Plant\nThe Water Division is a branch of the City of St. Louis Department of Public Utilities.  We have proudly invested in and served the greater St. Louis Metropolitan area since 1835.  The Water Division's Chain of Rocks Water Treatment Plant has been providing safe, clean drinking water to city customers since 1894.  The plant is located on the Mississippi River near the Chain of Rocks Bridge in the City of St. Louis, Missouri.\n\nB. Chlorine\nAt the Chain of Rocks Water Treatment Plant, we have used chlorine as a part of the treatment process that provides our community with safe drinking water for more than 80 years.  Chlorine is the most widely used disinfectant.  It has been safely used to disinfect drinking water for nearly 100 years.  Water supply disinfection has virtually eliminated incidences of waterborn diseases such as cholera, typhoid, and dysentery and is credited with increasing American's life expectancies by more than 50 percent.\n\nChlorine is a greenish-yellow gas with a pungent, irritating odor similar to bleach and is toxic in certain concentrations.  Chlorine exists as a gas at ambient temperature and pressure, but comes to us under pressure in a liquid state.  It is converted to gas in our process equipment.  We receive chlorine in DOT-approved one-ton containers transported by truck.  The containers are unloaded from the truck and stored securely within a dedicated facility fully protected by a scrubber system.\n\nC. Environmental, Health and Safety Policy\nWe have long understood the hazards of handling chlorine, which, if not handled properly, can pose a risk to the community.  It is the Water Division's policy to conduct our business in accordance with all applicable environmental, health, and safety laws and regulations and to promote a healthful, safe, and protected environment.  The chlorine process at the Chain of Rocks Plant is regulated by the U.S. EPA Risk Management Program (RMP) Rule.  The Chain of Roc"
    }
  ]
}