{
  "FacilityID": 1000100252,
  "FacilityName": "Enterprise Todhunter Terminal",
  "FacilityStr1": "3590 Yankee Road",
  "FacilityStr2": null,
  "FacilityCity": "Middletown",
  "FacilityState": "OH",
  "FacilityZipCode": "45044",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39017",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "39.464487",
  "FacilityLongDecDegs": "-84.396985",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Enterprise Terminals and Storage, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Enterprise Products Operating LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 12,
  "OtherEPAFacilityID": "OHD071281984",
  "EPAFacilityID": "100000178005",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-05-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "2007 EPCO Re-submission Correction",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-03-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-03-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-03-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-03-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 39.46102,
  "FRS_Long": -84.3978,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000124063,
      "AltID": "LPG Dehydration & Loading",
      "FacilityID": 1000100252,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000155012,
          "ProcessID": 1000124063,
          "ChemicalID": 98,
          "Quantity": 1200000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000155013,
          "ProcessID": 1000124063,
          "ChemicalID": 105,
          "Quantity": 17000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000125475,
          "ProcessID": 1000124063,
          "NAICSCode": "488999",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000100252,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Monroe Fire Department",
    "CoordinatingAgencyPhone": "5135398380",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000100252,
      "SummaryText": "rage."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000100252,
      "SummaryText": "nformation\r\n\r\nThe Todhunter Terminal maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the terminal facilities.   \r\n\r\nThe overall emergency procedure program for the Todhunter Terminal is coordinated with the Butler County Local Emergency Planning Committee (LEPC). This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials and industry representatives. The Todhunter Terminal has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. In addition to periodic LEPC meetings, the Todhunter Terminal conducts periodic emergency drills that involve the LEPC and emergency response organizations, and the Todhunter Terminal provides periodic refresher training to local emergency responders regarding the hazards of regulated substances in the plant. \r\n\r\nPlanned Changes to Improve Safety\r\n\r\nThe Todhunter Terminal resolves all findings from PHAs, some of which result in modifications to the process.  Other recommendations for possible changes to improve safety come from periodic accident prevention program audits, incident investigations, or employee suggestions and recommendations.  The following changes are planned for implementation at the Todhunter Terminal.\r\n\r\n* Project for the installation of emergency shut down valves on incoming pipelines to guard against overfilling of sto"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000100252,
      "SummaryText": "required at non-PSM and/or RMP Program 1 facilities (e.g. Safe work practice training; safe work permitting and hot work permitting).\r\n\r\nUniversal Prevention Activities\r\n\r\nThe accident prevention program summarized previously is applied to all RMP covered processes at Todhunter Terminal.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\r\n\r\nSpecialized Safety Features\r\n\r\nThe Todhunter Terminal has safety features on many units to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\r\n\r\nRelease Detection\r\n\r\n*Hydrocarbon (hazardous gas) detectors and alarms\r\n*Plant video surveillance system\r\n\r\nRelease Containment and Control\r\n\r\n*Process relief valves that discharge to a flare to capture and incinerate episodic releases.\r\n*Valves to permit isolation of the process (manual or automated).\r\n*Automatic shutdown systems for specific process parameters (e.g., high temperature).\r\n*Curbs or dikes to contain liquid releases.\r\n*Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system)\r\n*Dual mechanical seals with seal failure alarms on hydrocarbon liquid pumps, where feasible. \r\n\r\nRelease Mitigation\r\n\r\n*Hand-held fire extinguishers\r\n*Personnel trained in emergency response and procedures.\r\n*Personnel protective equipment (e.g., chemical protective clothing, self-contained breathing apparatus, etc.)\r\n\r\nFive Year Accident History\r\n\r\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\r\n\r\nThis facility has not had an accidental release in the last five years which meets the criteria set forth in 40 CFR 68.10.\r\n\r\nEmergency Procedures I"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000100252,
      "SummaryText": "eral OSHA 29 CFR 1910.119 and 40 CFR Part 68.  We have entered the facility as an RMP Program Level 1 facility.\r\n\r\nToxics\r\n\r\nThere are no toxic materials contained on site above the threshold limits.\r\n\r\nFlammables\r\n\r\nThe Todhunter Terminal was evaluated to determine if any regulated flammable substances exceeded the threshold quantity.  Enterprise identified the regulated substances and quantities to be kept on site based on the process design of the proposed process vessels. Listed flammable substances which are present above the threshold quantities at the Todhunter Terminal are propane, normal butane, and ethyl mercaptan.  Due to the presence of regulated flammable materials above the threshold quantity, the Todhunter Terminal is being registered as an EPA Risk Management Program 1 facility.\r\n\r\nOffsite Consequence Analysis Results\r\n\r\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.\r\n\r\nGeneral Accidental Release Prevention Program\r\n\r\nThe following is a summary of the accidental release prevention program in place at Todhunter Terminal.  The process at the facility is regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation (Program 1).  Release prevention is provided through the use of written operating procedures, employee training in written procedures, including normal operation and emergency release procedures, and in the design of safety and release prevention equipment installed at the terminal site.  In addition, a written safety program designed to comply with all applicable OSHA safety performance regulations is strictly enforced at all Enterprise facilities, including the Todhunter Terminal facility.  As part of the Enterprise safety program, the facility utilizes procedures that are included in the Enterprise program, but may not specifically be"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000100252,
      "SummaryText": "Todhunter Terminal\r\nEnterprise Products Operating LLC\r\nExecutive Summary Risk Management Plan\r\nEPA Identifier: 1000 0017 8005 \r\n\r\nAccidental Release Prevention and Response\r\n\r\nAt Enterprise, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\r\n\r\n* A description of our facility and use of substances regulated by EPA's RMP regulation\r\n* An overview of our accidental release prevention programs\r\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\r\n* An overview of our emergency response program\r\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\r\n\r\nDescription of the Stationary Source and Regulated Substances\r\n\r\nTE Products Todhunter Terminal located in Butler County, Ohio at 3590 Yankee Road, Middletown Ohio 45044 (Figure 1).  \r\nThe Todhunter Terminal is a bulk distribution and storage facility consisting of atmospheric and pressurized storage tanks.  Various petroleum fluids, such as jet fuel, are transmitted from upstream producers to downstream customers.  A four bay loading rack is used for loading of petroleum products to trucks at the facility but only for propane and Ethyl Mercaptan. Products are received via the P-2, A1, and P43 Pipelines.  The facility formery operated an NGL fractionation unit which has ceased operations, been de-inventoried, and is air gapped from the rest of the facility. \r\n\r\nThe LPG Dehydration and Loading process is regulated by Fed"
    }
  ]
}