{
  "FacilityID": 1000000277,
  "FacilityName": "Helena Chemical Company - Seymour, IA Facility",
  "FacilityStr1": "County S-60 & East Garden Road",
  "FacilityStr2": null,
  "FacilityCity": "Seymour",
  "FacilityState": "IA",
  "FacilityZipCode": "52590",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19185",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "40.667130",
  "FacilityLongDecDegs": "-093.113758",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7036759,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Chemical Company",
  "OperatorStr1": "120 South Fourth Street",
  "OperatorStr2": null,
  "OperatorCity": "Seymour",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52590",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Ryan",
  "RMPTitle": "Operations Manager",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000163896",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-09-22 00:00:00",
  "SafetyInspectionBy": "Iowa Department of Agriculture and Land Stewardshi",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-03-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-04-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-04-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-04-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.68075,
  "FRS_Long": -93.11975,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000310,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 1000000277,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000000343,
          "ProcessID": 1000000310,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000323,
          "ProcessID": 1000000310,
          "ChemicalID": 56,
          "Quantity": 242861.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000500323,
          "ProcessID": 1000000310,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000277,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThe Helena Chemical Company (Helena) Seymour Facility has submitted this updated electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68. Standards codified by the Occupational Safety and Health Administration at 29 CFR 1910.119 are not applicable to the operations at this facility because the facility is operated as a retail operation and is exempt from the OSHA standards.  However, the OSHA standards at 29 CFR 1910.111, Storage and Handling of Anhydrous Ammonia, are applicable and are included in the Risk Management Program (RMPr) document that is implemented by this Facility.\n\n\n\nThis electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Seymour Facility located approximately one (1) mile south of Seymour and approximately 0.1 mile east of intersection County Road S60 and East Garden Road.  This Facility is at a location that is remote to the Seymour Office which is located at 120 South Fourth Street, Seymour, IA 52590.  The electronic RMP summarizes the policies and procedures implemented by the Seymour Facility to minimize the likelihood of an accident.  The electronic RMP also summarizes the actions that the Seymour Facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner.\n\n\n\nPURPOSE FOR UPDATING RMP\n\n\n\nHelena recently acquired this Facility and has submitted this 5-Year update to reflect the new ownership.  All relevant sections for a Program 2 RMP Facility have been reviewed and/or updated.  The updates are reflected in both the EPA RMP Submit report and the Facility Risk Management Plan Program Document (RMPr).\n\n\n\nFACILITY\n\n\n\nThe Seymour Facility is a retail agricultural chemical facility and operates one (1) covered process that includes Storage and Handling of anhydrous ammon"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000277,
      "SummaryText": "ia.  Anhydrous ammonia is transported to the Facility via a commercial tanker truck (9,600 gallon) and then transferred to one (1) 18,000-gallon stationary storage tank.  The commercial tanker truck operator (Vendor/Contractor) performs these transfer operations.  \n\n\n\nHelena stores the anhydrous ammonia in the on-site stationary storage tanks and then transfers the anhydrous ammonia from the storage tank to nurse tanks at point of retail sale to the end user (e.g. the farmer).  This Facility owns and operates (1) 10 1,500-gallon nurse tanks, (2) 17 1,000-gallon nurse tanks, and (3) 1 1,000-gallon double set nurse tanks.  Helena performs this operation in accordance with its RMPr accident prevention program.  \n\n\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\n\n\nWorst case and alternative case consequence analyses were completed for the one covered process that is conducted at this Facility.  The covered process includes anhydrous ammonia Storage and Handling.  \n\n\n\nThe worst case scenario release for the Retail Facility was the same for both covered processes and assumed that all the contents in the largest single storage tank were released.  For this Facility, the largest vessel is an 18,000-gallon stationary storage tank.  The release was modeled as if the ammonia tank was punctured on the side at the ground level. The resulting release of ammonia was modeled as a ground level horizontal jet.\n\n\n\nThe alternative (or more likely to occur) scenario was completed for the storage and handling covered process as well.  The alternative release for the Storage and Handling assumes a 2-minute release from a ruptured 3-inch transfer line caused by an impact from a vehicle or some other source on the liquid ammonia transfer line during a major loading or unloading operation.  Although this event is classified as an alternative scenario, even an accident of this type is unlikely to occur due to the safety equipment (excess flow devices and emergency shutoff valves) and operating procedures tha"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000277,
      "SummaryText": "t Helena uses to safeguard ammonia transfer operations.\n\n\n\nACCIDENT PREVENTION PROGRAM\n\n\n\nThe Operations Manager implements the risk management planning process at this Facility.  The Operations Manager is assisted by other Helena staff, as directed.  The Operations Manager is responsible for ensuring that Helena Staff are properly trained in the implementation of the Prevention Program which includes Safety Information, Hazard Analysis, Operating Procedures, Training, Maintenance, Compliance Audits, Incident Investigations, and Emergency Contingency Plans.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nHelena's Seymour Facility is a non-responding facility. Helena has coordinated emergency response activities with its local emergency response agency and local fire department.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Seymour Facility.\n\n\n\nCONCLUSION\n\n\n\nThe Risk Management Plan implemented by Helena Chemical Company at the Seymour\n\nFacility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Seymour Facility adds, deletes, or changes processes. The Emergency Response Program has been coordinated with the Wayne County LEPC and Seymour Fire Department.\n\n\n\nNOTE: Sections 4, 5, 6, and 7 of the standard RMP produced by EPA's RMP Submit Program are not applicable to the Seymour Facility.\n\n"
    }
  ]
}