{
  "FacilityID": 1000001008,
  "FacilityName": "Eckert Cold Storage (Escalon)",
  "FacilityStr1": "905 Clough Road",
  "FacilityStr2": null,
  "FacilityCity": "Escalon",
  "FacilityState": "CA",
  "FacilityZipCode": "95320",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.780250",
  "FacilityLongDecDegs": "-120.996222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pete Thompson",
  "OperatorStr1": "905 Clough Road",
  "OperatorStr2": null,
  "OperatorCity": "Escalon",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95320",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ed Perez",
  "RMPTitle": "Environmental/Safety Officer",
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000162398",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-02-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.7796,
  "FRS_Long": -120.99625,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001243,
      "AltID": "Cooler System",
      "FacilityID": 1000001008,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001326,
          "ProcessID": 1000001243,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001293,
          "ProcessID": 1000001243,
          "ChemicalID": 56,
          "Quantity": 3800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501293,
          "ProcessID": 1000001243,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000001244,
      "AltID": "West System",
      "FacilityID": 1000001008,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001327,
          "ProcessID": 1000001244,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001294,
          "ProcessID": 1000001244,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501294,
          "ProcessID": 1000001244,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000001245,
      "AltID": "Production System",
      "FacilityID": 1000001008,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001328,
          "ProcessID": 1000001245,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001295,
          "ProcessID": 1000001245,
          "ChemicalID": 56,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501295,
          "ProcessID": 1000001245,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001008,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Eckert Cold Storage - Escalon facility maintains the ammonia refrigeration systems using in-house maintenance personnel.  The systems are checked on a regular basis to ensure it is functioning properly and in good repair.\n\nThe facility has an emergency evacuation plan that includes ammonia leaks.  If an ammonia leak or an alarm indicating an ammonia leak is observed by facility personnel, the decision to evacuate the building is made by management.  Professional emergency responders are called to assist with the ammonia leak as necessary. \n\nThe management at Eckert Cold Storage is committed to safety.  The emergency action plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe ammonia refrigeration systems at 905 Clough Road in Escalon, California was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes at the time of construction.  \n\nThe ammonia refrigeration systems are closed systems that cycle the refrigerant from liquid to gas and back again.  The facilityA?s three independent refrigeration systems, consisting of vessels, piping, valves, and process equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for dock operations, cooler and freezer storage.  The West System, Production System, and Cooler Storage System each use 18,512 pounds, 23,850 pounds, and 3,750 pounds of ammonia, respectively. The majority of the systems are located in the engine rooms including vessels and compressors.  The condensers are mounted on the roof, and t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001008,
      "SummaryText": "he evaporators are located in their respective cold storage areas.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Eckert Cold Storage ammonia refrigeration systems have many safety features.  Much of the safety of the systems is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with Cal/OSHA's Process Safety Management regulation.  The facility conducts maintenance and any necessary repairs in house.\n\nThe facility including the ammonia systems was designed and constructed in accordance with the Uniform Mechanical Code, which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors in the engine rooms as well as sensors near the evaporators, and automatic shut down systems.  In addition, the majority of the ammonia is maintained inside the engine rooms and just outside of the engine rooms (vessels and condensers).  All pressure vessels are equipped with pressure relief valves that are commonly piped.  These pressure relief valves in the West System and Production System vent to a water tank, while the relief valves in the Cooler Storage System vent to the atmosphere.\n\nIn addition to the Uniform Mechanical Code, Eckert Cold Storage has developed a preventive maintenance program to complete regularly scheduled inspections and tests of the ammonia refrigeration systems as well as repairs as needed to process equipment.\n\nEMERGENCY ACTION PLAN\n\nThe Eckert Cold Storage facility has an emergency response plan in effect.  The Emergency Action Plan (Plan) has been developed by Eckert Cold Storage and is included in the Emergency Planning and Response section of the PSM/RMP/CalARP document which is maintained at the facility.  This Plan was designed to meet the following objectives:\n\n  1.) To save lives.\n  2.) To minimize and avoid injuries.\n  3.) To protect the environment.\n  4"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001008,
      "SummaryText": ".) To minimize property damage.\n\nThe Eckert Cold Storage facility maintains a safety committee whose members include the designated incident commander for the facility and the maintenance department at a minimum.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan is reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations, as well as to incorporate facility changes.\n\nEckert Cold Storage is non-responding and the facility plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThe Eckert Cold Storage A? Escalon facility has had one reportable ammonia release in the last five years (May 2004-May 2009).  The facility had a release of 400 pounds of ammonia from the Cooler Storage System.  Approximately 400 pounds of ammonia was released from the pressure relief valve on the High Pressure Receiver.  An investigation into the incident revealed that the water pump on the Condenser failed, causing the pressure to rise.  The high pressure cutout on the compressor failed to activate, and eventually the relief valve on the High Pressure Receiver actuated.  A pressure of 250 psig was observed by the operator on the pressure gauge.  The operator shut down the compressors and a valve to stop the release.  The San Joaquin County OES and the National Response Center were notified.  There were no injuries resulting from the ammonia release.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazards Analysis Revalidation study (performed on April 29, 2009), including a Hazard and Operability (HAZOP) study and a Facility Inspection, provided mitigation measures to improve safety at the Eckert Cold Storage facility located"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000001008,
      "SummaryText": " at 905 Clough Road in Escalon, California. The Eckert Cold Storage safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n1. Continue to train all employees in the facility safety plan/programs.\n\n2. Continue to have employee involvement in safety plan development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n"
    }
  ]
}