{
  "FacilityID": 1000084368,
  "FacilityName": "Linde - Niagara Falls, NY",
  "FacilityStr1": "4501 Royal Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Niagara Falls",
  "FacilityState": "NY",
  "FacilityZipCode": "14303",
  "Facility4DigitZipExt": "2121",
  "FacilityCountyFIPS": "36063",
  "LEPC": "Niagara County LEPC",
  "FacilityLatDecDegs": "43.086838",
  "FacilityLongDecDegs": "-079.012596",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.linde.com",
  "FacilityEmailAddress": "info@linde.com",
  "FacilityDUNS": 135890101,
  "ParentCompanyName": "Linde Inc.",
  "Company2Name": null,
  "CompanyDUNS": 197154586,
  "Company2DUNS": 0,
  "OperatorName": "Linde Inc.",
  "OperatorStr1": "4501 Royal Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Niagara Falls",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14303",
  "OperatorZipCodeExt": "2121",
  "RMPContact": "Justin Betts",
  "RMPTitle": "Facility Director, Operations",
  "FTE": 95,
  "OtherEPAFacilityID": "NYD980526875",
  "EPAFacilityID": "100000108402",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-07-19 00:00:00",
  "SafetyInspectionBy": "Niagara Falls Fire Dept.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-06-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-01-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-01-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.08333,
  "FRS_Long": -79.01025,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "55",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105375,
      "AltID": "Hydrogen Production",
      "FacilityID": 1000084368,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000106687,
          "ProcessID": 1000105375,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131919,
          "ProcessID": 1000105375,
          "ChemicalID": 149,
          "Quantity": 511399.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000631919,
          "ProcessID": 1000105375,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084368,
      "SummaryText": "Facility Description\n\n\n\nLinde's Niagara Falls, New York facility has two plants that produce liquid oxygen, nitrogen, argon, and gaseous nitrogen; and one plant that produces gaseous hydrogen; and two plants that produce liquid hydrogen.  The atmospheric products [oxygen, nitrogen, and argon] are separated cryogenically from the air. Hydrogen gas is produced by two different processes.  For the first process, hydrogen feedstock gas is purchased from Occidental Chemical (OxyChem) and Olin via pipeline from their neighboring facilities.  Hydrogen gas is a by-product of our suppliers' chlor-alkali manufacturing processes.  Trace impurities of water, oxygen and nitrogen are removed.  In the second process, hydrogen is produced by steam-methane reforming which was installed in 2014 and put into service in 2015.  Pure hydrogen gas from both processes, is compressed, liquified, and stored in two insulated spherical cryogenic storage tanks.  The liquid hydrogen is then transfilled into insulated containers to maintain its liquid state, and transported via truck to customers all across the eastern United States and Canada.  The facility, which is staffed and operated on a continuous basis, was originally built in 1980.\n\n\n\nRegulated Substances\n\n\n\nThis facility uses, manufactures, and stores liquid hydrogen, a chemical listed in part 68 of Title 40 of the Code of Federal Regulations, beyond a threshold quantity as established by the EPA.\n\n\n\n\n\n\n\nAccidental Release Prevention Policy\n\n\n\nLinde is dedicated to being the best performing industrial gas company in all aspects of our business, including safety, health, and environmental affairs. Our safety, health, and environmental policy calls for a commitment to protecting the health and safety of our employees, neighbors, and the surrounding environment. This policy is the basis for engineering and construction programs that produce equipment and process systems that minimize the possibility of accidental chemical releases and oper"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084368,
      "SummaryText": "ational safety programs that ensure safe operation of our facilities. Linde is committed to the continuous improvement of these programs.\n\n\n\nLinde is an active member of the American Chemistry Council and subscribes to the council's program of Responsible CareA&reg; Employee Health and Safety Code of Management Practices.\n\n\n\n\n\n\n\nPrevention Program\n\n\n\nIn accordance with OSHA's Process Safety Management standard and EPA's Risk Management Program rule, the Niagara Falls NY facility has a comprehensive accident prevention program in place. This program is built around process safety concepts such as:\n\n\n\n- Technical documentation of Process Safety Information, describing the physical properties of the hazardous substances, the safety systems in place to control these substances, and the critical operating parameters of the associated equipment and systems;\n\n- Procedures and programs to develop, maintain, and control key program elements such as process operations, equipment mechanical integrity, employee training, management of change, hot work permits, incident investigation, and contractor activity; and \n\n- Initial and periodic review of new or modified processes through application of comprehensive design safety and management of change programs that include Process Hazard Analysis study and pre-startup review. \n\n\n\nLinde has an employee participation program that promotes involvement in the process safety program and helps ensure understanding of facility-specific elements of the safety program.\n\n\n\nThe prevention program is audited periodically, by our corporate assessment group, to ensure that the process safety concepts and practices are in place and working effectively.\n\n\n\n\n\nChemical-specific Prevention Steps\n\n\n\nIn addition to the required prevention program elements, we have implemented extensive safety features specific to the covered process at our facility. Following is a description of some of these safety features.\n\n\n\nFor hydrogen, the facility has automated "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084368,
      "SummaryText": "chemical monitoring, alarm, and/or isolation systems in each compressor building, both liquifiers, steam-methane reformer, and the trailer filling area.  Both area and plant Plant Emergency Trip systems are strategically placed both inside and outside the production areas to manually shut down and electrically isolate sections or entire plants as required.  Active mitigation control, consisting of several hundred automated alarm and several dozen shutdown systems, exist to protect either feedstock supply, each hydrogen compressor or turbine, the storage tanks, and many pieces of auxiliary equipment.  A new distributed control system, using the latest security protocols, enables employees to access the entire facility from multiple locations.  Numerous \"double block and bleed\" manual isolation systems also exist to provide positive isolation of hydrogen when necessary.\n\n\n\n\n\nFive-year Accident History\n\n\n\nThe Niagara Falls hydrogen facility did not experience any EPA RMP  events over the last five years.  \n\n \n\nEmergency Response Programs\n\n\n\nLinde has an emergency response program in place to minimize the effects of accidental release of regulated substances on employees, the public, and the environment. The Niagara Falls location will be a \"non-responding facility\" as defined in section 8.1 of the CEPPO General Guidance for Risk Management Programs (July 1998), i.e. Linde employees will respond to minor incidents.\n\n\n\nFor other than minor incidents Linde has in place an emergency response plan in coordination with the Niagara County Local Emergency Planning Committee (LEPC) and the City of Niagara Falls Fire Department (NFFD).  Linde is a participating member of the LEPC.  The NFFD is given a detailed tour of the facility annually.\n\n\n\nAll facility employees are trained in their role in the emergency plan and emergency drills are conducted at least annually.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nLinde has a commitment to safety that is expressed in a company-wide goa"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084368,
      "SummaryText": "l of \"Zero/Zero\", which means zero accidents and zero injuries or illnesses at each and every location. We look to constantly improve the safety of our processes using recommendations developed through the prevention program and a program soliciting safety suggestions from our employees.\n\n\n\nThere are currently no major projects for safety improvements that have reached the planning stage.  "
    }
  ]
}