{
  "FacilityID": 1000089046,
  "FacilityName": "HMC Cold Storage",
  "FacilityStr1": "13138 S. Bethel",
  "FacilityStr2": null,
  "FacilityCity": "Kingsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "93631",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "County of Fresno",
  "FacilityLatDecDegs": "36.545000",
  "FacilityLongDecDegs": "-119.572500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "HMC",
  "OperatorStr1": "13138 S. Bethel Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Kingsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93631",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Stalker",
  "RMPTitle": "Plant Manager",
  "FTE": 32,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000139593",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-11-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-08-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-08-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-08-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-08-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.54491,
  "FRS_Long": -119.57485,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110789,
      "AltID": "Ammonia Refrig Storage1",
      "FacilityID": 1000089046,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000112081,
          "ProcessID": 1000110789,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000138437,
          "ProcessID": 1000110789,
          "ChemicalID": 56,
          "Quantity": 38972.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000638437,
          "ProcessID": 1000110789,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000110790,
      "AltID": "Ammonia Refrig Storage 2",
      "FacilityID": 1000089046,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000112082,
          "ProcessID": 1000110790,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000138438,
          "ProcessID": 1000110790,
          "ChemicalID": 56,
          "Quantity": 15220.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000638438,
          "ProcessID": 1000110790,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089046,
      "SummaryText": " Executive Summary\n\n\n\nIntroduction\n\nThe Risk Management Program at HMC Cold Storage complies with US EPA, OSHA and Cal ARP Program 3 requirements for 2 seasonal cold storage facilities at its rural Kingsburg location. This submission is a 5 year update. There have been only minor changes at HMC Cold Storage since the last update. Both of these facilities do post harvest processing of fruits and vegetables seasonally in a rural industrial area of Central California.\n\n\n\nThere are 2 separate cold storages and independent Ammonia refrigeration processes at this site. The larger and oldest Facility #1 was completed in 1988 and expanded in 2003. A new storage facility and independent NH3 refrigeration system was completed in June 2000 located 500A? south of the existing cold storage. Since they are totally separate facilities with no interconnection of refrigeration systems they are treated as separate processes. Facility #1 is a larger system with NH3 operating capacity of 25,287 lbs.. Facility #2 has an NH3 operating capacity of 12,900 lbs.. Facility #1 is used for the Worst Case scenario and the Alternate release scenario of a compressor shaft seal failure would apply to either system.\n\n\n\nExternal Events analysis and Seismic Walk-down was part of the 2013 PHA revalidation. The rural location does not present any unusual external events. All of the NH3 charge is stored in the High Pressure Receivers in locked mechanical rooms during the seasonal shut-down. The facility is staffed year round, has security and is fenced. Remote monitoring, operation and call-out alarms operate continuously. All facility storm drains collect in a ponding basin on-site. Pressure Relief valves discharge to diffusion tanks for neutralization and emergency ventilation fans provide non-hazardous classification for the mechanical rooms. Recent training and coordination of emergency actions with the local Fire Department has been conducted recently.\n\n\n\n\n\nPublication or sharing of OCA portions of "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089046,
      "SummaryText": "RMP materials can be in violation of the Chemical Safety Information, Site Security and Fuels Regulatory Relief Act (PL106-40). \n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\nWe at HMC Cold Storage are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass Packing and storage of fresh produce.  We have 1 regulated substance present at our facility above threshold minimums.  This substance is Ammonia (anhydrous) used as a refrigerant in a closed loop refrigeration system.\n\n\n\n\n\n3.    The Worst Case Release Scenario(s) and the Alternative Release Scenario(s) details have been eliminated from this Executive summary as directed in RMP April 2004 changes. The Worst case scenario is not considered feasible and has minimal impacts due to the rural location. The alternate case selected reaches the property line and surrounding orchards as required.\n\n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  Both facilities meet or exceed 1997 building, mechanical and fire codes including applicable seismic. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nHMC Cold Storage maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment des"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089046,
      "SummaryText": "igns associated with all processes.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What If/Checklist (combined).  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA revalidation was performed in 2008. All possible conditions that could upset the system and natural disasters like fire and earthquake were considered.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, HMC Cold Storage maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nHMC Cold Storage has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every 3 years and more frequently as needed. Tests or demonstrations are provided to insure understanding and competence.\n\n\n\nMechanical Integrity\n\nHMC Cold Storage carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, ammonia detection system, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in mainte"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000089046,
      "SummaryText": " information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nHot Work Permit\n\nAt HMC Cold Storage Hot Work Permit procedures are in place and enforced. Preventing accidents related to welding and cutting while alerting others at the facility that this type of work is occurring are important prevention steps.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Follow-up evaluations are also done periodically to determine if there have been any changes. HMC Cold Storage has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n\n\n5.    Five-year Accident History\n\nHMC Cold Storage has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n\n6.    Emergency Action Plan\n\nHMC Cold Storage carries a written emergency action plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency actions including discovery, evaluation, defensive actions for mitigation, adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\nTo ensure proper functioning, our personal protection equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nCounty of Fresno is the Loca"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089046,
      "SummaryText": "nance practices.  All line-opening is performed by a qualified refrigeration contractor.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at HMC Cold Storage to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at HMC Cold Storage.  reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nHMC Cold Storage conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted in 2008.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nHMC Cold Storage promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nHMC Cold Storage truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000089046,
      "SummaryText": "l Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified. We have also coordinated with the local fire department.\n\n\n\n7.    Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Easier access to critical isolation valves, training, additional labels and SRV discharge piping changes to meet industry recommendations are some of the major steps we are planning to improve safety at our facility.  These changes are expected to be implemented by 2011.\n\n"
    }
  ]
}