{
  "FacilityID": 1000111282,
  "FacilityName": "Church & Dwight Co., Inc.",
  "FacilityStr1": "110 E. Jones Road",
  "FacilityStr2": null,
  "FacilityCity": "Fostoria",
  "FacilityState": "OH",
  "FacilityZipCode": "44830",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39147",
  "LEPC": "Seneca County LEPC",
  "FacilityLatDecDegs": "41.166917",
  "FacilityLongDecDegs": "-083.400167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.churchdwight.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1211952,
  "ParentCompanyName": "Church & Dwight Co., Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1211952,
  "Company2DUNS": null,
  "OperatorName": "David Johnston",
  "OperatorStr1": "P.O. Box 122",
  "OperatorStr2": null,
  "OperatorCity": "Old Fort",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44861",
  "OperatorZipCodeExt": null,
  "FTE": 55,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000206314",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-01-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-04-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-04-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-04-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-04-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.18142,
  "FRS_Long": -83.41086,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1000",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "0",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000138669,
      "AltID": "Aerosol Product Storage",
      "FacilityID": 1000111282,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000173511,
          "ProcessID": 1000138669,
          "ChemicalID": 155,
          "Quantity": 1562400.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000154687,
              "ProcessChemicalID": 1000173511,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000154686,
              "ProcessChemicalID": 1000173511,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000154685,
              "ProcessChemicalID": 1000173511,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000140162,
          "ProcessID": 1000138669,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000111282,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-12-29 00:00:00",
    "ERTrainingDate": "2023-12-29 00:00:00",
    "CoordinatingAgencyName": "Fostoria Fire Dept.",
    "CoordinatingAgencyPhone": "4194353206",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000111282,
      "SummaryText": "RMP Executive Summary \n\nJason Trausch, EHS Manager\n\n\n\nSUBJECT:\tAerosol Can Risk Management Plan\n\t\tChurch & Dwight Co., Inc\n                Fostoria, OH Distribution Center\n\nHazard Assessment/Worst Case Scenario Analysis\n\nBackground\n\nChurch & Dwight Co. Inc.(C&D) is engaged in the manufacture and sale of a diversified line of consumer and health care products.  The Fostoria DC location consist of warehouse storage and shipping areas for the full line of C&D consumer products.  There are no other manufacturing operations at this location.  \n\nFacility Description\n\nThe Fostoria DC operation is affected by the Risk Management Plan (RMP) involve the receipt and storage of aerosol product in consumer size containers.  Product is received in palletized cases via trailer truck at site loading docks.  The product is moved within the warehouse to a designated aerosol storage room location via forklift trucks.  Aerosol product is removed from the warehouse via forklift truck and loaded onto trailers for shipment to customers.  Pallets may be broken down by hand and cases re-palletized to accommodate less than full pallet orders.\n\nVarious hydrocarbons are used as propellants in the finished good aerosol products stored in the warehouse.  Hydrocarbon propellants are defined by the US Environmental Protection Agency (USEPA) as hazardous materials.  USEPA enforces regulations designed to minimize the potential for accidental release associated with the handling of hazardous materials.  Additionally, US Occupational Safety & Health Administration (OSHA) enforces accident prevention regulations to protect employees.  The aerosol product propellants are listed as hazardous due to flammability.  The aggregate volume of flammable mixture in the Level II and Level III aerosol can inventory will exceed the RMP threshold.\n\nAccident History\n\nThe Fostoria DC has no history of accidental releases associated with the regulated hazardous materials.\n\nPrevention Programs\n\nIn accordance with USEPA"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000111282,
      "SummaryText": "regulation and results of the hazard assessment, the Church & Dwight Distribution Centers are classified as a Program Level 1 facility.  Program Level 1 facilities are considered by USEPA to present minimal risk to the community.\n\nC&D has developed programs to comply with the required environmental, health and safety standards.  C&D takes a systematic, proactive approach to preventing accidental releases of hazardous chemicals through process management systems and programs which include:\n\tEmployee Participation\n\tProcess Safety Information\n\tProcess Hazard Assessment\n\tOperating Procedures\n\tOperator Training\n\tMechanical Integrity\n\tManagement of Change\n\tPre-Start up Review\n\tContractor Safety\n\tHot Work Permits\n\tAccident Investigation\n\tCompliance Audits\n\nIn addition to C&D's management programs, specially designed systems to control, prevent, detect, and mitigate potential accidental releases are also in place.  These include an aerosol storage room designed to NFPA requirements with a high capacity sprinkler system and a fire pump. No storage racks are used to store aerosol products and product is floor stacked to further mitigate aerosol flammability accidents.  All C&D forklift operators are trained and certified.  The firewater and sprinkler systems are inspected and tested quarterly by an outside independent company. Safety and emergency training of employees is conducted regularly\n\nEmergency Preparedness and Response\n\nC&D has an emergency plan detailing procedures to respond to accidental releases and other emergencies.  The plan is tested on a regular basis through exercises and drills.  The plan is shared with the local Fire Department and county Emergency Services, as appropriate for the warehouse location.  In the event of an emergency affecting the local community, C&D will work closely with the local, county, and state agencies to ensure public safety.  These agencies take the lead in informing the public on appropriate actions in the event of an emergency"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000111282,
      "SummaryText": "Planned Changes to Improve Safety\n\nC&D strives for continuous improvement of its safety programs.  C&D trains our employees to safely perform their assigned tasks.  C&D encourages its employees to suggest improvements or changes that will help minimize the potential for unanticipated failure of programs and equipment, including forklift trucks.  The system and programs are routinely audited, typically by an outside company, to evaluate effectiveness and identify areas for improvement.\n \n\nHazard Assessment\nAerosol Storage in Warehouse\nChurch & Dwight Co., Inc. \nWorst Case Scenario (WCS) Analysis\n\n\n1.\tBACKGROUND/APPLICABILITY\n1.1.\tCovered Material\nThe aerosol storage area at Fostoria's Distribution Center (DC) is subject to the requirements of the USEPA's Risk Management Program (RMP) and OSHA's Process Safety Management Program (PSM).\nThe facility may store, at any one time, greater than 10,000-lbs., in aggregate, of aerosol product.  The only aerosol product stored is a aerosol dry shampoo.  \n\n1.1.1.\tAerosol dry shampoo\nThe aerosol dry shampoo contains a custom propellant blend containing:\nFlammable Mixture\t\t% Weight\t\tCAS No.\nn-Butane\t\t\t               40-50%\t\t\t106-97-8\nIsobutane\t\t\t               15-25%\t\t\t75-28-5\nPropane\t                               10-20%\t\t\t74-98-6\nn-Butane,  isobutene, and propane are listed as regulated flammable materials in the USEPA's RMP program.  The mixture also also contains approximately 5% ethyl alcohol by weight.  Additionally, each mixture has a flash point below 100 degree F, and is therefore also subject to OSHA's PSM program.\nFlammable mixtures are subject to the RMP if there is a regulated flammable substance in the mixture above 1%, and the entire mixture meets the NFPA-4 criteria.  If the mixture meets both these criteria, you must include the total weight of the mixture (not just the regulated substance) in the threshold determination.\nNFPA-4 definition is: \n\"Material that will rapidly or completely vaporize at atmospheric pre"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000111282,
      "SummaryText": "ssure and normal ambient temperature or that are readily dispersed in air, and that will burn readily.\"\nBased on this definition the referenced mixtures would meet the flammable mixture requirement.\nThe covered process includes receipt, storage, and distribution of aerosol cans, which contain flammable propellants.\n\n1.2.\tThreshold Quantity\nThe following analysis was completed to determine whether the 10,000 pounds threshold quantity for RMP and PSM would be exceeded.\nThe contents of each container contain a flammable mixture with greater than 1% of a listed flammable material, and an NFPA rating of 4.  Therefore the entire weight of the mixture inside the can must be used in determining threshold quantity.\n\t\n1.2.1\tAerosol dry shampoo\nThe largest single container in the process is a 200 ml can (123 gram max fill weight) of product.  Each can contains 86.9% propellant by weight.  An estimate of the quantity of flammable propellant per pallet of product is:\n\t200 ml can = 123 grams/can\n\t123 grams (86.9%) = 106.9 grams propellant/can\n\tBecause >1% - count 123 grams/can\n\t6 cans /case = 738 grams flammable material/case\n\t400 cases/pallet = 295,200 grams per pallet (or 651 pounds/pallet)\nBased on this calculation, 16 pallets would exceed the 10,000-lb threshold for flammables.  It is expected that the DC will have inventory in excess of 16 pallets of applicable aerosol present and is therefore subject to the RMP and PSM requirements. The aerosol storage room capacity varies by location.  Maximum storage amounts based on pallet slot storage inside the storage room would be:\nLocation:\t\tAerosol Pallet Spaces:\t\tMaximum Inventory (Spaces x 651 lbs/pallet)\nFostoria\t\t\t2400\t\t\t\t1,562,400 pounds\n\n\n2.\tPROGRAM LEVEL DETERMINATION\nThe USEPA RMP program allows for three program levels, each with varying levels of requirements (Program 1, 2, or 3).  Program 3 is the most stringent set of requirements while Program 1 is the least stringent.\nIn order to qualify for an EPA Program Level 1, th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000111282,
      "SummaryText": "e following conditions must be met:\n\tNo off-site receptor in WCS hazard zone\n\tNo \"reportable\" accidental releases in the last 5 years\n\tEmergency Response procedures coordinated with the Local Emergency Planning committee/local agencies.\nFacilities are considered Program Level 3 facilities if they are subject to OSHA PSM or are a listed North American Industrial Classification System (NAICs) company, unless they satisfy Program 1 criteria.  Program Level 2 facilities are those that do not fit either Program 1 or Program 3 criteria.\n\n3.\tWORST CASE SCENARIO ANALYSIS\nThe WCS is defined as:\n\"...the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to the defined endpoint\"\nBased on the USEPA guidance, Risk Management Program for Warehouses (40 CFR Part 68), EPA 550-B-00-009, March 2009:\n\"For a release from a vessel, you need only consider the largest amount in the vessel. For the specific case of a warehouse, the largest vessels are 350 gallon totes, 55-gallon drums, 10-gallon pails, 150-lb cylinders, and other containers that are small relative to typical vessels in a chemical plant. Therefore, the spillage of the contents of one of these containers constitutes the worst-case scenario, although you may well be able to think of scenarios in which a quantity greater than Q as defined above can be released. Other credible scenarios could involve simultaneous damage to more than one vessel. EPA recommends that you consider multiple-vessel release scenarios, if credible and appropriate, as alternative release scenarios.\"\nBased on this guidance, the WCS can be defined as the loss of containment on a single aerosol can.  This scenario, however, may not be considered credible, since if a single can were to catastrophically fail, other cans in the case are also likely to fail.  Therefore two scenarios are assessed 1) failure of a single can and 2) a WCS assumption of the loss of an entire case of c"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000111282,
      "SummaryText": "ans (i.e. twelve (12) x 7 oz cans or six (6) x 200 ml cans).\nThe WCS scenarios for the Distribution Center are calculated on the basis of a vapor cloud explosion resulting from the release of flammable propellant.    The following equation used to calculate the distance to endpoint of impact is as provided in the USEPA's Risk Management Program Guidance for Warehouses (40 CFR Part 68).\n\nD=0.0081(0.1 x Q x HC/HCTNT)1/3  where:\nD=distance to 1 psi overpressure endpoint (miles)\nQ=quantity of flammable material present in pounds\nHC = Heat of combustion of flammable material\nHCTNT = Heat of combustion of trinitrotoluene (TNT) = 4,680 kj/kg\n\nDry Shampoo Aerosols\nThe finished product aerosol HC was calculated as 39.0 k joules/gram (39,000 k joules/kilogram)\n\nScenario 1 - Single Can (dry shampoo)\nQ = 123 gms = 0.271 pounds\nD = 0.0081 (0.1 x 0.271 x 39,000/4,680)1/3 \nD= 0.005 miles (26.0 feet)\n\nWCS: Scenario 2 - Single case (6 cans dry shampoo)\nQ = 1.626 pounds\nD = 0.0081 (0.1 x 1.626 x 39,000/4,680)1/3\nD = 0.011 miles (57.9 feet)\nWSC Scenario 1b & 2b assumptions:\n\tLoss of containment of a case of aerosol cans in a single vapor cloud\n\t6/cans/case =1.626 pounds (123 gram cans assuming entire weight of can)\n\tRelease quantity = 1.626 pounds\nBased on this equation and the above assumptions the distance to 1 psi overpressure endpoint is 57.9 feet.  Generation of a vapor cloud and explosion involving a full case of cans simultaneously is not considered likely.  A scenario between Scenario 1 (single can) and Scenario 2 (WCS - full case) is the more likely occurrence if a case is damaged in handling (i.e. something less than 57.9 feet to endpoint).  Note this explosion would also occur inside the concrete foundation, steel frame, tilt-up concrete walled building.  The passive controls provided by the building shell would further limit the potential distance to the endpoint.\n4.\tCONCLUSION\nA WCS with an endpoint distance of <70 feet will have no off-site impact and no significant publ"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000111282,
      "SummaryText": "ic receptors.  This scenario satisfies the Program 1 criteria for EPA RMP."
    }
  ]
}