{
  "FacilityID": 1000080167,
  "FacilityName": "C&S Wholesale Grocers, Inc. - Chester",
  "FacilityStr1": "1 Elizabeth Drive",
  "FacilityStr2": null,
  "FacilityCity": "Chester",
  "FacilityState": "NY",
  "FacilityZipCode": "10918",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36071",
  "LEPC": "Orange County LEPC",
  "FacilityLatDecDegs": "41.351278",
  "FacilityLongDecDegs": "-074.291194",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cswg.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1842467,
  "ParentCompanyName": "C&S Wholesale Grocers, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "C&S Wholesale Grocers, Inc.",
  "OperatorStr1": "7 Corporate Drive",
  "OperatorStr2": "P.O. Box 821",
  "OperatorCity": "Keene",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03431",
  "OperatorZipCodeExt": null,
  "FTE": 452,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000178657",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-12 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-03-15 16:59:19",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-09 17:30:28",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-09 17:30:28",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.34737,
  "FRS_Long": -74.28565,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100090,
      "AltID": null,
      "FacilityID": 1000080167,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125369,
          "ProcessID": 1000100090,
          "ChemicalID": 56,
          "Quantity": 28362.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101330,
          "ProcessID": 1000100090,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000084571,
              "Process_NAICS_ID": 1000101330,
              "SafetyReviewDate": "2016-11-18 00:00:00",
              "PHA_Date": "2020-04-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-04-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Ammonia Detection",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-03-22 00:00:00",
              "TrainingReviewDate": "2016-11-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Periodic monthly training calls given by the Corporate Compliance Team",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-03-13 00:00:00",
              "EquipmentInspectionDate": "2019-04-12 00:00:00",
              "EquipmentTested": "Annual refrigeration system mechanical integrity service - performed by outside contractor",
              "ChangeMgmtDate": "2018-03-13 00:00:00",
              "ChangeMgmtReviewDate": "2016-11-18 00:00:00",
              "PreStartupReviewDate": "2015-11-13 00:00:00",
              "ComplianceAuditDate": "2017-04-18 00:00:00",
              "AuditCompletionDate": "2018-04-19 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-11-18 00:00:00",
              "HotWorkPermitReviewDate": "2016-03-01 00:00:00",
              "ContractorSafetyReviewDate": "2019-04-12 00:00:00",
              "ContractorSafetyEvalDate": "2016-11-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000105366,
                  "PreventionProgram3ID": 1000084571,
                  "ProcessChemicalID": 1000125369
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080167,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Chester Fire Department",
    "CoordinatingAgencyPhone": "8454694100",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000080167,
      "SummaryText": "lled as needed.  If a release exceeds the federal reporting quantity of 100 pounds for ammonia, the National Response Center will be called.\r\n\r\nThere is a specific Corporate C&S program (CEHS-0042) which outlines the training, qualifications and procedures for authorized ammonia Incident responders and observers.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM and RMP regulations.  Facility personnel receive annual training regarding the emergency procedures and the Emergency Response Team holds regular drills.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nIn 2002, the refrigeration system was thoroughly examined for safety hazards by way of a Process Hazard Analysis (PHA).  In addition, three Revalidations of the Process Hazard Analysis have been conducted as follows:\r\n\r\nPrevious studies have been conducted at the facility as follows [40 CFR 68.67(a)].\r\n\r\n¿\tPHA Revalidation  -2002 \r\n¿\tPHA Revalidation 1 - 2007\r\n¿\tPHA Revalidation 2 - 2010\r\n¿\tPHA Revalidation 3 - 2014\r\n¿\tPHA Revalidation 4 - 2019\r\n\r\nThe studies consisted of:\r\n\r\n- Hazard and Operability Studies (HAZOP) or What-If Studies\r\n- series of safety checklists; and\r\n- facility inspection.\r\n\r\nThe mitigation measures (recommendations) include additional training, key maintenance-related tests/inspection, and enhanced emergency response policies and procedures.  The recommendations resultant from the most recent revalidation study are being tracked by the facility and the Corporate Compliance Team."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080167,
      "SummaryText": "designed with several safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  There are two Manning ammonia sensors placed in strategic locations in the Compressor Room. In the event of ammonia detection, an alarm is triggered on the control system, and at the facility (audible on high level), and the ammonia refrigeration technicians are notified via an autodial system. The New Warehouse addition is equipped with ammonia detectors throughout the cold storage areas.  These detectors are also programmed to autodial.  In addition, C&S Wholesale Grocers personnel circulate throughout the plant, taking note of unusual conditions in any portion of the system.  \r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nThere have been no significant releases during the past five years of operation (June 2014 - June 2019) of ammonia that exceeded the Federal Reportable Quantity of 100 pounds.  In addition, there have been no injuries resulting from an ammonia release, nor any releases or near misses that warranted an internal incident investigation.\r\n\r\nEMERGENCY ACTION PLAN\r\n\r\nThe facility has an Emergency Action Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives:  \r\n\r\n- save lives;\r\n- minimize and avoid injuries;\r\n- protect the environment; and\r\n- minimize property damage.\r\n\r\nThe Emergency Action Plan (Plan) is included in the facility IIPP program.  Emergency response activities are coordinated with the City of Chester Fire Department and the local fire houses.  In case of a major ammonia emergency, the facility will first call 9-1-1 to alert the local Police and Fire Departments.  Other responders will be ca"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080167,
      "SummaryText": "mmonia in the system is automatically purged of any non-condensibles, i.e. air and water vapor. Non-condensibles are purged from the condensers and V-2. The purged gases are removed from the system through the auto purger bubbler and the collected ammonia vapor returns to the V-1.\r\n\r\nAmmonia sensors are located in the Engine Room and within each refrigerated space throughout the warehouse.\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\r\n\r\n1)  OSHA's Process Safety Management (PSM); and\r\n2)  EPA's Risk Management Program (RMP).\r\n\r\nThese regulations impose numerous requirements on the facility to ensure the safety of the public and on-site workers.  The following summarizes the key compliance programs that have been implemented by C&S - Chester to prevent the accidental release of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner.  The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards.  The Management of Change program ensures that process modifications are implemented in a safe manner.  The Pre-Startup Safety Review program ensures that adequate safety measures are in place before ammonia is introduced into a process.  The Hot Work Permit program ensures that C&S - Chester's employees and contractors perform hot work (e.g. welding) in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.\r\n\r\nIt is important to note that the refrigeration system has been"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080167,
      "SummaryText": "ge areas. \r\n\r\nOff-site Release Scenarios\r\n\r\nC&S has conducted an OCA based on the EPA document titled RMP Offsite Consequence Analysis Guidelines, and used the EPA's RMP*Comp Version 1.07 to estimate the distance traveled to a toxic endpoint defined by the EPA regulation. This data were then used to estimate the potential impact caused by a release from each of the regulated substances.\r\n\r\nWorst-Case Release Scenarios\r\n\r\nAs required by regulations, scenarios were considered where the entire capacity of the largest vessel for each regulated chemical at the facility was released in 10 minutes. Although these scenarios are highly unlikely in the event of a release, it provides the local responding agencies with a maximum possible impact in the event of an accidental release. In considering these releases, the most pessimistic meteorological conditions were used. Passive mitigation measures were taken into account when considering these release scenarios.\r\n\r\nAlternative Release Scenarios\r\n\r\nAlternative scenarios were developed to assess what potential impact may occur in the event of a release that is more likely to occur than the worst-case scenarios for each of the \r\nregulated chemicals. Several possible release scenarios were considered, and the scenarios with the greatest offsite impact were chosen. In considering the alternative release scenario, the default meteorological conditions for alternative scenarios were used in RMP*Comp. These scenarios represent a more realistic release, and have a downwind distance and impact considerably smaller than the worst-case scenario. No passive or active mitigation measures were taken into account when considering these release scenarios.\r\n\r\nProcess Description\r\n\r\nThe High Pressure/Thermosyphon Receiver (V-2) is a vessel that maintains a reservoir of liquid ammonia that is supplied to cool the compressor lubrication oil. The liquid is pumped to the compressors where the heat from the oil partially boils the ammonia causing t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080167,
      "SummaryText": "he vapor to return back to the V-2 vessel. Liquid feeds to both Recirculators as needed to maintain normal operations. V-1 serves as a suction accumulator and pumps liquid ammonia to the Produce and North Dock Evaporators, as well as corridor evaporators (2010 Expansion evaporators AU69 - AU74). V-1 Recirculator also collects the liquid/vapor mixture from these evaporators; the vapor returned is then drawn to the compressors. V-3 Recirculator pumps liquid ammonia to the 2010 Expansion Evaporators in the Cooler, Seafood, Produce and Dock areas (AU37 - AU68). V-3 also collects the liquid/vapor mixture produced by these evaporators; the vapor returned is then drawn to the compressors.\r\n\r\nThe evaporators maintain the appropriate room temperatures by transferring heat from the air in the room to the ammonia inside the coils using fans to move air across the coils. The result is (partially) vaporized ammonia that is returned to both the Recirculator vessels (V-1 and V-3). V-1 also supplies liquid ammonia to the Glycol Heat Exchanger. The Glycol Heat Exchanger transfers heat from the glycol solution to the ammonia liquid, which vaporizes the ammonia and chills the glycol solution. The chilled glycol is pumped to the Banana Room evaporators and back to the chiller accumulator in a separate closed system. The vaporized ammonia returns to V-1.\r\n\r\nThe compressors (HS-1 thru HS-5) draw the high stage vapor that is collected in the V-1 and V-3 vessels and compress it to discharge high pressure vapor (hot gas). The compressors are the primary energy input into the system. Hot gas is used internally within the system to assist with defrosting the evaporator coils based on a timed cycle. The main high stage discharge flow is routed to the Condensers, which discharge the latent heat in the ammonia to the atmosphere using sprayed water and fans, resulting in high pressure liquid ammonia. This liquid is recycled back into the V-2.\r\n\r\nThe system also incorporates an automatic purger. A"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080167,
      "SummaryText": "C&S Wholesale Grocers' senior management is not only committed to offer superior service, but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding community.  The Corporate Compliance Team assists the facility in administering safety and environmental policies. The Corporate Compliance Team is made up of the following personnel:\r\n\r\n¿\tSenior Director of Corporate Refrigeration\r\n¿\tSenior Manager of Corporate Refrigeration\r\n¿\tPSM/RMP Regulatory Manager\r\n¿\tDirector of Environmental & OSHA Compliance\r\n¿\tCorporate Manager of Facilities Compliance\r\n¿\tOSHA Regulatory Manager\r\n¿\tEnvironmental Compliance Manager\r\n\r\nThe Maintenance Manager periodically evaluates the health and safety practices of facility employees to ensure compliance, and oversees implementation of the safety and environmental programs.  These programs include forklift safety, hazard communications, lockout/tagout, Hazardous Materials Emergency Business Plan, employee safety manuals, manufacturer's documentation, Emergency Response, as well as the Risk Management Plan.\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nThe C&S Wholesale Grocers, Inc. - Chester facility serves as a refrigerated warehouse and storage facility. The facility is located at 1 Elizabeth Lane in Chester, New York about 0.75 miles west of Highway 6 and 0.5 miles south of Highway 94. The immediate area is primarily undeveloped with some light commercial areas.  The ammonia system was constructed in accordance with all applicable federal, state, and local regulations and to IIAR guidelines.\r\n\r\nThe previous hazard assessment conducted in 2014 analyzed an anhydrous ammonia charge of 35,200 pounds of ammonia. Since then an ammonia charge calculation has been conducted by Gartner Refrigeration (July 5, 2016) and a total of 28,362 pounds of ammonia are estimated to reside in the system. The ammonia refrigeration system uses ammonia for various dock operations and cold stora"
    }
  ]
}