{
  "FacilityID": 1000043766,
  "FacilityName": "Hinckley Water Treatment Plant",
  "FacilityStr1": "917 Trenton Falls/Prospect",
  "FacilityStr2": "Quarry Rd.",
  "FacilityCity": "Prospect",
  "FacilityState": "NY",
  "FacilityZipCode": "13435",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36065",
  "LEPC": "Oneida County LEPC",
  "FacilityLatDecDegs": "43.294722",
  "FacilityLongDecDegs": "-075.149167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Upper Mohawk Valley Regional Water Board",
  "Company2Name": null,
  "CompanyDUNS": 17337020,
  "Company2DUNS": 0,
  "OperatorName": "Upper Mohawk Valley Reg. Wtr Board",
  "OperatorStr1": "One Kennedy Plaza",
  "OperatorStr2": null,
  "OperatorCity": "Utica",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13502",
  "OperatorZipCodeExt": null,
  "RMPContact": "Phillip Tangorra",
  "RMPTitle": "Research Scientist",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000121432",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-09-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.29642,
  "FRS_Long": -75.149,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054073,
      "AltID": "Hinckley WTP Chlorination",
      "FacilityID": 1000043766,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054864,
          "ProcessID": 1000054073,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065831,
          "ProcessID": 1000054073,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565831,
          "ProcessID": 1000054073,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043766,
      "SummaryText": "UPPER MOHAWK VALLEY REGIONAL WATER BOARD\n\nHINCKLEY WATER TREATMENT PLANT\n\nRISK MANAGEMENT PROGRAM\n\n\n\n\n\nBACKGROUND\n\n\n\nThe Environmental Protection AgencyA?s Risk Management Program (RMP) Rule requires the development of a multi-step program for managing risk associated with the use of hazardous materials.  The final requirements of the Rule, published under the provisions of the Clean Air Act, affects an estimated 64,000 facilities across the country, including over 7,000 water and wastewater facilities.  The RMP is designed to supplement the primarily on-site safety requirements of OSHAA?s Process Safety Management Program (established in the early 1990's) with additional off-site safety considerations. This document represents the five-year update to the Board's original 1999 and 2004 updated Plan.\n\n\n\nThe Upper Mohawk Valley Regional Water Board's Hinckley Water Treatment Plant is located on Trenton Falls/Prospect/Old Quarry Road in Prospect, New York.  The treatment facility was placed into service in 1992 and currently provides water to approximately 125,000 people in the Utica area. The water plant utilizes clarification, filtration, and chemical feed processes to treat approximately 20 million gallons of water per day, the source of which is the Hinckley Reservoir.\n\n\n\n\n\nAPPLICABILITY\n\n\n\nOne of the chemicals which is used by the plant is chlorine.  Chlorine is used to disinfect the water at various locations in the treatment process including dosing of the finished water as it leaves the treatment plant. Chlorine is used as a gas but stored under pressure as a liquid in 2000 pound containers.  The chlorine, drawn from the containers under vacuum for safety, is added at a prescribed dosage rate into the water by means of a rotometer on the chlorinator, which the operator can adjust to respond to changes in water quality.\n\n\n\nAs the Hinckley Treatment Plant has more than 2500 pounds of chlorine on site, it must comply with the provisions of EPA's Risk Management Pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043766,
      "SummaryText": "ogram (RMP).  Also, as New York State is an OSHA Plan State, the plant is subject to Prevention Program 3 requirements under the RMP.  \n\n\n\n \n\nCOMMITMENT\n\n\n\nThe Board is committed to reducing the risk to its employees and the public of injury from the accidental release of chemicals, including chlorine gas.  This commitment is exhibited through an extensive employee training and safety program, continuing maintenance on process equipment, emergency response coordination such as drills with local emergency responders, public education, and through written policy statements such as the Risk Management Program.\n\n\n\nA management system is in place to ensure that employees from all levels of the Board are a part of the RMP Program.\n\n\n\n\n\nIMPLEMENTATION\n\n\n\nPrevention\n\n\n\nA number of safety measures are in place to prevent an accidental release of chlorine gas.  In addition to the vacuum delivery system, which stops the flow of chlorine gas in the event of a piping or equipment failure, the chlorine containers are kept in a separate, totally enclosed storage room which is continuous monitored for any possible chlorine leaks.  If a leak should occur, the operator is notified immediately through an alarm system.  \n\n\n\nAll major chlorination components are backed up with on line redundant equipment.  \n\n\n\nBoard personnel including management, operators, and maintenance have conducted a process hazard analysis (PHA), a brainstorming session to identify possible chlorine release situations, causes, consequences, and identify (or recommend) safeguards and corrective actions to prevent the release from occurring.  This analysis involved all possible situations including equipment malfunction, delivery problems, and acts of nature.  Any improvements that could be made in the response to a release situation were identified and a plan of action was formed to implement the improvements.\n\n\n\nTraining\n\n\n\nAll water treatment plant operators are trained in the handling and administering of chlo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043766,
      "SummaryText": "rine.  This training includes the use of chlorination and safety equipment, identification of potential hazards, and response to accidental releases of chlorine gas.  \n\n\n\nThe plant has a detailed Emergency Response Plan which outlines the response measures to be taken by plant personnel in the event of a chlorine leak.  Plant personnel have been trained in the use of equipment to correct small scale leaks.  This training also includes the recognition of when additional assistance from local emergency responders such as the Oneida County Emergency Services/HAZMAT squad is needed to correct the problem and notify the immediate public if necessary.\n\n \n\nThe Board is pleased to report that due to the training and safety efforts of plant personnel, the Hinckley Water Treatment Plant has not had an accidental release of chlorine gas resulting in injury or property damage (on or off-site) in the past five years.  This can be directly attributed to plant personnel's high level of effort toward safe chlorine handling and use.\n\n\n\nEmergency Response Plan\n\n\n\nAs noted, the Emergency Response Plan for the plant includes provisions for emergency medical treatment and  procedures for the summoning of outside assistance for a large chlorine leak.  Outside assistance, when required, is provided by the Village of Prospect Fire Department and the Oneida County HAZMAT Team.  Outside responders are familiar with the plant chlorination system and have completed an on site training and drill program in conjunction with plant personnel.  The emergency responders will be responsible for public notification in the event of a large scale chlorine release."
    }
  ]
}