{
  "FacilityID": 1000057898,
  "FacilityName": "Kraft Heinz Foods Company - Coshocton",
  "FacilityStr1": "1660 South Second Street",
  "FacilityStr2": null,
  "FacilityCity": "Coshocton",
  "FacilityState": "OH",
  "FacilityZipCode": "43812",
  "Facility4DigitZipExt": "1950",
  "FacilityCountyFIPS": "39031",
  "LEPC": "Coshocton County LEPC",
  "FacilityLatDecDegs": "40.249865",
  "FacilityLongDecDegs": "-81.869726",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G5",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.kraftheinzcompany.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39010590,
  "ParentCompanyName": "The Kraft Heinz Foods Company",
  "Company2Name": null,
  "CompanyDUNS": 4318846,
  "Company2DUNS": 0,
  "OperatorName": "Kraft Heinz Foods Company",
  "OperatorStr1": "1660 South Second Street",
  "OperatorStr2": null,
  "OperatorCity": "Coshocton",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43812",
  "OperatorZipCodeExt": "1950",
  "RMPContact": "Kurt Bain",
  "RMPTitle": "Plant Manager",
  "FTE": 630,
  "OtherEPAFacilityID": "ohd107611584",
  "EPAFacilityID": "100000031654",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-03-29 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-06-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.25359,
  "FRS_Long": -81.86931,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000072346,
      "AltID": "Refrigeration",
      "FacilityID": 1000057898,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000073529,
          "ProcessID": 1000072346,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000089293,
          "ProcessID": 1000072346,
          "ChemicalID": 56,
          "Quantity": 47021.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000589293,
          "ProcessID": 1000072346,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057898,
      "SummaryText": "RMP Executive Summary \n\nKraft Heinz Foods Company - Coshocton, OH\n\n\n\n1.0 Release Prevention and Emergency Action Policies\n\nThe Kraft Heinz Foods Coshocton, Ohio facility has an excellent record in preventing and minimizing release of anhydrous ammonia (hereafter, anhydrous ammonia will be referred to as ammonia). The facility has a training program, of what to do in various emergency situations, including an ammonia release.\n\n\n\nThe emergency action procedures at this facility ensure emergency response coverage 24 hours a day, 7 days a week. There are also adequate provisions for coordination with outside agencies, such as the Coshocton Fire Department, HAZMAT Team and the LEPC in the event of an emergency.\n\n\n\n2.0 Process Description and Regulated Substance\n\n\n\nThe Kraft Heinz Foods Coshocton facility produces pork bacon products. The North American Industrial Classification System (NAICS) code for the primary process at this facility is 311612. The ammonia is utilized as a refrigerant for the processing and storage of bacon products and raw materials (pork bellies) and is located in various locations in the facility. Ammonia is the only Kraft Heinz Foods Coshocton regulated substance under 40 CFR 68.\n\n\n\nKraft Heinz Foods Coshocton exceeds the 10,000 pounds threshold according to 40 CFR 68.\n\n\n\nAmmonia is classified as a Group B2 refrigerant per ASHRAE Standard 34-1989. Its distinctive pungent odor is very noticeable to most people, even in small quantities. Ammonia is flammable in a very narrow and high range of concentration with a high ignition temperature. Ammonia is not toxic, but can be corrosive to the human tissue. Ammonia is readily absorbed into the moisture of the skin and at high concentrations can cause burns. The potential risks to people exposed to an accidental ammonia release include irritation of respiratory tract, burning of the skin and other tissue when contacted by ammonia vapor and freezing of skin and other body tissue when contacted by liquid a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057898,
      "SummaryText": "mmonia.\n\n\n\n3.0 General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n\n\nThe Kraft Heinz Foods Coshocton facility has a fully developed OSHA Process Safety Management Program (PSM) for the refrigeration system. The OSHA PSM program for prevention meets the EPA requires for a RMP Program 3 Prevention Program and therefore makes the facility compliant with 40 CFR 68.  The PSM program contains fourteen (14) elements, which must be executed.\n\n\n\nEmployee Participation - The purpose of this element is to ensure all employees have a voice in the PSM program and the operations of the ammonia equipment.\n\n\n\nProcess Safety Information - The purpose of this element is allowing all process hazards to be identified and understood.\n\n\n\nProcess Hazard Analysis - The purpose of this element is to identify, evaluate and control process hazards using a systematic approach.\n\n\n\nOperating Procedures - The purpose of this element is to develop, implement and maintain clear instructions for the safe operation of the ammonia system.\n\n\n\nTraining - The purpose of this element is depending on role, personnel who may come in contact with ammonia, operate, maintain or clean ammonia refrigeration equipment understand applicable health hazards and be able to perform work safely.\n\n\n\nContractors - The purpose of this element is to ensure all contractors either directly working on or just in the facility understand the hazards of ammonia.\n\n\n\nPre Startup Safety Review - The purpose of this element is to ensure safety and design issues are considered before hazardous materials are introduced to the process or system.\n\n\n\nMechanical Integrity - The purpose of this element is to ensure the continued integrity of the process equipment and minimize the potential for catastrophic release.\n\n\n\nHot Work Permit - The purpose of this element is to ensure fire prevention practices are used for any operation involving open flames, heat and or sparks.\n\n\n\nManagement of Change - The purpos"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057898,
      "SummaryText": "e of this element is to ensure that process changes are screened and evaluated, provide a process that serves as a trigger for updating other sections of this program and ensures employees and contractors are aware of any changes to the system.\n\n\n\nIncident Investigation - The purpose of this element is to minimize the impact of incidents by investigating the root cause of each incident or near miss.\n\n\n\nEmergency Action - The purpose of this element is to ensure the facility has adequate means of addressing incidents as they occur.\n\n\n\nCompliance Audit - The purpose of this element is to verify that PSM procedure and practices are adequate and being following and identify areas for improvement.\n\n\n\nTrade Secrets - This element does not apply to the Kraft Foods Coshocton Facility.\n\n\n\n4.0 Five Year Accident History\n\n\n\nThere have been no accidental releases at this facility in the last five years.\n\n\n\n5.0 Emergency Action Program\n\n\n\nThe Coshocton facility has an emergency action plan which addresses the accidental discharge of hazardous substances in to the environment, measures to be taken to prevent an accident, countermeasures to be taken in the case of an accident and procedures for containing and limiting the duration of the emergency measures to be employed for further protection of employees responding to an emergency, as well as other plant personnel.\n\n\n\nThis plan incorporates the SPCC plan, by reference, which includes the location, types and amounts of chemicals stored on site, notification procedures, and countermeasures to be taken in the event of a spill. This plan also incorporates established procedures to notify appropriate agencies and company personnel in the event of an emergency.\n\n\n\nOur comprehensive emergency action plan is designed to protect our employees, environment and the community and among other things requires that: all nonessential personnel immediately exit the facility affected by the release, notification of local officials for their assis"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000057898,
      "SummaryText": "tance if necessary.\n\n\n\n6.0 Planned Changes to Improve Safety\n\n\n\nKraft Heinz Foods Coshocton has a PSM program designed for continuous improvement. Each of the elements previously described allows the facility to ensure improvement on a continuous basis."
    }
  ]
}