{
  "FacilityID": 1000048096,
  "FacilityName": "Tolar Plant",
  "FacilityStr1": "4205 Hill City Highway",
  "FacilityStr2": null,
  "FacilityCity": "Tolar",
  "FacilityState": "TX",
  "FacilityZipCode": "76476",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48221",
  "LEPC": "Hood County LEPC",
  "FacilityLatDecDegs": "32.343943",
  "FacilityLongDecDegs": "-097.888722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "Andreu.vivas-hunt@enlink.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "EnLink Midstream Operating, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 610437142,
  "Company2DUNS": 0,
  "OperatorName": "EnLink Midstream Operating, L.P.",
  "OperatorStr1": "4205 Hill City Highway",
  "OperatorStr2": null,
  "OperatorCity": "Tolar",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76476",
  "OperatorZipCodeExt": null,
  "RMPContact": "Andreu Vivas-Hunt",
  "RMPTitle": "Lead PSM Specialist",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000193925",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "GOP #514",
  "SafetyInspectionDate": "2009-11-23 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-12-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-12-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-09-17 00:00:00",
  "DeRegistrationEffectiveDate": "2019-09-11 00:00:00",
  "AnniversaryDate": "2019-12-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060161,
      "AltID": "Natural Gas Processing",
      "FacilityID": 1000048096,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000061290,
          "ProcessID": 1000060161,
          "NAICSCode": "21113",
          "_desc": {
            "NAICS_CODE": "21113",
            "NAICS_DESCRIPTION": "Natural Gas Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000073683,
          "ProcessID": 1000060161,
          "ChemicalID": 155,
          "Quantity": 894189.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000062992,
              "ProcessChemicalID": 1000073683,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000062993,
              "ProcessChemicalID": 1000073683,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000062994,
              "ProcessChemicalID": 1000073683,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000062995,
              "ProcessChemicalID": 1000073683,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000062996,
              "ProcessChemicalID": 1000073683,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000073684,
          "ProcessID": 1000060161,
          "ChemicalID": 98,
          "Quantity": 33726.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000573683,
          "ProcessID": 1000060161,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000573684,
          "ProcessID": 1000060161,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048096,
      "SummaryText": "RMP Level 3 Facility\n\nDCP Midstream, LP\n\nTolar Gas Plant\n\nEPA Facility Identifier # 1000 0019 3925\n\n\n\n\n\nExecutive Summary\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\n\n\nThe Tolar Gas Plant has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, gas plant trained personnel will respond to control and contain the release.\n\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nThe Tolar Gas Plant, located near Tolar, TX, uses refrigeration and fractionation to process wellhead gas into marketable natural gas and natural gas liquids (NGL).  As a result of this operation, several EPA regulated flammable substances are processed, recovered, and stored at the facility (e.g., methane, ethane, propane, butane, and pentane).  The Tolar plant does not use or store any regulated toxic substances above the EPA set threshold levels.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\n\nThe following is a summary of the accidental release prevention program in place at the plant.  Because processes at the gas plant that are regulated by the Environmental Protection Agency's (EPA's) risk management program regulation are also subject to the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement PROGRAM 3 under EPA's accidental release prevention program.\n\n\n\nEmployee Participation\n\n\n\nThe Tolar Gas Plant encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048096,
      "SummaryText": " compiling process safety information to participation as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the gas plant's PSM and accidental release prevention programs.  These programs are documented in an employee participation plan that is maintained at the gas plant and addresses each element of PSM and the accidental release prevention programs.  In addition, the gas plant has a number of initiatives under way that address process safety and employee safety issues.  These initiatives include plant safety meetings and safety training to promote both process and personal safety.  \n\n\n\nProcess Safety Information\n\n\n\nThe Tolar Gas Plant keeps a variety of technical documents that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazard, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information.  The Asset Management in conjunction with plant personnel are assigned the responsibility for maintaining up-to-date process safety information.\n\n\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDS).  This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  The plant has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in the plant's Operating Procedures, and ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n\n\n\nThe plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048096,
      "SummaryText": "information includes material of construction, design pressure and temperature ratings, and electrical rating of equipment.  This information, in combination with trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\n\nProcess Hazard Analysis (PHA)\n\n\n\nThe Tolar Gas Plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\n\n\nThe Tolar Gas Plant primarily uses the HAZ-OP and What-if/Check list analysis techniques to perform these evaluations.  OSHA and the EPA recognize these analyses as an approved methodologies for conducting PHAs.  Plant PHAs are conducted using a team of people who have operating, maintenance, engineering and safety experience.  The team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\n\n\nThe PHA team findings are forwarded to company's local management for resolution.  Implementation of mitigation options, in response to PHA findings, is based on a relative risk ranking assigned by the PHA team.  This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention.  All approved mitigation are tracked until they are completed.  The final resolution of each finding is documented and retained.\n\n\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the plant periodically updates and revalidates the hazard analysis results.  These perio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048096,
      "SummaryText": "dic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.  The results and findings from these updates are documented and retained.  Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\n\n\n\nOperating Procedures\n\n\n\nThe Tolar Gas Plant maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are revised as necessary to reflect changes made through the management of change process and annually certified as current and accurate.  \n\n\n\nIn addition, Tolar Gas Plant's Operating Procedures provide guidance on how to respond to specific process or equipment parameters that exceed the parameter upper or lower limit.  Operating Procedures are readily available to operators and for other personnel to use as necessary to safely perform their job tasks.\n\n\n\nTraining\n\n\n\nTo complement the written procedures for process operations, the Tolar Gas Plant has implemented a comprehensive training program for all employees involved in operating a process. New employees receive basic training in gas plant operation and are paired with senior operators to learn process-specific duties and tasks.  After operators demonstrate having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently.  In addition, all operators periodically receive refresher training to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every 3 years.  All of this training is documented for each operator, in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048096,
      "SummaryText": "cluding the means used to verify that the operator understood the training.\n\n\n\nContractors\n\n\n\nThe Tolar Gas Plant uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the gas plant has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform gas plant personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work.  In addition, DCP Midstream evaluates contractor safety programs and performance during the selection of a contractor.  Gas plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\n\n\nPre-startup Safety Reviews (PSSRs)\n\n\n\nThe Tolar Gas Plant conducts a PSSR for any facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure those safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that the accident prevention program requirements are properly implemented.\n\n\n\nMechanical Integrity\n\n\n\nThe Tolar Gas Plan"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000048096,
      "SummaryText": "t has established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include:  (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\n\n\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.  Equipment manufacturer's written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed in accordance with the manufacturer's recommendations to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or place temporary safeguards in place to ensure the safe operation of the equipment.\n\n\n\nAnother integral part of the mechanical integrity program is quality assurance.  The Tolar Gas Plant incorporates quality assurance measures into equipment purchases and repair.  This helps ensure that new equipment is suitable for its intended use and those proper materials and spare parts are used when repairs are made.\n\n\n\nSafe Work Practice\n\n\n\nThe Tolar Gas Plant has long-standing, safe work practices in place to help ensure worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tago"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000048096,
      "SummaryText": "ut procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\n\n\nManagement of Change\n\n\n\nThe Tolar Gas Plant has a comprehensive system to manage changes to all covered processes.  This system requires that change to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes to be properly reviewed and authorized before being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.\n\n\n\nIncident Investigation\n\n\n\nDCP Midstream promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to management for resolution.  Corrective actions taken in response to the investigation team's findings and recommendations are tracked "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000048096,
      "SummaryText": "until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations.\n\n\n\nCompliance Audits\n\n\n\nTo help ensure that the accident prevention program is functioning properly, DCP MidstreamA?A?s personnel periodically conduct an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every 3 years.  Audit findings are forwarded to the company's Safety Department for resolution.  The Safety Department initiates any corrective actions taken in response to the audit and tracks them until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\n\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe processes at the Tolar Gas Plant have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\n\n\nUniversal Prevention Activities\n\n\n\nThe accidental release prevention program summarized previously is applied to all RMP-covered processes at the Tolar Gas Plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\n\n\nSpecialized Safety Features\n\n\n\nThe Tolar Gas Plant has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release.  The following types of safety features are used in the covered processes:\n\n\n\n    \n\n    Daily operator inspection.\n\n\n\n    Release Containment/Control\n\n\n\n    Process rel"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000048096,
      "SummaryText": "ief valves that prevent vessel over pressurization.\n\n\n\n    Valves to permit isolation of the process (manual or automated).\n\n\n\n    Automated shutdown systems for specific process parameters (e.g., high temperature).\n\n\n\n    Curbing or diking to contain liquid releases.\n\n\n\nRedundant equipment and instrumentation (e.g., uninterruptible power supply for process control system).\n\n    \n\n    Release Mitigation\n\n\n\n    Fire suppression and extinguishing systems.\n\n    \n\n    Trained emergency response personnel (HAZWOPER, fire response).\n\n        \n\n    Personal protective equipment (e.g., hard hat, safety glasses, protective clothing, etc.).\n\n    \n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThe Tolar Gas Plant experienced NO reportable accidents in the past 5 years.  Releases that did occur at the plant involving a regulated substance, were quickly contained and resulted in no deaths, injuries, significant property damage, environmental damage, evacuations, or sheltering in place.  \n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\n\n\nThe Tolar Gas Plant maintains a written emergency response plan, which is in place to protect worker and public safety as well as the environment. The plan consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address or reference all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements.  \n\n\n\nIn addition, the plant has procedures that address maintenance, inspection, and testing of emergency response.  Employees receive training in these procedures as necessary to perform their specific emergency response duties, and participate in plant monthly emergency drills to ensure emergency shutdown system (ESD) integrity a"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000048096,
      "SummaryText": "nd reinforce proper employee response. \n\n\n\nThe emergency response plan is updated when necessary based on modifications made to gas plant process or other DCP Midstream Energy facilities.  The emergency response program changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes.\n\n\n\nThe overall emergency response plan for the Tolar Gas Plant is coordinated with the Hood County Local Emergency Planning Committee (LEPC) which is responsible for preparing the community's emergency response plan.  The local responder for plant emergencies is the Granbury Volunteer Fire Department.  The Tolar Gas Plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nTolar Natural Gas Processing Plant resolves all findings from PHAs, some of which result in modifications to the process. The following types of changes are planned over the next few years in response to PHA, safety audit, and incident investigation findings:\n\n \n\n* Incident response drills involving off-site emergency responders\n\n* Process Hazards Analysis revalidations\n\n* Management of change \n\n* Mechanical Integrity & Quality Assurance\n\n* Compliance audits \n\n* Continued focus on the \"The Goal is Zero\" for injuries and incidents.\n\n* Implement MAXIMO program for all equipment preventive maintenance (tracking history)"
    }
  ]
}