{
  "FacilityID": 1000023646,
  "FacilityName": "Chemtura Corporation",
  "FacilityStr1": "214 W. Ruby Ave",
  "FacilityStr2": null,
  "FacilityCity": "Gastonia",
  "FacilityState": "NC",
  "FacilityZipCode": "28054",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37071",
  "LEPC": "Gaston County LEPC",
  "FacilityLatDecDegs": "35.243611",
  "FacilityLongDecDegs": "-081.187500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.chemtura.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3164464,
  "ParentCompanyName": "Chemtura Corporation",
  "Company2Name": null,
  "CompanyDUNS": 52813136,
  "Company2DUNS": 52813136,
  "OperatorName": "Chemtura Corporation",
  "OperatorStr1": "199 Benson Rd",
  "OperatorStr2": null,
  "OperatorCity": "Middlebury",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06749",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joe Pound",
  "RMPTitle": "EHS&S Manager",
  "FTE": 87,
  "OtherEPAFacilityID": "28054NRYLC214WE",
  "EPAFacilityID": "100000143392",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-08-21 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Gastonia Facility RMP Update & Name Change",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-08-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-11-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-11-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-11-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 35.24349,
  "FRS_Long": -81.18748,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000028875,
      "AltID": "Urethane Polymer Mfg.",
      "FacilityID": 1000023646,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000029157,
          "ProcessID": 1000028875,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034599,
          "ProcessID": 1000028875,
          "ChemicalID": 44,
          "Quantity": 200000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000034601,
          "ProcessID": 1000028875,
          "ChemicalID": 20,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 20,
            "ChemicalName": "Toluene 2,6-diisocyanate  [Benzene, 1,3-diisocyanato-2-methyl-]",
            "CASNumber": "91-08-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000034602,
          "ProcessID": 1000028875,
          "ChemicalID": 77,
          "Quantity": 61000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000534599,
          "ProcessID": 1000028875,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000534601,
          "ProcessID": 1000028875,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000534602,
          "ProcessID": 1000028875,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023646,
      "SummaryText": "The Chemtura Corporation Gastonia Plant, a 12 acre site, is situated in a residential neighborhood, with homes directly adjacent to the east and west fence lines.  To the north of the plant, directly adjacent to the fence line, is Catawba Creek, a tributary of the Catawba River.  The Catawba River feeds Lake Wylie, a major recreational usage lake.  Municipalities downstream of Lake Wylie, on the Catawba River, utilize the river as their major drinking water supply.  All stormwater leaving the plant site flows directly into Catawba Creek.\n\n\n\nAccess to the facility is via a two-lane street, lined with homes, and several blocks from a major throroughfare.\n\n\n\nThe Chemtura Corporation Gastonia facility manufactures Castable Urethane Prepolymers utilizing Toluene Di-isocyanate as a reactant, in combination with high molecular weight polyethers and polyesters.\n\n\n\nChemtura Corporation has a Responsible Care (t/m) Policy that has been adopted by the Gastonia facility.  This policy contains the key elements of our on-going safety and environmental programs.  Numerous written Standard Practices and Standard Operating Procedures are in place, and their implementation is documented.\n\n\n\nChemtura Corporation\n\nResponsible Care (t/m) Policy\n\n\n\nChemtura Corporation considers the safety and health of the public, its employees, contractors and customers and the protection of the environment for current and future generations to be our key priorities.  We are committed to meeting all applicable laws, regulations, permits and internal standards throughout the world.  Our goal is zero accidents and incidents, and zero harm to the environment.  Continued performance improvement will be achieved with the involvement and commitment of our employees to:\n\n\n\n? Conduct business ethically and in accordance with the Guiding Principles of Responsible Care&reg; and the concepts of Sustainable Development.\n\n? Implement the Chemtura Responsible Care Management System&copy;, which integrates environmen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023646,
      "SummaryText": "tal, healthy, safety and security considerations into daily business practices.\n\n? Develop objectives, set targets, measure and report performance to our stakeholders including the Chemtura Corporation Board of Directors Committee on Safety, Health and the Environment who monitor our commitment and performance progress.\n\n? Train and hold employees accountable for understanding and complying with this Policy.\n\n? Ensure that adequate resources are provided to achieve the objectives of this Policy.\n\n? Improve the safety of processes, reduce the quantity and/or hazard of wastes generated, and through our commitment to pollution prevention ? minimize or eliminate the release of contaminants to the environment.\n\n? Conserve and preserve the quality of natural resources such as water, air and fossil fuels, thereby framing our commitment to Sustainable Development.\n\n? Ensure all products and intermediates are properly registered, comply with applicable regulatory requirements and maybe safely used for their intended purpose.\n\n? Rehabilitate and redevelop former facilities for beneficial reuse.\n\n? Undertake audits of our facilities and third-party manufacturing facilities to ensure compliance with this Policy.\n\n? Enhance the security of our employees and facilities, our information systems and our raw materials and finished products throughout the value chain.\n\n? Participate with governmental agencies, the public, interested groups and industry associations in the development of reasonable and risk-based scientifically sound laws, regulations and public policy.\n\n? Seek public input and respond to stakeholder concerns about our products and operations.\n\n? Provide our employees, and other stakeholders with appropriate information necessary for their understanding of the environmental, health and safety aspects of our operations and products, our safety, health and environmental performance, and the contribution our products make to the quality of life.\n\n\n\nAccidental Release Pre"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000023646,
      "SummaryText": "vention and Emergency Response Policies\n\n\n\nThe Gastonia plant has several programs and policies to deal directly with accidental release and \n\nemergency response.  Additionally, an Environmental Management Manual has been prepared as part\n\nof their RC 14001 Registration.  Included in that manual are several policies, which also address release prevention and emergency response.\n\n\n\nRelease Prevention\n\n\n\nThe storage and handling of TDI is covered in several significant environmental aspects (Gastonia \n\nWSP #41).  Preventive maintenance, daily inspection documentation, and internal reporting requirements\n\nare covered in WSP #23, and SOP #30.\n\n\n\nEmergency Response\n\n\n\nEmergency response to a release of TDI is also covered in three main procedures:\n\n\n\nWSP #33 - Spill Prevention, Control and Countermeasures Plan, which includes TDI along with all other \n\nhazardous materials stored on site including fuel oil.\n\n\n\nSOP #25 - Emergency Procedure for Hazardous Release, which includes training, hazardous awareness, necessary PPE, and annual drills.\n\n\n\nWSP #28 - Emergency and Disaster Plan, which covers fires, natural disasters, civil disturbances, and\n\nbomb threats.\n\n\n\n\n\nWorst Case Release Scenario\n\n\n\nThe worst case release scenario modeled by Chemtura Corporation involves a release from our toluene di-isocyanate (TDI) storage tank equivalent to a 2-inch valve breaking.  The valve in this scenario would spill approximately 122,400 pounds of TDI into the secondary containment dike surrounding this tank.  The presence of this dike serves to limit the surface area of the spill, which extends the amount of time necessary for this material to completely evaporate.\n\n\n\nThe RMP submit Program Limits will not accept the actual modeling data.  \n\nActual modeling data is as follows\n\nTotal Quantity Released (Toxic Liquid Pool and Evaporation with Dike)  - 122,400 pounds\n\nEvaporation Rate - 0.02 pounds per minute\n\nRelease Duration - 6,120,000 minutes\n\n\n\nAs demonstrated by the above data, it wo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000023646,
      "SummaryText": "uld take many days for this material to completely evaporate due to the extremely low vapor pressure of this material at its storage temperature.  The toxic endpoint for TDI would occur within Chemtura Corporation's fence line.  Chemtura Corporation has emergency response and cleanup plans in place, and would clean up a release of TDI as quickly as possible to minimize impact to the environment and neighboring community.\n\n\n\nFive Year Accident History\n\n\n\nChemtura Corporation has not had a release of TDI with an off-site impact during the past five years.\n\n\n\nPlanned Safety Related Changes\n\n\n\nChemtura Corporation operates the Gastonia Plant with Safety as a high priority.  We work with our TDI supplier on periodic inspections to ensure we are safely handling TDI.  A level interlock device was installed on the TDI tank in response to one of these inspections."
    }
  ]
}