{
  "FacilityID": 1000012075,
  "FacilityName": "The Andersons Logansport Terminal",
  "FacilityStr1": "2345 South County Road 400 East",
  "FacilityStr2": null,
  "FacilityCity": "Logansport",
  "FacilityState": "IN",
  "FacilityZipCode": "46947",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18017",
  "LEPC": "Cass County LEPC",
  "FacilityLatDecDegs": "40.731111",
  "FacilityLongDecDegs": "-086.298611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.andersonsinc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7903628,
  "ParentCompanyName": "The Andersons, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7903628,
  "Company2DUNS": 0,
  "OperatorName": "The Andersons, Inc.",
  "OperatorStr1": "480 W. Dussel Drive",
  "OperatorStr2": "PO Box 119",
  "OperatorCity": "Maumee",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43537",
  "OperatorZipCodeExt": null,
  "RMPContact": "Anne Cook",
  "RMPTitle": "Regulatory Compliance Mgr",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059385",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-09-01 00:00:00",
  "SafetyInspectionBy": "Insurance Co inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-12-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-12-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-12-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-12-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.73111,
  "FRS_Long": -86.29861,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000014842,
      "AltID": "Aqua Ammonia",
      "FacilityID": 1000012075,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000015184,
          "ProcessID": 1000014842,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000017231,
          "ProcessID": 1000014842,
          "ChemicalID": 57,
          "Quantity": 133200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000517231,
          "ProcessID": 1000014842,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012075,
      "SummaryText": "Logansport RMP Executive Summary\n\nSource and Product Description\nThe Andersons Logansport Wholesale Fertilizer is engaged in the handling, storage, shipping and receiving of bulk agricultural fertilizers (liquid and granular). This facility has been operated by The Andersons, Inc. since the end of 1989.  Key personnel at the Logansport facility are Rod Erny, facility manager and Ron Hayden, operations manager.\n\nThe facility occupies approximately 16 acres and is situated just east of Hwy. 35 at 2345 S. County Rd. 400 East.  There are a few residences to the north, across the street, and a couple neighbors to the east.  Kent Feed is located adjacent to the facility on the south side.\n\nThe Logansport facility uses aqua ammonia as a raw material for producing various types of liquid agricultural fertilizers.  Aqua ammonia is a solution containing anhydrous ammonia and water.  One 18,000 gallon tank is used for bulk storage of  the liquid material.  Aqua ammonia is not a poison, but it is an inhalation / respiratory hazard.  Ammonia is a toxic material but it has no cumulative toxic effects on the human body.  However, it is acutely corrosive when it comes in contact with mucous membranes, in particular. Aqua ammonia is a non-flammable liquid.\n\nSummary of Major Hazards\nThe principal causes of ammonia emergencies are leaking pipes, as indicated by the alternative release scenario. Transfers from the bulk storage tank to the fertilizer mixing system occur inside fixed steel pipes and are automated from the control room.  No hoses are utilized in the operation.  \n\nA complete failure or burst tank, as indicated by the worst case scenario, is highly unlikely.  The storage tank was built under strict guidelines established in the ASME pressure vessel code. The storage tank is located inside a secondary containment dike.  Most major welding and structural work done on the tank or appendages is performed by certified welders.  \n\nExplanation of How Hazard Releases are Prevented."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012075,
      "SummaryText": "\nPassive mitigation refers to equipment, devices, or technologies that function without human, mechanical or other energy input.  The passive mitigation systems in place at the Logansport facility are:\n>  Secondary containment dikes that meet or exceed regulatory standards.\nActive mitigation refers to equipment, devices or technologies that require human, mechanical or other energy input to function.  Active mitigation systems in place at the Logansport facility are:\n>  Liquid valves on the tank which require manual effort to open or close.\n>  Back check valves are located on the unloading lines of delivery trucks and are designed to ensure that the flow goes in one direction only.  This prevents aqua ammonia from flowing to a transport tank from the storage tank.\n>  Spill control kits are located at the facility and include sorbent material, shovels, PPE and disposal containers.\n>  Operator and truck drivers supervise all transfers to and from the bulk storage tank\n\nPrevention Program\nPreventive maintenance is an integral piece of this facilityA?s hazard management program.  All hoses, tanks, valves and storage units are inspected at least monthly, and usually daily during the production season.  A good PM program is our strongest defense against a release of anhydrous ammonia. Records of major maintenance tasks performed on the tank or appendages are on file.\n\nSee Steps Taken to Address Hazards for more information on prevention measures and identification.\n\nManagement System\n(see Steps Taken to Address Hazards)\n\nEquipment maintenance\nAll equipment maintenance is formally documented. See the Prevention Program section for further explanation.\n\nTraining\nAll employees receive annual training on anhydrous ammonia, emergency action plan and spill procedures, and hazard communication.  Documentation and attendance rosters are on file at the facility.  \n\nContractors\nAll contractors receive a contractor safety review prior to performing work at the facility.  During this"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012075,
      "SummaryText": " review, they are informed of any potential hazards at the facility, emergency procedures, site-specific safety rules and the ability to request an MSDS for any product at any time.\n\nSteps Taken to Address Hazards\nThe Andersons Logansport Wholesale Fertilizer facility has many systems in place for hazard assessment and mitigation.  \n\nThe Safety Department performs annual hazard management audits at the facility.  The audits include a physical walk through of the entire facility and a review of all EPA, OSHA and DOT paperwork and training documentation.  Action items are noted and recommendations are made. The audits consist of five major topical areas:  Safety & Health, Environmental, Fire Protection & Security, Administrative and Housekeeping & Storage.  Issues are documented in a report and sent to the facility manager and upper management.\n\nFormal investigations are performed for all environmental or safety incidents.  Documentation is kept on file at the facility and the corporate Safety Department.\n\nMonthly Safety meetings allow employees to discuss any concerns they may have with the operation of the facility.  Issues are documented and assigned to employees for follow-up. Records of all meetings are kept at the facility.\n\nResponse Action in the Event of a Release\nIn the event of a leaking pipe or defective valve, employees are instructed to shut down the transfer process and, if possible, approach the shutoff valve from upwind and attempt to turn it off. \n\nFor an uncontainable release, employees will immediately call the police and fire department or other first responders, as appropriate.  All employees, customers and contractors are to be evacuated to an upwind location. Once the response team has arrived, we will work in concert with them to close the valves between the tank and the leak.  In the meantime, a steady spray of water will deluge the any resulting ammonia gases and knock it to the ground, while chemically binding any free ammonia.\n\nThe employee"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000012075,
      "SummaryText": "s are instructed to make emergency phone calls in this order:  the facility Manager, 911, the corporate Safety Department emergency phone number, the Indiana Emergency Response hotline and the Indiana Department of Environmental Management emergency phone number.  All applicable contact names and numbers are found in the facility spill and emergency response plan.\n\nCommunication procedures with responders \nThe local fire department has been invited to tour the Logansport facility in the past, and will continue to be invited on an annual basis.  Facility management, employees and fire department personnel have jointly discussed the location of the anhydrous ammonia and response procedures on a regular basis.  They need know the location of all emergency shutoff valves and on-site response equipment.  We believe that a strong relationship with first responders is our best defense.\n\nThe LEPC and state regulatory agencies receive a copy of our hazardous materials storage information, every February, in accordance with our community right to know obligations.  A copy of the Logansport Emergency Action Plan is on file with the LEPC and the local fire departments.\n\nSecurity Plans\nThe Department of Transportation (DOT), Research and Special Programs Administration (RSPA) 49 CFR Part 172, requires all facilities that offer or transport hazardous materials to document a security plan and perform employee awareness training.  \n\nA security assessment plan has been created to describe all security measures at this facility, identify any vulnerable areas and then document the measures taken to address those risks.  The plan is intended to work in conjunction with the Emergency Action and Spill Control Plan to meet all required criteria.\nAll potential employee candidates are interviewed and references are verified prior to hiring. \n\nThere is a fence around the entire perimeter of the facility.  The parking lot and railroad gates are locked during non-business hours.  All fulltime "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000012075,
      "SummaryText": "personnel have keys to secured buildings and management controls key distribution.  There is an electronic security system on the office. Inventory is closely monitored and access to visitors is restricted unless accompanied by Anderson personnel.  Outside lights throughout the facility provide additional security.\n\nChemicals are received via trailer, railcar or tank truck.  Numerous railcars may be staged on the track at one time.  Packaged chemicals may be stored in the maintenance shop or production areas.  Bulk liquid chemicals are stored in tanks inside secondary containment.  Tank valves are locked during non-business hours.  All tanks are labeled for contents.  \n\nInbound shipments of all products are inspected prior to storage or resale.  Any suspect product would be segregated and investigated.  Outbound shipments of hazardous materials are accompanied by DOT shipping papers and placards, if necessary. Contract carriers or customer-owned vehicles may be used to ship product.  Any suspicious product sales or inquiries would be investigated by facility management and shared with local authorities. \n\nEmergency procedures have been documented in the attached Emergency Action Plan and have been shared with the local Fire Department and LEPC.  Emergency phone numbers are posted outside the gate.\n\nTraining is performed with all employees annually and within 90 days of employment."
    }
  ]
}