{
  "FacilityID": 1000004524,
  "FacilityName": "Cooperative Producers, Inc.",
  "FacilityStr1": "34 U. S. Highway 83",
  "FacilityStr2": "P.O. Box 248",
  "FacilityCity": "Stapleton",
  "FacilityState": "NE",
  "FacilityZipCode": "69163",
  "Facility4DigitZipExt": "0248",
  "FacilityCountyFIPS": "31113",
  "LEPC": "Logan County LEPC",
  "FacilityLatDecDegs": "41.425283",
  "FacilityLongDecDegs": "-100.502150",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G7",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cooperative Producers, Inc.",
  "OperatorStr1": "P.O Box 248",
  "OperatorStr2": null,
  "OperatorCity": "Stapleton",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "69163",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kenny Wallace",
  "RMPTitle": "Regional Manager",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000040555",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-07-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-11-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-03-22 00:00:00",
  "DeRegistrationEffectiveDate": "2019-03-19 00:00:00",
  "AnniversaryDate": "2014-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.43111,
  "FRS_Long": -100.60278,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000005476,
      "AltID": "Product Storage",
      "FacilityID": 1000004524,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000005664,
          "ProcessID": 1000005476,
          "NAICSCode": "49313",
          "_desc": {
            "NAICS_CODE": "49313",
            "NAICS_DESCRIPTION": "Farm Product Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000006122,
          "ProcessID": 1000005476,
          "ChemicalID": 56,
          "Quantity": 260000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000506122,
          "ProcessID": 1000005476,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000004524,
      "SummaryText": "EXECUTIVE SUMMARY\n\nRisk Management Plan\nExecutive Summary for Logan County Cooperative Oil Association \nP.O. Box 248\nStapleton, NE  69163\n\nFacility Policy:\n\nThe management and employees operating each of our facilities are committed to the prevention of any accidental release of hazardous material transported or stores on our locations.  In the event an accidental release should occur, we are prepared to work with our local fire company, Emergency Response Personnel and other appropriate authorities deemed applicable depending on the specific incident, to best mitigate any release and to minimize the impact of the release to people and the environment.\n\nFacility Information:\n\nThe primary activity of our company is NAICS code 493130 for establishments engaged in providing A?agricultural inputsA? that include the receiving, storage, and reloading of Anhydrous Ammonia for delivery to farmers in our area. We include all crop protection and petroleum products in our planning, training, and maintenance programs, however only the Anhydrous Ammonia facilities will be include in this report. \n\nAnhydrous ammonia is received, stored and distributed for direct application to farm fields during the spring months.  Anhydrous ammonia may also be applied in the fall during some years.  During the balance of the year little if any product transfer occurs.  The Logan County LEPC and the local response agencies have been informed of the maximum quantities that may be on site at any given time. \n\nThe facility is operated on an A?as neededA? basis with staff present only during the receiving and reloading of product for delivery.  Our facilities have adequate light and are inspected at various times of the day and night throughout the year.  Time expended for these inspections is not included in our staffing calculation.\n\nWorst-case Release Scenario:\n\nThe A?Worst Case Release ScenarioA? is considered to be the release of the total contents of our largest anhydrous ammonia tank.  The max"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000004524,
      "SummaryText": "imum quantity released is based on 85% of the capacity of the largest vessel on site as limited by design standards. The distance to the endpoint (point of dispersion to 200 ppm) miles is based on the EPAA?s RMP-Comp Program (version 1.06).  Possible public and environmental receptors within the area have been provided to the County LEPC (Local Emergency Planning Committee) to assist them in planning for emergencies. \n\nAlternative Release Scenario:\n\nThere has not been an actual release of anhydrous ammonia during the last 5 years at the site.  We believe the most likely release would be caused by a break in a transfer hose.  Transfer hoses are protected by manual and self-closing excess flow valves, so our alternative release scenario is based on the loss of contents from the largest hose used (off loading transportation equipment).  The distance to the endpoint (point of dispersion to 200 ppm) was calculated per instructions by EPA guidance.\n\nAccidental Release Program:\n\nOur anhydrous ammonia accidental release program is based on guidelines found in the American National Standards Institute, Inc. (ANSI) standard K-61.1 A?Safety Requirements for the Storage and Handling of Anhydrous AmmoniaA?; and the U.S. Occupational Safety and Health Administration (OSHA) standard 29CRF 1910.111 A?Storage and Handling of Anhydrous AmmoniaA?.  We conduct annual employee training on the safe handling, transportation and distribution of anhydrous ammonia and have installed safety equipment including, but not limited to:  Excess flow valves at rises; barriers to avoid damage by trucks or other vehicles; and lock outs to prevent tampering when the site is unattended.  We also maintain routine contact with our local fire department and emergency response personnel; and have provided and/or participated in safety training exercises on anhydrous ammonia.  We have developed an Emergency Action Plan for all areas of our company including the anhydrous ammonia facility included in this pla"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000004524,
      "SummaryText": "n. In the event of a fire, explosion, tornado or other emergency that would initiate evacuation, emergency medical care, contacts for assistance, etc., this plan would be initiate to protect employees, customers, visitors, and the public. The primary emergency coordinator is listed in the Registration Section of this document.  Any of the following additional individuals may be contacted in the event the primary emergency coordinator cannot be reached:\n\n                      Title                               Work Phone                            Home Phone\n                     Manager                          308-636-2253                                   308-636-8121        \n\nFive-Year Accident History:\n\nThere has not been a release of anhydrous ammonia within the past five years that has caused death, injuries, significant property damage at the facility, nor to our knowledge has resulted in offsite death, injuries, evacuations, sheltering in place, property damage, or environmental change.\n\nEmergency Response Program:\n\nThis facility is included in the written Community Emergency Response Plan as prepared by the Local Emergency Planning Committee (LEPC), and the Nebraska Emergency Management Agency (NEMA Formerly Nebraska State Civil Defense Agency).  We also include these materials in our own Emergency Action Plan in accordance with OSHA Standard 29cfe 1910.38.  We have provided State and Local authorities all Community Right-to-Know Information requested as well as that required under SARA Title III (EPCRA).  Our written employee safety programs include pre-emergency planning and employee training in accordance with OSHA standards and are offered for review at any time by our Local Emergency Planning Committee (LEPC) to insure they conform to the community plan(s).  We actively encourage participation in our anhydrous ammonia training programs by the local fire department, local emergency response team, community planners, etc., that may be expected to respond to an incident"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000004524,
      "SummaryText": " at our site.\n\nPlanned Changes to Improve Safety:\n\nSafety improvement is an on-going process at all our facilities.  Periodic evaluations are performed to assess the maintenance of safe condition.  There are no additional specific recommendations for implementation at this time.\n\nAdditional Information:\n\nFor additional information, response to questions, or comment, please contact the company Manager at 308-636-2253 during regular business hours."
    }
  ]
}