{
  "FacilityID": 1000111266,
  "FacilityName": "SI Group Baytown",
  "FacilityStr1": "4604 West Baker Road",
  "FacilityStr2": null,
  "FacilityCity": "Baytown Texas",
  "FacilityState": "TX",
  "FacilityZipCode": "77520",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-Baytown Area LEP",
  "FacilityLatDecDegs": "29.770833",
  "FacilityLongDecDegs": "-95.018611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.siigroup.com",
  "FacilityEmailAddress": "adam.handly@siigroup.com",
  "FacilityDUNS": 80502655,
  "ParentCompanyName": "SI Group, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 146710330,
  "Company2DUNS": null,
  "OperatorName": "SI Group, Inc.",
  "OperatorStr1": "4604 West Baker Road",
  "OperatorStr2": null,
  "OperatorCity": "Baytown Texas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77520",
  "OperatorZipCodeExt": null,
  "FTE": 26,
  "OtherEPAFacilityID": "77520TXSPT464WB",
  "EPAFacilityID": "100000028551",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-3320",
  "SafetyInspectionDate": "2022-08-23 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-05-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-05-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-05-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 29.771018,
  "FRS_Long": -95.018456,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000138654,
      "AltID": "Baytown Flammables",
      "FacilityID": 1000111266,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000173499,
          "ProcessID": 1000138654,
          "ChemicalID": 98,
          "Quantity": 480000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000173498,
          "ProcessID": 1000138654,
          "ChemicalID": 155,
          "Quantity": 1290000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000154676,
              "ProcessChemicalID": 1000173498,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000154675,
              "ProcessChemicalID": 1000173498,
              "ChemicalID": 129
            }
          ]
        },
        {
          "ProcessChemicalID": 1000173496,
          "ProcessID": 1000138654,
          "ChemicalID": 155,
          "Quantity": 2330108.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000154674,
              "ProcessChemicalID": 1000173496,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000154673,
              "ProcessChemicalID": 1000173496,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000154672,
              "ProcessChemicalID": 1000173496,
              "ChemicalID": 140
            },
            {
              "FlamMixChemID": 1000154671,
              "ProcessChemicalID": 1000173496,
              "ChemicalID": 146
            },
            {
              "FlamMixChemID": 1000154670,
              "ProcessChemicalID": 1000173496,
              "ChemicalID": 147
            },
            {
              "FlamMixChemID": 1000154669,
              "ProcessChemicalID": 1000173496,
              "ChemicalID": 141
            },
            {
              "FlamMixChemID": 1000154668,
              "ProcessChemicalID": 1000173496,
              "ChemicalID": 126
            },
            {
              "FlamMixChemID": 1000154667,
              "ProcessChemicalID": 1000173496,
              "ChemicalID": 116
            },
            {
              "FlamMixChemID": 1000154666,
              "ProcessChemicalID": 1000173496,
              "ChemicalID": 138
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000140147,
          "ProcessID": 1000138654,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000119300,
              "Process_NAICS_ID": 1000140147,
              "SafetyReviewDate": "2024-01-12 00:00:00",
              "PHA_Date": "2022-08-10 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2027-11-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-04-17 00:00:00",
              "TrainingReviewDate": "2024-02-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "CBT",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-01-05 00:00:00",
              "EquipmentInspectionDate": "2023-12-30 00:00:00",
              "EquipmentTested": "T-307",
              "ChangeMgmtDate": "2024-04-24 00:00:00",
              "ChangeMgmtReviewDate": "2023-11-22 00:00:00",
              "PreStartupReviewDate": "2023-10-10 00:00:00",
              "ComplianceAuditDate": "2021-11-18 00:00:00",
              "AuditCompletionDate": "2023-12-13 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2024-05-02 00:00:00",
              "HotWorkPermitReviewDate": "2023-08-29 00:00:00",
              "ContractorSafetyReviewDate": "2023-09-28 00:00:00",
              "ContractorSafetyEvalDate": "2023-04-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000149442,
                  "PreventionProgram3ID": 1000119300,
                  "ProcessChemicalID": 1000173496
                },
                {
                  "PrimaryKey": 1000149441,
                  "PreventionProgram3ID": 1000119300,
                  "ProcessChemicalID": 1000173498
                },
                {
                  "PrimaryKey": 1000149440,
                  "PreventionProgram3ID": 1000119300,
                  "ProcessChemicalID": 1000173499
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000111266,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-10-16 00:00:00",
    "ERTrainingDate": "2024-04-10 00:00:00",
    "CoordinatingAgencyName": "Office of Emergency Management",
    "CoordinatingAgencyPhone": "2814221193",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 1000111266,
      "SummaryText": "afety reviews, several action items were identified and implemented to improve upon the existing safeguards and to further reduce the potential for accidental release.  Significant projects based on PHA over the past several years include replacement of the flare with a new, taller flare, and removal of Butadiene from the site.  The process hazard analysis for the RMP chemicals as the Baytown site are reviewed and revalidated at least every five years."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000111266,
      "SummaryText": "mployee Participation\nAll employees at the Baytown plant have opportunities to access and participate in the sharing of information related to process safety for the processes involving RMP chemicals on our site. Employees routinely have opportunities to participate in safety processes under the prevention program such as process hazard analyses, management of change, employee training and incident investigations.\n\nHot Work Permits\nThe Baytown plant has established a hot work permit system. The hot work permit system applies to the process. Under the system, a hot work permit must be issued prior to commencing hot work operations. Hot work operations may include burning, welding, torch cutting, or any spark-emitting equipment/activity.  Hot work permits are maintained for at least 3 years within the electronic work permitting system. \n\nContractors\nPrior to commencing work on plant, each contractor has received prior approval through our procurement group and each contract employee must have attended the Houston Area Safety Training Council training and received site specific safety training. The safety orientation covers information on the hazards associated with the process areas where the work will be performed, safety procedures and systems to be used, and a review of plant safety rules. After completing safety training, the Contractor is responsible for ensuring that each contract employee performs work in a manner consistent with the information provided during the safety orientation. If the contractor assigns new employees to the job after work has commenced, the contractor must also ensure that each new employee has received a safety orientation prior to starting work on plant. Failure of the contractor or any contractor employee to abide by these requirements is grounds for immediate dismissal from the plant.\n\nPlanned Changes to Improve Safety\nThe Baytown plant completed a process hazard analysis revalidation in August 2022. As a result of these systematic s"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000111266,
      "SummaryText": "tions, a process hazard analysis has been completed, employee training has been completed, and safety, operating, maintenance, and emergency procedures are in place. A PSSR is also conducted for process changes where the approved MOC indicates a change in the process safety information is required. A team of employees having knowledge of the process, equipment, procedures and safety requirements operating conditions conducts the PSSR. All items on the PSSR checklist that are critical to startup must be satisfied prior to commencing startup.\n\nCompliance Audits\nCompliance audits for the process are conducted at least every three years with the last audit being conducted in November 2021 to ensure that the elements of the general accidental release prevention program are up to date and are being implemented and to ensure compliance to the RMP program. Personnel having experience and knowledge of the covered processes and knowledge of the program requirements conduct the compliance audits. \n\nIncident Investigation\nAny incident that could have resulted in a catastrophic release of any RMP chemicals would be investigated promptly. The incident investigation process would start with the completion of an Event Report prepared at the time of the incident. The incident investigation team is made up of employees having experience and knowledge of the processes affected by the incident, and knowledge of completing incident investigations. Following the incident investigation, a report is prepared to include the following information: (a) date, time, and location of the incident; (b) names of employees on the incident investigation team; (c) description of the incident, including a chronology of events; (d) root causes and contributing causes, and; (e) recommendations to prevent a recurrence. Follow-up actions which are taken as a result of the recommendations in the incident investigation report are documented, and records of the reports and follow-up actions are maintained.\n\nE"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000111266,
      "SummaryText": "ping systems, pressure relief and vent systems, emergency control devices, pumps, and valves. Written procedures are established to define the scope and requirements of the mechanical integrity program. Maintenance employees engaged in carrying out the mechanical integrity program are trained to complete the required tasks in a safe manner.\nOne component of the mechanical integrity program includes inspection and testing of process equipment. Equipment inspection and testing conducted in accordance with manufacturer's recommendations and generally accepted good engineering practices. Records of inspections and testing are maintained.  If deficiencies are noted during equipment inspection and testing, corrective actions are taken in a timely manner to assure safe operation of the process.\nAn Emergency generator used to power the DCS system to ensure potential releases are quickly detected is maintained through the Mechanical Integrity program also. \n\n\nManagement of Change\nOne component of the plant's Process Safety Management (PSM) program is a written procedure for the Management of Change (MOC). Except for replacements in kind, any change to the PSM-covered process requires completion and approval of an MOC prior to making the change. Such changes include new process chemicals, new technologies, new or modified equipment, new or modified operating conditions, and new or modified procedures. The MOC must be reviewed and approved by a team of employees having experience and knowledge of applicable regulatory requirements. The MOC must describe the proposed change and its impact on employee health and safety, the purposes and benefits of the change, the target date for the change to take effect, and whether the change is temporary or permanent. \n\nPre-Startup Safety Review\nPrior to startup of a new process involving RMP chemicals and on the plant site, a pre-startup safety review (PSSR) is conducted to ensure that the equipment and installation meets design specifica"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000111266,
      "SummaryText": "of process control devices, equipment location, and human factors. A team of employees having experience and knowledge of the process design and operation, and knowledge of how to complete a process hazard analysis performs each process hazard analysis. The Management of Change process (described below) is used to track and document process changes, which occur as a result of recommendations from process hazard analyses.\n\nOperating Procedures\nWritten operating procedures are prepared for the manufacturing process including the RMP chemicals located within our facility. The operating procedures provide clear instructions for safely conducting activities in the plant. The procedures are maintained up to date to reflect current operating practices and are certified annually for accuracy.\nSpecific information and instructions covered by the operating procedures include startup, normal operation, emergency operation, shutdown, operating limits, operating controls, chemical-specific health and safety information, required personal protective equipment, and use of safety systems. Written procedures are also provided for specific operations such as lockout/tag out, confined space entry and line breaking.\n\nTraining\nEmployees currently engaged in operating the manufacturing process, including the RMP chemicals of interest at our site, have received training to ensure they have the required knowledge, skills, and abilities to safely carry out the requirements specified in the written operating procedures. Refresher training is provided every three years at a minimum, or sooner if warranted by changes to operating conditions, equipment or procedures.  Training records are maintained for each employee to show the date training was conducted and the material covered by the training.\n\nMechanical Integrity\nThe Baytown Plant maintains the mechanical integrity of equipment used to process and handle RMP listed chemicals. Such equipment includes pressurized vessels, storage tanks, pi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000111266,
      "SummaryText": "provides for the implementation of an Incident Command System to direct and coordinate the plant's response activities. The Plan has been coordinated with LEPC, MAMB, local industry.  Annual drills of the plant's emergency response system are performed.\n\nProcess Safety Information\nWritten process safety information is compiled before conducting process hazard analyses for the manufacturing process including the RMP chemicals. This enables the employees involved in operating these processes to identify and understand the potential hazards associated with the processes. The information complied includes data on the safe use and handling of the regulated chemicals (e.g., Safety Data Sheets), data on the process technology (e.g., Process Flow Diagrams, process chemistry, flow rates and storage capacities, operating limits and evaluation of exceedances), and data on the equipment used in the process (e.g., Piping & Instrument Diagrams, materials compatibility, energy ratings and classification, control devices and emergency systems, ventilation systems, design basis including conformance to applicable codes and standards). The process safety information is adequate to show compliance of the process design with generally accepted good engineering practices.\n\n\n\nProcess Hazard Analyses\nProcess hazard analyses for the manufacturing process have been completed in accordance with 29 CFR 1910.119(e) (OSHA Process Safety Management). These process hazard analyses are updated and revalidated in accordance with 29 CFR 1910.119(e)  In general, one or more of the following methodologies are used to complete each process hazard analysis: (a) what-if evaluation; (b) checklist; (c) hazard and operability study (HAZOP); (d) failure mode and effects analysis (FMEA); (e) fault tree; (f) process mapping, and (g) cause and effect matrix. Each process hazard analysis addresses the process hazards, process incident history, process control devices and detection systems, evaluation of failure"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000111266,
      "SummaryText": "and improvement by strict attention to changes in the operations through a MOC (Management of Change) process, a thorough review through PHAs (Process Hazard Analyses) of potential incidents that could lead to accidental releases, and verification of effectiveness of process control (LOPA \u0096 Layer of Protection Analysis).\n\nRegulatory accidental release prevention programs with which SI Group Freeport complies are OSHA PSM and EPA RMP.  Actions taken for compliance with PSM greatly impact our compliance with RMP.  Engineering standards, such as ASTM and ANSI, are followed to ensure mechanical integrity in design and construction.\n\n5-year accident history\nThere have been no incidents involving RMP regulated flammable chemicals at this site that meet the requirements of 40 CFR 68.42(a) within the past 5 years.\n\nEmergency Response\nThe Baytown facility participates and is active in a local Community Advisory Panels (CAP) that serves as important links between chemical facilities and their neighboring communities. \n\nThe site has its own highly trained Emergency Response Team.  Training and drills are conducted in emergency preparedness and response, HAZMAT/HAZWOPER, medical response, and fire-and-rescue techniques to ensure a safe environment for our employees and the public. \n\nSite employees participate in routine safety observations to continually improve safety across the site. \nThe Baytown plant has an emergency preparedness planning and response program designed to deal with accidental releases and other unplanned events associated with the facility. The plant has a written Emergency Response Plan that addresses various types of contingencies including specific actions for responding to an accidental chemical release. The Plan provides for both internal plant and external community emergency alerting. The Plan addresses emergency health care, sheltering in place, evacuation, emergency responsibilities, response and control procedures, and emergency equipment. The Plan"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000111266,
      "SummaryText": "SI GROUP, INC. - TEXAS OPERATIONS - BAYTOWN\n\nRMP EXECUTIVE SUMMARY [40 CFR 68.155]\n\nSI Group, Inc. \u0096 Baytown is a chemical manufacturing complex located at 4604 West Baker Road in Baytown, Tx.  SI Group\u0092s Baytown plant is subject to the requirements of 40 code of Federal Regulations (CFR) Part 68 \u0096 Chemical Accident Prevention Provisions.  The plant operates an organic chemical manufacturing facility and bulk storage terminal.  \nThe following regulated substances from Table 1-4 of 40 CFR 68.130 List of Regulated Substances and Threshold Quantities for Accidental Release Prevention (located in Appendix A) are present at the Baytown facility:\n\n\n Regulated Substance\t\tCAS\nPropane\t\t                     74-98-6\nPropylene\t\t\n\tPropane\t                     74-98-6\n\tPropylene\t                     115-07-1\nIsoprene/Raffinate\t\t\n\tPentane\t                    109-66-0\n\t1-Pentene                       109-67-1 \n\t1,3 Pentadiene\t            504-60-9\n\t3-Methyl-1-butene\t   563-45-1\n\t2-Methyl-1-butene\t   563-46-2\n\t2-Pentene (Z)               627-20-3\n\t2-Pentene (E) \t           646-04-8\n\tIsopentane [Butane, 2-methyl-]\t78-78-4\n\tIsoprene [1,3-Butadiene, 2-methyl-]\t78-79-5\n \nThere are no RMP regulated toxic chemicals on-site.\n\nAccident Prevention, Emergency Response, and Prevention Program\nSite procedures/policies limit normal operating levels to 85-90% in the tanks and sphere.  All RMP regulated flammable chemicals are stored on-site in the flammable tank farm are which is equipped with area and line gas detectors.  The spheres also have deluge coverage on the top of the sphere.  All site facilities are operated in strict accordance with written operating and maintenance procedures.\n\nPrevention, detection, and mitigation of and response to accidental releases are accomplished through a holistic system approach involving several means including design, construction, training, instrumentation, process control, and procedures.\n\nSI Group's systems approach ensures continual operational control"
    }
  ]
}