{
  "FacilityID": 1000014771,
  "FacilityName": "MillerCoors LLC (Albany, GA)",
  "FacilityStr1": "405 Cordele Road",
  "FacilityStr2": null,
  "FacilityCity": "Albany",
  "FacilityState": "GA",
  "FacilityZipCode": "31705",
  "Facility4DigitZipExt": "2109",
  "FacilityCountyFIPS": "13095",
  "LEPC": "Dougherty County LEPC",
  "FacilityLatDecDegs": "31.5936",
  "FacilityLongDecDegs": "-084.088331",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.millercoors.com",
  "FacilityEmailAddress": "dixon.david@millercoors.com",
  "FacilityDUNS": 827129540,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "MillerCoors LLC",
  "OperatorStr1": "405 Cordele Road",
  "OperatorStr2": null,
  "OperatorCity": "Albany",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31705",
  "OperatorZipCodeExt": "2109",
  "RMPContact": "David Dixon",
  "RMPTitle": "Environmental Co-ordinator",
  "FTE": 622,
  "OtherEPAFacilityID": "31708MLLRB405CO",
  "EPAFacilityID": "100000081047",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "20820950010V030",
  "SafetyInspectionDate": "2008-03-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-07-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-07-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-07-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 31.59653,
  "FRS_Long": -84.13808,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018536,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000014771,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000018865,
          "ProcessID": 1000018536,
          "NAICSCode": "31212",
          "_desc": {
            "NAICS_CODE": "31212",
            "NAICS_DESCRIPTION": "Breweries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021976,
          "ProcessID": 1000018536,
          "ChemicalID": 56,
          "Quantity": 157532.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000521976,
          "ProcessID": 1000018536,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014771,
      "SummaryText": "MillerCoors LLC is committed to promoting a safe working environment and has developed and implemented several programs to enhance chemical safety. The facility operates an ammonia refrigeration process and has several methods for ensuring employee and public safety associated with this process.  The facility has developed procedures, plans and policies for the operation of the ammonia process and for dealing with unexpected accidental releases.  MillerCoors LLC has implemented a process safety management program that enhances safety by regular maintenance and inspections, hazard analysis, compliance audits, employee and contractor training, employee participation, ammonia monitoring/detection, and other activities.  The MillerCoors facility has a Certified Ammonia Response Team that is trained for hazardous material response and additional training to include incident command and confined space rescue.  The facility also has emergency response procedures and plans to promote chemical safety in the event of an emergency situation.\n\nMillerCoors LLC is engaged in the beer production business.  As part of the brewing process, an ammonia refrigeration system is utilized.  Due to the quantity of ammonia maintained on-site, the facility is subject to the Risk Management Program regulations which are meant to promote safety at the facility and general public level.\n\nA worst-case release scenario was modeled to determine the greatest impact a release of ammonia from the facility could reasonably cause.  This scenario is based on a complete and total release of ammonia from the largest ammonia vessel located at the facility. Computer modeling was used to reasonably evaluate the impacts from such a release.  Pursuant to the April 9, 2004 revisions (69 FR 18819) to Section 68.155(c) of the RMP rule, details of the off-site consequence analysis of the worst case release scenario are included in the individual elements of the RMP Plan. \n\nAn alternative release scenario was also "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014771,
      "SummaryText": "evaluated.  The alternative release scenario is based on a leak in ammonia piping located on the roof of the facility.  The alternative release scenario is a scenario that is more likely to occur than the worst-case scenario. The rationale for the alternate release scenario is documented in the Risk Management Plan Summary Document kept on site at the facility. RMPCOMP was used to evaluate the impacts from such a release. Since the release did not extend off-site, there is no off-site consequence analysis of the alternate release  included in the individual elements of the RMP Plan. \n\nIn the previous five years, the MillerCoors facility has not had any accidental releases that resulted in any deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage from the ammonia process.\n\nThe MillerCoors facility is subject to the Process Safety Management regulations under the Occupational Safety and Health Administration (OSHA).  As a result of these regulations, the MillerCoors facility has implemented and regularly updates a program to further enhance process safety which involves operating procedures, training, mechanical integrity (maintenance related issues), pre-start-up-review, management of change, compliance audits, incident investigation, employee participation, hot work (welding) permits, and contractor safety.\n\nThe facility's Emergency Response Plan contains regularly updated information regarding emergency contacts, emergency recognition and prevention, emergency medical treatment and first aid, procedures for handling emergency incidents, personal protective equipment and emergency equipment, and procedures for reporting incidents to local, state and federal agencies.  As previously mentioned, the brewery maintains a Certified Ammonia Response Team that receives extensive annual training to deal with an accidental release at the facility.\n\nAs part of the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014771,
      "SummaryText": " Emergency Contingency Plan, the MillerCoors facility has a written statement of commitment from local resources to assist in the event of an emergency that the Certified Ammonia Response Team is unable to handle or one that may impede on the surrounding community.  These agencies include the Albany Fire Department and the Albany Police Department."
    }
  ]
}