{
  "FacilityID": 1000012837,
  "FacilityName": "Helena Chemical Company - Mempis, MO",
  "FacilityStr1": "Rural Route 2, Box 27H",
  "FacilityStr2": null,
  "FacilityCity": "Memphis",
  "FacilityState": "MO",
  "FacilityZipCode": "63555",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29199",
  "LEPC": "Scotland County LEPC",
  "FacilityLatDecDegs": "40.499769",
  "FacilityLongDecDegs": "-92.161764",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "smithscott@helenachemical.com",
  "FacilityDUNS": 7036759,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Chemical Company",
  "OperatorStr1": "Rural Route 2, Box 27H",
  "OperatorStr2": null,
  "OperatorCity": "Memphis",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63555",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": "None",
  "EPAFacilityID": "100000065699",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-27 00:00:00",
  "SafetyInspectionBy": "Department of Agriculture/W&M/Anhy. Ammonia Div.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-05-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-05-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-05-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-05-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.49958,
  "FRS_Long": -92.16114,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016008,
      "AltID": "Tank Storage & Filling",
      "FacilityID": 1000012837,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000018949,
          "ProcessID": 1000016008,
          "ChemicalID": 56,
          "Quantity": 312917.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000016390,
          "ProcessID": 1000016008,
          "NAICSCode": "42491",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000011049,
              "Process_NAICS_ID": 1000016390,
              "SafetyReviewDate": "2008-05-07 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2008-05-07 00:00:00",
              "ChangeCompletionDate": "2008-06-07 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Terrorist and criminal activities",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Audio, Visual and Olfactory Inspection",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Relocated the storage tanks and re-plumbed the filling system to allow for two nurse tanks to be filled at the same time.",
              "OpProceduresReviewDate": "2008-05-07 00:00:00",
              "TrainingReviewDate": "2008-05-07 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Observation",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-05-07 00:00:00",
              "EquipmentInspectionDate": "2010-03-01 00:00:00",
              "EquipmentTested": "Hoses, placards, gauges, pressure relief valves, percentage gauges, tires, bearings, running gears, plumbing lines, valve locks, welds, etc...",
              "ComplianceAuditDate": "2008-05-07 00:00:00",
              "AuditCompletionDate": "2008-06-07 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2009-10-12 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Operations Manager implements the Risk Management Plan (RMP) and Risk Management Program (RMPr) for the Tank Storage & Filling of anhydrous ammonia at this facility and is assisted by other Helena staff as directed.  The Risk Management Program includes an Accident Prevention Program that includes Safety Information, Hazard Analysis, Operating Procedures, Training, Maintenance, Compliance Audits, and Incident Investigation.  Equipment included under this covered process includes (1) a 30,000-gallon storage tank and ancillary pumps, piping, and valves, (2) two (2) 6,000-gallon storage tank and ancillary pumps, piping, and valves, (3) a nurse tank filling area and ancillary piping, valves, and hoses, and (4) fifteen (15) 1,000-gallon nurse tanks.  Helena personnel perform the transfer of anhydrous ammonia from the storage tank to the nurse tanks.\n\nHelena receives anhydrous ammonia by a vendor that transports the anhydrous ammonia with a 10,000-gallon commercial truck.  The commercial truck is temporarily parked on the Facility property while the anhydrous ammonia is transferred to the on-site storage tanks.  The transfer process from the commercial truck is performed by the commercial truck operator.  Helena does not own or operate the commercial truck.  The vendor is responsible to Helena for complying with relevant operation, maintenance, and training procedures and documentation.  At a minimum, the vendor must (1) have in place and certify compliance with applicable and relevant DOT and OSHA regulations, (2) make available to Helena and EPA upon request any contractor-related documentation necessary to demonstrate compliance, and (3) certify that it has in place emergency shut-down procedures for ammonia unloading operations and that its OSHA and DOT programs comply with federal, state, and local regulatory requirements.  Further, Helena will provide a copy of its Contingency Plan to its vendor for review and a copy of its RMPr Document upon request.\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000011315,
                  "PreventionProgram2ID": 1000011049,
                  "ProcessChemicalID": 1000018949
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000012837,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Scotland County LEPC",
    "CoordinatingAgencyPhone": "6603414941",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "This is a non-responding facility and it coordinates its response activities with the LEPC and local Fire Department.  Notification information and procedures are provided in its Contingency Plan."
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012837,
      "SummaryText": "The Helena Chemical Company (Helena) Memphis Facility has submitted this updated electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68. Standards codified by the Occupational Safety and Health Administration at 29 CFR 1910.119 are not applicable to the operations at this facility because the facility is operated as a retail operation and is exempt from the OSHA standards. However, the OSHA standards at 29 CFR 1910.111, Storage and Handling of Anhydrous Ammonia, are applicable and are included in the Risk Management Program (RMPr) document that is implemented by this Facility.\n\nThis electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Memphis Facility located approximately 1.6 miles north of Memphis and east of Route 15 at Rural Route 2 Memphis, MO 63555.  The electronic RMP summarizes the policies and procedures implemented by the Memphis Facility to minimize the likelihood of an accident.  The electronic RMP also summarizes the actions that the Memphis Facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner.\n\nPURPOSE FOR UPDATING RMP\n\nHelena has updated this RMP and is resubmitting it as a 5-Year update.  Due to the changes in the size and locations of the anhydrous ammonia storage tanks, Helena updated the off-site consequence analysis for the worst case scenario and alternative case scenarios.\n\nFACILITY\n\nThe Memphis Facility is a retail agricultural chemical facility.  Anhydrous ammonia is transported to the Facility via a commercial truck (10,000 gallon) and then transferred to one of three on-site storage tanks.  The on-site storage tanks include a single (1) 30,000-gallon and two (2) 6,000-gallon storage tanks.  The commercial truck operator performs the transfer.  \n\nHelena stores the anhydrous a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012837,
      "SummaryText": "mmonia in its three on-site storage tanks and then transfers the anhydrous ammonia from the storage tank to nurse tanks.  Helena performs this operation in accordance with its Risk Management Program that includes a prevention program.  This facility has 15 1,000-gallon nurse tanks.\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\nWorst case and alternative case consequence analyses were completed for the ammonia storage and filling process. The worst case scenario release for the Retail Facility assumed that all the contents in the largest single storage tank were released.  The release was modeled as if the ammonia tank was punctured on the side at the ground level. The resulting release of ammonia was modeled as a ground level horizontal jet.\n\nThe alternative (or more likely to occur) scenario assumes a rupture of a 2-inch line caused by an impact from a vehicle or some other source on the liquid ammonia transfer line during a major loading or unloading operation.  Although this event is classified as an alternative scenario, even an accident of this type is unlikely to occur due to the safety equipment (excess flow devices, check valves) and operating procedures that Helena uses to safeguard ammonia transfer operations.\n\nBoth the worst case and alternative scenario are overly conservative because even a 2-minute release is unlikely to occur since excess flow valves on the system should close immediately upon increased flow resulting from the severed transfer line.\n\nACCIDENT PREVENTION PROGRAM\n\nThe Operations Manager implements the risk management planning process at this Helena facility.  The Operations Manager is assisted by other Helena staff, as directed.  The Operations Manager is responsible for ensuring that Helena Staff are properly trained in the implementation of the Prevention Program 2 Program which includes Safety Information, Hazard Analysis, Operating Procedures, Training, Maintenance, Compliance Audits, Incident Investigations, and Emergency Contingency Plans.\n\nEM"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012837,
      "SummaryText": "ERGENCY RESPONSE PROGRAM\n\nHelenaA?s Memphis Facility is a non-responding facility. Helena has coordinated emergency response activities with its local emergency response agency and local fire department.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Memphis Facility.\n\nCONCLUSION\n\nThe Risk Management Plan implemented by Helena Chemical Company at the Memphis Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Memphis Facility adds, deletes, or changes processes. The Emergency Response Program has been coordinated with the Scotland County LEPC.\n\nNOTE: Sections 4, 5, 6, and 7 of the standard RMP produced by EPAA?s RMP Submit Program are not applicable to the Memphis Facility.\n"
    }
  ]
}