{
  "FacilityID": 1000024717,
  "FacilityName": "United States Cold Storage, Miller Circle",
  "FacilityStr1": "4000 Miller Circle N",
  "FacilityStr2": null,
  "FacilityCity": "Bethlehem",
  "FacilityState": "PA",
  "FacilityZipCode": "18020",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42077",
  "LEPC": "Lehigh County LEPC",
  "FacilityLatDecDegs": "40.679126",
  "FacilityLongDecDegs": "-075.363894",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.uscold.com",
  "FacilityEmailAddress": "info@uscold.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "United States Cold Storage, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Frank Marino",
  "OperatorStr1": "4000 Miller Circle N",
  "OperatorStr2": null,
  "OperatorCity": "Bethlehem",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18020",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gerald Kresh",
  "RMPTitle": "Assistant Chief Engineer",
  "FTE": 79,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000159446",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-06-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-12-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-04-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-04-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-04-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.67917,
  "FRS_Long": -75.36389,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000030310,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000024717,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000030629,
          "ProcessID": 1000030310,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000036434,
          "ProcessID": 1000030310,
          "ChemicalID": 56,
          "Quantity": 26783.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000536434,
          "ProcessID": 1000030310,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024717,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n- Accidental Release Prevention and Emergency Response Policies\n\n\n\nUnited States Cold Storage is strongly committed to employee, public, and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with our regulated process. It is our policy to implement appropriate controls to prevent possible accidental releases of regulated substances. However, if such an accidental release does occur, we are coordinated with the Bethlehem Fire Department and the Lehigh County Local Emergency Planning Committee for emergency response support.\n\n\n\n\n\n- The Stationary Source and the Regulated Substances Handled\n\n\n\nPresently Anhydrous Ammonia is the only RMP regulated substance present at this facility above a threshold quantity.  Ammonia is utilized as the primary cooling media in our closed-loop refrigeration systems. The system's purpose is to provide refrigeration and cold storage capabilities for Schenker Logistics operations.  Due to the  and characteristics of our ammonia refrigeration systems, as well as Process Safety Management (PSM) applicability, this location is covered under Program 3 of the RMP regulations.\n\n\n\n- Offsite Consequence Analysis \n\n\n\nThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario have been completed as stated in Section 2 and 3 of the RMP*eSubmit text.\n\n\n\nTo evaluate both the worst case, and alternative release scenarios, EPA's RMP Comp Hazardous Release software was utilized exclusively. The RMP Comp models are referenced in the RMP Offsite Consequence Analysis Guidance as an acceptable model for the release scenario mathematical approximation process.\n\n\n\nAs specified in the RMP Guidance, the worst case and alternate case release scenari"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024717,
      "SummaryText": "os have been calculated and the results of the calculations are documented in the Schenker Logistics RMP Plan on file at the facility.  Public and environmental receptors that could possibly be affected by the release scenarios were determined through the use of LANDVIEW VI mapping system software and US Census Bureau 2010 data. \n\n\n\n- The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\n\n\nUnited States Cold Storage has taken all necessary steps to comply with the accidental release prevention requirements set forth in 40 CFR Part 68.  To meet these necessary requirements Schenker Logistics has implemented their Process Safety Management program through the written guidelines stated in the OSHA PSM Standard, 29 CFR 1910.119. \n\n\n\n- Accident History\n\n\n\nThere have been no ammonia related incidents at this facility within the last five years that have resulted in on, or off site property damage, injuries or deaths.\n\n\n\n \n\n\n\n- Emergency Action Plan\n\n\n\nUnited States Cold Storage current Emergency Action Plan focuses on evacuation of the facility in the event of an ammonia emergency, with the assistance from local emergency response agencies performing rescue, firefighting, first-aid, medical treatment, and other response functions. The facility maintains a written Emergency Action Plan to document specific procedures to be implemented in the event of various emergencies, including ammonia release. The plan includes procedures for facility evacuation, as well as for notification to the local emergency response agencies, which are responsible for notifying the public. The plan is promptly updated to reflect any pertinent changes taking place within the facility that would require modified procedures.\n\n\n\n- Planned Changes to Improve Safety:\n\n\n\nUnited States Coild Storage currently has no changes planned for the ammonia refrigeration processes at this time.   However, the processes will be subjected to periodic process hazard analysis re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024717,
      "SummaryText": "views for the purpose of identifying potential hazards and implementing the necessary improvement to provide a safer system. Schenker Logistics personnel will also periodically review all potential opportunities to improve the safety of our personnel, the surrounding community, and the ammonia refrigeration processes.\n\n"
    }
  ]
}