{
  "FacilityID": 1000069521,
  "FacilityName": "Channelview Splitter",
  "FacilityStr1": "16518 De Zavalla Road",
  "FacilityStr2": null,
  "FacilityCity": "Channelview",
  "FacilityState": "TX",
  "FacilityZipCode": "77530",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "North Channel LEPC",
  "FacilityLatDecDegs": "29.75984",
  "FacilityLongDecDegs": "-095.09996",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Hartree Channelview LLC",
  "OperatorStr1": "16518 De Zavalla Rd",
  "OperatorStr2": null,
  "OperatorCity": "Channelview",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77530",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000238316",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-07-09 12:08:07",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-04-30 12:55:24",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-04-30 12:55:24",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-04-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 29.767656,
  "FRS_Long": -95.105212,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000087109,
      "AltID": "NGL Storage",
      "FacilityID": 1000069521,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108629,
          "ProcessID": 1000087109,
          "ChemicalID": 155,
          "Quantity": 1395000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000094836,
              "ProcessChemicalID": 1000108629,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000094837,
              "ProcessChemicalID": 1000108629,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000088313,
          "ProcessID": 1000087109,
          "NAICSCode": "32411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000073619,
              "Process_NAICS_ID": 1000088313,
              "SafetyReviewDate": "2018-03-16 00:00:00",
              "PHA_Date": "2018-03-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-05-15 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-03-16 00:00:00",
              "TrainingReviewDate": "2018-03-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-03-16 00:00:00",
              "EquipmentInspectionDate": "2018-03-16 00:00:00",
              "EquipmentTested": "Loop testing alarms/shutdowns",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2018-03-16 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-03-16 00:00:00",
              "HotWorkPermitReviewDate": "2018-03-16 00:00:00",
              "ContractorSafetyReviewDate": "2018-03-16 00:00:00",
              "ContractorSafetyEvalDate": "2018-03-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000091399,
                  "PreventionProgram3ID": 1000073619,
                  "ProcessChemicalID": 1000108629
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000069521,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-03-16 00:00:00",
    "ERTrainingDate": "2017-03-15 00:00:00",
    "CoordinatingAgencyName": "Channelview Fire Department",
    "CoordinatingAgencyPhone": "2814525782",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000069521,
      "SummaryText": "w). Because the processes at the plant regulated by the Environmental Protection Agency's (EPA's) Risk Management Program (RMP) and are also subject to the OSHA PSM, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\n\r\nEmployee Participation: Active employee participation and involvement in the development and implementation of the company's PSM program is an important step toward achieving the objective to prevent or minimize the consequences of catastrophic releases of toxic, reactive, flammable, or explosive chemicals. Employee involvement will help to ensure that all perspectives regarding PSM are considered, and that the best ideas are implemented. Open communications are encouraged between supervisors and employees regarding all safety and health issues. Channelview strongly promotes employee involvement in safety issues through existing programs. These programs include regularly scheduled safety meetings, tail-gate safety meetings, Hazard Communication, and other training programs (emergency response training, first aid, etc.).\r\n\r\nProcess Safety Information: Complete and accurate written process safety information (PSI) concerning process chemicals, process technology, and process equipment is essential to an effective PSM and RMP program and to completing and maintaining a process hazard analysis (PHA). The PSI will be useful to the operators; the team performing the PHA; those in charge of training; contractors; those conducting pre-startup safety reviews; and those in charge of updating the emergency preparedness plans. Process safety information is readily available to all employees. Channelview keeps a variety of technical documents that are used to help maintain safe operation of the process. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/config"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000069521,
      "SummaryText": "EXECUTIVE SUMMARY - CHANNELVIEW FACILITY\r\n\r\nThe Channelview Splitter, operated by Targa Terminals, LLC, is committed to the same brand of safety and environmental excellence that all other company assets promote. This philosophy involves making each and every employee and contractor accountable for their own safety, as well as that of the community around them. As a company, we follow a close adherence to all applicable federal, state and local laws to ensure a safe and healthy environment for all.\r\n\r\nEmployees who enter the Channelview facility complete a thorough training, both in the classroom and on-the-job, that enables them to address emergency issues as they arise. This preparation includes standard operational, emergency operational and release prevention training. In addition, periodic refresher courses help to keep operators problem solving abilities up-to-date and in sync with our recurring safety improvements. Our regular internal audits provide an excellent checks and balances system for monitoring these high standards that we set.\r\n\r\nThe plant is a crude oil splitter. The facility includes five 60,000 gallon NGL storage tanks. This NGL is a regulated substance consisting of 35% propane and 65% butane, approximately. The facility is classified as a Program Level 3 facility under the regulation. The worst case scenario (described in the RMP submittal) is the loss of the entire contents of the largest vessel (60,000 gallon tank of NGL), with a subsequent vapor cloud explosion. An alternative release is the loss of NGL due to a hose break during loading. There are numerous safety devices to prevent such events from occurring at the facility. We have discussed these potential hydrocarbon releases with our employees and with local emergency response officials in Harris County, thereby further reducing the possibility of any impact on the public.\r\n\r\nThe following is a summary of the accident prevention program in place at the Channelview Splitter (Channelvie"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000069521,
      "SummaryText": "uration information. Chemical-specific information, including exposure hazards and emergency response / exposure treatment considerations, is provided in material safety data sheets (MSDSs).\r\n\r\nProcess Hazard Analysis (PHA): Channelview has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. The facility primarily uses the What-if method technique to perform these evaluations. The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures when the team believes such measures are necessary. Periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.\r\n\r\nOperating Procedures: Channelview maintains written procedures that address various modes of process operations, such as startup, normal operations, temporary operations, emergency shutdown, normal shutdown, and initial startup of a new process. These procedures provide guidance for experienced operators and also provide the basis for training new operators. Operating procedures are periodically reviewed and annually reviewed by management as current and accurate. The review and certification process involves both operators and technical staff.\r\n\r\nTraining: In addition to training on operating procedures, the facility has a comprehensive training program for all employees involved in operating the process. New employees receive basic training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 years. All of this training is documented for ea"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000069521,
      "SummaryText": "ch operator including the means used to verify that the operator understood the training.\r\n\r\nContractors: Channelview uses contractors to supplement its workforce during periods for increased maintenance or construction activities. Because some contractors work on or near process equipment, the facility has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have appropriate skills, (3) are aware of the hazards of their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site specific safety rules, and (6) inform facility personnel of any hazards that they find during their work. This is accomplished by providing contractors with orientation sessions pertaining to these key points.\r\n\r\nPre-Startup Safety Review (PSSR): Channelview conducts a PSSR on any new facility or facility modification that requires a change in process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with design specifications and that all-supporting systems are operationally ready. The PSSR involves field verification of the construction and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\n\r\nMechanical Integrity: The Channelview facility has well established practices and procedures for maintaining process equipment. The basic aspects of this program include (1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting equipment deficiencies when identified, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process.\r\n\r\nSafe Work Practices: Channelview has long"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000069521,
      "SummaryText": "standing safe work practices in place to help ensure worker and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e. hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\n\r\nManagement of Change: Channelview has a comprehensive system to manage changes to all covered processes. This system requires that changes to items such as process equipment, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to ensure that adequate controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as maintenance personnel are provided any necessary training on the change.\r\n\r\nIncident Investigation: Channelview promptly investigates all incidents that resulted in or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to gather the facts, determine the root cause, and develop corrective action to prevent the reoccurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a reoccurrence, and forwards these results to the business management team for resolution.\r\n\r\nCompliance Audits: To help ensure that the accident prevention program"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000069521,
      "SummaryText": "is functioning properly, Channelview periodically conducts an audit to determine whether procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. Both hourly and staff personnel participate as audit team members. The audit team develops findings that are forwarded to Channelview management for resolution. Corrective actions taken in response to the audit team's finding are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained.\r\n\r\n\r\nFive-year Accident History\r\n\r\nNo incident resulting in onsite or offsite impacts from a hydrocarbon release has occurred at Channelview within the last five years. The facility is starting up in 2018\r\n\r\nEmergency Response Program\r\n\r\nIn the event of an emergency involving our facility, it is our policy to follow our Emergency Response Plan, which has been reviewed with the North Channel LEPC. Activation of this emergency response plan sets in motion a pre-planned series of events that notify all area emergency response agencies. Emergency response agencies are notified on the 911 system. All agencies and personnel respond to predetermined staging areas with representatives from each agency reporting to the Central Command Post (CP). A contingency plan is developed and executed using trained industry personnel along with other emergency response personnel from responding agencies, as needed.\r\n\r\nEmployees of this facility are issued individual copies of the Emergency Response Plan when initially hired and the plan is reviewed by the Emergency Management District Director and deemed to be acceptable. All of our operators at this facility have had the appropriate emergency response training as mandated by the OSHA standard. This plan and our emergency response policy have also been discussed with the local fire departments and members of the fire departments have thoroughly"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000069521,
      "SummaryText": "inspected our facility.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nDiligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at Channelview. Some of the key components of the safety improvements we expect to achieve are as follows:\r\n\r\n¿\tThe Management of Change provisions ensures that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.\r\n¿\tThe Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\r\n¿\tThe Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\r\n¿\tInternal and third party compliance audits will ensure we maintain and increase our level of safety protection."
    }
  ]
}