{
  "FacilityID": 1000067978,
  "FacilityName": "Water Treatment Plant",
  "FacilityStr1": "60 West Hinkle Street",
  "FacilityStr2": null,
  "FacilityCity": "Corbin",
  "FacilityState": "KY",
  "FacilityZipCode": "40701",
  "Facility4DigitZipExt": "1805",
  "FacilityCountyFIPS": "21235",
  "LEPC": "Whitley LEPC",
  "FacilityLatDecDegs": "36.956997",
  "FacilityLongDecDegs": "-84.112868",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "LC",
  "FacilityURL": null,
  "FacilityEmailAddress": "ron.herd@corbinutilities.com",
  "FacilityDUNS": 59562983,
  "ParentCompanyName": "Corbin City Utilities Commission",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Corbin Utilities Commission",
  "OperatorStr1": "P.O. Box 1350",
  "OperatorStr2": null,
  "OperatorCity": "Corbin",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40702",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gregory S. Hoskins",
  "RMPTitle": "Environmental Tech.",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000032118",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-01-29 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-02-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-02-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-02-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-02-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 36.95667,
  "FRS_Long": -84.11472,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "39.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085234,
      "AltID": "Chlorination",
      "FacilityID": 1000067978,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000086476,
          "ProcessID": 1000085234,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000106443,
          "ProcessID": 1000085234,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000606443,
          "ProcessID": 1000085234,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067978,
      "SummaryText": "Corbin City Utilities Commission\n\nWater Treatment Plant\n\nRisk Management Program\n\nExecutive Summary\n\n\n\n\n\n\n\n1.0  Accidental Release Prevention and Response Policies\n\n\n\nThe Corbin City Utilities Commission has a long-standing commitment to operating our facilities in a manner that is safe for our employees, the public, and the environment.  A primary aspect of this commitment is the Corbin City Utilities Commission Water Treatment Plant to help ensure the safe operation of the water chlorination process.  Our commitment is also demonstrated by the resources invested in accident prevention, such as considering safety in the design, installation, operation and maintenance of our process, as well as, extensive training of our operating personnel. \n\nIn the event of an accidental release, the Corbin City Utilities Commission Water Treatment Plant has procedures that are designed to control and contain the release in a manner that will be safe for our employees and will help prevent injury to the public and the environment.  The Corbin City Utilities Commission Water Treatment Plant's emergency response personnel receive thorough training in handling accidental releases.  An emergency response coordinator has been assigned to oversee response activities and to coordinate response efforts with local emergency agencies.  Communications with the Local Emergency Planning Committee (LEPC) have been ongoing throughout the preparation of this plan and policies.\n\n\n\nIn order to effectively implement these policies, the Corbin City Utilities Commission Water Treatment Plant established a management system headed by the plant's Environmental Technician to ensure the proper implementation and effectiveness of our Risk Management Program.\n\n\n\n\n\n2.0  Corbin City Utilities Commission Water Treatment Plant and Regulated Substances\n\n\n\nThe Corbin City Utilities Commission Water Treatment Plant handles one substance regulated by the OSHA Process Safety Management Standard and the EPA Risk Mana"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067978,
      "SummaryText": "gement Program Rule (RMP Rule) rule in quantities above the Threshold Quantity. \n\n\n\nProcess Description: Chlorination\n\nProgram Level: 3\n\nRegulated Substance: Chlorine\n\n\n\n\n\n\n\n3.0  Hazard Assessment Results\n\n\n\nThe Corbin City Utilities Commission Water Treatment Plant performed an offsite consequence analysis to estimate the potential impacts of accidental releases of the Chlorine from our process. The regulated substance was evaluated for a possible worse-case release scenario and alternative release scenario.  It is important to understand that the Corbin City Utilities Commission Water Treatment Plant has invested extensive resources to prevent releases, and the potential for a worse-case release is extremely small.  The alternative release scenario represents a more realistic potential for occurrence and is based on historical data from our process or other similar processes.  By identifying these potential releases, the Corbin City Utilities Commission Water Treatment Plant has developed an extensive program to prevent such an occurrence.  This program is discussed in detail in the Prevention Program section of this plan.\n\nThe primary objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public and/or the environment as a result of an accidental release.  This point is called the endpoint distance.  At distances less than the endpoint distance, the effects would be greater; at distances farther than the endpoint, the effects would be less.\n\n\n\n3.1  Hazard Assessment - Toxic Substances\n\n\n\nThe worst-case scenarios (WCS) associated with Regulated Toxic Substances is a failure of a full, one ton (2000 lb) cylinder of liquid chlorine.  A toxic cloud formed by the evaporating chlorine would reach offsite endpoints and public receptors.\n\nAn alternative release scenario (ARS) for chlorine releases is a release from a vessel leak.  The modeled releases lasted for 30 minutes before it is stopped.  A"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067978,
      "SummaryText": " toxic cloud formed by the evaporating chlorine would reach offsite endpoints and public receptors.\n\n\n\n\n\n4.0  Accidental Release Prevention Program - Program 3\n\n\n\nThe Corbin City Utilities Commission Water Treatment Plant Chlorination Process is covered by the OSHA Process Safety Management standard.  The requirements of the OSHA Process Safety Management standard are nearly identical to the RMP Rule Program 3 Prevention Program requirements.  The Chlorination Process Prevention Program consists of the following elements.\n\n\n\n4.1  Process Safety Information\n\n\n\nThe Corbin City Utilities Commission Water Treatment Plant maintains a variety of technical documents that help ensure the safe operation of our processes.  These documents address:\n\n\n\n* physical properties of hazardous substances handled,\n\n* chemical properties and associated hazards of those substances,\n\n* operating parameters and limitation(s) of the process equipment,\n\n* design basis and configuration of the equipment, and\n\n* specific chemical inventories.\n\n \n\nThe Corbin City Utilities Commission Water Treatment Plant ensures that the process safety information is available to all Corbin City Utilities Commission Water Treatment Plant employees, the Local Emergency Planning Committee (LEPC), and the local fire department.  \n\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).  This information is supplemented by other technical information specific for these chemicals.  Continuous attention is given to revisions and updates on the hazards of chlorine and other chemicals used in our process.  Information regarding toxicity, environmental impacts, corrosion concerns, inadvertent mixing hazards, and other safety and health concerns are addressed and communicated to the appropriate parties.\n\nThe Corbin City Utilities Commission Water Treatment Plant also maintains numerous technical documents that"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000067978,
      "SummaryText": " provide information about the design and construction of process equipment.  This information includes:\n\n \n\n* materials of construction,\n\n* design pressures,\n\n* temperature ratings,\n\n* flow limits,\n\n* block flow diagrams,\n\n* consequences of deviation from operating limits,\n\n* safety systems,\n\n* applicable design codes and standards,\n\n* process chemistry, and\n\n* design basis for relief and ventilation systems.\n\n\n\nMany of the operating parameters are included in the operating procedures to aid in the safe and proper operation of the process.  These documents are used to:\n\n\n\n* train employees,\n\n* perform Process Hazard Analyses (PHAs), and\n\n* help maintain the equipment.\n\n\n\nAll the above mentioned information, in combination with written procedures and trained personnel, provide a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the Chlorination Process are not compromised.\n\n\n\n4.2  Process Hazard Analysis\n\n\n\nThe Corbin City Utilities Commission Water Treatment Plant performed and will periodically update process hazard analyses (PHAs) of the Chlorination Process to help identify process hazards and generate recommendations that might improve the safe operation of the process.  Within this program, the Chlorination Process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nTo perform the PHAs, Corbin City Utilities Commission Water Treatment Plant primarily uses the \"What-if/Checklist\" technique.  The PHAs are conducted using a team of people with experience in engineering and Chlorination Process operation and a leader with experience in process hazard analysis techniques. This team identifies and evaluates hazards of the process as well as accident prevention and/or mitigation measures, when appropriate.  The team then prepares a written report describing the results of the analysis, includ"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000067978,
      "SummaryText": "ing a list of recommendations ranked according to relative risk ratings assigned by the team.  Responsibility to resolve the recommendations is assigned to the EHS Committee and is tracked through completion.  The final resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the Corbin City Utilities Commission Water Treatment Plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the Chlorination Process is no longer in operation.  The results and findings of these updates are documented and retained.  The team findings are forwarded to the EHS Committee for consideration, and the final resolution of the findings is documented and retained.\n\n\n\n4.3  Operating Procedures\n\n\n\nCorbin City Utilities Commission Water Treatment Plant engineers, operators, and management work together to develop and maintain written operating procedures to define how tasks related to the Chlorination Process operation should be safely performed.  These written procedures address various modes of process operations, such as:\n\n\n\n* normal startup,\n\n* normal operations,\n\n* temporary operations,\n\n* emergency shutdown,\n\n* normal shutdown, and\n\n* initial startup of a new process.\n\n \n\n\n\n\n\n The written operating procedures include:\n\n \n\n* steps for safely conducting process tasks,\n\n* applicable process safety information, such as safe operating limits and consequences of process deviations, and\n\n* safety and health considerations, such as chemical hazards, personal protective equipment requirements, and action(s) to take in the event of an exposure to a hazardous substance.\n\n\n\n4.4  Training\n\n\n\nThe Corbin City Utilities Commission Water Treatment Plant trains workers to safely and effectively perform their assigned tasks.  The Corbin Ci"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000067978,
      "SummaryText": "ty Utilities Commission Water Treatment Plant training program includes both initial and refresher training that covers:\n\n\n\n* a general overview of the Chlorination Process,\n\n* the properties and hazards of the substances in the process, and\n\n* a detailed review of the process operating procedures and safe work practices.\n\n\n\nIn addition to the above mentioned classroom training, each operator is required to work for a period of time with an experienced operator until clear understanding of the operating procedures is demonstrated.  Refresher training is conducted annually as part of the Corbin City Utilities Commission Water Treatment Plant's ongoing safety training effort.\n\n\n\n4.5  Mechanical Integrity\n\n\n\nThe Corbin City Utilities Commission Water Treatment Plant maintains the mechanical integrity of Chlorination Process equipment to help prevent failures that could endanger workers, the public, or the environment.  The Corbin City Utilities Commission Water Treatment Plant mechanical integrity program includes:\n\n\n\n* an inspection and testing program to help identify equipment deterioration and damage before the equipment fails,\n\n* a quality assurance program to help ensure that the new and replacement equipment meet the design standards required for service in our process,\n\n* procedures for safe work practices such as lockout/tagout, hot work, confined space entry and line or equipment opening,\n\n* training of maintenance personnel, and\n\n* documentation of maintenance activities.\n\n\n\n\n\n4.6  Management of Change\n\n\n\nThe Corbin City Utilities Commission Water Treatment Plant has a comprehensive program to manage changes to processes.  Under this program, all proposed changes to chemicals, equipment, and procedures for the Chlorination Process must be evaluated and approved to help ensure the change does not negatively affect safe operations.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing con"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000067978,
      "SummaryText": "trols have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, and procedures are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided with any necessary training related to the change.\n\n\n\n\n\n4.7  Pre-startup Review\n\n\n\nThe Corbin City Utilities Commission Water Treatment Plant performs a safety review of all new or modified processes prior to their being placed into service to ensure that these processes have been prepared to operate safely.  This review is designed to confirm:\n\n\n\n* construction and equipment are in accordance with design specifications,\n\n* adequate safety, operating, maintenance, and emergency procedures are in place,\n\n* employee training has been completed, and\n\n* for covered processes, a PHA has been performed for new processes and management of change requirements have been completed for modified processes.\n\n \n\nA pre-startup review team uses checklists to verify all aspects of readiness.  The review involves field verification of the construction elements and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\n \n\n\n\n4.8  Compliance Audit\n\n \n\nThe Corbin City Utilities Commission Water Treatment Plant conducts periodic audits of the Chlorination Process to ensure the Corbin City Utilities Commission Water Treatment Plant Prevention Program has been effectively implemented and addresses the safety issues of our operations.  Compliance audits are conducted at least every three years by a team of hourly and management personnel who are knowledgeable of the RMP Rule and the Chlorination Process.  The team evaluates the Corbin City Utilities Commission Water Treatment Plant Prevention Program and other aspects of the Corbin City Utilities Commission Water Treatment Plant Risk Management Program.  The results of the audit are documented, recommendat"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000067978,
      "SummaryText": "ions are resolved, and appropriate enhancements to the Prevention Program are implemented.  The Corbin City Utilities Commission Water Treatment Plant maintains records of at least the last two audits conducted.\n\n \n\n\n\n4.9  Incident Investigation\n\n \n\nThe Corbin City Utilities Commission Water Treatment Plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent recurrence of the incident or a similar incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n \n\n\n\n4.10  Employee Participation\n\n \n\nThe Corbin City Utilities Commission Water Treatment Plant developed a written employee participation program for the Chlorination Process and other aspects of our operations to ensure that the safety concerns are addressed.  The Corbin City Utilities Commission Water Treatment Plant encourages the active participation of our employees in the Prevention Program for all processes and tasks at our facility.  Employees are consulted on and informed of all aspects of the Corbin City Utilities Commission Water Treatment Plant Risk Management Plan (RMP) and participate on PHA and Compliance Audit teams.\n\n \n\n\n\n4.11  Hot Work Permits\n\n \n\nThe Corbin City Utilities Commission Water Treatment Plant established a Safe Work Permit program to control spark or flame producing activities that could result in fires or explosions in the processes at our facility.  The Corbin City Utilities Commission Water Treatment Plant utilizes a Safe Work Permit form designed after the OSHA fire prevention and protection requirements found in 29 CFR 1910.252(a).  Personnel who are to perform the Hot Work are required to complete the form which is reviewed by the area supervisor.  The form"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000067978,
      "SummaryText": " must be approved before work can proceed.  Training in the use of the Safe Work Permit form is provided to all affected personnel.\n\n \n\n\n\n4.12  Contractors\n\n \n\nThe Corbin City Utilities Commission Water Treatment Plant established a program to help ensure that contractors who are used to supplement the workforce during periods of increased maintenance or construction conduct their work in a safe manner.  Under the program, the record of all contractors is reviewed to ensure that Corbin City Utilities Commission Water Treatment Plant hires contractors who can safely perform work on or near covered process equipment.  Our program ensures that contractors:\n\n \n\n* perform their work in a safe manner,\n\n* have the appropriate knowledge and skills,\n\n* are aware of the hazards in the workplace,\n\n* understand what to do in the event of an emergency,\n\n* understand and follow the Corbin City Utilities Commission Water Treatment Plant's safety rules, and\n\n* inform Corbin City Utilities Commission Water Treatment Plant personnel of any hazards identified during their work.\n\n \n\nProgram efforts are accomplished by providing contractors with:\n\n \n\n* a process overview,\n\n* information about safety and health hazards,\n\n* emergency response plan requirements, and\n\n* safe work practices prior to beginning work.\n\n \n\n\n\n5.0  Chemical Specific Prevention Steps\n\n \n\nIndustry standards are followed at the Corbin City Utilities Commission Water Treatment Plant to help ensure safe handling of chlorine.  The vendor supplies chlorine via a Department of Transportation (DOT) approved truck and in DOT approved 1 ton cylinders.  The chlorination process equipment is designed and constructed with state-of-the-art materials and technology utilizing the standards and guidelines of the Chlorine Institute, American Water Works Association, ASME, ANSI, and other applicable codes.  Workers who perform operations involving chlorine receive training emphasizing safe handling procedures according to the guideli"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000067978,
      "SummaryText": "nes required by the Corbin City Utilities Commission Water Treatment Plant. \n\n\n\n\n\n6.0  Emergency Response Programs\n\n \n\nThe Corbin City Utilities Commission Water Treatment Plant has prepared a written emergency action plan that complies with the RMP Rule, other federal standards and industry guidelines.  This plan has been communicated to the Local Emergency Planning Committee (LEPC) and local fire department.  \n\n\n\n\n\n7.0  Five Year Accident History\n\n\n\nThere has been no accidents or incidents that resulted in injuries to employee, the public, or the environment at The Corbin City Utilities Commission Water Treatment Plant in the past five years.\n\n\n\n\n\n8.0  Planned Changes to Improve Safety\n\n\n\nThe Corbin City Utilities Commission Water Treatment Plant continuously strives to improve the safety of our processes through incident investigation, Process Hazard Analysis, and employee suggestions.  Our engineering and technical personnel stay abreast of technology advancements which may improve the safety of our processes.\n\n  \n\n\n\n\n\nGeneral Manager\n\nCity Utilities Commission\n\n1515 Cumberland Falls Highway\n\nCorbin, Kentucky 40701\n\n\n\nRonald W. Herd PE GM                                                                                    Work: 606-528-4026 Ex. 119\n\n                                                                                                                       Home: 606-524-3746\n\n\n\nOversees all Operations within the City Utilities Commission, Water Treatment, Waste Water Treatment, and Electrical Department.\n\n\n\nCOVERED FACILITIES\n\n\n\nFACILITY NAME                           FAC EMERG RESP COORD                          COMMUNICATION\n\n\n\nCorbin Water Treatment Plant                Gregory S. Hoskins                                Office: 606-528-4026 x117\n\n60 West Hinkle Street                       Environmental Tech.                               Home: 606-620-3336\n\nCorbin, Kentucky 40701\n\n\n\nALTERNATE FAC EMERG COORD\n\n\n\nJames P. Hampton - Chief Operator\n\n\n\nOff"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000067978,
      "SummaryText": "ice: 606-528-4026\n\nPlant: 606-528-5975\n\nHome: 606-528-9922\n\n\n\nHAZARDOUS CHEMICALS:\n\n\n\nNAME                       UN ID #               FORM            PACKAGE / CONTAINER          MAX. HEALTH QUANT. RISK\n\n\n\nChlorine 7782-50-5      1017                   Gas/ Liquid     2,000 lb. Cylinder                      12,000 lbs *\n\n\n\n* HEALTH RISK: TOXIC (POISONOUS); May be fatal if inhaled or absorbed through skin. Fire will produce irritating, corrosive and / or toxic gases. Contact with gas or liquefied gas may cause burns, severe injury and / or frostbite.\n\n\n\nPRIMARY ACTIVITIES: Chlorine at the water treatment plant is used to treat raw water from Laurel River to make potable drinking water for the City of Corbin and the surrounding areas.\n\n\n\nACCIDENTAL RELEASE PREVENTION: EMERGENCY REPONSE POLICY: City Utilities Commission is committed to Safety and the implementation of safety procedures. Chlorine tanks at the water treatment plant are housed in a separate building. The Chlorine building is equipped with an alarm system to nofity employees of leaks, vents close if alarms sounds, containing chemical inside building. Employees are trained in the use of the Class B repair kit (A KIT USE TO CONTROL LEAKS AROUND VALVES).\n\n\n\nMANAGEMENT IN SAFETY: General Manager Ronald W. Herd is committed to safety and the implementation of safety  procedures at City Utilities Commission. Each year City Utilities Commission holds an emergency management meeting at the Corbin City Hall with the Corbin Fire Department, Corbin City Police Department, and Whitley County Emergency Management. The topic of discussion, action to be taken in the event of a chemical release at Water Treatment Plant. The meetings are open to the public.\n\n\n\nREGULATED SUBSTANCES HANDLED AT WATER TREATMENT PLANT: The Water treatment plant is located on Hinkle Street just off Highway 312 (Gordon Hill). The water treatment plant potable drinking water for the city of Corbin and the surrounding area. Chlorine is used to tre"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000067978,
      "SummaryText": "at water brought into the plant from Laurel River intake on Old City Dam Road. The water treatment plant house eight (6) cylinders at a weight of 2,000 lbs. Each. The water plant employs three (3) full time employees and one (1) part-time employee. Two (2) employees hold degrees in chemistry.\n\n\n\nPROTECTIVE ACTION IN CASE OF A CHEMICAL RELEASE: Worst-case release scenario, in the event of a chemical release from a 2,000 lb. Chlorine tank at the water treatment plant, all local residents in a 3.50 mile area would be ask to evacuate by local radio stations WKDP and WCTT along with police and fire department employees going door to door. A release of this  will require the expertise of level III agency.\n\n\n\nIf a leak occurs between the chlorine building and main building, the emergency shut-off valve will close, and the excess flow valve will divert the overflow.\n\n\n\nFIVE YEAR ACCIDENT HISTROY: City Utilities Commission has not had a chemical accident in the past five years.\n\n\n\nEMERGENCY RESPONSE PROGRAM: In the event of a spill or release, radio stations WKDP and WCTT along with police and fire sirens will be utilized to notify residence to evacuate. Also, police and fire personel will go door to door to insure the evacuation of all affected residents. Schools and churches may be used as shelters if necessity arises.\n\n\n\nBaptist Health Hospital has a decontamination unit specifically trained in chemical emergencies, and will accept patients contaminated with chlorine and have the capability to provide appropriate care, they are equipped with a heliport for the immediate transport of patients if needed.\n\n\n\nThe primary respone point is the facility's gate. If this is impractical, the alternate response point is the northeast corner of Kentucky State Route 312 (Gordon Hill) and Highland Avenue. At either response point the facility representative will have in hand a copy of the facility Title III, and appropriate MSDS and be prepared to brief response personnel. Support unit"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000067978,
      "SummaryText": "s will report and await assignment by local organizations.\n\n\n\nActions will be taken for protection of emergency workers on-site and populated area off site. These actions will depend upon the amount of chemical, weather conidtions and other hazards involved, such as fire.\n\n\n\nEntry into the evacuated are will be restricted until the highest-ranking official representing the city of Corbin, Kentucky, (i.e. Mayor, Mayor Pro-term of City Commissioners) determine it permissible for authorized personnel to enter.\n\n\n\nRESPONSE LEVELS: \n\n\n\nLEVEL I: Emergency Condition Description:\n\n\n\nAn incident or threat of a release which can be controlled by the first response agencies and does not require evacuation of other than the involved structure or outdoor area. The incident is confined to small area and does not pose a immediate threat to life or property. Contact local response agency's fire, police, medical, and any appropriate persons.\n\n\n\nLEVEL II: Limited Emergency Condition Description:\n\n\n\nAn incident involving a greater or larger area which poses a potential threat to life and property and which may reguire a limited evacuation of the surrounding area. Contact all agencies in Level I plus; HAZMAT TEAM, EOC STAFF, PUBLIC WORKS DEPT., RED CROSS, COUNTY DES/EMA, STATE POLICE, AND PUBLIC UTILITIES.\n\n\n\nLEVEL III: Full Emergency Condition Description:\n\n\n\nAn incident involving a severe hazard or large area which poses an extreme threat to life and property and will probably and will probably reguire large scale evacuation, or an incident requiring the expertise or resources of county, state, federal or private agencies. Contact all Level I and Level II agencies plus the following: MUTUAL AID, STATE DES, HREPS, HSC,USEPA, ATSDR, PEMA, AND OSC/RRT.\n\n\n\nFACILITY EQUIPMENT:\n\n\n\nFEMA Escape Breathing Apparatus, Chemical Suits, Chlorine Alarm System, Chemical Respirator's, Gas Monitors.\n\n\n\nCOMMUNITY EQUIPMENT:\n\n\n\nCity of Corbin Fire Department along with West Knox Fire Department are equi"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000067978,
      "SummaryText": "pped with Self-Contained Breathing Units, and trained in First Aid and CPR. (Both - Level I Agency)\n\n\n\nFACILITY TRAINING:\n\n\n\nAt present City Utilities Commission has seven (4) employees trained in use of Respirator's, FEMA Escape Breathing Apparatus, and the Class B repair kits.\n\n\n\nFACILITY EXERCISE PROGRAM:\n\n\n\nOur facility at present has had on-site exercises but none on the county level.\n\n\n\nSPILL CONTAIMENT:\n\n\n\nIn the event of a Chlorine release inside of the chlorine building the product could be contained with the building thereby controlling the release of the product into the atmosphere.\n\n\n\nFor personel protection, keep upwind, wear appropriate class A or B type protective clothing to include boots, protective gloves and goggles and use proper breathing apparatus. Avoid breathing vapors or dust/ Wash away any material which may have contacted the body with copious amounts of plain water or soap and water.\n\n\n\nCLEAN UP:\n\n\n\nThe Water treatment personnel will accomplish the clean up of any chemical residue, any residue will be put in plastic bags and placed in 55 gallon drums for storage and proper disposal.\n\n\n\nThe Kentucky D.N.R. will approve disposal of waste.\n\n\n\nMSDS - (Chlorine) the following steps should be taken in the event of a chlorine spill or leak. Move unprotected personnel upwind. If a chlorine is leaking try to position it so that gas, rather than liquid leaks. Using full protective equipment, apply emergency - sealing device if possible. Cover leaks with tarpaulin or plastic sheet to limit spread of chlorine.\n\n\n\nEMERGENCY NOTIFICATION:\n\n\n\nNational Response Center (EPA): 800-424-8802\n\n\n\nKentucky Emergency Response Commission: 502-607-1682\n\n\n\nWhitley County LEPC: 606-549-6071\n\n\n\nCorbin City Fire Department: 606-528-2411\n\n\n\nWest Knox Fire Department: 606-528-1700\n\n\n\nCorbin City Police Department: 606-528-1122\n\n\n\nKentucky State Police: 1-800-222-5555\n\n\n\nDES Coordinator Larry Howard: 606-549-6017\n\n\n\nLEPC Preparedness Coordinator Danny Moses: 606-528-5613"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000067978,
      "SummaryText": "\n\n\n\nWhitley County 911 Director: 606-549-6017\n\n\n\nWhitley County Ambulance: 911\n\n\n\nWhitley County Rescue Squad: 606-549-6017\n\n\n\nCorbin-Knox Ambulance: 911\n\n\n\nLaurel County Ambulance: 606-878-6300\n\n\n\nLaurel County Rescue Squad: 606-878-7000\n\n\n\nKentucky Emergency Response Commission (KERC): 502-564-7815\n\n\n\nKentucky DES Area 11 Coordinator Jerry Rains:  606-877-3149\n\n\n\nCity of Corbin DES Director Marlin Sams:  606-523-6521\n\n\n\nNat. Res. & Env. Pro. Cab. (NR&EPC): 502-564-2380\n\n\n\nEnv. Prot. Agency (EPA) Hotline: 1-800-535-0202\n\n\n\nBrenntag Mid-South, Inc.: 270-830-1272\n\n\n\nLaurel Co. 24hr. Warning: 606-878-7000\n\n\n\nKnox Co. 24hr. Warning: 606-546-9722\n\n\n\nKeavy Fire Department: 606-878-7000\n\n\n\nWoodbine Fire Department: 606-528-8941\n\n\n\n"
    }
  ]
}