{
  "FacilityID": 1000003304,
  "FacilityName": "United States Cold Storage, Warsaw",
  "FacilityStr1": "240 Bruce Costin Road",
  "FacilityStr2": null,
  "FacilityCity": "Warsaw",
  "FacilityState": "NC",
  "FacilityZipCode": "28398",
  "Facility4DigitZipExt": "0627",
  "FacilityCountyFIPS": "37061",
  "LEPC": "Duplin County LEPC",
  "FacilityLatDecDegs": "35.013611",
  "FacilityLongDecDegs": "-078.111944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.uscoldstorage.com",
  "FacilityEmailAddress": "info@uscold.com",
  "FacilityDUNS": 159754100,
  "ParentCompanyName": "United States Cold Storage, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1215136,
  "Company2DUNS": 0,
  "OperatorName": "Jonnie Grantham",
  "OperatorStr1": "240 Bruce Costin Road",
  "OperatorStr2": null,
  "OperatorCity": "Warsaw",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28398",
  "OperatorZipCodeExt": "0627",
  "RMPContact": "Steve Hawley",
  "RMPTitle": "Chief Engineer",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000053871",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-05-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.01405,
  "FRS_Long": -78.1046,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000004074,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000003304,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000004241,
          "ProcessID": 1000004074,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000004515,
          "ProcessID": 1000004074,
          "ChemicalID": 56,
          "Quantity": 55700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000504515,
          "ProcessID": 1000004074,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000003304,
      "SummaryText": "United States Cold Storage, Inc. is committed to the safe operation of all our facilities to protect our workers, the public and the environment. This is accomplished to a great extent by a well developed, up-to-date implemented Risk Management Program. All USCS facilities shall operate in a prudent and safe manner. It shall be the responsibility of the plant manager to ensure that all procedures are followed as set forth in our Risk Management and Process Safety Management programs. In the unlikely event of an accidental release it is USCS policy to immediately call the National Response Center, Local Emergency Response Committee, the local Fire Department and other agency(ies) that may be required. All USCS facilities will have an emergency response team to assist these agency(ies).\n\nUnited States Cold Storage, Warsaw is a public refrigerated warehouse that uses anhydrous ammonia as an refrigerant in a closed loop system. Anhydrous ammonia, most commonly known as ammonia, is an excellent refrigerant and is commonly used in most of the world's industrial refrigeration systems. Ammonia has an excellent warning property, its odor. Ammonia's odor is familiar to most people due to the fact that it is commonly used in household cleaning solutions. Ammonia can be detected as low as 5 parts per million (PPM) and has an average life span in the environment of 7 days before it breaks down to it common elements nitrogen and hydrogen.\n\nTypical items stored within USCS facilities are raw or processed food items that can be found in your supermarket or local restaurant. Temperatures ranges between -30 degrees to +45 degrees F. Most of the refrigeration equipment is located inside the facility. The condenser and piping on the machine room roof and the piping to and from the freezers, coolers, truck and rail docks are located on the warehouse roof. In an unlikely event of an refrigerant leak in any refrigerated space, the ammonia vapor would be contained inside the space, due to "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000003304,
      "SummaryText": "the vapor tight construction of the facility. It then may be treated and/or vented under controlled conditions.   The machine room contains most of the large refrigeration machinery and vessels. The facility is equipped with ammonia detectors throughout to help lessen any leaks that might occur and to provide an early alert.\n\nUSCS believes that prevention is foremost.  All of USCS facilities are maintained by a staff of trained maintenance personnel. Most of these people are members of the Refrigerating Engineers and Technicians Association (RETA) and all Chief Engineers are members of the International Institute of Ammonia Refrigeration (IIAR). USCS has on staff at the corporate level an OSHA and EPA coordinator/trainer who is a certified OSHA Instructor.  All facilities comply with OSHA's Process Safety Management without regard to the ammonia threshold quantity.  All the vessels and piping have been installed according to ASME vessel and piping codes and applicable local Building, Fire and Mechanical Codes. \n\nThe USCS Warsaw facility has been operating at this location for the past 12 years. Within that history the facility has seen no refrigerant releases. Since June, 1999, this facility has not experienced any accidents or releases from their refrigeration system(s) that resulted in deaths, injuries or significant property damage on site or offsite, deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nThe facility's emergency response program is based on the OSHA requirements for 29 CFR 1910.38-Emergency Action Plan, OSHA's 1910.119, Process Safety Management and 1910.120 HAZWOPER standards. We have trained employees for emergency response and maintain a written emergency response  plan.\n\nThe revalidation of the PHA recently performed for this facility produced no changes to improve safety. However the first PHA produced 4 recommendations to improve safety at the Warsaw facility. Such changes included installation of new"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000003304,
      "SummaryText": " mitigation and/or controls, equipment and/or technology.\n\nThe following administrative controls are in place to help ensure the safe operation of the facility refrigeration system: Engine room log is maintained, with visual checks of all of the equipment including the ammonia pumps. Oil that is added to the refrigeration equipment is noted on the Daily Engine Room Log. Annual preventive maintenance of the refrigeration equipment includes the ammonia pumps. Housekeeping of the engine room area includes wiping up and investigating oil leaks and moping the floors on a daily to weekly bases. Annual inspection and maintenance of the refrigeration piping and vessels are performed."
    }
  ]
}