{
  "FacilityID": 1000010702,
  "FacilityName": "Leon Creek Water Recycling Center",
  "FacilityStr1": "1104 Mauerman",
  "FacilityStr2": null,
  "FacilityCity": "San Antonio",
  "FacilityState": "TX",
  "FacilityZipCode": "78224",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48029",
  "LEPC": "Bexar County LEPC",
  "FacilityLatDecDegs": "29.274869",
  "FacilityLongDecDegs": "-098.516300",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 57582603,
  "ParentCompanyName": "San Antonio Water System",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "San Antonio Water System",
  "OperatorStr1": "2800 HWY 281 North",
  "OperatorStr2": null,
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78212",
  "OperatorZipCodeExt": null,
  "RMPContact": "Parviz Chavol",
  "RMPTitle": "Director - Prod & Treat Ops",
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000039255",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-01-23 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-08-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-08-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.27472,
  "FRS_Long": -98.51306,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000012748,
      "AltID": "Sewage Treatment Facility",
      "FacilityID": 1000010702,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000013131,
          "ProcessID": 1000012748,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000014713,
          "ProcessID": 1000012748,
          "ChemicalID": 62,
          "Quantity": 66000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000014714,
          "ProcessID": 1000012748,
          "ChemicalID": 49,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000514713,
          "ProcessID": 1000012748,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000514714,
          "ProcessID": 1000012748,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000010702,
      "SummaryText": "The Leon Creek Water Recycling Center (WRC) is owned and operated by the San Antonio Water System (SAWS).  SAWS, a public utility owned by The City of San Antonio was created in May 1992, and is responsible for treating drinking water and wastewater. SAWS also owns and operates as a separate utility a chilled water and steam plant which is a centralized heating and cooling system for the buildings in and around HemisFair Park.\n\n\n\nA seven member Board of Trustees, appointed by the City Council, governs SAWS. The Mayor appoints the Chair each year and the board elects the vice-chair and secretary. In 1995, the San Antonio Water System served approximately 1 million people in the urbanized part of Bexar County. This population includes approximately 260,000 separate customers. By 2050 the population served is expected to increase to 2.2 million.\n\n\n\nSAWS has won awards from the U.S. Environmental Protection Agency for its compliance with strict effluent discharge regulations. Treated wastewater effluent is the principal water supply for Braunig and Calaveras Lakes, the two power plant cooling lakes operated by City Public Service SAWS is also developing the facilities to distribute treated wastewater as a substitute for aquifer water in park and golf course irrigation and industrial uses.\n\n\n\nSAWS takes pride in observing the most stringent industrial safety precautions in preventing chemical related accidents. The latest safety technology monitoring detection systems are used at the Leon Creek facility. Internal inspections and inspection by staff from the Texas Commission Environmental Quality and EPA are conducted on a routine basis.\n\n\n\nAn active mitigation system is incorporated into the operation and maintenance of chemical handling systems at Leon Creek. This system is a dry scrubber system and was completed and accepted in 2010 which replaced the wet scrubber system used previously.  Our goal is to first prevent accidental releases and second to defuse the impact "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000010702,
      "SummaryText": "of an accidental spillage, fire, or explosion if it should occur. A reportable accidental release has not occurred at this site within the last five years. A search of available records showed that no reportable releases of a regulated material have occurred at this site since it constructed.\n\n\n\nThe SAWS Treatment Group. which operates the Leon Creek WRC, is also responsible for the operation and maintenance of the System's three other major wastewater treatment plants. These plants treat an average of 130 million gallons of wastewater per day and have a total capacity (including an excess margin required by state regulators) of 225 million gallons per day. Regulated materials used in the treatment process include chlorine and sulfur dioxide.\n\n\n\nLike other water utilities in the state, the Leon Creek WRC is required to disinfect treated effluent prior to discharge to ensure that disease causing bacteria (pathogens) are reduced to a safe level. Chlorine is a widely used disinfectant in the wastewater industry because it is effective against a broad spectrum of pathogens. Chlorine has shown itself to be an effective agent against waterborne bacteria, viruses and most protozoan agents. Sulfur dioxide is used to remove chlorine in wastewater prior to stream discharge to reduce aquatic toxicity.\n\n\n\nA Process Hazard Analysis has been performed for both chlorine and sulfur dioxide using EPA'S RMP*Comp calculations for offsite consequence analysis. Assuming a complete rupture of containers, off-site receptors would be impacted. Because all storage containers used by SAWS must conform to stringent Department of Transportation  (DOT) construction standards the occurrence of a worst case release is not realistic. Information from the hazard analysis is used to improve emergency planning activities with the San Antonio Fire Department and the Bexar County LEPC. An analysis of a more likely alternative release (pipe leak) showed that Chlorine or Sulfur dioxide would not be expec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000010702,
      "SummaryText": "ted to extend beyond property lines.\n\n\n\nChlorine shipping containers are designed for safety. U.S. Department of Transportation regulations at 49 CFR 173.304 set the maximum permissible density of chlorine in the container to 125 percent of the ratio of the weight of chlorine in the container to the weight container to water the container will hold 60 degrees farenheit. Chlorine valves are protected either by protective housing (cylinders) or manhole cover (tank). In the event of a fire or temperatures exceeding 165 degrees farenheit, the fusible plugs on chlorine melt to relieve pressure. Ton chlorine containers are designed to withstand pressures of at least 330 psig. Emergency repair kits are available and detectors and alarms are operable.\n\n\n\nA chemical safety management plans for accident prevention. which documents employee training, operation and maintenance procedures and emergency preparedness, is maintained and is on file at the facilityA?A?s administrative building. All personnel handling regulated chemical at Leon Creek are required to be TCEQ Certified operators and receive training in the safe of chlorine and sulfur dioxide training exercises are routinely held at the facility.\n\n\n\nA procedure is in place to investigate and report any accidental release or \"near miss\" event. Lessons learned and findings from these investigations are immediately incorporated into the accident prevention plan. The regulated chemical safety management plan is reviewed and updated each year during the facility's Tier II submittal process. A copy of this RMP has been provided to the San Antonio Fire Department and the Bexar County LEPC."
    }
  ]
}