{
  "FacilityID": 1000113870,
  "FacilityName": "FXI, Inc. - Santa Teresa",
  "FacilityStr1": "2500 Airport Road",
  "FacilityStr2": null,
  "FacilityCity": "Santa Teresa",
  "FacilityState": "NM",
  "FacilityZipCode": "88008",
  "Facility4DigitZipExt": "9702",
  "FacilityCountyFIPS": "35013",
  "LEPC": "Dona Ana LEPC",
  "FacilityLatDecDegs": "31.860598",
  "FacilityLongDecDegs": "-106.690248",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "SE",
  "FacilityURL": "www.fxi.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 153575758,
  "ParentCompanyName": "FXI, Inc",
  "Company2Name": null,
  "CompanyDUNS": 829462535,
  "Company2DUNS": 619971039,
  "OperatorName": "FXI, Inc.",
  "OperatorStr1": "2500 Airport Road",
  "OperatorStr2": null,
  "OperatorCity": "Santa Teresa",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "88008",
  "OperatorZipCodeExt": null,
  "FTE": 125,
  "OtherEPAFacilityID": "NMD981149701",
  "EPAFacilityID": "100000077098",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2024-04-25 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-05-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-05-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-05-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 31.860598,
  "FRS_Long": -106.690248,
  "FRS_Description": "SE CORNER OF LAND PARCEL",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000141818,
      "AltID": "Foam Manufacturing",
      "FacilityID": 1000113870,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000177420,
          "ProcessID": 1000141818,
          "ChemicalID": 77,
          "Quantity": 966000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000143311,
          "ProcessID": 1000141818,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000086234,
              "Process_NAICS_ID": 1000143311,
              "SafetyReviewDate": "2021-07-12 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "State and Federal Regulatory Requirements",
              "FR_Comments": "Facility is ISO 14001 Certified",
              "HazardReviewDate": "2024-04-11 00:00:00",
              "ChangeCompletionDate": "2024-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Flow meters, Motor RMP readouts and computerized production formulation control system",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Storage tanks are located within a concrete pit",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Portable TDI Monitor and two Wall Mounted TDI Monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-04-11 00:00:00",
              "TrainingReviewDate": "2022-08-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-08-20 00:00:00",
              "EquipmentInspectionDate": "2024-04-15 00:00:00",
              "EquipmentTested": "Preventive Maintenance to TDI Doper System",
              "ComplianceAuditDate": "2024-05-13 00:00:00",
              "AuditCompletionDate": "2024-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2009-09-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000087082,
                  "PreventionProgram2ID": 1000086234,
                  "ProcessChemicalID": 1000177420
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000113870,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-07-19 00:00:00",
    "ERTrainingDate": "2024-01-22 00:00:00",
    "CoordinatingAgencyName": "Dona Ana County LEPC",
    "CoordinatingAgencyPhone": "5756477900",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000113870,
      "SummaryText": "provements, some of which result in changes to the processes.   The following project is currently planned for implementation:\n\n¿\tConduct a tank integrity testing of TDI storage tanks"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000113870,
      "SummaryText": "nts in OSHA's emergency action and fire prevention plan regulation, OSHA's hazardous waste and emergency operations regulation, and the EPA's emergency response program requirements in its RMP rule.  Our program consists of procedures for responding to a release of TDI.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements.  In addition, the plant has procedures that address maintenance, inspection and testing of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated, when necessary, based on modifications made to plant processes or other facilities.  Personnel affected by changes in the program are informed and trained on those changes.  \n\nThe overall emergency response program for the plant is coordinated with the LEPC.  This coordination includes participation in periodic meeting of the committee, which includes local emergency response officials, local government officials, and other industry representatives.  The plant has around-the-clock communications capability with the appropriate LEPC officials and emergency response organizations such as the fire department.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  The plant also conducts periodic emergency drills.\n\nPlanned changes to improve safety\n\nWe strive to continuously improve the safety of our plant TDI process through periodic safety reviews and a program of soliciting safety suggestions from employees.  Our hazard review and incident investigation programs are especially designed to identify needed process safety im"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000113870,
      "SummaryText": "roughout the company to help prevent recurrence\n\nThe TDI process at our plant has hazards that are carefully managed to ensure continued safe operation.  The prevention program outlined above is applied to the TDI process.  Collectively, these prevention program activities help prevent potential accidental releases that could be caused by equipment failures, human errors, and by management system failures.\n\nIn addition to the accidental release prevention program, our plant has safety features on many units to help (1) contain or control a release, (2) quickly detect a release, and (3) reduce the consequences of or mitigate a release.  The following types of safety features are used in various units of the TDI process:\n\nRelease Containment/Control\n¿\tTDI storage tanks located inside an enclosed building\n¿\tAutomated shutdown systems for critical process parameters (e.g., high-pressure) \n¿\tTDI storage tanks high level alarms \n¿\tPressure/vacuum relief devices on vessels to prevent rupture or collapse\n¿\tSeal less pumps \n¿\tDouble Sealed TDI receiving and transfer pumps \n¿\tValves to permit isolation of the process\n¿\tTDI railcar inner tank is surrounded by an outer shell filled with insulation and a steam jacket\n¿\tTDI railcars are top unloaded through a nozzle in the top of the tank (offloading platform)\n\nRelease Mitigation\n¿\tFire suppression and extinguishing systems\n¿\tTrained emergency response personnel\n¿\tPersonal protective equipment (e.g., protective clothing, self-contained breathing apparatus, breathing air stations)\n¿\tA containment trench which provides minimal mitigation is located in the area where rail cars are offloaded.\n\n\nFive-year accident history\n\nWe have not had releases of TDI in the last 5 years that resulted in deaths or significant property damage on site, or known deaths, injuries, evacuations, sheltering-in-place, property damages, or environmental damage off site.\n  \n\nEmergency Response Program\n\nOur emergency response program is based on the requireme"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000113870,
      "SummaryText": "only substance handled at our plant that is regulated by EPA's RMPR.  TDI is a regulated substance because it is listed on CAA 112 (r) and our process involves a quantity that exceeds the threshold quantity (TQ) of 10,000 pounds. \n\nThe general accidental release prevention program and specific prevention steps\n\nThe plant has implemented programs and procedures that comply with EPA's   Accidental Release Prevention (Program 2).  Our facility is not eligible for Program 1 because our worst-case release scenario for TDI indicates a potential to impact public receptors within our toxic endpoint distance; however, FXI Santa Teresa is not subject to OSHA's Process Safety Management Standard in that TDI is not listed on OSHA's list of Highly Hazardous Chemicals.  Consequently, our covered process is not subject to Program 3, therefore we are subject to Program 2.  Our accidental release program is designed to systematically accomplish the following function:\n¿\tControl the creation and retention of safety information regarding the regulated substances, process and equipment\n¿\tConduct hazard reviews to identify, evaluate, and control process hazards associated with the regulated substances, processes, and procedures\n¿\tCreate, maintain, and evaluate operating procedures for activities within or near processes that use regulated substances\n¿\tProvide training for personnel who operate covered processes so that they safely perform their jobs\n¿\tMonitor and control maintenance activities that can affect the mechanical integrity of equipment used in covered processes\n¿\tConfirm through compliance audits that RMP practices at the plant are consistent with our written programs and that the programs are adequate to address all of the\n        requirements of the RMP rule\n¿\tEnsure that process incidents, particularly those of catastrophic magnitude or potential, are thoroughly investigated using our incident investigation procedures and that\n        relevant findings are communicated th"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000113870,
      "SummaryText": "Executive Summary  \n(2024 Recertification)\n\nAccidental Release Prevention and Emergency Response Policies\n\nFXI in Santa Teresa, New Mexico is a producer of flexible polyurethane foam.  The process for producing polyurethane foam requires the use of Toluene Diisocyanate (TDI).  TDI is listed in the Clean Air Act 112 (r) list of regulated substances.  Consequently, FXI is subject to EPA's Risk Management Program Rule (RMPR).  The same properties that give TDI commercial value are the characteristics that make it a hazardous material.  Prior to RMPR, FXI recognized the chemical and physical hazards involved with TDI and has observed safety precautions in its handling.  These precautions have been implemented to help limit exposure to the public, environment and our employees.  It is our policy to adhere to all applicable federal and state rules and regulations.  \n\nWe are committed to the safety of our employees, the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Effective implementation and monitoring of our accidental release prevention program helps us facilitate our Management System in the interest of reducing the possibility of accidental releases and proper mitigation in the event of an accidental release.\n\nDescription of the facility and the regulated substances handled\n\nThe primary purpose of this facility is to produce flexible polyurethane foam, which is sold to other facilities, and the automotive industry.  TDI is one of the reactants required to produce polyurethane foam.  TDI is received primarily by rail car and is stored in indoor storage tanks.  The maximum quantity of TDI stored in rail cars and in storage tanks at our plant is about 940,000 pounds.  The TDI is piped to a mix head where it is mixed with other reactants to produce a slab of polyurethane foam.  The foam is conveyed to cutting stations, where it is cut to the specifications provided by our customers.\n\nTDI is the"
    }
  ]
}