{
  "FacilityID": 1000084850,
  "FacilityName": "Valley International Cold Storage",
  "FacilityStr1": "200 FM 509",
  "FacilityStr2": null,
  "FacilityCity": "Harlingen",
  "FacilityState": "TX",
  "FacilityZipCode": "78550",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48061",
  "LEPC": "Cameron County LEPC",
  "FacilityLatDecDegs": "26.196478",
  "FacilityLongDecDegs": "-97.634239",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 883240251,
  "ParentCompanyName": "VICS Holding Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": 883240251,
  "Company2DUNS": 0,
  "OperatorName": "Valley Int'l Cold Storage, LLC",
  "OperatorStr1": "200 N FM 509",
  "OperatorStr2": null,
  "OperatorCity": "Harlingen",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78550",
  "OperatorZipCodeExt": null,
  "RMPContact": "Pedro Rodriguez",
  "RMPTitle": "Director of Facility Maintenance",
  "FTE": 145,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000220913",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-02-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-04-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-04-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-04-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-04-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": ".1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107042,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000084850,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000108315,
          "ProcessID": 1000107042,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000133865,
          "ProcessID": 1000107042,
          "ChemicalID": 56,
          "Quantity": 19137.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000633865,
          "ProcessID": 1000107042,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084850,
      "SummaryText": "EXECUTIVE SUMMARY \n\n\n\n Valley International Cold Storage, located in Harlingen, Texas, warehouses and packages fruit and vegetable products. The ammonia refrigeration system is a utility system supporting the plant by providing space conditioning and product cooling raw and finished products. \n\n\n\nAmmonia contained within the refrigeration system is a regulated substance under both the EPA and OSHA regulations. At Valley International Cold Storage the maximum inventory of ammonia exceeds the regulatory threshold of 10,000 pounds. \n\n\n\nAccidental Release Prevention and Emergency Response Policies \n\nValley International Cold Storage is committed to protecting the public, its employees, and the environment from any accidental releases of hazardous materials used at its facilities. We have implemented safety, environmental protection, and risk management programs to prevent hazardous materials releases. If there is an accidental release, we will immediately call for emergency response to minimize the effect of the release and notify the public of any actions necessary to ensure public protection via the Harlingen Fire Department. \n\n\n\nWorst-Case Release Scenario \n\nValley International Cold Storage has conducted an offsite consequence analysis as required by the EPA regulations, including an extremely unlikely, worst-case release scenario (i.e., total release from the single largest container over a ten minute period, assuming worst case meteorological conditions). Results of this worst case event indicate that offsite receptors would be affected. This type of release is not considered credible from the standpoint that an event of this nature would require the catastrophic failure of the container, resulting in a sudden release of the entire contents over a ten minute period. The ammonia system components are designed to withstand pressures well in excess of normal operating conditions and Valley International Cold Storage maintains a very rigorous maintenance and preventio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084850,
      "SummaryText": "n program for all ammonia process equipment. In fact, EPA release reporting databases and industry experience suggest that the worst-case release scenario as defined in the RMP regulations is so unlikely that it should not be used as the basis for emergency planning. A more reasonable potential release scenario for emergency planning is presented in \"The alternative release scenario(s)\" section below. \n\n\n\nAlternative Release Scenario\n\nA \"credible worst-case\" scenario, formulated in accordance with USEPA guidance, was selected as the Valley International Cold Storage alternative release scenario. This scenario involves a one-inch diameter hole from a break in the high pressure liquid ammonia piping at the facility. Results of this credible worst-case event indicate that there are some offsite receptors that would be affected. The results of the process hazard analysis (PHA) and the facility's operating history suggest that even this credible worst-case is extremely unlikely to occur, but it can serve as the basis for emergency planning. \n\n\n\nAccidental Release Prevention Steps \n\nValley International Cold Storage is committed to public safety, personnel safety, continued reliable operation and regulatory compliance. Based on this commitment, the Director of Facility Maintenance has assumed overall responsibility for the development and implementation of the Risk Management Program and has clearly defined accountability and responsibility for each of the prevention program elements to meet both EPA and OSHA Process Safety Management requirements. \n\n\n\nTo ensure that a worst-case or alternative release scenario does not occur, Valley International Cold Storage maintains a release prevention program with the primary focus of protecting the public and plant employees from the hazards associated with an accident or release involving anhydrous ammonia. The multifaceted program includes the use of: \n\n\n\nSystem instruments and alarms to rapidly alert operators to any problems; \n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084850,
      "SummaryText": "\n\n\nProcess safety information to document the safe process design; \n\n\n\nProcess hazards analyses to evaluate the chemical and process hazards; \n\n\n\nOperating procedures to ensure that the system is operated safely; \n\n\n\nMaintenance, inspection and testing to ensure that the system is maintained according to applicable standards and manufacturer's recommendations; \n\n\n\nTraining, Hot Work Permits, Contractor Safety, and Employee Participation Programs to ensure that all employees and contractors working on and around the processes are aware of the hazards, can perform their job duties safely and know the actions to be taken in an emergency; \n\n\n\nManagement of Change and Pre-startup Safety Reviews to ensure that changes are documented, analyzed and kept within the design basis; \n\n\n\nIncident Investigation procedure to investigate each incident and \"near misses\" to determine root causes and make needed safety improvements; and, \n\n\n\nPeriodic Compliance Audits to ensure that our programs are working as they should to protect both the public and employees. \n\n\n\nFive-Year Accident History \n\nWithin the past five years, Valley International Cold Storage has not had any accidental releases that resulted in injuries or property damage. The plant has maintained an excellent safety record throughout its operating history and has never had a major anhydrous ammonia release that could have had adverse effects on the public. \n\n\n\nEmergency Response\n\nIn the event that an ammonia release does occur, Valley International Cold Storage has an emergency response program that coordinates emergency response with the Harlingen Fire Department. If such a release did occur, plant personnel would contact the Harlingen Fire Department, who would dispatch specially trained personnel to the facility. \n\n\n\nPlanned Changes and Maintaining A Safe Operation \n\nWhile there are no planned major facility modifications, Valley International Cold Storage is continuing to implement hazard analysis and program perform"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084850,
      "SummaryText": "ance assurance measures to maintain a safe operation.  Valley International Cold Storage continually works to safely manage the hazards of anhydrous ammonia to protect the community we serve and the employees working for us. The Risk Management Program will be maintained to reduce the risk of accidental releases and each year we will conduct training, review procedures, maintain the equipment and follow safe work practices. Periodically, we will audit our program, review our Process Hazard Analysis, and coordinate with the community emergency response organization. \n\n"
    }
  ]
}