{
  "FacilityID": 1000078568,
  "FacilityName": "Honeywell, Inc.,formerly AlliedSignal",
  "FacilityStr1": "3927 Farm Road 1006",
  "FacilityStr2": null,
  "FacilityCity": "Orange",
  "FacilityState": "TX",
  "FacilityZipCode": "77630",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48361",
  "LEPC": "Orange County LEPC",
  "FacilityLatDecDegs": "30.051870",
  "FacilityLongDecDegs": "-93.764362",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.Honeywell.com",
  "FacilityEmailAddress": "angela.oquinn-thomas@honeywell.com",
  "FacilityDUNS": 8080004,
  "ParentCompanyName": "Honeywell International, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 139691877,
  "Company2DUNS": null,
  "OperatorName": "Honeywell International, Inc.",
  "OperatorStr1": "115 TABOR ROAD",
  "OperatorStr2": null,
  "OperatorCity": "MORRIS PLAINS",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07950",
  "OperatorZipCodeExt": null,
  "FTE": 97,
  "OtherEPAFacilityID": "77630LLDSGFM100",
  "EPAFacilityID": "100000092053",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-01533",
  "SafetyInspectionDate": "2019-03-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-04-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-05-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.048833,
  "FRS_Long": -93.764111,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097968,
      "AltID": "polyethylene unit",
      "FacilityID": 1000078568,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122904,
          "ProcessID": 1000097968,
          "ChemicalID": 95,
          "Quantity": 17000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000122903,
          "ProcessID": 1000097968,
          "ChemicalID": 29,
          "Quantity": 210000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000099208,
          "ProcessID": 1000097968,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000083140,
              "Process_NAICS_ID": 1000099208,
              "SafetyReviewDate": "2019-04-30 00:00:00",
              "PHA_Date": "2018-12-14 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-09-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-03-15 00:00:00",
              "TrainingReviewDate": "2019-03-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-03-15 00:00:00",
              "EquipmentInspectionDate": "2019-04-23 00:00:00",
              "EquipmentTested": "E-930",
              "ChangeMgmtDate": "2019-04-30 00:00:00",
              "ChangeMgmtReviewDate": "2019-02-12 00:00:00",
              "PreStartupReviewDate": "2019-04-25 00:00:00",
              "ComplianceAuditDate": "2018-06-07 00:00:00",
              "AuditCompletionDate": "2020-02-28 00:00:00",
              "IncidentInvestigationDate": "2018-05-04 00:00:00",
              "InvestigationChangeDate": "2020-11-30 00:00:00",
              "ParticipationPlansReviewDate": "2018-06-07 00:00:00",
              "HotWorkPermitReviewDate": "2018-06-07 00:00:00",
              "ContractorSafetyReviewDate": "2019-02-08 00:00:00",
              "ContractorSafetyEvalDate": "2018-06-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000103526,
                  "PreventionProgram3ID": 1000083140,
                  "ProcessChemicalID": 1000122904
                },
                {
                  "PrimaryKey": 1000103525,
                  "PreventionProgram3ID": 1000083140,
                  "ProcessChemicalID": 1000122903
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000078568,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-03-20 00:00:00",
    "ERTrainingDate": "2019-01-25 00:00:00",
    "CoordinatingAgencyName": "Orange County LEPC",
    "CoordinatingAgencyPhone": "4098827895",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 8,
      "FacilityID": 1000078568,
      "SummaryText": "conducted, the equipment the hot work will be performed on, the date, time, and location authorized for the hot work, the presence of fire prevention and protection systems meeting the requirements of 29 CFR 1910.252(a), and signatures of the supervisory employees authorizing the hot work.  A separate hot work permit must be issued for each hot work operation, and a separate hot work permit must be issued for each day.  A copy of the hot work permit must be displayed at the job location while hot work is in progress, and the permit is maintained on file after the completion of the hot work. \r\n3l. Contractors\r\n\r\nPrior to retaining contractor services for work in the process area, the contractor's safety performance and program is evaluated.  This includes a 3 year review of the contractor's Total Case Incident Rate (TCIR), review of OSHA recordable injuries and illnesses and corrective actions, review of Lost Work Day Cases Away (LWDCA) and corrective actions, review of the contractor's safety program including safety policies, training, and medical monitoring, and review of any applicable plant-specific health and safety plan prepared by the contractor.  The information supplied by the contractor is retained on plant while the contractor is engaged in work activities.\r\n\r\nPrior to commencing work at the plant, each contractor employee receives a safety orientation provided by Honeywell.  The safety orientation covers information on the hazards associated with the process areas where the work will be performed, safety procedures and systems to be used, overview of the plant emergency response program including specific procedures to be followed in case of emergency, and a review of plant safety rules and applicable operating procedures.  A record of each contractor employee's sign-off on the safety orientation is maintained on file at the plant, including the date the training was completed.  Once the safety orientation is complete, the contractor is responsible for"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078568,
      "SummaryText": "RMP*eSubmit Executive Summary\r\nHoneywell Orange\r\n\r\nAbout Honeywell Orange\r\n\r\nThe Honeywell International Inc. Orange plant (Honeywell Orange) is a manufacturing facility located in Orange, Texas.  It is part of the Advanced Materials business group of Honeywell International Inc.\r\n\r\nHoneywell International Inc. (Honeywell.com) is a Fortune 100 diversified technology and manufacturing leader, serving customers worldwide with aerospace products and services; control technologies for buildings, homes and industry; automotive products; turbochargers; and specialty materials.  Based in Morris Plains, New Jersey, Honeywell's shares are traded on the New York, London and, Chicago Stock Exchanges.\r\n\r\nHoneywell Advanced Materials, also based in Morris Plains, N.J., is a global leader in providing customers with high-performance specialty materials, including fluorine products, specialty films and additives, advanced fibers and composites, intermediates, specialty chemicals, electronic materials and chemicals, and technologies and materials for petroleum refining.\r\n\r\nHealth, Safety and Environment/Responsible Care;\r\n\r\nHoneywell Orange is committed to managing health, safety and the environment as a core business value to ensure compliance with all applicable government standards and regulations.  Honeywell Orange also integrates health, safety and environmental management into our business as a way of achieving profitable growth and accelerated productivity.\r\n\r\nHoneywell Advanced Materials participates in the Responsible Care program of the American Chemistry Council, and has achieved and maintained certification to the standard since 2005.  Responsible Care is a chemical industry program focused on achieving improvements in environmental, health and safety performance beyond levels required by the U.S. government.\r\n\r\nThe Responsible Care program directs its companies to adopt practices for the safe use of materials, to perform regular audits, and to reach out and communicate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078568,
      "SummaryText": "with the communities in which the companies operate.\r\n\r\nHoneywell Orange\r\n\r\nHoneywell Orange is a polyethylene wax manufacturing facility that has approximately 84 employees. The plant's products are used to make adhesives, coatings, inks, lubricants, polishes, plastics, textiles, color concentrates, cable filler, cosmetics and pharmaceuticals.  \r\n\r\nThe materials used by the facility include vinyl acetate and ethylene, which are on the RMP Rule's list of regulated substances.  Honeywell Orange's storage and use of ethylene and vinyl acetate exceed the specified thresholds of 10,000 lbs and 15,000 lbs, respectively, as defined by the EPA's RMP Rule.  \r\n\r\nIn accordance with the requirements of the RMP Rule, a description of the following six elements is provided for Honeywell Orange: \r\n\r\n1)\tAccidental Release Prevention and Emergency Response Policies: \r\n\r\nIt is the policy of Honeywell Orange to operate a safe and environmentally sound facility by identifying and controlling health, safety, or environmental risks related to its operations; by designing its processes to protect people, property and the environment; by conducting and continually reviewing and improving programs for safety, health and environmental excellence; and by establishing processes to ensure that all laws and regulations applicable to its operations and products are known and observed. The accidental release prevention and emergency response policy associated specifically with the plant's use of ethylene and vinyl acetate involves the integration of safety devices and technologies inherent in the design of the processes, safe operational procedures and management practices, operator training, emergency response plans, maintenance of emergency response equipment, coordination with local emergency response services, and communicating with the community. \r\n\r\n2)\tDescription of the Facility and the Regulated Substance Handled: \r\n\r\nHoneywell Orange operates 24 hours a day and uses vinyl acetate and et"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078568,
      "SummaryText": "hylene as raw materials in the manufacture of various grades of polyethylene wax. \r\n\r\nVinyl acetate is stored in quantities that exceed the threshold quantity specified in the RMP Rule.  Vinyl acetate is purchased from an outside vendor and is delivered to the Plant via tank truck on an \"as needed\" basis.  The tanker's contents are unloaded at an unloading station by plant operators into an above ground bulk storage tank identified as U-33 which is located on the East Side of the plant.  The maximum capacity of the bulk storage tank is 12,000 gallons.  Vinyl acetate is pumped from the bulk storage tank through an enclosed piping system into the production area where it is fed into the polyethylene unit.\r\n\r\nThe plant's stationary source of ethylene consists of three reaction vessels.  Ethylene is brought into the plant from either of two outside sources via pipeline on a continuous basis.  Ethylene is transferred through an enclosed piping system into the production area where it is fed into the three reactors in the polyethylene wax unit.\r\n\r\n\r\n \r\n3)\tThe General Accidental Release Prevention Program and Chemical-Specific Prevention Steps: \r\n\r\nThe general accidental release prevention program at the Honeywell Orange Plant consists of 12 elements.  Each of these elements is described below, together with chemical-specific prevention steps, as applicable.\r\n\r\n3a. Process Safety Information\r\n\r\nWritten process safety information is compiled before conducting process hazard analyses for the manufacturing processes including vinyl acetate and ethylene.  This enables the employees involved in operating these processes to identify and understand the potential hazards associated with the processes.  The information compiled includes data on the safe use and handling of the regulated chemicals (e.g., Material Safety Data Sheets), data on the process technology (e.g., Process Flow Diagrams, process chemistry, flow rates and storage capacities, operating limits and evaluation of e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078568,
      "SummaryText": "xceedances), and data on the equipment used in the process (e.g., Piping & Instrument Diagrams, materials compatibility, energy ratings and classification, control devices and emergency systems, ventilation systems, and design basis including conformance to applicable codes and standards).  The process safety information shows compliance of the process design with generally accepted good engineering practices.\r\n\r\n3b. Process Hazard Analyses\r\n\r\nProcess hazard analyses for the manufacturing process have been completed in accordance with 29 CFR 1910.119(e) (OSHA Process Safety Management).  These process hazard analyses are updated and revalidated in accordance with 29 CFR 1910.119(e), and are retained on plant for the life of the process.\r\n\r\nIn general, one or more of the following methodologies are used to complete each process hazard analysis: (a) what-if evaluation; (b) checklist; (c) hazard and operability study (HAZOP); (d) failure mode and effects analysis (FMEA); (e) fault tree; (f) process mapping; and (g) cause and effect matrix.  Each process hazard analysis addresses the process hazards, process incident history, process control devices and detection systems, evaluation of failure of process control devices, equipment location, and human factors.  A team of employees having experience and knowledge of the process design and operation, and knowledge of how to complete a process hazard analysis perform each process hazard analysis.  The Management of Change process (described below) is used to track and document process changes, which occur as a result of recommendations from process hazard analyses.\r\n\r\n \r\n3c. Operating Procedures\r\n\r\nWritten operating procedures are prepared for the manufacturing processes including vinyl acetate and ethylene. The program in place meets the requirements of ISO 9001:2000 certification for the plant.  The operating procedures provide clear instructions for safely conducting activities in the plant.  The procedures are maintaine"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078568,
      "SummaryText": "d to reflect current operating practices, and are certified annually for accuracy.\r\n\r\nSpecific information and instructions covered by the operating procedures include startup, normal operation, emergency operation, shutdown, operating limits, operating controls, chemical-specific health and safety information, required personal protective equipment, and use of safety systems.  Written procedures are also provided for specific operations such as lockout/tagout, confined space entry and line breaking.\r\n\r\n3d. Training\r\n\r\nEmployees currently engaged in operating the manufacturing processes using vinyl acetate and ethylene have received training to ensure they have the required knowledge, skills, and abilities to safely carry out the requirements specified in the written operating procedures.  Refresher training is provided every three years at a minimum, or sooner if warranted by changes to operating conditions, equipment or procedures.  Where refresher training is required more frequently than every three years, it is triggered through the Management of Change process (described below).  Training records are maintained for each employee to show the date training was conducted and the material covered by the training.\r\n\r\n3e. Mechanical Integrity\r\n\r\nHoneywell Orange maintains the mechanical integrity of equipment used to process and handle vinyl acetate and ethylene.  Such equipment includes pressurized vessels, storage tanks, piping systems, pressure relief and vent systems, emergency control devices, pumps, and valves.  Written procedures are established to define the scope and requirements of the mechanical integrity program.  Maintenance employees engaged in carrying out the mechanical integrity program are trained to complete the required tasks in a safe manner.\r\n\r\nOne component of the mechanical integrity program includes inspection and testing of process equipment.  Equipment inspection and testing is conducted in accordance with manufacturer's recommendations an"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000078568,
      "SummaryText": "d generally accepted good engineering practices.  Records of inspections and testing are maintained to show the date, equipment identification, inspector, type of test or inspection performed, and test results or observations.  If deficiencies are noted during equipment inspection and testing, corrective actions are taken in a timely manner to assure safe operation of the process.  In some cases, equipment inspections are driven by permit requirements as well as the mechanical integrity program.  For example, process pumps are inspected visually on a weekly basis, and quantitatively for leaks on a quarterly basis, in accordance with specific air permit requirements.\r\n\r\n3f. Management of Change\r\n\r\nOne component of the plant's Process Safety Management (PSM) program is a written procedure for the Management of Change.  Except for \"replacements in kind\", any change to the PSM-covered process requires completion and approval of a Request For Change prior to making the change.  Such changes include new process chemicals, new technologies, new or modified equipment, new or modified operating conditions, and new or modified procedures.  The Request For Change must be reviewed and approved by a team of employees having experience and knowledge of the process, knowledge of the proposed changes, and knowledge of applicable regulatory requirements.  The Request For Change must describe the proposed change and its impact on employee health and safety, the purposes and benefits of the change, the target date for the change to take effect, and whether the change is temporary or permanent.  The Request For Change must also indicate whether any of the following items are required as a result of the change, and if so, who is responsible for completing these items and when they must be completed: (a) process hazard analysis; (b) new product review; (c) Piping & Instrument Diagram update; (d) operating procedure update; (e) employee training; and (f) process safety information.  Recor"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000078568,
      "SummaryText": "ds of Requests For Change are maintained to track the status and progress of planned changes.\r\n\r\n3g. Pre-startup Review\r\n\r\nPrior to startup of a new process involving vinyl acetate and/or ethylene, a pre-startup safety review is conducted to ensure that the equipment and installation meets design specifications, a process hazard analysis has been completed, employee training has been completed, and safety, operating, maintenance, and emergency procedures are in place.  A pre-startup safety review is also conducted for process changes where the approved Request For Change indicates a change in the process safety information is required.  A team of employees having knowledge of the process, equipment, procedures and safety requirements operating conditions conducts the pre-startup safety review, procedures and safety requirements.  All items on the pre-startup review checklist must be satisfied prior to commencing startup.\r\n\r\n3h. Compliance Audits\r\n\r\nSelf-assessed compliance audits for the process are conducted annually to ensure that the elements of the general accidental release prevention program are up to date and are being implemented.  Personnel having experience and knowledge of the covered processes and knowledge of the program requirements conduct the compliance audits.  Records of the compliance audit reports are maintained to document the results of the audits and corrective actions taken, as appropriate.\r\n\r\n3i. Incident Investigation\r\n\r\nAll incidents that resulted in, or could have resulted in, a release of vinyl acetate or ethylene are investigated promptly.  The incident investigation starts with the completion of an Incident Investigation Report prepared by the supervisor on duty at the time of the incident, and is distributed to the incident investigation team.  The incident investigation team is made up of employees having experience and knowledge of the processes affected by the incident, and knowledge of completing incident investigations.  Followin"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000078568,
      "SummaryText": "g the incident investigation, a report is prepared to include the following information: (a) date, time, and location of the incident; (b) employees involved in the incident, and their roles; (c) date of the incident investigation; (d) names of employees on the incident investigation team; (e) description of the incident, including a chronology of events; (f) root causes and contributing causes, including conditions at the time of the incident; and (g) recommendations to prevent a recurrence.  Follow-up actions which are taken as a result of the recommendations in the incident investigation report are documented, and records of the reports and follow-up actions are maintained for a minimum of 5 years.\r\n\r\n3j. Employee Participation\r\n\r\nAll employees at Honeywell Orange have opportunities to access and participate in the sharing of information related to process safety for the processes involving vinyl acetate and ethylene. Employees in the maintenance and operating areas attend monthly safety meetings to review incidents, learn about new or modified processes, and discuss specific safety awareness topics.  A special committee named the Employee Health, Safety and Environmental committee made up of employees from each of the functional areas of the plant, meets monthly to review the status of in-progress safety action items, review safety policies and procedures for the plant, and recommend changes if necessary.  Employees routinely have opportunities to participate in other safety processes under the prevention program such as process hazard analyses, management of change, employee training and incident investigations.\r\n\r\n3k. Hot Work Permits\r\n\r\nHoneywell Orange has established a hot work permit system.  Under the system, a hot work permit must be issued prior to commencing hot work operations.  Hot work operations may include burning, welding, torch cutting, or any spark-emitting equipment/activity.  The hot work permit indicates the type and method of hot work to be"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000078568,
      "SummaryText": "ensuring that each contractor employee performs the assigned work in a manner consistent with the information provided during the safety orientation.  If the contractor assigns new employees to the job after work has commenced, the contractor must also ensure that each new employee receives a safety orientation prior to starting work on plant.  Failure of the contractor or any contractor employee to abide by these requirements is grounds for immediate dismissal from the plant.\r\n\r\n4)\tThe Five Year Accident History: \r\n\r\nIn the last five years, there have been no deaths, injuries, or significant property damage on site, or off-site deaths, injuries, sheltering in place, property damage, or environmental damage resulting from any releases of vinyl acetate or ethylene at Honeywell Orange.\r\n\r\n5)\tThe Emergency Response Plan: \r\n\r\nHoneywell Orange has an emergency preparedness planning and response program designed to deal with accidental releases and other unplanned events associated with the facility.  The plant has a written Emergency Response Plan that addresses various types of contingencies including specific actions for responding to an accidental chemical release.  The Plan provides for both internal plant and external community emergency alerting.  The Plan addresses emergency health care, sheltering in place, evacuation, emergency responsibilities, response and control procedures, and emergency equipment.  The Plan provides for the implementation of an Incident Command System to direct and coordinate the plant's response activities.  The Plan has been coordinated with the LEPC and with the local Fire Department, which would direct all offsite community response activities.  The Honeywell Orange plant relies upon the local Fire Department and Mutual Aid (an association that makes available emergency response equipment and expert assistance in emergencies) which is knowledgeable and prepared to respond to incidents involving accidental chemical releases. Annual in-ho"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000078568,
      "SummaryText": "use drills of the plant's emergency response system are performed at the plant.\r\n\r\n6)\tPlanned Changes to Improve Safety:\r\n\r\nHoneywell Orange has implemented a management-of-change procedure that controls permanent or temporary changes to process chemicals, equipment, procedures (operating conditions), environmental, safety, utilities and technology by identifying and reviewing the changes prior to their implementation.  The procedure is intended to sustain or enhance the level of safety within the operating unit by controlling the life cycle of changes.  It is accomplished by addressing technical basis for the change and its impact on safety and health, documentation of internal or external authorization/notification, updating of process safety information and operating procedures, training of affected employees, pre-startup safety review, and post-startup validation prior to closure."
    }
  ]
}