{
  "FacilityID": 1000013221,
  "FacilityName": "National Casein - Tyler, TX Facility",
  "FacilityStr1": "13039 Gaut Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Tyler",
  "FacilityState": "TX",
  "FacilityZipCode": "75708",
  "Facility4DigitZipExt": "3315",
  "FacilityCountyFIPS": "48423",
  "LEPC": "Smith County LEPC",
  "FacilityLatDecDegs": "32.434790",
  "FacilityLongDecDegs": "-095.190398",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7333826,
  "ParentCompanyName": "National Casein Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "National Casein Company",
  "OperatorStr1": "13039 Gaut Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Tyler",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75708",
  "OperatorZipCodeExt": "3315",
  "RMPContact": "Mr. Ervin Kitzmiller",
  "RMPTitle": "Plant Manager",
  "FTE": 10,
  "OtherEPAFacilityID": "TXD007333826",
  "EPAFacilityID": "100000020737",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-14 00:00:00",
  "SafetyInspectionBy": "Texas Commission of Environmental Quality",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-04-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-04-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-04-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-12-30 00:00:00",
  "DeRegistrationEffectiveDate": "2019-12-20 00:00:00",
  "AnniversaryDate": "2015-04-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.43297,
  "FRS_Long": -95.19205,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016490,
      "AltID": "Adhesives Manufacturing",
      "FacilityID": 1000013221,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000016892,
          "ProcessID": 1000016490,
          "NAICSCode": "32552",
          "_desc": {
            "NAICS_CODE": "32552",
            "NAICS_DESCRIPTION": "Adhesive Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019616,
          "ProcessID": 1000016490,
          "ChemicalID": 29,
          "Quantity": 182000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000519616,
          "ProcessID": 1000016490,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013221,
      "SummaryText": "1. EXECUTIVE SUMMARY\n\nPer the requirements of Section 112(r) of the Clean Air Act Amendments of 1990 as codified in Title 40 of the Code of Federal Regulations (CFR) Part 68, this Risk Management Plan (RMP) is submitted to the United States Environmental Protection Agency (U.S. EPA) in a timely manner for National Casein Company (National Casein), Tyler Texas, which handles one or more regulated substances listed in Appendix A of Part 68.\n\n\n1.1 STATIONARY SOURCE & REGULATED SUBSTANCES HANDLED\n\nNational Casein operates a chemical manufacturing plant located near Tyler, Texas that produces industrial adhesives.  The regulated substance handled by this facility is vinyl acetate monomer (VAM) which is considered hazardous by the United States Environmental Protection Agency (U.S. EPA).\n\nThe primary purpose of this facility is to produce industrial adhesives.  Reactors are used to polymerize the VAM with various other minor monomers to form non-hazardous polyvinyl acetate copolymer water based emulsions.  VAM is received by tanker truck into a storage tank.  When required, it is delivered to the reactors via pipeline.  The polymer emulsions produced are used and sold as high performance woodworking adhesives.  Access to the site is restricted to authorized facility employees, authorized management personnel and authorized contractors.\n\nThe maximum quantity of VAM that can be stored or handled at this facility is 182,000 pounds.\n\n\n1.2 ACCIDENTAL RELEASE PREVENTION & EMERGENCY RESPONSE POLICIES\n\nNational Casein has a policy to prevent accidental releases.  At the Tyler, Texas facility, National Casein handles VAM, which is considered hazardous by EPA.  Because of this reason, it is necessary to observe certain safety precautions in handling VAM to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013221,
      "SummaryText": " state rules and regulations.  Safety depends upon the manner in which we handle VAM combined with the safety devices inherent in the design of this facility combined with the safe handling procedures that we use and the training of our personnel.\n\nOur emergency response program includes procedures for notification of the local fire authorities and various emergency agencies.  Special procedures are included on the handling of a VAM spill as well as specific procedures to be followed in the case of an emergency.  All employees are thoroughly trained in how to handle discharges of hazardous material.  Annually, each employee undergoes extensive training exercises to reinforce their education and emergency response knowledge.\n\n\n1.3 WORST-CASE & ALTERNATIVE RELEASE SCENARIOS\n\nWorst-Case Scenario. - Failure of both VAM storage tanks (182,000 lbs VAM).  For this release scenario it is assumed that the contents of the tank are instantaneously spilled into the diked area surrounding the tanks while the tank building is assumed to fail exposing the VAM release directly to the atmosphere.  The diking limits the size of the VAM pool that is formed as a result of the worst-case release.  The diking that National Casein has put into place around the VAM storage tanks cuts the distance to the toxic endpoint by 92.3%.  \n\nAlternative Release Scenario. - Failure of the pipeline connecting the VAM storage tanks to the reactors.  This scenario was used because it is an incident that is most likely to occur.  This failure is caused by the pipe being impacted by a passing truck.  The release is assumed to last until the level of the tank is equal to the elevation of the pipe (12.5 feet), yielding a total scenario release of 34,282.6 pounds of VAM to the surrounding ground and atmosphere.  This release does not drain into a dike and forms a pool of VAM with a depth of one (1) centimeter.  \n\n\n1.4 GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM & CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThis fac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013221,
      "SummaryText": "ility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  All VAM process equipment undergoes scheduled inspection and preventative maintenance to assure that all equipment is in good working order and therefore the chances of an accidental VAM release is reduced.  The VAM tanks are enclosed within a building and within a diking area.  The diking area is capable of holding the contents of both VAM tanks.  The diking will reduce the surface area of the VAM pool formed thereby reducing the amount of material release to the surrounding air.  The building will enclose all of the contaminated air in the event of an accidental release which will reduce any impact to the surrounding communities.  Training of employees occurs on a regular basis as well as fire drill and safety meetings.\n\n\n1.5 FIVE YEAR ACCIDENT HISTORY\n\nNational Casein is proud to report that there have been no accidents at this facility that has impacted any area off-site within the past five (5) years.\n\n\n1.6 EMERGENCY RESPONSE PROGRAM\n\nThis facility's emergency response program discusses procedures to be followed in the case of an emergency and specific procedures for the handling of a VAM spill and/or fire to prevent and minimize the effects of an emergency.  The Tyler, and Winona Fire Department phone numbers have all been listed as well as the phone numbers for the Smith County Fire Marshall, Tyler Health Department, Smith County Water Control, TNRCC Region 5 Office, and Hulcher Services, Inc. (Emergency Contractor).\n\n\n1.7 PLANNED CHANGES TO IMPROVE SAFETY\n\nThis facility will undergo regular scheduled maintenance and inspections which will detect any problems at the facility.  Any mechanical or structural deficiencies found will be reported and fixed at once.  Hazard reviews and compliance audits will be completed on a regular basis to show any deficiencies present and/or find any ways of improving the safety of the VAM process.  These deficienci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013221,
      "SummaryText": "es and suggestions of improving safety will be corrected and implemented which will allow National Casein, Tyler to improve on their already safe operation of the VAM process."
    }
  ]
}