{
  "FacilityID": 1000008101,
  "FacilityName": "SICPA Securink Corporation",
  "FacilityStr1": "8000 Research Way",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "VA",
  "FacilityZipCode": "22153",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51059",
  "LEPC": "Fairfax Joint LEPC",
  "FacilityLatDecDegs": "38.739806",
  "FacilityLongDecDegs": "-077.205083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 146625272,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "SICPA Securink Corporation",
  "OperatorStr1": "8000 Research Way",
  "OperatorStr2": null,
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22153",
  "OperatorZipCodeExt": null,
  "FTE": 81,
  "OtherEPAFacilityID": "22153SCPVR8000",
  "EPAFacilityID": "100000066402",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-03-24 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.73993,
  "FRS_Long": -77.20545,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009346,
      "AltID": "Printing Ink Manufacturin",
      "FacilityID": 1000008101,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000010571,
          "ProcessID": 1000009346,
          "ChemicalID": 77,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000009627,
          "ProcessID": 1000009346,
          "NAICSCode": "32591",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000008101,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-06-04 00:00:00",
    "ERTrainingDate": "2009-04-06 00:00:00",
    "CoordinatingAgencyName": "Fairfax Joint LEPC",
    "CoordinatingAgencyPhone": "7032464386",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008101,
      "SummaryText": "SICPA Securink Corporation is a manufacturer of specialty paste inks.  The company conducts two distinct operations at this facility:  ink manufacturing and varnish manufacturing.  The ink manufacturing plant includes no chemicals subject to risk management planning requirements.  The varnish manufacturing plant produces a variety of resin blends and specialized polymers, including urethanes.  The following information primarily pertains to varnish manufacturing operations.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:  Since beginning operations at this site in 1984, the company has operated under a comprehensive emergency response plan.  The company's policy is to minimize the use of hazardous chemicals, and implement effective control measures to safely handle and use those hazardous substances which are necessary for successful operations.\n\nUnder the company's emergency plan, specific responsibilities are assigned to designated individual managers  The plan also describes the installation and operation of relevant safety systems and emergency equipment, and specifies appropriate training to individual employees who may be called upon to deal with emergency conditions.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE HANDLED:  One of the substances used to produce urethane polymers in the varnish plant is toluene diisocyanate (TDI), a listed toxic substance.  No other regulated toxic or flammable substances are present above threshold quantities.\n\nTDI is stored in a 2500 gallon stainless steel tank, having a capacity of approximately 25,500 pounds.  The product used by SICPA is a commercial blend of 2,4 TDI and 2,6 TDI with the CAS number 26474-62-5.  TDI is reacted with other chemicals under controlled conditions to produce special polymers which are used in SICPA's ink products.\n\nWORST-CASE RELEASE SCENARIO:  \n\nThe \"worst-case release scenario\" for this facility involves a possible rupture of the TDI storage tank containing its maximum capacity of T"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008101,
      "SummaryText": "DI.  Under this scenario, there would be no off-site impact from such a release.\n\nThe potential for off-site consequences is minimized by the fact that the TDI storage tank is located indoors, in a specially designed storage room.  In addition, the dedicated TDI storage room is equipped with a concrete dike which would mitigate the extent of any significant release by limiting the exposed surface area of the liquid pool (see below).\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:  The TDI tank is located in a separate locked room which is temperature controlled to maintain a temperature of 75 degrees F. (+/- 5 degrees).  The TDI is stored under a nitrogen blanket to prevent contact with water vapor.  The tank is equipped with temperature sensors which are connected to an alarm system.  A warning alarm  sounds if the temperature in the tank exceeds approximately 100 degrees F.  If the temperature rises above approximately 150 degrees F., a water deluge system activates automatically to cool the tank and prevent overpressurization.\n\nThe design of the varnish manufacturing plant is based on similar facilities operated by SICPA's parent company in locations around the world.  These facilities have operated for decades without significant incidents involving chemical releases.  In addition, prior to constructing this facility in 1984, SICPA hired an outside engineering firm to evaluate the potential hazards of the proposed manufacturing operations and build safeguards into the design of the facility to minimize the potential threat of any significant release or similar chemical incident.\n\nSICPA employs an outside firm to provide security 24 hours a day, 7 days a week.\n\nIn addition to the safety design measures described above, SICPA has developed a comprehensive emergency response plan incorporating procedures for employee training, spill prevention, recognition of emergency conditions, control and containment of releases, and emergency dri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008101,
      "SummaryText": "lls.  An adequate supply of spill containment equipment and absorbents is maintained on site to control any potential releases.  In addition, a supply of neutralization fluid is stored in proximity to the TDI storage room for use in decontamination of minor spills.\n\nFIVE YEAR ACCIDENT HISTORY:  There has been no significant release of TDI since the facility began operations, except for minor spills (drips) from transfer equipment during bulk deliveries.  The amount of TDI released during such incidents was considerably less than one pound.\n\nEMERGENCY RESPONSE PROGRAM:  As described above, SICPA has developed a comprehensive emergency response plan to address potential releases of hazardous materials, including TDI.  A copy of this plan has been provided to local emergency responders, and the local fire department has prepared a pre-plan for the facility.  SICPA routinely provides familiarization tours to emergency responders, typically at intervals of approximately one year.\n\nPotential emergency measures have been coordinated with local authorities, and the SICPA facility is included in the emergency response plan prepared by the Local Emergency Planning Committee (LEPC).  Referring to SICPA's facility, the LEPC emergency response plan states:\n\n\"A detailed emergency response plan is in place for the facility.  Standard Operating Procedures for response to emergencies involving the above chemicals would be followed by responding Fire and Rescue personnel.  The first-due fire station has a pre-plan for this facility.\"\n\nFurthermore, the LEPC's emergency response plan, referring to the presence of TDI at SICPA's facility, describes the probability of hazard containment as:\n\n\"... high, based on absence of prior emergency incidents involving hazardous materials, presence of spill control equipment, emergency leak control equipment, portable leak detection equipment, personal protective equipment and employee hazardous material training.  The facility has had no emergency "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008101,
      "SummaryText": "incidents involving hazardous materials.\"\n\nPLANNED CHANGES TO IMPROVE SAFETY:  No significant changes are planned.  Routine training and pre-planning activities will continue as presently implemented."
    }
  ]
}