{
  "FacilityID": 1000056677,
  "FacilityName": "Fertilizer Service Company",
  "FacilityStr1": "601 Highway 59 North",
  "FacilityStr2": null,
  "FacilityCity": "Fairfax",
  "FacilityState": "MO",
  "FacilityZipCode": "64446",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29005",
  "LEPC": "Atchison County LEPC",
  "FacilityLatDecDegs": "40.345185",
  "FacilityLongDecDegs": "-95.39672",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bruce Pyeatt",
  "OperatorStr1": "601 Highway 59 North",
  "OperatorStr2": null,
  "OperatorCity": "Fairfax",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64446",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bruce Pyeatt",
  "RMPTitle": "Manager",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000169471",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-01-28 00:00:00",
  "SafetyInspectionBy": "MO Dept of Ag",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-04-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-04-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-04-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-04-26 00:00:00",
  "DeRegistrationEffectiveDate": "2016-04-07 00:00:00",
  "AnniversaryDate": "2021-04-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.34672,
  "FRS_Long": -95.39603,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Submitted RMP using wrong facility ID",
  "_processes": [
    {
      "ProcessID": 1000070765,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000056677,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000071967,
          "ProcessID": 1000070765,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000087492,
          "ProcessID": 1000070765,
          "ChemicalID": 56,
          "Quantity": 600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000587492,
          "ProcessID": 1000070765,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056677,
      "SummaryText": "Facility Name: Fertilizer Service Company\n\nLocation: 601 Highway 59 North, Fairfax, MO 64446\n\nContact: Bruce Pyeatt\n\n\n\n\n\nRMP Facility ID: 1000 0016 9471\n\n\n\nRMP Executive Summary below:\n\n1. The Facility Policy: The owners, management and employees of the facility are committed to the prevention of any accidental releases of anhydrous ammonia by utilization of proper equipment, regular inspections and maintenance, and training of all persons that work with the material. Should an accidental release occur, the facility has coordinated with the local fire department and the local emergency planning committee to respond to any release and minimize the impact of the release to\n\npeople and the environment.\n\n\n\n2. Facility Information: The primary activity at the facility is the storage of anhydrous ammonia for sale to farmers. Anhydrous ammonia is received, stored and distributed for direct application as a crop production nutrient. Ammonia is stored in one (1) pressurized, steel storage tank.\n\n\n\n3. The worst case release scenario is not listed in the executive summary for security reasons. The alternate case release scenario is not listed in the executive summary for security reasons.\n\n\n\n4. The Accidental Release Program: The facility complies with Missouri Revised Statutes Section 266.355.1, Chapter 43, Rule 43.6(200) relating to the storage and handling of anhydrous ammonia. These regulations administered by the Department of Agriculture are consistent with ANSI/CGA G-2.1 and OSHA 29 CFR 1910.111 regarding the storage and handling of anhydrous ammonia.\n\n\n\n5. The Five Year Accident History: There has been no accidental release of anhydrous ammonia for the covered process in the past five years that has resulted in any onsite deaths, injuries or property damage or offsite deaths, injuries, evacuations, sheltering-in-place, property damage or environmental damage.\n\n\n\n6. The Emergency Response Program: The facility has a written emergency action plan in accordance with OSHA "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056677,
      "SummaryText": "Standard 29 CFR 1910.38 and provides state and local authorities the emergency planning and community right-to-know information as required under SARA Title III of EPCRA. Information relevant to emergency planning, including off-site consequence analysis, is made available to the local fire department and local emergency planning committee for preparation of a community response plan.\n\n\n\n7. Planned Changes to Improve Safety: Safety improvements are an on-going process at this facility. Periodic evaluations are performed to assess the maintenance of safe practices and operations. There are no additional specific anhydrous ammonia safety recommendations for implementation at this time.\n\n\n\n1.  Facility Policy:  The owners, management and employees of Fairfax Fertilizer Service Company are committed to the prevention of any accidental releases of anhydrous ammonia.  If an accidental release should occur, the facility is prepared to work with the local fire department, Atchison County LEPC, and/or others authorities, to mitigate and minimize the impacts of the release to the public and the environment.\n\n\n\n2.  Facility Information.  The primary activity at the facility is the distribution of products to farmers.  The fertilizer product, anhydrous ammonia is received, stored and distributed for direct application as a nurient for crop production,  Anhydrous ammonia is stored in tanks designed for this purpose.\n\n\n\n3.  Accidental Release Prevention Program.  This facility follows the provisions of the U. S. Occupational Safety and Health Administration (OSHA), 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\" and our State regulations covering anhydrous ammonia.\n\n\n\n4.  Five-Year Accident History.  There have been no accidental releases of anhydrous ammonia during the past five-years that have caused any deaths, injuries or significant property damage at the facility; nor to our knowledge, has there been any accidental releases resulting in off-site deaths, injurie"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056677,
      "SummaryText": "s, evacuations, property damage, or environmental damage.\n\n\n\n5.  Emergency Response Program.  The facility has an Emergency Action Plan.  We do not plan to have our employees respond to a major release.  If a large release of anhydrous ammonia takes place at our facility, the response action is to evacuate the area of the release and call 911 and all applicable emergency response numbers listed in our Emergency Action Plan.\n\n\n\n6.  Planned Changes To Inprove Safety.  Safety improvement is an ongoing process at this facility.  Periodic evaluations are performed to access the conditions of the facility.  We are in the process of reviewing our prevention program and making necessary changes."
    }
  ]
}