{
  "FacilityID": 1000072224,
  "FacilityName": "Sour Lake Storage Facility",
  "FacilityStr1": "500 North Merchant Street",
  "FacilityStr2": "P.O. Box 1301",
  "FacilityCity": "Sour Lake",
  "FacilityState": "TX",
  "FacilityZipCode": "77659",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48199",
  "LEPC": "Hardin County LEPC",
  "FacilityLatDecDegs": "30.148056",
  "FacilityLongDecDegs": "-094.413611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A5",
  "LatLongDescription": "AB",
  "FacilityURL": "www.motiva.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Motiva Enterprises",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Motiva Enterprises LLC",
  "OperatorStr1": "6347 Stonewall Road",
  "OperatorStr2": "P.O. Box 1029",
  "OperatorCity": "Sour Lake",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77659",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": "TXD008097529",
  "EPAFacilityID": "100000050525",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-03-10 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-05-20 13:37:45",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-08-22 13:22:05",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-08-22 13:22:05",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-08-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 30.144904,
  "FRS_Long": -94.413485,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000090380,
      "AltID": "SLS Caverns",
      "FacilityID": 1000072224,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000112970,
          "ProcessID": 1000090380,
          "ChemicalID": 155,
          "Quantity": 658519389.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000098645,
              "ProcessChemicalID": 1000112970,
              "ChemicalID": 129
            },
            {
              "FlamMixChemID": 1000098646,
              "ProcessChemicalID": 1000112970,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000098647,
              "ProcessChemicalID": 1000112970,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000098648,
              "ProcessChemicalID": 1000112970,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000098649,
              "ProcessChemicalID": 1000112970,
              "ChemicalID": 154
            },
            {
              "FlamMixChemID": 1000098650,
              "ProcessChemicalID": 1000112970,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000091602,
          "ProcessID": 1000090380,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000076675,
              "Process_NAICS_ID": 1000091602,
              "SafetyReviewDate": "2017-08-03 00:00:00",
              "PHA_Date": "2017-09-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-03-13 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Pilot lights, LEL monitors-alarms, pump shutdowns, auto valve closure",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Trained personnel",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-05-01 00:00:00",
              "TrainingReviewDate": "2016-07-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "CBT",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-07-05 00:00:00",
              "EquipmentInspectionDate": "2018-06-07 00:00:00",
              "EquipmentTested": "PRV",
              "ChangeMgmtDate": "2018-03-21 00:00:00",
              "ChangeMgmtReviewDate": "2017-11-01 00:00:00",
              "PreStartupReviewDate": "2018-06-11 00:00:00",
              "ComplianceAuditDate": "2016-12-15 00:00:00",
              "AuditCompletionDate": "2018-09-18 00:00:00",
              "IncidentInvestigationDate": "2008-06-01 00:00:00",
              "InvestigationChangeDate": "2008-12-15 00:00:00",
              "ParticipationPlansReviewDate": "2018-08-14 00:00:00",
              "HotWorkPermitReviewDate": "2017-05-22 00:00:00",
              "ContractorSafetyReviewDate": "2018-08-21 00:00:00",
              "ContractorSafetyEvalDate": "2017-11-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000095274,
                  "PreventionProgram3ID": 1000076675,
                  "ProcessChemicalID": 1000112970
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000072224,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-05-31 00:00:00",
    "ERTrainingDate": "2017-10-23 00:00:00",
    "CoordinatingAgencyName": "Sour Lake Volunteer FD",
    "CoordinatingAgencyPhone": "4092465100",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072224,
      "SummaryText": "this policy.\r\n\r\nRoutinely audit Safety, Health and Environmental performance on all our operations to ensure compliance with laws and company policies.\r\n\r\nRespond quickly and effectively to Safety, Health and Environmental incidents involving our facilities, equipment, and products under our control.\r\n\r\nFoster constructive dialogue with federal, state, and local governments and communities in analyzing emerging Safety, Health and Environmental issues, finding solutions to problems and developing cost effective, scientifically-based standards and regulations.\r\n\r\nRequire subsidiaries and joint ventures under our control to manage Safety, Health and Environmental performance in line with this policy, and use our influence to promote it in other ventures.\r\n\r\nMotiva's commitment is demonstrated by the resources invested in accident prevention, such as training of personnel and considering safety in the design, installation, operation, and maintenance of processes.\r\n\r\n2.0  DESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nThe Sour Lake Storage Facility consists of four underground caverns, leached from salt domes, that are used to store butane. These caverns, or wells, have a capacity of approximately three million barrels and contain brine as well as butane.\r\n\r\nWhen butane is pumped into a cavern, the brine is displaced and stored in brine pits. When butane is transported from the Sour Lake Storage Facility, brine is pumped from the pits into the cavern to displace the butane.\r\n\r\nThe Sour Lake caverns contain flammable hydrocarbons above the EPA RMP threshold quantity.\r\n\r\n3.0 HAZARD ASSESSMENT RESULTS\r\n\r\nWorst Case Scenario and Alternate Release Scenario for RMP covered substances were evaluated and included in the report.\r\n\r\n4.0 GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM STEPS\r\n\r\nThe following is a summary of the general accident prevention program in place at Chemical Logistics Complex. Because processes at the Sour Lake Storage Facility that are reg"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072224,
      "SummaryText": "1.0 ACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\r\n\r\nThe Motiva Enterprises LLC - Chemical Logistics Complex has a long-standing commitment to the safety of workers and the public and protection of the environment. This commitment is expressed in the Company's policy statement:\r\n\r\nMotiva is committed to protecting the health and safety of employees and others in our workplaces and protecting the environment and public wherever we conduct business activities. We are committed to the belief that all occupational injuries and illnesses are preventable and that serious or fatal injuries resulting from our activities are unacceptable. Each employee has a personal and vital responsibility to contribute to safe work performance. Our objective is to continuously improve our Safety, Health and Environmental performance, and in so doing, to be recognized as a leader in our industry. We will comply with all safety, health, and environmental laws and regulations and will manage performance in these areas in the same manner as other aspects of our business.\r\n\r\nIn accordance with this policy Motiva will:\r\n\r\nAssure compliance and continuous improvement using management systems that set targets and report performance.\r\n\r\nDevote sufficient resources to ensure outstanding Safety, Health and Environmental performance.\r\n\r\nDesign, maintain, and operate facilities to minimize environmental impact, and to protect employees, contractors, and the public from injury and illness.\r\n\r\nFoster awareness and provide training with the objective of protecting employees, the community, and the environment.\r\n\r\nIntegrate Safety, Health and Environmental processes into line operations, hold all employees accountable for performance and make this performance a key factor in evaluating and rewarding personnel.\r\n\r\nEmphasize Safety, Health and Environmental performance as a key factor in selecting contractors and require contractors to manage Safety, Health and Environmental matters in accordance with"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000072224,
      "SummaryText": "ity changes to ensure that safety features in the processes are not compromised.\r\n\r\n4.3 Process Hazard Analysis\r\n\r\nChemical Logistics Complex has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to identify reasonably foreseeable hazards and ensure that adequate controls are in place to manage these potential hazards.\r\n\r\nChemical Logistics Complex uses the hazard and operability (HAZOP) analysis technique to perform these evaluations. HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques. The analyses are conducted using a team of people who have operating experience as well as engineering expertise. This team identifies and evaluates potential hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\r\n\r\nThe PHA team's findings are entered into a computer database and assigned to appropriate personnel for resolution.\r\n\r\nImplementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team. This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. All approved mitigation options being implemented in response to PHA team findings are tracked until they are complete. The final resolution of each finding is documented and retained.\r\n\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original process hazard analysis, Chemical Logistics Complex periodically updates and revalidates the hazard and analysis results. These periodic reviews are conducted at least every five years and will be conducted at this frequency until the process is no longer operating. The results and findi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072224,
      "SummaryText": "ulated by the EPA RMP regulations are also subject to the OSHA Process Safety Management (PSM) Standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\n\r\n4.1 Employee Participation\r\n\r\nChemical Logistics Complex encourages and incorporates employee participation in all facets of process safety management and accident prevention. Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team or incident investigation team. Employees have access to all information created as part of the facility's accident prevention program.\r\n\r\nIn addition, Chemical Logistics Complex incorporates employee participation in The HSSE Steering Committee, The Joint Health & Safety Committee, Weekly Safety Meetings, Unit Team Meetings, Task Teams, The Emergency Response Team, Process Safety Initiatives work processes, daily operations meetings, and The Contractor Safety Committee.\r\n\r\n4.2 Process Safety Information\r\n\r\nChemical Logistics Complex maintains a variety of technical documents that help maintain safe operation of the Sour Lake Storage Facility. These documents address the hazards of the chemicals in the processes, the technology of the processes, and the equipment used in the processes.\r\n\r\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs). MSDSs are readily available through facility's computer system. Chemical Logistics Complex also maintains numerous technical documents that provide information about the design and construction of process equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facil"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000072224,
      "SummaryText": "ty programs and performance of prospective contractors, (2) basic safety training of contract employees by approved outside agencies, (3) site specific orientation training of contract employees, (4) prework conference with contractor supervision, (5) providing contractors with process overview information, and (6) monitoring contractor performance to ensure that contractors are fulfilling their safety obligations.\r\n\r\n4.7 Pre-Startup Safety Reviews (PSSRs)\r\n\r\nChemical Logistics Complex conducts a PSSR for any new facility or facility modification prior to commissioning/startup of the change. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.\r\n\r\nA PSSR involves field verification of the construction and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\n\r\n4.8 Mechanical Integrity\r\n\r\nChemical Logistics Complex has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process equipment.\r\n\r\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000072224,
      "SummaryText": "ngs from these updates are documented and retained. Once again, the team findings are entered into a computer database and assigned to appropriate departments for resolution. Final resolution of the findings is also documented in the database.\r\n\r\n4.4 Operating Procedures\r\n\r\nChemical Logistics Complex maintains procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.\r\n\r\nThese procedures are periodically reviewed and annually certified as current and accurate. The procedures are maintained current and accurate by revising them as necessary to reflect changes made through the management of change process. Operating procedures are readily available to operators and for other personnel as necessary to safely perform their job tasks.\r\n\r\nUpper and lower operating limits, consequences of deviation, and steps required to correct or avoid deviation from critical parameters, such as pressure, temperature, level, etc., are included in operating procedures.\r\n\r\nIn addition to Operating Procedures, Chemical Logistics Complex has long-standing safe work practices in place to help ensure worker and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous materials before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of affected personnel, form a system to he"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000072224,
      "SummaryText": "they can perform their job in a safe manner. Applicable written procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back in service unless special approval is given to use of the equipment, after it is determined what actions are necessary to ensure the safe operation.\r\n\r\nAnother integral part of the mechanical integrity program is quality assurance. Chemical Logistics Complex incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\r\n\r\n4.9 Hot Work Permit\r\n\r\nChemical Logistics Complex utilizes a comprehensive work permit system to safely manage all work performed at the facility. In addition to hot work, the work permit system also includes requirements for entry into confined spaces, as well as requirements for other than hot work.\r\n\r\n4.10 Management of Change\r\n\r\nChemical Logistics Complex has a comprehensive system to manage changes to processes. This system requires that changes to items such as process equipment, chemicals, technology (including process operation conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards, and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures are updated to incorporate these changes. In addition, operating and maintenance personnel are provi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000072224,
      "SummaryText": "lp ensure that operations and maintenance activities are performed safely.\r\n\r\n4.5 Training\r\n\r\nTo complement the written procedures for process operations, Chemical Logistics Complex has a comprehensive training program for employees involved in operating a process. New employees receive basic training in refinery operations if they are not already familiar with such operations.\r\n\r\nAfter successfully completing this training, a new operator receives on the job training to learn process-specific duties and tasks. After operators demonstrate (e.g., through tests, skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently.\r\n\r\nSkills are maintained through refresher training. The operating procedures are grouped into modules, and each operator is required to review the assigned modules and pass the prescribed tests over a period of three years. Thus, refresher training is a continuing effort. All operating training is documented for each operator, including the means used to verify that the operator understood the training.\r\n\r\n4.6 Contractors\r\n\r\nChemical Logistics Complex uses contractors for routine maintenance activities, maintenance during shutdown periods, and for construction activities. Chemical Logistics Complex also uses contractors for less safety sensitive work, such as security, janitorial, ground maintenance, engineering, clerical, etc. In addition, the Sour Lake Storage Facility is staffed by contractors.\r\n\r\nContractors performing the more safety sensitive work dealing with direct maintenance and construction activities are subjected to more stringent safety requirements to assure that they: (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards of the workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules. This is accomplished by: (1) evaluating the safe"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000072224,
      "SummaryText": "ency response program at the Sour Lake Storage Facility is coordinated with the Local Emergency Planning Committee (LEPC) of Hardin County. This coordination includes periodic meetings of the committee, which includes local emergency response officials, local governmental officials, and industry representatives. Chemical Logistics Complex has around-the-clock communications capability with appropriate LEPC officials, who have direct communications with local police and fire departments. Hardin County has an Emergency Alert System (EAS) in place which provides residents with instructions as to what to do in the event of an emergency. The EAS provides a means of notifying the public of an incident if necessary, as well as facilitating quick response. In addition to periodic LEPC meetings, Chemical Logistics Complex conducts periodic emergency drills that involve the LEPC, as well as, local emergency response organizations."
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000072224,
      "SummaryText": "be caused by (1) equipment failures and (2) human errors.\r\n\r\nIn addition to the accident prevention program activities, the Sour Lake Storage Facility has safety features designed to help (1) quickly detect a release, (2) contain/control a release, and (3) reduce the consequences of (mitigate) a release. The following safety features are utilized:\r\n\r\nRelease detection\r\n1. Hydrocarbon detectors with alarms and automatic shutdowns\r\n2. Facility is manned around the clock\r\n\r\nRelease containment/control\r\n1. Process relief valves\r\n2. Remotely activated isolation valves\r\n3. Manual and automated emergency shutdown valves\r\n4. Alarms for process parameters\r\n5. Automated emergency shutdown systems\r\n6. Curbing or diking to contain liquid releases\r\n7. Redundant equipment and instrumentation\r\n8. Pilot lights\r\n\r\nRelease mitigation\r\n1. Fire extinguishers\r\n2. Trained emergency response personnel\r\n3. Personal protective equipment\r\n\r\n6.0 FIVE-YEAR ACCIDENT HISTORY\r\n\r\nThe Sour Lake Storage Facility has not had an RMP incident.\r\n\r\n7.0  EMERGENCY RESPONSE PROGRAM INFORMATION\r\n\r\nA written emergency response program is in place to protect worker and public safety as well as the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including reporting of an emergency, emergency response, first-aid and medical treatment for exposures, evacuation plans, accounting for personnel, notification of local emergency response, and post-incident cleanup and decontamination requirements. In addition, the procedures address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties.\r\n\r\nThe overall emerg"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000072224,
      "SummaryText": "ded training as needed.\r\n\r\n4.11 Incident Investigation\r\n\r\nChemical Logistics Complex promptly investigates incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and enters the information into a computer database for tracking. Each recommendation is promptly assigned to an appropriate department for resolution. The final resolution of each finding or recommendation is documented in the database, available for review by all employees and contractors who could be affected by the findings. Incident investigation reports are retained for at least five years so that the reports can be reviewed during future PHAs and PHA revalidations.\r\n\r\n4.12 Compliance Audits\r\n\r\nTo help ensure that the accident prevention program is functioning properly, audits are periodically conducted to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every three years. The audit team develops findings that are forwarded to Chemical Logistics Complex's management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented in a computer database, and the two most recent audit reports are retained.\r\n\r\n5.0 CHEMICAL SPECIFIC PREVENTION STEPS\r\n\r\nThe Sour Lake Storage Facility has hazards that are managed to ensure continued safe operation. The accident prevention program summarized previously is applied to the Sour Lake Storage Facility. Collectively, these prevention program activities help prevent potential accident scenarios that could"
    }
  ]
}