{
  "FacilityID": 1000024090,
  "FacilityName": "Two Rivers Cooperative-Tracy",
  "FacilityStr1": "1004 265th Street",
  "FacilityStr2": null,
  "FacilityCity": "Tracy",
  "FacilityState": "IA",
  "FacilityZipCode": "50256",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19123",
  "LEPC": "Mahaska County LEPC",
  "FacilityLatDecDegs": "41.26922",
  "FacilityLongDecDegs": "-092.86636",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.tworivers.coop/",
  "FacilityEmailAddress": "nsteinbach@tworiverscoop.net",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Two Rivers Cooperative",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Two Rivers Cooperative",
  "OperatorStr1": "PO Box 47",
  "OperatorStr2": null,
  "OperatorCity": "Pella",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50219",
  "OperatorZipCodeExt": "0047",
  "RMPContact": "Nick Steinbach",
  "RMPTitle": "Safety Coordinator",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000215796",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-06-14 00:00:00",
  "SafetyInspectionBy": "IDALS",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-08-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-10-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-10-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-10-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029504,
      "AltID": "Product Storage Only",
      "FacilityID": 1000024090,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000029788,
          "ProcessID": 1000029504,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000035388,
          "ProcessID": 1000029504,
          "ChemicalID": 56,
          "Quantity": 279830.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000535388,
          "ProcessID": 1000029504,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024090,
      "SummaryText": "Accidental Release Prevention/Emergency Response at Two Rivers Cooperative, Pella IA\n\nThis facility complies with ANSI Standard K-61.1-1989 requirements for Anhydrous Ammonia storage. It is our policy to adhere to all applicable Federal, State, and local regulations. If an emergency were to occur, it is our policy to immediately notify the Mahaska and Marion County Emergency Management Agencies as Tracy is located near the border of both counties. A 911 call would be made to both organizations. Incidental to the notification to the  County EMAs, a call to Marion and Mahaska County LEPA will be made.\n\n\n\nTwo Rivers has planned for an emergency, it is acknowledged that a real emergency will be unexpected and may very well be much different than the scenarios anticipated and cannot be ensured to duplicate the defined plan. In reality, the situation that develops may not occur in the manner planned or assumed, in that instance, the plan will be utilized as a guideline.\n\n\n\nThe Emergency Action plan (EAP) developed for the facility describes procedures that are intended to minimize hazards associated with human health and environment from fires, explosions, sudden and unexpected release of chemicals (NH3), tornadoes, bomb threats, theft, or other accidents and acts of natures that may occur on our premises.\n\nThe primary emergency coordinator for the Tracy, Iowa location is Nick Steinbach, Safety Coordinator. Nick Steinbach's  work and 24-hour contact information are provided in the registration section of this document. In addition, the following individuals are to be contacted in the order listed:\n\n\n\nCraig Hetland\n\nWork: 641-949-6411\n\nCell: 641-218-4089\n\nHome: 641-628-9815\n\n\n\nJim Findley\n\nCell: 641-891-0580\n\n\n\nMatt Van Weelden\n\nWork: 641-627-5311\n\nCell: 641-780-1999\n\nHome: 641-627-5288\n\n\n\nDescription of the Anhydrous Ammonia Storage/Distribution Plant and the regulated Substance Handled at Two Rivers Cooperative:\n\nThis facility is a bulk anhydrous ammonia (NH3) storage an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024090,
      "SummaryText": "d distribution plant. The NH3 that is stored at the facility is distributed to agricultural crop producers in the surrounding area who utilize the product for crop nutrient purposes.\n\n\n\nThe system consists of one (1) large storage tank with associated piping, valves, liquid pumps and other miscellaneous equipment. Throughout the year numerous portable nurse tanks may also be present at the site. The NH3 plant is only operated on a seasonal basis (Spring and Fall). Full time equivalent employees were computed on that basis. At a maximum, the plant operates a total of three (3) months. The FTE for the location is two (2).\n\n\n\n\n\nThe Worst Case Scenarios and Alternative Release Scenarios:\n\nThe worst scenario is the failure of one storage tank when filled to the greatest amount allowed (85% of capacity), resulting n the release of the total volume in a gaseous (hazardous ammonia vapor cloud) form. According the EPA eRMP Program the distance to endpoint is 4.4 miles.\n\n\n\nThe alternative release scenario involves the transport delivery vehicle pulling away from the intake lines into the storage plant without disconnecting the hoses. The resulting release, according  to the EPA's eRMP Program has a distance end point of 0.5 miles.\n\n\n\nThe system shut off is protected by internal excess flow valves, check valves, relief valves, manual shut off valves, and emergency shut off valves. The load out risers used in filling nurse tanks area protected by breakaway couplers designed to immediately stop the flow of ammonia if the line or hose breaks. All of the main storage tank valves are to be locked when not in use.\n\n\n\nAs the facility is located in relatively close proximity of the town of Tracy, IA and the Red Rock Reservoir, provisions have been designed to affected persons and an evacuation plan is in place in case of major incident.\n\n\n\n\n\nGeneral accidental release prevention program and chemical specific prevention steps:\n\nThis facility complies with EPA's accident prevention rule"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024090,
      "SummaryText": " and all applicable state and local codes and regulations. The Anhydrous Ammonia system is designed, installed, and maintained in accordance with ANSI Standard K-61.1-1989 with amendments and State of Iowa law.\n\n\n\nIn addition, the company has specific operating procedures in place intended to minimize the potential for an accidental and potentially catastrophic release of anhydrous ammonia. Finally, Two Rivers Cooperative has extended to all local EMA and Fire Departments the opportunity to visit the location and to avail themselves of specific anhydrous ammonia health hazard information and training.\n\n\n\n\n\nFive-Year Accident History:\n\nTwo Rivers Cooperative has not experienced any accidental release involving anhydrous ammonia in the last five years that caused death, injury, property or environmental damage, evacuations or sheltering's.\n\n\n\n\n\nThe Emergency Response Program:\n\nIn the event of an emergency involving the Tracy anhydrous ammonia system, it is the policy of Two Rivers Cooperative to immediately notify the Tracy Volunteer Fire Department and the Mahaska and Marion EMA to request that they respond to the emergency at the Tracy location. In the unlikely event the Tracy Volunteer Department in unable to adequately respond to an emergency, the Pella Fire Department will be summoned due to a reciprocal agreement with Tracy. Members of Two Rivers Cooperative management have discussed these procedures with leaders of the emergency personnel involved. Members of the fire department and the LEPC have inspected the Tracy location and copies of photographs of the plant have been provided for reference purposes to the entities.\n\n\n\n\n\nPlanned changes to improve safety:\n\nThe plan is to minimize hazards to human health and the environment that are associated with an accidental release of NH3. Employees working at the plant make routine observations prior to and during the transfer operations of product. In doing so, they are able to detect any potential issues. The routin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024090,
      "SummaryText": "e inspections identify any portion of the system that may be under stress or about to fail. Repairs can be made prior to an incident. Employees are annually trained and new hires are also trained as described in this document. Training is also available to local emergency responders as described earlier in the document.\n\n"
    }
  ]
}