{
  "FacilityID": 1000041300,
  "FacilityName": "Rohm and Haas - Hayward Plant",
  "FacilityStr1": "25500 Whitesell Street",
  "FacilityStr2": null,
  "FacilityCity": "Hayward",
  "FacilityState": "CA",
  "FacilityZipCode": "94545",
  "Facility4DigitZipExt": "3615",
  "FacilityCountyFIPS": "06001",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "37.628889",
  "FacilityLongDecDegs": "-122.127222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "WA",
  "FacilityURL": "WWW.Dow.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 20028072,
  "ParentCompanyName": "Rohm and Haas Company",
  "Company2Name": null,
  "CompanyDUNS": 2292043,
  "Company2DUNS": null,
  "OperatorName": "Sean Clinning",
  "OperatorStr1": "25500 Whitesell Street",
  "OperatorStr2": null,
  "OperatorCity": "Hayward",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94545",
  "OperatorZipCodeExt": "3615",
  "FTE": 57,
  "OtherEPAFacilityID": "94545RHMND25500",
  "EPAFacilityID": "100000119187",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-08-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.628889,
  "FRS_Long": -122.127222,
  "FRS_Description": "WELLHEAD PROTECTION AREA",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000050807,
      "AltID": "AN Storage and Processing",
      "FacilityID": 1000041300,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000061575,
          "ProcessID": 1000050807,
          "ChemicalID": 25,
          "Quantity": 121700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000051284,
          "ProcessID": 1000050807,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000043213,
              "Process_NAICS_ID": 1000051284,
              "SafetyReviewDate": "2014-03-31 00:00:00",
              "PHA_Date": "2014-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-06-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "thermal oxidizer",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "AFFF vapor suppression system",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Indicator tubes",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-08-23 00:00:00",
              "TrainingReviewDate": "2014-05-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-08-30 00:00:00",
              "EquipmentInspectionDate": "2014-04-21 00:00:00",
              "EquipmentTested": "AN Tank Inspection",
              "ChangeMgmtDate": "2014-04-02 00:00:00",
              "ChangeMgmtReviewDate": "2014-04-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2014-03-31 00:00:00",
              "AuditCompletionDate": "2015-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-03-31 00:00:00",
              "HotWorkPermitReviewDate": "2013-04-10 00:00:00",
              "ContractorSafetyReviewDate": "2014-04-30 00:00:00",
              "ContractorSafetyEvalDate": "2013-11-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000051729,
                  "PreventionProgram3ID": 1000043213,
                  "ProcessChemicalID": 1000061575
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000041300,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-09-27 00:00:00",
    "ERTrainingDate": "2014-04-11 00:00:00",
    "CoordinatingAgencyName": "Hayward Fire Department",
    "CoordinatingAgencyPhone": "5105834900",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041300,
      "SummaryText": "olymerization reaction.  Once the reaction is complete, the emulsion is transferred  to a drain tank where additional additives may be introduced and the pH of the emulsion can be adjusted. Bactericides are also\r\nadded to prevent bacterial growth which would degrade the final product.  The emulsion is filtered into the product storage tanks to await sale.  The products are shipped out of the facility by tank truck, railcar, or in containers. The finished latex product is considered non-hazardous.\r\n\r\nThe Dow Chemical company is a Responsible Care company adhering to the Responsible Care Guiding Principles set forth by member of the U.S. American Chemistry Council.  Dow has a long standing commitment to provide a safe workplace, to protect the environment and to prevent accidental releases. \r\n\r\nThe types of risk management programs required by the RMP have long been in place at The Dow Chemical company.  Safe operation is a plant and is a company core value, reflected in many policies as well as in everyday activities of the plant personnel.\r\n  \r\nThe Dow Chemical Hayward Rohm and Haas Facility is fully committed to maintaining a safe and incident free workplace.  We create a safe work place by careful planning, use of detailed procedures in our activities and by employing a work force motivated to maintain a safe working environment.   Examples of our safety protection measures include:\r\n¿\tDow Safety and Loss Prevention Principles in Design of our Processes\r\n¿\tDow safety standards on how to conduct critical plant activities \r\n¿\tAutomatic shutdown devices that are triggered plant process control computer\r\n¿\tSecondary containment for storage tanks\r\n¿\tRoutine drills on pre defined criteria to ensure plant personnel are ready to respond to leaks and spills\r\n¿\tAlarm systems and automatic shutdown devices for critical control parameters\r\n¿\tPressure relief devices to prevent over pressurization of plant equipment\r\n¿\tFire protection and vapor suppression systems\r\n¿\tComprehens"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000041300,
      "SummaryText": "ive written procedures and training programs\r\n¿\tHighly trained and experienced operators\r\n¿\tOperator surveillance of unloading operations\r\n¿\tUse of a Safe Work Permit system to control work in hazardous areas\r\n¿\tPreventative maintenance program for equipment\r\n¿\tWork preplanning\r\n¿\tControlled entry to Plant site\r\n¿\tEnvironment, Health, and Safety (EHS) reviews for managing change in new and existing processes\r\n¿\tRigorous site security program\r\n¿\tDetailed company audits of site safety programs\r\n¿\tSafety observations of work and plant activities\r\n\r\nPlant and Company Incident Prevention programs are designed in accordance with the OSHA PSM, EPA, RMP and state and local standards.\r\n\r\n1.7 summary of Five year Accident History\r\n\r\nThere have been no accidental releases of acrylonitrile or vinyl acetate at the Rohm and Haas Hayward Plant that resulted in deaths, injuries or significant property damage on site, or known offsite death, injuries, evacuations, sheltering in place, property damage or environmental damage in the past five years.\r\n\r\n1.8 Summary of the Emergency Response Program\r\nThe Dow Chemical Hayward Rohm and Haas Facility has established a comprehensive Emergency Procedures Manual for responding to a release or safety incident in a safe and organized manner. The Rohm and Haas emergency response plan is based upon Dow Corporate Standard and was developed in conjunction with the City of Hayward Fire Department. \r\n\r\nThe plan has been designed to meet the requirements of all relevant regulations requiring emergency response plans, and is intended to prevent and mitigate the consequences of a hazardous material spill, protect our employees, the surrounding community, and the environment, and serve as a reference to responders in the event of an emergency.  Copies of the\r\nPlant response plan have been provided to the City of Hayward Fire Department.  This plan provides the requirements for evacuation of the facility; notification of emergency responders, agency conta"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000041300,
      "SummaryText": "cts and industrial neighbors; emergency first aid or medical treatment for human exposure; coordination of the in house Incident Command System with local responders; use of personal protective equipment; response to specific events\r\n(including external events such as earthquakes); and reporting and notification procedures. Rohm and Haas personnel are trained on and familiar with these procedures in order to allow the facility to respond safely and properly to accidental chemical releases.  Numerous facility personnel have been trained\r\nas on-site incident commanders assigned the responsibility of coordinating the Plant response to any incident which may occur including communicating response needs with the local Fire Department responders. \r\nAn incident commander is on duty at the Plant 24 hours per day. The Plant Emergency Response Team annually conducts 20 hands-on drills, including quarterly testing of Plantwide emergency alarm systems, an annual\r\nPlant evacuation drill, and actual response to Plant emergency scenarios. All Plant employees are trained on the relevant aspects of the emergency response plan. Hayward Plant has participated in City of Hayward Disaster Exercises and Alameda County Pandemic Response training and Plant Leadership makes the plant and its equipment available to local emergency responders for\r\nTraining exercises. 1.9 \r\n\r\nFuture Changes to Improve Plant Safety\r\n\r\nThe Hayward Plant is continually trying to improve their environmental, health, and safety systems.  Through worker involvement and company initiative there is a constant pressure to improve our performance.  Through the use of careful safety observations of work in progress, investigations of near miss incidents and worker interviews, the site is enjoying their best safety performance ever.   The Plant and The Dow Chemical Company understand there is no success without trust and acceptance by our neighbors and community.   And we know the only way to achieve this is through incid"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041300,
      "SummaryText": "EXECUTIVE SUMMARY\r\n \r\n1.1\tIntroduction\r\n\r\nIn a series of rules promulgated between 1994 and 1998, the U.S. Environmental Protection Agency established the Risk Management Program (RMP) under Clean Air Act Section 112(r). These rules require facilities that contain threshold quantities of materials on a list of toxic and flammable chemicals to create and update a Risk Management Plan for the facility. Covered facilities must assess the risks associated with their management of the listed chemicals and produce a plan to prevent releases and accidents. In order to assist in emergency planning, covered facilities must evaluate worst case and alternative case scenarios that would result from the release of a listed chemical. Finally, the covered facility must make their risk management program available to the public.   \r\n\r\nThis report is the required update of the Hayward Rohm and Haas Facility submitted in 2009.  After the 2009 submission, the Rohm and Haas Company has merged with the Dow Chemical Company and the use of vinyly acetate at the Plant has been discontinued.  While the Rohm and Haas name is still supported within Dow as a wholly owned subsidiary of The Dow Chemical Company, the Hayward plant will be referenced to in this updated RMP plan as The Dow Chemical Company Hayward Rohm and Haas Facility.\r\n\r\nThis document comprises the RMP plan for The Dow Chemical Company Hayward Rohm and Haas Facility.  The plan contains a description of the procedures and provisions used to reduce the likelihood and severity of an RMP regulated substance release or accident. The RMP plan is based upon a complete assessment of the processes, operations, and procedures of the plant and an analysis of potential releases of RMP regulated substances that may occur at the plant and their impacts on the offsite populations.\r\n\r\n1.2\tGeneral Description of the Stationary Source\r\n\r\nThe Dow Chemical Rohm and Haas facility is located in the city of Hayward, California at 25500 Whitesell"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041300,
      "SummaryText": "Street near the intersection of State Highway 92 and Clawitter. The plant is constructed on a parcel of approximately 33 acres at the corner of Whitesell Street and Breakwater Avenue. The northern portion of the property consists of the raw material and finished product storage areas, the plant Process Building, a warehouse, plant utilities, and the plant office and laboratory. The southern portion of the property is undeveloped, with the exception of approximately 3 acres that are leased to Trimac Transportation Services. Trimac operates a dedicated truck terminal exclusively for Rohm and Haas products. Railroad spurs border the eastern and northern edges of the property and a series of treated wastewater sand filters is located at the northwest corner of the property.\r\n\r\nThe Hayward Facility is a specialty chemical manufacturing facility that produces a variety of non-hazardous water-based polymeric emulsions. This activity is described by SIC code 2821 and NAICS code 325211. Approximately sixty different products are manufactured at the plant using different mixtures of reactants. These products are used by our customers to manufacture water-based paints, floor polishes, adhesives, caulks, and other household and industrial products.\r\n\r\nPolymeric emulsions are produced in two parallel process units and all products are manufactured in batch operations.  The major raw materials used are monomers which are received by railcars, tank truck or deck tank. Each of these major raw materials is stored in a dedicated tank with a dedicated pump that is used to unload the railcar, tank truck or deck tank, and to feed the raw material to the process\r\n\r\nOnce in the Process Building, raw materials are typically pumped to either a mix tank for preliminary mixing with other raw materials and additives, or directly into an emulsion tank where they are mixed with additives.  The emulsion mixture is then sent 2to the reactor where catalyst and activators are added to initiate the p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000041300,
      "SummaryText": "ent free performance."
    }
  ]
}