{
  "FacilityID": 1000072822,
  "FacilityName": "Arkema Inc.",
  "FacilityStr1": "Route 63",
  "FacilityStr2": "3289 Genesee Street",
  "FacilityCity": "Piffard",
  "FacilityState": "NY",
  "FacilityZipCode": "14533",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36051",
  "LEPC": "Livingston County LEPC",
  "FacilityLatDecDegs": "42.831944",
  "FacilityLongDecDegs": "-077.846111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2218436,
  "ParentCompanyName": "Arkema Delaware Inc.",
  "Company2Name": null,
  "CompanyDUNS": 622121697,
  "Company2DUNS": 622121697,
  "OperatorName": "Arkema Inc.",
  "OperatorStr1": "Route 63",
  "OperatorStr2": "3289 Genesee Street",
  "OperatorCity": "Piffard",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14533",
  "OperatorZipCodeExt": null,
  "RMPContact": "Nicola Tei",
  "RMPTitle": "Plant Manager",
  "FTE": 95,
  "OtherEPAFacilityID": "14533PNNWLROUTE",
  "EPAFacilityID": "100000055931",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "824520000600191",
  "SafetyInspectionDate": "2018-08-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-11-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.83147,
  "FRS_Long": -77.8423,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000091063,
      "AltID": "Storage- NPCF",
      "FacilityID": 1000072822,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000092306,
          "ProcessID": 1000091063,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000113853,
          "ProcessID": 1000091063,
          "ChemicalID": 32,
          "Quantity": 74000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 32,
            "ChemicalName": "Propyl chloroformate  [Carbonochloridic acid, propylester]",
            "CASNumber": "109-61-5",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000613853,
          "ProcessID": 1000091063,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072822,
      "SummaryText": "Introduction\n\n\n\nThis Executive Summary describes key elements of the plant's Risk Management Plan, how the employees of our plant strive to protect and maintain the well-being of employees, neighbors, and the community.  It is a comprehensive plan, developed and continually improved over more than 60 years of operation.  This summary is organized as follows:\n\n\n\nIntroduction; \n\nArkema Inc. Policies for Health, Environment, and Safety;\n\nFacility Identification and regulated substances in covered processes;\n\nPrevention Program; \n\nFive-Year Accident History; \n\nEmergency Response Plan; and\n\nPlanned Changes to Improve Safety.\n\n\n\nArkema Inc. Policies for Health, Environment, and Safety\n\n\n\nRisk management and safety have been important concerns at Arkema for many years;  this RMP formalizes and documents these activities.  We are committed to conducting our operations in a safe, responsible manner and to reducing risks to health and the environment.  \n\n\n\nThis commitment to health, environment, and safety starts with the Chief Executive Officer (CEO).  Senior management routinely dedicate time to a review of HES matters, including safety.  This emphasis on safety is carried through to the facility level, where the Plant Manager and the Safety Committee regularly review safety performance, take corrective actions, and strive for continuous improvement.  The success of Arkema's HES programs is also reflected by a strong commitment to safety by employees and contractors. \n\n\n\nArkema Inc.'s HES programs include policies, procedures, standards, and guidance materials designed to fulfill its commitment to health, environment, and safety.  These materials include Risk Management Program guidance to help our facilities prevent and/or reduce the risk of accidents. \n\n\n\nOur plant keeps health and safety in the forefront of all our activities.  In issues related to emergency response, Arkema works with the Livingston County Local Emergency Planning Committee (LEPC) to plan responses to e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072822,
      "SummaryText": "mergencies and to assist the Plant Emergency Organization (PEO) in actual response efforts as and if needed.  These emergency plans are reviewed with the LEPC, and other local emergency responders like the fire and police departments, and hospitals.  Our plant's Community Advisory Panel (CAP) was started in early 1998 to inform the community about our plant and related activities and address questions or concerns. \n\n\n\nArkema Inc. also takes pride in our commitment to protect the environment.  We are dedicated to continuous reduction of waste, and have a comprehensive program designed to promote recycling and waste minimization. \n\n\n\nArkema is also part of Responsible Care, an industry-wide initiative among members of the American Chemistry Council. Through Responsible Care, our industry demonstrates its continuing commitment to health, safety, and the environment.\n\n\n\nFacility Identification and Regulated Substances in Covered Processes\n\n\n\nThe Arkema Inc. Geneseo facility, located on Route 63 in Piffard, New York, is proud to be a part of the Genesee Valley community.  Our company is dedicated to achieving the safe manufacture of high-quality products and the continuing protection of the environment.  The Geneseo plant produces organic peroxides that are used primarily in the production of  acrylics, elastomers, low density polyethylene (LDPE), polyesters, polystyrene, and polyvinyl chloride (PVC).  Many common plastic products such as automobile components, toys, food packaging, etc., are manufactured with the chemicals produced at the Geneseo plant. \n\n\n\nArkema uses one of the substances regulated under 40 CFR Part 68, the EPA Risk Management Program (RMP) Rule, above the minimum threshold for RMP applicability.  This listed chemical is normal-propyl chloroformate, or NPCF, and the threshold quantity is 15,000 pounds, or about 1,650 gallons.  Since our plant stores in excess of 1,650 gallons of this material, an RMP is required to be filed with the EPA.   NPCF is use"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072822,
      "SummaryText": "d as a process ingredient to make a product used in the manufacture of some of the plastics described above. \n\n\n\n                                                                                         \n\nAccidental Release Prevention Program \n\n\n\nAt Arkema we take handling of chemicals and plant safety very seriously.  We use a variety of safety equipment and written procedures to maintain the integrity of our processes, prevent releases and reduce the impact should releases occur.  In fact, this NPCF storage system is also regulated by the Federal Occupational Safety and Health Administration (OSHA)'s Process Safety Management (PSM) standard (29 CFR 1910.119) as well as EPA's RMP regulation.  \n\n\n\nSpecific Accident Prevention Measures We Take in the Case of Normal-Propyl Chloroformate (NPCF):\n\n\n\nWe DESIGN for Safety:\n\n\n\n NPCF tank is in secondary containment.  If a spill occurred, the entire contents should stay in a dike.\n\nA new tank dike partition was constructed in late 2001 to minimize potential RMP worst case scenario off-site impact.\n\n Automatic high level alarms and shutoffs are installed to prevent tank overfilling.\n\n The tank is filled to no more than 90% capacity, as additional protection against overfilling. \n\n Pressure/safety devices are installed so that the tank cannot be over/under pressurized.\n\n During tank filling, the unloading trailer is staged in a contained area large enough to hold the entire trailer contents.\n\n Sewers in the vicinity of the tank can be used if necessary to convey spillage to a pre-treatment system capable of treating NPCF.\n\n Pre-startup safety reviews are conducted prior to startup of new or modified NPCF equipment.\n\n Team of trained personnel conducts Process Hazard Analyses at least every 5 years.\n\n\n\nWe strive to OPERATE Safely:\n\n We have established written safe operating limits for the process using NPCF.\n\n Safety reviews are conducted for proposed process changes.\n\n We have detailed unloading, operating and maintenance pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000072822,
      "SummaryText": "cedures.\n\n Operators are trained and certified per OSHA requirements.\n\n Unloading procedure requires two trained operators to monitor activities.\n\n Operators continuously monitor the process.\n\n Experienced Chemical Engineers are on staff for troubleshooting if required.\n\n Written operating and emergency shutdown procedures are regularly reviewed and updated.\n\n Contractor Safety Program trains outside workers in plant safety rules/procedures.\n\n\n\nWe work to MAINTAIN Safe Operations:\n\n\n\n NPCF tank is regularly inspected as part of a plant-wide tank inspection program. \n\n A mechanical integrity program is in place for preventive/predictive maintenance.\n\n Routine visual inspection of equipment is done by supervisory personnel.\n\n Maintenance personnel are trained and highly skilled.\n\n We investigate accidents/ incidents and implement corrective actions as appropriate. \n\n Critical equipment, including tanks, relief devices, hoses, piping, instruments and shutdown system is regularly tested/ inspected to verify proper operation.\n\n Facility and Corporate safety assessments are conducted.\n\n Periodic regulatory inspections are conducted.\n\n\n\nFive Year Accident History\n\n                                                                                                                                                       \n\nThere have been no RMP off-site releases of NPCF from our plant for the past five years.   \n\n                                                                                                                                                     \n\nEmergency Response Plan\n\n\n\nA written emergency response plan is maintained at the facility.  The plan was developed in cooperation with local authorities and was coordinated with the community emergency response plan.  Site emergency response drills are conducted annually with the local fire department reps. \n\n\n\nThe emergency response plan and crisis communication plan include procedures for notifying local authorities and "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000072822,
      "SummaryText": "the public in the event of an incident.  The ERP also includes documentation of proper first-aid and medical treatment necessary to treat accidental human exposures; a description of the training program for all employees in relevant emegency response procedures;  and procedures for review and update, as appropriate, of the emergency response plan to reflect changes at the facility, and to ensure employees are informed of these changes.    Highlights of our ERP follow:\n\n\n\n Written Site Emergency Action plan utilizes Incident Command System (a recognized standard for managing emergencies).\n\n Twenty-four-hour annual training for plant's emergency response team is conducted on-site.\n\n These persons are trained at the Haz-Mat technician level.\n\n First-aid trained personnel are available on each shift. \n\n Emergency response and first aid drills are periodically conducted and critiqued.\n\n Emergency Response Trailer with Haz-Mat equipment is maintained ready on-site.\n\n\n\n\n\nRecent Changes to Improve Safety\n\n\n\nFrom the 2018 PHA renewal for processes involving the use of NPCF it was determined that failure of the NPCF tank nitrogen regulator could cause tank pressurization.  A protection layer analysis included the addition of a second pressure regulator with a pressure set point below the 12 psi relief valve setting.  The NPCF tank (T-3548)is currently undergoing exterior jacketed insulation replacement and scheduled internal inspection.   "
    }
  ]
}