{
  "FacilityID": 1000030998,
  "FacilityName": "ELBOW FARM SUPPLY, INC.",
  "FacilityStr1": "12021 AVENUE 328",
  "FacilityStr2": null,
  "FacilityCity": "VISALIA",
  "FacilityState": "CA",
  "FacilityZipCode": "93291",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "36.385107",
  "FacilityLongDecDegs": "-119.302244",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ELBOW FARM SUPPLY, INC.",
  "OperatorStr1": "12021 AVENUE 328",
  "OperatorStr2": null,
  "OperatorCity": "VISALIA",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93291",
  "OperatorZipCodeExt": null,
  "RMPContact": "KARLENE STORY",
  "RMPTitle": "MANAGER",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000081314",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-05-23 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-10-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-10-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-10-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-10-06 00:00:00",
  "DeRegistrationEffectiveDate": "2020-09-24 00:00:00",
  "AnniversaryDate": "2017-10-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.38539,
  "FRS_Long": -119.30909,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000037832,
      "AltID": "Farm Supply Wholesale",
      "FacilityID": 1000030998,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000038194,
          "ProcessID": 1000037832,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000045616,
          "ProcessID": 1000037832,
          "ChemicalID": 56,
          "Quantity": 220000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000545616,
          "ProcessID": 1000037832,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000030998,
      "SummaryText": "1    EXECUTIVE SUMMARY\n\n\n\nThis program is intended to meet the spirit and intent of the following regulations:\n\n?    California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\n\n?    Federal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\n?    California Process Safety Management (PSM) Program, Title 8 CCR ?5189\n\n?    Federal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Elbow Farm Supply has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1    ELBOW FARM SUPPLY, RISK & PROCESS SAFETY MANAGEMENT PROGRAM \n\n\n\nThis is to inform all interested persons, including employees, that Elbow Farm Supply has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following processes which have the presence of hazardous chemicals above threshold quantities: \n\n\n\nAmmonia Fertilizer - Anhydrous Ammonia - 220,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, and illnesses and avoid physical property damage.\n\n\n\nElbow Farm Supply has an exemplary safety record, one that we are quite proud of. Our company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n1.    Prepared a unified program based on the PSM plan to meet CalARP and RMP obligat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000030998,
      "SummaryText": "ions as well\n\n2.    Organized the program so that it meshes closely with general Elbow Farm Supply business practices\n\n3.    Utilized PSMWriter software to ensure that all necessary Elbow Farm Supply employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures and practices that will help our employees protect themselves and our neighbors.\n\n\n\n1.2    PROCESS DESCRIPTION\n\n\n\nElbow Farm Supply is a fertilizer storage and resale facility. The ammonia fertilizer process operates as follows. Ammonia is supplied by a vendor into the ammonia storage tank. From there it is stored until a sale is made, at which time an Elbow Farm Supply employee transfers ammonia from the storage tank into a smaller trailer-mounted nurse tank. The nurse tanks are towed by trucks offsite for the fertilizer application.\n\n\n\nThe ammonia fertilizer process at this facility consists of vessels which are co-located such that a release of ammonia could impact the ability to operate vessels that are not directly connected.  Therefore, the ammonia fertilizer process is treated as a single process.\n\n\n\n1.3    GENERAL ACCIDENT RELEASE & CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\n1.3.1    GENERAL \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nElbow Farm Supply has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia fertilizer process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in the body of the program. \n\n\n\n1.3.2    ANHYDROUS AMMONIA\n\n\n\nThe ammonia fertilizer process at the Elbow Farm Supply facility is an integral part of the overall business. It is extremely important that the vessels and equipment in "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000030998,
      "SummaryText": "this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\n\n\nOur fertilizer personnel monitor the ammonia fertilizer process and keep an active log book of all procedures and transactions that pertain to ammonia. In addition, the process is checked periodically by an outside contractor that we use. These contractors also assists in performing the annual mechanical integrity inspection of our ammonia equipment. \n\n\n\n1.4    FIVE YEAR ACCIDENT HISTORY\n\n\n\nElbow Farm Supply has had no accidental release within the last five (5) years.\n\n\n\n1.5    EMERGENCY ACTION AND RESPONSE PLAN\n\n\n\nElbow Farm Supply's emergency action and response program has been developed to satisfy the following requirements:\n\n?    California \"Emergency Action Plan\" - Title 8 CCR ?3220\n\n?    Federal \"Emergency Action Plan\" - Title 29 CFR ?1910.38 \n\n?    California \"Hazardous Waste Operations and Emergency Response\" (HAZWOPER) - Title 8 CCR Title 8 ?5192(q)\n\n?    Federal \"Hazardous Waste Operations and Emergency Response\" (HAZWOPER) - Title 29 CFR ?1910.120(q)\n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\n\n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6    PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nOur company has an outstanding safety record, one that we are quite proud of. Many policies and procedures have been implemented to promote overall plant, worker and public safety. Nevertheless, Elbow Farm Supply continually strives to improve in all areas, including safety.\n\n\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has impro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000030998,
      "SummaryText": "ved Elbow Farm Supply's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Elbow Farm Supply's management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nElbow Farm Supply has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\n\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Elbow Farm Supply has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation. A copy of Resource Compliance's service agreement has been included in this program with the support material.\n\n\n\nFor the future, Elbow Farm Supply now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for Elbow Farm Supply employees, but allows for feedback and continual improvement. Through the RMP-PSM program Elbow Farm Supply will continue to maintain overall plant worker and public safety. \n\n"
    }
  ]
}