{
  "FacilityID": 1000063818,
  "FacilityName": "ZF Transmissions",
  "FacilityStr1": "2846 N. Old Laurens Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Gray Court",
  "FacilityState": "SC",
  "FacilityZipCode": "29645",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45059",
  "LEPC": "Laurens County LEPC",
  "FacilityLatDecDegs": "34.646492",
  "FacilityLongDecDegs": "-82.158148",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 28802490,
  "ParentCompanyName": "ZF Friedrichshafen AG",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ZF Transmissions",
  "OperatorStr1": "2846 N. Old Laurens Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Gray Court",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29645",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Nelson",
  "RMPTitle": "Environmental Health & Safety Mgr.",
  "FTE": 2650,
  "OtherEPAFacilityID": "2964WZFTRN2846N",
  "EPAFacilityID": "100000235701",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-04-19 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-06-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-06-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-06-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000080054,
      "AltID": "Ammonia heat treating",
      "FacilityID": 1000063818,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000081282,
          "ProcessID": 1000080054,
          "NAICSCode": "33635",
          "_desc": {
            "NAICS_CODE": "33635",
            "NAICS_DESCRIPTION": "Motor Vehicle Transmission and Power Train Parts Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000099809,
          "ProcessID": 1000080054,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000599809,
          "ProcessID": 1000080054,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063818,
      "SummaryText": "- Facility and Covered Process Overview -\n\nZF Transmissions, which is located at 2846 North Old Laurens Road in Gray Court, South Carolina, is a commercial facility that manufactures transmissions for passenger automobiles.  The facility operates under North American Industrial Classification System Code (NAICS) of 336350.  ZF currently does and has since 2013 used the chemical anhydrous ammonia, which is used in a heat treating process known as nitro-carburizing. ZF has recently made a strategic decision to store a larger quantity of ammonia on-site.  This decision was predominantly based on the fact that, from a site (and public) safety and release prevention perspective, the most likely event in which a large quantity of ammonia has the potential to be released is during the delivery of the chemical.  In order to minimize the frequency of these deliveries, ZF has elected to begin filling its 9,200-gallon storage tank to 85% capacity (7,820 gallons), which means up to approximately 40,300 gallons of ammonia may be on-site at any given time.  Storing this amount of ammonia triggers two separate safety-focused federal program requirements: the OSHA Process Safety Management Standard (PSM, 29 CFR 1910.119), which is designed to ensure safety in the workplace, and the EPA Risk Management Plan (RMP) Rule (40 CFR 68), which is designed ensure the safety of the general public and the environment.\n\n\n\nThe OSHA PSM Standard and EPA RMP Rule apply only to the ZF process that deals directly with ammonia, which is known as the Covered Process.  ZF's Covered Process consists of a single above ground storage tank and associated equipment, the ammonia transfer lines and equipment from the tank to three (3) Ipsen heat treat furnaces, and the Ipsen furnaces and auxiliary equipment.  All of this ammonia equipment is designed to perform a single function - nitro-carburizing the surface of some internal transmission components.  The Covered Process at ZF, from the delivery of the ammo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063818,
      "SummaryText": "nia to its use in the furnaces, is further detailed below.\n\n\n\nLiquid ammonia is stored outside the building in a pressurized 9,200-gallon bulk above ground storage tank, where a vaporizer uses an electric heating element to heat the ammonia to its vaporization point, creating a gas. This increases the tank pressure. When the set point for pressure is reached, the heating element automatically switches off. This pressure build up allows the ammonia to transfer through dedicated piping to the furnaces and associated furnace equipment without the use of a any pumps.\n\n\n\nAmmonia gas flows through and pressurizes the main ammonia transfer line.  This main line is then divided into three (3) smaller supply lines - one for each Ipsen nitro-carburizing furnace.  Each furnace uses ammonia to form nitrates via two processes: breaking down the ammonia using a cracker unit and decomposing the ammonia via furnace heat and contact with the metal transmission parts. The ammonia sent to the cracking unit is heated past its dissociation point and sent through a catalyst which \"cracks\" or splits the nitrates from the ammonia.  The resulting hydrogen and nitrogen are sent to the furnace; the nitrates are absorbed by the metal parts, creates a compound layer on the surface of the parts, providing anti-scuffing and improved fatigue resistance.  The hydrogen is burned off in the furnace's afterburner system.  After the completion of the nitro-carburzing processes, the waste gases (primarily nitrogen, hydrogen, carbon monoxide, and any residual ammonia) are discharged from the furnace into an afterburner system to break them down and exhausted through a dedicated exhaust stack out of the roof of the building.\n\n\n\nAs a company, ZF takes an extremely conservative approach to workplace safety.  Each Covered Process area described above (unloading of ammonia, bulk storage of ammonia, the heat treat furnace area) is not only designed to be as inherently safe as possible, but has also been analyz"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063818,
      "SummaryText": "ed for any additional safety measures that may be taken to reduce the risk of an ammonia release and/or exposure.  This includes accidental release prevention measures, process safety systems, emergency response, and training.  All of these items are discussed in detail below.\n\n\n\n\n\n- Accidental Release Prevention -\n\nEach Covered Process area at ZF has very specific operating procedures, preventive maintenance standards, and documented inspection retention to both mitigate the potential for an accidental release of ammonia and provide emergency response to any releases of ammonia that may occur.\n\n \n\nOperating Procedures \n\nWritten operating procedures for the ZF Covered Process include a detailed unloading procedure, documented unloading checklist, as well as furnace procedures for all different operation modes (standard operation, startup, shutdown, emergency shutdown).  This also includes maintenance procedures related to the Covered process.  All appropriate ZF personnel are trained on the proper use of each procedure, which is documented and re-administered after any procedure is changed, before they are allowed to use the procedure.\n\n\n\nPreventive Maintenance and Inspections\n\nDocumented preventive maintenance and inspections for Covered Process equipment includes:\n\n-Unloading: Pre-delivery hose and trailer/tanker inspections, monthly hose inspections, bi-monthly trailer/tanker preventive maintenance checklist completion, annual hose inspection, annual trailer/tanker visual inspection and leakage test, bi-annual tanker thickness test, and a 5-year tanker hydrostatic pressure test and internal visual inspection.\n\n-Bulk storage tank and associated equipment: Weekly visual inspection, pre-delivery visual tank and external piping inspection, and 5-year inspection, ultrasonic testing, and fitness for service assessment of the equipment.  \n\n-Ammonia transfer piping and detection: 5-year inspection and ultrasonic testing for piping; each ammonia sensor (locations discusse"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000063818,
      "SummaryText": "d below) are checked on a bi-hourly basis.\n\n\n\n\n\n- Safety Systems -\n\nSafety systems employed at ZF to prevent the accidental release of ammonia and provide early detection and response to ammonia releases are described as follows:\n\n\n\nPressure Relief: The bulk ammonia tank is equipped with two (2) pressure relief valves to prevent a dangerous overpressure within the tank that could result a failure of the tank and release of ammonia.  These valves are rated by the American Society of Mechanical Engineers (ASME) specifically for use with anhydrous ammonia.  The pressure relief valves are capable and design to operate independently of one another, such that one can be replaced without losing temporary functionality of the tank and safety of the pressure relief device.\n\nEach Ipsen furnace is equipped with an overpressure valve that is designed to dissipate any overpressures that may be created in the furnace interior if it is operated incorrectly or in a fault condition.  Each overpressure valve consists a tear foil to release the excess pressure (and furnace gas), which activates at a specific pressure.  The valve is also supplemented with a cap and spring for excess pressure release.  The furnace utilizes a burner safety system that, when activated (when the valve foil tears), burns off any ammonia that may have released during the overpressure event, preventing its release into the environmental and potential exposure of ZF employees to ammonia vapors.\n\n\n\nSafety programmable logic control: A programmable logic control (PLC) is used for automation of furnace processes within the heat treat area.  A PLC is a real-time system where output results must be produced in response to input conditions within a bounded time (else unintended operation or results will occur).  The PLC is designed for multiple input and output parameters and arrangements (such as temperature, pressure, or flow arrangements for different heat treatment processes).  The PLC is designed to assist oper"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000063818,
      "SummaryText": "ators in identifying potentially dangerous conditions, providing a system of checks and notifications to prevent any situations in which ammonia may be released from the furnace system.\n\n\n\nDedicated ventilation: Each Ipsen furnace is provided its own dedicated exhaust ventilation. The dedicated ventilation system for each Ipsen furnace is integral for the operation of the Covered Process.  During normal operation, after each furnace cycle has run, the residual atmosphere of the furnace interior is exhausted through the afterburner to break down the gases and then discharged outside of the building.  In the case of an overpressure within the internal furnace atmosphere, a relief system releases the overpressure gases.  These gases are burned up using a dedicated pilot burner and exhausted outside of the building.\n\n\n\nAmmonia detection and monitoring: The most critical component of the ammonia Covered Process system design is the ammonia gas detection and monitoring system.  In order to provide consistent gas monitoring, a series of stationary gas detectors and controllers are located throughout the facility in areas where a concern of internal ammonia releases exists.  Specifically, gas detection is provided as follows: eight (8) ammonia detectors and an associated controller are located on the main north/south aisle way of the plant to monitor the most traveled aisle way for employees to access the manufacturing areas; eight (8) ammonia detectors and an associated controller are located around the perimeter of the Ipsen furnaces and heat treating area of the facility; and, three (3) ammonia detectors and an associated controller are on the mix battery of the Ipsen furnaces themselves.\n\n\n\nFire control and suppression: The fire control and extinguishing system in the ammonia bulk storage tank area is the presence of a local fire hydrant less than 100 feet away from the storage tank itself, as well as a Class ABC fire extinguisher accessible to the bulk unloading area. "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000063818,
      "SummaryText": " The local fire department available to ZF can access the fire hydrant to address any fire issues at the bulk area.\n\nThe fire sprinkler system installed throughout the manufacturing area of the plant (include the heat treatment area) is an automatic system.  It consists of a secured water supply, as well as a pump, valves, pipes, and sprinklers.  The sprinkler heads are strategically distributed at the ceilings and other places within locations that require protection.  These sprinklers contain a seal to prevent water flow until, due to a fire, a design temperature is exceeded at one or more individual sprinkler heads and the sprinkler bulb bursts/  Each sprinkler activates independently when the hear level is reached and distributes water over the fire source; the system only activates where the fire occurs.  A sensor in the system detects the flow of water and emits an alarm signal.  Additionally, there are Class ABC fire extinguishers strategically located throughout the production area, included near the Ipsen furnaces.\n\nThe activation of the fire alarm automatically notifies all ZF Gray Court EHS personnel, as well as the ZF North American headquaters (Northville, Michigan) personnel, via text message.  All three (3) security gates are also immediate notified via Simplex notification panels that are present within the Logistics Distribution Center, North, and East security guard buildings.  Any of the notified personnel (Gray Court EHS, headquarters, and security guard personnel) are permitted to notify local fire authorities for any fire emergencies.\n\n\n\nAccess control: To prevent unauthorized entry into the ZF facility itself, the entire building perimeter is provided chain-link fencing with key card access, including the bulk ammonia tank and unloading area.  Additionally, the bulk ammonia tank is provided perimeter fencing that is locked at all times when not in use, and for which keys are only available to authorized personnel.  Access control implemented o"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000063818,
      "SummaryText": "r which will be implemented in Covered Process areas include:\n\n- Key card locks are planned for installation on the bulk ammonia tank perimeter fencing doors, which will further secure the area from unauthorized personnel.  All other employees, contractors, and/or suppliers will require an escort by authorized ZF personnel.\n\n- Perimeter fencing is provided at each of the Ipsen furnaces to prevent unauthorized access to dangerous furnace components and potential exposure to ammonia.\n\n- Access to the ammonia bulk tank and associated equipment, ammonia transfer and distribution equipment, and Ipsen furnaces is limited by allowing only authorized and properly trained personnel to operate and maintain the equipment.\n\n\n\n- Emergency Response -\n\nZF has communicated the hazardous on-site chemicals and processes to the Laurens County Local Emergency Planning Committee (LEPC). Through this LEPC, the Gray Court Fire Department, Green Pond Volunteer Fire Department, and Fountain Inn Fire Department have been notified of and trained on potential spill, fire, and other emergency response needs that may exist at ZF as a result of the presence of ammonia.  These parties, including the Laurens County LEPC director, also have regular meetings with ZF to receive updates on process information, chemical storage locations, and discuss other pertinent site changes that may affect outside emergency response.\n\n\n\nIn addition to the LEPC and use of local fire and rescue departments, ZF maintains its own first responders for hazardous chemical response on all three shifts.  These responders are all HAZWOPER-certified and specially trained personnel that are familiar with ammonia exposure and response, and have access to necessary PPE  to provide response as needed.  These response personnel are trained not only in general ammonia information, response, and procedures, but also ZF-specific emergency procedures and response to other specific hazards as they apply to the facility.\n\n\n\nZF also has "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000063818,
      "SummaryText": "er permanent or temporary) will at a minimum receive awareness level training as part of employment at the ZF.  The General Awareness training includes a primary emphasis on warnings and precautions relating to anhydrous ammonia and the Covered Process, in addition to an overview of the PSM/RMP program implemented at the facility.\n\n\n\nDetailed PSM/RMP Training\n\nDetailed comprehensive PSM/RMP training is required for all ZF employees and Contractors who have responsibilities involving interaction with the covered process.  The Detailed training includes the material covered during the Awareness Level training, in addition to a more detailed review of specific elements required under the facility PSM/RMP program such as process hazard analysis, management of change, pre-startup safety review, incident investigation, mechanical integrity and audits and program evaluations.  Additional information relating to facility specific process safety information is also reviewed. \n\n\n\nTask Specific PSM/RMP Training\n\nAdditional trainings may be necessary based on job descriptions and responsibilities associated with the Covered Process.  Examples include trainings on operating procedures, inspections, safety systems, chemical handling, unloading of bulk materials, mechanical integrity, and equipment operation start-up and shut-down.  These trainings are typically provided on-the-job as part of position orientation.\n\n\n\nVisitor Training\n\nAll visitors of the plant receive general information related to the Covered Process upon entrance to the ZF facility. This information includes the Covered Process areas and information related to access requirements for these areas.  Any visitor who must enter covered process areas shall be escorted by an employee who has received Detailed PSM/RMP training unless they opt to complete pertinent sections of the Detailed training as part of the visitation. \n\n\n\nContractor Training\n\nSimilar to visitors, contractors receive general information related to"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000063818,
      "SummaryText": "a formal, written Emergency Response Procedure (Emergency Action Plan).  This plan details specific actions, notifications, activations, and responses that ZF personnel will take in the event of emergencies.  The plan also includes specific details and instructions on ammonia hazards and exposure, ammonia spill response procedures, and release mitigation measures.\n\n\n\n\n\n- Planned Changes to Improve Safety - \n\nZF constantly reviews the potential to make additional future changes to the Covered Process and facility in order to improve the safety of ZF employees, the community, and public receptors.  Currently considered potential changes and modifications include:\n\n- Addition of ammonia monitoring at the bulk tank area to immediately detect potential spills or releases; addition of ammonia monitoring on the roof at the exhaust locations of the Ipsen furnaces\n\n- Addition of high level sensor on ammonia storage tank to alert personnel of a potential over-filling condition\n\n- Addition of secondary containment around the ammonia storage tank to capture any ammonia releases from the tank\n\n- Addition of all ammonia monitoring equipment to backup power source to maintain full monitoring capability in the event of a power outage\n\n- Addition of a deluge system at the ammonia storage tank as an immediate response measure to a catastrophic release of ammonia to mitigate the vaporization of the chemical and potential exposures\n\n- Incorporation of a permanent marking system in the ammonia unloading area to prevent unauthorized personnel access and other delivery driver access to the area during an ammonia unload\n\n- Addition of in-line manual valves on ammonia distribution piping to allow for multiple locations of shutting off the ammonia supply in the event of an ammonia release\n\n\n\nThese changes will be reviewed by the ZF PSM and management teams for feasibility and need, and implemented as practical and necessary.\n\n\n\n\n\n- Training - \n\nAwareness PSM/RMP Training\n\nEach employee (eith"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000063818,
      "SummaryText": " the Covered Process as part of the contractor orientation training.  This is required for all contractors.  If a contractor is required to enter a Covered Process area or interact with the Covered Process in any way, additional Detailed Level PSM/RMP training is required prior to authorization.  The Detailed training may be tailored to the specific sections applicable to the work to be performed. \n\n\n\n\n\n- Final Word -\n\nAt ZF Transmissions, nothing is more important safety: safety of employees, safety of contractors, safety of visitors, safety of the general public, and safety of the environment.  This PSM/RMP Plan has been completed in order to protect not only the facility and workers, but everyone around the facility from potential ammonia releases and exposure.  Safety of the Covered Process and of ammonia use is ensure through a combination of coordination and correspondence with local authorities and Laurens County, release prevention measures (inspections, operating procedures, preventive maintenance on ammonia-related equipment), substantial safety systems for the Covered Process and throughout the building, ZF's use of internal first responders that are properly training and equipped to respond to ammonia-related incidents, emergency action procedures, proper training for everyone at the facility, and a commitment to continued improvement and better safety by constantly reviewing the potential to better provide all of these measures and improve the Covered Process itself.\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}