{
  "FacilityID": 1000022862,
  "FacilityName": "John Soules Foods, Inc.",
  "FacilityStr1": "10150 FM 14",
  "FacilityStr2": null,
  "FacilityCity": "Tyler",
  "FacilityState": "TX",
  "FacilityZipCode": "75706",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48423",
  "LEPC": "Smith County LEPC",
  "FacilityLatDecDegs": "32.410714",
  "FacilityLongDecDegs": "-095.277289",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 43295765,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "John Soules Foods, Inc.",
  "OperatorStr1": "10150 FM 14",
  "OperatorStr2": null,
  "OperatorCity": "Tyler",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75706",
  "OperatorZipCodeExt": null,
  "RMPContact": "Don Westman",
  "RMPTitle": "Safety Manager",
  "FTE": 423,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000111327",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-05-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-06-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-06-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-06-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.42746,
  "FRS_Long": -95.28053,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000027870,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000022862,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000028172,
          "ProcessID": 1000027870,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000033234,
          "ProcessID": 1000027870,
          "ChemicalID": 56,
          "Quantity": 63000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000533234,
          "ProcessID": 1000027870,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000022862,
      "SummaryText": "1.  Accidental release prevention and emergency response policies\n\nJohn Soules Foods, Inc. is committed to both the safety of our employees and that of the surrounding public, including both human health and the environment.  Safety is ensured through careful prevention measures and emergency planning.  The intent of the Prevention Program is to minimize all risks that could possibly lead to an accidental release.  This program focuses primarily on the mechanical integrity of the process equipment and the training of its operators.  The Emergency Response Plan focuses on minimizing the potential impacts of an accidental release.  This is accomplished by coordinating emergency actions with the Red Springs Fire Department and ensuring that employees are trained on the proper response to an emergency situation.\n\n2.  The stationary source and regulated substances handled\n\nJohn Soules Foods, Inc. operates a meat processing facility.  The regulated substance at this plant is anhydrous ammonia.  Anhydrous ammonia is used as a refrigerant in the plant cooler and freezer systems.  A total of two refrigerant systems are operated at the facility with a combined maximum quantity of 63,000 pounds stored at the facility.\n\n3.  The worst-case release scenario and the alternative release scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nWorst-case Scenario: The event that was modeled was the complete evacuation of the Pump Recirculator (system no. 1), which can hold 29,000 pounds of ammonia and represents the largest vessel present for both systems.  It is assumed that the entire contents are released as vapor over a 10 minute time span and are subjected to a wind speed of 1.5 m/s with a stability class of F.  The distance to the toxic endpoint for the worst-case scenario is 3.1 miles with 7,057 people located within the affected radius (based on US Census 2000 data).\n\nAlternative Release Scenario: The lifting of "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000022862,
      "SummaryText": "a pressure relief valve on the high pressure receiver in the engine room.  Relief valves allow the escape of ammonia at a flow rate of 100.2 lbs/min.  Weather conditions are assumed to be average values of 3 m/s wind speed and stability class D.  The valves are assumed to be open 75% of the time during the release as the pressure builds and is relieved.  The distance to the toxic endpoint is 1,050 feet and extends beyond the facility boundary.  Based on the US Census 2000 data, approximately 14 people live within the toxic endpoint radius.\n\n4.  The general accidental release prevention program and the specific prevention steps\n\nJohn Soules Foods, Inc. believes that the best way to prevent an accidental release is by being proactive in its approach to safety.  This facility maintains information about the proper use of its equipment and the possible hazards.  By following set operating procedures and maintenance routines, the process equipment within the facility will be operated at optimum conditions.  Additionally, the release prevention program is constantly being improved by sustained employee training and regular compliance audits.  Compliance with all applicable state codes and regulations ensures the continued safe operations of the John Soules Foods, Inc. facility.\n\n5.  Five year accident history\n\nIn the last five years, the John Soules Foods, Inc. facility has not experienced a significant accidental ammonia release.\n\n6.  The emergency response program\n\nA well planned emergency response program can make a tremendous difference in the potential off-site impacts of an accidental release.  Swift, efficient actions can minimize the damage to both human population and the natural surroundings.  To this end, John Soules Foods, Inc. has coordinated emergency response efforts with the Red Springs Fire Department and has instructed employees on the proper actions to take in the event of an accidental release.  John Soules Foods, Inc. maintain a well-trained emergency"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000022862,
      "SummaryText": " response team and has a written emergency response plan, which specifies the details of the actions that will be taken in the event of an accidental release.\n\n7.  Planned changes to improve safety\n\nThere are no planned changes to improve safety at this time."
    }
  ]
}