{
  "FacilityID": 1000037080,
  "FacilityName": "Hopewell Water Treatment Plant",
  "FacilityStr1": "900 Industrial Street",
  "FacilityStr2": null,
  "FacilityCity": "Hopewell",
  "FacilityState": "VA",
  "FacilityZipCode": "23860",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51149",
  "LEPC": "Hopewell LEPC",
  "FacilityLatDecDegs": "37.300611",
  "FacilityLongDecDegs": "-077.278417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.vawc.com",
  "FacilityEmailAddress": "kevin.shelton@amwater.com",
  "FacilityDUNS": 42196196,
  "ParentCompanyName": "Virginia-American Water Company",
  "Company2Name": "American Water Works Company",
  "CompanyDUNS": 29984077,
  "Company2DUNS": 0,
  "OperatorName": "Virginia-American Water Company",
  "OperatorStr1": "900 Industrial Street",
  "OperatorStr2": "P.O. Box 60",
  "OperatorCity": "Hopewell",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23860",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kevin Shelton",
  "RMPTitle": "Manager Operational Risk Management",
  "FTE": 32,
  "OtherEPAFacilityID": "VA3670800",
  "EPAFacilityID": "100000067526",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-02-12 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-10-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-10-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-10-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-11-05 00:00:00",
  "DeRegistrationEffectiveDate": "2021-09-01 00:00:00",
  "AnniversaryDate": "2018-10-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.30061,
  "FRS_Long": -77.27842,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000045378,
      "AltID": "Chlorination",
      "FacilityID": 1000037080,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000045820,
          "ProcessID": 1000045378,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054868,
          "ProcessID": 1000045378,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000554868,
          "ProcessID": 1000045378,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000037080,
      "SummaryText": "Virginia American Water Hopewell Plant is a water treatment plant that provides potable domestic drinking water and potable water for industrial use to customers in the area of Hopewell, Virginia. To ensure that our water remains safe throughout the distribution system to every tap, the plant adds a small amount of chlorine as a disinfection agent.\n\n\n\nThe concentrated form of chlorine is liquefied and stored in shipping containers. Before it is mixed with water, chlorine can be extremely hazardous if released to the air.  \n\n\n\nVirginia American Water is committed to protecting its employees, the public, and the environment from any releases of hazardous materials used at its facilities.  We have implemented safety, environmental protection, and risk management programs to prevent hazardous materials releases.  If there is an accidental release, we will immediately call for emergency response to minimize the effect of the release and notify the public of any actions necessary to ensure public protection, through emergency management agencies.\n\n\n\nWorst-Case Release Scenario\n\n\n\nVirginia American Water has completed an offsite consequence analysis including a worst-case release scenario.  As required by the EPA RMP regulations, the worst-case scenario is defined as the release of the entire contents of the largest vessel or container as a gas in ten-minutes.  The regulations require assuming worst-case wind speed and atmospheric conditions that result in the greatest projected impact distance. \n\n\n\n For the urban/industrial setting of Hopewell City and surrounding counties, the potential distance to the endpoint concentration for the worst-case release extends offsite into residential, commercial and industrial areas. RMP*COMP offsite consequence analysis software developed by the EPA was used to estimate the offsite impacts.\n\n\n\nA major release of the magnitude represented by this worst-case scenario is extremely unlikely because of the robust design of chlorine transport"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000037080,
      "SummaryText": " containers (they are designed to withstand transportation mishaps) and the rigorous maintenance and prevention programs in place at chlorine suppliers and the Hopewell Water Treatment Plant.  In fact, release reporting databases and water industry experience suggest that the worst-case release scenario as defined in the RMP regulations is so unlikely that it should not be used as the basis for emergency planning.  A more reasonable potential release scenario for emergency planning is presented in \"The alternative release scenario(s)\" section below.\n\n\n\nAlternative Release Scenario\n\n\n\nA \"credible worst-case\" scenario was selected as the alternative release scenario. This scenario assumes that the unloading flexible connection to a transport container leaks at a rate just below the rate that will cause the excess flow valve to automatically stop the flow of chlorine. \n\n\n\nThe results of the process hazard analysis (PHA) and the facility's operating history suggest that even this credible worst-case is extremely unlikely to occur, but it can serve as the basis for emergency planning.  \n\n\n\nThe potential distance to the endpoint concentration for this alternate release scenario extends offsite into residential, commercial and industrial areas in the vicinity of the plant. As with the worst-case scenario, actual distances and directions vary with terrain and weather conditions.\n\n\n\n Virginia American Water is committed to personnel safety, public safety, continued reliable operation and regulatory compliance.  Based on this commitment, the Operations Manager has assumed overall responsibility for the development and implementation of the Risk Management Program.  Other key plant supervisory staff also have clearly defined accountability and responsibility for each of the prevention program elements to meet both EPA and OSHA Process Safety Management requirements.\n\n\n\n We will also be assessing further safety enhancements to the facility on an ongoing basis over the next few "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000037080,
      "SummaryText": "years."
    }
  ]
}