{
  "FacilityID": 1000036577,
  "FacilityName": "Specialty Steel Treating, Inc.",
  "FacilityStr1": "34501 Commerce Road",
  "FacilityStr2": null,
  "FacilityCity": "Fraser",
  "FacilityState": "MI",
  "FacilityZipCode": "48026",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26099",
  "LEPC": "Macomb County LEPC",
  "FacilityLatDecDegs": "42.550556",
  "FacilityLongDecDegs": "-082.942222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.specialsteeltreating.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 50624956,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Specialty Steel Treating, Inc.",
  "OperatorStr1": "34501 Commerce Road",
  "OperatorStr2": null,
  "OperatorCity": "Fraser",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48026",
  "OperatorZipCodeExt": null,
  "FTE": 45,
  "OtherEPAFacilityID": "MID000001237",
  "EPAFacilityID": "100000184418",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-08-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-09-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-09-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-09-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-09-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.55069,
  "FRS_Long": -82.94268,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044825,
      "AltID": "Metal Heat Treating",
      "FacilityID": 1000036577,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054189,
          "ProcessID": 1000044825,
          "ChemicalID": 56,
          "Quantity": 39600.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000045227,
          "ProcessID": 1000044825,
          "NAICSCode": "332811",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000038997,
              "Process_NAICS_ID": 1000045227,
              "SafetyReviewDate": "2012-08-08 00:00:00",
              "PHA_Date": "2012-08-08 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-12-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Remote Shutoff",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-08-08 00:00:00",
              "TrainingReviewDate": "2013-08-08 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-08-08 00:00:00",
              "EquipmentInspectionDate": "2013-08-08 00:00:00",
              "EquipmentTested": "storage tank, piping and valves",
              "ChangeMgmtDate": "2013-08-08 00:00:00",
              "ChangeMgmtReviewDate": "2013-08-08 00:00:00",
              "PreStartupReviewDate": "2013-08-08 00:00:00",
              "ComplianceAuditDate": "2013-08-08 00:00:00",
              "AuditCompletionDate": "2013-12-01 00:00:00",
              "IncidentInvestigationDate": "2006-05-29 00:00:00",
              "InvestigationChangeDate": "2008-08-08 00:00:00",
              "ParticipationPlansReviewDate": "2013-08-08 00:00:00",
              "HotWorkPermitReviewDate": "2013-08-08 00:00:00",
              "ContractorSafetyReviewDate": "2013-08-08 00:00:00",
              "ContractorSafetyEvalDate": "2013-08-08 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia Storage",
              "_chemicals": [
                {
                  "PrimaryKey": 1000046361,
                  "PreventionProgram3ID": 1000038997,
                  "ProcessChemicalID": 1000054189
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000036577,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2013-08-08 00:00:00",
    "ERTrainingDate": "2013-08-08 00:00:00",
    "CoordinatingAgencyName": "Fraser Fire Department",
    "CoordinatingAgencyPhone": "8102932000",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036577,
      "SummaryText": "EMERGENCY RESPONSE AND HEALTH AND SAFETY POLICES\n\n \n\nIt is the policy of Specialty Steel Treating, Inc. to strive for the safest possible workplace.  Our company's Health and Safety Program describes procedures designed to help protect the well-being of our employees and company resources from harm or financial loss caused by accidents.  Safety is as critical to Specialty Steel Treating's operations as planning, scheduling, or billing; it is an integral part of our routine operations.  Specialty Steel takes safety very seriously which is evidenced through the programs Specialty Steel has developed for emergency response and on-the-job safety.  Senior management has the responsibility for developing, implementing, and monitoring company safety programs.  A comprehensive Process Safety Management Program (PSM) has also been developed for Specialty Steel's ammonia distribution system.  Employees at Specialty Steel Treating are provided with proper training on chemical safety and how to use the necessary personal protective equipment when working with or around hazardous chemicals.\n\n\n\nFACILITY DESCRIPTION AND OPERATIONS\n\n\n\nSpecialty Steel Treating, Inc. (SST) owns and operates a commercial heat treating facility in Fraser, Michigan.  The plant is located northeast of Fraser on Commerce Avenue.  The plant site is approximately two (2) blocks east of Garfield Road, two (2) miles west of Gratiot Avenue, and two (2) miles south of the Clinton River.\n\n\n\nSpecialty Steel Treating offers services in both high production and specialized heat treating.  The plant is equipped with approximately 34 furnaces to provide general heat treating services such as annealing, carburizing, and stress relieving.\n\n\n\nAnhydrous Ammonia is stored on site in a 8,000 gallon station, above ground tank.  A Risk Management Program has been prepared and implemented for this tank and the connected distribution system.  The tank is bordered on the south side by the building wall; the remaining sides of t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036577,
      "SummaryText": "he tank are protected by a six (6) foot high chain link fence with a locking gate.  Vaporized ammonia from the tank is utilized as a constituent for various furnace atmospheres.  Ammonia vapor is piped to ammonia dissociators where it is dissociated into it component parts-nitrogen and hydrogen.  The dissociated ammonia then flows to various furnaces to be utilized as a furnace atmosphere.  Pressure control valves and/or pressure regulators control the ammonia flow to the furnaces.  Ammonia vapor also flows directly to various furnaces where it ties into a manifold to be mixed with other gases such as nitrogen or endothermic gas.  The combination of the gases creates the required atmosphere for the specific heat treating process being performed in these furnaces.  Ammonia vapor is only utilized in certain heat treating processes such as carbonitriding and gas nitriding so ammonia flow to these furnaces is on an intermittent basis.  The ammonia vapor pressure to the furnace is reduced by pressure control valves and flow is automatically or manually controlled.  Automatic control is achieved by energize-to-open solenoid valves as part of the furnace process program.  Energize to open solenoid valves are utilized to ensure safe operation in case of a loss of electrical power.  Manual control of the ammonia flow is initiated by the furnace operator with manual isolation valves.  The point where the ammonia vapor enters the furnace manifold is the designated PSM process boundary since ammonia is mixed with other gases and then dissociated inside the furnace.\n\n\n\nWORST CASE AND ALTERNATIVE RELEASE SCENARIOS\n\n\n\nSpecialty Steel Treating utilized EPA's RMP Comp software to conduct dispersion modeling for both the Worst Case Release Scenario and the Alternative Case Release Scenario.  The assumptions used in the Worst Case Scenario are very conservative, while the Alternative Release Scenario provides a more reasonable release event.  Specialty Steel Treating has employees on-"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036577,
      "SummaryText": "site 24 hours a day 7 days a week, therefore any release of ammonia would be detected almost immediately.  The ammonia tank is routinely checked for leaks and structural integrity and is located in a secure protected area; therefore, an ammonia release equaling the total tank contents (worst case release scenario) is highly improbable.  The alternative release scenario evaluates a release from the fill line during tank refilling.  During the tank filling process there is always an attendant on duty to ensure the fill proceeds properly.  If a leak or rupture in the fill line were to occur the problem would be detected and controlled almost immediately allowing for a very minimal amount of ammonia release.  To be conservative however, a 5-minute release duration was used.  SST Fraser utilizes administrative controls to restrict the maximum amount of ammonia stored in the ammonia tank to 7200 gals.  The actual capacity of the tank is 8000 gallons.  SST Fraser also utilizes a remote shut-off valve that would be closed to limit duration and volume of an ammonia leak.  Relief valves and excess flow valves have been installed to prevent the tank and piping from rupturing.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\n\nSpecialty Steel Treating complies with OSHA's Process Safety Management Regulation (PSM).  As part of this program, operator training is provided on a routine basis and quarterly inspections of the ammonia distribution system are conducted.  The storage tank, valves, and pipes are checked for leaks or potential problem areas.  Employees at SST are trained to use a checklist to verify the ammonia distribution system is in good condition and working properly.\n\n\n\nSpecialty Steel Treating also has additional emergency response plans and procedures in place.  Emergency planning and response are addressed in the company Contingency Plan and SPCC Plan including implementation of response procedures, containment and control provisions, emergency equipment, casualty cont"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036577,
      "SummaryText": "rol, evacuation plan, public notification, post-emergency procedures and arrangements with local authorities.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nAn accidental release of anhydrous ammonia occurred at the Fraser, MI plant on 5/29/06.  The volume of gas released was less than the reportable quantity and no injuries or environmental damage occurred as a result of the release.  The EPA Chemical Emergency Preparedness and Prevention Section were notified about the release.  The release was due to an equipment malfunction which has been corrected to prevent a repeat occurrence.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nSpecialty Steel Treating has a written contingency/emergency response plan that addresses: general facility description, implementation of response procedures, containment and control provisions, emergency equipment, casualty control, evacuation plan, post-emergency procedures, arrangements with local authorities, incident reporting, public notification, and amendments to the Contingency Plan.  Implementation of response procedures include internal notification procedures, emergency contact (i.e. fire dept., police dept., EPA agencies, local emergency planning committee, etc.), personnel responsibilities and identification of waste material and hazard assessment.  Containment and control provisions discuss in further detail personnel response activities.  The Emergency Response Coordinator, Communications Coordinator, and Personnel Coordinator are identified and their responsibilities in the event an emergency situation occurs are described.\n\n\n\nSpecialty Steel maintains the names and phone numbers of the appropriate emergency response organizations to notify in the event an emergency situation occurs.  This allows Specialty Steel to immediately respond to an emergency situation and warn the public located in any areas that could be potentially affected.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nSpecialty Steel is preparing an improved safety audit procedure for their fa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036577,
      "SummaryText": "cility.  The new procedure will utilize an expanded safety checklist.  The company is also evaluating the installation of water spray nozzles above the tank and remote controlled, flow shut-off valves."
    }
  ]
}