{
  "FacilityID": 1000058086,
  "FacilityName": "Ajinomoto Toyo Frozen Noodles Inc.",
  "FacilityStr1": "6500 N. Marine Drive",
  "FacilityStr2": null,
  "FacilityCity": "Portland",
  "FacilityState": "OR",
  "FacilityZipCode": "97203",
  "Facility4DigitZipExt": "6484",
  "FacilityCountyFIPS": "41051",
  "LEPC": "Multnomah County LEP",
  "FacilityLatDecDegs": "45.628670",
  "FacilityLongDecDegs": "-122.743534",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.ajifrozenusa.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tomo Shiojima",
  "OperatorStr1": "6500 N. Marine Drive",
  "OperatorStr2": null,
  "OperatorCity": "Portland",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97203",
  "OperatorZipCodeExt": "6484",
  "RMPContact": "Andrew Saunders",
  "RMPTitle": "Director of Operations",
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000113334",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "20090513 (Portland, OR)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-06-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 45.62255,
  "FRS_Long": -122.73091,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000072601,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000058086,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000073784,
          "ProcessID": 1000072601,
          "NAICSCode": "311412",
          "_desc": {
            "NAICS_CODE": "311412",
            "NAICS_DESCRIPTION": "Frozen Specialty Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000089554,
          "ProcessID": 1000072601,
          "ChemicalID": 56,
          "Quantity": 13500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000589554,
          "ProcessID": 1000072601,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000058086,
      "SummaryText": "2.1    Accidental Release Prevention and Emergency Response Policies\n\n\n\nSafety at ATFN is inherent in the manner in which anhydrous ammonia is handled. While the design of the facility incorporates multiple safety devices, safe handling procedures, maintaining mechanical integrity, and appropriate training of our personnel are key aspects to safety at our facility.\n\n\n\nATFN has implemented a process safety management (PSM) program that complies with the regulations stipulated by Oregon Administrative Rules (OAR) ?1910.119. A crucial component of this plan is the emergency action plan, developed in compliance with the emergency planning provisions of OAR Chapter 437 Division 002. The emergency action plan includes pre-emergency planning and coordination with outside parties to enable coordinated action to effectively deal with unplanned events.\n\n\n\n2.2    Facility Description and Substances Handled\n\n\n\nATFN is a frozen food manufacturing facility that processes, stores, and distributes frozen ready-to-eat foods. Production requires the use of a refrigeration system to preserve the integrity of processed foods, and ATFN uses ammonia as the refrigerant. Access to the facility is limited to authorized employees, management personnel, and contractors.\n\n\n\n2.3    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nATFN's written PSM plan incorporates many policies and procedures to ensure safe operation and maintenance of the refrigeration equipment. Plan elements essential to safe operation of the refrigeration system include employee participation, process safety information, process hazard analysis (PHA), operating procedures, training, contractor safety, pre-startup safety review, mechanical integrity, management of change, hot-work permits, incident investigation, emergency response and planning, and compliance audits. This plan will be reviewed annually, audited every three years, and updated as necessary by ATFN.\n\n\n\nTraining is provided to en"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000058086,
      "SummaryText": "sure that each employee involved in operating the refrigeration system understands the refrigeration process, the operating procedures, and safety considerations. Only qualified maintenance personnel operate the refrigeration system.\n\n\n\n2.4    Five-Year Accident History\n\n\n\nThere have been no reportable accidents at the ATFN facility in the past five years. \n\n\n\n2.5    Emergency Planning and Response\n\n\n\nATFN has a written emergency action plan to ensure that precautions and procedures are in place to protect employee and public health and safety during a chemical emergency. It complies with the provisions of Oregon Occupational Safety and Health Administration (OR-OSHA) emergency planning requirements in OAR Chapter 437 Division 002. The emergency action plan includes pre-emergency planning and coordinating with outside parties. This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events. This plan has been provided to and reviewed with Portland Fire and Rescue.\n\n\n\nThe approach in the development of this plan has been to identify the ammonia emergencies most likely to occur at ATFN and to establish precautions and procedures to protect life, safety, and health during an emergency. The refrigeration process has backup prevention systems to keep processing malfunctions from becoming ammonia release emergencies. If an emergency does occur, ATFN has trained personnel to immediately notify Portland Fire and Rescue and take defensive actions to mitigate the release. Automatic alarms, shutdown systems, and controls have been designed to minimize the potential for an uncontrolled release.\n\n\n\nAll ATFN Frozen Foods personnel are trained to fulfill their designated responsibilities in an emergency. Mock emergency drills are held periodically to maintain familiarity with response actions and identify plan elements requiring improvement.\n\n\n\nThis plan shall be reviewed annually and updated as necessary.\n\n\n\n2.6    Planned Changes to Impro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000058086,
      "SummaryText": "ve Safety\n\n\n\nAny upgrades or extensive maintenance work performed in the future will be in compliance with codes and standards applicable at that time.\n\n\n\nATFN completed a PHA in March, 2016. Higher priority items are scheduled for completion in the summer of 2016, including providing additional protection for some ammonia evaporators and adding a check valve to the ammonia charging valve. Lower priority items are scheduled for completion in 2017, including improvements to the standard operating procedures and estimating the necessary time and budget to implement maintenance tasks. ATFN will track assigned target dates and the completion status of all PHA recommendations to ensure items are addressed promptly.\n\n"
    }
  ]
}