{
  "FacilityID": 1000082086,
  "FacilityName": "Akzo Nobel Coatings Inc.",
  "FacilityStr1": "300 Sprowl Road",
  "FacilityStr2": null,
  "FacilityCity": "Huron",
  "FacilityState": "OH",
  "FacilityZipCode": "44839",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39043",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "41.372222",
  "FacilityLongDecDegs": "-082.541667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Akzo Nobel NV",
  "Company2Name": null,
  "CompanyDUNS": 151334422,
  "Company2DUNS": 0,
  "OperatorName": "Akzo Nobel",
  "OperatorStr1": "300 Sprowl Road",
  "OperatorStr2": null,
  "OperatorCity": "Huron",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44839",
  "OperatorZipCodeExt": null,
  "RMPContact": "Nate Norris",
  "RMPTitle": "Site Manager",
  "FTE": 41,
  "OtherEPAFacilityID": "44839THGLD300SP",
  "EPAFacilityID": "100000052088",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-08-09 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-08-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-08-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-08-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.37286,
  "FRS_Long": -82.54288,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000102495,
      "AltID": "Latex Manufacturing",
      "FacilityID": 1000082086,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000103768,
          "ProcessID": 1000102495,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000128437,
          "ProcessID": 1000102495,
          "ChemicalID": 29,
          "Quantity": 460000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000628437,
          "ProcessID": 1000102495,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082086,
      "SummaryText": "EXECUTIVE SUMMARY\n\nA. Statement of Purpose\n\n\n\nThe purpose of this Plan is to identify those incidents, such as fire, explosion, spills or air pollution releases that would affect the surrounding community and guide the response to any such occurrence.  Site personnel are trained properly to deal with specific emergency response situations.  This Plan is written in compliance with the Risk Management Programs under Clean Air Action Section 112(e)(7).  This location is covered by this regulation because Vinyl Acetate Monomer (VAM) is stored and processed at this site.\n\n\n\nThis Plan is designed for the employees of Akzo Nobel Coatings Inc., Emergency Responders and the general public, and contains details of specific response actions and reporting procedures to be followed in the event of an emergency.  This Plan is supported by various procedures contained in the SPCC Plan, Health and Safety Operating Procedures and Work Instructions, Emergency Response Manual, Emergency Response Pre-Plan Manuals, Emergency Action Plan, the Site Process Safety Management Program and various other plant operations manuals.\n\n\n\nB. Description of Stationary Source and Regulated Substance\n\n\n\nVAM is delivered to the site in railcars which may be up to 25,000 gallons in capacity.  It is stored in two 15,000 gallon storage tanks prior to being pumped to the plant for processing.  VAM is pumped from the storage tanks into a weigh tank or reactor vessel inside the plant.  The reaction converts all the monomer into a non-hazardous polymer (latex).\n\n\n\nC. Worst Case Scenarios\n\n\n\nOnsite locations processes involving VAM include:\n\n\n\n1. An outside rail siding for 25,000-gallon tank car shipments, approximately 600 feet from the nearest offsite building, and 300 feet from the nearest (west) fence line.\n\n\n\n2. Two outside 15,000-gallon storage tanks in a diked area just north of the rail siding, approximately 330 feet from the nearest (west) fence line.\n\n\n\n3.  6,000-gallon reactor inside the process buil"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082086,
      "SummaryText": "ding.\n\n\n\n4.  2,000-gallon weigh tank inside the process building.\n\n\n\n5.  20-foot high, 4-inch transfer pipeline, almost 400 feet from the nearest offsite building, and 300 feet from the nearest fence line.\n\n\n\nA worse case release is defined as instantaneous loss of the largest full vessel in each affected process on site.  Review of the Site, it is clear that the RMP Worst Case Scenario is the loss of a full railcar, which would instantaneously release 25,000 gallons (190,000 pounds) of VAM.  A railcar is the largest single vessel and the cars are typically spotted as close to the nearest fence line as any other vessel.  \n\n\n\nD. Accident Release Prevention Program\n\n\n\nThe facility achieves compliance with the accidental release prevention requirement through our OSHA PSM process.  Critical components of the process are as follows:\n\n \n\n\n\nPART 1910.119(c) -- EMPLOYEE PARTICIPATION\n\n\n\nThe facility has had a Process Safety Management Employee Participation Policy in place since April 1993.  The policy discusses employee participation in such areas as:  hazard analysis, operating procedures, training, mechanical integrity, management of change, incident/accident investigation, emergency planning and response, and safety and health committees.\n\n\n\nPART 1910.119(d) A? PROCESS SAFETY INFORMATION\n\n\n\nProcess Safety Information pertaining to chemical, health and physical hazards of highly hazardous chemicals is met through the use of SDS's.  Information pertaining to the technology of the process can be found in the reactor procedures and batch slips for the Plant.  Additionally, to meet this requirement the facility conducts Hazard and Operability Studies (HAZOPS) to determine the consequence of deviations, including safety and health concerns and systems in-place to prevent deviations.  Information pertaining to the equipment in the process is maintained by the Plant Engineer.  P&IDs exist for all regulated processes in the plant.  Additionally, there are individual dossiers on"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082086,
      "SummaryText": " all pieces of critical equipment which include information on:  materials of construction, electrical classification, relief systems, ventilation, design codes and standards, and safety systems.  Maintenance of critical pieces of equipment is monitored through the MP2 System.\n\n\n\nPART 1910.119(e) A? PROCESS HAZARD ANALYSIS\n\n\n\nThe facility conducted an initial process hazard analysis of the Plant in 1993, the latest revalidations in 2016.  The facility uses HAZOP methodologies in conducting the hazard analysis.  This hazard analysis is conducted by a team of employees with expertise in engineering and process operations and the team leader has had formal hazard analysis training.  As a result of the study, a list of recommendations is developed.  The recommendations are sent to the Site Manager and are followed up on by the HSES Manager.  Documentation of the hazard analysis and recommendations are kept on file in the HSES Department.\n\n\n\nPART 1910.119(f) A? OPERATING PROCEDURES\n\n\n\nThe Plant has a complete set of operating procedures for processes regulated under the standard.  The operating procedures contain sections on steps for each operating phase, operating limits, safety and health considerations, and safety systems.  In the Plant these procedures are kept electronically. In addition to the operating procedures the facility maintains a set of Safety and Health Procedures and Work Instructions that address such issues as: Lockout/Tagout, Confined Space Entry, Safe Work, Hot Work, Line Breaking, Security, Contractor Safety, Emergency Action Plan, etc. Operating Procedures are reviewed on a 3 year cycle.\n\n\n\nPART 1910.119(g) A? TRAINING\n\n\n\nAll employees who work in areas covered by the standard have been provided with initial and refresher training.  This training is done under an Operator Certification Program which was set up to comply with the Process Safety Management Regulations.  Documentation of the training is kept on file by the Production Manager.  Employ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000082086,
      "SummaryText": "ees are trained at least every 3 years on work specific procedures.\n\n\n\nPART 1910.119(h) A? CONTRACTORS\n\n\n\nThe facility has a Contractor Safety Procedure in place.  This procedure addresses safety requirements for Contractors working on Site and includes a pre-qualification safety requirement and periodic auditing.  In addition, the facility keeps records on contractor hours worked as well as any incidents and injuries. All contracted work falls under the permit to work procedures with permits issued by trained Akzo Nobel managers, engineers and supervisors. \n\n\n\nPART 1910.119(i) A? PRE-STARTUP SAFETY REVIEW\n\n\n\nThe Plant performs Pre-Startup Safety Reviews on all new processes and modified processes.  Modifications to existing operations are covered under the Management of Change process. The facility has a Management of Change procedure (ENG-001) in place and in use.\n\n\n\nPART 1910.119(j) A? MECHANICAL INTEGRITY\n\n\n\nThe facility conducts an inspection and preventive maintenance program of all critical equipment.  The MP2 System is used to track equipment and what work has been done to date.  Procedures for maintaining critical equipment can be found in the Paints Engineering Practices (PEPs) and General Engineering Practices (GEPs) which are located in the Site Engineers office.  Training for Maintenance employees is provided on the job under the guidance of an experienced employee with specialized third party training given as needed.\n\n\n\nPART 1910.199(k) A? HOT WORK PERMIT\n\n\n\nThe facility has a Hot Work procedure (HSES-010) in place.  Forms, monitoring equipment and training has been provided to Shift Supervisors, Managers and Engineers, who have responsibility for issuing the permits.\n\n\n\nPART 1910.119(l) A? MANAGEMENT OF CHANGE\n\n\n\nThe facility has a Management of Change procedure (ENG-001) in place and in use.\n\n\n\nPART 1910.119(m) A? INCIDENT INVESTIGATION\n\n\n\nIncident investigation and reporting is covered in procedure (HSES-036).  The facility investigates all acciden"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000082086,
      "SummaryText": "ts, not just those in covered processes.  Recommendations from the investigation are forwarded to the appropriate parties for implementation.\n\n\n\nPART 1910.119(n) A? EMERGENCY PLANNING AND RESPONSE\n\n\n\nThe facility has an Emergency Response Manual in place. The manual is available electronically with copies available in the Site Manager's office and Control Room. Several plant employees are trained to respond to hazardous material emergencies and provide support activities to the public Fire Department.\n\n\n\nPART 1910.119(o) A? COMPLIANCE AUDITS \n\n\n\nThe facility conducts compliance audits of the Process Safety management program every 3 years. The most recent audit was conducted in 09/2017.  Action plans were developed to address any deficiencies noted during the audit. The public Fire Department (Huron Fire Department) conducts annual inspections with the most recent inspection completed 08/2019.\n\n\n\nPART 1910.119(p) A? TRADE SECRETS\n\n\n\nNot applicable.\n\n\n\nE. Organizational Responsibilities\n\n\n\nThe Plant trains employees to support the public Fire Department.\n\n\n\nEmployees respond are under the direction and training of the HSES Manager. The Site Manager, Production Manager, HSES Manager and shift leads will serve as on-scene coordinators.\n\n\n\nDrills with the Huron Fire Department and/or the Erie County Emergency Management Agency are conducted periodically.\n\n\n\nEmployees are trained in fighting incipient fires, non-entry confined space rescue, securing leaks and spills, providing support activities to the public Fire Department and other outside agencies and providing tactical guidance to the public Fire Department.\n\n\n\nAll fire and sprinkler (water flow), temperature, security and high level alarms on the Hazardous Waste tanks are monitored continuously by a third party Security Company.  The Sheriff and Fire Departments are notified by the security company in case of alarm.\n\n\n\n\n\n"
    }
  ]
}