{
  "FacilityID": 1000115406,
  "FacilityName": "Sioux Falls Water Purification Plant",
  "FacilityStr1": "2100 North Minnesota Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sioux Falls",
  "FacilityState": "SD",
  "FacilityZipCode": "57104",
  "Facility4DigitZipExt": "0111",
  "FacilityCountyFIPS": "46099",
  "LEPC": "SF Emergency Management",
  "FacilityLatDecDegs": "43.571111",
  "FacilityLongDecDegs": "-096.729167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.siouxfalls.gov",
  "FacilityEmailAddress": "matt.james@siouxfalls.gov",
  "FacilityDUNS": 78034683,
  "ParentCompanyName": "City of Sioux Falls Public Works",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Sioux Falls Public Works",
  "OperatorStr1": "2100 North Minnesota Avenue",
  "OperatorStr2": "PO Box 7402",
  "OperatorCity": "Sioux Falls",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57117",
  "OperatorZipCodeExt": "7402",
  "FTE": 32,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000050534",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-01-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.5715,
  "FRS_Long": -96.73044,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000143858,
      "AltID": "Disinfection",
      "FacilityID": 1000115406,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000179964,
          "ProcessID": 1000143858,
          "ChemicalID": 62,
          "Quantity": 76000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000145412,
          "ProcessID": 1000143858,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000087091,
              "Process_NAICS_ID": 1000145412,
              "SafetyReviewDate": "2024-05-22 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "International building and fire code.  The Chlorine Institute pamphlets, 10 States Standards for Water & Wastewater (2012 Edition)",
              "FR_Comments": null,
              "HazardReviewDate": "2024-05-22 00:00:00",
              "ChangeCompletionDate": "2024-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Various, see Prevention Program",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "System enclosed in building",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-06-13 00:00:00",
              "TrainingReviewDate": "2022-10-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Vendor",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-10-13 00:00:00",
              "EquipmentInspectionDate": "2024-06-01 00:00:00",
              "EquipmentTested": "Chlorine sensors and eyewash / safety shower station.",
              "ComplianceAuditDate": "2020-11-19 00:00:00",
              "AuditCompletionDate": "2021-12-31 00:00:00",
              "IncidentInvestigationDate": "2023-03-01 00:00:00",
              "InvestigationChangeDate": "2023-12-31 00:00:00",
              "MostRecentChangeDate": "2014-03-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000088041,
                  "PreventionProgram2ID": 1000087091,
                  "ProcessChemicalID": 1000179964
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000115406,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-09-01 00:00:00",
    "ERTrainingDate": "2018-12-18 00:00:00",
    "CoordinatingAgencyName": "Sioux Falls Emergency Management",
    "CoordinatingAgencyPhone": "6053674290",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 9,
      "FacilityID": 1000115406,
      "SummaryText": "plan provides specific emergency response procedures for accidental releases of chlorine. The emergency response procedures cover a release from the initial alarm stage through Hazmat assistance. As part of the emergency response procedures, there are plans for victim rescue, leak investigation, and communication with additional support agencies. In addition, critical plant operations are identified to ensure that, if possible, the critical Water Purification Plant functions are kept operational. \nThe Emergency Planning and Response plan also addresses plant site communication, emergency response equipment, first aid and medical treatment, medical surveillance and consultation, and emergency response drills.\nAdditional emergency planning and response elements went into effect on May 10th, 2024, which include the implementation of emergency response field and tabletop exercises.  Emergency response field exercises are designed to simulate the release of chlorine gas and how emergency responders and WPP staff would coordinate their efforts to mitigate the dangers to the surrounding community.  Emergency response field exercises should be done at least once every 10 years.  Emergency response tabletop exercises should be conducted at least once every three years. \nFive-Year Accident History\nThe Sioux Falls WPP has not had any accidental chlorine releases in the last five years."
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000115406,
      "SummaryText": "024, the next compliance audit will need to be a third-party audit if an accidental release results in any deaths, injuries, or significant property damage on site, or any known offsite deaths, injuries, evacuations, sheltering in places, property damage, or environmental damage or if an implicating agency requires a third-party audit due to conditions that could have led to an accidental release (near miss) or when a previous third-party audit failed to meet the competency or independence criteria described in 40 CFR 68.59(c).  The third-party auditors will submit a report to the WPP\u0092s environmental engineer and/or superintendent.  As soon as possible, but not longer than 90 days, the WPP\u0092s environmental engineer and/or superintendent will determine the appropriate responses to the findings in the Third-Party Audit Report and will develop a Findings Response Report.  \nManagement System\nThe management section delegates the responsibilities of the various elements described in the RMP to ensure that the WPP staff understand their roles and responsibilities within the context of the RMP. The goal is to maintain active communication between management, staff, regulators, and emergency responders in order to facilitate the safest possible handling of chlorine under normal and emergency situations. \nEmergency Response Program\nThe Emergency Response Program develops a plan for dealing with a release. EPA RMP regulation 40 CFR 68 Subpart E requires that an Accidental Release Emergency Response Plan be prepared. The plan must be prepared in accordance with the provisions of another overlapping OSHA regulation\u0097Employee Emergency Plans (29 CFR 1910.38(a)). In addition, provisions of the OSHA hazardous waste and emergency response standard, 29 CFR 1910.120 (q), must also be considered. The Emergency Planning and Response Plan described in this section complies with the requirements of 40 CFR 68.95, 29 CFR 1910.38(a), and 29 CFR 1910.120(q). \nThe Emergency Planning and Response"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000115406,
      "SummaryText": "ance.\nIncident Investigation\nEach incident that resulted in or could reasonably have resulted in a catastrophic release of chlorine must be investigated. A process to identify the underlying causes of incidents and implement procedures for preventing similar events has been developed. To investigate an incident, an investigation team will be established. As part of the investigation, an incident report will be prepared to recommend system changes to prevent the incident from occurring in the future.\nThe investigation team should ask questions such as: What equipment failed? Which behavior failed?  Which material leaked, reacted, or exploded? As part of the incident review, staff actions that may have contributed to the incident will also be reviewed. A determination will be made as to whether it is necessary to institute additional training for the employees to prevent the incident from occurring in the future. The incident investigation report and any changes resulting from the report will be reviewed with all staff members who operate and maintain the applicable system. \nCompliance Audit and Third-Party Audits\nThe Water Purification Plant will complete a compliance audit for the RMP program plant at least once every 3 years. The primary goals of conducting a compliance audit are to verify compliance with RMP requirements and good process safety practices, identify process safety deficiencies, develop corrective actions, and increase safety awareness among plant staff.\nThe compliance audit methodology is modeled after OSHA\u0092s guidelines for conducting regulatory PSM compliance audits: Compliance Guidelines and Enforcement Procedures, OSHA Instruction CPL 2-2.45A (September 28, 1992). An auditor knowledgeable in the covered processes, RMP requirements, and audit techniques will conduct the audits. Based on the results of the audit, the plant will promptly determine an appropriate corrective action for each deficiency identified during the audit.\nEffective May 10th, 2"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000115406,
      "SummaryText": "The detailed operating procedures include startup, shutdown, and emergency operating procedures. The procedures describe how the system should be operated in order to minimize the chances of an accidental release. The procedures also emphasize safety considerations during operation and address hazardous situations that can occur and how to correct them.\nTraining\nAn effective RMP training program can significantly reduce the number and severity of accidental release incidents.  Employees involved in operating or maintaining the chlorination process receive training that includes applicable operating and maintenance procedures and an overview of the process. Training must emphasize safety and health hazards and safe work practices.\nSioux Falls Water Purification Plant staff received initial training as part of their annual training on the chlorine system operations and maintenance. Refresher process operation training is provided at least every 3 years. Should any changes in the chlorine process occur, all of the employees involved in operating the chlorine process will be trained in any updated procedure prior to startup of the changed system.\nMaintenance\nAn effective maintenance program is one of the primary lines of defense against a release. The maintenance program addresses equipment testing and inspection, preventative maintenance schedules, and personnel training. The intent is to ensure that equipment used to process, store, or handle chlorine is properly maintained and installed to minimize the risk of releases.\nThe Water Purification Plant staff use a computerized system, VUEWorks Asset Management and Work Order System to store equipment information, generate and prioritize work orders, and schedule preventative maintenance (PM). In addition to preventative maintenance, the Water Purification Plant staff performs corrective maintenance in the event of equipment malfunction or breakdown. All maintenance staff are trained to properly and safely perform mainten"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000115406,
      "SummaryText": "0.1 miles of the Water Purification Plant is a power plant.\nPrevention Program\nThe Prevention Program consists of seven elements designed to improve the system safety and decrease the likelihood of a release.\nSafety Information\nThe RMP regulations require that information concerning process chemicals, technology, and equipment be compiled as part of an RMP program. Emergency response planners can use such information to develop training programs and procedures or as a general resource. The information will be supplied to contractors who will work in the chlorine process area. All the required process safety information was compiled as required by the RMP regulations. The information meets and, in many cases, exceeds the minimum required by the regulations.\nHazard Review\nA hazard review was conducted systematically to evaluate potential causes and consequences of accidental releases. This information was used by Water Purification Plant staff to improve safety and reduce the consequences of accidental releases. The chlorine Hazard Review was conducted by AE2S with the assistance of Water Purification Plant staff familiar with the process operation and maintenance and plant management. The review was done using a \u0093Checklist\u0094 method. Based on the results of the review, changes in operating, maintenance, and other process safety management procedures that would improve the overall safety of the chlorine system were identified. The changes that most effectively help prevent an accidental release have been or will in the future be implemented. \nOperating Procedures\nThe existing operating procedures for the chlorination processes have been recently reviewed and revised. Written operating procedures assure continuous, efficient, and safe operation of the facility. The goal of the operating procedures is to provide clear instructions to safely operate the process. Operating procedures are also used to train new employees and to provide refresher training for existing staff."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000115406,
      "SummaryText": "ious health effects, or symptoms that could impair an individual\u0092s ability to take protective action. Because the cloud from a chlorine leak would disperse relatively quickly, an individual at the worst-case scenario distance would be exposed to the exposure limit concentration for much less than the 1 hour assumed by the limit. In addition, the exposure limit concentrations result in relatively minor health effects. Therefore, an individual at the worst-case scenario distance would be affected less than the results the worst-case scenario may imply. Using these assumptions, computer modeling estimated that the distance to the toxic endpoint would be 1.3 miles. An estimated population of 7,700 and 2,550 housing units are located within this distance. Three schools, one prison, and three public recreation areas or arenas are located within this distance as well.\nAlternative Scenario\nThe RMP rule also requires that at least one alternative release scenario be evaluated. The alternative scenarios reflect a type of release that is more likely to occur compared to the worst-case scenario. Unlike the worst-case scenario, the alternative release scenario may consider active actions to stop or contain the release and a more realistic release quantity and release rate. Lastly, it assumes local, typical meteorology, which is more realistic than the conservative meteorological conditions that must be assumed for the worst-case scenario. The alternative release scenario for chlorine assumes that  a one-ton container is dropped during truck unloading resulting in damage to the container or valve assembly and an associated leak. The leak is assumed to be 1/8\u0094 diameter. The alternative release scenarios are considered to be more representative of the effects likely in the event of a release. The distance that the alternative release of chlorine would travel was estimated to be 0.1 miles. No residential areas or population are located within this distance. The only receptor within"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000115406,
      "SummaryText": "cenarios\u0097a \u0093worst case\u0094 and an \u0093alternative release.\u0094 \nIf a release were ever to occur, the gas would migrate as the wind pushes it in the prevailing wind direction. The wind would move the gas in primarily one direction. But the regulations require the release to be presented as though it would spread in all directions. In other words, the distance determined by the Hazard Assessment is only valid for the direction of the wind. Someone located the same distance upwind would not be affected by the release. \nWorst-Case Scenario\nThe regulations require the development of a worst-case release scenario based on conservative assumptions. For example, it is required to assume that the entire contents of the largest single container of chlorine will be released at a constant rate over 10 minutes. A constant release over 10 minutes is unlikely to occur due to the physics of chlorine evaporation. As the liquid chlorine evaporates quickly, it absorbs energy, causing its temperature to drop. This temperature decrease leads to a reduction in pressure, which in turn slows the leakage rate. Eventually, an equilibrium is reached between the energy lost and the energy added to the liquid chlorine which results in a slower overall leakage rate than the initial leakage rate. In addition, the regulations require that active efforts to stop the release cannot be considered. In many scenarios, active efforts to stop the release would reduce the amount released. The regulations also require that the worst-case scenario assume conservative atmospheric conditions that result in a larger area of impact. \nThe hazard assessment requires that the \u0093toxic endpoint\u0094 or distance from the point of release to a location at which the chemical concentration equals or exceeds a certain concentration must be determined. That concentration is defined as the maximum airborne concentration below which individuals could be exposed for up to 1 hour without experiencing or developing irreversible or other ser"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000115406,
      "SummaryText": "re.\nTo date, the safety systems in place have allowed the Water Purification Plant to achieve an excellent record in preventing accidents. No chlorine release causing a safety or health hazard has occurred within the last 15 years. \nSafety systems help reduce or eliminate the consequences of an accident, much like seat belts reduce injuries in car accidents and anti-lock brakes help avoid car accidents. Unfortunately, accidents can still occur. By being prepared for an accident, we can handle the situation in a way that protects those around us. At the Water Purification Plant we prepare for an accidental release by planning a course of action to address and handle the situation. The Emergency Response Program details appropriate courses of action to be taken in the event of a release and is designed to protect people inside as well as outside of the plant. The combination of safety systems and the Emergency Response Program greatly reduces the risk due to a potential accidental release for people inside and near the plant. \nComponents of the RMP\nThe RMP consists of three major parts. The first part is the Hazard Assessment. The Hazard Assessment is done to determine the effects that a release of a regulated chemical could have on the public. The second part is a Prevention Program that consists of seven elements designed to improve the system safety and decrease the likelihood of a release. The third part is the Emergency Response Program, which develops a plan for dealing with a release in the unlikely event that one would occur. \nHazard Assessment\nA Hazard Assessment was performed to determine the effects a release would have on the public. For chlorine, the distance a set concentration of chlorine would travel must be determined. In addition, an estimate of the population outside of the plant boundary that could be impacted was determined, and sensitive receptors such as hospitals, schools, and parks were identified. The Hazard Assessment considers two release s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000115406,
      "SummaryText": "place, the Sioux Falls Water Purification Plant (WPP) had already established many of the components of the plan. The requirements of this plan, commonly referred to as a Risk Management Plan (RMP), are detailed and codified in 40 CFR Part 68. The Sioux Falls WPP is considered a responding stationary source as described in 40 CFR 68.180(b).\nChlorine Process Safety Systems\nThe Water Purification Plant stores chlorine in 1-ton containers. Chlorine is mixed with the treated water before being pumped to homes and businesses. Chlorine is non-explosive and non-flammable, however, like oxygen, it is a powerful oxidizer and can support the combustion of certain substances. In addition, it is an irritant to the respiratory system, eyes, and skin. Exposure through inhalation at high concentrations is toxic. To prevent accidental releases from occurring that may cause these injuries, the Water Purification Plant has several safety systems. These systems along with the Prevention Program described below greatly reduce the possibility of a significant release of chlorine from occurring. One safety system is the chlorine \u0093leak detectors\u0094 that continuously monitor for leaks in the chlorine storage area. Even the smallest of leaks activates alarms that immediately alert plant personnel and allow them to prevent a potential release of chlorine into the atmosphere. In addition, sensors monitor the system pressures and temperatures to detect abnormal conditions that may indicate that a chlorine leak is about to occur. These monitors allow corrective actions to be taken before a leak may occur.  In the event of a leak, the Plant has also installed a dry chlorine scrubber.  This system is activated when the chlorine leak detection system identifies a leak. It creates a strong draft that pulls air through the chlorine storage room and into the chlorine scrubber. The scrubber chemically reacts with the chlorine, effectively neutralizing the gas so that it is not released into the atmosphe"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000115406,
      "SummaryText": "Executive Summary\nIntroduction \nChemicals are widely used in industry, in the home, and in the environment and are an integral part of everyone\u0092s daily lives. They are transported on roads, water, and railways. The City of Sioux Falls Water Purification Plant uses chemicals, too. The plant uses chlorine to disinfect our drinking water. The natural world contains more than 1,500 chlorine-containing compounds. Human cells generate hypochlorite, a form of chlorine to fight infection. Chlorine purifies our drinking water, disinfects our swimming pools, and is truly lifesaving. In fact, the World Health Organization estimates that 25,000 children worldwide die every day from waterborne diseases resulting from the lack of a water disinfection agent such as chlorine. \nStoring chemicals can be a hazard. We take our safety obligations in storing and using chemicals as seriously as we take providing safe drinking water. The following document describes what could happen if there were to be an accident, the steps we take every day to ensure that our plant operates safely, and what we would do in the event of an emergency. \nRegulatory Background\n\nThe United States Environmental Protection Agency (USEPA)\u0092s Clean Air Act Amendments of 1990 included provisions that require facilities that use certain chemicals to develop a formal plan to reduce the likelihood of an accidental release of the chemicals  into the atmosphere and reduce the likelihood of serious harm to the public and the environment. In this plan, the EPA defined three program levels based on the processes\u0092 relative potential for public impacts and the level of effort needed to prevent accidents.  Based on the requirements the City of Sioux Falls Water Purification Plant is assigned Program Level 2.  This is based on public receptors located nearby. The State of South Dakota is not an OSHA state, and the process is not classified in one of the covered NAICS codes as defined by EPA.    Before these regulations were in"
    }
  ]
}