{
  "FacilityID": 1000073882,
  "FacilityName": "Coastal Caverns",
  "FacilityStr1": "6045 Highland Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Beaumont",
  "FacilityState": "TX",
  "FacilityZipCode": "77705",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "30.019075",
  "FacilityLongDecDegs": "-94.073909",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "6876 Erie St.",
  "FacilityEmailAddress": "rwaddell@coastalcaverns.com",
  "FacilityDUNS": 109633837,
  "ParentCompanyName": "Caliche Development Partners, L.L.C.",
  "Company2Name": null,
  "CompanyDUNS": 110273495,
  "Company2DUNS": 0,
  "OperatorName": "Coastal Caverns I L.P.",
  "OperatorStr1": "6876 Erie St.",
  "OperatorStr2": null,
  "OperatorCity": "Beaumont",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77705",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Dale Corbello",
  "RMPTitle": "Senior Vice President, Operations",
  "FTE": 15,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000239976",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-11-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-11-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "4",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092119,
      "AltID": "Ethylene Underground Stor",
      "FacilityID": 1000073882,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093362,
          "ProcessID": 1000092119,
          "NAICSCode": "48691",
          "_desc": {
            "NAICS_CODE": "48691",
            "NAICS_DESCRIPTION": "Pipeline Transportation of Refined Petroleum Products"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115086,
          "ProcessID": 1000092119,
          "ChemicalID": 95,
          "Quantity": 600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 95,
            "ChemicalName": "Ethylene  [Ethene]",
            "CASNumber": "74-85-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000615086,
          "ProcessID": 1000092119,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000073882,
      "SummaryText": "The Coastal Caverns I L.P. (a.k.a. Coastal Caverns) Facility located at 6045 Highland Ave, Beaumont, Jefferson County, Texas 77705 [30? 1' 8.670\" N and 94? 4' 26.072\" W] with contact phone of (409) 833-5504\n\nThe facility handles the receipt and redistribution of ethylene (a petroleum refined product with CAS number 74-85-1). The facility has storage maximum intended inventory of 600,000 pounds of ethylene in a brine storage cavern at the physical address listed herein above. The facility receives and redistributes the ethylene by pipeline and has a remotely located brine source that is supplied by pumps and supporting infrastructure to the Coastal Caverns storage address location described herein above. Coastal Caverns adheres to and shall follow regulated guidelines covered in OSHA 29 CFR 1910.119 - Process Safety Management of Highly Hazardous Chemicals as well as 40 CFR Part 68 The USEPA's Risk Management Plan requirements. Coastal Caverns also follows all other applicable federal regulatory requirements as well as \"Recognized And Generally Accepted Good Engineering Practices\" (RAGAGEP) that are the basis for engineering, operation, or maintenance activities and are themselves based on established codes, standards, published technical reports or recommended practices (RP) or similar documents. RAGAGEP detail generally approved ways to perform specific engineering, inspection or mechanical integrity activities, such as fabricating a vessel, inspecting a storage tank, or servicing a relief valve. Coastal Caverns also employs administrative controls, such as written procedures and policies to provide personnel with explicit and direct steps to maintain and control the process and its operations. Coastal Caverns Senior management has a clear and focused understanding of the hazards of the process as well as the significance of providing the necessary commitments to personnel for safety, employee/contract/community well-being, and environmentally responsible operation"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000073882,
      "SummaryText": "s.\n\n\n\nEthylene is a highly hazardous chemical, flammable material with no known toxic effects. Ethylene combined with sources of ignition, may inadvertently result in an ignition or fire/explosive event. Ethylene may also undergo a compression decompression conversion process that, if uncontrolled, may result in accelerated high temperature, high pressure process conditions that may lead to a loss of containment.\n\nThe facility has a combination of engineering and administrative controls, not limited to Programmable Logic Controller and administrative control monitoring and action-based system. The system manages and controls at a safe operational status the continuous actions and responses to keep the process at a safe condition. Deviations from the assigned controls are monitored, manned and controlled by a staff 24 hours a day x 7 days a week, 365 days per year and are communicated to the staff through an alarm and interlock system to bring unintended deviations back under control. Actions from deviations can also allow for personnel to intervene by remote control room or on-site by persons by shutdown authorized policy allowing any individual the permission to bring the operation to a controlled state if there is an emergency. Trained and qualified personnel also have detection monitoring equipment to use manually if there is a need to detect and determine that there may be a unintended release of the regulated chemical/highly hazardous material. Trained and qualified personnel have been trained on, and follow normal, emergency, shutdown, startup, startup after an emergency or maintenance activity, and abnormal operation procedures to control and maintain the process under controlled conditions.\n\n\n\nThe facility also has a flare for the controlled release and mitigation of unplanned increases and upsets of process operations. The personnel have instrumentations and controls, as well as procedures to properly manage and monitor normal, upset and emergency condition"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000073882,
      "SummaryText": "s at a remote location at a reasonable safe distance from the actual process location. Personnel may or may not be on-site in the event of an upset condition, but based on monitoring and instrumented controls can respond quickly, safely, and effectively using precomposed procedures and policies for the management of the operation. Any release, depending on the complexity and nature may result in a number of outcomes to bring the process back to a safe and controlled status, by personnel up to including the shutdown of the process and closure of source ethylene from the underground storage cavern and/or pipeline as required.\n\n\n\nThe facility has a written and personnel trained on Emergency Response Plan (known herein as The Plan) that has been drafted and completed detailing that the facility will follow the plan. The plan details that any individual in the facility shall, upon detection, notify their immediate supervisor and/or Coastal Caverns contact that an emergency condition may exist. The person who has knowledge that receives the report of the potential emergency shall notify the Plant Manager and/or control room operations who will immediately notify the appropriate emergency responders based on the type, complexity and scope of the event. The Plan directs through instructions and diagrams the actions necessary to return an emergency condition(s) back to a safe and normal operating state.\n\n\n\nThe Emergency Response Plan has the following introduction:\n\n\"The Coastal Caverns Emergency Response Plan was developed to meet the requirements of 29 CFR 1910.38 - Emergency Action Plans; 40 CFR 68.95 - Emergency Response Program and Title 16, Part 1, Chapter 3, Rule 3.95, (h)(8) and (9) of the Texas Administrative Code. The initial plan is designed based upon the existing safety measures at the facility and addresses spills and releases, fires, fire suppression capability, explosions, loss of electricity, adverse natural conditions (e.g. tornado, flooding, earthquake, an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000073882,
      "SummaryText": "d other storm related events) and loss of telecommunication services. It also describes the facility emergency response communication system, procedures for coordination of emergency communication and response activities with local emergency planning committees and other local authorities, use of warning systems, procedures for citizen and employee emergency notification and evacuation, and employee training. A plat of the facility (located in the requisite The Plan that shows the location of wells, processing areas, brine pits, and other significant features at the site is included in FIGURE 1-5 in The Plan. It is not possible to have a specific plan to cover all inclusive situations. Therefore, this plan provides general guidelines and must be used with good judgment to cope with emergencies. This ERP is not meant to replace common sense or actions not specifically described herein. Employees tasked with emergency response responsibilities will continually evaluate the effectiveness of actions called for in this ERP and make the appropriate adjustments based on past experience and level of training to most effectively mitigate the incident. The information contained in this plan is intended to be used as guidelines for the emergency responder. Actual circumstances may vary and will dictate the procedures to be followed, some of which may not be included in this manual.\"\n\n\n\nCoastal Caverns and Management staff is committed to working closely, and using due diligence, with the Jefferson County Local Emergency Planning Commission and Mutual Aid to responsibly provide for the safety and wellbeing of all employees, contractors, industrial neighbors, and the community as a whole in the unlikely event of an emergency.\n\n\n\nAt the conclusion of any intended, planned ERP drill, or unintended incident, there will be a critique and/or investigation of the outcome to provide for the continuous and ongoing improvement of The Plan for the advancement of the Health, Safety, enviro"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000073882,
      "SummaryText": "nmental protection, and well-being of the public community at large.\n\n\n\nAs this is the initial starting of an original underground salt-dome storage cavern, there is no initial five (5) year accident history, but will be maintained and updated as required per the governing regulations.\n\n\n\nThe Coastal Caverns I L.P. organization has ongoing plans to provide changes, as determined necessary after startup, to investigate and research opportunities to continuously improve Health, Safety, environmental protections and actions with the community, employees, contractors and industrial neighbors in mind.\n\n"
    }
  ]
}