{
  "FacilityID": 1000072882,
  "FacilityName": "International Paper Port Wentworth",
  "FacilityStr1": "1 Bonnybridge Rd",
  "FacilityStr2": null,
  "FacilityCity": "Port Wentworth",
  "FacilityState": "GA",
  "FacilityZipCode": "31407",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13051",
  "LEPC": "Chatham County LEPC",
  "FacilityLatDecDegs": "32.158611",
  "FacilityLongDecDegs": "-081.158333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "PG",
  "FacilityURL": "ipaper.com",
  "FacilityEmailAddress": "Russ.Foulke@ipaper.com",
  "FacilityDUNS": 1316561,
  "ParentCompanyName": "International Paper",
  "Company2Name": "International Paper Company",
  "CompanyDUNS": 1316561,
  "Company2DUNS": 0,
  "OperatorName": "International Paper Company",
  "OperatorStr1": "1 Bonnybridge Road",
  "OperatorStr2": null,
  "OperatorCity": "Port Wentworth",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31407",
  "OperatorZipCodeExt": null,
  "RMPContact": "Douglas Johnson",
  "RMPTitle": "Plant Manager",
  "FTE": 300,
  "OtherEPAFacilityID": "31407STNCN1BONN",
  "EPAFacilityID": "100000171823",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "26110510010V040",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-01-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-01-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-01-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.15431,
  "FRS_Long": -81.15508,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000091120,
      "AltID": "ClO2 Manufacturing",
      "FacilityID": 1000072882,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000092361,
          "ProcessID": 1000091120,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000113909,
          "ProcessID": 1000091120,
          "ChemicalID": 71,
          "Quantity": 18930.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000613909,
          "ProcessID": 1000091120,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072882,
      "SummaryText": "Executive Summary\n\nRMP Program for International Paper Company.\n\nPort Wentworth Pulp Mill, Port Wentworth, Ga\n\n\n\n1.0  Facility Background\n\n\n\nWeyerhaeuser transferred ownership of the facility to International Paper, and changed the facility name to International Paper Port Wentworth on December 1, 2016. Weyerhaeuser Company transferred ownership of the Port Wentworth Mill from Willamette Industries, Inc. on June 30, 2002.  The Port Wentworth Mill is a fully integrated bleached pulp mill that commenced operations under Willamette  in September, 2000.  Willamette obtained ownership of the facility in May, 2000.  Previously, Stone Container Corporation owned and operated the mill.  In 1991, Stone installed a new bleached pulp line which included a Eka SVP chlorine dioxide plant.  Chlorine dioxide is a key bleaching element.  Prior to the effective date of RMP program development (6-21-99), Stone Container Corporation shut down the Port Wentworth facility due to market conditions.  This shutdown occurred in October of 1998.  Chlorine dioxide is the only item which is applicable to the RMP program.\n\n\n\nThe facility is located near Port Wentworth, Ga (Chatham County) or about 5 miles upstream from Savannah, Ga on the Savannah River.  The topography surrounding the mill is comprised of coastal plains and wetlands.  The City of Port Wentworth surrounds the facility and has a population of about 6,300.  However, within a 30 mile radius of the facility lies a metropolitan area including the City of Savannah and Hunter Army Airfield.  Additionally, the surrounding area contains many and varied industries.\n\n\n\nThe only product manufactured at the Port Wentworth facility is bleached wood pulp. \n\n\n\n2.0 Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe Port Wentworth Mill  is committed to the safety of its employees and the general public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  The Port W"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072882,
      "SummaryText": "entworth Mill  implements reasonable controls to prevent foreseeable releases of hazardous substances.  In the event of an accidental release, the Port Wentworth Mill controls and contains, to the extent possible, the release in a manner that will be safe for employees and will help prevent injury to the public or damage to the environment.  In addition, the Port Wentworth Mill will investigate incidents soon after they occur to determine the root cause(s) for the incident and develop plans to ensure that the incident does not occur again.  The facility also has a mechanical integrity program that requires inspection and testing of equipment, instrumentation, and safety systems to ensure they are operating correctly and providing the required prevention and protection from unplanned releases within the ClO2 Process.  The facility also has an Emergency Response Program that requires Hazardous Materials Response Training for the Emergency Response Team.  The facility also provides training for Operational Personnel in Hazardous Materials to assist the Emergency Response Team in the ClO2 Process to eliminate and mitigate releases.\n\n\n\n3.0  RMP Applicability\n\n\n\nThe Port Wentworth facility employs one process that contains chemicals to such a degree that the process is required to be \"covered\" under the RMP program, 40 cfr 68.  The one covered process is a Eka SVP chlorine dioxide plant.  The chlorine dioxide plant contains three storage tanks that contain 18,930 lb. of chlorine dioxide.  The threshold quantity for chlorine dioxide is 1,000 lb.  In this case, the boundary of the covered process has been developed conservatively so that the chlorine dioxide generation process is covered as well as just the storage tanks.\n\n\n\n4.0  Overview of the Eka Chlorine Process and Off-site Consequence Analysis\n\n\n\n4.1  Eka SVP Process\n\n\n\nThe Eka process produces chlorine dioxide in a closed recirculating reactor.  In this case, sodium chlorate and sulfuric acid are added together in a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072882,
      "SummaryText": "closed dynamic reactor to produce chlorine dioxide gas.  Methanol is also added to the reactor to serve as a catalyst.  Chlorine dioxide gas is drawn off the top of the reactor and routed to a chilled water absorption column where the chilled water strips the chlorine dioxide out of the gas stream to form liquid chlorine dioxide, which is 11.5 g/L ClO2 concentration.  Chlorine dioxide is stored in three storage tanks with a combined capacity of 18,930 lb.  \n\n\n\n4.2.1  Worst Case Scenario Review\n\n\n\nThe worst case scenario would be the complete failure of all three chlorine dioxide storage tanks releasing the full capacity of 18,930 lb.  In this scenario, the liquid chlorine dioxide would vaporize and form a toxic gas cloud.  This gas cloud would impact an area of up to 5.53 miles from the plant site.  Within this boundary and depending upon wind direction, a gas cloud could impact the City of Port Wentworth, the Savannah International Airport, the City of Garden City, and the north end of the City of Savannah. \n\n\n\n4.2.2  Alternate Release Scenario Review\n\n\n\nThe most probable alternate release scenario is the rupture of a 6\" pipe, 280 feet long containing chlorine dioxide.  In this case, the total contents of the pipe would be released.  As with the worst case scenario, the liquid chlorine dioxide would pool on the ground then vaporize forming a gas cloud.  A total of 58.8 lb. of chlorine dioxide would be released.  This gas cloud would impact an area up to 1.62 miles from the mill site.  Only the City of Port Wentworth would be affected by this type of release.\n\n\n\n5.0  General Accidental Release Prevention Program\n\n\n\nThe Port Wentworth Mill takes a proactive view of preventing incidents related to releases of hazardous chemicals.  We value OSHA's PSM program and EPA's RMP program on the same level and in many cases combine into one effort those overlapping prevention activities.  The key elements of our prevention program include:\n\n\n\n* Process Safety Information\n\n* Pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000072882,
      "SummaryText": "ocess Hazard Analysis\n\n* Standard Operating Procedures\n\n* Training Programs\n\n* Mechanical Integrity Programs\n\n* Management of Change Procedures\n\n* Pre-startup Safety Reviews\n\n* Compliance Audits\n\n* Incident Investigations\n\n* Employee Participation\n\n* Hot Work Permitting\n\n* Emergency Response Program\n\n* Management of Contractors within RMP systems\n\n\n\n5.1 Process Safety Information\n\n\n\nProcess Safety Information consists of many different types of information related to hazardous chemicals and the processes that contain them.  Types of information that are available to all employees and contractors include SDSs, chemical control information, PSM/RMP files, engineering files, process specific safety information, and Corporate Engineering Standards.\n\n\n\n5.2 Process Hazard Analysis (PHA)\n\n\n\nUpon the purchase of the Port Wentworth facility by Willamette, a PHA was performed on the ClO2 covered process prior to any check out or start up activities.  The PHA served to provide a list of recommended changes and fixes to the plant during the pre-startup safety review prior to start up.  The Hazard and Operability (HazOp) technique was used to complete the PHA.  Per the requirements of the RMP program, the PHA has been repeated or reviewed every five years.  The PHA Revalidations provide a list of safety improvements that the facility is required to complete to assist in preventing and mitigating ClO2 Releases.\n\n\n\n5.3 Standard Operating Procedures\n\n\n\nThe mill has developed and implemented Standard Operating Procedures in every operating area, including the ClO2 covered process.  SOPs include normal operating, emergency operating, temporary operating, as well as start up and shutdown procedures.  SOPs were developed using vendor supplied and recommended practices modified and applied to specific processes.  Where additional procedures are deemed necessary, qualified personnel from that operating area develop applicable operating procedures.  The SOP program is a dynamic program in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000072882,
      "SummaryText": " that SOPs are continually reviewed and updated.\n\n\n\n5.4 Training Programs\n\n\n\nPort Wentworth employees involved with the operation and maintenance of the covered ClO2 process are trained periodically to ensure that their knowledge of the process and procedures is complete.  This training includes training supplied by the vendor of the ClO2 technology, in this case Eka Nobel.  Additionally, training and qualification is an essential element of a technicians advancement in Port Wentworth's pay and progression system.  All employees within the Fiberline area are trained annually on the covered process and the requirements of RMP.\n\n\n\n5.5 Mechanical Integrity\n\n\n\nThe Port Wentworth Mill uses a computer based maintenance system, called SAP, to manage maintenance and mechanical integrity activities.  All response maintenance work orders as well as preventive maintenance inspection work orders are entered through SAP.  In addition, after the work order is completed, the results of the work, particularly for PM inspections, can be stored in the SAP system.  This allows for a good mechanical history for all equipment to be archived.  In addition, the SAP system is able to rate the priority of work requests by the priority rating which has been assigned to each process.  By using this system, the PSM/RMP covered process receives the highest rating allowing prompt response to mechanical and maintenance issues as they arise.  The SAP system is able to generate inspection work orders for the covered process based on frequency originally inputted into SAP.  This allows for vendor recommended routine inspections to take place on the prescribed frequency.\n\n\n\n5.6 Management of Change (MOC)\n\n\n\nThe Port Wentworth Mill utilizes an electronic MOC system for the ClO2 covered process such that any proposed change or modification to a covered process must first be reviewed for process safety considerations.  A team comprised of operating, engineering, maintenance, and process control personne"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000072882,
      "SummaryText": "l meet periodically to review current and upcoming MOC Requests.  Changes to the process can only occur after the MOC is approved by all required MOC reviewers.  All MOC requests are maintained in the electronic MOC System and documented/filed in the PSM/RMP file system.  In addition, any PSI or engineering documentation change required because of an approved MOC are noted within the MOC System as an action item and follow is required on the mill's electronic task tracker system.\n\n\n\n5.7 Pre-startup Safety Reviews (PSSR)\n\n\n\nPSSRs are conducted for any startup of projects that occur within the boundary of the covered process or after a major maintenance outage.  PSSR is conducted by operating, maintenance, engineering, and process controls personnel to ensure that all systems are verified safe prior to start up.  PSSR forms are used to facilitate the PSSR as well as document the PSSR.  The PSSR provides a list of safety improvements for the process.\n\n\n\n5.8 Compliance Audits\n\n\n\nCompliance Audits are required to be conducted every 3 years on PSM/RMP covered Processes.  The Compliance Audit confirms that the facility has an effective PSM/RMP program that is comprehensive, complete and, based on the records reviewed, generally meets the federal regulatory requirements.  The Compliance Audit will  provide the facility with a list of any safety improvement items that are required to maintain the PSM/RMP process in compliance.\n\n\n\n5.9 Incident Investigations\n\n\n\nThe Port Wentworth Mill will investigate incidents soon after they occur to determine the root cause(s) for the incident and develop plans to ensure that the incident does not occur again.  Incident Investigations are key to provide safety improvement items to prevent future incidents and releases within the covered process.\n\n\n\n5.10 Employee Participation\n\n\n\nEmployee Participation is a key element in maintaining the facility's PSM/RMP Program.  The facility employees participate in PSM/RMP Steering Teams, PHAs, PSSRs, "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000072882,
      "SummaryText": "Reviews of Standard Operating Procedures, Reviews of Management of Change, and Training Processes. \n\n\n\n5.11 Hot Work Permitting\n\n\n\nThe facility has a Hot Work Policy and Program that meets the PSM/RMP requirements.  The facility periodically reviews the program and Hot Work Forms to ensure that we are adhering to the requirements.  Training of mill employees and contractors is provided to ensure they are competent in execution of the requirements of this policy.\n\n\n\n5.12 Emergency Response Program\n\n\n\nThe facility has an Emergency Response Program that includes Hazardous Materials Response Training, Confined Space Rescue, and Incipient Fire for all Emergency Response Personnel.  We also provide Hazardous Materials Training for Operational Personnel to assist the Emergency Responders.  The facility also periodically provides First Responder and Incident Command Training.  \n\n\n\nElements of the facility's Emergency Response Policy:\n\n*  Introduction to the Emergency Response Plan\n\n*  Overview of the Emergency Response Plan\n\n*  Employee Protection and Evacuation\n\n*  Medical Emergency Response\n\n*  Fire Response Guideline\n\n*  Chemical Release Response \n\n*  Severe Weather\n\n*  Utilities Outages\n\n*  Recovery Boiler ESP Drain Procedure\n\n*  Process Explosion\n\n*  Mill Fatality\n\n*  Bomb Threat and Form\n\n*  Flood Response \n\n*  Earthquake Response\n\n*  Radiological Response\n\n*  Phone Contacts\n\n*  Protest Demonstration Response\n\n*  Mill Emergency Alarm Instructions\n\n\n\n5.13 Management of Contractors with RMP Systems\n\n\n\nThe facility also requires all contract personnel to complete the Mill Specific Safety Orientation and the PSM/RMP Orientation.  Contractors working in PSM/RMP Systems must have completed PSM/RMP Training with their employer.  The facility utilizes the EHS Safe Work Plan to identify job specific hazards with the contractor and contractor coordinator and a Pre-Job Safety Assessment prior to the start of any task.  The facility also requires contractors and other support per"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000072882,
      "SummaryText": "sonnel to sign in and out of PSM/RMP area and to notify the corresponding control room.\n\n\n\n5.14  Planned Safety Improvements\n\n\n\nPlanned safety Improvements are a part of the PHA, PSSR, and Compliance Auditing Systems.  These safety improvements would be entered into the Management of Change System and/or SAP Systems when required and followed until they are completed.\n\n\n\n6.0  Five Year Accident History\n\n\n\nThe facility has had one incident within RMP in the last 5 years.  The incident was a ClO2 inhalation on May 26, 2017 in which an employee was administered medical care.  \n\n"
    }
  ]
}