{
  "FacilityID": 1000034044,
  "FacilityName": "Homer City Generating Station",
  "FacilityStr1": "1750 Power Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Homer City",
  "FacilityState": "PA",
  "FacilityZipCode": "15748",
  "Facility4DigitZipExt": "9558",
  "FacilityCountyFIPS": "42063",
  "LEPC": "Indiana County Emer. Man. Agcy",
  "FacilityLatDecDegs": "40.510200",
  "FacilityLongDecDegs": "-079.192900",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Homer City Generation LP",
  "Company2Name": null,
  "CompanyDUNS": 78664548,
  "Company2DUNS": null,
  "OperatorName": "NRG Homer City Services LLC",
  "OperatorStr1": "1750 Power Plant Road",
  "OperatorStr2": null,
  "OperatorCity": "Homer City",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15748",
  "OperatorZipCodeExt": "9558",
  "FTE": 260,
  "OtherEPAFacilityID": "15748MHMRC1750P",
  "EPAFacilityID": "100000172733",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "F96-001",
  "SafetyInspectionDate": "2004-04-01 00:00:00",
  "SafetyInspectionBy": "Consultant",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-11-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-09-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-09-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2023-09-15 00:00:00",
  "DeRegistrationEffectiveDate": "2023-09-08 00:00:00",
  "AnniversaryDate": "2018-09-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.511254,
  "FRS_Long": -79.194364,
  "FRS_Description": null,
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "100000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000041573,
      "AltID": null,
      "FacilityID": 1000034044,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000049955,
          "ProcessID": 1000041573,
          "ChemicalID": 56,
          "Quantity": 663000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000041993,
          "ProcessID": 1000041573,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000036278,
              "Process_NAICS_ID": 1000041993,
              "SafetyReviewDate": "2015-12-18 00:00:00",
              "PHA_Date": "2015-12-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-10-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Human Error",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "350 gpm remote fire monitors",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-03-07 00:00:00",
              "TrainingReviewDate": "2016-03-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-03-07 00:00:00",
              "EquipmentInspectionDate": "2017-03-10 00:00:00",
              "EquipmentTested": "unloading, injection grid, ammonia tanks, piping, pumps, vaporizers",
              "ChangeMgmtDate": "2016-03-07 00:00:00",
              "ChangeMgmtReviewDate": "2016-03-07 00:00:00",
              "PreStartupReviewDate": "2009-02-03 00:00:00",
              "ComplianceAuditDate": "2015-12-16 00:00:00",
              "AuditCompletionDate": "2016-06-16 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-10-22 00:00:00",
              "HotWorkPermitReviewDate": "2016-03-07 00:00:00",
              "ContractorSafetyReviewDate": "2016-03-07 00:00:00",
              "ContractorSafetyEvalDate": "2016-03-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000042863,
                  "PreventionProgram3ID": 1000036278,
                  "ProcessChemicalID": 1000049955
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000034044,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-02-27 00:00:00",
    "ERTrainingDate": "2012-07-31 00:00:00",
    "CoordinatingAgencyName": "Indiana County Emer. Management Agc",
    "CoordinatingAgencyPhone": "7243499300",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000034044,
      "SummaryText": "m identifies lines of responsibility for the entire program and each of its key elements.\r\nDuring an Emergency situation, communications with and assistance from the Homer City Generation LP  organization may be required. Figure 1-1 identifies the key positions within the corporate structure that will provide this support.  The Director of the Generating Station and the Environmental Health & Safety Specialist will provide overall guidance and recommendations in support of Process Safety Management Program and Emergency response support personnel.\r\n ¬ \r\n \r\n \r\n2.0   PROCESS AND SUBSTANCE SUBJECT TO 40 CFR PART 68\r\n\r\nThe Homer City generating station includes three coal-fired electrical generating units with a total capacity of 1,884 megawatts. A Selective Catalytic Reduction (SCR) system controls oxides of nitrogen (NOx).  The SCR system is capable of reducing NOx emissions by approximately 25,000 tons per year during the 12 months of continuous operation.  This NOx reduction provides a substantial benefit to the ambient air quality in terms of reduced ground level ozone concentrations.  An integral part of the SCR system is the storage and on-site transfer of anhydrous ammonia used as a reagent that reduces NOx emissions.  Anhydrous ammonia is regulated under U.S. EPA's Accident Release Prevention Program (40 CFR Part 68). Because anhydrous ammonia will be present in the SCR process in quantities well in excess of the 10,000 lb. threshold, the SCR process is subject to ARP regulations. \r\nThe Homer City generating station also utilizes relatively small quantities of anhydrous ammonia in the electrostatic precipitators (ESP) to enhance the control of particulate matter. The ESP process is capable of being supplied anhydrous ammonia from the main anhydrous storage tanks and therefore is subject to the risk management regulation.  \r\nAnhydrous ammonia is a colorless liquid or gas which is readily detectable by its extremely pungent odor.  In sufficient concentrations, an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000034044,
      "SummaryText": "ystems for identifying and abating potential hazards in the workplace, educate employees about hazards, and train employees on how to prevent accidental releases and avoid hazards.\r\n\r\n¿\tCoordinate its safety and Emergency response program with local community Emergency response officials to insure safe, effective, and swift response to Emergencies in the workplace.  This includes forthrightly disclosing to the community, through its Emergency response officials, facts regarding the hazards and risks in operating the facilities, the prevention techniques in place, and assistance in devising the most appropriate and effective protection plans for the community and the plant.\r\n¿\tEnsure that HCSC's environmental and safety policies are adequately communicated and that all employees are aware of the essential need for sustaining the environment and of their responsibility to support and contribute to HCSC's compliance efforts.\r\n¿\tEstablish programs and systems to facilitate compliance with this policy by employees as well as Homer City Generation LP contractors.\r\n¿\tHomer City Generation LP  has written programs that address the facility's response to Emergencies, including:  Personnel notification and reporting responsibilities;  All Emergency notification components required by government regulation and Homer City Generation LP  policy;  Drills that include a notification and reporting component coordinated with local agencies (police, fire, hospital, environmental);   Current phone numbers of resources required for internal and local, state and federal governmental notifications; And a training program for internal plant Emergency response team members that includes a notification and reporting component. \r\n\r\n1.2\tRisk Management System\r\n\r\nHomer City Generation LP has developed a management system to implement and maintain compliance with the Accidental Release Prevention (ARP) and related Process Safety Management and Emergency response programs.  This management syste"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000034044,
      "SummaryText": "hydrous ammonia is an eye, skin, and/or inhalation irritant.  For this reason, anhydrous ammonia is regulated under the Occupational Safety and Health Administration (OSHA) Process Safety Management Standard at 29 CFR Part 1910.119 and the U.S. EPA risk management rule at 40 CFR Part 68.\r\nFor ammonia processes, the threshold quantity for coverage under 40 CFR Part 68 is 10,000 lbs.  Anhydrous ammonia is delivered to the site via tank truck and stored above-ground in three horizontally oriented cylindrical pressure vessels, with a combined storage capacity of 656,600 lbs (each filled to a maximum 85% of vessel volume).  Shipping and transfer of ammonia to the pressure vessels is carried out by trained qualified personnel provided by the vendor, using standard operating procedures that have been thoroughly reviewed for safety.  The unloading process is monitored from the boiler control rooms and plant security facility via video cameras.  The procedures minimize routine release of residual ammonia in the transfer hose by purging ammonia from the transfer hose back into the transport trailer. Ammonia is pumped from the storage area to the SCR area where it is vaporized, mixed with heated air and injected into the flue gas, which is then immediately passed through a catalyst material.  The reaction in the presence of the catalyst reduces the nitrogen oxide (NOx) and ammonia (NH3) mixture to nitrogen (N2) and water vapor (H2O).  \r\nThe U.S. EPA Risk Management Regulation identifies three levels of requirements for industrial processes.  Program 1 can be applied to any process which has not had a significant release of a regulated substance over the five year period prior to the RMPlan submittal date and for which the worst-case release does not affect public receptors (e.g., residences, parks and recreation areas, commercial/industrial facilities, hospitals).  Given that the SCR process contains substantial quantities of ammonia that if released could affect public re"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000034044,
      "SummaryText": "ceptors, it does not qualify for Program 1.  Program 2 applies to any process that is ineligible for Program 1 and is not subject to Program 3.  Program 3 applies to processes, such as those present at the Homer City facility, which are subject to the OSHA PSM. Because the accident prevention elements of Program 3 are virtually identical to PSM, compliance with U.S. EPA Risk Management regulations also constitutes compliance with PSM. \r\n\r\n¬\r\n \r\nFigure 2-1.\tLayout of the Homer City Generating Station\r\n \r\n\r\n\r\n3.0  OFF-SITE HAZARDS ASSESSMENT\r\n\r\nFor the purposes of developing and maintaining adequate RMPlans, the U.S. EPA has defined in its governing rules and guidance a series of modeling methods and assumptions which are to be utilized as administrative guides for planning purposes.  In order to standardize and simplify to a practical level the many factors that can potentially occur in an accidental release situation, some of these assumptions may not take into account the available preventive measures or mitigation methods that would diminish or even eliminate the implied risks that are suggested by worst-case analyses.  For that reason, both the results for the standardized worst-case defined by the U.S. EPA methods and an alternative case, which is considered by Homer City Generation LP  to be more realistically represent situations that may possibly, but rarely, occur within the lifetime of the facility, are presented and described.  \r\nAs noted, the Homer City Generation Station has used anhydrous ammonia in the ESPs since 1998.  No accidental release of ammonia has resulted in reportable on-site injury, off-site injury, Emergency response, or damage to property or the environment.  To ensure that mitigation measures and Emergency response plans are appropriate, potential release scenarios are considered.  Thus, the sections of the RMPlan which discuss both the worst-case and the alternative case, believed to be somewhat more probable, are meant to provide t"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000034044,
      "SummaryText": "Homer City Generation LP\r\n\r\nOperated by \r\nNRG Homer City Services LLC\r\n\r\n\r\nHomer City, PA\r\n\r\nRisk Management Plan\r\n\r\n\r\n\r\n\r\nAECOM \r\n\r\n\r\nApril 2013\r\n\r\nDocument: 02522-016-900-ES\r\n  \r\n\r\n\r\nRISK MANAGEMENT PLAN PURSUANT TO 40 CFR 68(G)\r\n\r\nHomer City Generation LP \r\nHomer City, PA\r\n\r\n\tIntroduction\r\n\r\nHomer City Generation LP, owns the coal-fired Homer City Station,  in Homer City, Pennsylvania, that is subject to U.S. Environmental Protection Agency (U.S. EPA) regulations governing Accidental Release Prevention (ARP) Requirements: Risk Management Programs under Section 112(r) of the Clean Air Act (40 CFR Part 68).  This Risk Management Plan (RMPlan) has been developed in accordance with the requirements specified under 40 CFR Part 68, Subpart G. \r\n\r\nThe RMPlan is comprised of an Executive Summary and Data Elements and has been electronically submitted via the internet through U.S. EPA RMP*eSumit. The Executive Summary of the RMPlan discusses and provides the applicable corporate policies and risk management systems, including accident prevention and Emergency response programs.  The Data Elements provides specific details of the facility's Risk Management Program and includes a set of worst-case and alternative release scenarios and the potential off-site consequences of those releases.  Accompanying the RMPlan submitted to U.S. EPA is a certification that information included in the RMPlan is accurate and complete. \r\n \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\tRISK MANAGEMENT PLAN PURSUANT TO\r\n\t40 CFR 68(G)\r\n\r\n\tEXECUTIVE SUMMARY\r\n\tREVISION LOG\r\n\r\n\r\n\r\nRevision Number                                                                                                             Date\r\n\r\n       0..............................................................................................October 23, 2000\r\n       1.................................................................................................... July 2, 2004\r\n       2........................\tJanuary 28, 2009\r\n       3.................."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000034044,
      "SummaryText": "........\tApril 19, 2013 \r\n \r\nHomer City Generation LP \r\n\t\r\nHomer City, PA\r\n\r\n\t\r\nRisk Management Plan\t\r\n\r\nExecutive Summary\r\n\r\n\r\n\r\n\r\n\r\nAECOM\t\r\n\r\n\r\n\r\nApril 2013\r\nDocument Number: 1003\r\n\r\n \r\n \r\n\r\n\t1.0   ACCIDEN¬TAL PREVENTION AND EMERGENCY RESPONSE POLICY\r\n\r\n1.1 \t Homer City Generation LP Policy on the Environment, Accident Prevention and Emergency Response\r\n\r\nHomer City Generation LP is committed to full compliance and adherence with all applicable laws and regulations regarding environmental protection, accident prevention and Emergency response and the integration of sound environmental practices into business decisions.  To advance this policy, we will:\r\n¿\tEnsure that environmental requirements are routinely assessed and incorporated throughout our business development process.\r\n¿\tSeek opportunities to establish programs to achieve continuous improvement of our environmental performance.\r\n¿\tPeriodically review operations to confirm compliance and adherence with environmental requirements and identify opportunities, where technically and economically feasible, that will 1) reduce risk liabilities, 2) reduce potential environmental impacts, and 3) improve environmental practices.\r\n¿\tAnticipate and respond to community interests and concerns about the actual and potential impact of our operations on safety and the environment.\r\n¿\tEstablish and maintain positive, constructive working relationships with regulators and public policy makers.\r\n¿\tDesign, build, and maintain facilities to ensure that they can be operated in an environmentally sound and safe manner so as to minimize the risk of exposure to employees and the public at large to hazardous materials and in conformity with all governmental regulations and corporate guidelines. \r\n¿\tMaintain a safety and security plan, provide safety training and enforce a safety and security policy.\r\n¿\tEstablish policies and procedures that reconfirm the importance of health and safety and safe operation. \r\n¿\tDevelop programs and s"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000034044,
      "SummaryText": "he data necessary to develop and evaluate possible improvements in the overall safety provided by the programs which constitute the Homer City Generation LP Accidental Release Prevention (ARP) program.   \r\nAs defined by 40 CFR Part 68, a worst-case release of a gas liquefied under pressure is a 10-minute ground-level release of the entire tank contents, taking into account passive and administrative controls that limit the maximum quantity.  The worst-case release scenario for the Homer City facility is a gaseous release from the anhydrous ammonia storage tank dispersed under stable meteorological conditions. The possibility of a worst-case type of scenario is extremely remote and virtually prohibited, given the design of the ammonia storage system and inspection and maintenance measures that Homer City Generation LP has taken as part of its ARP.   The alternative release considers more typical events and accounts for both passive and active mitigation measures.  However, automatic shutoff valves are not considered passive in the present case, and the water deluge system requires Emergency response actions from site personnel, so no credit for these mitigation measures has been taken in the calculation of potential maximum impact areas.   \r\n \r\n\r\nIn accordance with revised Risk Management Plan requirements promulgated on April 9, 2004 and in deference to the concerns of the Department of Homeland Security, this executive summary does not include a detailed description of the release scenarios and their consequences.  Specific information regarding the off-site hazards assessment for worst-case and alternative releases is included in the RMP Data Elements Report provided to the EPA.\r\n\r\n¬¬¬¬\t\t\t\t\t\t\t\t\t\t4.0   ACCIDENT PREVENTION\r\n\r\nThe processes subject to the Risk Management Regulation are also subject to the OSHA PSM Standard with which the Homer City Generation LP facility is in compliance.  PSM governs the same processes and regulated substances at the site that are"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000034044,
      "SummaryText": "ch any abnormal emission of regulated chemicals is observed or suspected.  The incident information is reviewed by supervisory staff and a determination is made as to whether a reportable quantity on any chemical listed as requiring reports to regulatory authorities is involved. If so, the appropriate authorities are promptly notified.\r\n \r\n \r\n6.0   EMERGENCY RESPONSE PROGRAM\r\n\r\nIt is the policy of the Homer City Generation LP to place the highest priority on employee safety and health and on protection of the community from all plant-induced environmental conditions. Experience has shown that proper planning and an organized approach will reduce the effects of Emergency events.  Prompt internal and external communications, Emergency equipment, and trained personnel are the key ingredients of this plan.  Homer City Generation LP's policy provides for external communications with local and county-wide response agencies.  The Indiana County HAZMAT Team has the lead responsibility in responding to major releases of ammonia that would have the potential to affect off-site locations.\r\n\r\n \r\n7.0   PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nHomer City Generation LP, under the RMP program, as well as its existing PSM and earlier Superfund Amendments and Reauthorization Act (SARA) Title III Community Right-to-Know Act compliance programs, has organized its management system to effectively address hazards and potential risks.  Both the advanced planning aspects of process design, operating procedures, Emergency prepared¬ness, and the operational elements of system maintenance, safe operating practices and ongoing personnel training are necessary to support a continual improvement in facility safety.  These programs are all documented so that needed information about the safe handling of all chemicals present at the facility is continuously available to employees."
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000034044,
      "SummaryText": "subject to 40 CFR Part 68. Homer City Generation LP has in-place specific operational programs to address PSM/RMP Prevention Program requirements. These include: \r\n¿\tProcess Safety Information\r\n¿\tProcess Hazards Analysis\r\n¿\tStandard Operating Procedures\r\n¿\tTraining Programs for Operators and Risk Management Training for all Employees\r\n¿\tMechanical Integrity and Preventive Maintenance Program\r\n¿\tManagement of Change Program\r\n¿\tPre-startup Review Procedures\r\n¿\tIncident Investigation and Follow-up Procedures\r\n¿\tSafety Procedures for Contractors\r\n¿\tEmployee Participation Program\r\n¿\tHot Work Permits\r\nIn addition to these programs, Homer City Generation LP has designed and constructed the SCR system to meet stringent safety requirements.  These include:\r\n¿\tContinuous surveillance of tank truck unloading\r\n¿\tPressure relief devices to prevent catastrophic failure of lines and tanks\r\n¿\tAlarms and interlocks to prevent operations outside of operating limits\r\n¿\tAmmonia liquid-level detection systems\r\n¿\tTwo (2) directable water deluge systems (water cannons) can be coordinated to maximize removal of airborne ammonia, if it's released from anywhere in the ammonia storage area\r\n¿\tSpecial liquid and vapor hose fittings to eliminate misconnection during unloading\r\n¿\tVapor return systems to minimize the chance of  fugitive emissions during unloading or maintenance operations\r\n\r\n5.0   FIVE-YEAR ACCIDENT HISTORY\r\n\r\nSince the SCR process started operation in 2000 there has been no accident that qualifies for reporting under the risk management program.  This means that that there has been no incident resulting in the sudden release of ammonia that has caused on-site or off-site injury, significant on-site damage, or any off-site Emergency response or injury.   In conjunction with the current ARP and PSM programs in place at the Homer City Generation LP facility, there is a standard management practice that requires immediate internal reporting of unusual events, including those in whi"
    }
  ]
}