{
  "FacilityID": 1000046318,
  "FacilityName": "Portales Dairy Products, LLC",
  "FacilityStr1": "1820 South Industrial Drive",
  "FacilityStr2": null,
  "FacilityCity": "Portales",
  "FacilityState": "NM",
  "FacilityZipCode": "88130",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35041",
  "LEPC": null,
  "FacilityLatDecDegs": "34.169260",
  "FacilityLongDecDegs": "-103.371925",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 825120603,
  "ParentCompanyName": "Dairy Farmers of America",
  "Company2Name": "Select Milk Producers",
  "CompanyDUNS": 157873659,
  "Company2DUNS": 0,
  "OperatorName": "Portales Dairy Products, LLC",
  "OperatorStr1": "1820 South Industrial Drive",
  "OperatorStr2": null,
  "OperatorCity": "Portales",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "88130",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joey Martin",
  "RMPTitle": "Plant Manager I",
  "FTE": 153,
  "OtherEPAFacilityID": "88130mdmrc1820s",
  "EPAFacilityID": "100000189173",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "P234-R1M1",
  "SafetyInspectionDate": "2010-04-09 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-03-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-09-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-09-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-09-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000057650,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000046318,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000058571,
          "ProcessID": 1000057650,
          "NAICSCode": "311514",
          "_desc": {
            "NAICS_CODE": "311514",
            "NAICS_DESCRIPTION": "Dry, Condensed, and Evaporated Dairy Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000070393,
          "ProcessID": 1000057650,
          "ChemicalID": 56,
          "Quantity": 20600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000570393,
          "ProcessID": 1000057650,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046318,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nGiven the presence of anhydrous ammonia, Portales Dairy Products, LLC has in place a Process Safety Management program to ensure the safety of employees and the general public in the vicinity.  This program addresses items related to the operation of ammonia based refrigeration systems including but not limited to the handling of the chemical, operator training, equipment selection and maintenance, contractor qualifications, preventative maintenance programs, routine and emergency operating procedures and emergency planning and response.  Portales Dairy Products, LLC also has an emergency action plan in effect, which is designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nAmmonia has a strong pungent odor which is detectable at very low concentration levels when released to the atmosphere.  The refrigeration system is designed such that under normal operating conditions, no ammonia is released to the atmosphere.  However, unforeseen circumstances or system upset could lead to leakage of a portion of the ammonia from the system.  Given the strong odor of ammonia, even a small quantity of released ammonia will be detected at some distance from the source of the leak.  Ammonia is detectable by its odor at levels well below that which will raise health concerns.\n\n\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nConstruction of the ammonia refrigeration system expansion project at  Portales Dairy Products, LLC was completed in October 2005.  The facility is located in the city of Portales, New Mexico.  The complex includes processing areas with auxiliary office space.  The ammonia refrigeration system is used to chill glycol and water to provide refrigeration for the facility's processing areas.  The system was constructed in accordance with all applicable federal, state, and lo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046318,
      "SummaryText": "cal regulations.\n\n\n\nDairy Farmers of America purchased the DairiConcepts facility in 2015. At that time, DairiConcepts management had deemed the two ammonia refrigeration systems (25% Glycol System and 40% Glycol System) as separate and independent systems. The systems are connected on the suction side and hot gas side but the valves have been locked closed and there was no intent to ever use the systems as \"combined\". In addition, the equipment for each \"system\" is located in separate engine rooms making this one connection the only common pipeline.\n\n\n\nThe 25% Glycol System exceeds the EPA RMP threshold of 10,000 pounds of ammonia; however, the 40% Glycol System does not (7,600 lbs).\n\n\n\nAfter further review, Dairy Farmers of America management deemed the processes to be \"co-located\" due to this interconnecting line even though the valve was closed and not used.  In addition, new demands, etc. might warrant the need to use the interconnecting pipeline and current management would like the option to use that feature.\n\n\n\nBecause of this potential, Dairy Farmers of America/Portales Dairy Products has decided to register the 40% Glycol System on their existing RMP bringing the total on site charge of ammonia to 20,600 pounds.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nPortales Dairy Products, LLC ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system. \n\n\n\nThe Process Safety Management program ensures that all security and safety procedures are addressed.  Staff are trained in operation, maintenance and emergency procedures related to the operation of the ammonia refrigeration system.  All refrigeration equipment and ammonia vessels are equipped with automatic pressure safety relief devices to prevent pressure build-up beyond safe equipment operation levels.  A preventative maintenance program assures that equipment "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046318,
      "SummaryText": "is maintained and serviced on a regular schedule and that worn, aging, or defective components are replaced as required to maintain equipment in good operating condition.  Controls and safety devices are tested regularly to ensure proper operation.\n\n\n\nPortales Dairy Products, LLC is equipped with an ammonia detection system with sensors located in the 25% Glycol engine room and 40% Glycol engine room.  Both engine rooms have 2 sensors, and at 50 ppm, an audible and visual alarm is activated in the area and the control panel.  The relief valve vent line has one sensor and activates an audible alarm in the area at 235 ppm.\n\n\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nBased on an investigation into the accident history of the facility there has been no reportable releases of ammonia over the past five years (June 2009 - June 2014).\n\n  \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nPortales Dairy Products, LLC has a Response Plan for On-Site Emergency Operations.  This Plan outlines the policies and procedures in place to respond to potential ammonia alarms or releases.  The facility has several trained personnel to assist in an orderly evacuation as well as to diagnose the alarm condition.  \n\n\n\nThe Response Plan for On-Site Emergency Operations includes the facility emergency coordinators, the staff alerting list, emergency notification list, and the hazardous material agency notification and procedures.  This Plan then proceeds to detail the procedures for employees and management in the event of a fire, evacuation, compressor room shut down, blackout, and ammonia release/clean-up.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nA PHA Revalidation was conducted in July 2015, and a compliance audit was recently completed on July 16, 2013.  Recommendations were made to improve the written program and to overall implementation practices.  The Plant Manager is responsible for ensuring these recommendations are implemented.\n\n"
    }
  ]
}