{
  "FacilityID": 1000062889,
  "FacilityName": "BHJ USA, LLC",
  "FacilityStr1": "2516 Edward Babe Gomez Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Omaha",
  "FacilityState": "NE",
  "FacilityZipCode": "68107",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31055",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "41.199698",
  "FacilityLongDecDegs": "-095.949195",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 88385190,
  "ParentCompanyName": "BHJ A/S",
  "Company2Name": null,
  "CompanyDUNS": 305775181,
  "Company2DUNS": 0,
  "OperatorName": "Thomas Bendix-Christensen",
  "OperatorStr1": "2510 E. Babe Gomez Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68107",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lynn Mulder",
  "RMPTitle": "Corporate EHS Manager",
  "FTE": 34,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000207457",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-04-16 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-02-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-05-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-05-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-05-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078842,
      "AltID": "Pet Food Manufacturing",
      "FacilityID": 1000062889,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000080023,
          "ProcessID": 1000078842,
          "NAICSCode": "311111",
          "_desc": {
            "NAICS_CODE": "311111",
            "NAICS_DESCRIPTION": "Dog and Cat Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098223,
          "ProcessID": 1000078842,
          "ChemicalID": 56,
          "Quantity": 10977.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598223,
          "ProcessID": 1000078842,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062889,
      "SummaryText": "BHJ USA, LLC - Omaha, NE\n\nRefrigeration System Risk Management Program\n\n\n\nExecutive Summary\n\n\n\nThis is to inform all interested persons, including employees that BHJ USA, LLC is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals, In this way we promote overall plant, worker, and public safety.  These programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.   Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.  Our safety programs are applied to any activity involving hazardous chemicals including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.  \n\n\n\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\n\n\n\nBHJ USA, LLC is a facility in Omaha, Nebraska which is a pet food processing plant.  The facility operates two ammonia refrigeration systems located at the North end and the South end of the building, both providing cooling and freezing capabilities.\n\nThe North System is operated as a two-stage system.  On the low stage portion of the system, a low temperature accumulator "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062889,
      "SummaryText": "operating at -45?F pumps liquid to plate freezers located in the plate freezer room.  The plate freezers are designed to maintain a -35?F temperature.  The low temperature ammonia liquid flows across the freezer plates where it picks up heat from the product, changing the ammonia from a liquid to a vapor.  The low-pressure ammonia vapor is sent from the plate freezers to the accumulator via a suction header.\n\nVapor from the low temperature accumulator is fed to low stage compressors. The compressed vapor from the low stage compressors is sent to an intercooler operating at +15?F. \n\nVapor from the intercooler is then fed to the high stage compressors.  During the compression phase in the high stage compressors, the temperature of the ammonia vapor will rise as the pressure of the ammonia vapor is increased to approximately 150-180 psig psig. The high-pressure ammonia vapor flows from the high stage compressors to an evaporative condenser where heat is removed, turning the vapor into a high pressure liquid.  The high-pressure liquid is collected in a high-pressure receiver.  The liquid collected in the high-pressure receiver provides liquid make-up for the intercooler and for the accumulators.\n\n\n\nThe South System is operated as a two-stage system with a controlled pressure receiver which is maintained at 80 - 90 psig. The high pressure liquid from the controlled pressure liquid supplies a liquid header which feeds all the evaporators on the south system.  On the low stage, two freezer penthouse units located in Freezer are designed to maintain a -10?F room temperature. The high pressure liquid flows through the coils in the freezer units where it picks up heat from the room and product.  Air from the fans blows across the coils, changing the liquid to a vapor. The low pressure ammonia vapor is sent from the freezer coils to the low temperature accumulator via a suction header.\n\nVapor from the low temperature accumulator is fed to low stage compressors. Any excess liqu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062889,
      "SummaryText": "id that returns from the evaporators is transferred to the controlled pressure receiver via a liquid transfer system. The compressed vapor from the low stage compressors is sent to a high temperature accumulator operating at +15?F. \n\nThere are five air units and one plate chiller connected to the high stage portion of the south system. Two units in the holding cooler are designed to maintain a room temperature of +34?F.  Three units in the processing rooms are designed to maintain a +50?F room temperature. The plate chiller is designed to supply chilled water at +34?F to the processing equipment.  The liquid ammonia flows across the plates and coils where it picks up heat, changing the ammonia from a liquid to a vapor. The low pressure ammonia vapor is sent from the air units and plate chiller to the high temperature accumulator via a common suction header. \n\nVapor from the high temperature accumulator is fed to high stage compressors. Any excess liquid that returns from the evaporators is transferred to the controlled pressure receiver via a liquid transfer system. During the compression phase, in the high stage compressors, the temperature of the ammonia vapor will rise as the pressure of the ammonia vapor is increased to approximately 150 -180 psig. The high pressure ammonia vapor flows from the high stage compressor, to an evaporative condenser where heat is removed, turning the vapor into a liquid. The high pressure liquid is collected in the controlled pressure receiver.\n\n\n\nThe emergency action plan at BHJ USA, LLC requires all associates to be trained in safe evacuation and notification procedures in cases of actual or drill emergencies. Training shall include escape routes, notification of appropriate response agencies, instructions on activating a building fire alarm system and what should be done after evacuating a building. The evacuation alarm and emergency evacuation procedures will be tested no less than once per year. The decision of when to practice "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062889,
      "SummaryText": "evacuating the building will rest with the Plant Manager, Mike Powers. Arrangements have been made to coordinate BHJ USA, LLC's Emergency Action Plan and applicable emergency services with the following local agencies:\n\n\n\nDouglas- County LEPC \n\n402-444-5040\n\n\n\nOmaha Police Department\n\n402-444-5600\n\n\n\nOmaha Fire Department\n\n402-444-5700\n\n\n\nUpon discovering an emergency situation, all employees shall immediately notify their shift supervisor or the Maintenance Department using the phone, vocally or wireless phones. The supervisor of the affected area should immediately contact the shift Maintenance personnel to determine if evacuation of the plant is the safest course of action.  If the emergency involves the release of ammonia and a decision is made to evacuate the plant, the Maintenance Department will notify the Shift Supervisor. The shift supervisor will sound an evacuation alarm, and then determine the assembly area.  The location of the assembly area will be based on the current wind direction and will be upwind of the release area and will be relayed to the Employees.  If your immediate contact options cannot be reached, dial 911.  In the event of an evacuation, all employees should proceed to the designated assembly area and await further instructions from their evacuation supervisor.  Once everyone has evacuated the facility and arrived at their designated meeting area, a head count must be conducted by the Shift Supervisor to account for missing people, including visitors and/or contractors in his/her area. \n\nMaintenance employees who work with the ammonia system or respond to releases are allowed to work with the Haz Mat personnel to take offensive actions to stop a release. In the event of an emergency release of ammonia it will be necessary for some specifically assigned and properly trained employees to remain in work areas that are being evacuated long enough to perform critical operations. Before a maintenance employee enters a release area, they must "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000062889,
      "SummaryText": "first test the concentration of the release by using an ammonia detector. They must also operate in pairs. If the isolation is their within reasonable capabilities they may isolate the leak and shut down the system if needed.\n\n\n\nIn response to an ammonia release, BHJ USA, LLC will not respond to releases of hazardous chemicals in an offensive manner. The facility does not have any employees trained at the HAZMAT Technicians or First Responders Operations Level.  However, in the case of a minor ammonia release, designated maintenance personnel are allowed to isolate or maintain the release.\n\n\n\nBHJ USA, LLC has not had any accidental releases to report since the commissioning of the plant.\n\n\n\nThe worst case release scenario would be failure of the high pressure receiver in the north engine room releasing 7,911 lbs of ammonia (the entire charge) for duration of ten minutes. The receiver is able to hold more than the total charge.  Under worst-case weather conditions, ammonia could travel 1.1 miles before dispersing enough to no longer pose a hazard to the public.  This scenario is unlikely for the following reasons:    \n\n&#61607;Worst case weather conditions are uncommon,\n\n&#61607;Industry standards for the manufacture and quality control of pressure vessels\n\n&#61607;Ammonia is not corrosive in this service\n\n&#61607;Pressure safety valves limit operating pressure in this vessel\n\n&#61607;The accident prevention program in place at the facility including the mechanical integrity program for regular maintenance, inspection and testing and replacement of equipment, if necessary\n\n&#61607;Installed ammonia sensors in the system to warn of leaks\n\n&#61607;Alarms in place to warn operating personnel of process upsets\n\n&#61607;The emergency response plan and equipment in place at the facility\n\n"
    }
  ]
}