{
  "FacilityID": 1000075302,
  "FacilityName": "Markwest Hopedale Fractionator",
  "FacilityStr1": "46700 Giacobbi Road",
  "FacilityStr2": null,
  "FacilityCity": "Jewett",
  "FacilityState": "OH",
  "FacilityZipCode": "43986",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39067",
  "LEPC": "Harrison County LEPC",
  "FacilityLatDecDegs": "40.332369",
  "FacilityLongDecDegs": "-80.936484",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.markwest.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "MarkWest Ohio Fractionation Company, L.L.C.",
  "Company2Name": "MarkWest Energy Partners, L.P.",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Rick Kline",
  "OperatorStr1": "46700 Giacobbi Road",
  "OperatorStr2": null,
  "OperatorCity": "Jewett",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43986",
  "OperatorZipCodeExt": null,
  "FTE": 110,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000223607",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "Pending",
  "SafetyInspectionDate": "2014-05-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-04-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000093759,
      "AltID": "NGL Fractionation",
      "FacilityID": 1000075302,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000117316,
          "ProcessID": 1000093759,
          "ChemicalID": 155,
          "Quantity": 197000000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000102292,
              "ProcessChemicalID": 1000117316,
              "ChemicalID": 137
            },
            {
              "FlamMixChemID": 1000102293,
              "ProcessChemicalID": 1000117316,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000102294,
              "ProcessChemicalID": 1000117316,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000102295,
              "ProcessChemicalID": 1000117316,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000102296,
              "ProcessChemicalID": 1000117316,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000102297,
              "ProcessChemicalID": 1000117316,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000102298,
              "ProcessChemicalID": 1000117316,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000102299,
              "ProcessChemicalID": 1000117316,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000095041,
          "ProcessID": 1000093759,
          "NAICSCode": "21113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000079875,
              "Process_NAICS_ID": 1000095041,
              "SafetyReviewDate": "2018-10-16 00:00:00",
              "PHA_Date": "2018-12-14 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-12-15 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "Fire Eyes",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-12-15 00:00:00",
              "TrainingReviewDate": "2018-12-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-01-31 00:00:00",
              "EquipmentInspectionDate": "2017-08-07 00:00:00",
              "EquipmentTested": "Multiple & Various",
              "ChangeMgmtDate": "2017-07-28 00:00:00",
              "ChangeMgmtReviewDate": "2017-01-31 00:00:00",
              "PreStartupReviewDate": "2017-07-31 00:00:00",
              "ComplianceAuditDate": "2016-08-04 00:00:00",
              "AuditCompletionDate": "2017-01-30 00:00:00",
              "IncidentInvestigationDate": "2017-05-22 00:00:00",
              "InvestigationChangeDate": "2017-06-30 00:00:00",
              "ParticipationPlansReviewDate": "2017-01-31 00:00:00",
              "HotWorkPermitReviewDate": "2017-01-31 00:00:00",
              "ContractorSafetyReviewDate": "2017-01-31 00:00:00",
              "ContractorSafetyEvalDate": "2017-01-31 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000099272,
                  "PreventionProgram3ID": 1000079875,
                  "ProcessChemicalID": 1000117316
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000075302,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Harrison County LEPC",
    "CoordinatingAgencyPhone": "7409423922",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075302,
      "SummaryText": "EXECUTIVE SUMMARY - MARKWEST OHIO FRACTIONATION COMPANY, L.L.C HOPEDALE FRACTIONATOR\n\n\n\nThe MarkWest Ohio Fractionation Company, L.L.C. (MarkWest) Hopedale Fractionator facility has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, facility trained personnel will respond to control and contain the release. \n\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES \n\n\n\nThe Hopedale Fractionator is located in Jewett, Ohio. Its primary function encompasses the fractionation of natural gas liquids (NGLs). The NGL stream is separated into purity products of Propane, Iso-Butane, N-Butane, and Natural Gasoline, which consists of Iso-Pentane, N-Pentane, and 2,2-Dimethylpropane amongst additional non-flammable components. Ethyl Mercaptan is also stored at the site and is used as an odorant in some propane shipments.\n\n\n\nThe NGLs are received through NGL pipelines to the facility. They are separated using extraction towers with specific heats and pressures to isolate each purity product. Once separated the products are stored in storage tanks at the site awaiting shipment via pipeline, truck or rail.\n\n\n\nThe total quantity of product stored in the vessels and the total of each substance over the threshold for RMP substances has been calculated in a separate document that is available for review but is not included in this summary as it may contain confidential business information. \n\n\n\nAs stated above the products at the Hopedale Fractionator contain propane, butanes, pentanes, and heavier hydrocarbon components. Methane and ethane are removed from the NGL stream prior to it reaching this plant. The regulated flammable substanc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075302,
      "SummaryText": "es include the same propane through pentane components. This facility does not handle regulated toxic substances above their threshold quantities and there are no toxic release scenarios to consider.\n\n\n\nWORST-CASE AND ALTERNATIVE CASE RELEASE SCENARIOS\n\n\n\nThe parameters of the offsite consequence analyses for this MarkWest facility were based on the\n\nrequirements set forth in the RMP rules outlined in 40 CFR 68.25 (e) for flammable worst-case release scenario, and 40 CFR 68.28 for the alternative release scenario analysis. The worst case and alternative case radii to endpoint were determined utilizing RMP*Comp software provided by the EPA. In evaluating the worst-case and alternative-case scenarios there were no administrative controls or mitigation measures taken into account to reduce potential off-site impact. Populations within each radius were determined using the Missouri Census Data Center.\n\n\n\nSeveral vessels within the facility process were evaluated for their release scenarios.  Results of the worst-case release scenarios indicate that the process is subject to Risk Management Program (RMP) Program Level 3 requirements.  Details of the worst-case release scenarios and alternate release scenario are included with the backup documentation associated with this RMP Plan\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM \n\n\n\nThe following is a summary of the accident prevention program in place for the process at the facility. Because the process at the facility that are regulated by the Environmental Protection Agency's (EPA's) risk management program (RMP) regulation are also subject to the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the Program Level 3 accident prevention program. \n\n\n\nProcess Safety Information \n\n\n\nMarkWest Ohio Fractionation Company, L.L.C., keeps a variety of technical documents "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075302,
      "SummaryText": "that are used to help maintain safe operation of the processes. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. The reference documents are maintained on file at the facility to provide open access.\n\n\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety data sheets (SDS's). This information is supplemented by documents that specifically address known corrosion concerns and known hazards associated with the inadvertent mixing of chemicals. For the process, the facility has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in key process parameter documents. The facility ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n\n\n\nThe facility also maintains numerous technical documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised. \n\n\n\nProcess Hazard Analysis (PHA) \n\n\n\nMarkWest Ohio Fractionation Company, L.L.C., has a comprehensive program to help ensure that hazards associated with the process are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. \n\n\n\nMarkWest Ohio Fractionat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000075302,
      "SummaryText": "ion Company, L.L.C., will use one or more of the following techniques to identify hazards: what-if, checklist, what-if/checklist, hazard and operability (HAZOP), failure mode and effects analysis (FMEA), or fault tree analysis (FTA). HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques and will be utilized for each major process change or renovation. The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. \n\n\n\nEach PHA will address the following: \n\n1) hazards of the process, \n\n2) previous incidents with likely potential for catastrophic consequences, \n\n3) consequences of failure of engineering and administrative controls, \n\n4) engineering and administrative control applicable to the hazards and their inter-relationships, \n\n5) facility siting issues, and \n\n6) human factors. \n\n\n\nThe PHA team findings are compiled in a written report and are forwarded to local and corporate management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team. This ranking helps ensure that potential accident scenarios assigned that highest risk receive immediate attention. Approved mitigation options in response to PHA team findings are tracked until they are completed. The final resolution of each finding is documented and retained. \n\n\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the facility periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every five years and will be conduct"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000075302,
      "SummaryText": "ed at this frequency until the process is no longer operative. The results and findings from these updates are documented and retained. Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained. \n\n\n\nOperating Procedures \n\n\n\nMarkWest Ohio Fractionation Company, L.L.C., maintains written procedures that address various modes of operations, such as: unit startup; normal operations; temporary operations; emergency shutdown; normal shutdown; emergency operations, startup after a turn around, and initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed and annually certified as current and accurate. The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process. The operating procedures are centrally located and accessible to employees. \n\n\n\nTraining \n\n\n\nTo complement the written procedures for process operations, the Hopedale Fractionator has implemented a comprehensive training program for the employees involved in operating a process. New employees receive basic training in facility operations unless they provide written certification that they have the required knowledge, skills and abilities to safely carry out their specific duties and responsibilities. MarkWest employees the Hopedale Fractionator will be trained in PSM/RMP requirements upon hire and prior to working in PSM/RMP processes. Operations employees will undergo refresher training at least every three years. A training attendance record will be kept for training activities and a verification of understanding will be conducted by a performance evaluation or through testing. \n\n\n\nMechanical Integrity \n\n\n\nMarkWest Ohio Fractionation Company, L.L.C., has well-established practices and procedures to main"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000075302,
      "SummaryText": "tain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: training; written procedures; inspections and tests; correcting identified deficiencies; and applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process. \n\n\n\nMaintenance personnel receive training on an overview of the process, safety and health hazards, applicable maintenance procedures, emergency response plans, and applicable safe work practices to help ensure that they can perform their jobs in a safe manner. Job plans/written procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment. \n\n\n\nAnother integral part of the mechanical integrity program is quality assurance. The Hopedale Fractionator incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made. \n\n\n\nManagement of Change \n\n\n\nMarkWest Ohio Fractionation Company, L.L.C., has a comprehensive system to manage changes to the covered processes. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before be"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000075302,
      "SummaryText": "ing implemented. Changes are reviewed to ensure that adequate controls are in place to manage new hazards and to verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, process operators, maintenance personnel, or any other employees whose job tasks are affected by a modification in process conditions are promptly made aware of and are trained on the specifics of the modification. \n\n\n\nPre-startup Safety Reviews (PSSRs) \n\n\n\nMarkWest Ohio Fractionation Company, L.L.C., conducts a PSSR for a new facility or facility modification that requires a change in the process safety information. The PSSR confirm that construction was completed in accordance with design specifications, that safety, operating, maintenance, and emergency procedures are in place and are adequate. The PSSR will be reviewed and appropriately updated during the management of change process. The PSSR will ensure that: modifications were installed as described; no other changes were made outside the original scope of work; operating procedures have been modified and communicated to operating and maintenance personnel; necessary tests have been completed prior to start-up; site safety, fire protection, and environmental issues have been addressed; the startup plan has been reviewed; pertinent drawing have been red-lined or updated to as-built requirements; vendor files have been updated; and training of affected personnel has been performed and documented. Ultimately, these reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits \n\n\n\nTo help ensure compliance with the RMP, MarkWest Ohio Fractionation Company, L.L.C., periodically conducts an audit to determine whether the procedures and pr"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000075302,
      "SummaryText": "actices required by the accident prevention program are being implemented. Compliance audits are conducted at least every three years. Team membership will include at least one person knowledgeable of the system being audited. One member of the team must be qualified to lead the audit and be familiar with the auditing protocol being administered. The Plant will maintain a listing of non-conformances identified during an audit and document closure of compliance audit action items. The two most recent audit reports will remain on file with the documentation of closed items.\n\n\n\nIncident Investigation \n\n\n\nMarkWest Ohio Fractionation Company, L.L.C.., promptly investigates incidents that resulted in, or reasonably could have resulted in, a fire/explosion, release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts, determine what error states led to the incident and to develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team consists of the immediate supervisor, one person knowledgeable in the process, and other members with appropriate experience to investigate and analyze the incident. The team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to facility management for resolution. Corrective actions that are identified will be promptly addressed, resolved and tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with facility employees (including contractors) whose job tasks are relevant to the investigation. Incident investigation reports are retained for at least five years so that the reports can be reviewed during PHAs and PHA revalidations. \n\n\n\nEmployee Participation \n\n\n\nMarkWest Ohio Fractionation Company, L.L.C., encourages employees to participate in the facets of process safety management and acc"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000075302,
      "SummaryText": "ident prevention. Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a PHA team. Employees will be provided with the information created as part of the facility accident prevention program. Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the facility. Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.\n\n\n\nHot Work Permit \n\n\n\nMarkWest Ohio Fractionation Company, L.L.C., uses a hot work permit for hot work operations including grinding, welding, and spark producing activities conducted on or near a covered process. The hot work permit documents the fire prevention and protection requirements prior to beginning hot work operations. The permit indicates the days on which hot work may be performed and the object upon which hot work is to be performed. Hot work permits are kept in a place that is easily accessible for the workers and on file at the office until the completion of hot work operations. \n\n\n\nSafe Work Practices\n\n\n\nMarkWest Ohio Fractionation Company, L.L.C. has long-standing safe work practices as mandated by OSHA, Industrial Standards, and Good Engineering Practice in place to help provide employee, public and process safety.\n\n\n\nContractors \n\n\n\nThe Hopedale Fractionator uses contractors to supplement its workforce during periods of increased or specialized maintenance or construction activities. Because some contractors work on or near process equipment, the plant has procedures in place to ensure that contractors: perform their work in a safe manner; have the appropriate knowledge and skills; are aware of the hazards in their workplace; understand what they should do in event of an emergency; understand and follow site safety rules; and inform facility personnel of the hazards that they find "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000075302,
      "SummaryText": "during their work. This is accomplished by providing contractors with: a process overview; information about potential fire, explosion, or toxic release hazards; emergency response plan requirements; and safe work practices prior to their beginning work. In addition, the Hopedale Fractionator will only select contractors who submit certification that employees are trained in specifics and safe work practices associated with their job, and that provide safety performance documentation from the previous three years. Finally, facility personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations. \n\n\n\nCHEMICAL-SPECIFIC PREVENTION STEPS \n\n\n\nThe processes at the Hopedale Fractionator have hazards that must be managed to ensure continued safe operation. The following is a description of existing safely features applicable to prevention of accidental releases of regulated substances in the facility. \n\n\n\nUniversal Prevention Activities \n\n\n\nThe accident prevention program summarized previously is applied to the RMP-covered process at the Hopedale Fractionator. Collectively, these prevention program activities prevent or mitigate potential accident scenarios that could be caused by equipment failures and human errors. \n\n\n\nSpecialized Safety Features\n\n\n\nThe Hopedale Fractionator has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following types of safety features are used in the covered process: \n\n\n\nRelease Detection \n\n1) Hand-held hydrocarbon detectors operated by facility personnel. \n\n2) Personnel are on site 24 hours a day, seven days a week. \n\n\n\nRelease Containment/Control \n\n1) Process relief valves that discharge to a flare to capture and incinerate episodic releases. \n\n2) Valves to permit isolation of the process (manual and automated). \n\n3) Automated shutdown systems for specific process parameters (e."
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000075302,
      "SummaryText": "g., high temperature) \n\n4) Curbing or dykes to contain liquid releases. \n\n5) Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system). \n\n\n\nRelease Mitigation \n\n1) Trained emergency response personnel. \n\n2) Personal protective equipment (e.g., chemical protective clothing). \n\n\n\nFIVE-YEAR ACCIDENT HISTORY \n\n\n\nMarkWest has had an excellent record of preventing accidental releases over the last five years.\n\nDue to stringent release prevention policies, there have been no accidental releases during this\n\nperiod. \n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION \n\n\n\nThe Hopedale Fractionator is a Non-Responding Facility as per 48 CFR 68.90(b).  The facility maintains a written emergency action plan, which is in place to help protect employees and public safety as well as the environment.  The plan identifies steps to be taken in case of an accidental release including: evacuation plans, accounting for personnel after an evacuation, and notification of company staff, local emergency response agencies, and the public if a release occurs.  However, facility personnel are not trained to be first responders to large fires and should a release occur from one of the vessels the Hopedale Fractionator would rely on the local fire department to respond.  \n\n\n\nEmployees receive training in the procedures to be followed when certain employees must remain to operate critical process operations before they evacuate.  The Hopedale Fractionator has around the-clock communications capability with appropriate emergency response organizations (Fire Department, Police and Sheriff's Office).  This interface provides the means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\n\n\n\nThe overall emergency response program for the Hopedale Fractionator is coordinated with the Harrison County Local Emergency Planning Committee (LEPC). This coordination includes periodic meetings of the committee, which i"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000075302,
      "SummaryText": "ncludes local emergency response officials, local government officials, and industry representatives. The Hopedale Fractionator has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. In addition to periodic LEPC meetings, the Hopedale Fractionator conducts periodic emergency drills that involve the LEPC and emergency response organizations, and the facility provides annual refresher training to local emergency responders regarding the hazards of regulated substances in the facility. \n\n\n\nMANAGEMENT SYSTEM\n\n\n\nThe Safety Coordinator has overall responsibility for the development, implementation, and integration of the risk management program. Specific responsibilities are summarized in the supporting documentation associated with this RMP Plan.  \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY \n\n\n\nThe Hopedale Fractionator resolves the findings from PHAs, some of which result in modifications to the process. Currently, there are no findings to report.\n\n\n\nMarkWest Ohio Fractionation Company, L.L.C., believes that diligent compliance with our PSM Program forms the framework that allows for the continued improvement to the level of safety at the Hopedale Fractionator.  Some of the key components of the program that will help maintain and, where applicable, improve safety are:\n\n\n\nThe Management of Change provisions ensure that the Hopedale Fractionator considers the potential safety and health impacts of each change made to chemicals, technology, equipment or procedures.\n\n\n\nThe PHA provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in safety standards. \n\n\n\nThe Mechanical Integrity provisions ensure that equipment and instrumentation are designed, constructed, installed, and maintained to minimize the "
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000075302,
      "SummaryText": "risk of hazardous release thereby serving as an integral part to the safety program.\n\n\n\nInternal and third-party compliance audits will ensure that the Hopedale Fractionator maintains and increases the level of safety protection.\n\n\n\nDOCUMENTATION OF CALCULATIONS WILL BE PROVIDED UPON REQUEST"
    }
  ]
}