{
  "FacilityID": 1000079927,
  "FacilityName": "SIMPLOT GROWER SOLUTIONS - TULARE",
  "FacilityStr1": "4295 AVENUE 228",
  "FacilityStr2": null,
  "FacilityCity": "TULARE",
  "FacilityState": "CA",
  "FacilityZipCode": "93274",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.202683",
  "FacilityLongDecDegs": "-119.47785",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.simplot.com",
  "FacilityEmailAddress": "josh.jordan@simplot.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "J.R. SIMPLOT COMPANY",
  "Company2Name": null,
  "CompanyDUNS": 9073503,
  "Company2DUNS": 0,
  "OperatorName": "SIMPLOT GROWER SOLUTIONS",
  "OperatorStr1": "205 E. River Park Circle",
  "OperatorStr2": "Suite 210",
  "OperatorCity": "Fresno",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93720",
  "OperatorZipCodeExt": "1571",
  "RMPContact": "Troy Bolt",
  "RMPTitle": "VP & GM Agribusiness Retail",
  "FTE": 3,
  "OtherEPAFacilityID": "CAD046521555",
  "EPAFacilityID": "100000042517",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-12-15 00:00:00",
  "SafetyInspectionBy": "Tulare County Environmental Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-01-14 00:00:00",
  "DeRegistrationEffectiveDate": "2019-08-26 00:00:00",
  "AnniversaryDate": "2024-06-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.20287,
  "FRS_Long": -119.47682,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "4",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099778,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000079927,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101017,
          "ProcessID": 1000099778,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125006,
          "ProcessID": 1000099778,
          "ChemicalID": 56,
          "Quantity": 140000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625006,
          "ProcessID": 1000099778,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079927,
      "SummaryText": "SIMPLOT GROWER SOLUTIONS - TULARE CALIFORNIA\n\nEXECUTIVE SUMMARY\n\n\n\nThe purpose of the facility Ammonia Process Safety and Risk Management Plan is to prevent the accidental release of anhydrous ammonia into the workplace, the surrounding community, and the environment, and to set forth procedures to control and mitigate a release if one was to occur.   It is the policy of the J. R. Simplot Company to manufacture, handle, transport, store, and dispose of all substances safely and in compliance with the requirements of federal, state, and local environmental, health, & safety laws, while reducing the risks to human health, safety, and the environment.  This policy applies to all groups, divisions, operations, and departments of the J. R. Simplot Company, including the Simplot Grower Solutions (SGS) facility located at 4295 Avenue 228, Tulare County, Tulare California.  Facility management is expected to implement, and all employees are expected to comply with, the spirit and letter of this policy.\n\n\n\nSGS Tulare is an agricultural retail store, providing ag-related products and services to area farmers.  The facility stores and handles bulk liquid fertilizers and performs custom liquid fertilizer blending.  The regulated substance stored and handled at this location is anhydrous ammonia (NH3).  NH3 is received via tank truck, and is offloaded into one of two interconnected pressurized storage vessels.  The ammonia is then loaded into 1,000-gallon nurse trailer tanks for delivery to area farmers as nitrogen fertilizer.\n\n  \n\nThe worst-case release scenario for the facility is a catastrophic failure of an 18,000-gallon anhydrous ammonia pressure storage tank.  This event would result in an uncontrolled release with a calculated distance to the toxic endpoint of 5.1-miles.  The worse-case scenario is unlikely to occur because of the safety margin built into the design code for pressure vessel construction, and because of protective devices and procedures in place to prevent"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079927,
      "SummaryText": " a release.  The alternate release scenario is rupture of an ammonia transfer hose in which ammonia is released for a period of 1-minute before safety design features or human intervention stop the flow.  Mitigation systems for stopping the flow include nitrogen-activated emergency shut off valves, break-away couplers, and inline excess flow valves.   In this case, a total of 464-lbs. of ammonia is released with a calculated distance to the toxic endpoint of 0.4-miles. The surrounding area is rural with farm fields, scattered residences, and a few schools and small commercial sites.\n\n    \n\nThe facility Plan complies with the U.S. EPA Risk Management regulations under 40 CFR 68, and the California Accidental Release Prevention Program regulations under 19 CCR Division 2 Chapter 4.5.  The covered process is subject to Program 2 requirements.  The Plan references Industrial standards, including ANSI/CGA G-2.1 - 2014, \"Requirements for the Storage and Handling of Anhydrous Ammonia\", 6th Edition.  The facility utilizes advancements in equipment and technology to improve safety and prevent the release of ammonia.  For example, a nitrogen-activated emergency shut-off system was installed to isolate ammonia within storage in case of a release.  This system can be activated locally at workstations or remotely at a safe distance.  Breakaway coupling and shear devices are installed on transfer hoses to prevent an ammonia release caused by a drive-away tank truck or nurse tank trailer.  Another key practice at this facility is ammonia training. Operators receive classroom and field training, and are certified by management.  Operators are involved in reviewing and updating standard operating procedures.  In addition, all employees receive ammonia general awareness training.\n\n\n\nDuring the past 5 years, the facility has had no accidental releases of anhydrous ammonia that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079927,
      "SummaryText": "uations, sheltering in place, property damage, or environmental damage.\n\n  \n\nThe facility has an emergency response plan that provides evacuation procedures and notification contact information.  Employees receive annual training on the plan and periodically participate in evacuation drills.  The facility hazmat response team is qualified to respond up to Level C, but does not have the training or equipment to respond to a large uncontrolled release of anhydrous ammonia.  In this case, Tulare County Fire Department would serve as the primary emergency responder.  As process changes occur, facility management will contact the Tulare County Fire Department to coordinate emergency response plans as needed.\n\n\n\nThrough our ongoing implementation of the Prevention Program elements of the PSM/RMP plan, the SGS Tulare facility looks continuously for possible process modifications and administrative changes that will improve safety and prevent releases.      \n\n"
    }
  ]
}