{
  "FacilityID": 1000045013,
  "FacilityName": "Formosa Plastics Corporation, Delaware",
  "FacilityStr1": "780 Schoolhouse Road",
  "FacilityStr2": null,
  "FacilityCity": "Delaware City",
  "FacilityState": "DE",
  "FacilityZipCode": "19706",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "10003",
  "LEPC": "New Castle LEPC",
  "FacilityLatDecDegs": "39.586041",
  "FacilityLongDecDegs": "-075.649369",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "fpcusa.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 106238223,
  "ParentCompanyName": "Formosa Plastics Corporation USA",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Formosa Plastics Corporation DE",
  "OperatorStr1": "P.O. Box 320",
  "OperatorStr2": null,
  "OperatorCity": "Delaware City",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19706",
  "OperatorZipCodeExt": null,
  "FTE": 98,
  "OtherEPAFacilityID": "19706frmspschoo",
  "EPAFacilityID": "100000127631",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "AQM00300027",
  "SafetyInspectionDate": "2016-11-09 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-01-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-12-10 00:00:00",
  "DeRegistrationEffectiveDate": "2017-09-30 00:00:00",
  "AnniversaryDate": "2019-06-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.586111,
  "FRS_Long": -75.649439,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055737,
      "AltID": "PVC Resins Manufacturing",
      "FacilityID": 1000045013,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068016,
          "ProcessID": 1000055737,
          "ChemicalID": 29,
          "Quantity": 240000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000068017,
          "ProcessID": 1000055737,
          "ChemicalID": 101,
          "Quantity": 1275000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000056666,
          "ProcessID": 1000055737,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000046618,
              "Process_NAICS_ID": 1000056666,
              "SafetyReviewDate": "2011-03-09 00:00:00",
              "PHA_Date": "2015-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-12-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-11-14 00:00:00",
              "TrainingReviewDate": "2014-05-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-06-03 00:00:00",
              "EquipmentInspectionDate": "2014-06-02 00:00:00",
              "EquipmentTested": "DT300B, DE303A/B/C",
              "ChangeMgmtDate": "2014-06-18 00:00:00",
              "ChangeMgmtReviewDate": "2014-01-08 00:00:00",
              "PreStartupReviewDate": "2014-01-06 00:00:00",
              "ComplianceAuditDate": "2014-04-14 00:00:00",
              "AuditCompletionDate": "2014-12-31 00:00:00",
              "IncidentInvestigationDate": "2014-06-03 00:00:00",
              "InvestigationChangeDate": "2014-07-15 00:00:00",
              "ParticipationPlansReviewDate": "2013-08-16 00:00:00",
              "HotWorkPermitReviewDate": "2013-10-10 00:00:00",
              "ContractorSafetyReviewDate": "2014-05-14 00:00:00",
              "ContractorSafetyEvalDate": "2017-01-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000056449,
                  "PreventionProgram3ID": 1000046618,
                  "ProcessChemicalID": 1000068016
                },
                {
                  "PrimaryKey": 1000056450,
                  "PreventionProgram3ID": 1000046618,
                  "ProcessChemicalID": 1000068017
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000045013,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-03-27 00:00:00",
    "ERTrainingDate": "2014-05-27 00:00:00",
    "CoordinatingAgencyName": "New Castle County LEPC",
    "CoordinatingAgencyPhone": "8662740884",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045013,
      "SummaryText": "FPC-DE Executive Summary\r\n\r\n\r\nA. The accidental release prevention and emergency response policies at your facility\r\n\r\nDescribe your facility's overall approach to chemical safety.  You may want to include any corporate policies (if applicable) and an overview of senior management commitment to safety and implementation of safe procedures.\r\n\r\nAt Formosa Plastics Corporation, Delaware we are committed to providing a safe and healthy work environment to our employees.  In an effort to accomplish this goal the facility has implemented policies and procedures to ensure the safe operation of the facility. The facility has also developed an environmental management system and is certified to the ISO14001-2004 standard. \r\n\r\nFormosa Plastics DE has implemented a process safety program that includes:\r\nA¿\tIdentification and development of process safety information\r\nA¿\tThe development and implementation of a mechanical integrity program, which requires inspections and testing of affected equipment. \r\nA¿\tThe training, certification, and continued recertification of employees who operate the regulated processes.\r\nA¿\tRoutine third party compliance audits\r\nA¿\tScheduled hazard analysis of all regulated processes\r\n\r\n\r\nAlso in order to maintain a high level of performance in the process safety program , all changes made to regulated processes must go through a through a Management of Change review and approval procedure. This procedure requires that all changes whether to equipment, process parameters, procedures, or the chemicals used on site be reviewed for the changeA¿s impact on all areas of process safety. \r\n\r\nAs a final step to ensuring the safety to our employees and to the surrounding community, routine compliance audits are conducted by the EHS Department, Shift Supervisors and Hourly Employees.  These audits are in addition to compliance audits and are designed to ensure that the procedures are effective at controlling potential hazards and ensuring that the procedures are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045013,
      "SummaryText": "being properly followed.\r\n\r\n \r\nIn the event that an emergency condition were to develop the siteA¿s emergency response plan would be activated and the shift supervisor would act as the incident commander. Should the site require outside assistance 911 would be called.  At this point the fire chief would serve as the incident commander with extensive consultation being made with the site shift supervisor.  Through this team effort the emergency would be controlled quickly and safely.\r\n\r\nB. Your facility and the regulated substances handled \r\n\r\nProvide a description of your facility so that the public has a clear picture of the facility, its processes, and products.  Describe the primary activities at the facility (e.g., manufacturer of polyethylene, pulp mill, etc.) and the regulated substances used.  In addition, you may want to mention the quantities of these substances handled or stored at your facility.\r\n\r\nFACILITY DESCRIPTION\r\n\r\nThe first sections of the Delaware City PVC plant were built in 1966 by Stauffer Chemical Co. The facility was acquired in 1981 by the Formosa Plastics Corporation USA.  The current plant property line covers 112 acres of which approximately 30 acres is leased as farmland.  The site employs 100 full-time employees.  The major components of the facility involve two PVC Polymerization units, two dryer units, an automatic bagging plant, waste water treatment plant, and the finished goods warehouse.  The plant production capability is 180 tons of PVC Resin per day. \r\n\r\nPRIMARY ACTIVITIES:\r\n\r\nThe primary activities carried out at the facility involve polymerization of Vinyl Chloride and Vinyl Chloride / Vinyl Acetate Copolymers, drying of PolyVinyl Chloride, Packaging of PolyVinyl Chloride, Storage and Shipping of PolyVinyl Chloride, and treatment of process waste water.\r\n\r\nREGULATED SUBSTANCES:\r\n\r\nVinyl Chloride - Three 425,000 pound storage tanks\r\n\r\nVinyl Acetate - One 240,000 pound storage tank\r\n\r\nPRODUCTION PROCESS:\r\n\r\nThe facility produ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045013,
      "SummaryText": "ction process involves converting Vinyl Chloride to PolyVinyl Chloride Dispersion Resins and Specialty Resins.  In order to produce PolyVinyl Chloride, vinyl chloride is received in rail cars and unloaded into storage tanks.  From the storage tanks the vinyl chloride is then transferred into reactors.  Then under controlled temperature and pressure conditions in a water medium, the vinyl chloride molecules are linked together to form long chains.  These long chains are called polymerized vinyl chloride or PolyVinyl Chloride.\r\n\r\n \r\nIn order to produce copolymer resins, an additional raw material, vinyl acetate is used at the facility.  The use of this raw material allows the production of co-polymers with vinyl chloride.  These products provide improved fusion rate properties which allow users to process the resin at lower operating temperatures.  After the PolyVinyl Chloride is created it is then dried through a natural gas fired dryer.  The dried material is then deagglomerated and transferred into storage silos.  From the storage silos the final product is packaged and stored in our finished goods warehouse from where it is transported to our customers.\r\n\r\nAs part of the reaction process a large volume of water is required.  Water that is not evaporated during the drying process and storm water that falls on site is treated through the facilityA¿s waste water treatment plant prior to final discharge through the plant outfall to the Delaware River.\r\n\r\nFinal products produced at the Delaware City plant are used for medical examination gloves, adhesives, carpet backing, floor covering, automotive sealants and upholstery, bottle cap seals, traffic safety cones, automotive air filter gaskets and many other useful finished products.\r\n\r\nC. The worst case release scenario(s) and the alternative release scenario(s)\r\n\r\nDescribe each of your release scenarios and indicate whether the release has offsite impact, if applicable.  You may want to indicate whether you used the OC"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045013,
      "SummaryText": "A Guidance, an industry specific guidance, or conducted your own modeling.\r\n\r\nFor the worst case, if your analysis considers administrative controls that limit the quantity released to below the maximum capacity of the largest vessel, you must identify both the amount of the reduction and the control mechanisms (e.g., \"Written operating procedures and high level alarms prevent more than 6,000 gallons from being present in the 10,000 gallon tank.\").  In addition, if you considered passive mitigation measures in your analysis, you must identify both the mitigation systems in use and their effect (e.g., \"A concrete dike around the tank limits the exposed surface area of a pool and thus reduces the release rate to X.\").  You may also want to discuss any systems or procedures you have that make a worst case release unlikely.  \r\n\r\nWORST CASE RELEASE SCENARIO:\r\n\r\nFLAMMABLE WORST CASE:\r\n\r\n \r\nThe worst case flammable incident that could occur at the facility involves the release of Vinyl Chloride.  The scenario that was chosen was to consider the impact on the community if one of the storage tanks were to develop a leak and explode.  In this scenario, 425,000 pounds of vinyl chloride would be released within 10 minutes and the resulting vapor cloud would then explode as the result of an ignition source.  Using EPAA¿s RMP*COMP Version 1.07 modeling program it was determined that the impact of this scenario would be felt 0.4 miles away from the point of the leak.  In the impact zone no residences would be impacted but a neighboring industrial facility would be impacted.\r\n\r\nAs part of conducting the evaluation of the impact of this scenario an administrative control was considered which limits the amount of vinyl chloride stored in the bullets to 70% of the total storage capacity of the tank.  Thus the reduction of the quantity of material released would be 182,143 pounds.  The reasoning behind documenting this scenario as the worst case flammable release was based upon the fac"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000045013,
      "SummaryText": "t that the amount of material stored in one location is largest at the storage bullets and the location of the storage tanks is closest to the facilityA¿s boundary line.\r\n\r\nTOXIC WORST CASE:\r\n\r\nThe worst case toxic incident that could occur at the facility involves the release of Vinyl Acetate.  The scenario that was chosen was to consider the impact on the community if a the railcar unloading line ruptured and the entire contents of the car were released.  In this scenario, 194,500 pounds of vinyl acetate would be released and the resulting pool of chemical then vaporized.  Using EPAA¿s RMP*COMP Version 1.07 modeling program, it was determined that the impact of this scenario would be felt 5.6 miles away from the point of the spill.  In the impact zone it has been estimated that 60 residences, and neighboring industrial facilities would be impacted.\r\n\r\nThe reasoning behind documenting this scenario as the worst case toxic release was based upon the fact that a railcar stores the largest quantity of Vinyl Acetate without any passive mitigation systems.\r\n\r\nFor the alternative scenarios, if you considered either active or passive mitigation measures in your analysis, you must identify both the mitigation systems in use and their effect (e.g., \"An automatic water spray is expected to knock down approximately 50 percent of the vapor released from the end of the delivery pipeline.\").  You may also want to discuss why you selected the particular scenario.\r\n\r\nALTERNATIVE CASE RELEASE SCENARIO:\r\n\r\nFLAMMABLE ALTERNATIVE CASE:\r\n\r\n \r\nThe alternative case flammable incident that could occur at the facility involves the release of Vinyl Chloride.  The scenario that was chosen was to consider the impact on the community if one of the railcar unloading pipelines were to be severed and the resulting leak created an explosion.  In this scenario, 194,000 pounds of vinyl chloride would be released within 10 minutes and the resulting vapor cloud then explode, as the result of an igniti"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000045013,
      "SummaryText": "on source.  Using EPAA¿s RMP*COMP modeling program Version 1.07, it was determined that the impact of this scenario would be felt 0.2 miles away from the point of the leak.  In the impact zone no residences would be impacted nor would any neighboring industrial facility would be impacted.\r\n\r\n\r\n\r\nTOXIC ALTERNATIVE CASE:\r\n\r\nThe alternative case toxic incident that could occur at the facility involves the release of Vinyl Acetate.  The scenario that was chosen was to consider the impact on the community if the storage tank were to rupture and spill the entire contents of the tank.  In this scenario, 240,000 pounds of vinyl acetate would be released within 10 minutes and the resulting pool of chemical then vaporized.  Using EPAA¿s RMP*COMP Version 1.07 modeling program, it was determined that the impact of this scenario would be felt 0.2 miles away from the point of the spill.  In the impact zone it has been estimated that 60 residences, and neighboring industrial facilities would be impacted.\r\n\r\nAs part of conducting the evaluation of the impact of this scenario a passive mitigation system 40' x 41' x 3' dike surrounding the storage tank was considered to limit the impact of the release.  The reasoning behind documenting this scenario as the alternate case toxic release was based upon the fact that all Vinyl Acetate is stored in this tank, but passive mitigation reduces the impact zone.\r\n\r\n\r\nD. The general accidental release prevention program and chemical specific prevention steps\r\n\r\nYou may wish to mention the rules and regulations with which your facility complies, such as the OSHA PSM rule. You should also highlight practices that you believe are important to your prevention program.  The steps you list may be either technological (e.g., backup systems) or procedural/managerial (e.g., improved maintenance or training).\r\n\r\nOSHA PSM\r\n\r\nDue to the fact that the facility uses, stores, and handles Vinyl Chloride and Vinyl Acetate, and the fact that the quantities are gr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000045013,
      "SummaryText": "eater than 10,000 pounds, the facility must comply with OSHAA¿s Process Safety Management Standard 29 CFR 1910.119.  This regulation requires that several conditions must be met such as; ensuring that Hot Work Permits are issued for welding and cutting operations, conducting routine compliance audits to ensure compliance, mechanical integrity to ensure the equipment is properly maintained and conducting process hazard analyses.  Each of these requirements ensure that employees are provided with a safe working environment and in turn ensure that the community are adequately protected.\r\n\r\nNESHAP\r\n \r\nVinyl Chloride is a regulated substance under the EPA NESHAP and PVC MACT Standards.  These regulations limit the amount of vinyl chloride emitted to the atmosphere from routine operations. The site is also required to implement and maintain an enhanced leak detection and repair program for the early detection and repair of leaks from equipment. \r\n\r\nAmbient Air Monitoring Program (ARCAS)\r\n\r\nIn an effort to respond quickly to potential hazardous conditions an ambient air monitoring system and associated program has been implemented.  This program enables employees to monitor the atmosphere of critical process areas on a 24 hour basis.  The program is comprised of 4 gas chromatographs, each with the capability to collect atmospheric samples from 20 monitoring points.  The monitors are tied into visual alarms that are set to go off at 1 ppm (part per million).  This allows employees to be informed quickly so that immediate action can be taken to locate and stop possible leaks. \r\n\r\n5 - 50 and >100 PPM Emission Investigation Program\r\n\r\nThe 5 - 50 ppm and >100 ppm emission investigation programs were voluntarily instituted to pro-actively determine the date, time, cause, equipment, shift, location and probable cause of potential VCM emissions.  When the ARCAS emissions monitors detect a concentration of VCM in the facility greater than or equal to 5 ppm, the area operators conta"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000045013,
      "SummaryText": "ct their supervisor immediately and investigate the source of the VCM.  Once the source is identified the necessary corrective actions are immediately implemented.  Once the situation has been corrected, a more thorough investigation, depending on concentration, is conducted to determine the root cause of the incident and to implement preventive measures to prevent recurrence of the situation. Corrective actions, that are the result of a > 100ppm emission, are tracked through the siteA¿s ISO non-conformance process to ensure timely completion and a determination of the effectiveness of the action to prevent future leaks.\r\n\r\nEarly Relief Vent\r\n\r\nThe early relief venting system is designed to relieve vinyl chloride from vessels at a pressure below the pressure relief valve (PRV) rating.  This closed system prevents the release of vinyl chloride gas to the atmosphere by utilizing the siteA¿s recovery system to contain vinyl chloride. \r\n\r\nISO 9002 and ISO 14001\r\n\r\nIn 1994 the facility achieved ISO 9002 Registration and in 1996 the facility achieved ISO 14001 Registration.  Furthermore the site attained registration to the new ISO9001-2000 standard in 2003, and to ISO14001-2004 in 2005. As part of the registration process, program audits are conducted by a third party on a semi-annual basis to ensure compliance.  The facility has maintained registration under these standards on a semi-annual basis by demonstrating that a strong quality assurance program and environmental management system program are in place and that these programs are effective.\r\n\r\n\r\n \r\nE. The five year accident history\r\n\r\nDo not present accident history information in table form here; more details will be provided in the data elements.  This should be a written summary; for example, \"We have had five accidental releases of chlorine in the past five years; the largest release was 1,500 pounds.  No one offsite was injured, but several houses were evacuated as a precautionary measure during the October 1"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000045013,
      "SummaryText": "995 and May 1996 releases.\"\r\n\r\nIn the past five years of conducting business we have not experienced a release of vinyl chloride or vinyl acetate that meets the EPAA¿s criteria for an accidental release.\r\n\r\nF. The emergency response program\r\n\r\nBriefly describe the elements of your response program such as coordination with local emergency responders, training received by personnel, drills conducted by your facility, public notification and alert systems, as appropriate.\r\n\r\nFormosa Plastics Corporation, Delaware has prepared a written emergency response plan that addresses the action to be taken in the event that one of the following conditions occur; fire, explosion, gas release, natural disaster, bomb threat, utility failure, medical emergency, transportation incident, emergency at neighboring facility, chemical spill.  Drills are conducted internally at least once every year to ensure that all employees can safely shut down all operating units and then evacuate the facility.\r\n\r\nIn addition to the site specific emergency procedures, the facility is involved in the Delaware City Community Awareness and Emergency Response (DC-CAER) group.  This is a mutual aid effort which allows the facility to be prepared to assist with an emergency at a neighboring facility and to elicit the help of neighboring plants if warranted.  This includes working with the DC-CAER during annual emergency drills and meetings to discuss necessary improvement plans.\r\n\r\nIn the event that an emergency occurs at the facility that would impact the community, notification to affected individuals would be made through the DC-CAER Radio Systems which is a 24 hour manned radio established to provide neighboring plants with instant communication of emergencies. \r\n\r\nG. Planned changes to improve safety\r\n \r\nList any upcoming events such as training, installation of new mitigation or control equipment or technology, organizational changes, etc., that will improve safety at your facility.\r\n\r\n\r\n\tAt the time"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000045013,
      "SummaryText": "of submittal there are no planned changes, which will affect current safety systems or procedures. Formosa has procedures and practices to continuously maintain and improve site operations on a routine basis. \r\n\r\nH. Final Comments\r\n\r\nNone"
    }
  ]
}