{
  "FacilityID": 1000087204,
  "FacilityName": "Air Liquide Large Ind. US, L.P., El Segundo H2 Fac",
  "FacilityStr1": "1310 East El Segundo Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "El Segundo",
  "FacilityState": "CA",
  "FacilityZipCode": "90245",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.905833",
  "FacilityLongDecDegs": "-118.401944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Air Liquide Large Industries US, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 3312600,
  "Company2DUNS": 0,
  "OperatorName": "Air Liquide Large Industries US, LP",
  "OperatorStr1": "9811 Katy Freeway",
  "OperatorStr2": "Suite 100",
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77024",
  "OperatorZipCodeExt": null,
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000190232",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "148236",
  "SafetyInspectionDate": "2020-01-31 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-11-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-05-29 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-05-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-05-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000108812,
      "AltID": "Hydrogen Production",
      "FacilityID": 1000087204,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000135974,
          "ProcessID": 1000108812,
          "ChemicalID": 155,
          "Quantity": 22130.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000120665,
              "ProcessChemicalID": 1000135974,
              "ChemicalID": 149
            },
            {
              "FlamMixChemID": 1000120666,
              "ProcessChemicalID": 1000135974,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000120668,
              "ProcessChemicalID": 1000135974,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000121105,
              "ProcessChemicalID": 1000135974,
              "ChemicalID": 94
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000110065,
          "ProcessID": 1000108812,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000092298,
              "Process_NAICS_ID": 1000110065,
              "SafetyReviewDate": "2020-01-27 00:00:00",
              "PHA_Date": "2016-01-26 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Loss containment, High Pressure, Low Pressure, High Temp, Low Temp, Valve misalignment, Deviations due to maintenance, offsite events, etc",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Twelve firewater monitors have been installed on the perimeter of the facility. Emergency E-stop and fire extinguishers are also installed throughout the facility.",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "Cameras are installed to monitor releases/spills/fires in process areas.  Personnel carry portable 4-gas detectors including flammable LEL.",
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-12-27 00:00:00",
              "TrainingReviewDate": "2018-06-29 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "In addition, computer based training.",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-06-29 00:00:00",
              "EquipmentInspectionDate": "2020-03-18 00:00:00",
              "EquipmentTested": "PSA control valves and control valves for V-601 to V-612 for leaks or other issues.",
              "ChangeMgmtDate": "2020-02-26 00:00:00",
              "ChangeMgmtReviewDate": "2018-06-29 00:00:00",
              "PreStartupReviewDate": "2020-03-19 00:00:00",
              "ComplianceAuditDate": "2018-06-29 00:00:00",
              "AuditCompletionDate": "2020-01-15 00:00:00",
              "IncidentInvestigationDate": "2019-10-28 00:00:00",
              "InvestigationChangeDate": "2021-11-30 00:00:00",
              "ParticipationPlansReviewDate": "2018-06-29 00:00:00",
              "HotWorkPermitReviewDate": "2015-05-01 00:00:00",
              "ContractorSafetyReviewDate": "2013-11-04 00:00:00",
              "ContractorSafetyEvalDate": "2018-09-21 00:00:00",
              "CBI_Flag": 0,
              "Description": "Air Liquide Large Industries, L.P. (Air Liquide) operates a hydrogen production process (Hydrogen Facility) in El Segundo, CA.  The Hydrogen Facility is considered a \"covered process\", as defined in the accidental release prevention regulations, having a \"flammable mixture\" in the process in excess of 10,000 pounds. The Hydrogen Facility uses a steam methane reforming process to produce and purify hydrogen from refinery and natural gas feedstocks. The Hydrogen Facility process is closely monitored and controlled to prevent accidental releases to the environment. \n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000116157,
                  "PreventionProgram3ID": 1000092298,
                  "ProcessChemicalID": 1000135974
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000087204,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2020-01-27 00:00:00",
    "ERTrainingDate": "2020-03-18 00:00:00",
    "CoordinatingAgencyName": "Chevron Fire Dept/El Segundo FD UPA",
    "CoordinatingAgencyPhone": "3106156211",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000087204,
      "SummaryText": "The Air Liquide commitment to safety and environmental protection for the Air Liquide, El Segundo Hydrogen Facility extends beyond the plant. As part of the community, Air Liquide have a responsibility to our customer, near neighbors and the community at large to help provide a safe working and living environment.  Through safety, concern for the environment, and community involvement, we can develop a true partnership with our customer and community.  \n\n\n\nREGULATED CHEMICAL AND COVERED PROCESS   \n\nAir Liquide Large Industries, U.S.  L.P. (Air Liquide) El Segundo Hydrogen facility (Hydrogen Facility) is located within the Chevron El Segundo refinery complex in El Segundo, CA.  The Hydrogen Facility steam methane reforming process is considered the \"covered process\", as defined under the Federal and state accidental release prevention regulations, as a \"flammable mixture\" process having an inventory in excess of 10,000 pounds.\n\nThe Hydrogen Facility steam methane reforming process is designed to provide an efficient production of high purity hydrogen product using refinery and natural gas feedstocks. The hydrogen reforming and purification is performed at elevated pressure. High pressure purified hydrogen is transported to other refinery units via intra refinery pipeline.   The El Segundo Hydrogen Facility is designed for continuous safe operation.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM STEPS\n\nAir Liquide El Segundo Hydrogen Facility is covered by EPA's accidental release prevention program regulations and is subject to California and Federal accidental release prevention regulations and OSHA's process safety management (PSM) standard.   The Hydrogen Facility steam methane reforming process is closely monitored and controlled to prevent accidental releases to the environment.  The flammability of the process makes it necessary to put in place safety precautions to prevent unnecessary human error and to reduce the potential threat to personnel, nearby commun"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000087204,
      "SummaryText": "ity and the environment at large.  Air Liquide's policy is to comply with all applicable federal and state rules and regulations. The summary below discusses the process safety system in place to implement the accidental release prevention program.\n\nProcess Safety Information (PSI)\n\nAir Liquide keeps a variety of technical documents onsite electronically that are used to help maintain safe operation of its processes.  These documents address chemical properties and associated hazards, equipment design/configuration information, specific chemical inventories and operation limits for key process parameters - all key information for operating the process safely. \n\n\n\nProcess Hazard Analysis\n\nAir Liquide has a risk management program to help ensure that hazards associated with its processes are identified and controlled.  The covered process underwent an initial process hazard analysis (PHA) and continues to undergo periodic PHA's and PHA re-validations at least every five years.  The PHA team consists of members with the appropriate experience to define the hazards.   The PHA team will review findings and develop a resolution action plan for each item, which will be documented, tracked and ultimately closed in the Air Liquide action item tracking system. \n\n \n\nOperating Procedures\n\nAir Liquide maintains written procedures that address various modes of hydrogen purification process operations, such as (1) unit initial startup; (2) unit normal and temporary operations; (3) unit shutdown; (4) emergency shutdown; (5) startup following an emergency shutdown; and (6) process deviation, consequence and action.  These procedures are used by experienced operators and provide a basis for consistent training of new operators. These procedures are reviewed and annually certified as current and accurate.\n\n\n\nTraining\n\nAir Liquide has implemented a training program for all employees involved in operating the hydrogen purification process.  All employees receive a combination of classro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000087204,
      "SummaryText": "om, computer-based (CBT) and hands-on training that addresses such topic such as:  general orientation, site rules and practices, process safety information, normal and emergency operating procedures, health and safety consideration, use of safety procedures and equipment, incident investigation and emergency response.  In addition, all operators are required to attend refresher training at least every three years.  Training is documented and tracked the electronic learning management system.\n\n\n\nMechanical Integrity\n\nAir Liquide has established mechanical integrity (MI) practices and procedures, based on preventative philosophy, to maintain pressure vessels, piping systems, and relief valves and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests; (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process equipment. \n\nThe MI program assists with the verification and suitability of new and existing process equipment and, as well as quality control of spare parts and modifications to existing process equipment.\n\n\n\nManagement of Change\n\nAir Liquide's management of change (MOC) procedure has established the requirements for ensuring that proposed process or equipment changes or changes indirectly affecting processes are evaluated, approved, and documented prior to implementation through the use of a management of change process.  The MOC procedure outlines the requirements for documenting, evaluating the impact, and approving planned changes.  All MOC's are submitted, reviewed by subjective matter specialist (such as Engineering, Risk Management, Operations, Health and Safety), approved, tracked, and closed.  Personnel whose assigned job functions a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000087204,
      "SummaryText": "re impacted by the MOC, are briefed and /or trained in the MOC requirements.\n\n\n\nPre-startup Safety Reviews (PSSRs)\n\nAir Liquide ensures the safety of new/modified facilities or processes before placing those facilities or processes into service through the use of pre-startup safety reviews (PSSRs).  PSSRs are intended to ensure safety through confirmation that:  (1) construction and equipment are in accordance with design specifications; (2) safety, operating, maintenance and emergency procedures are in place and adequate; (3) PHAs have been performed and recommendations resolved before startup of new plants or processes; (4) MOC requirements have been satisfied for modified facilities; and (5) training has been completed for affected employees.\n\n\n\nCompliance Audits\n\nTo help ensure the accident prevention program is functioning properly, Air Liquide conducts an audit to determine whether the procedures and practices required by the accidental release prevention program are being implemented.  Compliance audits are conducted at least every three years.  Resolutions to the recommendations are documented, tracked and closed.\n\n\n\nIncident Investigation\n\nAir Liquide defines management systems and establishes the requirements for communicating, investigating and reporting of incidents at all facilities through the use of an Incident Investigation and reporting procedure.  Air Liquide documents the incident and subsequent investigation, follow up actions, and closure.  Results of findings and corrective actions are shared with employees who could be affected by the findings. \n\n\n\nEmployee Participation\n\nAt the El Segundo Hydrogen Plant, employees are expected to participate in accidental release prevention program (PSM/RMP).   Employees are trained on and are provided access to the hydrogen process safety information.  The specific ways an employee can be involved in the accident prevention program are documented in the Employee Participation plan.  Forms of participation in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000087204,
      "SummaryText": "clude being part of a PHA, a PSSR, and/or being involved in incident investigation. participating in the review of the covered process operating procedures annually to ensure they are correct and recommend any necessary changes.\n\n\n\nSafe & Hot Work Permit System\n\nAir Liquide has a safe & hot work permit system in place to help ensure worker and process safety.  This system is comprised of a group of corporate procedures and standards under the life safety program.  Procedures in place include:  energy control; safe work; hot work; confined space entry and process line break.  Facility personnel are trained on these safe work practices to ensure that operations and maintenance activities are performed safely.\n\n\n\nContractors\n\nAir Liquide uses outside contractors to support maintenance activities.  Contractors are made aware of the potential dangers involved with a system covered by PSM/RMP.  Procedures are in place to make sure that contractors:  (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, and (4) understand what they should do in the event of an emergency prior to their beginning work. Contractors ae prequalified and periodically re-evaluated to ensure that both their safety performance and training required for work on the Hydrogen Facility covered process.\n\n\n\nCHEMICAL SPECIFIC PREVENTION STEPS\n\nAir Liquide's accidental release prevention program activities helps prevent potential accident scenarios that could be caused by equipment failures and human errors.  The following are examples of the types of safety features in place:\n\n?    Automated process control shutdowns\n\n?    Automatic and manual valves that provide for isolation of the process\n\n?    Manual Emergency process shutdowns located in the control room and process area \n\n?    Pressure Safety Relief Valves and Flare system\n\n?    Fire water monitor and hydrant system\n\n?    Special personal protective equipment (e.g., FRC protective clot"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000087204,
      "SummaryText": "hing,)\n\n?    Personal/portable ambient air monitors\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe El Segundo Hydrogen Facility has had no accidents in the past 5 year that have met the definition of having resulted in death, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Air Liquide El Segundo Hydrogen Facility maintains a written emergency action plan (EAP) which is coordinated with its primary emergency responder, the El Segundo Chevron Refinery Fire Department.   The Chevron Fire Department EAP is reviewed annually.  The Hydrogen Facility employees are trained annually to first responder awareness level to be ready in the event of accidental releases of a regulated substance.   The EAP provides details for emergency health care and the safe evacuation of facility personnel, contractors and visitors.  The EAP describes communicating with Chevron Refinery Fire Department, the El Segundo Fire Department UPA and other outside agencies in the event of a loss of containment of the Hydrogen Facility flammable covered process.   \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe El Segundo Hydrogen Facility resolves all findings of its PHA and other hazard reviews some of which result in modifications of the process.  For example, recently the Hydrogen Facility disconnected and removed liquid pentane steam methane reformer feedstock system from service reducing the Hydrogen Facility onsite flammable substance process inventory by 30,000+ pounds.\n\n"
    }
  ]
}