{
  "FacilityID": 1000059180,
  "FacilityName": "Wiggins Gas Plant",
  "FacilityStr1": "8993 North I-76 Frontage Road",
  "FacilityStr2": null,
  "FacilityCity": "Fort Morgan",
  "FacilityState": "CO",
  "FacilityZipCode": "80701",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08087",
  "LEPC": "Morgan County LEPC",
  "FacilityLatDecDegs": "40.247270",
  "FacilityLongDecDegs": "-103.980480",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Western Operating Company",
  "Company2Name": null,
  "CompanyDUNS": 54317219,
  "Company2DUNS": null,
  "OperatorName": "Western Operating Company.",
  "OperatorStr1": "518 17th Street # 200",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000040868",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-04-07 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-08-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-08-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-08-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.24727,
  "FRS_Long": -103.98048,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000073788,
      "AltID": "Gas Comp & NGL Storage",
      "FacilityID": 1000059180,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000091076,
          "ProcessID": 1000073788,
          "ChemicalID": 155,
          "Quantity": 316000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000078425,
              "ProcessChemicalID": 1000091076,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000078426,
              "ProcessChemicalID": 1000091076,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000078427,
              "ProcessChemicalID": 1000091076,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000078428,
              "ProcessChemicalID": 1000091076,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000078429,
              "ProcessChemicalID": 1000091076,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000078430,
              "ProcessChemicalID": 1000091076,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000078431,
              "ProcessChemicalID": 1000091076,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000074950,
          "ProcessID": 1000073788,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000046330,
              "Process_NAICS_ID": 1000074950,
              "SafetyReviewDate": "2014-11-24 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API Standards",
              "FR_Comments": null,
              "HazardReviewDate": "2016-08-01 00:00:00",
              "ChangeCompletionDate": "2016-12-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-11-26 00:00:00",
              "TrainingReviewDate": "2014-07-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-08-01 00:00:00",
              "EquipmentInspectionDate": "2015-07-07 00:00:00",
              "EquipmentTested": "Relief valves, corrosion under insulation",
              "ComplianceAuditDate": "2015-01-31 00:00:00",
              "AuditCompletionDate": "2015-02-28 00:00:00",
              "IncidentInvestigationDate": "2012-07-20 00:00:00",
              "InvestigationChangeDate": "2012-08-01 00:00:00",
              "MostRecentChangeDate": "2014-11-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000047156,
                  "PreventionProgram2ID": 1000046330,
                  "ProcessChemicalID": 1000091076
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000059180,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-04-04 00:00:00",
    "ERTrainingDate": "2014-04-04 00:00:00",
    "CoordinatingAgencyName": "Morgan Cty Emergency Planning Agcy",
    "CoordinatingAgencyPhone": "9708678506",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000059180,
      "SummaryText": "ncy response program is also coordinated with the Morgan County emergency management agency and Designated Response Authority (DERA) in Fort Morgan, Colorado. The ERP is periodically reviewed and updated as conditions require."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059180,
      "SummaryText": "EXECUTIVE SUMMARY\r\nWIGGINS GAS PLANT\r\nWESTERN OPERATING COMPANY\r\n\r\n\r\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\r\n\r\nThe Wiggins Gas Plant is a gas processing facility located outside Wiggins, Colorado, in Morgan County. The facility receives natural gas by pipeline, separates natural gas condensate, processes and stores natural gas liquids (NGL) and compresses the residue gas for sale. Western Operating Company (Western) has an ongoing commitment to safety and accident prevention. \r\n\r\nAlthough the plant is not manned by full-time, onsite personnel, critical process parameters are monitored and emergency shutdown (ESD) is enacted automatically, if necessary. Plant personnel are trained to respond to remote alarm conditions and are notified via a call-out system in the event of process faults. Various automatic process safeguards and interlocks are intended to preclude a release. If a release should occur, these systems allow an immediate remote response from trained operators as well as alerting other personnel to the need for an onsite response.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nThe Wiggins Gas Plant is located just north of Interstate 76, approximately 4 miles east of Wiggins, Colorado. Western personnel visit the facility approximately every other day, for monitoring and routine maintenance.\r\n\r\nThe Wiggins Gas Plant consists of a single process to remove NGL from up to 3.0 MMscf/day of raw gas per day using Propac units, and the plant produces up to 5,000 gallons/day of NGL, although it recently has operated at much lower rates.  The NGL is a flammable mixture consisting of several regulated flammable substances, including methane, ethane, propane, butane, isobutane, isopentane and pentane. Included with the regulated flammables in the NGL are additional flammables in the C-6 through C-8 range. The flammable gas mixture is stored near the south end of the facility in pressure vessels at ambient temperatures and at approxim"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059180,
      "SummaryText": "ately 120 psig to control vapor release. Another nonregulated flammable chemical, methanol, is also used at the facility.  There are no regulated toxic materials.\r\n\r\nBecause the Wiggins Gas Plant does not meet the eligibility requirements for either RMP Program Level 1 (because it could impact a public receptor) or Program Level 3 (because it is not in one of the specifically designated NAICS codes and is not covered by 29 CFR 1910.119 because it is a normally unoccupied remote facility), it was determined to be a RMP Program Level 2 process.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM (Level 2)\r\n\r\nSafety Information:  The plant has material safety data sheets for the regulated and other chemicals; established maximum intended inventories for regulated substances; established safe upper and lower limits for process parameters; information on equipment specifications, codes, standards, and recognized and generally accepted good engineering practices employed; and established a management of change (MOC) program that includes updating the safety information when changes occur.  Although it is not required, the plant also has piping and instrumentation diagrams for the covered process.\r\n\r\nHazard Review:  An initial hazard review has been performed by facility and consultant personnel to identify hazards associated with the process; possible equipment malfunctions or human errors; applicable safeguards; and steps used or needed to detect or monitor releases, using the HAZOP technique.  The hazard identification included the following potential items: fire, explosion, overpressurization, corrosion, overfilling, equipment failure, and loss of plant utilities. Following the initial hazard review, periodic updates at least every 5 years and before any major process change will be conducted.\r\n\r\nVarious process controls are in place to regulate the process and prevent any unplanned events. The process equipment includes various vents, relief valves, check valves, manual"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059180,
      "SummaryText": "shutoffs, automatic shutoffs, equipment interlocks, level monitors, and flow meters to maintain normal control. There are lower explosive limit detectors and fire-eye sensors in the process and compression areas, both of which are tied into the emergency shutdown system. There is an onsite vent for emergency vapor release only. Unexpected excess vapor can be relieved through safety relief valves. Alarm systems continuously monitor the process. The monitoring information can be accessed onsite, with operational status information available remotely. Emergencies and shutdown conditions are relayed to operators and supervisors via a call-out system. \r\n\r\nOperating Procedures:  The plant has developed operating procedures for all covered equipment addressing the various phases of operation.  Consequences of deviation and steps required to correct or avoid deviations are addressed in individual procedures as well as the safe limits tables developed (discussed under Safety Information above).  Equipment inspections are performed by operations personnel following various maintenance procedures and checklists.  The plant has established an MOC program that includes updating the operating procedures when changes occur.\r\n\r\nTraining: Operators have written instructions for normal operations and emergency responses. These instructions include normal and emergency startup and shutdown as well as a variety of special procedures for restarting and adjusting various components of the process. Training is typically conducted through on-the-job education and guidance, and is verified by a combination of documented experience, observation/demonstration, and oral testing.  The plant has an MOC program that includes training operators prior to startup of changes to the process.\r\n\r\nMaintenance:  The plant has maintenance procedures and uses vendor procedures, trains employees on maintenance procedures they perform, ensures that contract maintenance employees are trained for the tasks they"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000059180,
      "SummaryText": "perform, and performs or causes to be performed inspections and tests (per recognized and generally accepted good engineering practices and at frequencies consistent with applicable guidance, practices, codes, and standards).\r\n\r\nCompliance Audits:  Compliance audits have been performed by facility and consultant personnel to verify that procedures/practices are adequate and being followed.  The audits and reports met applicable requirements and have been certified, and the recommendations addressed by plant and company personnel.\r\n\r\nIncident Investigation: Incidents that result in, or could reasonably have resulted in, a catastrophic release of a regulated substance are documented and investigated. Investigations begin within 48 hours of the release, and a written report that includes dates, a description, contributing factors, and recommendations for corrective actions are prepared. Recommendations will be promptly addressed and resolved, and resolutions documented.  The findings will be discussed with affected personnel, and reports will be retained for a minimum of 5 years. Based on the knowledge of current plant/company personnel and existing records, there have been no such incidents in the past 5 years.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nBased on the knowledge of the current plant/company personnel, there have been no significant accidental releases (i.e., accidents involving regulated substances that have resulted in any onsite injuries or significant property damage or any offsite response) in the last 5 years.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nA site-specific Emergency Response Plan (ERP) has been prepared for the Wiggins Gas Plant. This ERP includes specific actions for a variety of personnel, ranging from first responder to senior management. There is a comprehensive list of names and telephone numbers in the ERP for key Western personnel and Wiggins Gas Plant emergency responders. The primary response agency is the Morgan County Fire Department. The emerge"
    }
  ]
}