{
  "FacilityID": 1000002434,
  "FacilityName": "City of Dayton Ottawa Water Treatment Plant",
  "FacilityStr1": "1044 Ottawa Street",
  "FacilityStr2": null,
  "FacilityCity": "Dayton",
  "FacilityState": "OH",
  "FacilityZipCode": "45402",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39113",
  "LEPC": "Montgomery/Greene County LEPC",
  "FacilityLatDecDegs": "39.768192",
  "FacilityLongDecDegs": "-084.172195",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G6",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Dayton",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Dayton",
  "OperatorStr1": "3210 Chuck Wagner Lane",
  "OperatorStr2": null,
  "OperatorCity": "Dayton",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45414",
  "OperatorZipCodeExt": "4401",
  "RMPContact": "Phil Van Atta",
  "RMPTitle": "Division Manager",
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000129345",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-02-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.76756,
  "FRS_Long": -84.17083,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000003099,
      "AltID": "Water Treatment",
      "FacilityID": 1000002434,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000003203,
          "ProcessID": 1000003099,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000003379,
          "ProcessID": 1000003099,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000503379,
          "ProcessID": 1000003099,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000002434,
      "SummaryText": "U.S. EPA Risk Management Program (RMP) regulations were issued on June 20, 1996.  RMP regulations fall under the Clean Air Act Section 112(r) and are specified in 40 CFR part 68 Subpart C-Program 2 Prevention Program, Subpart G-Risk Management Plan.  These regulations require facilities, which have a regulated substance above threshold levels, to develop a Risk Management Program.  In Ohio, water utilities must register and submit a Risk Management Plan for each regulated facility to the U.S. EPA and the Ohio EPA.  This regulation was designed to prevent or minimize potentially catastrophic releases of toxic, reactive, flammable or explosive chemicals.  The RMP regulation requires that employers address the following areas: Hazard Assessment, Prevention Program and Emergency Response Program.  Regulated facilities must submit an RMP registration and a program summary.\n\n\n\nChlorine is the only chemical used by the City of Dayton's Division of Water Supply and Treatment that is regulated by the Risk Management Program regulations.  Chlorine is added to drinking water for disinfection.  This plan was developed to ensure compliance with RMP regulations for the Ottawa Water Treatment Plant.  The City of Dayton complied with the initial RMP requirements by submitting the required electronic RMP submittal to U.S. EPA in June 1999 and developing a written RMP plan.  The Division of Water Supply and Treatment has a Process Safety Management program for its chlorine facilities.\n\n\n\nThe primary mission of the Division of Water Supply and Treatment is to maintain public health and safety by providing an abundant supply of safe drinking water at an adequate pressure. Chlorine is used to help ensure the safety of drinking water and to comply with Environmental Protection Agency water regulations.  At the same time, the Division of Water Supply and Treatment works to ensure that employees and the public will not be threatened by an uncontrolled release of chlorine gas.\n\n\n\nThe City o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000002434,
      "SummaryText": "f Dayton has used chlorine gas for drinking water disinfection for over 70 years.  In over 70 years of use the city has experienced only minor incidents with no reportable quantities released and no off-site consequences.   For the last five-year history, there have been no chlorine release incidents with off-site consequences.\n\n\n\nPrevention Program\n\nChlorine cylinder scales were replaced in 2003.  These scales are tested and inspected annually.  Chlorine container hoists are inspected and tested annually.  Chlorine gas alarms are tested and calibrated quarterly.  The chlorine systems are monitored 24 hours per day, 7 day per week.  All chlorine incidents are investigated as promptly as possible.\n\n\n\nA Chlorine gas scrubber system was installed in 1999 at both of the Divisions water treatment plants.  These scrubbers will be able to neutralize the entire contents of a one-ton chlorine cylinder.  Emergency exhaust fans prevent the accumulation of chlorine gas in the chlorine storage room.  In 2003, the water treatment chlorine storage facilities were upgraded to include piping, scales, Halogen safety shutoff valves and new HVAC system.\n\n\n\nEmployees at the Ottawa Treatment Plant receive annual chlorine safety training.  Employees are re-trained when there are changes to procedures, equipment or facilities.  Standard operating procedures are used when employees change chlorine cylinders.  \n\n\n\nEmergency Response\n\n\n\nThe City of Dayton Fire Department and the local Hazardous Materials Response Team are notified when there is a potential chlorine gas release by calling 9-1-1."
    }
  ]
}