{
  "FacilityID": 1000027662,
  "FacilityName": "El Centro Generating Station",
  "FacilityStr1": "485 East Villa Road",
  "FacilityStr2": null,
  "FacilityCity": "El Centro",
  "FacilityState": "CA",
  "FacilityZipCode": "92243",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.803333",
  "FacilityLongDecDegs": "-115.539722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "NW",
  "FacilityURL": "www.iid.com",
  "FacilityEmailAddress": "mjtaylor@iid.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Imperial Irrigation District",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Imperial Irrigation District",
  "OperatorStr1": "485 East Villa Road",
  "OperatorStr2": null,
  "OperatorCity": "El Centro",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92243",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Taylor",
  "RMPTitle": "General Superintendent Engineering",
  "FTE": 43,
  "OtherEPAFacilityID": "CAD980817142",
  "EPAFacilityID": "100000198591",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "V-2152A",
  "SafetyInspectionDate": "2011-05-25 00:00:00",
  "SafetyInspectionBy": "Department of Toxic Substances Control",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-04-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-04-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-04-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-04-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000033772,
      "AltID": "SCR",
      "FacilityID": 1000027662,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000034032,
          "ProcessID": 1000033772,
          "NAICSCode": "221119",
          "_desc": {
            "NAICS_CODE": "221119",
            "NAICS_DESCRIPTION": "Other Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000040834,
          "ProcessID": 1000033772,
          "ChemicalID": 56,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000540834,
          "ProcessID": 1000033772,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000027662,
      "SummaryText": "El Centro Generating Station (ECGS), located at 485 East Villa Road, El Centro, California operates three power generation units along with Selective Catalytic Reduction (SCR) technology to reduce emissions of nitrogen oxides (NOx).   SCR is a post-combustion flue gas NOX emission control technology that removes NOX from the flue gas downstream from the combustion process.  A reducing agent is used to reduce NOX emissions, primarily nitric oxide (NO) and nitrogen dioxide (NO2), by oxidation-reduction reactions in the presence of a catalyst.  The most common reducing agent (reagent) used with SCR is ammonia.  Injection of the correct ammonia/air mixture into the combustion exhaust stream before the catalyst initiates the reactions and achieves the desired removal of NOx emissions upstream from the stack.  The ECGS uses anhydrous ammonia (Chemical Abstracts Service #7664-41-7 [CAS])as the reagent for the SCR reactions. The maximum amount stored on site is 60,000 lbs.\n\n\n\nDue to the hazardous nature of anhydrous ammonia, the ECGS is required to develop and implement specific regulatory requirements, as enforced by the both local and federal government agencies.  Specifically, the ECGS is required to develop a Federal Risk Management Plan (RMP), conduct a Process Hazard Analysis (PHA), develop a Process Safety Management (PSM) plan, and conduct a Seismic Analysis (SA) of the facilities, operations, and equipment.  Requirements for the ECGS are primarily dictated by the California Accidental Release Prevention (CalARP) Program and the Risk Management Program.  All regulatory requirements enforced over the use of anhydrous ammonia at the ECGS are found within:\n\n- Title 40 Part 68 of the Code of Federal Regulations;\n\n- Title 20 Section 1910.119 of the Code of Federal Regulations; and\n\n- Sections 25531 - 25543.3 of the California Health and Safety Code.\n\n\n\nThe ECGS currently operates two Units, with SCR systems, and is going to include two additional units by 2012. A single "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000027662,
      "SummaryText": "12,000-gallon (60,000 lbs) anhydrous ammonia tank is provided to support the various SCRs at the ECGS.  Maintenance and loading of the anhydrous ammonia storage tank has been contracted out by ECGS to Air Gas (formerly La Roche Industries).    Transport of Anhydrous ammonia to ECGS is accomplished using tanker trucks, with individual deliveries of about 5,000 to 7,000 gallons per delivery. When the units are operating, a delivery is scheduled every three to five weeks.\n\n \n\nThe 12,000-gallon horizontal storage tank has a 9-foot outside diameter and is 23-feet and 5-inches in length.  The storage tank lies within an enclosure and is adjacent to the unloading area.  The floor beneath the storage tank is slightly sloped towards a sump (with drain) in the north western corner of the enclosure.  This area is sloped to contain and drain accidental spills.  In addition, the ammonia-handling facility is equipped with extensive ammonia detection and alarm systems to protect workers and equipment in the event of a malfunction anywhere in the system.\n\n\n\nThe use of equipment for the storage and handling of anhydrous ammonia in support of the SCR project will require compliance with several environmental and safety regulatory requirements, including preparation of this RMP pursuant to the CalARP Program.  The quantity of ammonia on-site also triggers the federal RMP program pursuant to Section 112(r) of the Clean Air Act.  An RMP is required under the CalARP program and at the discretion of the local administering agency (AA).  In Imperial County, the AA is the Department of Toxic Substance Control (DTSC), which also is the local Certified Unified Program Agency (CUPA).  The DTSC has informed the ECGS that an RMP will be required in connection with the anhydrous ammonia system in operation at their facilities.  The original RMP submitted by January 30, 2007 includes a Seismic Analysis (SA), a Process Hazard Analysis (PHA), an Offsite Consequence Analysis (OCA), and the proper RMP"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000027662,
      "SummaryText": " submittal documentation.  The current revision is triggered by the scheduled five year update and a modification in the plant site configuration related to the repowering of Unit 3. The RMP documentation will be submitted in both electronic and hard copy format.  URS Corporation (URS) has been contracted to conduct this RMP, along with all necessary analyses previously mentioned.  In the future the ECGS will be required to complete updates to its RMP program on a 5-year basis, if any changes are applied to the ammonia system or the facility or earlier per RMP regulations.\n\n\n\nIn 2009, the IID integrated resource planning process identified the critical need for a load following unit. The El Centro Unit 3 Repower Project will add approximately 144 MW of generation capacity and will interconnect to an existing 92 kV system at the El Centro Switching Station. The project consists of replacing the existing Combustion Engineering boiler and Westinghouse steam turbine generator with two Siemens SGT-800 combustion turbine generators (CTG), two heat recovery steam generators, and a Siemens SST-600 steam turbine generator. The existing ammonia bulk storage system will continue to be used along with minor modifications including the replacement of the ammonia air vaporizer skids with an updated model of similar design and layout.\n\n\n\nThis document is the RMP prepared for submittal to DTSC to address the facility for the unloading, storage and handling of anhydrous ammonia at the ECGS.  The organization of the RMP closely follows that recommended in the CalARP Program Guidance document."
    }
  ]
}