{
  "FacilityID": 1000047409,
  "FacilityName": "Expera Specialty Solutions, LLC",
  "FacilityStr1": "515 West Davenport Street",
  "FacilityStr2": null,
  "FacilityCity": "Rhinelander",
  "FacilityState": "WI",
  "FacilityZipCode": "54501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55085",
  "LEPC": "Oneida County Emergency Mgmt",
  "FacilityLatDecDegs": "45.638056",
  "FacilityLongDecDegs": "-089.419167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.experaspecialty.com",
  "FacilityEmailAddress": "tom.emond@experaspecialty.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Specialty Paper Acquisition, LLC",
  "Company2Name": null,
  "CompanyDUNS": 790443449,
  "Company2DUNS": 0,
  "OperatorName": "Expera Specialty Solutions, LLC",
  "OperatorStr1": "515 West Davenport Street",
  "OperatorStr2": null,
  "OperatorCity": "Rhinelander",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54501",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tom Emond",
  "RMPTitle": "Manager of Environmental Control",
  "FTE": 450,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059704",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "744008100",
  "SafetyInspectionDate": "2014-10-29 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-11-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-11-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-11-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-10-19 00:00:00",
  "DeRegistrationEffectiveDate": "2017-10-06 00:00:00",
  "AnniversaryDate": "2019-11-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 45.63806,
  "FRS_Long": -89.41917,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059158,
      "AltID": "Water Treatment Process",
      "FacilityID": 1000047409,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000060225,
          "ProcessID": 1000059158,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        },
        {
          "Process_NAICS_ID": 1000060235,
          "ProcessID": 1000059158,
          "NAICSCode": "322121",
          "_desc": {
            "NAICS_CODE": "322121",
            "NAICS_DESCRIPTION": "Paper (except Newsprint) Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000072401,
          "ProcessID": 1000059158,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000572401,
          "ProcessID": 1000059158,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047409,
      "SummaryText": "ACCIDENTAL RELEASE, PREVENTION PROGRAM, AND RISK MANAGEMENT PLAN FOR:\n\n\n\nExpera Specialty Services, LLC\n\nRhinelander, Wisconsin\n\n\n\nINTRODUCTION\n\n\n\nExpera Specialty Services, LLC (Expera) is a manufacturer of technical specialty papers.  The non-integrated mill concentrates on the production of release backing paper and other specialty papers for food packaging and medical applications.  \n\n\n\nProcesses conducted at Expera require the use of one regulated toxic substances: chlorine, in an amount exceeding the respective threshold quantity.  Chlorine is used at the onsite water treatment plant to disinfect process waters.  The chlorine process is a RMP Program 3 covered process.  \n\n\n\nRELEASE PREVENTION AND EMERGENCY RESPONSE POLICY\n\n\n\nExpera is committed to managing and operating the facility in accordance with pertinent regulations and good operating practices to minimize the risk of an accidental release of a regulated substance from the water treatment process.  If an accidental release were to occur, Expera has response measures in place to minimize the impact of the release.\n\n\n\nRELEASE PREVENTION PROGRAM\n\n\n\nIn November 2014, Expera performed process hazard analyses for the one covered process in order to identify potential hazards at the facility.  Expera has several process controls in use such as sight gauges, relief valves, check valves, and response procedures in the event of a release.\n\n\n\nExpera has developed a set of operating procedures that are contained within the Process Safety Management/Risk Management Program (PSM/RMP) manual. These procedures remain current.\n\n\n\nExpera has developed a training program to ensure that employees are knowledgeable in facility operations and to reduce the risk of accidents during normal operations and emergencies.\n\n\n\nWritten procedures have been developed to maintain the mechanical integrity of the process equipment.  This includes preventive maintenance and inspection procedures, the frequency of such procedures, inspectio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047409,
      "SummaryText": "n responsibility, and guidance doucments for these procedures.\n\n\n\nExpera procedure for Management of Change has been incorporated as part of the PSM/RMP program.  Expera has implemented this procedure to ensure that changes are properly reviewed and that hazards introduced by the implementation of the change are identified and controlled prior to placing the change in operation.\n\n\n\nExpera has implemented a pre-startup safety review procedure to ensure that adequate safety measures are in place and are operational and that other aspects of the PSM/RMP program are updated and implemented as needed prior to placing the equipment into operation.\n\n\n\nCompliance audits are a critical component of the PSM/RMP program and will provide management with information on the success of the program and on areas that need improvement.  Audits are conducted every three years to ensure that the procedures and practices developed under the RMP standards are being followed.\n\n\n\nExpera has developed an incident investigation procedure for incidents involving covered processes.  The purpose of the RMP incident investigation requirement is to ensure that: 1) incidents involving regulated substances are investigated, 2) recommendations for preventing a reoccurrence are identified and implemented, and 3) appropriate personnel are briefed on the causes of each incident.\n\n\n\nExpera has instituted an employee participation plan to ensure that employees who may be potentially affected by process operations have knowledge of and access to information relative to the process.  This plan is intended to outline the employee's participation and responsibilities within Expera's PSM/RMP program.\n\n\n\nExpera has developed and implemented a Contractor Safety Program to insure that contractors comply with PSM/RMP requirements and implement an effective industrial safety program for work at the Expera facility.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThere have been no accidential or CERCLA reportable releases of chl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047409,
      "SummaryText": "orine in the past five years.  \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nExpera has developed an emergency response program that contains procedures for:\n\n\n\n1) informing the public and local emergency reponse agencies about an accidental release;\n\n2) documenting first aid and emergency medical treatment to treat human exposures;\n\n3) emergency response after an accidental release of a regulated substance;\n\n4) the use of emergency response equipment and its inspection, testing, and maintenance;\n\n5) training all employees in relevant procedures; and,\n\n6) emergency response plan review and update.\n\n\n\nExpera employees receive annual emergency training specific to their required response duties.  In addition, the Fire Brigade conducts annual fire fighting and chemical spill reponse drills.\n\n\n\nIn the event of an emergency, Expera has an audible alarm system for notifying facility personnel.  Local emergency responders will be contacted by the Emergency Response Coordinator or delegate as needed.  In addition, the Emergency Response Coordinator is reponsible for contacting the appropriate Expera spokesperson to manage public notification.\n\n\n\nCHANGES TO SAFETY\n\n\n\nThe PSM/RMP Manual documents the required program elements for the covered processes.  Expera has developed a set of operating procedures that are contained within the PSM/RMP program.  These operating procedures are reviewed on an annual basis to maintain current and accurate instructions.  Expera has developed a training plan to ensure that employees are knowledgeable in facility operations and to reduce the risk of accidents both during normal operations and emergencies.  Up-to-date instructions and continued employee training procedures will aid in future facility safety."
    }
  ]
}