{
  "FacilityID": 1000080335,
  "FacilityName": "JMS Foodservice, LLC - Suffolk",
  "FacilityStr1": "1368 Progress Road",
  "FacilityStr2": null,
  "FacilityCity": "Suffolk",
  "FacilityState": "VA",
  "FacilityZipCode": "23434",
  "Facility4DigitZipExt": "2148",
  "FacilityCountyFIPS": "51800",
  "LEPC": "Suffolk LEPC",
  "FacilityLatDecDegs": "36.770833",
  "FacilityLongDecDegs": "-076.538889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "OT",
  "FacilityURL": "www.smuckers.com",
  "FacilityEmailAddress": "joe.aiken@jmsmucker.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "The J.M. Smucker Company",
  "Company2Name": null,
  "CompanyDUNS": 4461406,
  "Company2DUNS": 0,
  "OperatorName": "JMS Foodservice, LLC - Suffolk",
  "OperatorStr1": "1368 Progress Road",
  "OperatorStr2": null,
  "OperatorCity": "Suffolk",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23434",
  "OperatorZipCodeExt": "2148",
  "RMPContact": "Joe Aiken",
  "RMPTitle": "Plant Manager",
  "FTE": 80,
  "OtherEPAFacilityID": "23434SRLCF137PR",
  "EPAFacilityID": "100000184944",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-02-27 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2022-02-14 00:00:00",
  "DeRegistrationEffectiveDate": "2022-01-27 00:00:00",
  "AnniversaryDate": "2024-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.76822,
  "FRS_Long": -76.53798,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100295,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000080335,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101543,
          "ProcessID": 1000100295,
          "NAICSCode": "31192",
          "_desc": {
            "NAICS_CODE": "31192",
            "NAICS_DESCRIPTION": "Coffee and Tea Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125634,
          "ProcessID": 1000100295,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625634,
          "ProcessID": 1000100295,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080335,
      "SummaryText": "A Risk Management Program (RMP) has been developed and a Risk Management Plan (RMP) has been prepared for use and storage of anhydrous ammonia in the JMS Foodservice, LLC Suffolk, Virginia refrigeration system.  The Risk Management Program and RMP meet and address the requirements of Title 40 Code of Federal Regulations Part 68.\n\nThis Executive Summary briefly describes the following elements:\n\n?    The accidental release prevention and emergency response policies at the stationary source;\n\n?    The stationary source and regulated substances handled; \n\n?    The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario; \n\n?    The general accidental release prevention program and chemical-specific prevention steps; \n\n?    The five-year accident history; \n\n?    The emergency response program; and\n\n?    Recent and Planned changes to improve safety.\n\n\n\nTo address concerns of an accidental release prevention and emergency response all plant and field personnel are trained in ammonia emergency evacuation procedures.  Refresher training and emergency evacuation drills are conducted on a periodic basis to ensure personnel are trained, prepared, and practiced in the event of ammonia emergencies.  \n\n \n\nAs a result of information gathered during the most recent Process Hazards Analysis (PHA) and preparation of this Risk Management Program update, JMS Foodservice, LLC has committed additional resources to further increase employee awareness and equipment reliability and to enhance operator and supervisor training and preventive maintenance programs.  As a demonstration of JMS Foodservice, LLC's high degree of commitment to public safety and service, they have taken additional action to decrease the risk of ammonia exposure to the public by implementing recommendations made during the Process Hazards Analysis and Off-site Consequence Analysis.\n\n\n\nAnhydrous ammonia is used as a re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080335,
      "SummaryText": "frigerant in the JMS Foodservice, LLC Suffolk, Virginia facility refrigeration system.  The liquid is circulated as needed to the evaporators where heat is absorbed and removed from the medium.  The anhydrous ammonia refrigeration system is a closed loop industrial refrigeration system.  The ammonia is not used or mixed in any manner with other chemical processes.\n\n\n\nJMS Foodservice, LLC has a detailed Emergency Action Plan (EAP) for their facility.  The purpose of this plan is to provide the means for rapidly determining the appropriate response for any emergency that may develop at the facility such as an accidental release of anhydrous ammonia.  JMS Foodservice, LLC conducts scheduled drills of the emergency action plan. JMS Foodservice, LLC coordinates emergency response with the Suffolk Fire Department.\n\n\n\nTo address the five year accident history is not an issue, since the facility for the past 5 years has no history of reportable ammonia releases.  To prevent and/or minimize any potential future release of anhydrous ammonia, JMS Foodservice, LLC has implemented a detailed Process Safety Management program (Preventative Program 3) developed for their facility in Suffolk, Virginia.  The Preventative Program 3 provides extensive maintenance and operator/mechanic training to ensure that the system's mechanical integrity is maintained for the life of the covered process.  Program 3 also incorporates administrative controls when modifications are made to the covered process (ammonia refrigeration system), so that the training and preventative programs are updated as the system expands and changes.\n\n\n\nJMS Foodservice, LLC has and will incorporate or address any recommendations resulting from the Process Hazard Analysis, Offsite Consequences, incident investigations and program audits.  The flexibility of the program allows JMS Foodservice, LLC to respond effectively to prevent or minimize any potential of exposing JMS Foodservice, LLC employees, the surrounding publ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080335,
      "SummaryText": "ic, and/or the environment to a release of anhydrous ammonia.\n\n"
    }
  ]
}