{
  "FacilityID": 1000050876,
  "FacilityName": "Case Farms Chicken - Winesburg",
  "FacilityStr1": "PO Box 185",
  "FacilityStr2": "1818 County Road 160",
  "FacilityCity": "Winesburg",
  "FacilityState": "OH",
  "FacilityZipCode": "44690",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39075",
  "LEPC": "Holmes County LEPC",
  "FacilityLatDecDegs": "40.613685",
  "FacilityLongDecDegs": "-081.684479",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Case Farms Processing Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Case Farms Chicken",
  "OperatorStr1": "PO Box 185",
  "OperatorStr2": "County Road 160",
  "OperatorCity": "Winesburg",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44690",
  "OperatorZipCodeExt": null,
  "RMPContact": "Daniel Hatcher",
  "RMPTitle": "Plant Manager",
  "FTE": 480,
  "OtherEPAFacilityID": "OH31H001103",
  "EPAFacilityID": "100000172742",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-07-20 00:00:00",
  "SafetyInspectionBy": "Annual Ammonia Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-08-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-08-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-08-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.61444,
  "FRS_Long": -81.69194,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "1",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064184,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000050876,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000065306,
          "ProcessID": 1000064184,
          "NAICSCode": "11232",
          "_desc": {
            "NAICS_CODE": "11232",
            "NAICS_DESCRIPTION": "Broilers and Other Meat Type Chicken Production"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000079388,
          "ProcessID": 1000064184,
          "ChemicalID": 56,
          "Quantity": 26000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000579388,
          "ProcessID": 1000064184,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050876,
      "SummaryText": "The Case Farms Chicken Winesburg Plant facility is complying with the requirements of the RMP (Risk Management Plan).  Title 40, CFR Part 68, requires that Case Farms Chicken will manage the risks involved with the storage, handling, and use of anhydrous ammonia.  To remain compliant, we promote Process Safety Management and Risk Management Planning compliance for the processing plant, our employees and the public.  Overall, these activities prevent accidental injuries, illnesses and environmental damage.\n\n\n\n\n\nAnhydrous ammonia is used as a refrigerant at the Case Farms Chicken Winesburg Plant. We use the refrigerant for keeping the plant processing areas at a constant temperature, preserving product, chilling water, and making ice for use in product shipping.\n\n\n\n\n\nOur safety programs are applied to activities involving anhydrous ammonia including transportation, storage, handling, and use. \n\n\n\n\n\nThe safety policies, procedures, plans and training that we have initiated help prevent accidents and incidents.  The rules are reviewed and improved as needed. They are also communicated to, and accepted by all employees and contractors at the facility.\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\n\n\nThe Case Farms is in the process of implementing numerous policies and procedures to enable our facility to prevent the occurrence, and minimize the consequences of significant releases of Anhydrous Ammonia as well as other hazardous substances, fires, explosions, and other types of catastrophic accidents. Overall these programs prevent accidental fatalities, injuries, and illnesses and avoid property damage.  Our safety programs prevent accidents because they focus on the rules, procedures, and practices, which govern individual processes, activities, or pieces of equipment. These rules are communicated to and accepted by all employees at our facility.\n\n\n\n\n\nVolume 1 of the PSM/RMP Library incorporates several policies. Many policies are included in Vol"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050876,
      "SummaryText": "ume 1, the remaining are referenced from other training manuals maintained in the facility.\n\n\n\n\n\nEmployee Participation Guidelines: This policy outlines the commitment between management and employees to establish a program for a successful (safe) program.\n\n\n\n\n\nProcess Safety Information: This includes information on the ammonia inventory at the facility, applicable codes, design standards, and information pertaining to the hazards of ammonia (referenced from the IIAR ammonia Data Book).\n\n\n\n\n\nProcess Hazard Analysis Program: This program outlines a thorough, orderly, systematic approach for identifying, evaluating, and controlling potential hazards within a process involving potentially hazardous chemicals such as ammonia.\n\n\n\n\n\nOperating Procedures: Are developed, implemented, and maintained per guidelines, rules, and practices for the safe operation of the ammonia refrigeration process during all operating phases. The operating procedures provide all employees involved in the operation and maintenance of the ammonia refrigeration process with the written information and precautions necessary to safety perform their tasks in a consistent manner.\n\n\n\n\n\nContractor Qualification Guidelines: This guideline has been established to verify that the contractors working in the facility are qualified to work on the system, trained in the hazards associated with their work, and made aware of the hazards presented by the facility to the employees of the contractor.\n\n\n\n\n\nManagement of Change and Pre-Startup Safety Review Programs: These programs have been developed to monitor and provide a \"checks and balances\" system to monitor changes in the facility and to verify that changes are safe and consistent with company policy.\n\n\n\n\n\nMechanical Integrity Program: To prevent or minimize the consequences of catastrophic releases of ammonia, it is important to ensure process equipment is maintained properly. The purpose of an MI program is to maintain process equipment so that a catastrop"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050876,
      "SummaryText": "hic release of ammonia is avoided or properly contained. The emphasis should be on preventive maintenance rather than breakdown maintenance.\n\n\n\n\n\nMany more specific programs and policies (Hot Work, Confined Space, Lockout / Tagout, Employee training, etc.) have been developed. For information specific to these see the Maintenance Manager.\n\n\n\n\n\nVolume 2 incorporates information on the specific system components (Pumps, vessels, compressors, evaporators, evaporative condensers, purgers, piping systems, heat exchangers, the emergency ventilation system, and general safety). This information is used as a reference source for the operator to positively identify system components. Volume 3 incorporates a complete valve list. The valve list contains information on the type, port size, identifying number, use, location, model, manufacturer, drawing reference, and normal operating position of each valve in the system.\n\n\n\n\n\nAlso included in Volume 3 is the Process and Instrumentation Diagrams for the individual system components. Flow schematics are included showing the entire system. A Block flow diagram provides a brief overview of the system. Drawings are included showing symbol and abbreviation descriptions. Plan views are included to allow the operator to physically locate equipment in the building.\n\n\n\n\n\nVolume 4 will incorporate a complete set of standard operating procedures, describing the proper steps for preparing components for start-up, starting components, monitoring normal operation of system components, shutting down components as part of normal operation, restarting equipment as part of normal operation, shutting down equipment for maintenance, restarting equipment after maintenance, shutting down equipment in emergency situations, restarting equipment after an emergency situations shutdown, and pumpout procedures. Also included as a part of each Standard Operating Procedure is the Technical Operating Specifications for the associated system component. This in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050876,
      "SummaryText": "formation includes consequences of deviation from standard operating procedures.\n\n\n\n\n\nVolume 5 contains Operation and Maintenance Information including manufactures information, spare parts list, maintenance procedures, and preventive maintenance procedures.\n\n\n\n\n\n5 YEAR ACCIDENT HISTORY\n\n\n\n\n\nThe Case Farms has had no reportable releases at our facility in the last 5 years.\n\n\n\n\n\nEMERGENCY ACTION PLAN\n\n\n\n\n\nThe Case Farms Chicken Winesburg Plant Emergency Action Plan is based on the OSHA requirements for Emergency Action Plans (29CFR 1910.38(a), Process Safety Management 29 CFR 1910.119) and HAZWOPER (29 CFR 1910.120(q)).  The Case Farms Chicken Winesburg Plant has trained employees to recognize and report a hazardous materials release and we maintain a written Emergency Action Plan. This plan is coordinated with the Holmes County Local Emergency Planning Committee(LEPC) and with the Paint Township (Winesburg) Fire Department. We conduct annual drills for exercising the Emergency Action Plan to notify, evacuate and account for all site personnel.\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\n\n\nCase Farms is committed to continuous improvement of our policies, procedures, and facility. It is the intention of Case Farms to remain an industry leader. New technology, training techniques, and equipment are continuously being added to our system.\n\n"
    }
  ]
}