{
  "FacilityID": 1000011175,
  "FacilityName": "Table Rock and North Saluda Filtration Plant",
  "FacilityStr1": "50 Pleasant Retreat Road",
  "FacilityStr2": null,
  "FacilityCity": "Travelers Rest",
  "FacilityState": "SC",
  "FacilityZipCode": "29690",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45045",
  "LEPC": "Greenville County LEPC",
  "FacilityLatDecDegs": "35.009722",
  "FacilityLongDecDegs": "-082.626944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "CO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Greenville Water System",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Greenville Water System",
  "OperatorStr1": "50 Pleasant Retreat Road",
  "OperatorStr2": null,
  "OperatorCity": "Travelers Rest",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29690",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Garland",
  "RMPTitle": "Plant Superintendent",
  "FTE": 39,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000167115",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-10-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-10-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-10-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-10-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.00811,
  "FRS_Long": -82.46094,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "84",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013319,
      "AltID": "Chlorination",
      "FacilityID": 1000011175,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000013687,
          "ProcessID": 1000013319,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015331,
          "ProcessID": 1000013319,
          "ChemicalID": 62,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515331,
          "ProcessID": 1000013319,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011175,
      "SummaryText": "Table Rock and North Saluda Filtration Plant\n\n1.Accidental release prevention and emergency response policies:\nThe Table Rock and North Saluda Filtration Plant accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. Accidental release prevention is a function of the safety devices (technology) inherent in the facility design, safe material handling practices used (procedures), and commitment to training of plant employees (management practices). All applicable requirements of the U.S. Environmental Protection Agency (EPA) Risk Management Prevention Program (40 CFR 68.65-87) are adhered to. It is the goal of the Table Rock and North Saluda Filtration Plant to ensure plant and community safety through an aggressive program of hazard analysis, preventive maintenance, equipment testing, standard operating procedures, and employee training.\n\nThe Table Rack and North Saluda Filtration Plant emergency response policy involves the preparation of an emergency preparedness plan which is tailored to the facility and to the emergency response services available in the community.   The emergency preparedness program includes procedures for notification of the Greenville County HAZMATTeam (off-site mutual aid response), LEPC (community response plan), and SCDHEC (state response plan). The Table Rock and North Saluda Filtration Plant emergency preparedness program is based upon recommendation of the American Water Works Association (AWWA) and the Chlorine Institute and is in compliance with the EPA Risk Management Emergency Response Program (40 CFR 68.90) requirements.\n\n2.Stationary source and regulated substances handled:\nThe regulated substance handled and used at the Table Rock and North Saluda Filtration Plant is chlorine. \n\nThe Table Rock and North Saluda Filtration Plant provides potable water for residential, retail, and industrial use through out the Greenville Water System service area. Chlorine "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011175,
      "SummaryText": "is used in the water treatment process to destroy nuisance and pathogenic microorganisms in the raw water supply (i.e., chlorine use as a water supply disinfectant is an industry standard). The chlorination process includes chlorine container handling and storage facilities, chlorine feed system (vacuum chlorinators, piping, and injectors), safety system (chlorine gas srubber, and leak detection) and related instrumentation. The Table Rock and North Saluda Filtration Plant is manned 24-hours a day and access to the plant site is restricted to authorized personnel.\n\n3.General accidental release program and the chemical-specific prevention steps:\nThe Table Rock and North Saluda Filtration Plant complies with EPA's RMP rule, OSHA's Process Safety Management standard (29 CFR 1910.119), and with all applicable state and local codes and regulations. The chlorination process was constructed, and is operated, in accordance with recommendations of the AWWA and Chlorine Institute. The Table Rock and North Saluda Filtration Plant accidental release prevention program is based on the following key elements:\n\no  High level of training for operators and maintenance personnel\no  Equipment inspection, testing, and preventive maintenance\no  Use of \"industry standard\" process and safety equipment\no  Use of accurate and effective operating procedures\no  Performance of hazard review of equipment and procedures\no  Implementation of an internal and external auditing program\no  Segregation of chemical processes for compatibility and fire prevention/control\no  Chlorine leak detectors, alarms, and scubber system\no  Availability of chlorine container leak repair kit\no  Maintenance of approved parts inventory\n\n4.Five-year accident history:\nThe Table Rock and North Saluda Filtration Plant had no reportable accidents in the previous five-years. \n\n5.Emergency Response Program:\nThe Table Rock and North Saluda Filtration Plant has an emergency preparedness plan that is integrated with the LEPC pla"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011175,
      "SummaryText": "n. The Table Rock and North Saluda Filtration Plant maintains a mutual aid agreement with the Greenville County HAZMAT Team to provide emergency response services in the event of a chlorine release. The plant emergency preparedness plan includes procedures for the notification of offsite mutual aid responders, LEPC, SCDHEC, and the public along with a discussion of actions to be taken in the event of a chlorine release. The plan also addresses first aid and medical treatment.\n\n7.Planned changes to improve safety:\nThe initial Process Hazard Analysis (PHA) was performed in May 2004 and it resulted in no recommended process or operational changes. The Table Rock and North Saluda Filtration Plant plans to continue to evaluate the regulated process as required under the PSM / RMP standards to ensure safe operations."
    }
  ]
}