{
  "FacilityID": 1000099043,
  "FacilityName": "Kaneka North America LLC",
  "FacilityStr1": "6161 Underwood Rd",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77507",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Pasadena  LEPC",
  "FacilityLatDecDegs": "29.623005",
  "FacilityLongDecDegs": "-095.086700",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.kaneka.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Kaneka Corporation",
  "Company2Name": "NA",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Kaneka North America LLC",
  "OperatorStr1": "6161 Underwood Rd",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77507",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Kahara",
  "RMPTitle": "KNA President",
  "FTE": 351,
  "OtherEPAFacilityID": "TXD 9808 70349",
  "EPAFacilityID": "100000025705",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O3528",
  "SafetyInspectionDate": "2021-10-28 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-01-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-01-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2022-01-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-01-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 29.6209,
  "FRS_Long": -95.08687,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000122550,
      "AltID": "Modifiers",
      "FacilityID": 1000099043,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000123923,
          "ProcessID": 1000122550,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000153212,
          "ProcessID": 1000122550,
          "ChemicalID": 120,
          "Quantity": 520000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 120,
            "ChemicalName": "1,3-Butadiene",
            "CASNumber": "106-99-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000153213,
          "ProcessID": 1000122550,
          "ChemicalID": 25,
          "Quantity": 132000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000653212,
          "ProcessID": 1000122550,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000653213,
          "ProcessID": 1000122550,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000122551,
      "AltID": "CPVC",
      "FacilityID": 1000099043,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000123924,
          "ProcessID": 1000122551,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000153214,
          "ProcessID": 1000122551,
          "ChemicalID": 62,
          "Quantity": 5220000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000653214,
          "ProcessID": 1000122551,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000122552,
      "AltID": "MS Polymers",
      "FacilityID": 1000099043,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000123925,
          "ProcessID": 1000122552,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000153215,
          "ProcessID": 1000122552,
          "ChemicalID": 12,
          "Quantity": 256000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 12,
            "ChemicalName": "Propylene oxide  [Oxirane, methyl-]",
            "CASNumber": "75-56-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000653215,
          "ProcessID": 1000122552,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000099043,
      "SummaryText": "A.  Accidental release prevention and emergency response policies:\n\nAt the North America facility, there are four chemicals covered by the EPA RMP regulation (40 CFR Part 68).  They are: Acrylonitrile, 1-3 Butadiene, Chlorine and Propylene Oxide.  It is vital to observe certain safety precautions in handling these chemicals to prevent unnecessary human exposure, to reduce the threat to personal health and safety of ourselves, our co-workers, our contractors, the community and our environment.  It is our policy to adhere to all Federal and State rules and regulations.  Safety depends on the manner in which we handle these chemicals combined with the safety devices inherent in the design of our facility, as well as the safe handling procedures that we use to train our personnel.\n\n\n\nThe facility maintains an emergency response plan that defines the steps the facility and each employee should take during an accidental release of a regulated substance.  The plan includes both evacuation and protective action procedures for employees not directly involved in the response, and actions to be taken by employees responsible for responding to and mitigating the release.  All employees are trained in the applicable emergency response procedures.  Drills and exercises are routinely conducted to test the facility plans and revise the plans if necessary. \n\nThe emergency response plan also includes procedures for notifying facility personnel, including emergency response personnel, the local Channels Industry Mutual Aid (CIMA) agency, the Community Awareness Emergency Response (CAER) organization and the Local Emergency Planning Committee (LEPC).  \n\n\n\nB.  The stationary source and regulated substances handled:\n\n\n\nThe Kaneka North America facility is one stationary source with four distinct PSM covered operating units: The Modifiers Unit, Chlorinated-polyvinylchloride (CPVC Unit), Modified Silicones (MSA Unit) and The Nutrients Unit.\n\n \n\nThe Modifiers unit handles two RMP-covered ch"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000099043,
      "SummaryText": "emicals: \n\n+  1, 3-Butadiene\n\n+  Acrylonitrile\n\nThe primary purpose of the Modifiers Unit is to create a polymer which is blended with plastics, such as PVC, for impact improvement and weather resistance.  The product is used in applications for window frames and siding.\n\n\n\nCPVC handles one RMP-covered chemical: \n\n+  Chlorine \n\nChlorine is reacted in a water slurry with the PVC.  The resultant CPVC powder is conveyed to railcar for shipping.  CPVC is used in the manufacturing of hot water plastic pipes.  \n\n\n\nMSA handles one RMP-covered chemical:\n\n+  Propylene oxide\n\nPropylene Oxide (PO) is brought onsite by tank truck and reacted with other organic chemicals to make a modified silicone liquid.  The end product is used in the manufacturing of sealants.\n\n\n\nThe Nutrients Unit does not handle RMP-covered chemicals.\n\n\n\nThe Pasadena facility is equipped to safely unload tank trucks and railcars into storage vessels.  Access to the site is restricted to authorized facility personnel, management and contractors.\n\n\n\n\n\nC.  General accidental release prevention program and chemical-specific prevention steps:\n\n\n\nThe Kaneka facility is a PSM-covered facility and, as such, it has a viable and robust process safety program.  \n\nProcess Hazards Analyses have been conducted on processes containing all four RMP-covered chemicals.  Major hazards identified include fire, explosion, toxic chemical releases, overpressurization, overfilling, and equipment failure.  Process controls in place include relief valves, emergency and automatic shutdowns, grounding, interlocks and procedures and training.  Additionally, Acrylonitrile, Chlorine and Propylene Oxide storage are contained within dikes with appropriate drainage and fire protection.  Fire protection is also provided for areas containing the flammable chemical 1, 3-Butadiene.  \n\nTraining is conducted continuously by a dedicated training department and includes classroom, on-the-job mentoring and standard operating procedure (SOP) reviews"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000099043,
      "SummaryText": ".  Testing and demonstration are used as means to verify understanding.  SOPs are kept evergreen through a continuous review and revision process that is managed by designated individuals in each process unit.\n\n\n\nThe site has both predictive and preventative maintenance programs which include inspections, tests and routine maintenance activities that are performed by trained and competent employees and contractors.  Inspection and testing frequencies are prescribed by manufacturers and industry standards.  There is a system in place to correct identified deficiencies.  Additionally, there is a quality assurance program in place which reviews individual workmanship as well as new and spare parts.\n\nChange is managed through a electronic management-of-change (MOC) process.  The MOC process outlines approval responsibilities and requires hazard evaluations prior to the implementation of any changes affecting a covered process.  Affected personnel and contractors are trained in the changes before they startup.  Additionally, changes undergo a pre-startup safety review conducted by appropriate employees, as spelled out in the facility Pre-startup Safety Review procedure.\n\nPSM and RMP compliance audits are conducted every 3 years.  Findings are discussed with the facility's management team and personnel were assigned to correct noted deficiencies which are tracked to closure.\n\n\n\nThe facility has an active computer based accident / incident prevention program.  Each incident and near miss associated with the process area is evaluated and, if it meets pre-defined criteria, a team-based investigation is performed.  The investigation purpose is to identify root and contributing causes and to make recommendations to prevent future recurrence.  The action items, with assigned due dates, are tracked in an electronic database until closure.\n\nEmployees are active in all aspects of process safety, including safe work permitting, process hazard analyses, incident investigations, mech"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000099043,
      "SummaryText": "anical integrity and management of change.  Additionally, contractors are involved in many aspects of the programs.  \n\n\n\nKaneka screens contractors based on safety performance before they are allowed entrance to the facility.  Employees responsible for projects involving contractors are encouraged to provide feedback to both management and the contractor on the contractor's overall safety performance.\n\n\n\nD.  Five-year accident history:\n\nThe Kaneka North America Pasadena Facility has never had, in the history of the facility, any release that resulted in deaths on site, injuries or significant property damage on site, or any offsite deaths, injuries, evacuations, sheltering-in-place, property damage or environmental damage.\n\n\n\nE.  Emergency response program:\n\nThe facility maintains an emergency response plan that defines the steps the facility and each employee should take during an accidental release of a regulated substance.  The plan includes both evacuation and protective action procedures for employees not directly involved in the response, and actions to be taken by employees responsible for responding to and mitigating the release.  All employees are trained in the applicable emergency response procedures.  Drills and exercises are routinely conducted to test the facility's plans and revise the plans if necessary. \n\n\n\nAdditionally, Kaneka North America has an emergency response team to conduct first response action to minimize any offsite impact.  The team is equipped and trained to contain spills, conduct emergency isolation of process equipment and, if needed, fight fires.  They undergo routine hands on training both onsite and at offsite third party training facilities.  The Emergency Response Team also participates in regional drills to practice their emergency response skills.\n\n\n\nThe emergency response plan includes procedures for notifying facility personnel, including emergency response personnel, the local Channels Industry Mutual Aid (CIMA) agency, th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000099043,
      "SummaryText": "e Community Awareness Emergency Response (CAER) organization and the Local Emergency Planning Committee (LEPC).\n\n  \n\nF.  Planned changes to improve safety:\n\nSafety is a continuously improved each year.  Continued review and improvement of process safety and safety procedures are being performed.  Projects that improve documentation of process safety information including relief devices and control systems are in work.  Better electronic management systems to track action items that come from PHAs, incident investigations and audits are being investigated.  More detailed training on process safety and safety are being developed. "
    }
  ]
}