{
  "FacilityID": 1000011328,
  "FacilityName": "REXtac APAO Production Plant",
  "FacilityStr1": "2501 S. Grandview Ave",
  "FacilityStr2": null,
  "FacilityCity": "Odessa",
  "FacilityState": "TX",
  "FacilityZipCode": "79766",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48135",
  "LEPC": "Ector County LEPC",
  "FacilityLatDecDegs": "31.827069",
  "FacilityLongDecDegs": "-102.325319",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.rextac.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "REXtac LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "REXtac LLC",
  "OperatorStr1": "PO Box 4148",
  "OperatorStr2": null,
  "OperatorCity": "Odessa",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79760",
  "OperatorZipCodeExt": "4148",
  "FTE": 50,
  "OtherEPAFacilityID": "79760LPSPR2400S",
  "EPAFacilityID": "100000209491",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-10-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-10-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-10-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-10-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 31.82607,
  "FRS_Long": -102.324782,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013518,
      "AltID": "APAO",
      "FacilityID": 1000011328,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015520,
          "ProcessID": 1000013518,
          "ChemicalID": 95,
          "Quantity": 432000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000015521,
          "ProcessID": 1000013518,
          "ChemicalID": 129,
          "Quantity": 726000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000015522,
          "ProcessID": 1000013518,
          "ChemicalID": 154,
          "Quantity": 317000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000013878,
          "ProcessID": 1000013518,
          "NAICSCode": "32511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000011167,
              "Process_NAICS_ID": 1000013878,
              "SafetyReviewDate": "2009-10-01 00:00:00",
              "PHA_Date": "2009-08-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-12-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-10-01 00:00:00",
              "TrainingReviewDate": "2009-10-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-10-01 00:00:00",
              "EquipmentInspectionDate": "2009-09-09 00:00:00",
              "EquipmentTested": "TK-901 Firewater Tank",
              "ChangeMgmtDate": "2009-07-20 00:00:00",
              "ChangeMgmtReviewDate": "2009-09-09 00:00:00",
              "PreStartupReviewDate": "2009-10-01 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-10-01 00:00:00",
              "HotWorkPermitReviewDate": "2009-07-20 00:00:00",
              "ContractorSafetyReviewDate": "2009-10-01 00:00:00",
              "ContractorSafetyEvalDate": "2009-10-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000012985,
                  "PreventionProgram3ID": 1000011167,
                  "ProcessChemicalID": 1000015520
                },
                {
                  "PrimaryKey": 1000012986,
                  "PreventionProgram3ID": 1000011167,
                  "ProcessChemicalID": 1000015521
                },
                {
                  "PrimaryKey": 1000012987,
                  "PreventionProgram3ID": 1000011167,
                  "ProcessChemicalID": 1000015522
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000011328,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-10-01 00:00:00",
    "ERTrainingDate": "2009-10-01 00:00:00",
    "CoordinatingAgencyName": "Odessa Fire Department",
    "CoordinatingAgencyPhone": "4322570502",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011328,
      "SummaryText": "A.\tAccidental release prevention and emergency response policies:\n\nAt the REXtac Odessa Facility, there are no toxic chemicals above the threshold quantity and three flammable chemicals covered by the EPAÂ¿s RMP regulation (40 CFR Part 68).  They are: Propylene, Ethylene and Butene.  It is vital to observe certain safety precautions in handling these chemicals to prevent unnecessary human exposure, to reduce the threat to personal health and safety of ourselves, our co-workers, our contractors, the community and our environment.  It is our policy to adhere to all Federal and state rules and regulations.  Safety depends on the manner in which we handle these chemicals combined with the safety devices inherent in the design of our facility, as well as the safe handling procedures that we use to train our personnel.\n\nThe facility maintains an emergency response plan that defines the steps the facility and each employee should take during an accidental release of a regulated substance.  The plan includes both evacuation and protective action procedures for employees not directly involved in the response, and actions to be taken by employees responsible for responding to and mitigating the release.  All employees are trained in the applicable emergency response procedures.  Drills and exercises are routinely conducted to test the facilityÂ¿s plans and revise the plans if necessary. \n\nThe emergency response plan also includes procedures for notifying facility personnel, including emergency response personnel, the Local Emergency Planning Committee (LEPC) and the Odessa Fire Department.  \n\nB.\tThe stationary source and regulated substances handled:\n\nThe REXtac Odessa Facility receives, handles and stores flammable hydrocarbon as feedstocks for the production of amorphous polyalphaolefins (APAO).  End uses include adhesives and sealants.  The REXtac Odessa Facility has large volumes of flammable substances, such as propylene, ethylene and butene.  The facility uses small vol"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011328,
      "SummaryText": "umes of toxic material such as ammonia and titanium tetrachloride.  However, the quantities are below the RMP threshold limit and have not been considered in this RMPlan.\n\nThe previous RMPlan was submitted under Huntsman Polymers Corporation and included the entire, integrated petrochemical facility (east and west side).  Since the time it was submitted, the petrochemical facility shutdown and was de-inventoried.  A new company, REXtac LLC, purchased a small portion of the integrated facility, the APAO (amorphous polyalphaolefins) Plant also known as Â¿Line 2Â¿, and is in the process of modifying it to be a stand-alone facility.  This has required installation of new unloading facilities for raw feedstocks and changes to utility systems.  \n\nA description of the primary process sections is provided below:\n \nOverview\n\nThe REXtac APAO process is a liquid pool process (polymerization in a pool of liquid propylene and sometimes butene) using a high activity catalyst.  The APAO product is virtually totally amorphous and contains very low levels of catalyst residue.  Deactivation of the catalyst is all that is required.\n\nThe ISBL portion of the REXtac APAO process is divided into the following sections:\nÂ·\tCatalyst Preparation\nÂ·\tPolymerization\nÂ·\tSeparation of Un-reacted Monomers\nÂ·\tCatalyst Deactivation\nÂ·\tAdditive Addition\nÂ·\tProduct Storage\nÂ·\tPackaging\n\nThe following is a description of each section:\n\nCatalyst Preparation\n\nIn the catalyst preparation area the catalyst components are mixed and stored in preparation for delivery to the reactor.  The catalyst components include a high activity Zeigler-Natta catalyst dispersed in mineral oil, an aluminum alkyl, and (for some grades) an electron donor diluted in heptane.  The catalyst components are delivered to the reactor through metering equipment that precisely controls their flow. \n\nPolymerization\n\nPolymerization takes place in a liquid pool Reactor (R-1130).  Propylene, co-monomers such as ethylene and butene, cataly"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011328,
      "SummaryText": "st components, and hydrogen for viscosity control are continuously fed to the reactor while the APAO product is continuously withdrawn.  An antifoam agent diluted in heptane is added to the reactor to prevent excessive foaming.\n\nThe reactor operates at a pressure ranging from 250 to 550 psig, and a temperature ranging from 135 to 165ÂºF, depending on the grade of APAO.  The conversion of the monomer(s) is high, equaling or exceeding that for isotactic polypropylene.\n\nThe heat of reaction is removed by using cooling water to condense the propylene and butene vapors boiled up from the liquid pool.  In the event of a failure of the cooling water supply or some other emergency, the reaction can be stopped quickly from the control room by injecting a small amount of a strong catalyst poison, such as isopropyl alcohol (IPA) or carbon monoxide (CO) into the reactor.  In the unlikely event that this is not sufficient, the reactor contents can be safely vented to the flare through a PSV sized for a runaway reaction. \n\nOver a period of time, the reactor and the overhead condensers tend to become coated with APAO.  Hot xylene is used as a solvent for cleaning the reactor and condensers.  When the APAO concentration in the xylene becomes high, the xylene is loaded into tank trucks for offsite disposal.   \n\nSeparation of Un-reacted Monomers\n\nAPAO, along with un-reacted propylene and co-monomer(s), exit the reactor and flow into the Flash Tank (V-1145) where the monomer concentration in the product is reduced to low levels and the APAO product is heated from Reactor temperature to about 375ÂºF so that it can be easily pumped.  High pressure steam is used for heating.\n\nNext, the Flash Tank vent gas is cooled in order to condense and remove Â¿light endsÂ¿, i.e., very low molecular weight APAO.  The light ends are collected in a storage tank and shipped offsite for disposal. \n\nWhen producing ethylene grades, the Flash Tank vent gas goes to the Recycle Propylene Unit where makeup pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011328,
      "SummaryText": "pylene is added and the combined stream is returned to the Reactor.  \n\nDuring the production of butene grades, the Flash Tank vent gas goes first to the Butene Recovery Area where the propylene and butene are separated in the Butene Column (V-1944).  The overhead of the Butene Column, primarily propylene, goes to the Recycle Propylene Unit where makeup propylene will be added and the combined stream returned to the Reactor. \n\nThe Butene Column bottoms goes to the Recycle Butene Storage Tank (V-2231) where makeup butene is added.  The combined butene stream is then returned to the Reactor. \n\nCatalyst Deactivation\n\nThe use of a high activity catalyst eliminates the need for removal and disposal of catalyst residues.  However, to prevent further polymerization and undesirable interactions with the additives, the catalyst must be deactivated.  This is accomplished by thoroughly mixing a small amount of water into the APAO. \n\nAddition of Additives\n\nAdditives such as antioxidants are added to the APAO in Batch Tanks (V-1435 A/B).   The additives are unloaded from bags or drums into the feed tank of a dense phase conveying system.  Nitrogen is used to transport the additives into the Batch Tanks.  A bag filter reduces particulate emissions when the additives are loaded into the conveying system feed tank.  The Batch Tanks are agitated in order to assure good dispersion of the additives. \n\nThe Batch Tanks operate at a lower pressure than the Flash Tank, so further devolatilization of the APAO occurs.  The Batch Tank vent gas flow is small and is directed to the flare.  A small amount of ammonia is added to the Batch Tank vent gas in order to neutralize the small amount of hydrochloric acid (HCl) that is produced when the catalyst is deactivated. \n\nProduct Storage\n\nAPAO is pumped from the Batch Tanks to the Product Storage Tanks where it is stored under a nitrogen blanket.  From here, the APAO is pumped into heated trailers or railcars. \n\nThe vents from the Product Storage T"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011328,
      "SummaryText": "anks go to the low pressure flare.  As before, a small amount of ammonia is added to the vent gas for neutralization. \n\nPackaging\n\nSome of the APAO product is transported in heated trailers to another REXtac site where it is pelletized or put into drums.  The APAO may also be blended with other components to enhance its properties. \n\nC.\tThe worst-case release scenario and the alternative release scenario\n\nThere are three chemicals located at REXtac that meet or exceed the threshold quantity as defined in RMP: propylene, ethylene and butene.  All three chemicals are flammable.  Therefore, only one worst case and one alternate case scenario was evaluated.  The largest quantity of flammable hydrocarbon is in the Propylene Storage Bullet.  The Propylene Storage Bullet releases were modeled using RMP Comp for both the worst case and alternate release scenarios.\n\nPropylene\n\nThe worst case scenario for propylene involves a release of 263,700 lbs from a storage vessel resulting in a vapor cloud explosion.  RMP Comp was used to predict a distance of 0.5 miles to the 1 psi endpoint.  No credit was taken for passive mitigation.\n\nThe alternative release scenario for propylene involves a 1-1/2Â¿ leak from the storage vessel.  A release rate of 17,700 lb/min over 10 minutes was used to represent the evaporation of the liquid propylene.  RMP Comp was used to predict a distance of 0.3 miles to the 1 psi endpoint.  No credit was taken for active mitigation (e.g., foam suppression), although it is available.  \n\nA 1-1/2Â¿ hole in the side of a storage bullet is considered highly unlikely.  However, more realistic cases were evaluated but the releases did not reach the fenceline.  Therefore, the more unrealistic scenario was modeled as the more realistic cases do not reach the fenceline as required by RMP.  \n\nD.\tGeneral accidental release prevention program and chemical-specific prevention steps:\n\nThe REXtac Odessa Facility is a PSM-covered facility and, as such, it has a viable proces"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000011328,
      "SummaryText": "s safety program.  \n\nProcess Hazards Analyses were conducted on the entire APAO process.  Major hazards identified include fire, explosion, toxic chemical releases, over-pressurization, overfilling, and equipment failure.  Process controls in place include relief valves, emergency and automatic shutdowns, grounding, interlocks and procedures and training.  Additionally, liquids are contained within dikes with appropriate drainage.  Fire \nprotection is also provided for all areas of the APAO process.  \n\nTraining is conducted continuously and includes classroom, on-the-job mentoring and standard operating procedure (SOP) reviews.  Testing and demonstration are used as means to verify understanding.  SOPs are kept evergreen through a continuous review and revision process that is managed by designated individuals.\n\nThe site has both predictive and preventative maintenance programs which include inspections, tests and routine maintenance activities that are performed by trained and competent employees and contractors.  Inspection and testing frequencies are prescribed by manufacturers and industry standards.  There is a system in place to correct identified deficiencies.  Additionally, there is a quality assurance program in place which reviews individual workmanship as well as new and spare parts.\n\nChange is managed through a management-of-change (MOC) process.  The MOC process outlines approval responsibilities and requires hazard evaluations prior to the implementation of any changes affecting a covered process.  Affected personnel and contractors are trained in the changes before they startup.  Additionally, changes undergo a Pre-Startup Safety Review (PSSR) conducted by appropriate employees, as spelled out in the facilityÂ¿s PSSR procedure.\n\nA PSM and RMP compliance audit was conducted for the larger integrated petrochemical facility within the past three years.  However, since the entire facility was shutdown and APAO recently purchased, no compliance audit is re"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000011328,
      "SummaryText": "quired at this time.  The facility intends to conduct a compliance audit per PSM and RMP requirements once the facility is operational.\n\nThe facility has an active accident / incident prevention program.  Each incident and near miss associated with the process area is evaluated and, if it meets pre-defined criteria, a team-based investigation is performed.  The investigationÂ¿s purpose is to identify root and contributing causes and to make recommendations to prevent future recurrence.  The facilityÂ¿s safety manager tracks investigation action items through until closure.\n\nEmployees are active in all aspects of process safety, including safe work permitting, process hazard analyses, incident investigations, mechanical integrity and management of change.  Additionally, contractors are involved in many aspects of the programs.  \n\nREXtac screens contractors based on safety performance before they are allowed entrance to the facility.  Employees responsible for projects involving contractors are encouraged to provide feedback to both management and the contractor on the contractorÂ¿s overall safety performance.\n \nE.\tFive-year accident history:\n\nThe REXtac APAO Facility has not had any release that reached beyond the property line or resulted in deaths on site, injuries or significant property damage on site, or any offsite deaths, injuries, evacuations, sheltering-in-place, property damage or environmental damage within the past five years.  \n\nF.\tEmergency response program:\n\nThe facility maintains an emergency response plan that defines the steps the facility and each employee should take during an accidental release of a regulated substance.  The plan includes both evacuation and protective action procedures for employees not directly involved in the response, and actions to be taken by employees responsible for responding to and mitigating the release.  All employees are trained in the applicable emergency response procedures.  Drills and exercises are routinely cond"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000011328,
      "SummaryText": "ucted to test the facilityÂ¿s plans and revise the plans if necessary. \n\nThe emergency response plan includes procedures for notifying facility personnel, including emergency response personnel, the Local Emergency Planning Committee (LEPC) and the Odessa Fire Department.  \n\nG.\tPlanned changes to improve safety:\n\nSafety is a continuously improved each year.  Budget is set aside to ensure maintenance, testing and inspection are performed as specified and deficiencies, if noted, are corrected immediately.  Examples of continuous improvement at the REXtac APAO Facility include:\n\nÂ·\tArea LEL detection and monitoring systems around the unloading areas will be installed prior to startup;\nÂ·\tA closed circuit TV system focused on the unloading areas will be installed;\nÂ·\tAdditional fire water capability will be improved with the addition of two jockey pumps;  \nÂ·\tAdditional fire water monitors will be installed in the unloading areas prior to startup."
    }
  ]
}