{
  "FacilityID": 1000007036,
  "FacilityName": "Turner Road Vintners West",
  "FacilityStr1": "5852 West Turner Road",
  "FacilityStr2": null,
  "FacilityCity": "Lodi",
  "FacilityState": "CA",
  "FacilityZipCode": "95242",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.138949",
  "FacilityLongDecDegs": "-121.387788",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Constellation Wines US",
  "Company2Name": "Constellation Wines US",
  "CompanyDUNS": 59651117,
  "Company2DUNS": 0,
  "OperatorName": "Constellation Wines US",
  "OperatorStr1": "235 N. Bloomfield Road",
  "OperatorStr2": null,
  "OperatorCity": "Canandaigua",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14424",
  "OperatorZipCodeExt": null,
  "RMPContact": "Curtis Robinson",
  "RMPTitle": "General Manager",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000071799",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-04-01 00:00:00",
  "SafetyInspectionBy": "San Joaquin County Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-08-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-08-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.14582,
  "FRS_Long": -121.38861,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000008200,
      "AltID": "Main Refrigeration System",
      "FacilityID": 1000007036,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000008406,
          "ProcessID": 1000008200,
          "NAICSCode": "31213",
          "_desc": {
            "NAICS_CODE": "31213",
            "NAICS_DESCRIPTION": "Wineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000009184,
          "ProcessID": 1000008200,
          "ChemicalID": 56,
          "Quantity": 70000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000509184,
          "ProcessID": 1000008200,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000007036,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nConstellation Brands, Inc., headquartered in Fairport, New York, is a leading international producer and marketer of beverage alcohol brands with a broad portfolio across the wine, imported beer and spirits categories. Constellation is the largest wine company in the world; the largest multi-category supplier of beverage alcohol in the United States; a leading producer and exporter of wine from Australia and New Zealand; and both a major producer and independent drinks wholesaler in the United Kingdom. With over 250 beverage alcohol brands marketed in nearly 150 countries, Constellation has unequalled breadth, offering consumers their beverage of choice, no matter what the occasion. Since its founding in 1945 as a producer and marketer of wine products, the company has grown through a combination of organic growth and acquisitions.\n\nThe Constellation Wines US dba Turner Road Vintners (Turner Road Vintners) management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  Turner Road VintnersA?s safety and environmental policies are administered by the Maintenance Manager, who conducts periodic inspections of the facility to ensure compliance, and oversees the entire safety and environmental programs, including the Process Safety Management and Risk Management Program.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Turner Road Vintners facility is located at 5852 West Turner Road in Lodi, California, which is located approximately 0.59 miles east of Interstate 5 and 2.02 miles north of Highway 12. The area immediately surrounding the facility is rural.  The facility was previously owned by Sebastiani, Constellation Wines US bought the facility from Sebastiani in March 2000.  \n\nThe primary business of Turner Road Vintners is to provide cooling for wine chillers and "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000007036,
      "SummaryText": "jacketed tanks throughout the facility. In order to conduct operations, the facility maintains one refrigeration system containing 70,000 pounds of anhydrous ammonia, a regulated substance.  The ammonia refrigeration system at Turner Road Vintners is comprised of a closed loop system consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for glycol and wine product chilling.  Typical operating conditions range from approximately 25-30 psig on the low pressure side of the system to 165 psig on the high side.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nIn order to operate the ammonia refrigeration system, the facility complies with the OES California Accidental Release Prevention (CalARP) Program, OSHAA?s Process Safety Management (PSM), and EPAA?s Risk Management Program.\n\nThe facility has been in operation since 1998.  Changes/modifications have taken place since the completion of the facility.  The original ammonia system was designed and constructed in accordance with all applicable federal, state, and local regulations including the 1994 Uniform Mechanical Code, Uniform Building Code, and the Uniform Fire Code.  Design and installation of the expansion to the ammonia system was applicable to the 2001 Uniform Mechanical Code, 2001 California Mechanical Code, and IIAR Recommended Practices.  In addition, the fire protection system at the facility was built to the 2000 California Fire Code and the requirements of the County Fire Marshall.  Piping selection and installation were made as per ASME B31.5 and vessels to ASME Section VIII Division 1 requirements.  Relief valves are maintained as per IIAR Bulletin 110 requirements.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no significant releases of ammonia at the facility over the last five ye"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000007036,
      "SummaryText": "ars (June 2004 to June 2009) that exceeded the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material.  In addition, there have been no injuries resulting from an ammonia release, nor any releases or A?near missesA? that warranted an internal incident investigation\n\nEMERGENCY RESPONSE PROGRAM\n\nThe facility has an Emergency Action Plan (plan) in effect.  This Plan was designed to meet the following objectives:  \n\n1.      save lives;\n2.      minimize and avoid injuries;\n3.      protect the environment; and\n4.      minimize property damage.\n\nThe Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the CalARP, PSM, and RMP regulations.  \n\nThe ammonia refrigeration system employed by Turner Road Vintners is equipped with various automatic process controls intended to provide automated control of system operations.  The automatic process controls consist of liquid level controls, pressure and temperature controls, and pressure relief valves.\n\nThere are ammonia sensors in the engine room to alert personnel if an ammonia leak occurs.  The ammonia detectors' control settings are as follow:\n\nA?    25 ppm A?    triggers the strobe lights by the east and west engine room doors \n                    and the low ammonia pilot light on the control panel.\nA?    50 ppm A?    activates the audible alarm by the east and west engine room \n                    doors as well the A?mediumA? ammonia pilot light on the control \n                    panel.\nA?    130 ppm A?  turns on the explosion proof exhaust fan.\nA?    200 ppm A?  closes the king valves on both High Pressure Receivers and the \n    "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000007036,
      "SummaryText": "                liquid injection valve and turns on the A?HIGHA? ammonia pilot\n                    light on the control panel.  \nA?    0.7%    A?      shunts all engine room electrical power that is not explosion proff \n                    and all power passing through the engine room as per NEC and IIAR \n                    Code.\n\nSystems handling ammonia are inspected and/or monitored on a regular basis.  System temperatures and pressures are monitored continuously by visual inspections.  Compressor efficiency is also monitored by system operators.\n\nThe gate at the Turner Road Vintners facility is locked at all times.  To gain access to the facility, visitors must enter through a gate located on the East facility property.  The guard at the East facility (4614 West Turner Road) will require the visitor/contractor to sign-in.  Then, a gate opener for the West facility will be given to the visitor/contractor to gain admittance.  The guard on duty at the East facility has video camera access to the Turner Road Vintners facility (5852 West Turner Road).  \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nA complete PSM/RMP compliance audit conducted on March 10, 2009  generated mitigation measures (recommendations) to improve safety at the Turner Road Vintners facility located in Lodi, California.  In addition, the Process Hazard Analysis Revalidation study performed on May 12, 2009 also generated mitigation measures and led to program improvements. The mitigation measures include additional training, key maintenance related tests/inspection, and enhanced emergency response policies and procedures.  The Turner Road Vintners safety committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n1. Continue to train all employees in the facility Safety Plan/Programs.\n\n2. Continue to have employee involvement in Safety Plan Develop"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000007036,
      "SummaryText": "ment.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n"
    }
  ]
}