{
  "FacilityID": 1000080470,
  "FacilityName": "San Juan Water District",
  "FacilityStr1": "9935 Auburn Folsom Road",
  "FacilityStr2": null,
  "FacilityCity": "Granite Bay",
  "FacilityState": "CA",
  "FacilityZipCode": "95746",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06061",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.714908",
  "FacilityLongDecDegs": "-121.173597",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A3",
  "LatLongDescription": "CE",
  "FacilityURL": "9935 AUBURN FOLSOM RD",
  "FacilityEmailAddress": "salcantara@sjwd.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "San Juan Water District",
  "OperatorStr1": "9935 Auburn Folsom Road",
  "OperatorStr2": null,
  "OperatorCity": "Granite Bay",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95746",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tony Barela",
  "RMPTitle": "Operations Manager",
  "FTE": 43,
  "OtherEPAFacilityID": "CAL000073350",
  "EPAFacilityID": "100000129504",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-10-04 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 38.7231,
  "FRS_Long": -121.17518,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100510,
      "AltID": "Disinfection",
      "FacilityID": 1000080470,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101751,
          "ProcessID": 1000100510,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125880,
          "ProcessID": 1000100510,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625880,
          "ProcessID": 1000100510,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080470,
      "SummaryText": "San Juan Water District has instituted a Risk Management Program for their water treatment facility, Sidney Peterson Water Treatment Plant, as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68.  The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substances (RS's) handled at this facility in excess of Federal threshold quantities; describes the structured assessment of hazards which was conducted to assess possible effects on employees and offsite public and environmental receptors; provides the results of an offsite consequences analysis; defines a prevention program, emergency response program, and mitigation measures to reduce the probability and magnitude of accidental releases of RS's; and establishes a schedule and responsibilities for implementation of mitigation measures and auditing of program elements.  This Risk Management Plan (RMP) has been filed and updated as required by ARP regulations in order to report the elements of the current Risk Management Program and to describe further measures planned to mitigate or prevent accidental releases of RS's.  A copy of this RMP has been filed with the cognizant local Administering Agency, Placer County Environmental Management Department, as required by California Accidental Release Prevention Program (CalARP) regulations.\n\n\n\nThis RMP revision is a revalidation as required every 5 years by Federal and California regulations. \n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n\n\nSan Juan Water District's Sidney Peterson Water Treatment Plant uses chlorine for disinfection in quantities greater than the Federal threshold quantity for this RS.  The facility is located near Folsom Reservoir in a semi-rural neighborhood in Granite Bay.  There are 43 full-time employees at this site.  Chlorine is received in ton containers by truck, handled with an electric hoist, and stored on ton container sc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080470,
      "SummaryText": "ales and trunnion sets within an enclosed building adjacent to the control building.  This building contains two storage and deeding rooms and one injector room.  The entire building is serviced by a dry media scrubber capable of  of neutralizing up to two Tons of chlorine. The chlorine is used to control biological growth on the filters and to disinfect the treated water.  Pressurized chlorine gas within a ton container is piped via flexible copper pigtails and steel piping through a gas filter to one of two vacuum regulator valves.  From there, the chlorine (under vacuum) is metered through rate valves and rotameters in chlorinators located in room situated between the two storage rooms.  It is drawn into water solution by the passage of pressurized water through an injector.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nIt is the policy of San Juan Water District that the receipt, storage and handling of chlorine at its facility be done in a manner which meets regulatory requirements and minimizes the probability and severity of accidental releases of chlorine to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment.  In order to accomplish this goal, San Juan Water District has gathered safety information on chlorine and on the process, equipment and procedures involving chlorine; performed and updated a structured assessment of hazards of the process and external events which might affect the process; performed an offsite consequences analysis of defined release scenarios; established a written program for prevention and mitigation of accidental releases; and established a written emergency response program coordinated with emergency response agencies.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\n\n\nGeneral accidental release prevention programs instituted by San Juan Water District are categorized as administrative (management) programs; procedures, training, and engineering control"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080470,
      "SummaryText": "s; and emergency response programs. San Juan Water District has instituted a Process Safety Management (PSM) Program meeting OSHA requirements at 29 CFR 1910.119 and Cal/OSHA requirements at 8 CCR 5189 covering the disinfection process.  This constitutes the general accidental release prevention program for San Juan Water District's operations.  The program and document management procedures included in the PSM Program are used as the management system for the Risk Management Program.\n\n\n\nCHEMICAL-SPECIFIC RELEASE PREVENTION STEPS\n\n\n\nRelease prevention steps specific to chlorine have been identified and implemented.  These include, among other things, containing the chlorine in a separate building that can control a potential release of chlorine, providing training to selected employees and requiring non-essential personnel to exit the water treatment plant prior to any work being performed on the chlorine system.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no accidents involving chlorine at this facility within the past five years resulting in injuries or offsite consequences.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nSan Juan Water District's Emergency Response Program applicable to chlorine has been coordinated with South Placer Fire District, the local agency responsible for hazardous materials release response coordination.  San Juan Water District is a non-responding organization  with respect to chlorine releases at its facilities.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nAll of the improvements and mitigation measures identified in the process hazard analysis which San Juan Water District committed to accomplish have been completed or are in progress.  Any other measures identified by employees during workplace hazard surveys, or as a result of audit activities, will be thoroughly reviewed and considered for implementation.\n\n"
    }
  ]
}