{
  "FacilityID": 1000048488,
  "FacilityName": "DEL MAR COLD STORAGE",
  "FacilityStr1": "1720 WEST BEACH RD.",
  "FacilityStr2": null,
  "FacilityCity": "WATSONVILLE",
  "FacilityState": "CA",
  "FacilityZipCode": "95076",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06087",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.897506",
  "FacilityLongDecDegs": "-121.779798",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.delmarfoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "DEL MAR FOOD PRODUCTS CORP.",
  "Company2Name": null,
  "CompanyDUNS": 9125949,
  "Company2DUNS": 0,
  "OperatorName": "DEL MAR FOOD PRODUCTS CORP.",
  "OperatorStr1": "P.O. BOX 891",
  "OperatorStr2": null,
  "OperatorCity": "WATSONVILLE",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95077",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lee Haskin",
  "RMPTitle": "VP of Operations",
  "FTE": 50,
  "OtherEPAFacilityID": "CAL000091178",
  "EPAFacilityID": "100000108368",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-11-08 00:00:00",
  "SafetyInspectionBy": "Consulting Engineer",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-01-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-01-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-01-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-01-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 36.89672,
  "FRS_Long": -121.7788,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060721,
      "AltID": "Refrigeration System E",
      "FacilityID": 1000048488,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000061845,
          "ProcessID": 1000060721,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000074328,
          "ProcessID": 1000060721,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000574328,
          "ProcessID": 1000060721,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048488,
      "SummaryText": "A.    EXECUTIVE SUMMARY\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policy\n\n\n\nDel Mar Cold Storage has inspection procedures to review refrigeration equipment prior to startup and during operations. These procedures identify potential sources of release and equipment corrections required to prevent these releases. Onsite personnel and certified refrigeration contractors review the equipment as required.\n\nOnsite personnel provide initial emergency response. Onsite personnel will make a preliminary assessment in the event of a release and will provide first response. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an off-site release. No emergency operations will be performed that are beyond the capabilities of the operators or other onsite personnel. Local fire and police departments with mutual aid response will provide emergency response for a major release event. The refrigeration contractors would also be on-call to provide emergency response.\n\nEmergency response training will be conducted yearly for current employees and as required to for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\n\n\n\n\n\n2.    Description of Source and Substance Handled\n\n\n\nDel Mar Cold Storage uses anhydrous ammonia as a refrigerant in their operations and chlorine to disinfect their well water to be used in produce processing. Figures III-1 and III-2 show the facility location map and site plan, respectively.\n\n\n\nAmmonia\n\n\n\nThe ammonia system is used for cold storage, freezer storage, product freezing and water chilling. There are five separate system at the facility. The largest system with the potential greatest off-site consequence was started in 1994 and was constructed as per applicable codes and industry standards. There are four other smaller systems, which vary in age from 20 to 50 years. The total charge for all the refrigerati"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048488,
      "SummaryText": "on systems is approximately 27,900 lb. System E (Spinach and Sprout Processing) is the only  individual system subject to requirement for EPA RMP compliance. System E has 13,000 lbs ammonia which is higher than EPA threshold limit of 10,000 lbs.\n\nThe refrigeration systems at this facility are either single or two stage vapor compressor cycles. In general, the process chemistries for these systems are shown in Section V.\n\nA list of refrigeration equipment used at this facility can be found in the schedules located in Appendix B - Refrigeration System Drawings. The Ammonia Refrigeration Safety Inspection (IIAR) Checklists, located in Appendix A, describe equipment details. Figures III-3 through III-8 show the five separate refrigeration system layouts.\n\nAnhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/ or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. See Appendix C for Material Safety Data Sheet for Anhydrous Ammonia.\n\n\n\nChlorine\n\n\n\nChlorine is used to disinfect well water, which is then used as process water. The chlorine is stored in 150 lb. gas cylinders chained in a bin located outdoors next to the well shed. Only one cylinder is used at a time. The cylinder in use is secured separately with chain to a support system that is anchored to the ground. The cylinder in use is connected to the chlorine feed system which injects chlorine into the well pump discharge line that supplies the facility water. Once cylinders are empty, they are replaced and chained into another storage bin. The location of the chlorine system can be found on Figure III-9 and a detailed P&ID can be f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048488,
      "SummaryText": "ound in Appendix B.\n\nDel Mar Cold Storage maintains one storage bin with full cylinders, where they will keep no more than (16) 150 lb. cylinders at a time for a maximum charge of 2,400 lbs of chlorine. Therefore, the facility does not exceed the 2,500 lb. requirement for EPA RMP compliance; instead, chlorine is included in this RMP to satisfy local state requirements.\n\nChlorine is a toxic gas that irritates the respiratory system. Because it is heavier than air, it tends to accumulate at the bottom of poorly ventilated spaces. Chlorine is a strong oxidizer, which may react with flammable materials. Chlorine is detectable with measuring devices in concentrations as low as 0.2 ppm and by smell at 3 ppm. Coughing and vomiting may occur at 30 ppm and lung damage at 60 ppm. About 1000 ppm can be fatal after a few deep breaths of the gas. Breathing lower concentrations can aggravate the respiratory system, and exposure to the gas can irritate the eyes. See Appendix C for Material Safety Data Sheet for Chlorine.\n\n\n\n3.    Accidental Release Prevention Program\n\n\n\nDel Mar Cold Storage maintains a release prevention program to eliminate or minimize releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases for ways to prevent a similar future release, see Appendix N - Incident Investigation.\n\n\n\nAmmonia\n\n\n\nThe ammonia refrigeration system has specific safety procedures to prevent a release. Operators and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency response procedures in the event of an ammonia release. Some mechanical rooms have emergency shut off switches outside the mechanical room for shutting down the system. Facility is also in the process of installing ammonia detectors in the mechanical rooms. Once the detectors are installed personnel will be notified in case of an ammonia le"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048488,
      "SummaryText": "ak. Monitoring is 24 hours per day. Systems C and E have emergency control boxes and diffusion tanks, which allows system pressure to be relieved manually; system A also has a diffusion tank, but not emergency control box.\n\n\n\nChlorine\n\n\n\nChlorine injection system is located in locked and fenced area and access is limited to certain personnel. Cylinders are stored in bins and strapped with chains.  All cylinders are under a shade.  Chlorine injection system works under vacuum created by well water going through venture ejector. So if the water supply to ejector stops or vacuum is lost due to tube rupture or for any other reason, the spring loaded inlet valve immediately closes and isolates the gas supply.\n\n\n\n4.    Emergency Response Program\n\n\n\nIn event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures. The Safety Coordinator is responsible in coordinating emergency response and will be contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by the release. The Safety Coordinator will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if offsite evacuations are required. A description of the Emergency Response Program is included in Appendix R.\n\n\n\n5.    Five-Year Accident History\n\n\n\nAccording to Del Mar Cold Storage personnel, in the past five years there have been no releases of anhydrous ammonia or chlorine resulting in reportable quantities or injuries.\n\n\n\n6.    Planned Safety Improvements\n\n\n\nSpecific recommendations resulting from the PHA and safety inspection are listed in Appendix G as Hazard Mitigation Recommendations and in the compliance audit as Findings & Recommendations. Some of these safety improvement measures include installation of upgraded piping and equipment supports, upgrading of pressure relief systems, adding ammonia diffusion tank, labeling of piping, valves, and equi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048488,
      "SummaryText": "pment, and implementation of a program aimed specifically at the maintenance, training, and emergency response procedures for the ammonia based refrigeration equipment.\n\nRelief valves on Systems A, C, and E are piped to ammonia diffusion tanks to prevent releases to atmosphere. Rest of the relief valves on Systems B and D are piped discharging to atmosphere. Currently, there are plans to pipe System B relief valves into System A diffusion tank and convert System D to a Freon system.\n\n"
    }
  ]
}