{
  "FacilityID": 1000069711,
  "FacilityName": "Keystone Generating Station",
  "FacilityStr1": "313 Keystone Drive",
  "FacilityStr2": null,
  "FacilityCity": "Shelocta",
  "FacilityState": "PA",
  "FacilityZipCode": "15774",
  "Facility4DigitZipExt": "2305",
  "FacilityCountyFIPS": "42005",
  "LEPC": "Armstrong County LEPC",
  "FacilityLatDecDegs": "40.658333",
  "FacilityLongDecDegs": "-079.340278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 86204245,
  "ParentCompanyName": "Keystone-Conemaugh Projects, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Keystone-Conemaugh Projects, LLC",
  "OperatorStr1": "175 Cornell Rd.",
  "OperatorStr2": "Suite 1",
  "OperatorCity": "Blairsville",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15717",
  "OperatorZipCodeExt": null,
  "FTE": 166,
  "OtherEPAFacilityID": "PAD086204245",
  "EPAFacilityID": "100000033778",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "TV-03-00027",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Keystone RMP 2007 Revision",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-05-19 14:23:05",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-05-18 11:25:09",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-05-18 11:25:09",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-05-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.658463,
  "FRS_Long": -79.339802,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "6",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000087315,
      "AltID": "Aqeuous ammonia for SCR",
      "FacilityID": 1000069711,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108877,
          "ProcessID": 1000087315,
          "ChemicalID": 57,
          "Quantity": 1900000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000088518,
          "ProcessID": 1000087315,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000069711,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-06-01 00:00:00",
    "ERTrainingDate": "2016-07-01 00:00:00",
    "CoordinatingAgencyName": "Armstrong County LEPC",
    "CoordinatingAgencyPhone": "7245483431",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "PA special water pollution regulations at 25 PA Code, Chapter 101; PA spill prevention response plan at 35 PS Section 6021.901-904; PA contingency plan at 25 PA Code §288.171",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000069711,
      "SummaryText": "INTRODUCTION\r\n\r\nGenOn Northeast Management Company (GenOn) operates a coal-fired, electric power generating station near Shelocta, Pennsylvania. This 1,459-acre facility, known as Keystone Station, is located 45 miles northwest of Johnstown, PA, and 14 miles west of Indiana, PA near state route 210 and US route 422.  \r\n\r\nKeystone station employs almost 200 full-time staff and a considerable number of contract employees.  The secondary economic impact of the facility on its many material and services suppliers is significant.  For example, the station provides employment for many coal miners and trucking firms.\r\n\r\nThe station is a major component of the billion-dollar power development in the Chestnut Ridge area.  The station was constructed by investor-owned utilities representing four eastern states.  GenOn operates Keystone station as agent for the following utility owners (with percentage of ownership):\r\n\r\n- Chief Keystone Power, LLC - 44.45%\r\n-Keystone Power Pass-Through Holders LLC- 16.67%\r\n- Keystone Power LLC - 3.70%\r\n- Montour, LLC - 12.34%\r\n- PSEG Fossil LLC - 22.84%\r\n\r\n\r\nThe facility generates 1700 MW of power from two identical, 850 MW units.  Each unit has a state-of-the-art pollution control system for particulate and special burners to reduce nitrogen oxide (NOx) emissions.\r\n\r\n\r\n1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE\r\n\r\nKeystone Station's policy is to comply with all applicable regulatory requirements, including those for accidental release prevention and emergency response.\r\n\r\n\r\n2. THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\r\n\r\na. PRIMARY ACTIVITIES  This facility is a coal-fired, electric-power generating station.\r\n\r\nb. USE OF REGULATED SUBSTANCES\r\n\r\n-- The aqueous ammonia injection system at Keystone Station is designed to remove nitrogen oxides (NOx) from boiler flue gas by Selective Catalytic Reduction (SCR) equipment.  This is accomplished by injecting a 30-percent ammonia solution int"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000069711,
      "SummaryText": "o the flue gas before it is passed over a catalyst.\r\n\r\nNo other toxic or flammable materials are stored at the facility in quantities above the regulatory threshold.\r\n\r\nc. QUANTITIES HANDLED OR STORED \r\n\r\n-- The aqueous ammonia system is comprised of four 66,000-gallon storage tanks, pumps, and piping, instrumentation and controls.  The storage tanks are in a concrete diked area for secondary containment.  Tanker truck unloading is also provided with secondary containment.   \r\n\r\n\r\n3. THE WORST-CASE RELEASE SCENARIO \r\n\r\na. WORST CASE RELEASE SCENARIOS\r\n\r\nFour 66,000-gallon tanks are used to store aqueous ammonia; the tanks are only filled to 62,759 gallons per Checklist OP-#731.  The WCS assumes that the entire contents of one ammonia tank is spilled into the common secondary containment area over time.  The WCS can include the effects of passive mitigation systems, and for Keystone Station this is the use of secondary containment to minimize ammonia liquid spills.  The quantity released is calculated as:\r\n\r\n62,759 gallons * 7.76 lb/gal = 487,010 lbs\r\n\r\nPer EPA guidance, because the horizontal surface area of the secondary containment system (3,885 ft2) is less than that of the worst-case liquid pool (no secondary containment, one-centimeter deep pool) the rate of volatilization of ammonia from secondary containment is calculated as:\r\n\r\n1.4 x LFA (0.026 lb/min/ft2) x 3,885 ft2  = 141 lb/minute\r\n\r\n\r\nc. DISTANCES TO ENDPOINT: The offsite consequences of the accidental releases were evaluated with a screening computer dispersion model (RMP*Comp, version 1.07).  Offsite consequence analysis of the worst-case scenario must include the following weather conditions: a wind speed of 1.5 m/s (3.4 mph), \"F\" atmospheric stability class, a temperature of 77°F, and relative humidity of 50%.  \r\n\r\nThe maximum calculated distance to the endpoint using the RMP*Comp model is 0.7 miles for the worst-case scenario for  aqueous ammonia.  This represents the maximum downwind distance that"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000069711,
      "SummaryText": "the catastrophic release (under worst-case weather conditions) could pose a hazard to the public. MARPLOT indicated a public receptor within 0.7 miles; however it was confirmed by plant personnel that the area designated by MARPLOT is an industrial (coal mining) complex. There is no residential population at this location. \r\n\r\n4. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThere are many safety programs in place at the station to minimize the potential for the accidental releases of aqueous ammonia considered by this plan.  For example:\r\n\r\n >The aqueous ammonia storage tanks are registered pressure vessels that are built to exacting standards.\r\n\r\n >Aqueous Ammonia tank trucks are only unloaded during daylight hours on weekdays.\r\n\r\n >Administrative controls are used to ensure that the aqueous ammonia tank is not filled above the approximately 95% level.\r\n\r\n \r\n5. FIVE-YEAR ACCIDENT HISTORY: No accidents as defined in 40 CFR Part 68 have occurred during the past five years at this site.\r\n\r\n\r\n6. THE EMERGENCY RESPONSE PROGRAM : In the unlikely event that an accidental release of aqueous ammonia would occur, the station has prepared a detailed written emergency response plan.  This plan has been in place for many years, and yearly drills are held to test the plan under simulated conditions.\r\n\r\n\r\n7. PLANNED CHANGES TO IMPROVE SAFETY: All station safety programs, including the emergency response program, are reviewed periodically for improvement opportunities."
    }
  ]
}