{
  "FacilityID": 1000119606,
  "FacilityName": "Chemsolv Rock Hill Facility",
  "FacilityStr1": "120 East Mt Gallant Road",
  "FacilityStr2": null,
  "FacilityCity": "Rock Hill",
  "FacilityState": "SC",
  "FacilityZipCode": "29730",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45091",
  "LEPC": "York County LEPC",
  "FacilityLatDecDegs": "34.9486138",
  "FacilityLongDecDegs": "-80.9862555",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.chemsolv.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 98448251,
  "ParentCompanyName": "Catapult Midco, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Chemsolv Inc.",
  "OperatorStr1": "1111 Industry Avenue, SE",
  "OperatorStr2": null,
  "OperatorCity": "Roanoke",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "24013",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": "SCR000792689",
  "EPAFacilityID": "100000227373",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-06-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2025-01-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2025-01-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2025-01-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2030-01-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 34.948614,
  "FRS_Long": -80.986256,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000149273,
      "AltID": "Aqua Ammonia",
      "FacilityID": 1000119606,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000186607,
          "ProcessID": 1000149273,
          "ChemicalID": 57,
          "Quantity": 24900.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000150866,
          "ProcessID": 1000149273,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000089833,
              "Process_NAICS_ID": 1000150866,
              "SafetyReviewDate": "2025-01-15 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "Yes",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2025-01-14 00:00:00",
              "ChangeCompletionDate": "2025-01-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "All manual process - procedures ensure safe storage and movement of containers",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Indoor storage",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "per shift container inspection",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2025-01-03 00:00:00",
              "TrainingReviewDate": "2025-01-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "online training-based testing",
              "MaintenanceReviewDate": "2025-01-15 00:00:00",
              "EquipmentInspectionDate": "2024-12-09 00:00:00",
              "EquipmentTested": "Forklifts",
              "ComplianceAuditDate": "2025-01-30 00:00:00",
              "AuditCompletionDate": "2025-01-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000090721,
                  "PreventionProgram2ID": 1000089833,
                  "ProcessChemicalID": 1000186607
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000119606,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2025-01-15 00:00:00",
    "ERTrainingDate": "2024-08-30 00:00:00",
    "CoordinatingAgencyName": "Rock Hill Fire Department",
    "CoordinatingAgencyPhone": "8033297220",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "Yes",
    "ExercisePlanDate": "2025-01-30 00:00:00",
    "NotificationDrill": "Yes",
    "NotificationDrillDate": "2024-12-11 00:00:00",
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "Yes",
    "LEPCCoordinationDate": "2024-08-26 00:00:00",
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "Yes",
    "LocalResponseAgencyCoordinationDate": "2024-08-26 00:00:00",
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000119606,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\nThe distribution facility is located at 120 E Mt Gallant Road in Rock Hill, South Carolina, in an industrial park.  \n\nThe company is a member of the Alliance for Chemical Distribution dedicated to the code of management practice of the Responsible Distribution Process. The safe management of chemical products is considered priority to minimize the risk to our community, environment, and personnel. \n\nAdditionally, Chemsolv, Inc. manages the facility in compliance with all Occupational Safety & Health Administration (OSHA), Environmental Protection Agency (EPA), Department of Homeland Security (DHS), Virginia Department of Environmental Protection (DEQ) and the United States Department of Transportation (USDOT) regulations.  \n\nTo ensure the facility continues to operate in a safe and responsible manner in compliance with all regulations, an extensive risk management system has been developed and integrated into our operating procedures. \n\nSignificant components of the system include training, operating procedures for chemical handling, inspection, maintenance, emergency response, and incident management. These procedures provided to responsible personnel and management's continual compliance oversight ensures safe chemical management.\n\nThe CEO, Director of Environmental, Health, Safety & Quality, and the Plant Manager are designated as having the primary responsibility and accountability to ensure the plan and all components are in compliance and implemented.\n\nStationary Source Description and Regulated Substances Handled\n\nThe facility is used for receipt, storage, and distribution of chemical products.  There is no reactive chemistry conducted at the site. \n\nBoth liquid and dry chemicals are received, relabeled and placed in storage for shipment to industrial, agricultural, government, food, and cosmetic customers.  These packaged containers include pails, drums and totes. \n\nThe containers are stored in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000119606,
      "SummaryText": "secured areas to prevent accidental damage and in an area away from equipment traffic and chemicals that may, during an incident, contribute to a release from these containers. Only authorized and trained personnel are permitted to handle the containers. \n\nAqua ammonia arrives at the facility in 55-gallon drums and 275/330-gallon totes. The drums are palletized and single or double stacked in an area with limited access away from traffic. \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe facility has an aggressive accidental release prevention program that is based upon employee training, chemical safety awareness, equipment and facility management. \n\nTraining includes both the classroom environment and observation by management to verify competency. Classes are designed to achieve maximum results within the time period on an annual basis. Knowledge is evaluated by both verbal questioning for some classes during the training and some classes have written tests. Attendance is mandatory for all employees including packagers, maintenance, drivers, and warehouse personnel and verified by both the Director of Environmental, Health, Safety & Quality and the HR Manager. \n\nNew employees are required to receive an extensive orientation to the operating procedures for each phase of the operation including Hazard Communication, Hazardous Material Transportation, Chemicals & Personal Hygiene, Forklift, Personal Protection Equipment, Respiratory Training, Site Security, Emergency Contingency, hazard recognition, Risk Management Program, and safe work practices. Additionally, the operators have specific spill response, clean-up, and emergency response training in the respective Learn to Earn matrix. \n\nEmployees not having worked in a process receive an introduction by thorough procedural documentation review and pairing the employee with a person familiar with the process for an appropriate period. Management within the guidelines of the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000119606,
      "SummaryText": "program verifies competency of safe operating practices.\n\nThe company provides training according to the following regulatory and association requirements:\n\nHazard Communication\nSite Security\nEnvironmental Compliance Plan-Corporate Plan\nSafety in the Workplace\nSafety Code Book (Corporate Safety Book)\nLockout/Tagout\nConfined Spaces\nAccident Procedures\nPersonal Protective Equipment\nPortable Fire Extinguishers\nChemicals & Personal Hygiene\nPowered Industrial Trucks (forklifts)\n  Safety Inspection and Maintenance\n  Stability and Capacity\n  Load Handling\n  Traveling and Maneuvering\nRailcar Offloading Procedures\nDrum and Toting Procedures\nHazardous Materials\nPersonal Protection Equipment\nBloodborne Pathogens\nHazardous Chemical Containers\nTanker Loading/unloading procedures\nHow to Handle Corrosives\nHow to Handle Solvents\nRespiratory Training\nEmergency Contingency Plan\nHeat Stress (prevention, identification, and first aid: heat rash, heat cramps, heat syncope, heat\nexhaustion, and heat stroke)\nUniversal Waste (including mercury spills)\nHazard Reporting (and using the Hazard Reporting Form)\nSafety Concepts (Incidents, near miss, unsafe acts/conditions, OSHA first aid, incident ratio model)\nChemical Spill Response\nRCRA Training (annual third-party)\nUnited States Department of Transportation Federal Highway Administration Federal Motor Carrier Safety Regulations and Research and Special Programs Administration\nDOT HAZMAT (annual third-party)\nResponsible Distribution Programs and Procedures\nAlliance for Chemical Distribution Responsible Distribution Process\nFacility Management\nProduct Stewardship\nWaste Management\nCommunity Outreach\nCarrier Selection\n\nMaintenance Systems\n\nThe program includes an aggressive maintenance and process inspection system to verify all systems are in proper working order and repairs are accomplished promptly to minimize the risk of release from equipment failure. \n\nQualified and competent operators perform pre and post inspections for the transportation"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000119606,
      "SummaryText": "equipment used to move product on the public roads and highways.  Chemsolv maintains the vehicles according to a strict schedule with a strong reputation in transportation equipment maintenance. \n\nAll drums and totes are designed for and dedicated to specific products. Each container is inspected upon receipt and prior to off-site shipment. \n\nMaterial handling equipment such as fork lifts are inspected daily and each unit receives periodic maintenance according to a schedule. All equipment used in the handling of material are routinely inspected for defects and promptly removed from service when found defective. \n\nThe loading and unloading areas for transport vehicles are on concrete surfaces. A release occurring during the loading or unloading of containers can be contained to this area. \n\nMaterials stored within buildings are located in areas specific to their hazard class to prevent one group of hazard class from impacting another during an incident. \n\nAll buildings are constructed of poured concrete floors to minimize the possibility of a release contacting the ground and impacting the environment. Equipment used in the areas to move containers is designed for their intended use. \n\nStorage areas are routinely inspected according to a schedule to minimize risks associated with improper material storage. \n\nThe grounds are secured to prevent unauthorized access to the facility.\n\nFive-year Accident History\n\nChemsolv has not incurred a reportable incident for aqua ammonia in the 5 years since the last RMP update. \n\nEmergency Response Program\n\nThe emergency response program document and procedures were developed when the Environmental Protection Agency enacted the Superfund Amendment and Reauthorization Act known as the Emergency Planning and Community Right-To-Know Program or SARA Title III. \n\nThis program requires facilities having certain regulated substances in amounts exceeding threshold quantities to notify the Local Emergency Planning Committees (LEPC) and fir"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000119606,
      "SummaryText": "e departments that would respond to the facility in an emergency of the existence of these substances. \n\nThis information is updated annually and made available to the public through the LEPC. Documentation includes the chemical inventory of regulated substances, the container types and storage conditions, maximum amounts at the site during the year, average daily amounts and the number of days on site. \n\nIn addition, site descriptions, drawings of the facility, locations within the facility of each chemical, surface area, equipment locations as well as emergency equipment are included in the documents. \n\nThe emergency response and contingency plan developed and coordinated with local responders includes a description of emergency response equipment on site, contacts names and phone numbers, procedures for public notice, guidelines for notifying emergency response agencies and personnel, information gathering forms and methods and reports that must be completed and filed with regulatory agencies. \n\nThe emergency response team is 40-hour HAZWOPER certified in response techniques. The program provides training for hazardous incident recognition, personnel protection equipment selection and use, characteristics of hazardous chemicals and the methods for response, cleanup and decontamination.\n\nPlanned Changes to Improve Safety\n\nPlans are continually updated to improve management of chemicals and reduce the risks associated with handling chemical products. \n\nChemsolv initiated a major improvement to its risk management through the implementation of a Chemsolv Safe Work Permits & Preliminary Risk Analysis (PRA) on 9/28/2018 that utilizes a checklist format and consolidates all work permits under one system. It asks the same questions that a thorough job briefing would ask, but in a systematic way by guiding through the major hazards in a checklist form. We review the checklist at the work site and mark which hazards are present. Yellow hazards must be addressed during the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000119606,
      "SummaryText": "completion of the step by step job plan, Red hazards require the completion of the appropriate work permit. The permits are basically additional checklists for the special hazards that are identified. The step by step plan analyzes the work for the hazards of each step. The hazards are identified and what will be done to control them. These are assigned to an individual and then we re-evaluate and decide if the hazards are adequately controlled. The PRA is required for all non-routine work, requires two people to issue and release, and allows us to systematically identify and control hazards in the workplace. This system does not change the original prohibition of \"No hot work near any covered process\" but emphasizes and enforces this safeguard to include ALL flammable processes. \n\nPlan updates are the result of coordination with local responders, inspections by regulatory agencies, training sessions, process changes, and new risk management programs and regulations enacted by the government. \n\nPresently all areas are being studied to identify technically, procedurally and economically feasible passive and active risk management strategies to further enhance the safe operation of the facility."
    }
  ]
}