{
  "FacilityID": 1000025417,
  "FacilityName": "Lake Arlington Compressor Station",
  "FacilityStr1": "6900 E. Rosedale Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Fort Worth",
  "FacilityState": "TX",
  "FacilityZipCode": "76112",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.726588",
  "FacilityLongDecDegs": "-97.211247",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Crestwood Midstream Partners",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Crestwood Midstream Partners",
  "OperatorStr1": "1200 Summit Ave",
  "OperatorStr2": "Suite 320",
  "OperatorCity": "Ft. Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76102",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000216508",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-03-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-03-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-03-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-04-01 00:00:00",
  "DeRegistrationEffectiveDate": "2021-03-26 00:00:00",
  "AnniversaryDate": "2017-03-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 32.726588,
  "FRS_Long": -97.211247,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000031223,
      "AltID": "Lake Arlington Comp. Sta.",
      "FacilityID": 1000025417,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000037822,
          "ProcessID": 1000031223,
          "ChemicalID": 93,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000031534,
          "ProcessID": 1000031223,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000027056,
              "Process_NAICS_ID": 1000031534,
              "SafetyReviewDate": "2016-12-01 00:00:00",
              "PHA_Date": "2015-11-11 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-02-15 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-11-20 00:00:00",
              "TrainingReviewDate": "2017-01-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-11-20 00:00:00",
              "EquipmentInspectionDate": "2016-08-25 00:00:00",
              "EquipmentTested": "PSVs",
              "ChangeMgmtDate": "2016-12-12 00:00:00",
              "ChangeMgmtReviewDate": "2015-10-16 00:00:00",
              "PreStartupReviewDate": "2016-09-22 00:00:00",
              "ComplianceAuditDate": "2016-12-02 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2016-10-26 00:00:00",
              "InvestigationChangeDate": "2016-11-01 00:00:00",
              "ParticipationPlansReviewDate": "2015-10-16 00:00:00",
              "HotWorkPermitReviewDate": "2015-10-16 00:00:00",
              "ContractorSafetyReviewDate": "2015-10-16 00:00:00",
              "ContractorSafetyEvalDate": "2015-10-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000032515,
                  "PreventionProgram3ID": 1000027056,
                  "ProcessChemicalID": 1000037822
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000025417,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-01-15 00:00:00",
    "ERTrainingDate": "2017-01-15 00:00:00",
    "CoordinatingAgencyName": "Tarrant County LEPC",
    "CoordinatingAgencyPhone": "8178841804",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000025417,
      "SummaryText": "provide guidance on how to respond to upper or lower limit exceedence for specific process or equipment parameters.  This information, along with written operating procedures, is readily available to operators in the process unit and for other personnel to use as necessary to safely perform their job tasks. \r\n\r\nTraining\r\n\r\nTo complement the written procedures for process operations, the Lake Arlington Gas Plant has implemented a comprehensive training program for all employees involved in operating a process.  New employees receive basic training in facility operations if they are not already familiar with such operations.  After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks.  After operators demonstrate (e.g., through tests, skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently.  In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted on an as needed basis.  All of this training is documented for each operator, including the means used to verify that the operator understood the training.\r\n\r\nContractors\r\n\r\nThe Lake Arlington Gas Plant uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the plant has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in event of an emergency, (5) understand and follow site safety rules, and (6) inform facility personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a pr"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000025417,
      "SummaryText": "Executive Summary - Lake Arlington Gas Plant\r\n\r\nCrestwood Midstream Partners LP, owner and operator of the Lake Arlington Gas Plant, has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Crestwood's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, facility trained personnel will respond to control and contain the release. \r\nDescription of the Stationary Source and Regulated Substances\r\n\r\nNatural gas is gathered from wells in the surrounding fields and sent to Lake Arlington for processing prior to being sold for domestic consumption. Lake Arlington gas contains water that must be brought into specification before residue companies will purchase this gas. \r\n\r\nLake Arlington is designed to remove water with Tri-ethylene glycol (TEG). Steam vapors from the TEG units are condensed and disposed of properly. Three glycol units operate in a continuous loop; treating gas and regenerating treatment fluids. These systems are highly automated and operate with minimal interruptions.\r\n\r\nGas flow into this facility is at low pressure; approximately 150 psig. Sales line pressure ranges from 850 to 1000 psig; therefore this gas requires boost compression. Lake Arlington includes electric and gas fired driven compression units that boost gas up to sales line pressure.\r\n\r\nAuxiliary equipment consists of lube oil, methanol, antifreeze, glycol, and drain system storage. Lake Arlington has air compression/drying equipment, and gas lift compression. This facility is also equipped with a control room, various motor control rooms and a vent system. \r\n\r\nFor a more detailed description of this facility please consult this Operating Manual and study facility process and instrument diagrams.\r\n\r\nThe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000025417,
      "SummaryText": "processes at the plant are interconnected by piping and fit the EPA's definition of a stationary source in 40 CFR part 68. The facility contains three sources of regulated substances held over their respective threshold quantities; plant gas consisting of mostly methane. \r\n\r\nGeneral Accident Release Prevention and Program Information\r\n\r\nThe following is a summary of the accident prevention program in place for the process at the facility. Because the processes at the Lake Arlington Gas Plant that are regulated by the Environmental Protection Agency's (EPA's) risk management program (RMP) regulation are also subject to the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\n\r\nEmployee Participation\r\n\r\nCrestwood Midstream Partners LP encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the facility accident prevention program.  Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the facility.\r\n \r\nProcess Safety Information\r\n\r\nCrestwood Midstream Partners LP keeps a variety of technical documents that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information.  The reference documents are maintained on file at the facility to provide open access.\r\n\r\nChemical-specific information, including exposure hazard"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000025417,
      "SummaryText": "s and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).  This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  For the process, the facility has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in key process parameter documents.  The facility ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\r\nThe Lake Arlington Gas Plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\n\r\nProcess Hazard Analysis (PHA)\r\n\r\nCrestwood Midstream Partners LP has a comprehensive program to help ensure that hazards associated with the process are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.  \r\n\r\nCrestwood Midstream Partners LP primarily used the hazard and operability (HAZOP) analysis technique to perform this evaluation.  HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques.  The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000025417,
      "SummaryText": "of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\r\n\r\nThe PHA team findings are forwarded to local and corporate management for resolution.  Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team.  This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention.  All approved mitigation options in response to PHA team findings are tracked until they are completed.  The final resolution of each finding is documented and retained.\r\n\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the Lake Arlington Gas Plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted when major changes occur at the facility.  The results and findings from these updates are documented and retained.  Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.  \r\n\r\nOperating Procedures\r\n\r\nLake Arlington Gas Plant maintains written procedures that address various modes of operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and annually certified as current and accurate.  The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process.\r\n\r\nIn addition, the Lake Arlington Gas Plant maintains key process parameter documents that"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000025417,
      "SummaryText": "ocess overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work.  In addition, Crestwood Midstream Partners LP has a program in place to evaluate contractor safety programs and performance. Facility personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\r\n\r\nPre-startup Safety Reviews (PSSRs)\r\n\r\nCrestwood Midstream Partners LP conducts a PSSR for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  The PSSR team uses checklists to verify all aspects of readiness.  A PSSR involves field verification of the construction and serves as a quality assurance function by requiring that accident prevention program requirements are properly implemented.\r\n\r\nMechanical Integrity\r\n\r\nCrestwood Midstream Partners LP has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\r\n\r\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, a"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000025417,
      "SummaryText": "nd (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.  Job plans/written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\r\n\r\nAnother integral part of the mechanical integrity program is quality assurance.  The Lake Arlington Gas Plant incorporates quality assurance measures into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\r\n\r\nSafe Work Practices\r\n\r\nCrestwood Midstream Partners LP has long-standing safe work practices in place to help ensure worker and process safety.  Examples of these include, (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work) and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\n\r\nManagement of Change\r\n\r\nCrestwood Midstream Partners LP has a comprehensive system to manage changes to all covered processes.  This s"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000025417,
      "SummaryText": "ystem requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and to (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.  \r\n\r\nIncident Investigation\r\n\r\nCrestwood Midstream Partners LP promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts, and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to facility management for resolution.  Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during PHAs and PHA revalidations.\r\n\r\nCompliance Audits\r\n\r\nTo help ensure that the accident prevention program is functioning properly, Crestwood Midstream Partners LP periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are co"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000025417,
      "SummaryText": "nducted on a periodic basis.  Both hourly and staff personnel participate as audit team members.  The audit team develops findings that are forwarded to facility management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.  \r\n\r\nChemical - Specific Prevention Steps\r\n\r\nThe processes at the Lake Arlington Gas Plant have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to the prevention of accidental releases of regulated substances in the facility.  \r\n\r\nUniversal Prevention Activities\r\n\r\nThe accident prevention program summarized previously is applied to all RMP-covered processes at the Lake Arlington Gas Plant.  Collectively, these prevention program activities prevent or mitigate potential accident scenarios that could be caused by equipment failures and human errors.\r\n\r\nSpecialized Safety Features\r\n\r\nThe Lake Arlington Gas Plant has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release.  The following types of safety features are used in the covered process:\r\n\r\nRelease Detection\r\n\r\n1.\tTanks are gauged\r\n2.\tTanks/vessels are equipped with level and pressure sensors\r\n\r\nRelease Containment/Control\r\n\r\n1.\tBerms around condensate tanks\r\n2.\tProcess relief valves venting vapors to the atmosphere to prevent vessels from rupturing\r\n3.\tProcess relief valves that discharge to a flare to capture and incinerate episodic releases\r\n4.\tValves to permit isolation of the process (manual and automated)\r\n5.\tAutomated shutdown systems for specific process parameters (e.g., high temperature)\r\n6.\tRedundant equipment and instrumentation (e.g., uninterruptible power supply for process control system)\r\n\r\nRelease Mitigation\r\n\r\n1.\tTrained"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000025417,
      "SummaryText": "emergency response personnel\r\n2.\tPersonal protective equipment (e.g., chemical protective clothing)\r\n3.\tSPCC Plan\r\n\r\nEmergency Response Program Information\r\n\r\nThe Lake Arlington Gas Plant maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to the release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements.  In addition, the facility has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to facility processes.  The emergency response program changes are administered through the Management of Change (MOC) process, which includes informing and/or training affected personnel in the changes. Periodic drills or tabletop exercises are conducted to test the response plan.\r\n\r\nThe overall emergency response program for the Lake Arlington Gas Plant is coordinated with the Tarrant County Local Emergency Planning Committee (LEPC) at 817-884-1804.  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials, and industry representatives.  The Lake Arlington Gas Plant has around-the-clock communications capability.  Crestwood Midstream Partners LP operators a"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000025417,
      "SummaryText": "re automatically called in the event of a process upset.  The operator will then call the appropriate emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, the Crestwood Midstream Partners LP conducts periodic emergency drills that involve emergency response organizations, and the Lake Arlington Gas Plant provides annual refresher training to local emergency responders regarding the hazards of regulated substances in the facility.  \r\n\r\nFive - Year Accident History\r\n\r\nThe Lake Arlington Gas Plant has had no accidents in the last five years.\r\n\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nThe Lake Arlington Gas Plant resolves all findings from PHAs, some of which result in modifications to the process. The most Recent PHA was conducted on November, 11th, 2015. The following types of changes are planned in response to PHA, safety audit, and incident investigation findings:\r\n\r\nPlanned Change\t\t\t\tExpected Completion Date\r\nAdded secondary containment\t\t11/01/2016"
    }
  ]
}