{
  "FacilityID": 1000014364,
  "FacilityName": "Gustafson's L.L.C.",
  "FacilityStr1": "4169 Country Road 15A",
  "FacilityStr2": null,
  "FacilityCity": "Green Cove Springs",
  "FacilityState": "FL",
  "FacilityZipCode": "32043",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12019",
  "LEPC": "Regional Planning Council/Regi",
  "FacilityLatDecDegs": "29.973310",
  "FacilityLongDecDegs": "-081.692840",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.gustafsonsdairy.com",
  "FacilityEmailAddress": "ltorres@southeastmilk.org",
  "FacilityDUNS": 145925231,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Gustafson's L.L.C.",
  "OperatorStr1": "4169 Country Road 15A",
  "OperatorStr2": null,
  "OperatorCity": "Green Cove Springs",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32043",
  "OperatorZipCodeExt": null,
  "RMPContact": "Craig Corlett",
  "RMPTitle": "Director of Fluid Plant Operations",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000188815",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-03-11 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-08-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-05-20 00:00:00",
  "DeRegistrationEffectiveDate": "2014-08-20 00:00:00",
  "AnniversaryDate": "2015-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017964,
      "AltID": null,
      "FacilityID": 1000014364,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000018279,
          "ProcessID": 1000017964,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021285,
          "ProcessID": 1000017964,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000521285,
          "ProcessID": 1000017964,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014364,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\n\n\nGustafson's, LLC is strongly committed to employee, public, and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with our regulated process. It is our policy to implement appropriate controls to prevent possible accidental releases of regulated substances. However, if such an accidental release does occur, we are coordinated with the Clay County Fire Department for emergency response support.\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled\n\n\n\nThe plant is located at 4169 County Road 15A in the south west corner of Green Cove Springs, Florida. The facility manufactures/process milk and juice for distribution. Presently Anhydrous Ammonia is the only RMP regulated substance present at this facility above a threshold quantity of 10,000 lbs. \n\n\n\nAmmonia is utilized as the primary media in our closed-loop refrigeration systems. The system's purpose is to provide refrigeration and cold storage capabilities for Gustafson's LLC operations. The Ammonia refrigeration system's equipment is located on the east corner of the building on the east corner of the property in the machine or compressor room. The high pressure receiver (HPR) is located outside the compressor room under the cooling towers next to the building. The HPR is largest capacity vessels in the ammonia refrigeration system, capable of holding 10,915 lbs. of ammonia. This vessels will be used to determine the OCA (Offsite Consequence Analysis) for the facility. \n\n\n\n3.    Offsite Consequence Analysis\n\n\n\nThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario have been completed as stated in Section 2 and 3 of the RM"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014364,
      "SummaryText": "P*eSubmit text. \n\n\n\nTo evaluate the worst case, and alternative release scenarios, EPA's RMP Comp Hazardous Release software was utilized exclusively. The RMP Comp models are referenced in the RMP Offsite Consequence Analysis Guidance as an acceptable model for the release scenario mathematical approximation process. As specified in the RMP Guidance, the worst case and alternate case release scenarios have been calculated and the results of the calculations are documented in the Gustafson's RMP Plan on file. Public and environmental receptors that could possibly be affected by the release scenarios are determined through the use of EPA's MARPLOT mapping system software and US Census Bureau 2010 data.\n\n\n\nThe Worst Case Release Scenario is the rupture of the HPR vessel releasing 4,093 lbs of ammonia gas over a 10 min. period. Under worst case weather conditions, the ammonia gas could travel 1.2 miles dispersing enough to no longer pose a hazard to the public or the environment (reaching a concentration less than 0.14 mg/L), using the EPA Ammonia Guidance method. \n\n\n\nThe alternative release scenario is a leak at the rate of 2.0 lb/min. for duration of 30 min. due to a PRV failure. Under normally expected weather conditions, the ammonia gas could travel 0.1 miles before dispersing enough to no longer pose a hazard to the public or environment  (reaching a concentration less than 0.14 mg/L), using the EPA Ammonia Guidance method.\n\n\n\n4.    Prevention Program\n\n\n\nThe facility exceeds the ammonia threshold quantity for the OSHA Process Safety Management Standard, 1910.119, and is therefore subject to PSM requirements. Due to the characteristics of our ammonia refrigeration systems, as well as Process Safety Management (PSM) applicability, Gustafson's LLC is covered under program 3 of the RMP regulations. \n\n\n\nGustafson's LLC has a program in place to comply with the OSHA PSM program requirements on 1910.119. The PSM program includes a preventive maintenance plan which requires a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014364,
      "SummaryText": "ll ammonia refrigeration equipment to be periodically inspected and serviced. This will ensure that the equipment remains in good operating condition and will minimize the probability of an accident due to failure of the equipment. In developing the PSM and the RMP programs Gustafson's LLC also developed written procedures for the refrigeration process. These procedures cover all phases of the operation and include information on safety devices. These procedures will be used to train all operators and mechanics who work on the ammonia refrigeration process to ensure consistency of operation and minimize human errors. In addition, all refrigeration mechanics shall receive training through the Refrigeration Engineers and Technical's Association (RETA) training course. These measures ensure that all refrigeration operators and mechanics are properly trained. \n\n\n\nExisting work place practices such as Lockout/Tagout and Hot Work Permit were reviewed and updated to ensure that all non-routine work can be performed safely. Other components of the prevention program include collection and review of all equipment information, the development of updated Piping & Instrument Diagrams (P&ID), and the correction of any equipment design deficiencies found. These actions will ensure that the equipment meets all refrigeration industry standards and that accurate equipment information will be available when needed. To ensure that Gustafson's LLC refrigeration staff has the skills necessary to identify unsafe conditions, Process Hazard Analysis (PHA) training was conducted.  The staff also performed a PHA of this process. Other PSM/RMP procedures, including Management of Change, Pre-Startup Safety Review, Compliance Audits and Incident investigations are also part of the program to ensure continued safe operation and prompt correction of deficiencies. The PSM/RMP program receives full support of the plant management and involvement of employees at all levels. \n\n\n\n5.    Accident History\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014364,
      "SummaryText": "\n\nThe Gustafson's LLC Facility has had no reportable ammonia releases in the last five years.\n\n\n\n6.    Emergency Response Program\n\n\n\nGustafson's LLC has an emergency response program in place. The current Emergency Action plan focuses on evacuation of the facility in the event of an ammonia emergency, with assistance of the local emergency response agencies performing rescue, firefighting, first-aid, medical treatment, and other response functions. The program complies with 1910.38. The site also has some internal emergency response capability. The current plan has been coordinated with the Clay County Fire Department. Notification is made locally by dialing 911, notifying the Florida State Watch Office at 800-320-0519, and by notifying the National Response Center at 800-424-8802.\n\n\n\n7.    Planned Changes \n\n\n\nGustafson's LLC currently has no changes planned for the ammonia refrigeration processes at this time.\n\n\n\n\n\nAdditionally, these processes will be subjected to periodic process hazard analysis reviews for the purpose of identifying potential hazards and implementing the necessary improvement to provide a safer system. \n\nGustafson's LLC personnel will also periodically review all potential opportunities to improve the safety of our personnel, the surrounding community, and the ammonia refrigeration processes."
    }
  ]
}