{
  "FacilityID": 1000013778,
  "FacilityName": "Copley Gas Extraction Plant",
  "FacilityStr1": "604 Copley Road",
  "FacilityStr2": null,
  "FacilityCity": "Weston",
  "FacilityState": "WV",
  "FacilityZipCode": "26452",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54041",
  "LEPC": "Lewis/Upshur County LEPC",
  "FacilityLatDecDegs": "38.982111",
  "FacilityLongDecDegs": "-80.523400",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dom.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 103818837,
  "ParentCompanyName": "Dominion Transmission, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 116025180,
  "Company2DUNS": null,
  "OperatorName": "Dominion Transmission, Inc.",
  "OperatorStr1": "445 West Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Clarksburg",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26302",
  "OperatorZipCodeExt": "2450",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000008369",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-11-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-05-24 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-05-24 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2016-05-04 00:00:00",
  "DeRegistrationEffectiveDate": "2016-04-21 00:00:00",
  "AnniversaryDate": "2015-05-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 38.979377,
  "FRS_Long": -80.522895,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Regulated materials not currently present on site and plant is idled.",
  "_processes": [
    {
      "ProcessID": 1000017255,
      "AltID": "NGL Extraction",
      "FacilityID": 1000013778,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020527,
          "ProcessID": 1000017255,
          "ChemicalID": 155,
          "Quantity": 490000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 98985,
              "ProcessChemicalID": 1000020527,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 98986,
              "ProcessChemicalID": 1000020527,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 98982,
              "ProcessChemicalID": 1000020527,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 98983,
              "ProcessChemicalID": 1000020527,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 98984,
              "ProcessChemicalID": 1000020527,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 98981,
              "ProcessChemicalID": 1000020527,
              "ChemicalID": 94
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000017638,
          "ProcessID": 1000017255,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000014240,
              "Process_NAICS_ID": 1000017638,
              "SafetyReviewDate": "2010-04-05 00:00:00",
              "PHA_Date": "2010-10-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-09-28 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-10-02 00:00:00",
              "TrainingReviewDate": "2009-10-22 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-09-04 00:00:00",
              "EquipmentInspectionDate": "2008-04-17 00:00:00",
              "EquipmentTested": "Molecular sieve beds",
              "ChangeMgmtDate": "2009-07-02 00:00:00",
              "ChangeMgmtReviewDate": "2009-03-09 00:00:00",
              "PreStartupReviewDate": "2009-12-02 00:00:00",
              "ComplianceAuditDate": "2008-08-16 00:00:00",
              "AuditCompletionDate": "2010-06-30 00:00:00",
              "IncidentInvestigationDate": "2009-11-06 00:00:00",
              "InvestigationChangeDate": "2010-10-30 00:00:00",
              "ParticipationPlansReviewDate": "2009-03-09 00:00:00",
              "HotWorkPermitReviewDate": "2009-03-09 00:00:00",
              "ContractorSafetyReviewDate": "2009-03-09 00:00:00",
              "ContractorSafetyEvalDate": "2009-03-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000017075,
                  "PreventionProgram3ID": 1000014240,
                  "ProcessChemicalID": 1000020527
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000013778,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Weston Fire Department",
    "CoordinatingAgencyPhone": "3042692349",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013778,
      "SummaryText": "ronmental Protection AgencyÂ¿s (EPAÂ¿s) Risk Management Program requirements.  \n\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements, which are set out under 40 Code of Federal Regulations (CFR) Part 68 of the EPA.  This facility was designed and constructed in accordance with ASME B31.3.  The Copley facility is also subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.  The following sections briefly describe the elements of the release prevention program that is in place at this stationary source.\n\nProcess Safety Information\nCopley maintains a detailed record of process safety information that describes the hazards of regulated substances, operating parameters and equipment designs associated with all processes.  Much of this information was compiled during the preparation of the Process Hazard Analysis (PHA).  Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).\n\nProcess Hazard Analysis\nThe facility conducts comprehensive studies to ensure that hazards associated with the processes are identified and controlled efficiently.  Copley primarily uses the what-if and HAZOP method analysis techniques to perform these evaluations.  The studies were undertaken by a team of qualified personnel with expertise in engineering and process operations and will be revalidated at regular intervals of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within the covered processes, Copley maintains written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent wi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000013778,
      "SummaryText": "cesses at Copley have hazards that must be managed to ensure continued safe operation.  The following is a description of the existing safety features applicable to prevention of accidental releases of regulated substances at the facility.\nThe accident prevention program summarized previously is applied to all RMP-regulated processes at Copley.  Collectively, these prevention program activities help prevent potential accidental scenarios that could be caused by equipment failures and human error.  Copley has safety features on many units to help (a) contain/control a release (e.g., diking and enclosures); (b) quickly detect a release (e.g., hydrocarbon detectors with alarms), and (c) reduce the consequences of (mitigate) a release (e.g., fire suppression and extinguishing).\n\n4. Five-year Accident History\nCopley has an excellent record of preventing accidental releases over the last five years and no reportable releases have occurred.\n\n5. Emergency Response Program\nCopley has a written emergency action plan to deal with accidental releases of hazardous materials, which is in place to protect worker and public safety, as well as, the environment.  The plan addresses adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  Employees receive training in emergency procedures.  To ensure proper functioning, the emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within the processes that would require a modified emergency response.  The emergency plan has been reviewed with the Weston Fire Department.\n\nOn May 12, 2009, Senate Bill 279, entitled Emergency Response Regulations, more commonly known as the Fifteen Minute Rule was signed into law. The bill amends the Code of West Virginia, Chapter 131, adding new provisions that will require RMP subject"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000013778,
      "SummaryText": "industrial facilities (among others) to provide certain information to state and local emergency responders within 15 minutes of an accident or emergency. Local emergency responders must be provided information related to public health, safety and welfare regarding hazardous waste or material releases.\n\n6. Planned Changes to Improve Safety\nCopley will continue to improve safety at the facility through training.  No other upcoming events are planned to improve safety at this time."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013778,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies\nDominion Transmission, Inc. Â¿ Copley Extraction Plant is committed to employee, public and environmental safety.  This commitment is demonstrated by the release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at the facility.  It is DominionÂ¿s policy to implement appropriate controls to prevent possible releases of regulated substances.  If a release does occur, regular personnel are at hand to control and mitigate the effects of the release.  Dominion has contracted Weavertown Environmental Group as an Oil Spill Response Organization to provide additional emergency response expertise.  Also, Dominion will contact the Lewis County Emergency Dispatch to obtain additional resources from local volunteer fire departments, law enforcement and emergency medical services.\n\n2. The Stationary Source and the Regulated Substances Handled\nThe Copley Plant is a cryogenic turbo-expander plant that straddles a gas transmission line, owned by Equitrans.  The Copley Plant receives inlet gas at where it is scrubbed to remove free liquids in the gas, compressed and dehydrated utilizing two molecular sieve beds.  After dehydration, the pressure is reduced and the gas is cooled through the expander side of the expander/compressor.  The gas is sent to a deethananizer column where liquids condense and fall to the bottom and the overhead gas is warmed and compressed and sent back to the Equitrans facility.  The mixed natural gas liquid (NGL) product containing pentane, isopentane [butane, 2-methyl], butane, isobutane [propane, 2-methyl], propane, and ethane is sent to one of the four 30,000 gallon product storage tanks.  The NGL product is a flammable mixture that meets the NFPA-4 criteria and is present onsite in a process in an amount that exceeds the threshold quantity (10,000 pounds) for applicability under the Envi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000013778,
      "SummaryText": "onclusion of the investigation and will include any resolutions and corrective action.  All reports are retained for a minimum of five years.\n\nEmployee Participation\nCopley believes that PSM and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information created as part of the facilityÂ¿s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nHot Work Permit\nCopley will issue a hot work permit for hot work operations conducted on or near a covered process.  The permit shall document that the fire prevention and protection requirements have been implemented prior to beginning the hot work operations; it shall indicate the date(s) authorized for hot work; and identify the object on which hot work is to be performed.  The permit will be kept on file until completion of the hot work operations.\n\nContractors\nDominion hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Before any contractors are allowed to work in Copley, they undergo an orientation conducted by the PSM team.  During this orientation contractors are made aware of the known potential hazards related the contractorÂ¿s work, the hazards of regulated substances within Copley, the safe work procedures insisted on by Dominion, and familiarized with the Hot Work Permit Policy and the Lock Out/Tag Out Procedures used at the Copley.  Contractors are informed of all the procedures for emergency response should an accidental release of a regulated substance occur, and this information includes evacuation routes and assembly points.  Copley will document that the contractor has received and understands the training.\n\nChemical Specific Prevention Steps\nThe pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013778,
      "SummaryText": "measures to ensure that equipment and parts are suitable for the process application for which they will be used.\n\nManagement of Change\nWritten procedures are in place at Copley to manage changes in process chemicals, technology, equipment and procedures.  These procedures will be updated as needed.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established processes will be conducted as a regular practice at Copley.  These reviews are conducted to confirm that construction and equipment is in accordance with design specifications, and safety, operating, maintenance, and emergency procedures are suitable for safe startup prior to placing equipment into operation.\nCompliance Audits\nCopley conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out by at least one person knowledgeable in the process and are conducted at least every three years.  Audit findings are documented in a report.  Any corrective actions required from the audits are undertaken in a safe and prompt manner and are also documented.  The facility will maintain the two most recent compliance audit reports.\n\nIncident Investigation\nCopley promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  An incident investigation will be initiated as promptly as possible, but no later than 48 hours after the incident, and will involve at least one person knowledgeable of the process involved.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  A report will be prepared at the c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013778,
      "SummaryText": "th the process safety.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.  Copley develops and implements safe work practices to provide for the control of hazards during operations such as lockout/tagout; confined space entry; opening process equipment or piping; and control over entrance into a stationary source by maintenance, contractor, laboratory, or other support personnel.  These safe work practices apply to employees and contractor employees.\n\nTraining\nCopley has a training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Initial training on gas plant operations is provided, and refresher training is conducted at least every three years or more frequently as needed.  Both initial and refresher training is documented and records of training are maintained onsite for at least three years.\n\nMechanical Integrity\nCopley has written procedures for maintaining on-going integrity of process equipment, which incorporates training for process maintenance activities, inspection and testing, corrective action for equipment deficiencies, and the application of quality assurance measures.  Copley carries out documented maintenance checks on process equipment to ensure proper installation and operation.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified and trained personnel carry out maintenance operations at the site.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  The plant also incorporates quality assurance"
    }
  ]
}