{
  "FacilityID": 1000111547,
  "FacilityName": "Beowawe",
  "FacilityStr1": "1000 Power Plant Place",
  "FacilityStr2": null,
  "FacilityCity": "Beowawe",
  "FacilityState": "NV",
  "FacilityZipCode": "89821",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32015",
  "LEPC": "Lander County LEPC",
  "FacilityLatDecDegs": "40.556667",
  "FacilityLongDecDegs": "-116.618611",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A5",
  "LatLongDescription": "PC",
  "FacilityURL": "www.ormat.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Ormat Nevada, Inc (ONI)",
  "Company2Name": "NA",
  "CompanyDUNS": 929315661,
  "Company2DUNS": null,
  "OperatorName": "Beowawe Power",
  "OperatorStr1": "1000 Power Plant place",
  "OperatorStr2": null,
  "OperatorCity": "Battle Mountain",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89821",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": "88-0459061",
  "EPAFacilityID": "100000253913",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-03-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-03-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-03-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-03-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000139080,
      "AltID": "Beowawe OEC 1&2",
      "FacilityID": 1000111547,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000174164,
          "ProcessID": 1000139080,
          "ChemicalID": 115,
          "Quantity": 523000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000140593,
          "ProcessID": 1000139080,
          "NAICSCode": "221116",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000111547,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-01-05 00:00:00",
    "ERTrainingDate": "2024-03-15 00:00:00",
    "CoordinatingAgencyName": "Lander County LEPC",
    "CoordinatingAgencyPhone": "7756355161",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000111547,
      "SummaryText": "ion of the Emergency Action Plan. The Emergency Action Plan shall be reviewed annually to verify regulatory compliance and accuracy with both OSHA Regulations on Emergency Plans 29CFR1910.38 and CAPP's Emergency Response Programs, NAC 459.9544. The Emergency Response Program must also be periodically reviewed and updated and employees notified of any changes in conformance with 40 CFR 68.95. The EAP may also be reviewed, as part of any Incident Investigations or when deemed required during Management of Change. Current copies of the Emergency Action Plan will be located in the Beowawe Control Building and in the McGinness Hills Main Control Room.\n\nEvacuation of Personnel: In the event of an emergency determined to be isopentane system-related and\nevacuation is deemed necessary, the control room operator or other designated personnel will sound the\nplant evacuation alarm.\n\nFirst Aid: All personnel have been trained in adult CPR and basic first aid procedures.\n\nControl Room Operator: Upon notification from the site that an emergency has occurred, the Control Room Operator shall verify that appropriate response activities have been initiated and emergency response teams have been called. The Control Room Operator assumes initial communications with site over emergency situations until relieved by either the Plant Manager or Operations Manager.\n\nEmergency Response Personnel: Fire, police, and/or ambulance crews will be called if necessary. The senior employee on site at the time of the incident will give a report to the person in charge of the emergency teams.\n\nPlanned Changes to Improve Safety\nBecause Beowawe is a new facility, it has no record of any emergency action or incidents and there are currently no planned changes to improve safety beyond what was already identified and resolved in the most recent PHA revision."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000111547,
      "SummaryText": "systems, in conjunction with the administrative control system, ensure the focus is upon fire prevention.\n\nThe fire detection systems include gas monitors which continuously monitor the area surrounding the OEC's, and ultraviolet/infrared flame detectors throughout the plant. The facility has a fire water system installed in a continuous loop around the generating units and within reach of the isopentane storage tanks and major process equipment. The fire water systems consist of fire monitors and hydrants. Operators are trained in the proper use of the installed fire protection equipment, and the training information is appropriately documented by the facility operator.\n\nProcess Hazard Analysis\nA Process Hazardous Analysis (PHA) including a Hazard and Operability (HAZOP) study, an external events analysis, and a preliminary human factors analysis was undertaken in November 2022, and will be finalized by March 2024. The recommendations of the PHA were integrated into the facility and facility operations. The PHA will be updated and revalidated at least every 5 years to ensure the study is consistent for the life of the pentane processes.\n\nFive-Year Accident History\nThe Beowawe power plant is a new facility and there have been no accidents associated with isopentane and no accidental releases of isopentane.\n\nEmergency Response Program\nThe Emergency Response Program is intended to identify and coordinate personnel in the event there is an emergency. The EAP procedures apply to all personnel working at the Beowawe facility or monitoring the Beowawe plant from the McGinness Hills Main Control Room. The EAP is submitted to the local fire department and LEPC for review and their concurrence when changes are made to the plan. Annual meetings will be scheduled to coordinate potential response activities by Ormat personnel and the local fire department. \n\nImplementation, Control and Compliance: The Plant Manager has overall responsibility for the development and implementat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000111547,
      "SummaryText": "d flow within the system.\n\nOEC Units: The OEC units are controlled and monitored by their own dedicated HMI Programmable Logic\nController (PLC). The PLC receives all discrete (logic) and analog signals from the input devices (e.g. switches and measuring sensors), processes the signals according to pre-loaded Ormat software, and then outputs logic and analog command signals to local and field devices. All parameters needed for proper operation of the OEC units, such as pressure, temperature, voltage, current, power, speed, etc. are measured by the proper measuring instruments. Deviation from the operating parameters will immediately be detected by the PLC and the PLC will initiate correction or automatic shutdown of the related OEC unit. Under normal circumstances, no releases or other dangerous situations are expected to result from these automatic actions. Appropriate manual override is provided.\n\nRelief system design: Relief valves are located on the isopentane storage tanks and on the OEC vaporizers and condensers. Each pressure relief valve relieves directly to atmosphere, and some installations have extension pipes installed to direct the relief valve discharge away from critical machinery. Additionally, each pressure relief valve is installed immediately above a rupture disk designed to fail at the relief pressure of its corresponding relief valve. Individual relief valve locations are equipped with telltale gauges in between the relief valve and its rupture disk to allow easy identification of leaking or blown rupture disks. The following list summarizes the system relief set points:\n\n  isopentane Storage Tank Relief: 120 psig\n  Condenser: 120 psig\n  Vaporizer: 279 psig\n\nVentilation System Design: All components of the isopentane transfer and storage systems and the OEC units are located outdoors.\n\nSafety Systems: Beyond the relief system the Beowawe, the OEC units have extensive fire protection, gas and flame detection, and alarm systems.  These protective"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000111547,
      "SummaryText": "nitial training shall be completed\nwith Emergency Services Personnel including a tour of the site, gas and fire detection system operations, and familiarization with the motive fluid characteristics.\n\nRefresher training is conducted on an annual basis, at a minimum, and when review of the chemicals or\nprocess reveals a need for additional training. Initial and refresher training, associated with the Risk Management Program, is documented and maintained per the requirements of the Training Program.  Additional training will also be provided as needed or requested by Emergency Services Personnel. Contracted employees shall be trained in the requirements of the EAP procedure prior to working at the Beowawe site. Training will include the following items, but is not limited to: (a) Location and sounds of the stand down, and evacuation alarms; (b) Expectations of response to injuries and emergencies by personnel on site; and (c) Evacuation routes and locations. Refresher training for all personnel shall be conducted annually at a minimum.\n\nSafety Training: Some equipment at the Beowawe Geothermal Power Plant poses potential fire, explosion, and electrical hazards that could cause serious personal injuries and costly property damage if safety procedures are not followed correctly. Safety training, conducted monthly and required of all employees, identifies the different hazards to be found on the sites. These subjects include Emergency Action Plan (EAP), motive fluid hazards, fire prevention and hot work, lock out and tag out procedures, hazard communication, confined space, hearing conservation, personal protective equipment, accident, injury and incident reporting. Safety training is supplemented by the use of the Standard Safety Procedures.\n\nisopentane system: Deviation from the design limits of operation for the isopentane transfer system will not normally occur since the individual components are rated beyond the highest achievable values of pressure, temperature, an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000111547,
      "SummaryText": "with PSM (29CFR1910.119), RMP (40CFR68) and CAPP (Nevada Administrative Code 459.952 to 459.95528).  The isopentane is projected to first be stored on the site in March 2024.\n\nWorst Case Scenario: Worst case scenario assessment has been made and potential off-site consequence\nanalysis (OCA) was undertaken. However, in conformance with Office of Emergency Management guidance, the OCA for worst-case and/or alternative release scenario(s) has not been included in this Executive Summary because of security concerns.\n\nSafe Work Practices: Safe work practices have been developed and implemented to provide for the control of hazards during work activities such as lock out/tag-out, confined space entry, opening process equipment or piping, and control over entrance into a facility by maintenance, contractor, laboratory or other support personnel. These safe work practices apply to both employees and contractors.\n\nMaintenance Procedures: A Mechanical Integrity Program (MIP) has been initiated at the Beowawe facility. The MIP adopted a maintenance concept for periodic preventative and corrective maintenance of the OEC system at Beowawe. The preventative maintenance tasks include visual inspection, lubrication of rotating parts, system cleaning, replacing liquids and filters, and periodic tests to verify that the system is in proper operating condition. Preventative maintenance tasks and procedures are scheduled to be undertaken over a series of maintenance intervals.\n\nAlarm system maintenance is determined using a combination of regulatory requirements, manufacturer\u0092s recommendations, plant operating experience and best practices. Standard Safety Procedure #23, and the Standard Maintenance Procedures (SMP\u0092s) will identify system maintenance procedures, frequencies and recommended spare parts.\n\nTraining: Initial training for personnel is given before that employee is allowed to either handle isopentane,\noperate or work on the facility's process area or on process equipment. I"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000111547,
      "SummaryText": "wells to the binary systems consisting of three OEC's. Spent geothermal fluid will be injected back into the subsurface reservoir via three injection wells.\n\nThe Beowawe Project will be a geothermal electric power generation facility with separate turbines and heat exchanger trains combined to function as an Integrated Three Level Unit (I3LU) air-cooled OEC unit.\n\nOEC-1 consists of a single shaft generator driven by a single direct-coupled special organic fluid turbine, while OEC-2 consists of a double shaft generator driven by two direct-coupled special organic fluid turbines. Geothermal fluid will be supplied from two production wells to the binary system. Spent geothermal fluid will be injected back into the subsurface reservoir via three injection wells.\n\nBeowawe will be operated by Ormat's Eastern Nevada Operations Group (ENOP). The Eastern NV-Operations Group (ENOP) is comprised of management, administration, maintenance, engineering and operations personnel. ENOP operates six eastern Nevada power generation facilities owned by Ormat in addition to Beowawe.\n\nThe Beowawe facility will operate continuously, 24 hours per day and 365 days per year (excluding scheduled maintenance downtime or plant upsets).  The dayshift will have on-site staffing and the nightshift will be operated remotely from the McGinness Hills Main Control Room.\n\nRegulated Substance Handled\nBeowawe stores isopentane (CAS # 78-78-4) as the motive fluid used in the Ormat Energy Converter (OEC) units. In addition to the inventory present in the OEC\u0092s, the plant will have one isopentane storage tank.  The tank will have a nominal capacity of 18,000 gallons (maximum fill capacity of 16,000 gallons). The maximum total projected amount of isopentane to be stored on site is 507,486 pounds (reflects the inventory in the two operational OEC\u0092s and one storage tank filled with one full truckload of isopentane). The use of isopentane in a process in a quantity greater than 10,000 lbs. requires compliance"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000111547,
      "SummaryText": "Beowawe Risk Management Plan\nExecutive Summary\n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is Ormat Nevada, Inc.'s (Ormat's) policy to adhere to all applicable federal, state, and local laws. The Beowawe facility actively manages all operational permits and safety programs such as Nevada Division of Environmental Protection\u0092s Air Quality, Chemical Accident Prevention Program, Underground Injection Control programs as well as OSHA's Process Safety Management program. In addition, Ormat is ISO 14000 and 9001 certified and undergoes several audit processes to ensure all facilities are aggressively pursuing the highest quality, safety and environmental standards. Ormat is committed to handling the isopentane systems in a safe manner to protect the environment. Copies of emergency response, process hazard analyses, Chemical Accident Prevention and process safety management plans and all technical drawing (P&IDS) for process equipment are maintained onsite for reference.\n\nFacility Description\nThe Beowawe Geothermal Power Plant (Beowawe) is wholly owned by Ormat Nevada, Inc (Ormat), which is a division of Ormat Technologies, Inc., a publicly traded company. The Beowawe Project will be located Lander County and encompasses approximately 7,680 acres of public and private lands. The physical plant is located on approximately 16 acres about 11 miles northeast of Austin, Nevada on Grass Valley Road. The leased acreage covers the defined geothermal resource area and receptive injection zones.\n\nThe physical address is: \t1000 Power Plant Place   \t\t\t\t\t\t\t\t\t\tBattle Mountain, NV   89821\n\t\t\t\nThe Beowawe Plant will be a geothermal electric power generation facility with two, Integrated Two Level Unit (ITLU) air-cooled OEC units and one, level 3 air-cooled OEC.  Each OEC incorporates one double ended shaft generator driven by two 1800 RPM direct coupled special organic fluid turbines, and associated facilities. Geothermal fluid will be supplied from five production"
    }
  ]
}