{
  "FacilityID": 1000068622,
  "FacilityName": "Barr Railcar Terminal",
  "FacilityStr1": "124 Barr Avenue S.E.",
  "FacilityStr2": null,
  "FacilityCity": "Albuquerque",
  "FacilityState": "NM",
  "FacilityZipCode": "87105",
  "Facility4DigitZipExt": "0807",
  "FacilityCountyFIPS": "35001",
  "LEPC": "Bernalillo LEPC",
  "FacilityLatDecDegs": "35.004500",
  "FacilityLongDecDegs": "-106.659235",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.nglenergypartners.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "NGL Supply Terminal Company LLC",
  "Company2Name": "NGL Energy Partners LP",
  "CompanyDUNS": 0,
  "Company2DUNS": 965465086,
  "OperatorName": "NGL Supply Terminal Company LLC",
  "OperatorStr1": "6120 S. Yale Avenue",
  "OperatorStr2": "Suite 805",
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74136",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Fansher",
  "RMPTitle": "Director of Terminal Operations",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000190848",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-08-01 00:00:00",
  "SafetyInspectionBy": "New Mexico LP Gas Bureau",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-03-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-03-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-03-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-09-27 00:00:00",
  "DeRegistrationEffectiveDate": "2018-09-01 00:00:00",
  "AnniversaryDate": "2023-03-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000086060,
      "AltID": "Propane Terminal",
      "FacilityID": 1000068622,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000087262,
          "ProcessID": 1000086060,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000107411,
          "ProcessID": 1000086060,
          "ChemicalID": 98,
          "Quantity": 770000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000607411,
          "ProcessID": 1000086060,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068622,
      "SummaryText": "The accidental release prevention and emergency response policies at the Barr Terminal facility:\n\nNGL Supply Terminal Company is committed to the safety of its workers, the public, and the environment. Its accidental release policy is an integrated approach, involving employee participation, management practices, written procedures, and training. NGL has developed a comprehensive Liquefied Petroleum Gas (LPG) accident prevention program considering all aspects of process operation and maintenance. The accident prevention program includes compliance with ongoing mechanical integrity inspections, which includes the API RP 510 Pressure Vessel Inspection Program and API RP 570 Piping Inspection Program. In addition, the facility conducts 3 year PSM compliance audits. If an emergency were to occur, it is NGL's policy to notify the Bernalillo Fire Department and request that they respond to the emergency. This facility also maintains incipient stage fire-fighting equipment on site. Additionally, this facility complies with NFPA-58 requirements for LPG storage, and it is NGL's policy to adhere to all applicable federal, state, and local laws.\n\n\n\nA description of the Barr Terminal facility and the regulated substances handled:\n\nThis facility is a bulk terminal storing LPG for resale to retail propane dealers. The facility consists of three (3) 30,000-gallon storage tanks holding approximately 110,000 pounds of liquid propane each. There is also the capacity for eight (8) 33,000-gallon rail cars onsite and three (3) 14,500-gallon trucks. There are both manual and automatic emergency shutdown systems on all LPG equipment at the site.\n\n\n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\nThis facility complies with EPA's accident prevention rule, the OSHA PSM standard, and all applicable state and local codes and regulations. The LPG system is designed, installed, and maintained in accordance with NFPA-58 and state law.\n\n\n\nThe worst-case"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068622,
      "SummaryText": " and alternative release scenarios:\n\nThe Worst Case Scenario for this facility is a vapor cloud explosion resulting from the loss of one 30,000 gallon storage tank with a maximum fill level of 85%.  It assumes all the propane is released and ignited. No passive mitigation systems are considered. The resulting distance to the endpoint extends offsite to 0.4 miles, and public receptors are within the distance to this endpoint.  The facility has multiple safeguards in place which makes this scenario very unlikely.   \n\n\n\nThe Alternative Release Scenario for this facility is a vapor cloud explosion resulting from a release of propane from a section of railcar unloading line located between the 2\" check valve and the railcar connection fitting which is equipped with an Emergency Shutoff Valve (ESV).  \n\n\n\nIt is assumed that the amount of propane present in this section of unloading line will be lost in 1 minute with no additional flow rate needs to be accounted for since the line is equipped with isolation on both ends, one being the 2\" check valve and the other with the ESV, limiting the amount of product lost.\n\n\n\nA total of 70 pounds of propane is ignited, resulting is a vapor cloud explosion. This would generate a pressure wave with a minimum 1 psi overpressure extending 0.02 miles. The resulting distance to the endpoint extends offsite. The only public receptors within the distance to the endpoint is nearby industry.\n\n\n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\nThis facility complies with EPA's accident prevention rule, the OSHA PSM standard, and all applicable state and local codes and regulations. The propane system is designed, installed, and maintained in accordance with NFPA-58 and state law.\n\n\n\nFive-year accident history:\n\nNGL Supply Terminal Company acquired the facility in December 2013. There has not been an accident involving LPG that caused deaths, injuries, property or environmental damage, evacuations, or an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068622,
      "SummaryText": "y shelter in place.  Note:  The previous owner acquired facility in June 2006 and no accidents occurred during their ownership.\n\n\n\nThe emergency response program:\n\nNGL Supply Terminal Company has developed an emergency action plan specific to this facility. In the event of an emergency involving the Terminal's LPG system, it is NGL's policy to notify the Bernalillo Fire Department and request that they help in responding to the emergency. NGL has trained employees in incipient stage firefighting. This terminal has coordinated the facility's response plans with the LEPC & fire department; members of the LEPC & fire department have been provided the opportunity to visit the facility and inspect the LPG storage system.\n\n\n\nPlanned changes to improve safety:\n\nNGL Supply Terminal Company, LLC will continually strive for safety improvement. Periodic process safety inspections and Process Hazard Analyses will be conducted followed with timely response.\n\n\n\n\n\n\n\n"
    }
  ]
}