{
  "FacilityID": 1000011088,
  "FacilityName": "Twelve Mile Water Treatment Plant",
  "FacilityStr1": "1730 Lark Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Creston",
  "FacilityState": "IA",
  "FacilityZipCode": "50801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19175",
  "LEPC": "Union County LEPC",
  "FacilityLatDecDegs": "41.051840",
  "FacilityLongDecDegs": "-094.259600",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "officeww@iowatelecom.net",
  "FacilityDUNS": 800955908,
  "ParentCompanyName": "City of Creston Water Works",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Steve A. Green",
  "OperatorStr1": "820 S. Park St",
  "OperatorStr2": "P.O. Box 405",
  "OperatorCity": "Creston",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50801",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve A. Green",
  "RMPTitle": "General Manager",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000052382",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1999-05-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-10-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-10-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-10-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-01-14 00:00:00",
  "DeRegistrationEffectiveDate": "2019-01-11 00:00:00",
  "AnniversaryDate": "2014-10-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.0241,
  "FRS_Long": -94.2612,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "6",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013198,
      "AltID": "Chlorine",
      "FacilityID": 1000011088,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000013566,
          "ProcessID": 1000013198,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015214,
          "ProcessID": 1000013198,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515214,
          "ProcessID": 1000013198,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011088,
      "SummaryText": "General Executive Summary for Chemical, Manufacturing and Oil Refining Facilities\n\n1.   Accidental release prevention and Emergency Response policies \n\nWe at 12 Mile Treatment Plant are committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, we are completely coordinated with Creston Fire Department which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\n2.  The Stationary Source and the Regulated Substances Handled\nWe have 1 regulated substance present at our facility which is Chlorine.\n\nThe maximum inventory of Chlorine at our facility is 12000 lbs. We have up to six 1 ton (2000 lbs.) cylinders at a time, but the largest container is 2000 lbs.\n\n\n3.  The Worst Case Release Scenario and the Alternative Release Scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nTo perform the required offsite consequence analysis for our facility, we have used the NOAA and EPA software program RMP* Comp. \nThe following paragraphs provide details of the chosen scenarios.\n\nToxic Worst-case analyses\n\nThe Worst Case scenario involves a catastrophic release from the Chlorination Process.  The scenario involves the release of 2000 lb. of Chlorine in a gaseous form over 10 minutes. The Release rate (lbs/min) is calculated to be 200. A distance to endpoint of 2.2 miles is obtained which affects a residential population of 300 within this distance.\n\n\nToxic Alternative-case analyses\n\nThe Alternative Case scenario involves a catastrophic release from Chlorination Process.  The scenari"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011088,
      "SummaryText": "o involves the release of 200 lb. of Chlorine in a gaseous form over 20 minutes. Passive mitigation controls such as enclosures are also taken into account to calculate the scenario. The Release rate (lbs/min) is calculated to be 10 and a Distance to endpoint of 0.1 miles is obtained which affects  a residential population of 0. \n\n\nFlammables Worst-case analyses\nNone applicable\n\nFlammables Alternative-case analyses\nNone applicable\n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119. Our facility is also subject to EPCRA Section 302 notification requirements. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\n12 Mile Treatment Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is   What if.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of  yearly.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, 12 Mile Treatment Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operatio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011088,
      "SummaryText": "ns, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\n12 Mile Treatment Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. New employees receive on-the-job supervision until they are deemed competent to work independently. Refresher training is provided at least every two years and more frequently as needed.\n\nMechanical Integrity\n12 Mile Treatment Plant carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at 12 Mile Treatment Plant to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at 12 Mile Treatment Plant.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\n12 Mile Treatment Plant conducts audits on a regular basis to dete"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011088,
      "SummaryText": "rmine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\n12 Mile Treatment Plant promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\n12 Mile Treatment Plant truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. 12 Mile Treatment Plant has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n5.  Five-year Accident History\n\n12 Mile Treatment Plant has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.  Emergency Response Plan\n\nFacility is included in written Community ER Plan.\nThe Local agency coordinating ER Plan is Cr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011088,
      "SummaryText": "eston Fire Department which has the phone number 515-782-2200\n\n7.  Planned Changes to Improve Safety\nNo new developments or findings have resulted from the implementation of the various elements of our accidental release prevention program. "
    }
  ]
}