{
  "FacilityID": 1000050927,
  "FacilityName": "CLW Foods, LLC.",
  "FacilityStr1": "3425 East Vernon Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Vernon",
  "FacilityState": "CA",
  "FacilityZipCode": "90058",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.006222",
  "FacilityLongDecDegs": "-118.210556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CLW Foods, LLC",
  "OperatorStr1": "8765 Third Street",
  "OperatorStr2": null,
  "OperatorCity": "Hanford",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93230",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000215199",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-10-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-03-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-09-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-09-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-09-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064256,
      "AltID": null,
      "FacilityID": 1000050927,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000079461,
          "ProcessID": 1000064256,
          "ChemicalID": 56,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000065363,
          "ProcessID": 1000064256,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000053326,
              "Process_NAICS_ID": 1000065363,
              "SafetyReviewDate": "2014-07-18 00:00:00",
              "PHA_Date": "2015-05-29 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-11-29 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-02-25 00:00:00",
              "TrainingReviewDate": "2017-06-29 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-07-18 00:00:00",
              "EquipmentInspectionDate": "2015-07-29 00:00:00",
              "EquipmentTested": "Daily system inspection",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2017-06-29 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2017-06-29 00:00:00",
              "AuditCompletionDate": "2018-12-29 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2017-06-29 00:00:00",
              "HotWorkPermitReviewDate": "2017-06-29 00:00:00",
              "ContractorSafetyReviewDate": "2017-06-29 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000065552,
                  "PreventionProgram3ID": 1000053326,
                  "ProcessChemicalID": 1000079461
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000050927,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Vernon Fire Department",
    "CoordinatingAgencyPhone": "3235838811",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050927,
      "SummaryText": "Accidental Release and Emergency Response Policies\n\nHP-A Vernon, LLC is committed to providing a safe environment to its tenants and surrounding communities.  This commitment is reflected in the safety and environmental programs that are implemented at the facility.  For example, written procedures have been created for operating the ammonia refrigeration systems.  Only a trained, licensed refrigeration contractor is permitted to perform system operations.  HP-A Vernon, LLC has also developed a robust maintenance program to ensure the equipment is in good operating condition.  All of these programs are geared towards the prevention of an accidental release at the facility.  In addition, these programs incorporate emergency procedures to mitigate the effects of a release if it does occur.  At such an event, emergency coordinators will assess the situation and notify outside responding agencies as necessary.\n\n\n\nStationary Source and Regulated Substance\n\nHP-A Vernon, LLC is located at 3425 Vernon Avenue in Vernon, California (see Figure 1 below).  Ammonia is used in the facility's two refrigeration systems to provide cooling for the storage of various food products.  The process description is presented below:\n\n\n\nBK West Medium/Low Temperature System\n\nLiquid ammonia in the pilot receiver is fed first to the compressors for oil cooling, excess liquid is sent to the controller pressure receiver.  The Controlled Pressure Receiver supplies high temperature liquid to the following equipment:\n\n?    -20F Pump Accumulator\n\n?    Freezer Dock Evaporators\n\n?    Temp Cooler Evaporators\n\n?    MAP Cooler Evaporators\n\n?    BK West Cooler Evaporators \n\n?    BK West Production Cooler Evaporators\n\n?    Raw Cooler Evaporators\n\n?    Finished Product Cooler Evaporators\n\n?    Shipping Dock (Single and Double)\n\nThe Controlled Pressure also receives hot gas from the compressors to help maintain an operating pressure of 70 psig. Excess liquid in the Liquid Transfer Unit is returned to this vessel. High temperature sucti"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050927,
      "SummaryText": "on is drawn from this vessel by the +15F Accumulator.\n\n\n\nThe -20F Pump Accumulator receives high temperature liquid from the Controlled Pressure Receiver and pumps low temperature recirculated liquid to the following equipment:\n\n?    F2 Freezer \n\n?    F3 Freezer (New Freezer: North, Center, South) (WIZARD 1)\n\nSuction generated at the evaporators is returned to this vessel. The suction is then drawn off by the Low Temperature Compressors.\n\n\n\nThe +15F Accumulator receives high temperature recirculated suction from the following equipment:\n\n?    Freezer Dock\n\n?    Temp Cooler\n\n?    Map Cooler\n\n?    BK West Cooler\n\n?    BK West Production Cooler\n\n?    Raw Cooler\n\n?    Finished Product\n\n?    Single Dock\n\n?    Double Dock\n\n?    Controlled Pressure Receiver\n\nThe liquid collected at the bottom of the vessel is drained to the Liquid Transfer Unit, while the vapor accumulated at the top is drawn off to the High Temperature Compressors.\n\n\n\nThe Liquid Transfer Unit receives high temperature liquid from the +15F Accumulator. The liquid in the unit is transferred back to the Controller Pressure Receiver using hot gas pressure from the High Temperature Compressors.\n\nAt the evaporators, air is drawn over the coils by the evaporator fans.  The ammonia flowing inside the coils is partially vaporized as it absorbs heat from the surrounding air.  The partially vaporized ammonia is returned to the respective vessel, where the liquid settles at the bottom of the vessel, while the vapor rises to the top.  The vapor in the vessels are pulled off by the compressors and discharged to the condenser.  At the condenser, the vapor is condensed back into liquid, which then drains to the receiver to be re-used in the refrigeration cycle.\n\n\n\nBK West Frigo\n\nThe Thermosyphon Receiver receives ammonia condensate from the Condenser and supplies thermosyphon oil cooling for the compressors. Excess liquid in the vessel is sent to the Intercooler. The hot gas used to pressurize the Transfer Vessel is also provided by the Thermosyphon Receiv"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050927,
      "SummaryText": "er.\n\n\n\nThe Intercooler receives liquid overflow from the Thermosyphon Receiver and supplies subcooled liquid to the Accumulator. The liquid in the vessel flashes off and is subcooled as the Intercooler also receives booster discharge from the Booster Compressors. Excess liquid in the Accumulator is returned to this vessel via the Transfer Vessel. High stage suction is then drawn off by the High Stage Compressors.\n\n\n\nThe Accumulator receives subcooled liquid from the Intercooler. The subcooled liquid from the Intercooler is fed to the coil and to the surrounding bath. The liquid in the coil is cooled by the bath and then is sent to the Tunnel Freezers. The suction generated at the Tunnel Freezers is returned to the Accumulator. Excess liquid collected at the bottom of the vessel is drained to the Transfer Vessel, while the vapor accumulated at the top is drawn off to the Booster Compressors.\n\n\n\nThe Transfer Vessel receives excess low temperature liquid from the Accumulator. When the liquid level in the vessel reaches a certain setpoint, the float switch energizes the solenoid valve on the Thermosyphon Receiver to shut off the equalization line and feed hot gas to the unit. As the vessel is pressurized, the liquid is pushed out of the unit and is transferred to the Intercooler. When the transfer cycle ends, the hot gas solenoid valve closes and the equalization line opens.\n\n\n\nBased on freezer temperature requirements, the Tunnel Freezers receive low temperature liquid ammonia from the Accumulator and return low temperature suction back to the same vessel. Each freezer has five surge drums, with a flooded coil associated with each surge drum. \n\n\n\nAt the evaporators, air is drawn over the coils by the evaporator fans.  The ammonia flowing inside the coils is partially vaporized as it absorbs heat from the surrounding air.  The partially vaporized ammonia is returned to the respective vessel, where the liquid settles at the bottom of the vessel, while the vapor rises to "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050927,
      "SummaryText": "the top.  The vapor in the vessels are pulled off by the compressors and discharged to the condenser.  At the condenser, the vapor is condensed back into liquid, which then drains to the receiver to be re-used in the refrigeration cycle.\n\n\n\nAccidental Release Prevention Program\n\nHP-A Vernon, LLC has developed an accidental release prevention program for compliance with the OES CalARP regulations.  The program includes but is not limited to the following elements:\n\n\n\n?    Safety information regarding the chemical hazards, and operating and technical specifications for the equipment;\n\n?    Written procedures for operating and maintaining the processes;\n\n?    Training for personnel involved with system operations and maintenance;\n\n?    Investigating releases and near misses and implementing measures to prevent recurrence; and\n\n?    Audit procedures for ensuring that the programs are being implemented in accordance to the regulations. \n\n\n\nIn addition, engineering controls have been implemented to reduce the chance of an accidental release to the environment.  These are comprised of equipment monitoring systems and safety cutouts to shut off the equipment when operating parameters exceed safe operating limits.  Relief valves on pressurized ammonia vessels prevent equipment rupture in the event of overpressurization.  Regular inspections and tests are performed to ensure these controls are in good working order.\n\n\n\nFive Year Accident History\n\nA review of the facility's five year accident history showed that there have been no incidents at the facility that meet the RMP criteria for a reportable accident (onsite deaths, injuries, or significant property damage; or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place).  In addition, there have been no incidents at the facility in the last five years that resulted in a release of more than the Federal Reportable Quantity (100 pounds).\n\n\n\nEmergency Response Program\n\nHP-A Vernon, LLC has "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050927,
      "SummaryText": "developed an Emergency Action Plan (EAP) for the purpose of protecting employees and the surrounding community.  The EAP covers procedures for: 1) evacuating and accounting for visitors and employees, 2) dealing with an ammonia release and other foreseeable emergencies that could occur onsite, 3) notifying external agencies and emergency response personnel, and 4) administering first aid measures for ammonia exposure.  Employees are informed of the elements of the EAP.  In the event of an ammonia release, employees will evacuate or shelter-in-place, depending on the nature of the release, and the facility will contact the refrigeration contractor and the fire department for assistance as necessary.\n\n\n\nPlanned Changes to Improve Safety\n\nPHA's and Compliance Audits have been performed on the ammonia refrigeration systems, and these studies have resulted in action items to improve safety at the facility.  The recommendations mainly consist of formalizing procedures, implementing practices consistent with industry standards, and performing inspections and tests to maintain the integrity of the equipment.  HP-A Vernon, LLC has implemented several of these action items and is moving forward with completing the remaining outstanding recommendations.   In addition, the facility plans to continue providing employees with a safe work environment through continued training on current policies and procedures, and conducting audits to identify deficiencies and make improvements.\n\n"
    }
  ]
}