{
  "FacilityID": 1000083050,
  "FacilityName": "CCNA Dunedin Facility",
  "FacilityStr1": "427 San Christopher Drive",
  "FacilityStr2": null,
  "FacilityCity": "Dunedin",
  "FacilityState": "FL",
  "FacilityZipCode": "34698",
  "Facility4DigitZipExt": "4905",
  "FacilityCountyFIPS": "12103",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "28.022583",
  "FacilityLongDecDegs": "-082.787025",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "lferguson@coca-cola.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "The Coca-Cola Company",
  "Company2Name": null,
  "CompanyDUNS": 3296175,
  "Company2DUNS": 3296175,
  "OperatorName": "The Coca Cola Company",
  "OperatorStr1": "427 San Christopher Drive",
  "OperatorStr2": null,
  "OperatorCity": "Dunedin",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34698",
  "OperatorZipCodeExt": null,
  "FTE": 189,
  "OtherEPAFacilityID": "34698HPHDN427S",
  "EPAFacilityID": "100000155397",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-11-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-05-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-10-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-10-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-10-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 28.02212,
  "FRS_Long": -82.78657,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000103803,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000083050,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000129952,
          "ProcessID": 1000103803,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000105118,
          "ProcessID": 1000103803,
          "NAICSCode": "311421",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000087789,
              "Process_NAICS_ID": 1000105118,
              "SafetyReviewDate": "2014-02-13 00:00:00",
              "PHA_Date": "2019-08-20 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-08-20 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-02-13 00:00:00",
              "TrainingReviewDate": "2016-02-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-08-28 00:00:00",
              "EquipmentInspectionDate": "2019-10-08 00:00:00",
              "EquipmentTested": "Pressure Relief Valves",
              "ChangeMgmtDate": "2011-12-20 00:00:00",
              "ChangeMgmtReviewDate": "2019-05-14 00:00:00",
              "PreStartupReviewDate": "2011-12-20 00:00:00",
              "ComplianceAuditDate": "2018-08-17 00:00:00",
              "AuditCompletionDate": "2019-12-27 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-05-14 00:00:00",
              "HotWorkPermitReviewDate": "2019-05-09 00:00:00",
              "ContractorSafetyReviewDate": "2014-02-19 00:00:00",
              "ContractorSafetyEvalDate": "2018-06-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000109389,
                  "PreventionProgram3ID": 1000087789,
                  "ProcessChemicalID": 1000129952
                }
              ]
            }
          ],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000105117,
          "ProcessID": 1000103803,
          "NAICSCode": "311411",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000083050,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Dunedin Fire Department",
    "CoordinatingAgencyPhone": "7277333114",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083050,
      "SummaryText": "EXECUTIVE SUMMARY\r\nThe Coca Cola Company CCNA Dunedin Facility\r\n\r\nEXECUTIVE SUMMARY\r\n1.\tAccidental Release Prevention and Emergency Response Policies\r\nThe CCNA Dunedin Facility is strongly committed to employee, public and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with our regulated processes. It is our policy to implement appropriate controls to prevent possible accidental releases of regulated substances. However, if such an accidental release does occur, we are coordinated with the Dunedin Fire Department and Pinellas County Emergency Management for emergency response support.\r\n\r\n2.\tThe Stationary Source and the Regulated Substances Handled\r\nThis facility is used for the production of juice and fruit drink products. Ammonia is the only RMP regulated substance present at this facility in a threshold quantity. It is utilized as the primary cooling media in our closed-loop refrigeration system. The system's purpose is to provide cold storage capabilities for certain products. Due to the  and characteristics of our ammonia refrigeration system, as well as Process Safety Management (PSM) applicability, this facility is covered under Program 3 of the RMP regulations.\r\n\r\n3.\tThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario have been completed as discussed in the following text.\r\nTo evaluate both the worst case and alternative release scenarios, the EPA's RMP Comp was utilized exclusively. The RMP Comp model is referenced in the RMP Offsite Consequence Analysis Guidance as an acceptable model for the mathematical approximation process. \r\nAs specified in the RMP Guidance, the worst case and alternate case release scenarios have been calculated and the results o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083050,
      "SummaryText": "f the calculations are on file at the CCNA Dunedin Facility. Public and environmental receptors that could possibly be affected by the scenarios were determined through the use of Aloha/Marplot mapping system software and US Census Bureau 2010 data. \r\n\r\n\r\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\r\nThe facility has taken all necessary steps to comply with the accidental release prevention requirements set forth in 40 CFR Part 68. The CCNA Dunedin Facility is also subject to the OSHA PSM standard under 29 CFR 1910.119, as well as the EPCRA Section 302 and 311/312 notification/reporting requirements. The following sections briefly describe the elements of the accidental release prevention program that is in place at our facility. \r\nProcess Safety Information\r\nThe CCNA Dunedin Facility maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the ammonia refrigeration system.\r\nProcess Hazard Analysis\r\nAs part of the ammonia refrigeration system installation process, and as required under PSM, the facility conducted a comprehensive study to ensure that hazards associated with its ammonia refrigeration system are identified and controlled efficiently. These studies, using \"What if/Checklist\" scenarios, will be repeated every 5 years by a team of qualified personnel with expertise in refrigeration engineering and process operations. Any findings related to the process hazard analysis will be addressed in a timely manner.\r\nOperating Procedures\r\nFor the purpose of safely conducting activities related to our ammonia refrigeration system, the CCNA Dunedin Facility maintains written operating procedures. These procedures address various modes of operation including startup, normal operations, emergency operations, normal shutdown, and emergency shutdown. The information is regularly reviewed and is readily accessible to all operators and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083050,
      "SummaryText": "contractors who work with the ammonia refrigeration system.\r\nTraining\r\nThe CCNA Dunedin Facility has a comprehensive training program in place to ensure that employees who are working with the ammonia refrigeration system are competent in all relevant operating procedures. Refresher training is provided at least every three (3) years or more frequently as needed.\r\nMechanical Integrity \r\nThe CCNA Dunedin Facility carries out and documents maintenance checks on ammonia refrigeration system equipment to ensure proper operation. Process equipment examined by these checks includes among others: pressure vessels, piping systems, pressure relief valves, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in applicable maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\nWritten procedures are in place at the CCR Dunedin Facility to manage changes in ammonia refrigeration system technology, equipment, and procedures. Process operators, maintenance personnel, or any other employee whose job tasks are affected by an ammonia refrigeration system modification are promptly aware of, and offered training to deal with the modification.\r\nPre-Startup Reviews\r\nPre-start up safety reviews are conducted any time the ammonia refrigeration systems, or any of its components, are opened for repairs, tie-ins, or modifications. These reviews are conducted to confirm that construction, equipment, operating procedures, and maintenance procedures are suitable for safe startup prior to placing equipment into operation. \r\nCompliance Audits\r\nThe CCNA Dunedin Facility will conduct audits on a regular basis to ensure that the provisions set out under the RMP rule are being properly implemented. These audits will be carried out at least every three"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000083050,
      "SummaryText": "(3) years and any corrective actions required as a result of the audits shall be undertaken in a safe and prompt manner.\r\nIncident Investigation\r\nThe CCNA Dunedin Facility promptly investigates any incident that has resulted in, or could reasonably result in, an accidental release of ammonia. These investigations are undertaken to identify the situation leading to the incident, as well as any corrective actions taken to prevent the release from reoccurring. All incident investigation reports will be retained for a minimum of five (5) years.\r\nEmployee Participation\r\nThe CCNA Dunedin Facility truly believes that accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to information related to RMP implementation, including Process Hazard Analysis (PHA) information.\r\nContractors\r\nOn occasion, our company hires experienced contractors to conduct specialized maintenance and/or construction activities related to the ammonia refrigeration system. Prior to selecting a contractor, a thorough evaluation is made of the contractor's safety performance. The CCNA Dunedin Facility has a strict policy of informing the contractors of known potential hazards related to the contractor's work with the ammonia refrigeration system. Contractors are also informed of all the procedures for emergency response should an accidental release of ammonia occur.\r\n\r\n5.\tFive-year Accident History\r\nThe ammonia refrigeration system at this facility has been operational for over 20 years. To date, the facility has not experienced a release that exceeds the 100 pound threshold.\r\n\r\n6.\tEmergency Response Plan\r\nThe CCNA Dunedin Facility Emergency Response Policy focuses on evacuation of the facility in the event of an ammonia emergency, with local emergency response agencies performing all rescue, firefighting, first-aid, medical treatment, and other res"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000083050,
      "SummaryText": "ponse functions. The facility maintains a written Emergency Response Plan to document specific procedures to be implemented in the event of various emergencies, including ammonia release. The Emergency Release Plan includes procedures for facility evacuation, as well as for notification o the local emergency response agencies which are responsible for notifying the public. The plan is promptly updated to reflect any pertinent changes taking place within the facility that would require modified procedures.\r\nPinellas County Emergency Management, which works with Florida District 8 LEPC, is the agency with which our Emergency Response Plan has been coordinated. The Dunedin Fire Department is the primary emergency response agency for all facility emergencies, including ammonia release.  In July 2010, the facility initiated contact with local fire department and hazardous materials response team to develop plans for coordinated drill events.  These activities are on-going.\r\n\r\n7.\tPlanned Changes to Improve Safety\r\nThe CCNA Dunedin Facility has enclosed the ammonia refrigeration engine room area.  The facility maintains a preventative maintenance program to identify and address potential maintenance related issues of the ammonia based equipment."
    }
  ]
}