{
  "FacilityID": 1000059023,
  "FacilityName": "Solenis - Portland Plant",
  "FacilityStr1": "3366 NW Yeon Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Portland",
  "FacilityState": "OR",
  "FacilityZipCode": "97210",
  "Facility4DigitZipExt": "1526",
  "FacilityCountyFIPS": "41051",
  "LEPC": null,
  "FacilityLatDecDegs": "45.546389",
  "FacilityLongDecDegs": "-122.707500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": "www.solenis.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9058314,
  "ParentCompanyName": "Solenis LLC",
  "Company2Name": null,
  "CompanyDUNS": 79436434,
  "Company2DUNS": 0,
  "OperatorName": "Solenis LLC",
  "OperatorStr1": "3 Beaver Valley Road, Suite 500",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19803",
  "OperatorZipCodeExt": "6220",
  "RMPContact": "Lauren M Wilcox",
  "RMPTitle": "EH&S Supervisor",
  "FTE": 30,
  "OtherEPAFacilityID": "ORD009058314",
  "EPAFacilityID": "100000154888",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-10-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-07-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-07-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-07-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-07-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 45.54644,
  "FRS_Long": -122.70991,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000073612,
      "AltID": "Kymene",
      "FacilityID": 1000059023,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000074793,
          "ProcessID": 1000073612,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000090899,
          "ProcessID": 1000073612,
          "ChemicalID": 21,
          "Quantity": 686000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 21,
            "ChemicalName": "Epichlorohydrin  [Oxirane, (chloromethyl)-]",
            "CASNumber": "106-89-8",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000590899,
          "ProcessID": 1000073612,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059023,
      "SummaryText": "Solenis LLC, and its commercial units and majority-owned or controlled subsidiaries strive for excellence in global environmental, health, safety, and security (EHS&S) performance.\n\n\n\nWe responsibly manage our global environmental, health, safety and security obligations and positively contribute to the communities in which we operate and to society as a whole.\n\n\n\nResponsible Care at Solenis includes:\n\n-A global management system to deliver excellence in environmental, health, safety and security performance and meet required  local, regional, international and business specific standards.  \n\n-Employee involvement at every level of the organization  \n\n-Continuous improvement toward Solenis's goals to operate with zero incidents, achieve 100 percent compliance, and reduce our environmental, health, safety and security impact \n\n\n\nWe create safe work environments, require compliance and promote environmental stewardship.  These values and principles are reflected in Solenis's Responsible Care goals:\n\n\n\nOperate with zero incidents.  We care about the health and safety of our employees and promote safe and secure operations together with our business community partners.  We support a zero incident culture where environmental, health, safety and security incidents are preventable.  \n\n\n\nAchieve 100 percent compliance.  We require compliance with applicable environmental, health, safety and security laws, regulations and internal standards, while adhering to high ethical standards.  \n\n\n\nReduce environmental, health, safety and security impact.  We are committed to providing products and services that involve minimum risk to people and the environment throughout their life-cycle, while best meeting the needs of our customers.\n\n\n\nWe will define strategic objectives, develop tactical plans, identify clear accountability, provide necessary resources, and measure our progress on safety, health, and environmental matters on an ongoing basis. Our planning will consider both busine"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059023,
      "SummaryText": "ss goals and significant safety, health, and environmental aspects of our products and operations.\n\n\n\nWe will evaluate the safety, health, and environmental impacts of new and existing products and operations and will work to reduce the adverse impacts.\n\n\n\nWe will provide for an open dialogue on safety, health, and environmental issues relating to our products and operations with our stakeholders, including shareholders, employees, customers, suppliers, government agencies, and communities.\n\n\n\nWe will work to continually reduce workplace injuries; incidents with the potential for causing property damage, material loss, or interruption of our business; waste; and releases to the environment.\n\n\n\nWe will emphasize product stewardship and advocate its importance to our suppliers, distributors, and customers.\n\n\n\nEvery Solenis employee, worldwide, has a role to play. All of us are responsible and accountable for adhering to the letter and spirit of this policy. All of us must incorporate safety, health, and environmental considerations into our daily business activities. It takes a total team effort to truly be a Responsible Care company.\n\n\n\nFacility Description:\n\nThe primary activity at the Portland Plant is the manufacture of chemical additives, including wet strength resins, that are used in the pulp and paper industry.  Epichlorohydrin, is used in the production of wet-strength resins. These resins are used to improve the wet-strength characteristics in a variety of paper applications.  Epichlorohydrin is a raw material for the process and is consumed in a chemical reaction to make the product.  The plant primarily receives Epichlorohydrin in tank cars however there is the capability of receiving tank trucks.  Epichlorohydrin is stored in a tank that holds a maximum of 307,700 pounds; the storage tank is provided with a containment dike and leak detectors to minimize adverse impacts from any leaks or spills.  Spill containment capability is also provided for the area "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059023,
      "SummaryText": "where tank trucks and rail cars are unloaded.\n\n\n\nAccident Prevention Program:\n\nThe process is subject to the OSHA Process Safety Management standard (29 CFR 1910.119) and has a complete process safety management system in place.  This includes the use  of process hazards analysis to identify and address potential hazards, management of change procedures to control modifications, mechanical integrity procedures for minimizing mechanical failures, detailed operating procedures for process control, and operator training for the personnel involved in the process.\n\n\n\nFive Year Accident History:\n\nIn the past five years, the Portland Plant has not had any accidental releases of Epichlorohydrin that have resulted in on-site injuries or damage or any off-site impacts.\n\n\n\nEmergency Response Program:\n\nThe Portland Plant has a written emergency response plan and coordinates emergency response matters with the Portland Fire Bureau.  In addition, the plant is an active participant in a mutual support group that includes other companies and agencies in Portland.  The plant has provided emergency response training for all plant employees."
    }
  ]
}