{
  "FacilityID": 1000013099,
  "FacilityName": "Goose Creek Water Treatment Plant",
  "FacilityStr1": "20521 Belmont Ridge Road",
  "FacilityStr2": null,
  "FacilityCity": "Ashburn",
  "FacilityState": "VA",
  "FacilityZipCode": "20147",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51107",
  "LEPC": "Loudoun Joint LEPC",
  "FacilityLatDecDegs": "39.04778",
  "FacilityLongDecDegs": "-077.520556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "SE",
  "FacilityURL": "fairfaxva.gov",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Fairfax,VA",
  "Company2Name": null,
  "CompanyDUNS": 74818477,
  "Company2DUNS": null,
  "OperatorName": "City of Fairfax",
  "OperatorStr1": "10455 Armstrong St.",
  "OperatorStr2": null,
  "OperatorCity": "Fairfax",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22030",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": "6600100",
  "EPAFacilityID": "100000115797",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-12-09 00:00:00",
  "SafetyInspectionBy": "Dennis Chlorination (Dennis Sales & Service, Inc.)",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-03-26 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-03-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-07-02 00:00:00",
  "DeRegistrationEffectiveDate": "2014-02-04 00:00:00",
  "AnniversaryDate": "2015-03-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.047888,
  "FRS_Long": -77.520269,
  "FRS_Description": "SE CORNER OF LAND PARCEL",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "20",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016353,
      "AltID": "Chlorine",
      "FacilityID": 1000013099,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019419,
          "ProcessID": 1000016353,
          "ChemicalID": 62,
          "Quantity": 28000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000016732,
          "ProcessID": 1000016353,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000013382,
              "Process_NAICS_ID": 1000016732,
              "SafetyReviewDate": "2010-03-15 00:00:00",
              "PHA_Date": "2010-03-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-12-10 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-03-17 00:00:00",
              "TrainingReviewDate": "2010-03-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-01-28 00:00:00",
              "EquipmentInspectionDate": "2009-12-09 00:00:00",
              "EquipmentTested": "Vacuum regulator, relief valve, chlorine sensors, and alarm system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2010-01-28 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2010-02-19 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-03-17 00:00:00",
              "HotWorkPermitReviewDate": "2009-12-14 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000016060,
                  "PreventionProgram3ID": 1000013382,
                  "ProcessChemicalID": 1000019419
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000013099,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-03-17 00:00:00",
    "ERTrainingDate": "2004-12-01 00:00:00",
    "CoordinatingAgencyName": "Loudoun Emergency Planning Commiss.",
    "CoordinatingAgencyPhone": "7037770333",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "40 CFR 355"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000013099,
      "SummaryText": "s will provide all affected employees with a heightened awareness of safety issues related to the covered processes.\n \nPrevention Program-Water Treatment Plant\nThe chemical accident prevention program for the chlorine process includes procedures and safeguards that are in-place and in use throughout the facility.  These were cited in the hazard review sessions and include:\n&#61656;\tAdministrative controls, such as operating procedures, operator inspection rounds, maintenance procedures, employee training, experienced personnel, and reliable vendors;\n&#61656;\tSensors and alarms for the presence of chlorine gas in the atmosphere; and\n&#61656;\tDesign safeguards such as relief devices and vacuum regulators.\nThe prevention program contains the elements required for Program 3 processes, including safety information, hazard review, operating procedures, training, maintenance, compliance audits, incident investigations, hot work permits, and contractor management."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013099,
      "SummaryText": "g and maintenance procedures for those Employees involved in operating the covered processes.  The technological safeguards include controls, sensors, alarms, and industry-standard systems.  All of these serve to prevent unintended releases of chlorine.  Should the prevention program fail to prevent a release, the chlorine storage containers are kept inside of a building to mitigate the effects of a release. \nFive-Year Accident History \nThere have been no accidents involving the accidental release of chlorine gas at the GCWTP during the last five (5) years.\nEmergency Response Program\nThis facility has established and maintains an Emergency Action Plan that is coordinated with local response agencies, such as Loudoun County Fire Department (Ashburn Station).  The goals of the plan are to protect on-site Employees from the hazardous effects of the releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect in-house personnel changes and regulatory changes.  It is also periodically submitted to the Fire Department for review and comment.  City (GCWTP) Employees have been trained and are equipped to handle incidental releases of chlorine, as required at the facility. \nPlanned Changes to Improve Safety\nIdeas for changes to improve safety are actively sought from Employees at the GCWTP.  Employee meetings that focus on safety issues are held regularly at this facility.  Employees are encouraged and trained to recognize hazards and present ideas to eliminate them or to minimize the potential consequences of those hazards.  \nDuring the development of the Risk Management Plan, hazard reviews were conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chemical releases.  Each recommendation has been or is being considered and evaluated for implementation.  This evaluation proces"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013099,
      "SummaryText": "Executive Summary\nIntroduction\nThe City of Fairfax, Goose Creek Water Treatment Plant (GCWTP) has used chlorine gas to disinfect water since the facility first went on-line in 1961 and has an excellent safety record over these past 49 years using chlorine.  Since first using chlorine, the facility has had only three (3) incidents in the last 27 years and no incidents during the last 10 years.  \nThe basic operation of the chlorination system and the manner for which it is fed into the system has not changed since the last plant expansion in 1981.  Operating procedures have not changed much since that time, but have been updated to reflect any significant changes.  The only significant change associated with the GCWTP and the facility's  chlorination system and this Risk Management Plan (RMP) is the population of the nearby community has increased since when the RMP was last updated.  Current population estimates inside the 3.0 mile endpoint from the GCWTP, based on 2000 Census date is 31,247; whereas, the current (2009) population estimate is approximately 54,814 persons, based on Loudoun County demographer statistics on home sales, etc., in this area.\nMaps and population figures are provided herein utilizing LandViewÂ¿ 6 and MARPLOT and demographics software, which are based on Census 2000 data.  An aerial view map of the facility with relationship to the 0.3 mile and 3.0 mile endpoints from the GCWTP is also provided.   \nPersonnel safety at the GCWTP continues to be a high priority at the facility as relevant by the recent appointment of a facility Safety Coordinator.  The continued emphasis of increasing safety awareness and instilling a Â¿Safety-FirstÂ¿ attitude amongst facility staff will help assure accident prevention and OSHA compliance, as well as, help assure quality water is delivered to our customers and protection of the nearby community.  \nRelease Prevention and Emergency Response Policies\nThe City of Fairfax; herein referred to as the City, takes an ac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013099,
      "SummaryText": "tive role in preventing accidental releases at its water treatment facility by ensuring that its employees are properly trained in the safe operation and maintenance of processes subject to the Part 68 Rule.  This training includes the safe handling of regulated substances under the rule.  The City has also developed and maintained a Risk Management Policy that contains general safety rules.  Though these rules do not specifically address the covered processes and their regulated substances, compliance with these general rules significantly reduces the potential for accidental releases of the regulated substances.  This facility complies with industry-standard practices for water treatment plants that use Chlorine in bulk.\nAs for emergency response, the City has established and maintains procedures for emergency notification and response.  These are reviewed with Employees on a periodic basis and revised as necessary to accommodate changes in staffing when they occur.  In general, the City would deal only with incidental releases of a small amount of a regulated substance.  If the release is determined to be large or if the chemical is stored outside or has migrated outside from a release indoors, the City would immediately notify the Loudoun County Fire Department (Ashburn Station) by calling 911.\nCity Management understands its duty to providing a safe working environment for its employees at this facility and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and referenced in this document.\nFacility and Regulated Substance\nThe Goose Creek WTP treats surface water from the Goose Creek to provide drinking water to the community.  It does this through a series of physical and chemical treatment process operations that include pretreatment neutralization, flocculation and sedimentation, filtration, and disinfection with chlorine.  The treated water, now ready for use by"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013099,
      "SummaryText": "the public, is transferred to a large reservoir and pumped into the distribution system.  The design capacity of the treatment plant is 18 million gallons per day (MGD).  The regulated substance that is stored, handled, and used at this facility is Chlorine.  The chlorine is stored in 1-ton containers with a maximum intended inventory of 14 containers on-site.  The 1-ton chlorine containers are stored inside the Chlorine Room and in the Loading Dock area.\nWorst-Case and Alternative Release Scenarios\nThe Â¿worst-case releaseÂ¿ scenario for chlorine involves one of the 1-ton containers used in the process.  Each container can contain 2,000 pounds of chlorine.  The rule for worst-case release analysis assumes all of the contents are released in 10 minutes.  The scenario assumed a release of all the contents of a single container outside of any enclosure, though the containers are normally stored inside of a building.  No mitigative measures were considered.  \nThe choice for an Â¿alternative release scenarioÂ¿ was a severed header in the Chlorine Storage and Feed Room, allowing the contents of two connected and full containers to release chlorine gas into the Chlorine Storage and Feed Room.  The chlorine is released into the room through a 3/8-inch diameter hole at 5.7 atmospheres, the pressure inside a full container.  The hole releases 61.9 pounds per minute, taking approximately 65 minutes to empty the two containers.  The mitigation measure of release in an enclosed space is used.  For both analyses, the EPAÂ¿s RMP*Comp program was used, which is based on the formulae in EPAÂ¿s Risk Management Program Guidance for Wastewater Treatment Plants.\n \nAccidental Release Prevention Program\nThe facilityÂ¿s prevention program for chlorine complies with EPAÂ¿s 40 CFR Part 68 Rule for Program 3 processes.  To maintain this compliance, the City has in-place many procedural and technological safeguards.  The procedural safeguards include an Employee-training program and operatin"
    }
  ]
}