{
  "FacilityID": 1000075823,
  "FacilityName": "The Andersons Marathon Holding LLC",
  "FacilityStr1": "2404 West Highway 30",
  "FacilityStr2": "P.O. Box 309",
  "FacilityCity": "Denison",
  "FacilityState": "IA",
  "FacilityZipCode": "51442",
  "Facility4DigitZipExt": "0309",
  "FacilityCountyFIPS": "19047",
  "LEPC": "Crawford County LEPC",
  "FacilityLatDecDegs": "41.992100",
  "FacilityLongDecDegs": "-095.394200",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "The Andersons Marathon Holding LLC",
  "OperatorStr1": "1947 Briarfield Blvd",
  "OperatorStr2": "PO Box 119 (Attn: Safety Dept)",
  "OperatorCity": "Maumee",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43537",
  "OperatorZipCodeExt": null,
  "FTE": 42,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000193024",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-06-28 00:00:00",
  "SafetyInspectionBy": "AXA Matrix Risk Consultants (Third Party)",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-10-07 13:50:19",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-02-11 16:56:08",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-02-11 16:56:08",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-02-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.98905,
  "FRS_Long": -95.39912,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000094381,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000075823,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000118132,
          "ProcessID": 1000094381,
          "ChemicalID": 155,
          "Quantity": 560000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000102805,
              "ProcessChemicalID": 1000118132,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000102806,
              "ProcessChemicalID": 1000118132,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000102807,
              "ProcessChemicalID": 1000118132,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000102859,
              "ProcessChemicalID": 1000118132,
              "ChemicalID": 137
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000095643,
          "ProcessID": 1000094381,
          "NAICSCode": "325193",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000080463,
              "Process_NAICS_ID": 1000095643,
              "SafetyReviewDate": "2018-08-29 00:00:00",
              "PHA_Date": "2018-08-29 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-08-29 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-01-23 00:00:00",
              "TrainingReviewDate": "2018-08-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-08-28 00:00:00",
              "EquipmentInspectionDate": "2019-01-31 00:00:00",
              "EquipmentTested": "Tank, Dike and Pipe visual Inspection (Monthly)",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2018-08-28 00:00:00",
              "PreStartupReviewDate": "2018-03-28 00:00:00",
              "ComplianceAuditDate": "2018-08-28 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-08-28 00:00:00",
              "HotWorkPermitReviewDate": "2018-08-28 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000099863,
                  "PreventionProgram3ID": 1000080463,
                  "ProcessChemicalID": 1000118132
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000075823,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Crawford 24 - Gregory J. Miller",
    "CoordinatingAgencyPhone": "7122692422",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075823,
      "SummaryText": "Denison Ethanol RMP Executive Summary\r\n\r\nSite and Process Description\r\n\r\nThe Andersons Denison Ethanol LLC is located at 2404 West Highway 30 in Denison, Iowa.  The facility is in Crawford County. The site is on the north side of Highway 30, across from the intersection of Westcott Road and Highway 30. \r\n\r\nThe Andersons Denison Ethanol LLC facility operates 24 hours a day, 7 days a week with a staff of approximately 43 people.  The following operations are performed at this facility:  grain receiving and storage; hammer milling; fermentation; distillation, dehydration and evaporation (DDE); separation; wet and dry distillers grain and solubles (WDGS / DDGS) drying; storage and shipping; and ethanol storage and shipping.  \r\n\r\nThe plant receives corn by way of the on-site grain elevator.  Grain is stored temporarily in the concrete silos and steel bins, prior to being fed to three hammer mills where the corn is dry-milled into a powder and then conveyed to the production area.\r\n\r\nAdditives are incorporated into the process and the product is fermented, creating a beer mash.  The product goes through a scrubbing process to removed residual volatile organics and then enters the distillation and condensation process.  The beer is approximately 10% ethanol and 90% non-fermentable corn solids.  The ethanol is separated from the beer at this stage and leaves as 190-proof ethanol, which is sent to a bulk storage tank.  The 190-proof contains residual water, so it is filtered one more time, which produces 200-proof ethanol.  Lastly, the 200-proof ethanol is mixed with a denaturant and stored in either of two tanks prior to transferring to the truck or rail loadout areas.  Vapors from the process vessels and distillation are controlled through a thermal oxidizer.\r\n\r\nThe distillation process removes the ethanol from the beer, non-fermentable corn solids and water.  The remaining water is then removed from the residual mash or whole stillage.  The resulting product is called wet"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075823,
      "SummaryText": "distillers grain (WDG's).  About half of the WDGS is dried to approximately 60% moisture content and is called Modified Distillers Grain.  The MDG's are sold directly to customers as high-quality animal feed.  The other half of WDG's are dried to approximately 11% moisture content and is called Dried Distillers Grain.  The DDG's travel through the cooling tube before being stored in the DDG Building located on the south side of the facility.  They can be stored for extended periods of time and are shipped out by truck or rail.  \r\n\r\nThe thermal oxidizer serves as the primary emission control device for the two dryers as well as various process vents.  The thermal oxidizer is very efficient at controlling particulates, carbon monoxide, VOC's, HAP's and nuisance odors.\r\n\r\nThe facility also has a water cooling tower for non-contact cooling water used in the fermentation process and a fire pump for emergency use.\r\n\r\nRMP Applicability & Chemical Description\r\n\r\nThe facility stores and utilizes one product containing chemicals that require participation in the Risk Management Plan.  That material is natural gasoline, a flammable mixture, which is used as a denaturant.    \r\n\r\nThere are multiple chemical constituents within natural gasoline.  Based on chemical analysis, four of those constituents, butane; pentane; 2,2-dimethylpropane; and 2-methylbutane are subject to the Risk Management Plan. By weight, butane makes up 0.806%, pentane makes up 24.518%, 2,2-dimethylpropane makes up 0.237%, and 2-methylbutane makes up 22.960% of the natural gasoline.  Total percent by weight of chemicals subject to the Risk Management Plan requirements is 48.521%.  \r\n\r\nNatural gasoline is stored in a steel tank located in the facility's tank farm.  The maximum usable capacity is limited to 85% of 100,000-gallon design of the tank.  Secondary containment consisting of a diked structure containing an impermeable liner and gravel overlay, surrounds the tank farm.  \r\n\r\nSummary of Release Scenario"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075823,
      "SummaryText": "s\r\n\r\nWorst Case Release - Flammable Mixture, Natural Gasoline\r\n\r\nThe worst-case release scenario would be a total loss of a full tank of natural gasoline resulting in a vapor cloud explosion.  The usable storage tank capacity is 100,000 gallons or 552,800 pounds of natural gasoline.  Of the 552,800 pounds of natural gasoline, 268,200 pounds (48.521% by weight) are subject to the worst-case release evaluation for flammable mixtures of the Risk Management Plan.\r\n\r\nRMP Comp was used to determine the distance to 1 psi overpressure and 2010 US Census Bureau Data was used to determine public receptor information.\r\n\r\nAlternative Release - Flammable Mixture, Natural Gasoline\r\n\r\nThe most likely cause of a natural gasoline emergency is a release during a delivery due to a faulty hose or valve resulting in a vapor cloud explosion.  Deliveries are made by rail-car and pumped into the natural gasoline storage tank.  Rail-cars are designed to carry 30,000 gallons or 165,600 pounds of natural gasoline.  At 48.521% by weight, 80,400 pounds are Risk Management Plan chemicals.  \r\n\r\nRMP Comp was used to determine the distance to 1 psi overpressure and 2010 US Census Bureau Data was used to determine public receptor information.\r\n\r\nExplanation of How Releases are Prevented\r\n\r\nThe Denaturant storage tank has a floating roof and can hold up to 100,000 gallons.  The tank fill limit is 85% to control the possibility of an overfill and spill in containment.  Overfill can cause damage to tank and product on the ground.  The lower limit is 10% to prevent issues with displacement of the floating roof.  Each rail-car will contain enough product to fill 30% of the Denaturant storage tank.  Before unloading a rail-car the Denaturant storage tank volume is checked by the control room to make sure there is enough room in the Denaturant storage tank for the entire load, the tank must be no more than 55% full to accept and unload a natural gasoline rail-car or trailer.  The level indicators are inspe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000075823,
      "SummaryText": "cted and tested monthly for accuracy.\r\n\r\nAll deliveries are made during business hours and are observed by the facility personnel.  Specific procedures were developed for the unloading of Natural gasoline.  If a release were to occur the delivery attendants could stop the flow within minutes.  The loadout area, where deliveries occur, has a catchment basin with underground piping to secondary containment of the tank farm.\r\n\r\n\r\nActive mitigation refers to equipment, devices or technologies that require human, mechanical or other energy input to function.  The active mitigation systems in place include:\r\n\r\nExcess flow valves are located on appropriate liquid valves used in transferring the natural gasoline.  They close automatically if the volume of liquid flowing through the line exceeds the normal flow rate.  Two principal causes of the excess valve closing are a ruptured hose or a broken pipe or shutoff valve downstream that is opened too quickly.\r\n\r\nBack check valves are located on the unloading lines are designed to ensure that the flow goes in one direction only.  This prevents natural gasoline from flowing back to the transport tank from the storage tank.\r\n\r\nThere manual emergency shut off valves near the natural gasoline storage tank.\r\n\r\nPrevention Program\r\n\r\nPreventive maintenance is an integral piece of this facility's hazard management program.  All hoses, tanks, valves and storage units are inspected at least monthly.  A good PM program is our strongest defense against a release of flammable mixtures.  All hose replacements are documented.  Records of all maintenance tasks performed on the tank or appendages are also on file.\r\n\r\nManagement System\r\n(see \"Steps Taken to Address Hazards\")\r\n\r\nEquipment maintenance\r\n\r\nAll equipment maintenance is formally documented. See the \"Prevention Program\" section for further explanation.\r\n\r\nTraining\r\n\r\nAll employees receive annual training on the facilities emergency action plan, spill procedures, and hazard communicatio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000075823,
      "SummaryText": "n.  Documentation and attendance rosters are on file at the facility.  \r\n\r\nContractors\r\n\r\nContractors that are hired by The Andersons, Inc. go through a documented Prequalification Process.  Records of this evaluation are kept on file.\r\n\r\nAll contractors also receive a \"contractor safety review\" prior to performing work at the facility.  During this review, they are informed of any potential hazards at the facility, emergency procedures, site-specific safety rules and the ability to request a SDS for any product at any time.\r\n\r\nSteps Taken to Address Hazards\r\n\r\nThe Andersons Denison Ethanol LLC has many systems in place for hazard assessment and mitigation.  \r\n\r\nThe Safety Department performs annual hazard management audits at the facility.  The audits include a physical walk through of the entire facility and a review of all EPA, OSHA and DOT paperwork and training documentation.  Action items are noted, and recommendations are made. The audits consist of five major topical areas:  Safety & Health, Environmental, Fire Protection & Security, Administrative and Housekeeping & Storage.  Issues are documented in a report and sent to the facility manager and upper management.  Updates on action item status must be made regularly.\r\n\r\nA Process Hazard Analysis (PHA) has been performed at this facility, as part of the Process Safety Management Program.  The analysis will be updated every five years, or as changes in the process are made.  PHA's are performed using the Haz Op protocol and analyze all aspects involved in the production of ethanol.  The evaluation team includes representatives from the corporate Safety Department, facility Management and Operations employees.\r\n\r\nFormal investigations are performed for all environmental or safety incidents.  Documentation is kept on file at the facility and the corporate Safety Department.\r\n\r\nA formal Management of Change (MOC) system is in place at this facility.  An electronic form is submitted whenever a change is made to a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000075823,
      "SummaryText": "ny of the processes within the scope of the PSM program.  Forms are routed from the facility operator to the Engineering and Safety Departments for review and remarks.  A copy of the completed form is kept on file at the facility.\r\n\r\nMonthly Safety Committee meetings allow employees to discuss any concerns they may have with the operation of the facility.  Issues are documented and assigned to employees for follow-up. Records of all meetings are kept at the facility.\r\n\r\nResponse Action in the Event of a Release\r\n\r\nIn the event of a small, controlled leak or defective valve, employees are instructed to shut down the transfer process and, if possible, don the appropriate PPE, approach the shutoff valve from upwind and attempt to turn it off. \r\n\r\nFor an uncontainable release, employees will immediately call the police and fire department or other first responders, as appropriate.  All employees, customers and contractors are to be evacuated to an upwind location. Once the response team has arrived, we will work in concert with them to close the valves between the tank and the leak or spill. \r\n\r\nThe employees are instructed to make emergency phone calls in this order:  911, the facility Manager, the corporate Safety Department emergency phone number, the state emergency hotline and the National Spill Response Center phone number.  All applicable contact names and numbers are found in the facility spill and emergency action plan. \r\n\r\n\r\n\r\nCommunication procedures with responders\r\n \r\nThe local fire department is invited to tour the facility on an annual basis.  Facility management, employees and fire department personnel have jointly discussed the location of the natural gasoline storage tanks and response procedures on a regular basis.  They know the location of all emergency shutoff valves and on-site response equipment.  We believe that a strong relationship with first responders is our best defense.\r\n\r\nThe LEPC and state regulatory agencies receive a copy of our hazard"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000075823,
      "SummaryText": "ous materials storage information, every February, in accordance with our community right to know obligations.  A copy of the Emergency Action Plan is on file with the LEPC and the local fire department.\r\n\r\nThe facility has not had an accident associated with their RMP regulated chemicals in the last five years.\r\n\r\nSecurity Plans\r\n\r\nThe Department of Transportation (DOT), Research and Special Programs Administration (RSPA) 49 CFR Part 172, requires all facilities that offer or transport hazardous materials to document a security plan and perform employee awareness training.  \r\n\r\nA security assessment plan has been created to describe all security measures at this facility, identify any vulnerable areas and then document the measures taken to address those risks.  The plan is intended to work in conjunction with the Emergency Action and Spill Control Plan to meet all required criteria.\r\n\r\nTraining is performed with all employees annually and within 90 days of employment."
    }
  ]
}