{
  "FacilityID": 1000074903,
  "FacilityName": "Brenntag Mid-South Inc.",
  "FacilityStr1": "3687 Forrest Road",
  "FacilityStr2": null,
  "FacilityCity": "Bedford",
  "FacilityState": "VA",
  "FacilityZipCode": "24523",
  "Facility4DigitZipExt": "1153",
  "FacilityCountyFIPS": "51019",
  "LEPC": "Bedford County LEPC",
  "FacilityLatDecDegs": "37.346418",
  "FacilityLongDecDegs": "-079.483029",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "bmason@brenntag.com",
  "FacilityDUNS": 47372503,
  "ParentCompanyName": "Brenntag Mid-South, Inc",
  "Company2Name": null,
  "CompanyDUNS": 92963644,
  "Company2DUNS": 0,
  "OperatorName": "Brenntag Mid-South Inc",
  "OperatorStr1": "1405 Highway 136 West",
  "OperatorStr2": null,
  "OperatorCity": "Henderson",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42420",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bryon Mason",
  "RMPTitle": "Director QSHE",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000020461",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-11-01 00:00:00",
  "SafetyInspectionBy": "Internal audit",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-12-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-12-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-12-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-12-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.35591,
  "FRS_Long": -79.46865,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000093300,
      "AltID": "Chlorine",
      "FacilityID": 1000074903,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000094602,
          "ProcessID": 1000093300,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000116792,
          "ProcessID": 1000093300,
          "ChemicalID": 62,
          "Quantity": 4200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000616792,
          "ProcessID": 1000093300,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000093301,
      "AltID": "Cylclohexylamine storage",
      "FacilityID": 1000074903,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000094603,
          "ProcessID": 1000093301,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000116793,
          "ProcessID": 1000093301,
          "ChemicalID": 31,
          "Quantity": 21900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 31,
            "ChemicalName": "Cyclohexylamine  [Cyclohexanamine]",
            "CASNumber": "108-91-8",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000616793,
          "ProcessID": 1000093301,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000074903,
      "SummaryText": "General Executive Brenntag Southeast Bedford, VA\n\n\n\n1.Accidental Release Prevention and Emergency Response Policies\n\nWe at Brenntag Mid-South Inc. are strongly committed to employee, public and environmental safety.  We are ISO 9000-2015 quality management system certified and are a member of the National Association of Chemical Distributors Responsible distribution compliance program.  This commitment is also demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n\n\n2.The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass Chemical distribution.  We have 2 regulated substances present at our facility equal to or in excess of the reporting thresholds.\n\n\n\n\n\n3.The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nBrenntag Mid-South Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is Checklist.   Any findings related to the hazard analysis are addressed in a timely manner. \n\n\n\nOperat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000074903,
      "SummaryText": "ing Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Brenntag Mid-South Inc. maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nBrenntag Mid-South Inc. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  \n\n\n\nMechanical Integrity\n\nBrenntag Mid-South Inc. carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at Brenntag Mid-South Inc. to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Brenntag Mid-South Inc.  \n\n\n\nCompliance Audits\n\nBrenntag Mid-South Inc. conducts audits on a regular basis to determine whether the provisions set out un"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000074903,
      "SummaryText": "der the RMP rule are being implemented.  The most recent compliance audit was conducted on 04/06/2016.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nBrenntag Mid-South Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nBrenntag Mid-South Inc. truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Brenntag Mid-South Inc. has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n\n\n4.Five-year Accident History\n\nBrenntag Mid-South Inc. has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n\n5.Emergency Response Plan\n\nBrenntag Mid-South Inc. carries a written emergency respon"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000074903,
      "SummaryText": "se plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nInternal Safety Audit is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\n\n6.Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.\n\n\n\nSubstances considered as worse case are determined by the RMP Submit Software.  Chemicals for consideration are determined by review of a computer generated Tier II report which lists maximum amount on site for all chemicals stored at a facility.  The  of the largest container is taken form the Mainframe computer system which lists containers s.  Facilities that have bulk tanks are listed in the facilities tank listing and the largest tank for a listed chemical is used.  EPA RMP Comp and on site facility information is used to determine worse case scenarios.  Anticipated effects of controls are entered into the RMP Comp Program. \n\n\n\nAlternate releases are determined by the RMP Submit Software.  Chemicals for consideration are determined by review of a computer generated Tier II report which lists maximum amount on site for all chemicals stored at a facility.  The  of the largest container is taken form the Mainframe computer system which lists containers s.  Facilities that have bulk tanks are listed in the facilities tank listing and the largest tank for a listed chemical is used.  EPA "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000074903,
      "SummaryText": "RMP Comp and on site facility information is used to determine worse case scenarios.  Anticipated effects of controls are entered into the RMP Comp Program.  Alternate releases are estimated at 10 minutes to completely empty the largest container on site.\n\n\n\nEstimated quantities are the largest container taken form the Mainframe computer system that lists containers s.  Facilities that have bulk tanks are listed in the facilities tank listing and the largest tank for a listed chemical is used.  EPA RMP Comp and on site facility information is used to determine release rate, duration of release.  Alternate releases are estimated at 10 minutes to empty the largest container.\n\n\n\nEPA RMP Comp is the methodology used to determine distance to endpoints\n\n\n\nUS census figures are used to determine population, \n\nhttp://factfinder.census.gov/servlet/GCTTable?_bm=y&-ds_name=DEC_2000_SF1_U&-CONTEXT=gct&-mt_name=DEC_2000_SF1_U_GCTPH1_US9&-redoLog=false&-_caller=geoselect&-geo_id=&-format=US-25|US-25S&-_lang=en\n\n\n\nLive search maps and area knowledge is used to determine environmental receptors.\n\nreceptors."
    }
  ]
}