{
  "FacilityID": 1000036244,
  "FacilityName": "TVA - Widows Creek Fossil Plant",
  "FacilityStr1": "County Road 96",
  "FacilityStr2": null,
  "FacilityCity": "Stevenson",
  "FacilityState": "AL",
  "FacilityZipCode": "35772",
  "Facility4DigitZipExt": "2000",
  "FacilityCountyFIPS": "01071",
  "LEPC": "Jackson County LEPC",
  "FacilityLatDecDegs": "34.887778",
  "FacilityLongDecDegs": "-085.752194",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.tva.gov",
  "FacilityEmailAddress": "tvainfo@tva.gov",
  "FacilityDUNS": 1883032,
  "ParentCompanyName": "Tennessee Valley Authority",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Scott Fallecker",
  "OperatorStr1": "County Road 96",
  "OperatorStr2": null,
  "OperatorCity": "Stevenson",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35772",
  "OperatorZipCodeExt": "2000",
  "FTE": 302,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000182303",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "705-0008-Z007",
  "SafetyInspectionDate": "2004-09-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-09-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-09-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2015-09-23 00:00:00",
  "DeRegistrationEffectiveDate": "2015-09-21 00:00:00",
  "AnniversaryDate": "2018-09-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.883314,
  "FRS_Long": -85.755278,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044436,
      "AltID": "Anhydrous Ammonia System",
      "FacilityID": 1000036244,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000053478,
          "ProcessID": 1000044436,
          "ChemicalID": 56,
          "Quantity": 178000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000044856,
          "ProcessID": 1000044436,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000038644,
              "Process_NAICS_ID": 1000044856,
              "SafetyReviewDate": "2012-03-09 00:00:00",
              "PHA_Date": "2013-08-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-02-07 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-12-05 00:00:00",
              "TrainingReviewDate": "2012-03-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-08-07 00:00:00",
              "EquipmentInspectionDate": "2013-09-10 00:00:00",
              "EquipmentTested": "tanks, pumps, compressors, piping, valves, vaporizors, instrumentation",
              "ChangeMgmtDate": "2013-05-01 00:00:00",
              "ChangeMgmtReviewDate": "2003-04-07 00:00:00",
              "PreStartupReviewDate": "2004-05-01 00:00:00",
              "ComplianceAuditDate": "2012-03-09 00:00:00",
              "AuditCompletionDate": "2012-09-09 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-03-09 00:00:00",
              "HotWorkPermitReviewDate": "2012-03-09 00:00:00",
              "ContractorSafetyReviewDate": "2012-03-09 00:00:00",
              "ContractorSafetyEvalDate": "2012-03-09 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000045808,
                  "PreventionProgram3ID": 1000038644,
                  "ProcessChemicalID": 1000053478
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000036244,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-06-01 00:00:00",
    "ERTrainingDate": "2008-02-08 00:00:00",
    "CoordinatingAgencyName": "Jackson County Emergency Management",
    "CoordinatingAgencyPhone": "2565749344",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036244,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\nI. Accidental Release Prevention and Emergency Policies\r\n\r\nEnvironmental protection and enhancement are essential elements of TVA's integrated resource management\r\nmission. TVA exhibits progressive environmental leadership in managing its unified river and power system for\r\nmultiple public benefits, including the production of reliable, competitively priced power. TVA is committed to setting\r\nthe standard for environmental excellence among utilities and federal agencies, and to making the Tennessee Valley\r\na model in sustainable energy, resource, and economic development and management. TVA assures that employees\r\nare aware of their environmental responsibilities, use effective environmental processes, and are held accountable for\r\nperformance.\r\n\r\nTVA management and employees will be responsible for maintaining compliance with environmental requirements\r\nand striving for environmental excellence in performing their respective duties. We will assure environmental\r\nprotection and reduce risks to our employees and communities in which we operate through proper environmental\r\nreview of new developments and through safe technologies, operating procedures, and emergency preparedness. All\r\nactivities will be conducted in accordance with current environmental and health and safety regulatory requirements.\r\n\r\nII. Stationary Source and Regulated Substances Handled\r\n\r\nThe affected facility consists of an anhydrous ammonia storage facility including two 18,000 gallon storage tanks with\r\nsupporting unloading equipment, liquid transfer pumps, piping to convey the liquid ammonia, vaporizers to convert\r\nammonia from a liquid to a vapor, an ammonia vapor transport line, and a gas dilution and injection system to inject\r\nammonia into a selective catalytic reduction emission control system.\r\n\r\nThere is only one regulated substance at the facility - anhydrous ammonia. With two 18,000 gallon storage tanks,\r\nthe maximum amount of anhydrous ammonia in the storage faci"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036244,
      "SummaryText": "lity at any time is 162,000 pounds and the maximum\r\namount contained in the largest single vessel is 81,000 pounds.\r\n\r\nIll. Summary of Worst Case and Alternative Release Scenarios\r\n\r\nThe Worst Case Release Scenario and the Alternative Release Scenario(s), including administrative controls and\r\nmitigation measures to limit the distances to the end point for each reported scenario, were developed. To perform\r\nthe required offsite consequence analysis for the facility, the very conservative EPA RMP'Comp model was used.\r\n\r\nThe worst case release scenario involves the complete rupture of one 18,000 gallon storage tank. A maximum\r\nrelease of 81,000 pounds of anhydrous ammonia over a 10 minute period was considered. The released quantity has\r\nnot been limited by a system of administrative controls. Under worst case meteorological conditions of Class F\r\nstability and 1.5 m/s wind speed, the ammonia vapor would have offsite end point concentrations impacting populated\r\nareas.\r\n\r\nThe alternative case release scenario with the worst credible case offsite impact involves the release of 78,000\r\npounds of ammonia vapor loss from the failure of a pressure safety valve to reseat or from ruptured vapor piping.\r\nUnder typical meteorological conditions of Class D stability and 3 m/s wind speed, the ammonia vapor would have\r\noffsite toxic end point levels.\r\n\r\nIV. Description of Release Prevention Program\r\n\r\nProcess Safety Information - TVA maintains documentation of safety information concerning chemical hazards,\r\noperating parameters, and equipment designs and specifications associated with the process.\r\n\r\nProcess Hazard Analysis - TVA conducted comprehensive analyses of the process to ensure that hazards\r\nassociated with the process were identified and controlled effectively. The Hazardous and Operability Study\r\n(HAZOP) analysis methodology was used to assess the potential hazards of the process. The study was conducted\r\nby a team of qualified personnel with expertise in engineering,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036244,
      "SummaryText": "control logics, and process operations. Findings\r\nresulting from the analysis were addressed. The HAZOP analysis was conducted on July 25-27, 2001 and a prestartup\r\nHAZOP review was conducted on March 20-22, 2002.\r\n\r\nOperating Procedures - TVA has established and maintained procedures for safely conducting activities within our\r\ncovered process. The procedures cover various operational phases including initial startup, normal startup, normal\r\nshutdown, temporary operations, emergency shutdown, emergency operations, and startup following a turnaround or\r\nemergency shutdown. The information is readily available to operators and maintenance personnel involved in the\r\nprocess and the information is periodically reviewed to assure it is current.\r\n\r\nTraining - TVA's training program is comprehensive and is implemented to ensure that all personnel involved in the\r\noperation and maintenance of the process are properly trained in the safe operation and maintenance of the process\r\nand knowledgeable of the hazards of the process. The personnel are provided with refresher training at least every\r\nthree years or more often if needed.\r\n\r\nMechanical Integrity - TVA conducts well documented maintenance checks on process equipment to ensure safe\r\nand reliable operations. All process equipment routinely checked includes storage tanks and pressure vessels,\r\npiping systems, relief and venting systems, controls and pumps, emergency shutdown systems, and monitoring\r\ndevices. All maintenance operations conducted on the covered process are performed by qualified personnel who\r\nhave had proper training. Equipment deficiencies identified by the maintenance checks are corrected promptly and\r\nsafely.\r\n\r\nManagement of Change - TVA maintains written procedures to manage changes in the process equipment,\r\nprocedures and monitoring technology which assures that any changes meet regulatory requirements. Personnel\r\nwhose job tasks are affected by a modification in the process are promptly apprised"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036244,
      "SummaryText": "of the modification and provided\r\ntraining to address the modification.\r\n\r\nPre-Startup Review -A pre-startup safety review was conducted prior to the startup of the new process. Established\r\npre-startup safety review procedures assured that construction and installation of covered process equipment,\r\noperating and maintenance procedures are suitable for a safe startup prior to placing equipment into operation and all\r\nelements of the RMP are in place.\r\n\r\nCompliance Audits - TVA conducts environmental and safety audits on a regular basis and will determine whether\r\nthe provisions set out under the RMP rule are being implemented. The audits will be conducted at least every 3 years\r\nand any corrective actions required as a result of the audits will be promptly and safely implemented.\r\n\r\nIncident Investigations - Any incident that results in or could reasonably result in a significant release of a regulated substance is promptly investigated. Procedures ensure that investigations are undertaken to identify the\r\ncircumstances leading to the incident as well as any corrective actions to prevent the situation surrounding the\r\nrelease does not reoccur. All reports will be retained for at least 5 years.\r\n\r\nEmployee Participation - TVA believes in a team approach to process safety management and accident prevention.\r\nEmployees are encouraged to express their views concerning accident prevention issues and to recommend\r\nimprovements. In additibn, our employees have access to alrinformation developed through implementation of the\r\nRMP, including information resulting from process hazard analyses.\r\n\r\nContractors - TVA develops partnerships with contractors to effectively conduct business and operate generation\r\nfacilities, especially in maintenance and construction activities. Prior to selecting a contractor, TVA evaluates the\r\nqualifications of the contractor including their safety performance. Procedures are in place to ensure that contractors\r\nare properly informed of known p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036244,
      "SummaryText": "otential hazards related to the contractor's work and the process involved, including\r\nthe emergency response procedures in the event of an accidental release of a regulated substance.\r\n\r\nV. Five Year Accident History\r\n\r\nThere have been no accidents and thus the facility does not have an accident history.\r\n\r\nVI. Emergency Response Plan\r\n\r\nTVA has an emergency response plan in place to respond to accidental releases of hazardous materials. The plan\r\nincludes all aspects of emergency response plan requirements including adequate first aid and medical treatment,\r\nsafe shelter-in-place locations, notification of local emergency response agencies and the public, and qualified\r\ncontractor responder for post-incident decontamination of affected areas. The plan will be promptly updated to\r\naddress any pertinent changes within the process that would require a modification of the emergency response plan.\r\nIn addition, periodic emergency response drills are conducted to keep employees, contractors, and local responders\r\nfamiliar with the plan.\r\n\r\nVII. Five Year Update\r\n\r\nIn accordance with the requirements of 40 CFR Part 68, Process Hazard Analyses for all TVA facilities are reviewed and updated prior to the five-year anniversary of the original submission of the RMPs.  An audit was conducted August 6-8, 2013 for the purpose of revalidating the Widows Creek Fossil Plant RMP.  Many of the dates provided in this submittal, referring to the most recent review of the various parts of the RMP program, coincide with the audit."
    }
  ]
}