{
  "FacilityID": 1000082330,
  "FacilityName": "REXtac APAO Production Plant",
  "FacilityStr1": "2501 S. Grandview Ave",
  "FacilityStr2": null,
  "FacilityCity": "Odessa",
  "FacilityState": "TX",
  "FacilityZipCode": "79766",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48135",
  "LEPC": "Ector County LEPC",
  "FacilityLatDecDegs": "31.826070",
  "FacilityLongDecDegs": "-102.324782",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.rextac.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "REXtac LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "REXtac LLC",
  "OperatorStr1": "PO Box 4148",
  "OperatorStr2": null,
  "OperatorCity": "Odessa",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79760",
  "OperatorZipCodeExt": "4148",
  "FTE": 40,
  "OtherEPAFacilityID": "79760LPSPR2400S",
  "EPAFacilityID": "100000209491",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-11-07 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-09-11 17:09:15",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-09-04 15:29:45",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-09-04 15:29:45",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-09-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 31.82607,
  "FRS_Long": -102.324782,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000102840,
      "AltID": "APAO",
      "FacilityID": 1000082330,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000128804,
          "ProcessID": 1000102840,
          "ChemicalID": 95,
          "Quantity": 420000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000128805,
          "ProcessID": 1000102840,
          "ChemicalID": 129,
          "Quantity": 6023000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000128806,
          "ProcessID": 1000102840,
          "ChemicalID": 154,
          "Quantity": 2250000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000104112,
          "ProcessID": 1000102840,
          "NAICSCode": "32511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000086959,
              "Process_NAICS_ID": 1000104112,
              "SafetyReviewDate": "2018-11-27 00:00:00",
              "PHA_Date": "2019-08-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-08-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Butene unloading system was added to allow unloading butene from railcars",
              "OpProceduresReviewDate": "2019-07-16 00:00:00",
              "TrainingReviewDate": "2019-06-05 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-07-25 00:00:00",
              "EquipmentInspectionDate": "2019-08-15 00:00:00",
              "EquipmentTested": "AT-2500 BTU COSA Analyzer",
              "ChangeMgmtDate": "2019-05-15 00:00:00",
              "ChangeMgmtReviewDate": "2019-05-15 00:00:00",
              "PreStartupReviewDate": "2019-08-09 00:00:00",
              "ComplianceAuditDate": "2019-07-03 00:00:00",
              "AuditCompletionDate": "2020-03-04 00:00:00",
              "IncidentInvestigationDate": "2019-08-27 00:00:00",
              "InvestigationChangeDate": "2019-08-30 00:00:00",
              "ParticipationPlansReviewDate": "2019-06-11 00:00:00",
              "HotWorkPermitReviewDate": "2019-05-15 00:00:00",
              "ContractorSafetyReviewDate": "2019-08-20 00:00:00",
              "ContractorSafetyEvalDate": "2019-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000108420,
                  "PreventionProgram3ID": 1000086959,
                  "ProcessChemicalID": 1000128804
                },
                {
                  "PrimaryKey": 1000108421,
                  "PreventionProgram3ID": 1000086959,
                  "ProcessChemicalID": 1000128805
                },
                {
                  "PrimaryKey": 1000108422,
                  "PreventionProgram3ID": 1000086959,
                  "ProcessChemicalID": 1000128806
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000082330,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-05-15 00:00:00",
    "ERTrainingDate": "2019-07-17 00:00:00",
    "CoordinatingAgencyName": "Odessa Fire Department",
    "CoordinatingAgencyPhone": "4322570502",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082330,
      "SummaryText": "ch as isopropyl alcohol (IPA).  In the unlikely event that this is not sufficient, the reactor contents can be safely vented to the flare through a pressure safety valve (PSV) d for a runaway reaction. \r\n\r\nSeparation of Un-reacted Monomers\r\nAPAO, along with un-reacted propylene and co-monomer(s), exit the reactor and flow into the Flash Tank (V-1145) where the monomer concentration in the product is reduced to low levels and the APAO product is heated from Reactor temperature to about 375ºF so that it can be easily pumped.  High pressure steam is used for heating.\r\nNext, the Flash Tank vent gas is cooled in order to condense and remove light ends, i.e., very low molecular weight APAO.  The light ends are collected in a storage tank and shipped offsite for disposal. \r\nDuring the production of most grades, the Flash Tank vent gas goes first to the Butene Recovery Area where the propylene and butene are separated in the Butene Column (V-1944).  The overhead of the Butene Column, primarily propylene, goes to the Recycle Propylene Unit where makeup propylene will be added and the combined stream returned to the Reactor. \r\nThe Butene Column bottoms goes to the Recycle Butene Storage Tank (V-2231) where makeup butene is added.  The combined butene stream is then returned to the Reactor. \r\nWhen producing some grades, the Flash Tank vent gas may go the Recycle Propylene Unit where makeup propylene is added and the combined stream is returned to the Reactor.\r\n\r\nCatalyst Deactivation\r\nThe use of a high activity catalyst eliminates the need for removal and disposal of catalyst residues.  However, to prevent further polymerization and undesirable interactions with the additives, the catalyst must be deactivated.  This is accomplished by thoroughly mixing a small amount of water into the APAO. \r\n\r\nAddition of Additives\r\nAdditives such as antioxidants are added to the APAO in Batch Tanks (V-1435 A/B).   The additives are unloaded from bags or drums into the feed tank of a dense"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000082330,
      "SummaryText": "phase conveying system.  Nitrogen is used to transport the additives into the Batch Tanks.  A bag filter reduces particulate emissions when the additives are loaded into the conveying system feed tank.  The Batch Tanks are agitated in order to assure good dispersion of the additives. \r\nThe Batch Tanks operate at a lower pressure than the Flash Tank, so further devolatilization of the APAO occurs.  The Batch Tank vent gas flow is small and is directed to the flare.  A small amount of ammonia is added to the Batch Tank vent gas in order to neutralize the small amount of hydrochloric acid (HCl) that is produced when the catalyst is deactivated. \r\n\r\nProduct Storage\r\nAPAO is pumped from the Batch Tanks to the Product Storage Tanks where it is stored under a nitrogen blanket.  From here, the APAO is pumped into heated trailers or railcars. \r\nThe vents from the Product Storage Tanks go to the low pressure flare.  As before, a small amount of ammonia is added to the vent gas for neutralization. \r\n\r\nPackaging\r\nSome of the APAO product is transported in heated trailers to another REXtac site where it is pelletized or put into drums.  The APAO may also be blended with other components to enhance its properties. \r\n\r\nC.\tThe worst-case release scenarios and the alternative release scenarios\r\nThere are three chemicals located at REXtac that meet or exceed the threshold quantity as defined in RMP: propylene, ethylene and 1-butene.  All three chemicals are flammable.  Therefore, only one worst case and one alternate case scenario was evaluated.  The largest quantity of flammable hydrocarbon is in the Propylene Storage Bullet.  The Propylene Storage Bullet releases were modeled using RMP Comp for both the worst case and alternative release scenarios.\r\n\r\nPropylene\r\nThe worst case scenario for propylene involves a release of 264,000 lb from a storage vessel resulting in a vapor cloud explosion.  RMP Comp was used to predict a distance of 0.5 miles to the 1 psi endpoint.  No credit was"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000082330,
      "SummaryText": "taken for passive mitigation.\r\nThe alternative release scenario for propylene involves a leak from the storage vessel.  A release rate of 18,480 lb/min over 10 minutes was used to represent the evaporation of the liquid propylene.  RMP Comp was used to predict a distance of 0.3 miles to the 1 psi endpoint.  No credit was taken for active mitigation (e.g., foam suppression), although it is available.  \r\n\r\n\r\nD.\tGeneral accidental release prevention program and chemical-specific prevention steps:\r\nThe REXtac Odessa Facility is a PSM-covered facility and, as such, it has a viable process safety program.  \r\nProcess Hazards Analyses were conducted on the entire APAO process.  Major hazards identified include fire, explosion, toxic chemical releases, over-pressurization, overfilling, and equipment failure.  Process controls in place include relief valves, emergency and automatic shutdowns, grounding, interlocks and procedures and training.  Additionally, liquids are contained within dikes with appropriate drainage.  Fire protection is also provided for all areas of the APAO process.  \r\nTraining is conducted continuously and includes on-the-job mentoring and standard operating procedure (SOP) reviews.  Testing and demonstration are used as means to verify understanding.  SOPs are kept evergreen through a continuous review and revision process that is managed by designated individuals in each process unit.\r\nThe site has both predictive and preventative maintenance programs which include inspections, tests and routine maintenance activities that are performed by trained and competent employees and contractors.  Inspection and testing frequencies are prescribed by manufacturers and industry standards.  There is a system in place to correct identified deficiencies.  Additionally, there is a quality assurance program in place which reviews individual workmanship as well as new and spare parts.\r\nChange is managed through a management-of-change (MOC) process.  The MOC process outl"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000082330,
      "SummaryText": "ines approval responsibilities and requires hazard evaluations prior to the implementation of any changes affecting a covered process.  Affected personnel and contractors are trained in the changes before they startup.  Additionally, changes undergo a Pre-Startup Safety Review (PSSR) conducted by appropriate employees, as spelled out in the facility's PSSR procedure. The facility conducted a compliance audit per PSM and RMP in November 2013.\r\nThe facility has an active accident / incident prevention program.  Each incident and near miss associated with the process area is evaluated and, if it meets pre-defined criteria, a team-based investigation is performed.  The investigation's purpose is to identify root and contributing causes and to make recommendations to prevent future recurrence.  The facility's safety manager tracks investigation action items through until closure.\r\nEmployees are active in all aspects of process safety, including safe work permitting, process hazard analyses, incident investigations, mechanical integrity and management of change.  Additionally, contractors are involved in many aspects of the programs.  \r\n \r\nE.\tFive-year accident history:\r\nThe REXtac APAO Facility has not had any release that reached beyond the property line or resulted in deaths on site, injuries or significant property damage on site, or any offsite deaths, injuries, evacuations, sheltering-in-place, property damage or environmental damage within the past five years.  \r\n\r\nF.\tEmergency response program:\r\nThe facility maintains an Emergency Response Plan (ERP) that defines the steps the facility and each employee should take during an accidental release of a regulated substance.  The plan includes both evacuation and protective action procedures for employees not directly involved in the response, and actions to be taken by employees responsible for responding to and mitigating the release.  All employees are trained in the applicable emergency response procedures.  Drills"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000082330,
      "SummaryText": "and exercises are routinely conducted to test the facility's plans and revise the plans if necessary. \r\nThe emergency response plan includes procedures for notifying facility personnel, including emergency response personnel, the Local Emergency Planning Committee (LEPC) and the Odessa Fire Department.  The most recent review of the ERP was done on February 21, 2012. \r\n \r\nG.\tPlanned changes to improve safety:\r\nSafety has continuously improved each year.  Budget is set aside to ensure maintenance, testing and inspection are performed as specified and deficiencies, if noted, are corrected immediately.  Examples of continuous improvement at the REXtac APAO Facility include:\r\n*\tCreating additional Safety Procedures and Training;\r\n*\tImprovements to the mechanical integrity program (MIT) that involved hiring additional personnel in June 2019 to help manage \r\n        the program.\r\n*       Xylene was eliminated as a way to wash the Reactor and associated piping and exchangers.  Butene is being used instead.\r\n*       Installed landings on Storage tanks for safer access on Product Storage tanks.\r\n*       A dual Seal Oil system was installed for the reactor and other pieces of equipment for better and safer control of the \r\n        process.\r\n*       Improvements made to the Emergency broadcast system.\r\n*       Defibrillators installed in various buildings."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082330,
      "SummaryText": "A.      At the REXtac Odessa Facility, there are no toxic chemicals above the threshold quantity covered by the EPA's RMP regulation (40 CFR Part 68).  There are three flammable chemicals above the threshold quantity.  They are: propylene, ethylene and 1-butene.  It is vital to observe certain safety precautions in handling these chemicals to prevent unnecessary human exposure, to reduce the threat to personal health and safety of personnel, contractors, the community and the environment.  It is REXtac's policy to adhere to all Federal and State rules and regulations.  Safety depends on the manner in which these chemicals are handled combined with the safety devices inherent in the design of the facility, as well as the safe handling procedures that are used to train our personnel.\r\nThe facility maintains an Emergency Response Plan (ERP) that defines the steps the facility and each employee should take during an accidental release of a regulated substance.  The Plan includes both evacuation and protective action procedures for employees not directly involved in the response, and actions to be taken by employees responsible for responding to and mitigating the release.  All employees are trained in the applicable emergency response procedures.  \r\nThe ERP also includes procedures for notifying facility personnel, including emergency response personnel, the Local Emergency Planning Committee (LEPC) and the Odessa Fire Department.  \r\n\r\nB.\tThe REXtac Odessa Facility receives, handles and stores flammable hydrocarbon as feedstock for the production of amorphous polyalphaolefins (APAO).  End users include adhesives and sealants.  The REXtac Odessa Facility has large volumes of flammable substances, such as propylene, ethylene and 1-butene.  The facility uses small volumes of toxic material such as ammonia and titanium tetrachloride.  However, the quantities are below the RMP threshold limit and have not been considered in this RMP.\r\nA description of the primary process sec"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082330,
      "SummaryText": "tions is provided below:\r\n\r\nOverview\r\nThe REXtac APAO process is a liquid pool process (polymerization in a pool of liquid propylene and sometimes butene) using a high activity catalyst.  The APAO product is highly amorphous and contains very low levels of catalyst residue.  Deactivation of the catalyst is all that is required.  \r\nThe ISBL portion of the REXtac APAO process is divided into the following sections:\r\n¿Catalyst Preparation\r\n¿Polymerization\r\n¿Separation of Un-reacted Monomers\r\n¿Catalyst Deactivation\r\n¿Additive Addition\r\n¿Product Storage\r\n¿Packaging\r\n\r\nThe following is a description of each section:\r\n\r\nCatalyst Preparation\r\nIn the catalyst preparation area, the catalyst components are mixed and stored in preparation for delivery to the reactor.  The catalyst components include a high activity Zeigler-Natta catalyst dispersed in mineral oil, an aluminum alkyl, and (for some grades) an electron donor diluted in heptane.  The catalyst components are delivered to the reactor through metering equipment that precisely controls their flow. \r\n\r\nPolymerization\r\nPolymerization takes place in a liquid pool reactor (R-1130).  Propylene, co-monomers such as ethylene and butene, catalyst components, and hydrogen for viscosity control are continuously fed to the reactor while the APAO product is continuously withdrawn.  An antifoam agent diluted in heptane is added to the reactor to prevent excessive foaming.\r\nThe reactor operates at a pressure ranging from 250 to 550 psig, and a temperature ranging from 135 to 185ºF, depending on the grade of APAO.  The conversion of the monomer(s) is high, equaling or exceeding that for isotactic polypropylene.\r\nThe heat of reaction is removed by using cooling water to condense the propylene and butene vapors boiled up from the liquid pool.  In the event of a failure of the cooling water supply or some other emergency, the reaction can be stopped quickly from the control room by injecting a small amount of a strong catalyst poison, su"
    }
  ]
}