{
  "FacilityID": 1000011344,
  "FacilityName": "Montco Research Products, Inc.",
  "FacilityStr1": "209 Janice Drive",
  "FacilityStr2": "P.O. Box 235",
  "FacilityCity": "Hollister",
  "FacilityState": "FL",
  "FacilityZipCode": "32147",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12107",
  "LEPC": "Northeast Florida RPC",
  "FacilityLatDecDegs": "29.670742",
  "FacilityLongDecDegs": "-081.79137",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": "www.montcoresearch.com",
  "FacilityEmailAddress": "Montco@gbso.net",
  "FacilityDUNS": 61897054,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Montco Research Products, Inc",
  "OperatorStr1": "209 Janice Drive",
  "OperatorStr2": "P.O. Box 235",
  "OperatorCity": "Hollister",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32147",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000168953",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1070037",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "FL DEM with Putnam EMR",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-10-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-10-27 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-10-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-10-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 29.67025,
  "FRS_Long": -81.791833,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013522,
      "AltID": "Reaction/Distillation",
      "FacilityID": 1000011344,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015526,
          "ProcessID": 1000013522,
          "ChemicalID": 54,
          "Quantity": 42000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000013882,
          "ProcessID": 1000013522,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000011169,
              "Process_NAICS_ID": 1000013882,
              "SafetyReviewDate": "2009-07-07 00:00:00",
              "PHA_Date": "2009-07-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-10-07 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-09-09 00:00:00",
              "TrainingReviewDate": "2009-07-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Haz Wopper",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-09-09 00:00:00",
              "EquipmentInspectionDate": "2009-08-15 00:00:00",
              "EquipmentTested": "Reactors and HCL lines",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-07-07 00:00:00",
              "PreStartupReviewDate": "2004-04-21 00:00:00",
              "ComplianceAuditDate": "2007-05-22 00:00:00",
              "AuditCompletionDate": "2009-09-09 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-07-07 00:00:00",
              "HotWorkPermitReviewDate": "2009-09-09 00:00:00",
              "ContractorSafetyReviewDate": "2009-04-01 00:00:00",
              "ContractorSafetyEvalDate": "2009-09-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000012989,
                  "PreventionProgram3ID": 1000011169,
                  "ProcessChemicalID": 1000015526
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000011344,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-07-07 00:00:00",
    "ERTrainingDate": "2009-06-11 00:00:00",
    "CoordinatingAgencyName": "Palatka Fire Department",
    "CoordinatingAgencyPhone": "3863287070",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011344,
      "SummaryText": "MONTCO RESEARCH PRODUCTS, INC.\nEPA ID # 100000168953\nRISK MANAGEMENT PROGRAM RE-SUBMITTAL\nEXECUTIVE SUMMARY\n\n1.\tEXECUTIVE SUMMARY INTRODUCTION 68.155                                                                        \nMontco Research Products, Inc. (Montco) operates its plant at 209 Janice Drive, P.O. Box 235, Hollister, FL  32147.  The plant has quantities of a regulated hazardous chemical, anhydrous hydrogen chloride (CAS # 7647-01-0), above the 6,000 pound EPA and OSHA threshold.  Montco has a unified Risk Management Program (RMP) as it is also subject to OSHAÂ¿s Process Safety Management (PSM).  \n1.1.\tACCIDENTAL RELEASE PREVENTION/EMERGENCY RESPONSE POLICIES     (A)\nMontco Research Products, Inc. prevents accidental releases through on the job training of operating personnel and ongoing inspection and maintenance of the hydrogen chloride gas injection system.  The facility maintains an ongoing emergency response program that prepares for safe evacuation and timely response by trained personnel.  The plant program complies with all applicable procedures of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) 40 CFR-68 Prevention Program under the Clean Air Act Amendments of 1990.\n1.2.\tMANAGEMENT SYSTEM (A) (1)\nMontco has a management system in place which is lead by the Plant Manager.  The Plant Manager oversees the implementation and on-going use of the RMP elements.  This program, along with other plant-specific policies, eliminates and/or reduces the likelihood of a hazardous chemical release at the plant.  An organizational chart defining the lines of authority and responsible staff is included in the plants RMP Process Safety Information.\n1.3.\tPREVENTION PROGRAM LEVEL 3 (A) (2)\nMontco maintains policies, procedures and systems as part of their prevention program. The program addresses each of the EPA Program Level 3-listed 12 elements, plus RMP elements needed to implement the program, and the like elements in place in the plantsÂ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011344,
      "SummaryText": "¿ OSHA PSM program.  These are maintained by the Montco Plant Document Management System (DMS).\n1.4.\tSTATIONARY SOURCE AND REGULATED SUBSTANCE HANDLED AT MONTCO RESEARCH PRODUCTS INC., FLORIDA SITE (B)  \nMontco employs 10 full-time and one part time employee engaged in plant operations.  Hydrogen chloride is a raw ingredient used as part of the chemical manufacturing process.\n1.5.\tSITE DESCRIPTION (B) (1)\t\nThe site is owned and operated by Montco and is managed Montco staff.  The site is located at 209 Janice Drive, P.O. Box 235, Hollister, Putnam County, Florida.   The 100 acre site is located at the end of Janice Drive.\nThe Plant includes a separate anhydrous hydrogen chloride storage area.\nThe boundaries of the hydrogen chloride system subject to the RMP, and like PSM, regulation include the Bulk Hydrogen Chloride Storage, Feed Control system associated vent makeup, exhaust systems, hydrogen chloride scrubber and hydrogen chloride injection cabinets at the injection point of the product reactor/distillation units.  These are detailed in the Process and Instrument Drawings (P&ID) which are part of the plant Process Safety Information (PSI).  All drawings are maintained in the plants RMP Process Safety Information.\n1.6.\tMONTCO RESEARCH PRODUCTS AND ANHYDROUS HYDROGEN CHLORIDE\nMontco uses hydrogen chloride gas in a reaction/distillation process in order to produce 1-Chloromethylnapthalene and Ethyl Benzyl Chloride.  A maximum quantity of 42,000 lbs. of anhydrous hydrogen chloride is stored on site in two compressed gas tube trailers.  Each trailer contains seven tubes with a capacity of 3,000 pounds of hydrogen chloride.  A Risk Management Plan has been developed as required and is maintained in order to reduce the possibility of an accidental release of hydrogen chloride gas from the system.\n2.\tHAZARD ASSESSMENT\nA hazard assessment was performed to determine the effects a release would have on the public. For hydrogen chloride, the distance to a set endpoint concen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011344,
      "SummaryText": "tration of the gas would travel was determined.  In addition, an estimate of the population that could be affected by a release of hydrogen chloride was determined, and sensitive receptors such as residences were identified. The hazard assessment considers two release scenarios-a worst case and an alternative case and also compiles the five-year accident history for the hydrogen chloride system.\nTwo offsite consequence analyses were conducted which include two hydrogen chloride release scenarios.  The first is a Â¿worst case releaseÂ¿.  The second is a more probable Â¿alternative release scenarioÂ¿.  The first scenario is defined by EPA, which states that Â¿the operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutesÂ¿ due to an unspecified failure.  The alternative scenario is defined as Â¿more likely to occur than the worst-case scenarioÂ¿.\nAtmospheric dispersion modeling was performed to determine the distance traveled by the hydrogen chloride released before its concentration decreases to the Â¿toxic endpoint.Â¿  The EPA specified endpoint for hydrogen chloride is 0.030 mg/l.  The endpoint is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the Â¿maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individualÂ¿s ability to take protective action.Â¿  The residential population within a circle with a radius corresponding to the toxic endpoint distance was defined, Â¿to estimate the population potentially affected.Â¿\n2.1.\tWORST CASE   (C) (1)\nAtmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions and EPAÂ¿s RMP Comp Program.  A total of 3,000 pounds are released over 10 minutes yielding a 300 pound per mi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011344,
      "SummaryText": "nute release rate.  Results demonstrate a distance to the toxic endpoint of 2.4 miles containing 18.1 square miles of area assuming an urban topography without an enclosure.  The residential population that could potentially be affected by the release is 636 individuals based on the U. S. Census 2000 demographic data.  There are 242 residences and no other receptors included in that release area.\n2.2.\tALTERNATIVE CASE   (C) (2)\nThe alternative release scenario involves the failure of the regulator of the pressure system or the wip on pipes/valves connected to one of the one-ton containers.  This failure was defined during the recent Process Hazards Analysis.  This failure is equal to creating a 0.03 square inch hole in the wip tube, a pipe, or even the container itself.  Modeling using the EPA/RMP Comp and EPAÂ¿s water guidance demonstrated the rate of hydrogen chloride release is 100.0 lb. /minutes for a period of 30 minutes releasing a total of 3,000 pounds of hydrogen chloride.  The toxic endpoint distances determined is 0.50 miles containing 0.80 square miles and is in the process safety information.  The residential population that would be impacted by this release is 299 individuals and is recorded in the process safety information.  Receptors in this area were identified as 112 local residences adjacent to the plant.\n3.\tACCIDENTAL RELEASE PREVENTION PROGRAM (D)\nMontcoÂ¿s accidental release prevention program is based on OSHAÂ¿s PSM program and EPAÂ¿s RMP Level 3 prevention program.  The PSM program has been in place and effectively used for many years.  It is part of the plants operating culture.  There are two parts to the program.  The first is the general overall plant-wide program and the site-specific program.  The second is the hydrogen chloride specific actions within the site program.  This is coordinated with the Palatka Fire Rescue/HazMat Team and Putnam CountyÂ¿s Fire/Rescue Department and the Regional LEPC.\n3.1.\tGENERAL ACCIDENTAL RELEASE PREVENTI"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000011344,
      "SummaryText": "sponse Program book. \nSpecific training in the properties, hazards, handling requirements, and leak repair for hydrogen chloride is conducted annually. \nFinally, the details of both facility and equipment design are key to the safe operations of the hydrogen chloride system.\n3.2.3.\tFacility Design\nThe hydrogen chloride storage area is located in an open area northeast of the plant operating area. The plant and support equipment of the hydrogen chloride storage area and feed control meet and exceed design codes standards and good engineering practices.  The storage and control area has a natural ventilation system.  The reaction vent scrubber is capable of neutralizing over 3,000 pounds of hydrogen chloride.  This vents to a diesel column vent scrubber.\n3.2.4.\tEquipment Design\nThere is one type of hydrogen chloride pipe system, high pressure.  The high pressure hydrogen chloride piping system is made of hydrogen chloride compatible stainless steel pipes, stainless steel tubes or equipment.  These materials include compatible non-metallic compound (not corroded by hydrogen chloride) rated to 1,000 psig.  The maximum pressure of the hydrogen chloride in the high pressure system is 650 psig. There are seven 3,000 pound tube containers on each high trailer.  One tube is in service and the other six are on standby. \nThe system has a nitrogen purge system for both pressure testing and clearing the hydrogen chloride levels.\n \n4.\tFIVE YEAR ACCIDENT HISTORY (E)\nThe plant has been hydrogen chloride reportable and release free since 1992 to the present, 17 years.  There have been no accidental releases of anhydrous hydrogen chloride at Montco Research Products in the last five years.\n5.\tEMERGENCY RESPONSE PROGRAM (F)\nEmergency response procedures are contained in the Plant Emergency Response Policy that is coordinated with the City of Palatka, Putnam County Contingency Plan (Emergency Response Plan).  The plan includes an emergency response Â¿decision treeÂ¿ and a notification"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000011344,
      "SummaryText": "plan.  Emergency response drills and drill evacuations are conducted by the operating department.  Emergency operation and response procedures are also reviewed annually.\nThe emergency response program (contingency plan) is coordinated (reviewed by) with the plant Safety Committee.  The Plant coordinates with local Putnam County Emergency Response Planning Committee (LEPC) and the City of Palatka HazMat Team.  All are located in Putnam County, Florida.  Copies of the program are given to key local agencies including: fire, medical, rescue, management, and police departments.  Besides the specific emergency response program, key elements of the prevention programs are incorporated in the operating culture of the plant.\nMontco maintains an ongoing emergency response program in order to efficiently notify and evacuate employees, notify potential residential receptors in the community and initiate state/local emergency response agencies.  The program includes ongoing safety training for employees who respond to releases or potential releases.  The program includes written procedures for proper first aid and emergency medical treatment to treat human exposures; general and specific responsibilities of the site emergency coordinator and site personnel; incident reporting and emergency equipment on site.  The facility emergency response plan is coordinated with the local fire department as required by the Emergency Planning and Community Right to Know Act. \n6.\tPERSONNEL (F) (1)\nPersonnel are the key resource of the plantÂ¿s prevention program.  Plant employees make up the operators and emergency operations first responders.  The plant fosters a high level of involvement in every aspect of the hydrogen chloride system operations including participation in:\nÂ¿\tPSM/RMP safety teams, \nÂ¿\tDevelopment of the operation procedures, \nÂ¿\tHazard evaluations and \nÂ¿\tOn-going training of the operators and other involved staff.\nÂ¿\tProcess Hazards Analysis (PHA)\n7.\tCHANGES TO IMPROVE SAF"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000011344,
      "SummaryText": "ETY (G)\nChanges to improve safety (recommended actions) were identified in the internal audit and the PHA (HazOp) 2009, tour, and audit of the RMP program to meet requirements of the Risk Management Prevention Program.  These recommended actions have now been evaluated and implemented. An Audit was conducted to review the PSM and RMP program.  The key safety action items were completed.  See the Â¿UpdateÂ¿ Section 6 of the Audit Report.  Montco continually reviews implemented operating procedures for potential safety improvements for all of its operations.  Currently, the plant management team and process safety team are reviewing potential replacement of anhydrous hydrogen chloride with liquid hydrochloride acid to make the system even safer to prevent a release and minimize consequences in the event of a release."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011344,
      "SummaryText": "ON PROGRAM   (D) (1)\nPlant-wide, many elements of the prevention program are used for all operations.  An overview of the generally written programs is listed below:\nMontco has detailed process safety information on each of its operations. \nThe document maintenance system is integral to the management of change for all operations on site control.  \nTraining is the backbone of employee knowledge, job operations and is ongoing in each area.  Employee training in operations and maintenance emphasizes awareness of the hazardous and toxic properties of all chemicals used. Refresher training is conducted annually.\nMaintenance and preventive maintenance are used for all operations making mechanical integrity a part of each piece of equipment. \nIncident investigations of accidents and near-miss incidents ensure we learn from each event as well as correct the causes of the incident. \nEmployees participate in all aspects of the plant as listed below under emergency response. \nSafe work practices are used throughout the facility including:  1) Hot Work Permits, 2) Lock Out Tag Out Permits, 3) Vessel Entry Permits, 4) Site Security, and 5) Breaking Into Chemical Lines. \nContractors must meet The MontcoÂ¿s high safety and technical standards as part of selection and ongoing evaluations.  Plus, Montco demands training of contractors to our standards. \n3.2.\tHYDROGEN CHLORIDESPECIFIC RESPONSE PROGRAM (D) (2)\n3.2.1.\tHydrogen Chloride-Specific Operating Safety Information\nChemical-specific prevention features of the plant include: the policies and procedures listed above and those of the hydrogen chloride specific program.\n3.2.2.\tSpecific procedures for the management of the hydrogen chloride process. \nCompletion of a Pre-startup Safety Review prior to startup of the modified hydrogen chloride system.   \nSpecific emergency response procedures for hydrogen chloride releases as outlined below under both operating procedures and in the emergency response procedures. See the Emergency Re"
    }
  ]
}