{
  "FacilityID": 1000105169,
  "FacilityName": "Mann Packing Salinas",
  "FacilityStr1": "1230 Hansen Street",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.6573736",
  "FacilityLongDecDegs": "-121.626624",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.veggiesmadeeasy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Del Monte Fresh Produce Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Mann Packing Company",
  "OperatorStr1": "49 Katherine St",
  "OperatorStr2": null,
  "OperatorCity": "Gonzales",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93926",
  "OperatorZipCodeExt": null,
  "FTE": 62,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000250881",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-10-29 00:00:00",
  "SafetyInspectionBy": "Monterey County Env Health Dep (CUPA)",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-05-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-05-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-05-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-05-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000131304,
      "AltID": "Remote Plant Ammonia Refr",
      "FacilityID": 1000105169,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000164631,
          "ProcessID": 1000131304,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000132733,
          "ProcessID": 1000131304,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000113141,
              "Process_NAICS_ID": 1000132733,
              "SafetyReviewDate": "2022-10-19 00:00:00",
              "PHA_Date": "2021-06-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-07-03 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Operator error, no flow, lack of maintenance, design deficiency, physical damage & vandalism/terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Water Diffusion Tank",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Water Diffusion Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Safety Patrol",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Ice maker trailer addition",
              "OpProceduresReviewDate": "2023-05-04 00:00:00",
              "TrainingReviewDate": "2023-05-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Tailgates",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-05-04 00:00:00",
              "EquipmentInspectionDate": "2022-10-19 00:00:00",
              "EquipmentTested": "All refrigeration equipment",
              "ChangeMgmtDate": "2023-02-21 00:00:00",
              "ChangeMgmtReviewDate": "2023-05-04 00:00:00",
              "PreStartupReviewDate": "2023-04-24 00:00:00",
              "ComplianceAuditDate": "2021-09-21 00:00:00",
              "AuditCompletionDate": "2022-04-01 00:00:00",
              "IncidentInvestigationDate": "2013-06-25 00:00:00",
              "InvestigationChangeDate": "2013-06-25 00:00:00",
              "ParticipationPlansReviewDate": "2023-05-04 00:00:00",
              "HotWorkPermitReviewDate": "2023-05-04 00:00:00",
              "ContractorSafetyReviewDate": "2021-09-20 00:00:00",
              "ContractorSafetyEvalDate": "2023-05-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000142177,
                  "PreventionProgram3ID": 1000113141,
                  "ProcessChemicalID": 1000164631
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000105169,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-11-22 00:00:00",
    "ERTrainingDate": "2022-05-20 00:00:00",
    "CoordinatingAgencyName": "Monterey County Health Department",
    "CoordinatingAgencyPhone": "8317554971",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000105169,
      "SummaryText": "n deadlines are also recommended. \nAll refrigeration equipment is well maintained and operated in a safe manner by trained personnel. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation.\n\nNote: All references above may be found within the onsite facility RMP."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000105169,
      "SummaryText": "talled in all refrigerated rooms and the mechanical room. Personnel will automatically be notified if any detector exceeds its set point. Monitoring is done 24 hours per day. All relief valves at the facility are tied into ammonia diffusion tank to prevent high-pressure releases to ambient.\n\n4. Five-Year Accident History\n\nAccording to Mann Packing Company personnel, no accident occurred in the past five years that meets the five-year accident reporting criteria (deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage).\n\n5. Emergency Response Program\n\nIn event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures. The Safety Coordinator is responsible in coordinating emergency response and will be contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by the release. The Safety Coordinator will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if off-site evacuations are required. A description of the emergency response plan is included in Chapter 20 Appendix.\n\n6. Planned Changes to Improve Safety\n\nRecommended corrective actions to mitigate the potential for an accidental ammonia release are proposed on the tables located in Chapter 0.0 of the RMP. The table items are a result from recommendations made during the Process Hazard Analysis, a Code Compliance Review, and a Safety Inspection performed by a qualified person. Some corrective items in the recommendation table originate from multiple codes but are listed only once. Specific facility areas and systems categorize recommendations resulting from the Safety Inspection; some of which may repeat general Process Hazard Analysis and Code Compliance Review items. Based on the severity of the hazards identified, implementatio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000105169,
      "SummaryText": "ice maker trailer was brought to the facility. Initial construction and all additions met the intent of the codes and standards current at the time of construction.\nRemote Plant ammonia charge is approximately 20,000 lbs. \n\nA list of refrigeration equipment used at this facility along with the equipment layouts can be found in the refrigeration system drawings located in Chapter 8 Appendix. International Institute of Ammonia Refrigeration (IIAR) Ammonia Refrigeration Safety Inspection Checklists, located in Chapter 12 Appendix, describe equipment details.\n\nThe refrigeration system at this facility is single-stage vapor compression cycles. In general, the process chemistry for this systems is explained in Chapter 8. Anhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/ or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. Chapter 8 Appendix 8.4 contains Safety Data Sheets (SDS) for anhydrous ammonia.\n\n3. General Accidental Release Prevention Program\n\nMann Packing Company maintains a release prevention program to eliminate or minimize releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. Incident investigation program is in place to analyze releases for ways to prevent a similar future release.\n\nThe ammonia refrigeration system has specific safety procedures to prevent a release. Operators and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency response procedures in the event of an ammonia release. Ammonia detectors are ins"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000105169,
      "SummaryText": "nia detection system. Remote plant high side equipment is located outdoors and has no closed engine room. Portable systems are vacuum tube, refrigeration trailers and ice maker trailer. Fixed system of the remote plant is operational throughout the year, but the portable refrigeration trailers and the vacuum tubes are on site from April thru October each year. \nAll compressors have safety switches that would shut down the compressors upon detection of unsafe operating conditions. System has additional high- and low-pressure cutouts that shuts down the compressors and the pumps. All pressure vessels and compressors are protected against high-pressure situations by safety relief valves. There are ammonia detectors in the cold rooms for alarming personnel. There are assigned responders experienced with ammonia refrigeration that would respond to and determine specific actions for any incident.\nThe ammonia refrigeration system is used for cold storage, vacuum cooling, and ice generation. \nThe Remote System was started in 1994 and over the years, refrigeration has been supplied by various portable and fixed units, which vary in age but are well maintained and in good condition. In 2006, a cold room (Cold Room 2-Value Added) was added adjacent to Cold Rooms 4 and 5 containing six (6) new fan coils. Later, a high-pressure receiver and low-pressure recirculation package were installed and tied to the portable refrigeration trailers to support the vacuum tubes, Cold Rooms 4, 5, and 6, and Cold Room 2-Value Added. In 2011 and 2012, two (2) screw compressors, two (2) reciprocating compressors, and one (1) evaporative condenser were added to the trailer area as fixed equipment. In 2011, an additional cold room (Retail Warehouse) was completed containing five (5) new evaporative cooling coils and tied to the portable and fixed machinery equipment. In 2014, Cold Room 6 was renovated and expanded with the addition of seven (7) evaporators to refrigerate the new space. In 2023, the"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000105169,
      "SummaryText": "A. RMP EXECUTIVE SUMMARY COMPONENT\n[40 CFR 68.155/19 CCR 2745.3]\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nMann Packing Company conducts inspection procedures to review refrigeration equipment prior to startup and during operations. These procedures identify potential sources of release and equipment corrections required to prevent these releases. On-site personnel and certified refrigeration contractors review the equipment as required. Mann Packing is a Non-responding Facility. It will provide initial emergency response if it is only within its capabilities and on-site personnel properly trained. On-site personnel will make a preliminary assessment in the event of a release and will provide first response. First response is limited to emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an off-site release. No emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel. Local fire and police departments with mutual aid response will provide emergency response for a major release event. The refrigeration contractors would also be on-call to provide emergency response. Emergency response training will be conducted yearly for current employees and as required to for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\n\n2. Stationary Source and Regulated Substances Handled\n\nMann Packing Company uses anhydrous ammonia as a refrigerant in their operations. Chapter 8 Appendix show the facility location map, site plans and equipment layout. Mann Packing facility has one refrigeration system known as Remote Plant. \n\nRemote Plant is composed of both fixed and portable refrigeration equipment. Fixed equipment includes, screw and reciprocating compressors, evaporative condenser, evaporators, ammonia pumps, pressure vessels, diffusion tank and related valves, controls, piping, and ammo"
    }
  ]
}