{
  "FacilityID": 1000096543,
  "FacilityName": "Future Foam, Incorporated - Tupelo",
  "FacilityStr1": "1665 South Veterans Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Tupelo",
  "FacilityState": "MS",
  "FacilityZipCode": "38804",
  "Facility4DigitZipExt": "1767",
  "FacilityCountyFIPS": "28081",
  "LEPC": "Lee County LEPC",
  "FacilityLatDecDegs": "34.235944",
  "FacilityLongDecDegs": "-088.684556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 627990252,
  "ParentCompanyName": "Future Foam, Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 7261415,
  "Company2DUNS": null,
  "OperatorName": "Future Foam, Incorporated",
  "OperatorStr1": "1665 South Veterans Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Tupelo",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "38802",
  "OperatorZipCodeExt": "1767",
  "FTE": 60,
  "OtherEPAFacilityID": "MSD981030984",
  "EPAFacilityID": "100000038149",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "154000046",
  "SafetyInspectionDate": "2021-08-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-10-06 11:31:10",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-10-06 11:31:10",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-10-06 11:31:10",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-10-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.233511,
  "FRS_Long": -88.686922,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000119738,
      "AltID": "Foam Manufacturing",
      "FacilityID": 1000096543,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000149982,
          "ProcessID": 1000119738,
          "ChemicalID": 77,
          "Quantity": 5740000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000121111,
          "ProcessID": 1000119738,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000075092,
              "Process_NAICS_ID": 1000121111,
              "SafetyReviewDate": "2021-08-17 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "In-house and manufacturer's info",
              "FR_Comments": null,
              "HazardReviewDate": "2021-08-16 00:00:00",
              "ChangeCompletionDate": "2022-03-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Pressure Sensors",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Alarm System",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-08-17 00:00:00",
              "TrainingReviewDate": "2021-08-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Overall safety training session",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Oral question and answer demonstration",
              "MaintenanceReviewDate": "2021-08-17 00:00:00",
              "EquipmentInspectionDate": "2020-10-01 00:00:00",
              "EquipmentTested": "TDI TANK INSPECTION EVALUATION",
              "ComplianceAuditDate": "2021-08-17 00:00:00",
              "AuditCompletionDate": "2021-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000075820,
                  "PreventionProgram2ID": 1000075092,
                  "ProcessChemicalID": 1000149982
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000096543,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-09-29 00:00:00",
    "ERTrainingDate": "2021-09-10 00:00:00",
    "CoordinatingAgencyName": "Lee  County Emergency Planning Comm",
    "CoordinatingAgencyPhone": "6628419020",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000096543,
      "SummaryText": ".\r\n2. Procedures for the use of emergency response equipment and for its inspection.\r\n3. Training for all employees in relevant procedures; and\r\n4. Procedures to review and update, as appropriate, the emergency management plan to     \r\n Reflect changes at Future Foam and to ensure that employees are informed of changes.\r\n\r\nF. Planned Changes to Improve Safety:\r\nIn an attempt to insure a continual improvement in the facility worker protection and release prevention programs, training will be conducted at Future Foam every three years on this program.  This program requires the attendance of personnel whose job is related to the TDI system.  Additionally, audits will be performed as specified in the RMP plan, which requires Future Foam to assess areas of the RMP plan that may need to be changed or improved.\r\n\r\nG. Hazard Assessment:\r\nThe RMP requires Future Foam to evaluate the maximum potentially affected area for accidents involving TDI for a worst-case release scenario and an alternative scenario.\r\n\r\nFour (4) possible TDI processes were identified as having the largest potential impact should a spill occur: storage tanks, railcars, tanker trucks, and pumps/piping. After further analysis, the catastrophic release of the entire contents of one (1) 30,469-gallon storage tank TDI was chosen as the worst-case scenario. Simultaneous rupture of more than one storage tank is not required within the scope of the hazard assessment, as these are totally separate vessels and the rupture of one storage tank would not necessarily facilitate the rupture of the other storage tanks. If a spill were to occur, the liquid will be collected in a containment area with an area of 7,261 square feet, which provides adequate containment. Based on the worst-case release scenario analysis, the maximum endpoint distance for the level of concern for TDI is 0.1 miles given the current design and location of the tank containment area. \r\n\r\nBecause the worst-case scenario resulted in potentially imp"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000096543,
      "SummaryText": "acted public receptors, an alternative scenario hazard assessment was performed. Based on interviews with knowledgeable persons and their experience at the site, the alternative scenario hazard assessment selected and evaluated was the accidental release of the contents from a hose leak at the railcar unloading area which would drain to the nearby concrete containment area. A modeling analysis was performed based on a maximum pump rate of 150 gallons per minute for ninety (90) seconds, which resulted in a maximum endpoint distance to the level of concern of 0.1 miles. The distance to the property boundary from the containment area is approximately 70 feet (0.01 mile). Therefore, the potential area of concern for the alternative scenario of 0.1 miles does extend off facility property.\r\n\r\nOnce the distance of the worst-case release scenario is determined, the impact of offsite receptors must be considered. If public or environmental receptors are impacted, additional analysis (i.e., alternative release scenario) is required. The distance to the nearest public or environmental receptor from the largest TDI storage tank is approximately 150 feet (0.03 miles) at the property line, which is within the 0.1-mile distance to the measured endpoint. According to MARPLOT, which is a mapping program jointly developed by the USEPA and National Oceanic and Atmospheric Administration (NOAA), there are approximately three (3) people residing within the calculated impact distance of 0.1 miles that could potentially be affected. The public receptors within the distance to the endpoint are considered industrial and residential. The impact distance of the alternative release scenario was determined to be 0.1 miles, which is beyond the property line distance from the containment area where a hose leak from TDI railcar unloading would collect; therefore, the impact on offsite receptors must also be considered. The public receptors within\r\nthis distance appear to be industrial and resident"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000096543,
      "SummaryText": "Future Foam, Inc. (Future Foam)\r\n\r\nExecutive Summary\r\n\r\nA.  Accidental Release Prevention and Emergency Response Policies:\r\nFuture Foam is committed to protecting facility personnel, the public, and the environment from any workplace and accidental release hazards. An appropriate response to releases of TDI is in the written Risk Management Program. Safety, environmental, and risk management programs are fully implemented and coordinated with community emergency responders for emergency planning and response. \r\n\r\nB. Stationary Source and Regulated Substances Handled:\r\nFuture Foam is a urethane foam manufacturing facility which produces various types of flexible urethane foam products located in Tupelo, MS. The facility fabricates some of the urethane foam into various finished products.  Flexible urethane foam is a product manufactured by combining various chemicals that undergo a chemical reaction. The finished product is produced in a variety of colors, thicknesses, and densities.  The facility uses TDI (CAS No. 26471-62-5) to produce urethane foam products. The RMP threshold for TDI is 10,000 pounds.  TDI is stored at Flexible Foam in five (5) 13,965-gallon storage tanks, two (2) 23,689-gallon storage tanks, twelve (12) 30,469-gallon storage tanks, and a maximum of seven (7) 21,505-gallon railcars. The total working capacity, 85% of the capacity, for the tanks is 410,406 gallons, and the total railcar capacity is 150,538 gallons, which equates to approximately 5,740,000 pounds of TDI. Therefore, the facility is subject to RMP and must prepare an RMP plan.\r\n\r\nThe EPA Risk Management Program (RMP) is part of the Clean Air Act and applies to a process storing specified chemical above a threshold quantity. The chemicals and threshold quantities are specified in Title 40 of the Code of Federal Regulations (CFR), Part 68. One such chemical is TDI in excess of 10,000 pounds which is used as an ingredient in the manufacturing process.  After reviewing the facility operat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000096543,
      "SummaryText": "ions and the RMP regulations, it was determined that the entire facility is considered one process.  Based on the Off-Site Consequence Analysis, facility processes and applicable regulations, it was determined that the facility is subject to Program 2 of the RMP regulations.\r\n\r\nC.  Accidental Release Prevention and Chemical Specific Prevention Steps:\r\nFuture Foam is committed to protecting facility personnel, the public, and the environment from any workplace and accidental release hazards.  An appropriate response to releases of TDI is in the written Risk Management Program. Safety, environmental, and risk management programs are fully implemented and coordinated with community emergency responders for emergency planning and response.\r\n \r\nFuture Foam's specific prevention steps include:\r\n1. Hazard reviews to identify, evaluate and control potential TDI process hazards,\r\n2. Develop, review and update operating and maintenance procedures for the TDI process.\r\n3. Provide the appropriate training for TDI process operators, maintenance personnel, and emergency response personnel.\r\n4. Conduct timely investigations of all incidents involving the TDI process.\r\n5. Conduct RMP Compliance audits as per RMP regulations.\r\n\r\nD. Five-year Accident History\r\nWithin the past five years, the process has had no accidental releases that caused offsite impacts provided in the RMP rule (40 CFR 68.10(b)(1).\r\n\r\nE. Emergency Response Program\r\nFuture Foam has developed and implemented an emergency response program for the purpose of protecting public health and the environment. \r\nThis program includes the following elements: \r\n1. An emergency management plan is maintained on site and contains the following elements:\r\n   a. Procedures for informing the public and local emergency response agencies;\r\n   b. Documentation of proper first-aid and emergency medical treatment necessary for   \r\n      Accidental exposures; and\r\n   c. Procedures for emergency response after an accidental release of TDI"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000096543,
      "SummaryText": "ial. According to MARPLOT, there are zero (0)people residing within the calculated impact distance of 0.1 miles that could potentially be affected.\r\n        \r\nH. General Accidental Release Prevention Program and Chemical-Specific Prevention Steps:\r\nProcess Safety Information: Future Foam has completed a compilation of written safety information to be used in conducting the Hazard Review. The Hazard Review has been conducted using the process safety information gathered in order to identify and understand the hazards posed by the TDI System. \r\n\r\nI. Hazard Review: Future Foam will update and re-validate the Hazard Review as necessary and every five (5) years. The Hazard Review was conducted using the What IF methodology, which is one of the methodologies specified in 40 CFR 68.67, and was performed by a team with expertise in engineering and process operations, including one member who has expertise in the TDI System and a member knowledgeable in the specified methodology. A system was established to promptly address the team's findings and recommendations; assure that the recommendations are resolved in a timely manner and that the resolution is documented; develop a written schedule of when these actions are to be completed; and communicate the actions to operation, maintenance and other employees who may be affected by the recommendations or actions.\r\n\r\nJ. Operating Procedures: Future Foam has developed written operating procedures to provide clear instructions for safely conducting activities at each operation where TDI is utilized. These written operating procedures are consistent with the process safety information for each operating phase, operating limitations, safety and health considerations, safety systems and their functions. The operating procedures are readily accessible to employees who work in or maintain the TDI system. These operating procedures will be reviewed as often as necessary to assure that they reflect current operating practice. Future Fo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000096543,
      "SummaryText": "am has developed and implemented safe work practices to provide for the control of hazards during operations such as lockout/tagout; opening process equipment or piping; and control entrance into the TDI facility.\r\n\r\nK. Training: Future Foam will continue to provide training for each employee associated with the TDI system. This training will include an overview of the process and operating procedures as outlined in 40 CFR 68.54.  Refresher training is provided every three (3) years or more often as necessary. Future Foam documents and maintains records of employee training, and the means used to verify that the employee understood the training.\r\n\r\nL. Mechanical Integrity: Future Foam has developed a written preventive maintenance program to maintain the on-going integrity of the equipment used in the TDI process (i.e., storage tanks, pumps, piping systems, etc.); additionally, inspections, testing, equipment deficiencies, and quality assurance are addressed.\r\nEach person who has responsibilities to perform maintenance on the TDI system components receives training at Future Foam every three (3) years or more often if necessary.\r\n\r\nM. Compliance Audits: Future Foam will certify that they have evaluated compliance with the provisions of 40 CFR, Part 68 every three (3) years. The compliance audit will be conducted by a Future Foam employee knowledgeable in the TDI system.  A report of the findings of the audit will be developed.  Future Foam will promptly determine and document an appropriate response to each of the findings of the compliance audit, and document that deficiencies have been corrected.  Records of the two (2) most recent compliance audit reports will be maintained.\r\n\r\nN. Incident Investigation: Future Foam will investigate each incident, which results in or could reasonably result in a catastrophic release of TDI. Incident investigations will be initiated as promptly as possible, but no later than 48 hours following the incident. The incident investigat"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000096543,
      "SummaryText": "ion team will consist of at least one Future Foam employee knowledgeable in the process involved, including a contract employee if the incident involved work of the contractor. A report will be prepared at the conclusion of the investigation, and Future Foam will promptly address and resolve the incident findings and recommendations. Resolutions and corrective actions will be documented. Incident investigation reports will be retained for five (5) years."
    }
  ]
}