{
  "FacilityID": 1000012555,
  "FacilityName": "Leedey Refrigeration Plant",
  "FacilityStr1": "County Road 50",
  "FacilityStr2": null,
  "FacilityCity": "Leedey",
  "FacilityState": "OK",
  "FacilityZipCode": "73654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40039",
  "LEPC": "Custer County Sheriff's Office",
  "FacilityLatDecDegs": "35.78372",
  "FacilityLongDecDegs": "-099.313670",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6948210,
  "ParentCompanyName": "CenterPoint Energy Gas Transmission Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "CEGT",
  "OperatorStr1": "525 Milam Street",
  "OperatorStr2": "11th Floor",
  "OperatorCity": "Shreveport",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "71101",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000167767",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-05-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-03-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-03-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-02-18 00:00:00",
  "DeRegistrationEffectiveDate": "2013-12-20 00:00:00",
  "AnniversaryDate": "2015-03-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.78372,
  "FRS_Long": -99.31367,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000015618,
      "AltID": "Product Surge Tank",
      "FacilityID": 1000012555,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000018380,
          "ProcessID": 1000015618,
          "ChemicalID": 155,
          "Quantity": 110036.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 97890,
              "ProcessChemicalID": 1000018380,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 97891,
              "ProcessChemicalID": 1000018380,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 97892,
              "ProcessChemicalID": 1000018380,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 97893,
              "ProcessChemicalID": 1000018380,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 97894,
              "ProcessChemicalID": 1000018380,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 97895,
              "ProcessChemicalID": 1000018380,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 97896,
              "ProcessChemicalID": 1000018380,
              "ChemicalID": 93
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000016002,
          "ProcessID": 1000015618,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000013013,
              "Process_NAICS_ID": 1000016002,
              "SafetyReviewDate": "2009-03-23 00:00:00",
              "PHA_Date": "2010-12-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-02-17 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-09-10 00:00:00",
              "TrainingReviewDate": "2010-02-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-09-17 00:00:00",
              "EquipmentInspectionDate": "2008-05-22 00:00:00",
              "EquipmentTested": "All vessels, piping, tanks, and misc. from Hi-Tech testing.  They did UT, Visual Insp., C-Rate and RLife inspections",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-06-02 00:00:00",
              "PreStartupReviewDate": "2009-03-23 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-01-05 00:00:00",
              "HotWorkPermitReviewDate": "2009-07-07 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2010-02-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000015529,
                  "PreventionProgram3ID": 1000013013,
                  "ProcessChemicalID": 1000018380
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000012555,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-01-05 00:00:00",
    "ERTrainingDate": "2010-01-05 00:00:00",
    "CoordinatingAgencyName": "Leedey Fire Department",
    "CoordinatingAgencyPhone": "5804883616",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012555,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Leedey Refrigeration Plant (Leedey) has a long-standing commitment to workers and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the facility's processes.  The CenterPoint Energy Gas Transmission Company (CEGT) policy is to implement reasonable controls to prevent foreseeable releases of substances.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nCEGT operates Leedey located in Custer County, Oklahoma.  Leedey is a cryogenic natural gas processing plant designed for the extraction of Liquid Petroleum Gas (LPG) from a gas stream. The cryogenic extraction plant recovers LPG, which is comprised of ethane, propane, butanes, and heavier hydrocarbons, from the inlet gas.  LPG from the liquid extraction plant is delivered via a pipeline.  As evidenced in the ensuing text and based on criteria outlined in the Accidental Release Prevention (ARP) Program, Leedey is a Program 3 process.\n\nLeedey was evaluated to determine if any regulated flammable or toxic substances were present in the process and if they exceeded the threshold quantity.  All equipment and vessels are considered to be connected and/or co-located; consequently, for the purposes of the ARP Program, all equipment and vessels are part of a single process.  The identification of even a single vessel exceeding threshold quantities of a regulated flammable or toxic substance would subject a process to threshold determination for offsite consequence analysis.\n                                                                                         CEGT identified one regulated flammable substance (LPG, flammable liquid mixture) and zero regulated toxic substances along with the largest vessel quantity stored.  It was determined that a single vessel of the flammable liquid mixture exceeded"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012555,
      "SummaryText": "threshold quantity.  The identification of this exceedence indicates that Leedey is a covered process with a regulated substance subject to offsite consequence analysis.\n\nFIVE-YEAR ACCIDENT HISTORY\n\nLeedey has not had any accidental releases during the past five years which meet the criteria for an accidental release as discussed in 40 CFR 68.42.\n\nLOCAL EMERGENCY RESPONSE COORDINATION\n\nLeedey has coordinated its emergency response activities with the local fire department.  Operators are equipped with an Emergency Plan Book that gives the procedures to follow in case of an emergency.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the Leedey Plant.  Because plant processes are subject to EPA's RMP regulations and to OSHA's PSM standards, this summary addresses each of the required elements and describes the management system in place to implement the accident prevention program.\n\nEmployee Participation\n\nCEGT and the Leedey Plant actively encourage all levels of employees and contract employees to participate in creating a safe work environment.  This participation begins with well-established mechanisms of communication with all employees regarding covered process information.  Employees are involved in maintaining PSM rule compliance based on their knowledge, skill, job responsibilities, and experience.\n\nProcess Safety Information\n\nThe Leedey Plant maintains written information intended to provide a foundation for identifying and understanding the process hazards.  This information addresses chemical properties, inventories, and associated hazards, as well as key process parameter limits and equipment design basis/configuration information. Specific personnel within the plant are assigned responsibility to maintain up-to-date process safety information.\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment consideration, is provided in the materi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012555,
      "SummaryText": "al safety data sheets (MSDSs).  This information is supplemented, when required, by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  In addition, the plant has documented safety-related limits for specific process parameters and ensures limited maintenance by using highly trained personnel, process controls, and monitoring and protective instrument systems.  The plant also maintains documentation that provides information about the design and construction of process equipment.  Equipment information includes construction materials, design pressure, and temperature and electrical ratings.  This information provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nProcess Hazard Analysis (PHA)\n\nThe Leedey Plant has a comprehensive program to help ensure that hazards associated with various processes are identified and controlled.  Within the program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nThe Leedey plant primarily uses the HAZOP method to perform these evaluations.  This technique provides a highly structured approach where process parameters such as flow and temperature are examined for deviations from their intended design.  Deviation effects are considered in order to determine resulting potential hazards while preliminary recommendations for improvement are proposed.\n\nThe PHA team findings are promptly and systematically addressed.  The Leedey Plant assures that the recommendations are documented and resolved in a timely manner.  This documentation includes the actions to be taken and a written schedule for completion dates.  The plant also provides proof of communication with operating, maintenance, and other employees whose work assignmen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000012555,
      "SummaryText": "ts are in the process and who may be affected by the recommendations.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate from the original designed safety features, the plant periodically updates and revalidates the hazard analysis.  These periodic reviews will be conducted at least every five years by a PHA team.\n\nOperating Procedures\n\nThe Leedey Plant maintains written procedures that address various modes of process operations, such as initial startup, normal operations, temporary operations, emergency shutdown, normal shutdown, and startup following a turnaround or after an emergency shutdown.  These procedures can be used as a reference by operators and provide a consistent training basis for new operators.  Operating procedures are periodically reviewed and certified as current.  When a process change occurs, operating procedures are revised as necessary through the management of change process.\n\nTraining\n\nTo complement the written operating procedures, the Leedey Plant has implemented a comprehensive training program for all employees.  New employees receive job specific basic training in plant operations.  Employee training includes an emphasis on safety and health hazards, emergency shutdown operations, and safe work practices.  Operators demonstrating adequate knowledge to safely perform duties and tasks are allowed to work independently.\n\nHot Work Permit\n\nThe Leedey Plant issues a hot work permit for all hot work operations conducted on or near a covered process.  The Leedey Plant provides hot work permit training to all plant employees.  Copies of issued work permits are maintained in Operations and Maintenance for a period of one year following completion of work.\n\nContractors\n\nThe Leedey Plant periodically uses contractors to perform maintenance or repair, turnaround, major renovations, or specialty work on or adjacent to a covered process.  Because some contractors work on or near process equipment, the plant ha"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000012555,
      "SummaryText": "s procedures in place to ensure that contractors 1) are trained in the work practices necessary to safely perform his/her job, 2) follow the safety rules of the location including safe work practices, 3) advise the plant of any unique hazards presented by the contractor, and 4) notify the facility of all illnesses and injuries that occur in process areas.\n\nPre-Startup Safety Reviews (PSSRs)\n\nThe Leedey Plant conducts a PSSR for any facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides an additional check to make sure that construction and equipment are in accordance with design specification, that adequate safety, operating, maintenance, and emergency procedures are in place, and that training of each employee involved in operating the process or equipment has been completed.  A standard checklist is used to document compliance.\n\nMechanical Integrity\n\nThe Leedey Plant has well-established programs, procedures, and practices that are required to ensure that equipment used to process, store, or handle hazardous chemicals and/or flammable gas or liquid are designed, constructed, installed, and maintained to minimize the risk of a release.  Equipment examples include vessels, storage tanks, piping systems, and relief and vent systems with associated emergency shutdown systems and controls (i.e. monitoring devices, sensors, and alarms).\n\nMaintenance personnel receive training on 1) an overview of the process, 2) a review of process hazards, and 3) the procedures applicable to the employee's job tasks to ensure that the employees can perform the job tasks in a safe and satisfactory manner.  Process equipment inspection and testing follows recognized and generally accepted good engineering practices.  Equipment deficiencies that are outside of acce"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000012555,
      "SummaryText": "ptable limits are corrected before further use or in a safe and timely manner when necessary means are taken to ensure safe operation.\n\nManagement of Change\n\nThe Leedey Plant has a comprehensive system to manage and document changes to all covered processes.  A systematic approach is followed to control and manage facility changes in order to minimize the possibility that such changes will have an adverse impact on personnel safety, equipment, or the environment.  Employees involved in process operations and maintenance and contract employees whose job tasks might be affected by process changes are informed of and trained in the change prior to process start-up.\n\nIncident Investigation\n\nThe Leedey Plant promptly investigates all incidents that result in or reasonably could have resulted in a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  An incident investigation is initiated as promptly as possible to thoroughly investigate and analyze the incident.  This investigation is lead by an incident investigation team consisting of those with appropriate knowledge and experience in the process. The findings and recommendations made by the incident investigation team are promptly addressed and resolved in a timely manner.  The final resolution of each finding or recommendation is documented and the investigation results are reviewed by all employees (including contractors) who could be affected by the findings.\n\nEmergency Planning and Response\n\nThe Leedey Plant retains a written emergency response plan which includes the designated actions the company and all personnel will take to ensure personal safety from fire and other emergencies.  The plan outlines actions that company technicians and contract employees are to take when there is an unwanted release of highly hazardous chemicals.  The intent of this plan is to facilitate the prompt evacuation of employees when necessary and to account for all personnel.\n\nCompliance A"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000012555,
      "SummaryText": "udits\n\nTo help ensure that the accident prevention program is properly functioning, the Leedey Plant will periodically conduct an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  The audit team will include those knowledgeable in the process, operations personnel, and at least one person with training in audit techniques and practices.  The audit team will develop findings and corrective actions which will be tracked until they are complete.  The final resolution of each finding will be documented and the two most recent audit reports will be retained.\n\nCHANGES TO IMPROVE SAFETY\n\nCEGT is committed to operating the Leedey Plant in a safe manner for workers, the public, and the environment.  CEGT personnel have an opportunity to make suggestions that could improve the safety of the Leedey Plant during monthly regional safety meetings.  Also, CEGT will conduct compliance audits and hazard reviews as required and will make improvements to safety based on the findings from the audits and reviews."
    }
  ]
}