{
  "FacilityID": 1000079032,
  "FacilityName": "C & S Wholesale Services, Inc.",
  "FacilityStr1": "216 Forester Drive",
  "FacilityStr2": null,
  "FacilityCity": "Greenville",
  "FacilityState": "SC",
  "FacilityZipCode": "29607",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45045",
  "LEPC": "Greenville County LEPC",
  "FacilityLatDecDegs": "34.806611",
  "FacilityLongDecDegs": "-082.308722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cswg.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "C & S Wholesale Grocers",
  "Company2Name": null,
  "CompanyDUNS": 1842467,
  "Company2DUNS": 0,
  "OperatorName": "C & S Wholesale Services, Inc.",
  "OperatorStr1": "7 Corporate Drive",
  "OperatorStr2": "PO Box 821",
  "OperatorCity": "Keene",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03431",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bryan Granger",
  "RMPTitle": "SVP, Compliance & Admin",
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000171137",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-11-05 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.79949,
  "FRS_Long": -82.30672,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000098569,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000079032,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099811,
          "ProcessID": 1000098569,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000123639,
          "ProcessID": 1000098569,
          "ChemicalID": 56,
          "Quantity": 25942.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000623639,
          "ProcessID": 1000098569,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079032,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nC&S Wholesale Services Inc.'s senior management is not only committed to offer superior service, but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding community.  The Corporate Compliance Team administers the facility's safety and environmental policies.  The Corporate Compliance Team periodically evaluates the health and safety practices of facility employees to ensure compliance, and oversees implementation of the safety and environmental programs.  These programs include forklift safety, hazard communications, lockout/tagout, Hazardous Materials Emergency Business Plan, employee safety manuals, manufacturer's documentation, Emergency Response, as well as the Risk Management Plan.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nC&S Wholesale Services Inc. - Mauldin FDC is located at 216 Forrester Drive in Greenville, SC.  The primary business of C&S Wholesale Services Inc. - Mauldin FDC is to provide refrigerated warehousing and frozen storage for various food products.  In order to conduct operations, the facility maintains a refrigeration system containing approximately 25,942 pounds of anhydrous ammonia, a regulated substance.  The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for dock operations, glycol underfloor heating, and freezer storage.\n\n \n\nOff-site Release Scenarios\n\nC&S has conducted an OCA based on the EPA document titled \"RMP Offsite Consequence Analysis Guidelines,\" and used the EPA's RMP*Comp Version 1.07 to estimate the distance traveled to a toxic endpoint defined by the EPA regulation. This data were then used to estimate the potential impact caused by a release from each of the regulat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079032,
      "SummaryText": "ed substances.\n\nWorst-Case Release Scenarios\n\nAs required by regulations, scenarios were considered where the entire capacity of the largest vessel for each regulated chemical at the facility was released in 10 minutes. Although these scenarios are highly unlikely in the event of a release, it provides the local responding agencies with a maximum possible impact in the event of an accidental release. In considering these releases, the most pessimistic meteorological conditions were used. Passive mitigation measures were taken into account when considering these release scenarios.\n\nAlternative Release Scenarios\n\nAlternative scenarios were developed to assess what potential impact may occur in the event of a release that is more likely to occur than the worst-case scenarios for each of the regulated chemicals. Several possible release scenarios were considered, and the scenarios with the greatest offsite impact were chosen. In considering the alternative release scenario, the default meteorological conditions for alternative scenarios were used in RMP*Comp. These scenarios represent a more realistic release, and have a downwind distance and impact considerably smaller than the worst-case scenario. No passive or active mitigation measures were taken into account when considering these release scenarios.\n\n\n\n\n\nProcess Description\n\n\n\nThe refrigeration system uses approximately 25,942 pounds (a charge calculation was completed on January 31, 2013 by Ammonia Safety Management) of ammonia to provide refrigeration for glycol chilling, dock operations, and freezer warehousing. \n\n\n\nThe refrigeration cycle begins with the transfer of liquid ammonia from the Condensers (2) to the Thermosyphon Receiver. A small amount of the liquid ammonia flowing through the Thermosyphon Receiver is reserved for thermosyphon oil cooling of the Screw Compressors (5), with majority of the liquid draining into the Control Pressure Receiver by means of a float actuated valve.  The liquid ammonia is s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079032,
      "SummaryText": "tored within the Control Pressure Receiver until it is fed to the Flash Cooler. The Liquid Transfer Unit transfers excess liquid to the Control Pressure Receiver based on the level in the Flash Cooler.\n\n\n\nAt the Flash Cooler, the liquid ammonia from the Control Pressure Receiver is flash cooled and the subcooled liquid refrigerant is fed to Low Pressure Recirculators 1 and Low Pressure Recirculator 2.  A subcooling coil located in the Flash Cooler provides ammonia liquid feed to the dock area evaporators at the same pressure as maintained for the CPR. (AU-13 through AU-19). The Flash Cooler also provides for the trapping and capture of liquid ammonia returning from the dock area evaporators and separation from the applicable screw compressor suction gas.  \n\n\n\nLow Pressure Recirculator 1 pumps liquid ammonia to evaporators in the -10?F freezer storage area (AU-1 through AU-8), while Low Pressure Recirculator 2 pumps liquid ammonia to evaporators in the -20?F ice cream storage area (AU-9 through AU-12).  At the evaporators, the liquid ammonia, flowing through coils in the unit, is partially boiled as it absorbs heat from the product and room.  The resulting 'wet suction' (liquid/vapor mix) is returned to the pump package which supplied each evaporator, wherein the liquid drops to the bottom of the vessel (to be reused in the refrigeration of the warehouse) and vapor is drawn from the top by the applicable compressor. (Dry suction)\n\n\n\nCompressors RC-3, RC-4, and RC-5 draw vapor from Low Pressure Recirculator 1 and the Flash Cooler. Compressors RC-1 and RC-2 draw vapor from Low Pressure Recirculator 2.  The vapor discharged from the Compressors is primarily routed to the Condensers, but also used in the Glycol Heat Exchanger and in the defrost cycle of the evaporators. There are four screw compressors and one swing compressor for the refrigeration system.  The compressors receive high pressure liquid from the Thermosyphon Receiver for thermosyphon oil cooling employing "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079032,
      "SummaryText": "shell & tube heat exchangers for each compressor.\n\n\n\nAt the Condensers (2), air (fans) and water (pumps) are used to condense the High Stage Compressor discharge into high pressure liquid, which then drains to the Thermosyphon Receiver to begin the refrigeration cycle again.  At the Glycol Heat Exchanger, glycol, used in a separate closed system to heat the floor under the freezer, is heated by high pressure ammonia vapor as it passes through the heat exchange unit.  The liquid ammonia condenses and then drains to the Flash Cooler.  The system is also equipped with an Automatic Purger that removes non-condensables, i.e. air, from the system.\n\n\n\nAmmonia sensors are located in the Engine Room and within refrigerated spaces throughout the perishable and freezer warehouse.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\n1) OSHA's Process Safety Management (PSM); and\n\n2) EPA's Risk Management Program (RMP).\n\n\n\nThese regulations impose numerous requirements on the facility to ensure the safety of the public and on-site workers.  The following summarizes the key compliance programs that have been implemented by C&S Wholesale Services, Inc. - Mauldin FDC to prevent the accidental release of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner.  The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards.  The Management of Change program ensures that process modifications are implemented in a safe manner.  The Pre-Startup Safety Review program ensures that adequate safety measures are in p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000079032,
      "SummaryText": "lace before ammonia is introduced into a process.  The Hot Work Permit program ensures that C&S Wholesale Services Inc. - Mauldin FDC employees and contractors perform hot work (e.g. welding) in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.\n\n\n\nIt is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  The facility has also installed ammonia sensors in the Engine Room, in the cold storage areas which will alert operators in the event of an ammonia detection. \n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no federally reportable incidents nor any that resulted in serious injuries or offsite consequences within the last five years (May 2014 - May 2019). \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility has an Emergency Action Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives: \n\n \n\n- save lives;\n\n- minimize and avoid injuries;\n\n- protect the environment; and\n\n- minimize property damage.\n\n\n\nThe Plan provides the notification procedures and evacuation routes for emergencies that may arise at the facility. The Facility is non-responding and has personnel trained to support the HazMat response team if required (up to 300 ppm of ammonia).\n\n\n\nThere is a specific program (CEHS-0042) which outlines the training, qualifications and procedures for authorized ammonia Incident responders and observers.  This Plan is reviewed and updated at least once per year to ensure compliance with "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000079032,
      "SummaryText": "the PSM and RMP regulations.  Facility personnel receive annual training regarding the emergency procedures and the Emergency Response Team holds regular drills.\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nIn 2000, the refrigeration system was thoroughly examined for safety hazards by way of a Process Hazard Analysis (PHA).  In addition, three Revalidations of the initial Process Hazard Analysis have been conducted.  \n\n\n\n?    1st Revalidation: 2005 \n\n?    2nd Revalidation: 2010\n\n?    3rd Revalidation: 2015\n\n\n\nThe Original PHA and subsequent Revalidations consisted of:\n\n\n\n- What-If Studies\n\n\n\n- series of safety checklists; and\n\n\n\n- facility inspection.\n\n\n\nThe mitigation measures (recommendations) include additional training, key maintenance-related tests/inspection, and enhanced emergency response policies and procedures.  \n\n"
    }
  ]
}