{
  "FacilityID": 1000070937,
  "FacilityName": "Whelan Energy Center Unit 2",
  "FacilityStr1": "4520 East South Street",
  "FacilityStr2": null,
  "FacilityCity": "Hastings",
  "FacilityState": "NE",
  "FacilityZipCode": "68901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31001",
  "LEPC": "Adams County LEPC",
  "FacilityLatDecDegs": "40.580132",
  "FacilityLongDecDegs": "-098.312315",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.hastingsutilities.com",
  "FacilityEmailAddress": "mstange@hastingsutilities.com",
  "FacilityDUNS": 135159325,
  "ParentCompanyName": "Public Power Generation Agency (PPGA)",
  "Company2Name": null,
  "CompanyDUNS": 808598127,
  "Company2DUNS": 0,
  "OperatorName": "PPGA / Hastings Utilities",
  "OperatorStr1": "1228 North Denver Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Hastings",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68902",
  "OperatorZipCodeExt": "0398",
  "FTE": 78,
  "OtherEPAFacilityID": "68901WHLNNEHWY6",
  "EPAFacilityID": "100000212717",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "FID# 58048",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-07-09 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-07-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-07-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000088913,
      "AltID": "WEC 2  NOx  SCR",
      "FacilityID": 1000070937,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000111254,
          "ProcessID": 1000088913,
          "ChemicalID": 56,
          "Quantity": 41237.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000090135,
          "ProcessID": 1000088913,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000055689,
              "Process_NAICS_ID": 1000090135,
              "SafetyReviewDate": "2018-05-28 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "NEC 2008, NESC 2007, NFPA 497",
              "FR_Comments": null,
              "HazardReviewDate": "2016-12-08 00:00:00",
              "ChangeCompletionDate": "2017-04-19 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Snow and Ice Hazard",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Completed recommendations as per most recent hazard review",
              "OpProceduresReviewDate": "2017-04-07 00:00:00",
              "TrainingReviewDate": "2017-12-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-05-28 00:00:00",
              "EquipmentInspectionDate": "2018-04-02 00:00:00",
              "EquipmentTested": "Fogging system/Ammonia Alarm/Valves/Instrumentation/Visual inspections of ammonia system conducted daily",
              "ComplianceAuditDate": "2016-12-08 00:00:00",
              "AuditCompletionDate": "2017-04-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2016-12-08 00:00:00",
              "CBI_Flag": 0,
              "Description": "Whelan Energy Center Unit 2 uses anhydrous ammonia in the operation of its selective catalytic reduction (SCR) pollution prevention system.\n\nThe Program 2 Prevention Program for the anhydrous ammonia system is a rigorous program designed to meet the requirements of the RMP regulations.\n\n\n\nThe hazard review was updated in December, 2016. The review examined the hazards associated with the selective catalytic reduction (SCR) process and the use of anhydrous ammonia. It also assessed the possibility of equipment malfunction and/or human errors that could cause an accidental release. Safeguards used or needed to control the hazards or prevent equipment malfunction and/or human error were evaluated. All changes resulting from the hazard review were completed by April, 2017.\n\n\n\nThe Program 2 Prevention Program for Whelan Energy Center Unit 2 incorporates all of the required elements, including:\n\n\n\nOperating Procedures: Written operating procedures have been developed for the safe storage and handling of anhydrous ammonia at Whelan Energy Center. The procedures specify steps for each operating phase of the process and operating limits (e.g., pressure in the tanks). The appropriate safety and health considerations have been assessed and incorporated into the safe operating procedures.\n\n\n\nTraining: A training program has been developed for the operation, inspection, and maintenance of the SCR anhydrous ammonia system to ensure safe operation.\n\n\n\nMaintenance: Written procedures have been developed for maintaining the process equipment. Inspections and maintenance practices needed to comply with industry standards have also been developed. The maintenance program is conducted is accordance with good engineering practices and in accordance with manufacturers recommendations.\n\n\n\nCompliance Audit: The most recent compliance audit was conducted in December, 2016. All changes resulting from the audit were completed by April, 2017.\n\n\n\nAll of the elements of the Program 2 Prevention Program have been developed with the intent of preventing the accidental release of anhydrous ammonia at Whelan Energy Center.\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000056395,
                  "PreventionProgram2ID": 1000055689,
                  "ProcessChemicalID": 1000111254
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000070937,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Adams County Emergency Management",
    "CoordinatingAgencyPhone": "4024612361",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000070937,
      "SummaryText": "Stationary Source and Regulated Substances Handled:\n\n\n\nWhelan Energy Center is a two unit, coal-fired electric generating facility, which is located two miles east of the City of Hastings in Adams County, Nebraska.  Whelan Energy Center Unit 2 is owned by the Public Power Generation Agency (PPGA), which consists of a number of partners, including Hastings Utilities, which operates the facility. Whelan Energy Center Unit 2 uses anhydrous ammonia in the operation of its selective catalytic reduction (SCR) pollution prevention system. Anhydrous ammonia is the only Risk Management Program (RMP) listed chemical that is present at Whelan Energy Center above the RMP threshold quantity.\n\n\n\nAccidental Release Prevention and Emergency Response Policies:\n\n\n\nHastings Utilities is committed to employee and public safety and the protection of the environment. \n\n\n\nThe basis of Hastings Utilities' Accidental Release Prevention Program is sound engineering, effective operating procedures, and robust training and maintenance programs. Hastings Utilities employees are not trained to respond to releases, but Hastings Utilities works closely with the local emergency agencies to ensure that they are prepared to respond to releases.\n\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps:\n\n\n\nHastings Utilities' Program 2 Prevention Program for the anhydrous ammonia system is a rigorous program which incorporates all of the required elements:\n\n\n\n    - Safety information is compiled, maintained on-site, and updated as necessary. \n\n\n\n    - A hazard review has been conducted using a \"What if\" methodology with significant input from employees.  The findings of the hazard review and actions taken as a result of the findings are documented. \n\n\n\n    - Written operating procedures have been developed for the safe storage and handling of anhydrous ammonia at Whelan Energy Center Unit 2. The procedures specify steps for each operating phase.  Procedures are updated, as necess"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000070937,
      "SummaryText": "ary.\n\n\n\n    - A training program has been established related to the operation, inspection, and maintenance of the anhydrous ammonia system to ensure safe operation.\n\n\n\n    - Hastings Utilities' has written procedures for maintaining the process equipment and has identified necessary checks and inspections. Operators perform visual inspections on the ammonia process equipment as part of their plant tour, which is required at least once per day.\n\n\n\n    - A thorough and detailed compliance audit was conducted in December, 2016, and a report developed of the audit findings. The findings were addressed by April, 2017. This was the second compliance audit required for the facility.\n\n\n\n    - There have been no incidents involving ammonia at Whelan Energy Center that resulted in, or could have resulted in, a catastrophic release. However, a core incident investigation team has been identified and procedures are in place to conduct an incident investigation, should an incident occur.\n\n\n\nAll of the elements of Hastings Utilities' Program 2 Prevention Program have been developed with the intent of preventing the accidental release of anhydrous ammonia.\n\n\n\nFive-Year Accident History:\n\n\n\nThere have not been any accidents, as defined in 40 CFR 68.42, in the last five years.\n\n\n\nEmergency Response Program:\n\n\n\nHastings Utilities' employees are not trained as first responders.  In the event of a significant release, site personnel will follow the emergency action plan which includes notification of the control room. The control room will contact emergency services by dialing 911, so that the appropriate fire and rescue, police, ambulance and emergency management services can be dispatched, as warranted by the situation.\n\n\n\nHastings Utilities works closely with local emergency personnel to ensure that responders are familiar with the anhydrous ammonia process, its location, and the potential risks.\n\n\n\nAll site personnel have received initial ammonia training on ammonia hazards, how t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000070937,
      "SummaryText": "hey can be identified, and what to do in the event of a release.  In addition, operators and maintenance personnel who work with the ammonia system have been instructed on the proper use and maintenance of the equipment. Several of the Hastings Utilities' employees have taken HAZWOPER training, which provides additional training on the proper use of ammonia.\n\n\n\nHastings Utilities considers the delivery of ammonia at the site to be one of the highest risk activities.  Unloading is done by the ammonia vendor's qualified personnel.  As an additional safety measure, Hastings Utilities stations a trained person to observe the ammonia unloading and intervene, if necessary.\n\n\n\nPlanned Changes to Improve Safety:\n\n\n\nHastings Utilities is continually evaluating the hazards of operation of the anhydrous ammonia system. A revision was made to the lock-out/tag-out policy to require two individuals to verify that ammonia process equipment has been properly locked-out/tagged out prior to maintenance of the equipment and returning the system to service. All plant employees have been trained on the new lock-out/tag-out policy. Hastings Utilitites will continue to review the operation, training, and maintenance of the ammonia system to look for ways to improve safety.\n\n\n\n"
    }
  ]
}