{
  "FacilityID": 1000098063,
  "FacilityName": "Entegris, Inc.",
  "FacilityStr1": "7 Commerce Drive",
  "FacilityStr2": null,
  "FacilityCity": "Danbury",
  "FacilityState": "CT",
  "FacilityZipCode": "06810",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09001",
  "LEPC": "Danbury LEPC",
  "FacilityLatDecDegs": "41.4096",
  "FacilityLongDecDegs": "-73.4178",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "AV",
  "FacilityURL": "https://www.entegris.com/content/en/home.html",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 103244773,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Entegris",
  "OperatorStr1": "7 Commerce Drive",
  "OperatorStr2": null,
  "OperatorCity": "Danbury",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06810",
  "OperatorZipCodeExt": null,
  "FTE": 130,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000234374",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-12-03 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-01-10 11:36:04",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-01-10 11:36:04",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-01-10 11:36:04",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-01-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 41.40978,
  "FRS_Long": -73.41847,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000121471,
      "AltID": "Arsine SDS Filling&Storag",
      "FacilityID": 1000098063,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000152113,
          "ProcessID": 1000121471,
          "ChemicalID": 67,
          "Quantity": 1800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000122844,
          "ProcessID": 1000121471,
          "NAICSCode": "54171",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000104358,
              "Process_NAICS_ID": 1000122844,
              "SafetyReviewDate": "2021-11-29 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-10-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Uninterruptible Power Supply (UPS)",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Emergency Release Scrubber",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-11-29 00:00:00",
              "TrainingReviewDate": "2021-11-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-09-27 00:00:00",
              "EquipmentInspectionDate": "2021-08-13 00:00:00",
              "EquipmentTested": "Fire suppression System - 9-24-21;   Emergency Release Scrubber - 5-11-21; Vertex toxic gas monitoring system - 8-13-21; Ventilation Exhaust system - 8-2-21; Emergency Generator - 7-12-21",
              "ChangeMgmtDate": "2020-04-30 00:00:00",
              "ChangeMgmtReviewDate": "2017-01-04 00:00:00",
              "PreStartupReviewDate": "2017-01-04 00:00:00",
              "ComplianceAuditDate": "2021-05-18 00:00:00",
              "AuditCompletionDate": "2021-09-30 00:00:00",
              "IncidentInvestigationDate": "2015-07-17 00:00:00",
              "InvestigationChangeDate": "2015-12-09 00:00:00",
              "ParticipationPlansReviewDate": "2021-09-10 00:00:00",
              "HotWorkPermitReviewDate": "2020-09-22 00:00:00",
              "ContractorSafetyReviewDate": "2021-09-15 00:00:00",
              "ContractorSafetyEvalDate": "2021-04-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000131157,
                  "PreventionProgram3ID": 1000104358,
                  "ProcessChemicalID": 1000152113
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000098063,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-02-01 00:00:00",
    "ERTrainingDate": "2021-02-01 00:00:00",
    "CoordinatingAgencyName": "City of Danbury Fire Department",
    "CoordinatingAgencyPhone": "2037961550",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000098063,
      "SummaryText": "Executive Summary\r\n\r\nINTRODUCTION\r\n\r\nThe Entegris facility in Danbury, Connecticut produces Safe Delivery Source&reg; (SDS); systems to enable safe use of specialty gases, including arsine in the semiconductor industry.  The SDS systems contain the specialty gases on absorbent carbon-based media at sub-atmospheric pressures (< 14.7 psia) in small (0.41 to 6.6 liter) steel canisters. The regulated processes are simply: \r\n\r\n1.\tThe transfer of arsine gas from high pressure cylinders to the SDS canisters and \r\n2.\tThe storage of the high-pressure supply cylinders and filled and empty SDS canisters.  \r\n\r\nNo chemical mixing or chemical reactions occur in the process.  Once the gas is transferred to the SDS, it is stored in an inherently safe manner because even if the SDS canister were ruptured, the gas would remain on the absorbent media.  The end user must use a vacuum to withdraw the gas from SDS canister for use.  \r\n\r\nRMP AND PSM THRESHOLDS\r\n\r\nThe RMP threshold for arsine (1000 pounds) was triggered in 2017 when Entegris added  additional SDS canister storage at the facility.  The OSHA Process Safety Management (PSM) threshold for arsine (100 pounds) had been triggered previously, so Entegris already has a PSM program in place.  The SDS production and storage process falls within Program 3 of the RMP because the site is subject to PSM and has an offsite public receptor within the worst-case scenario release assessment model.  \r\n\r\nARSINE STORAGE AND USE\r\n\r\nThe facility stores a maximum of six, 60-pound high pressure steel cylinders of arsine used to fill the SDS which are stored in a locked hazardous materials storage building that is controlled by an electronic card reader to limit access to trained and authorized personnel.  This area contains gas sensors (Honeywell Vertex Detection system) and an alarm system that is triggered by detection of arsine gas at a level above the permissible exposure limit (PEL) of 50 ppb.  The high-pressure cylinders arrive with protectiv"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000098063,
      "SummaryText": "e steel valve caps that protect the cylinder valves from impact. The cylinders are checked for leaks upon arrival with portable gas detection equipment.  The high-pressure cylinders contain pneumatic valves which cannot be opened by hand without a special tool. These valves require a pneumatic pressure of 80 psig to open and allow gas to flow from them. In addition, the cylinder valve outlet fitting also comes with a sealed protective cap, which would prevent gas flow from the cylinder if the valve were inadvertently opened. The source cylinder protective valve caps are not removed until the cylinders have been secured inside the gas cabinet and it is time to connect the cylinder valves to the gas cabinet manifold. The high-pressure cylinders are equipped with reduced flow orifices (RFOs) of 0.040 inches which limit the flow of gas from the cylinder when the valve is opened for use.  When placed in service in the gas cabinet, the pneumatic source gas cylinder valve will automatically close at the detection of a gas leak or any building evacuation or fire alarm. The gas cabinet and other related process equipment is ventilated to an emergency release rooftop scrubber (a redundant safety device) which will prevent or minimize a release into the atmosphere outside the building.  The remaining storage of arsine is in the sub-atmospheric pressure SDS canisters.  \r\n\r\nIn the event a gas sensor alarm is triggered, the area is evacuated and the Entegris Emergency Response Team (ERT) responds wearing self-contained breathing apparatus (SCBA) to determine and remedy the source of the alarm.  If a SDS canister or high-pressure canister is found to be leaking, the ERT contains it in a gas-tight coffin which is safely removed from the facility.   Details of all protections systems are contained within the PSM documentation.\r\n\r\nWORST CASE SCENARIO MODEL - TOXICS\r\n\r\nRMP*Comp was used to model potential arsine releases from the Entegris facility.  The Worst Case Release scenario"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000098063,
      "SummaryText": "was based on a catastrophic release of the largest container at the facility, the 60-pound high pressure arsine cylinder.  The following offsite consequence analysis parameters were used, as dictated by 40 CFR 68.22.  \r\n\r\no\tRelease of entire contents of 60-pound cylinder in a 10-minute period for a release rate of 6 pound/minute\r\no\tWind Speed of 1.5 meters per second\r\no\tClass F atmospheric stability \r\no\tGround level release\r\no\tAir temperature of 77 degrees F\r\no\tUrban surroundings\r\n\r\nUsing the above parameters, the affected area was computed to encompass a 1.6-mile radius around the facility.  \r\n\r\nALTERATIVE SCENARIO MODEL - TOXICS\r\n\r\nThe alternative scenario is intended to be a more likely scenario than a sudden catastrophic release of the largest container.  For this scenario, it was assumed that one of the high-pressure arsine cylinders was left wide open.  The flow rate would be based on the flow through the 0.040 RFO.  Entegris has computed this to be 93.5 liters per minute  (=3.302 cubic feet per minute) with a density of 0.2 pounds per cubic foot  which equals 0.66 pounds/minute.  Entegris has reported that it would take the ERT less than 60 minutes  to don SCBA and contain such a leak from a high-pressure cylinder.  So, the alternative scenario was to assume a release rate of 0.66 pounds per minute for a period of 60 minutes.  \r\n\r\nOther assumptions were based on the default parameters for an alternative scenario in RMP*Comp.  These include:\r\n\r\no\tWind Speed of 3 meters per second\r\no\tClass D atmospheric stability \r\no\tGround level release\r\no\tAir temperature of 77 degrees F\r\no\tUrban surroundings\r\n\r\nUsing RMP*comp, this resulted in a potentially affected area within a 0.2-mile radius around the gas storage area at Entegris.  \r\n\r\nRELEASE SCENARIOS - FLAMMABLE GAS\r\n\t\r\nArsine is not considered a flammable gas in the RMP program, so flammable gas releases were not evaluated.  \r\n\r\nEVALUATION OF POTENTIAL RELEASE AREAS\r\n\r\nThe potential release areas were evaluated in"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000098063,
      "SummaryText": "intains both an Emergency Response Plan (ERP) and has an on-site Emergency Response Team to respond to site incidents.  The ERP has been recently updated and includes:\r\no\tScope of Response\r\no\tERT Command Structure and Responsibilities\r\no\tGeneral Emergency Response Procedures\r\no\tTraining\r\no\tMaintenance and Review of ERP\r\no\tLocal, State and Federal Emergency Contacts\r\no\tMedical Facility Location\r\n\r\nDOCUMENT MANAGEMENT\r\n\r\nEnvironmental documents are maintained electronically in Entegris' ISO 14000 and ISO 45001 Management System and updated as needed due to facility or other changes and/or when required by regulation."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000098063,
      "SummaryText": "two ways:  \r\n\r\nFor the 0.2-mile radius, a windshield and aerial mapping survey was conducted on each street within the affected area and recording the entities within that area.  The area was entirely light industrial and commercial, with no residences, schools, prisons, or hospitals in that radius.  The only public receptors are an industrial/office area a small shopping center containing a grocery store and other retail and service establishments in the alternative scenario area.  \r\n\r\nThe 1.6-mile radius contained a larger portion of Danbury and a portion of Bethel, Connecticut, but would only be affected under a very unusual circumstance such as the entire head of the cylinder being sheared off.  Based on CAMEO Marplot software, the area contains a residential population of 19,000.  It also contains the following resources:\r\n\r\no\tSchools\r\no\tRecreation Area\r\no\tHospital\r\no\tCommercial, office and industrial areas\r\n\r\nIt is not expected that either scenario would occur, and Entegris's five year history has no significant releases outside their facility and no injuries.  \r\n\r\n\r\nPROCESS HAZARD ANALYSIS (PHA)\r\n\r\nEntegris has completed, and recently updated a PHA using a What if technique that includes.  This organized and systematic effort identified more than 130 potential hazards and focused on equipment, instrumentation, utilities, human actions (routine and non-routine), and external factors that might impact the process.  It was conducted by engineers, scientists and technicians familiar with the process and equipment.  Various scenarios are addressed in a Hazard Control Plan .  \r\n\r\nSome of the key hazards and the way in which they are mitigated are identified in the excerpts below:\r\n\r\no\tPotential Hazard and Solution: High pressure arsine gas leak outside of gas cabinet (into room air). This is unlikely scenario as all high-pressure gases are stored in areas monitored by the Vertex and any leaks > PEL would trigger an evacuation alarm. All high-pressure cylinders ar"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000098063,
      "SummaryText": "e immediately checked for leaks with portable gas detection equipment when source cylinders arrive from the vendor in shipping and receiving. The high-pressure cylinders are then moved out of Receiving and into the outdoor Hazmat shed to minimize any potential impact to the cylinders by a forklift in Shipping and Receiving. High pressure cylinders arrive with protective steel valve caps that protect the cylinder valves from impact. The high-pressure cylinders contain pneumatic valves which cannot be opened by hand without a special tool. These valves require a pneumatic pressure of 80 psig to open and allow gas to flow from them. The source cylinder protective valve caps are not removed until the cylinders have been secured inside the gas cabinet and it is time to connect the cylinder valves to the gas cabinet manifold. In addition, the cylinder valve outlet fitting also comes with a sealed protective cap, which would prevent gas flow from the cylinder if the valve were inadvertently opened. (This seems quite repetitive as to what was already stated above). However, if this situation does occur, personnel will immediately evacuate the area and leave the building and activate the building evacuation alarm as they leave. The operator of the plant should immediately apprise the ERT of the hazard condition if possible. Affected persons will seek medical attention immediately if there was any exposure to the gas.\r\n\r\no\tPotential Hazard and Solution: Fire in plant. The entire process area is covered by a sprinkler system and each gas cabinet has its own internal sprinkler head installed at the top. Activation of any sprinkler head or smoke detector would automatically trigger a fire alarm.  Any person discovering a fire will inform area occupants and actuate any plant emergency off switch if readily accessible and immediately evacuate the area and the building and activate the fire alarm while exiting the building. The operator of the plant should immediately apprise an ER"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000098063,
      "SummaryText": "T member of the hazard condition if possible.\r\n\r\no\tPotential Hazard and Solution: Toxic gas leak from Vacuum Pump. Arsine vacuum pump stands are enclosed and monitored with the toxic gas monitors. Vacuum pumps are helium leak checked at the manufacturer's site upon purchase of a new pump or after completion of maintenance and repair by the manufacturer to prevent such leaks.  \r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nEntegris has had no accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\r\n\r\nPREVENTION PROGRAM DESCRIPTION\r\n\r\nEntegris makes Safe Delivery Source&reg; systems for highly toxic materials and therefore is highly regulated for safety and has an active and wide-reaching Prevention Program.  The Danbury site has an approved Site Security Plan regulated by the Department of Homeland Security Chemical Facility Anti-Terrorism standard and ISO 14000 and ISO 45001 standard certifications.  The core of the program is SDS Fill Hydride Safety Review (Document WI-03150) which has been recently updated. It contains links to many of the RMP requirements and has sections/links that include but are not limited to the following:\r\no\tProcess Description\r\no\tChemicals Involved\r\no\tEquipment Information\r\no\tMaps and Schematics\r\no\tMaterials of Construction Table\r\no\tHazard Analysis\r\no\tHazard Control Plan\r\no\tProcess Support Information\r\no\tEmergency Considerations\r\no\tFinished Goods Estimates\r\no\tManufacturing Flow Charts\r\no\tOperational Procedures \r\no\tEquipment Interlock Matrix \r\no\tCritical Equipment and Safety-related Maintenance\r\n\r\nOther key documents maintained by Entegris include:\r\no\tContractor Safety Program and Performance Analyses\r\no\tEmergency Response Plan\r\no\tContingency Plan\r\no\tManagement of Change Forms\r\no\tDanbury Process Safety Management SOP\r\no\tMedical Response Procedures\r\n\r\nEMERGENCY RESPONSE\r\n\r\nEntegris ma"
    }
  ]
}