{
  "FacilityID": 1000082188,
  "FacilityName": "Honda of America Mfg., Inc., Anna Engine Plant",
  "FacilityStr1": "12500 Meranda Road",
  "FacilityStr2": null,
  "FacilityCity": "Anna",
  "FacilityState": "OH",
  "FacilityZipCode": "45302",
  "Facility4DigitZipExt": "9699",
  "FacilityCountyFIPS": "39149",
  "LEPC": "Shelby County EMA",
  "FacilityLatDecDegs": "40.372712",
  "FacilityLongDecDegs": "-084.190020",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 121300636,
  "ParentCompanyName": "American Honda Motor Company",
  "Company2Name": null,
  "CompanyDUNS": 8860389,
  "Company2DUNS": 0,
  "OperatorName": "Honda of America Mfg., Inc.",
  "OperatorStr1": "24000 Honda Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Marysville",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43040",
  "OperatorZipCodeExt": "9251",
  "FTE": 3400,
  "OtherEPAFacilityID": "OHD980994701",
  "EPAFacilityID": "100000084516",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "P0121812",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-08-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-08-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-08-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-08-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.38036,
  "FRS_Long": -84.19178,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000102654,
      "AltID": "GSN Furnaces #1, 2, 3 & 4",
      "FacilityID": 1000082188,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000128616,
          "ProcessID": 1000102654,
          "ChemicalID": 56,
          "Quantity": 79000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000103927,
          "ProcessID": 1000102654,
          "NAICSCode": "33631",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000086801,
              "Process_NAICS_ID": 1000103927,
              "SafetyReviewDate": "2018-12-12 00:00:00",
              "PHA_Date": "2019-03-27 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-10-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Lightning",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Building ventilation system",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Portable monitor",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-06-30 00:00:00",
              "TrainingReviewDate": "2019-06-06 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-06-28 00:00:00",
              "EquipmentInspectionDate": "2019-07-02 00:00:00",
              "EquipmentTested": "Annual ammonia tank inspections",
              "ChangeMgmtDate": "2018-06-21 00:00:00",
              "ChangeMgmtReviewDate": "2018-11-21 00:00:00",
              "PreStartupReviewDate": "2018-09-18 00:00:00",
              "ComplianceAuditDate": "2018-12-05 00:00:00",
              "AuditCompletionDate": "2019-10-31 00:00:00",
              "IncidentInvestigationDate": "2018-11-10 00:00:00",
              "InvestigationChangeDate": "2018-12-31 00:00:00",
              "ParticipationPlansReviewDate": "2019-05-28 00:00:00",
              "HotWorkPermitReviewDate": "2017-12-20 00:00:00",
              "ContractorSafetyReviewDate": "2018-10-19 00:00:00",
              "ContractorSafetyEvalDate": "2014-06-24 00:00:00",
              "CBI_Flag": 0,
              "Description": "Heat treat process involving ammonia",
              "_chemicals": [
                {
                  "PrimaryKey": 1000108259,
                  "PreventionProgram3ID": 1000086801,
                  "ProcessChemicalID": 1000128616
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000082188,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-04-01 00:00:00",
    "ERTrainingDate": "2019-05-01 00:00:00",
    "CoordinatingAgencyName": "Shelby County LEPC",
    "CoordinatingAgencyPhone": "9374925635",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082188,
      "SummaryText": "This is an executive summary of the policies, procedures and activities for compliance with the EPA's Accidental Release Prevention Requirements - Risk Management Program (RMP) pursuant to Title 40 Part 68 of the Code of Federal Regulations (40 CFR 68) for the Honda of America Mfg., Inc. (Honda) Anna, Ohio Engine Plant (AEP).\n\n\n\n<>The accidental release prevention and emergency response policies at the stationary source [40 CFR 68.155(a)]:\n\n\n\nThe accidental release prevention and emergency response policies are addressed in the individual RMP procedures which detail the RMP requirements as well as how Honda complies with the applicable requirements. In addition, Honda has developed and implemented two policies which directly impact and influence Honda's accident release prevention and emergency response activities. First, Honda's Safety Policy expresses Honda's commitment to:\n\n\n\n -Provide a safe and healthful working environment,\n\n -Conduct its operations with the highest regard for associate safety, \n\n -Continually improve the safety management system, \n\n -Train associates in respects to safety related to their job, and\n\n -Comply with all applicable safety and health requirements and standards mandated by federal, state and local law. \n\n\n\nSecond, Honda has developed and implemented an Environmental Policy which expresses Honda's commitment to:\n\n\n\n -Comply with all applicable environmental requirements mandated by federal, state, and local law,\n\n -Operate and continually improve an environmental management system, and\n\n -Implement methods to prevent pollution, conserve natural resources and reduce waste.\n\n\n\nWith these policies as a foundation, Honda AEP has made a significant effort to ensure compliance and good management in all areas relating to chemical safety. Many of the RMP requirements are similar or identical to requirements covered by the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) program, and the Honda processes su"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082188,
      "SummaryText": "bject to RMP regulation are also subject to PSM requirements. \n\n\n\nHonda AEP is a responding facility for releases of the RMP-listed chemicals, so the site utilizes an Emergency Response Plan. \n\n\n\n<>The stationary source and regulated substances handled [40 CFR 68.155(b)]:\n\n\n\n-Stationary Source:\n\nHonda AEP primarily consists of five manufacturing departments:\n\n\n\n1. Aluminum Die Cast Department. In the Aluminum Die Cast Department, raw aluminum ingots are melted in aluminum furnaces. The molten aluminum is then injected into dies either by low-pressure casting or by high-pressure casting. Low pressure casting is used to produce engine cylinder heads. High pressure casting is used to produce engine blocks and transmission casings.\n\n\n\n2. Aluminum Machining Department. Engine blocks and cylinder heads from the Aluminum Die Cast Department are machined into finished products for use in the Engine Assembly Department.\n\n\n\n3. Engine Assembly Department. The Engine Assembly Department consists of three assembly lines.\n\n\n\n4. Ferrous Manufacturing Department. In the Ferrous Manufacturing Department, metal is melted in a cupola and poured into molds to form engine parts. In the Quick Cast Camshaft furnace, iron is melted and poured into an alloy die to make camshafts. The parts poured are machined into finished products. Crankshafts are also machined and heat-treated. RMP-regulated substances (anhydrous ammonia) are used in the heat-treating (nitriding) furnace to chemically harden the surface of the crankshafts.\n\n\n\n5. Drivetrain Manufacturing Department. In the Drivetrain Manufacturing Department, transmission components are machined and heat treated.\n\n\n\nHonda AEP maintains a high level of protection from potential chemical exposures for all Honda AEP associates. This is accomplished through: operational controls, systems design, mechanical integrity and associate training. In addition, Honda AEP procedures are established that meet all applicable RMP requirements and include s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082188,
      "SummaryText": "teps to prevent or control unwanted releases at Honda AEP. For example, Honda AEP uses fixed head monitoring devices to detect leaks and/or releases, uses grade-specified components, and replaces hardware based on manufacturer-suggested replacement intervals.\n\n\n\n-Regulated Substances Handled & Covered Process:\n\nThe Honda AEP uses one chemical that is subject to reporting under this filing to the U.S. Environmental Protection Agency (EPA). It is a necessary material used in the nitriding process to harden steel engine components.\n\n\n\n-Anhydrous Ammonia Process:\n\nLiquid anhydrous ammonia (metallurgical grade) is delivered to the site via tank wagons and stored in an onsite tank, limited per American National Standards Institute (ANSI)/Compressed Gas Association (CGA) G-2.1 Requirements for the Storage and Handling of Anhydrous Ammonia, to allow for sufficient vapor space in the tank. The nitriding process uses ammonia vapor, which is supplied from the headspace of the tank. If additional vapor is needed, ammonia is passed through a series of immersion heaters (vaporizers) where the liquid is vaporized into a gas. Through overhead piping, the ammonia vapor travels through a shutoff header stand and a flow meter stand prior to being introduced into each nitriding furnace. Due to the high operating temperature (1,110 degrees Fahrenheit), the ammonia dissociates into its components according to the following reaction:\n\n\n\n2 Anhydrous Ammonia -> 2 Nitrogen + 3 Hydrogen\n\n\n\nThe nitrogen combines with the alloying elements in the steel to form nitrides. The nitrides form at the steel surface as a hard chemical layer which will minimize wear and fatigue. The remaining component, hydrogen, (3H2) is burned off by the afterburner.\n\n\n\n<>The general accidental release prevention program and chemical-specific prevention steps [40 CFR 68.155(c)]:\n\n\n\nThe Honda AEP has implemented the Program Level 3 prevention program requirements under the RMP regulations. The required elements of the "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000082188,
      "SummaryText": "RMP prevention program are listed below:\n\n\n\n -Employee Participation\n\n -Process Safety Information\n\n -Process Hazard Analysis\n\n -Operating Procedures\n\n -Training\n\n -Contractors\n\n -Pre-startup Safety Review\n\n -Mechanical Integrity\n\n -Hot Work Permit\n\n -Management of Change\n\n -Incident Investigation\n\n -Compliance Audits\n\n\n\nIn addition, the facility meets the requirements of the RMP Emergency Planning and Response element as detailed below. These items, their specific requirements, and how Honda AEP complies with the requirements are addressed in the individual procedural documents.\n\n\n\nIn addition to being subject to the RMP requirements, the anhydrous ammonia process at Honda AEP is subject to and complies with the OSHA Process Safety Management (PSM) standard. Honda AEP has implemented the PSM standard, including response training, mechanical integrity and chemical monitoring devices to maintain high levels of compliance and prevent accidental releases. Monitoring systems have built in backup systems to ensure fail-safe operation/detection and therefore are highly reliable. The plant has appropriate material/equipment to control or stabilize process leaks and releases. The AEP emergency response team conducts annual training regarding chemical specific response scenarios and maintains chemical specific response equipment. As a result, no significant accidental releases have occurred over the life of the various processes regulated by the PSM standard.\n\n\n\n<>The five-year accident history [40 CFR 68.155(d)]:\n\n\n\nHonda AEP has had zero RMP reportable incidents in the previous five years.\n\n\n\n<>The emergency response program [40 CFR 68.155(e)]:\n\n\n\nHonda has developed a company-wide Emergency Response Plan (ERP), which explains Honda's commitment to emergency response. This plan describes the responsibility and procedures of Honda personnel and establishes a system in which the members of each plant's emergency response team work with local emergency response organizations."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000082188,
      "SummaryText": " This company-wide plan also serves as a model upon which the Honda/AEP emergency response team has based its own Honda AEP-specific ERP. The Honda AEP plan outlines how the Honda AEP emergency response team is to work closely with the Anna Fire Department, the Shelby County Hazmat Team, and the Emergency Management Agency to promptly respond to any emergency.\n\n\n\nIn the event of an incident, Honda AEP has systems to respond quickly. Processes can be shut down on an emergency basis. Spills or leaks can be detected and reported quickly, allowing for rapid implementation of the necessary steps of the Honda AEP ERP. \n\n\n\nThe Honda AEP Emergency Response Team (ERT) meets annually with the Village of Anna Fire Chief and Members of its response team to review operations at the plant. The Honda AEP Emergency Response Team targets to have 12 to 15 associates on each of the three production shifts. The members are volunteers who work full-time in their respective production departments. There are 3 full-time emergency response staff members, one for each shift, with one (on a rotating basis) on call 24 hours a day, who are responsible for leadership and coordination of team members. Each emergency response team member must meet Fire Fighter Level I state requirements as defined in Section 1001 of the National Fire Prevention Association (NFPA) manual and must attend quarterly training classes and drills. Training is provided on-site by an outside training contractor in accordance with NFPA, Section 600 requirements. Additionally, the emergency response team targets to have 5 to 10 members on each shift trained to the Hazmat Technician level as defined in OSHA Section 1910.120 requirements.\n\n\n\nThe emergency response team members are activated by procedures identified in the Honda AEP ERP. If plant security, which covers the plant switchboard 24 hours a day, receives an emergency call, they are trained to activate the alarm system and alert the emergency response pagers. The res"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000082188,
      "SummaryText": "ponse team will be activated and respond using procedures identified in the response plan. Outside agencies are activated by plant security by dialing 911 in the event that the response team requests their assistance or if the response team is not available to respond at full strength. Public notification of a release will be handled jointly by the Shelby County LEPC and Sheriff's Office. The AEP ERP is reviewed annually with the local Emergency Management Agency, the Village of Anna Fire Department, the Shelby County LEPC, and the Shelby County Sheriff's Office.\n\n\n\n<>Planned changes to improve safety [40 CFR 68.155(f)]:\n\n\n\nThe Honda AEP is committed to improving our safety systems and, through its continuous improvement process, is constantly seeking methods to improve safety throughout the operation. Recommendations from Process Hazard Analysis, Incident Investigations (including near miss) and Compliance Audits are reviewed and implemented as appropriate to further improve safety conditions at the facility and for our surrounding community."
    }
  ]
}