{
  "FacilityID": 1000027978,
  "FacilityName": "Robert B. Diemer Water Treatment Plant",
  "FacilityStr1": "3972 Valley View Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Yorba Linda",
  "FacilityState": "CA",
  "FacilityZipCode": "92886",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06059",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.911306",
  "FacilityLongDecDegs": "-117.817083",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.mwdh2o.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Metropolitan Water District of Southern California",
  "Company2Name": null,
  "CompanyDUNS": 63842975,
  "Company2DUNS": null,
  "OperatorName": "Metropolitan Water District of SC",
  "OperatorStr1": "700 North Alameda Street",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90012",
  "OperatorZipCodeExt": null,
  "FTE": 90,
  "OtherEPAFacilityID": "CAD981425713",
  "EPAFacilityID": "100000132723",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-09-14 00:00:00",
  "SafetyInspectionBy": "Orange County Fire Authority",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-05-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-05-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-05-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-05-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 33.911306,
  "FRS_Long": -117.817083,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034111,
      "AltID": "Chlorine Cont.t System",
      "FacilityID": 1000027978,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041236,
          "ProcessID": 1000034111,
          "ChemicalID": 62,
          "Quantity": 210000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000034397,
          "ProcessID": 1000034111,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000029807,
              "Process_NAICS_ID": 1000034397,
              "SafetyReviewDate": "2012-04-20 00:00:00",
              "PHA_Date": "2013-04-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-04-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "High Winds and other external events",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Remote Shutoff of Liquid Chlorine Valves",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Video cameras for chlorine storage and process area.  Door alarms.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-12-15 00:00:00",
              "TrainingReviewDate": "2011-12-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-01-19 00:00:00",
              "EquipmentInspectionDate": "2012-04-26 00:00:00",
              "EquipmentTested": "Vacuum Regulator Vent Lines",
              "ChangeMgmtDate": "2011-05-17 00:00:00",
              "ChangeMgmtReviewDate": "2012-04-23 00:00:00",
              "PreStartupReviewDate": "2011-09-06 00:00:00",
              "ComplianceAuditDate": "2011-11-30 00:00:00",
              "AuditCompletionDate": "2012-11-30 00:00:00",
              "IncidentInvestigationDate": "2012-04-18 00:00:00",
              "InvestigationChangeDate": "2012-04-24 00:00:00",
              "ParticipationPlansReviewDate": "2012-05-02 00:00:00",
              "HotWorkPermitReviewDate": "2010-10-01 00:00:00",
              "ContractorSafetyReviewDate": "2011-09-07 00:00:00",
              "ContractorSafetyEvalDate": "2010-10-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000035553,
                  "PreventionProgram3ID": 1000029807,
                  "ProcessChemicalID": 1000041236
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000027978,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2006-12-01 00:00:00",
    "ERTrainingDate": "2012-03-27 00:00:00",
    "CoordinatingAgencyName": "Orange County Fire Authority",
    "CoordinatingAgencyPhone": "7148547544",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000027978,
      "SummaryText": "nnected to uninterruptible power supply (UPS) system.  In the event power is lost at the chlorination facility, an alarm will alert the control room and activate an emergency generator system, which provides backup power to run the water treatment plant.\r\n\r\n\tThe ammonia system consists of three ammonia bulk storage tanks, an ammonia containment tank, eight ammonia absorbers, two small filters, two feed pumps, one transfer pump, and a secondary containment system (dike), including a sump.  The bulk storage tanks will store ammonia during normal operation, while the containment tank is used in case of an emergency (transfer of aqueous ammonia from the sump and the containment area).  All four tanks are ASME rated at 40 psig.  Each bulk storage tank has an overflow line from the top of the tank piped to the containment sump through a drain funnel.  All tanks have a vacuum relief valve and a two-unit pressure relief system.  The pressure relief valve low range (self-contained) unit is set at 25 psig, while the high range (pilot activated) unit is set at 28 psig.  The vacuum-relief valve is set at 1.0psig.  The low range pressure relief valve is vented to the absorbers and the high range pressure relief valve is connected to the overflow line. There are a total of 8 ammonia absorbers, two for each of the three storage tanks and two are shared by the containment tank and the sump. \r\n\r\n\tEach of the bulk storage tanks, the containment tank, and the sump have ultrasonic-type level sensors to continuously monitor aqueous ammonia levels, and high and low level alarms.  The sump also has two ammonia vapor detection sensors.  When a high or low aqueous ammonia level in the tanks is detected or an ammonia vapor leak in the sump is detected, alarm signals are sent to the computer in the control room.\r\n\r\n\tAqueous ammonia is withdrawn from the bulk storage tanks through filters by the feed pumps until it reaches the injection point.  Aqueous ammonia is injected directly into the wat"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000027978,
      "SummaryText": "EXECUTIVE SUMMARY\r\nThe Metropolitan Water District of Southern California (MWDSC) distributes drinking water to member water agencies throughout Southern California. MWDSC provides approximately 60 percent of the drinking water used by nearly 16 million people living on the southern California coastal plain between Ventura County and the Mexican border.\r\n\r\nDisinfection is a critical process used by MWDSC in the treatment of its drinking water.  Disinfection helps to protect public health by killing pathogens in the water and preventing the spread of waterborne diseases.  The use of chlorine as a disinfectant in the treatment of drinking water and wastewater has been the dominant disinfection method in the United States since it was introduced, around the beginning of this century.  MWDSC currently utilizes bulk chlorine for disinfection at all of its water treatment plants, including the Robert B. Diemer Water Treatment Plant (Diemer Plant).\r\n\r\nAs one might expect from its superior disinfection properties, chlorine is a hazardous substance.  Thus, storing and handling chlorine can present a risk to employees and the public without proper precautions.  MWDSC regards safe practices in the storing and usage of chlorine to be of primary importance and has an excellent safety record with chlorine.\r\n\r\nDiemer Plant's chlorine storage and usage process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program Rule (RMPR) and also to the California Accidental Release Prevention (CalARP) Program regulation.  Both of these regulations require submission of a Risk Management Plan (RMP).  An integral part of the RMP is a summary of policies and procedures followed to safely operate the facility, including a description of the possible consequences in case of an accident and the actions, which will be taken, by the facility in an emergency.\r\n\r\nThe Diemer Plant also stores and handles 19.5 percent concentration aqueous ammonia in amounts exceeding the Ca"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000027978,
      "SummaryText": "lARP Program threshold for a Table 3 (California only) regulated substance.  Ammonia is used at the Diemer Plant to convert free chlorine to monochloramines in the drinking water disinfection process.  It should be noted that aqueous ammonia of concentration less than 20 percent is not one of the regulated toxic substances listed in the RMPR.  Thus, aqueous ammonia is not subject to RMPR.  It has also been determined that the ammonia facility qualifies as a Program 1 process under the CalARP regulation.\r\n\r\nThe following information is specifically required in the RMP Executive Summary:\r\n\tAccidental release prevention and emergency response policies.\r\n\tGeneral facility and regulated substances information.\r\n\tSummary of the accidental release prevention program and chemical-specific prevention steps.\r\n\tFive-year accident history summary.\r\n\tEmergency response program summary.\r\n\tPlanned changes to improve safety.\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe MWDSC accidental release prevention policy for chlorine and aqueous ammonia involves a unified approach that integrates proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable CalARP and RMPR Prevention Program requirements are adhered to, including key elements such as training, systems management, and emergency response procedures.\r\n\r\nThe MWDSC emergency response policy for hazardous materials, including chlorine and aqueous ammonia, involves the preparation of integrated contingency plans, which address emergency response for hazardous materials and are tailored to each facility.  These plans integrate with the emergency response services available in the community and are in compliance with the RMPR and CalARP Program Emergency Response Program Requirements.  Diemer Plant has prepared an Emergency Response Plan for Hazardous Materials to facilitate coordination and emergency planning with offsite res"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000027978,
      "SummaryText": "ponse officials and facilities in the event of an emergency.  This emergency response plan includes the containment and scrubbing system and is coordinated with local response agencies (Orange County Fire Authority and Anaheim Fire Department).  Diemer Plant has had an excellent safety record of chlorine use.\r\n\r\nGeneral Facility and Regulated Substance Information\r\n\r\nThe Diemer Plant is located at 3972 Valley View Avenue in Yorba Linda, California.  The plant is situated north of the State Highway 91, and just east of State Highway 57 covering 200 acres.  The plant is designed to treat drinking water, including disinfection with chlorine.  The facility stores and uses chlorine, a regulated toxic substance under the RMPR and CalARP Program rules, as well as the California Occupational Safety and Health Administration (Cal/OSHA) Process Safety Management (PSM) Standard.  \r\n\r\nThe chlorine storage and feed system at the Diemer Plant is located inside the Chlorine Containment Building and treatment plant tunnels.  Chlorine leak detectors are provided at various locations in the Chlorine Containment Building and pipe tunnels.  Based on the concentration and location of chlorine detected, the leak detection system will activate a succession of safety measures, beginning with visual and audible alarms, then automatic start-up of the chlorine neutralization system and shutdown of the normal ventilation system, and, finally, automatically closing supply valves.  A packed-bed chlorine gas scrubber system, consisting of two parallel scrubber units, is provided to neutralize an accidental release of chlorine gas from either chlorine storage bay, evaporator room, or the chlorinator room.  Caustic soda (20%) is used as the scrubbing media.  Emergency showers and eye wash stations are also provided throughout the chlorination facility and beside the scrubber system.\r\n\r\nThe chlorine pressure reducing valves, vacuum regulator valves, leak detectors, and computer control system are co"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000027978,
      "SummaryText": "er at a predetermined rate, depending on the plant flow and the required dosage.  Aqueous ammonia is injected through two lines, each with a backpressure valve and a metering device.\r\n\r\nThe control room at the plant is manned 24 hours a day, year round to monitor all treatment operations via security cameras and computer control systems.  Access to the plant is through guarded security gates, which are closed after regular hours.  In addition, access into the chlorine storage and containment facility is limited by strict procedures and secured after normal business hours.\r\n\r\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n\r\nDiemer Plant complies with Federal and State Process Safety Management (PSM) requirements.  Diemer Plant accidental release prevention program is based on the following key elements:\r\n\tDetailed management system and clear levels of responsibilities and team member roles.\r\n\tComprehensive process safety information that is readily available to staff, emergency responders, and contractors.\r\n\tComprehensive preventive maintenance program.\r\n\tPerformance of process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\r\n\tUse of state-of-the-art process and safety equipment.\r\n\tUse of accurate and effective operating procedures, written with the participation of the operators.\r\n\tHigh level of training of the operators and maintenance staff.\r\n\tImplementation of an incident investigation, inspection, and auditing program using qualified staff.\r\n\r\nChemical-specific prevention steps include a chlorine containment and automated scrubbing system to capture and neutralize a chlorine release, availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine supply, awareness of the hazardous and toxic properties of chlorine, presence of chlorine detectors and alarms, and an automatic shutoff device on the chlo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000027978,
      "SummaryText": "rine storage vessel that may be activated during a release for almost instantaneous shutoff of the supply source.\r\n\r\nProcess and Chemical Safety Information\r\n\r\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine. This information includes chlorine background information and MSDS sheets.\r\n\r\nEquipment safety information was meticulously compiled on the chlorine process.  Specifications for chlorine process are collected and provided in one place for easy reference.  Details such as maximum intended inventory; safe upper and lower temperatures; safe upper and lower pressures; and codes and standards used to design, build, and operate the processes are on file at the facility.  Diemer Plant also has procedures in place that are triggered to update process safety information if there is a major change that makes existing information inaccurate.\r\n\r\nProcess Hazard Analysis\r\n\r\nIn 1992, 1995, 1998, 2000, 2002, 2007 and 2012, detailed process hazard analyses (PHAs) were conducted for the chlorination system equipment and procedures.  A list of recommended actions was developed in each PHA to further improve the chlorine safety and all the recommendations have been resolved.\r\n\r\nA seismic walkthrough of the new chlorination facility was completed in March 2012 based on Region 1 LEPC CalARP Guidance. \r\n\r\nOperating Procedures\r\n\r\nDiemer Plant maintains up-to-date, accurate, written operating procedures that provide clear instructions for the chlorine process.  The Diemer Plant ensures effective operating practices by combining them with operating and maintenance training programs.   Standard operating procedures (SOPS) provide system descriptions, specifications, equipment inspection requirements, and operating procedures for the chlorine system.  The operating procedures include connection/disconnection for chlorine cargo tank tr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000027978,
      "SummaryText": "ailer, start-up and shutdown for chlorine evaporators, after maintenance start-up for chlorine evaporators, maintenance shutdown for chlorine evaporators, start-up and shutdown for ejectors, start-up and shutdown for chlorinators, start-up and shutdown of chlorine scrubber, chlorine system emergency shutdown, start-up following an emergency shutdown, and temporary operations.  Also included are the maintenance and troubleshooting procedures, including consequences of deviation and the steps to correct or avoid deviations.  Diemer Plant updates procedures whenever a change occurs that alters the steps needed to operate safely, in addition to the SOP annual review and certification.  Such an update and re-certification of operating procedures took place to incorporate changes in chlorine operations associated with the chlorine containment and scrubbing system. Operating procedures will be developed and put in place prior to any new process equipment coming on line or changes made in the handling of chlorine equipment, and reconfiguration of the facilities.\r\n\r\nTraining\r\n\r\nDiemer Plant employees presently involved in operating or maintaining the chlorine process are trained in an overview of the process and detailed applicable operating and maintenance procedures.  Diemer Plant ensures that each employee newly assigned to the process, is trained and tested to be competent in the operating procedures listed pertaining to their duties.  Diemer Plant training program includes four elements: \r\n1.\tInitial training and awareness training,\r\n2.\tRefresher training,\r\n3.\tDocumentation, and\r\n4.\tTesting. \r\n\r\nEach employee presently involved in operating the chlorine process has been trained to receive the required knowledge, skills, and abilities to safely carry out the duties and responsibilities, including chlorine emergency response, as provided in the operating procedures.\r\n\r\nRefresher training is provided every three years or less to each employee operating the covered process"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000027978,
      "SummaryText": "to ensure that the employee understands and adheres to the current operating procedures.  In addition, the Diemer Plant ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change as indicated in their Management of Change and/or Pre Startup Safety Review procedures.  \r\n\r\nDiemer Plant prepares and retains records of initial and refresher training, which includes the identity of the employee, the date of training, and the signature of the \r\nperson(s) administering the training.\r\n\r\nContractors\r\n\r\nDiemer Plant has procedures and policies in place that ensure that the contractors are properly informed of the hazards, access limitations to these process areas, and emergency response procedures, and are prepared to safely complete the work.  The contractors are informed, prior to the initiation of the work at the site, of the applicable provisions of the emergency response plan.  Diemer Plant holds contractor safety briefings before allowing them near or in the process area; controls access to the process areas, and evaluate the contractor's safety performance.\r\n\r\nPre-Startup Safety Review and Mechanical Integrity Program\r\n\r\nDiemer Plant ensures that a pre-startup safety review is completed for any new process covered by this regulation, or for significant modifications to an existing covered process that requires a change in the process safety information.  Diemer Plant maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  Diemer Plant mechanical integrity program includes the following:\r\n-\tWritten procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes and practice, and prior operating experience.\r\n-\tImplementation of the written procedures by performing inspections and tests on process equipment at specified int"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000027978,
      "SummaryText": "ervals.\r\n-\tTraining of maintenance personnel in preventive maintenance program procedures; safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions; and safe use and application of special equipment and/or unique tools.\r\n\r\nHot Work Permits and Management of Change\r\n\r\nDiemer Plant requires employees and contractors to employ safe work practices when performing hot work in, on, or around the covered process. Diemer Plant uses a permitting and training program to ensure hot work is monitored and conducted safely on or near a process involving chlorine.\r\n\r\nDiemer Plant provides a system and approach to maintain and implement any management of change or modifications to equipment, procedures, chemicals, and processing conditions. This system allows Diemer Plant staff to identify and review safety hazards or provide additional safety, process, or chemical information to existing data before the proposed change would either compromise system safety or need training to be completed.\r\n\r\nInternal Compliance Audits\r\n\r\nInternal compliance audits are conducted every 3 years to verity compliance with the programs and procedures contained in the RMP.  The Diemer Plant assembles an audit team that includes personnel knowledgeable in the Risk Management Program rule and in the process.  This team evaluates whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations resolved, and appropriate enhancements to the prevention program are implemented.\r\n\r\nIncident Investigation\r\n\r\nDiemer Plant investigates all incidents that could reasonably have resulted in a catastrophic release (serious injury to personnel, the public, or the environment) so that similar accidents can be prevented.  An investigation team is assembled and the investigation"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000027978,
      "SummaryText": "is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff and added or used to revise operating and maintenance procedures.\r\n\r\nFive-year Accident History Summary\r\n\r\nNo chlorine releases that could have caused safety or health hazard (deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the Diemer Plant during the last five years.\r\n\r\nEmergency Response Program Summary\r\n\r\nDiemer Plant has Operational Level HAZWOPER-trained plant employees who will respond to emergency chlorine releases with defensive actions, such as assessing or securing equipment.  Diemer Plant also includes employees trained in Incident Command system.  Depending on the severity of the accidental release, external hazardous materials response agencies, such as Orange County Fire Authority and Anaheim Fire Department will be called to handle a chlorine release.  Diemer Plant coordinates with local response agencies (Orange County Fire Authority and Anaheim Fire Department) to help ensure that they are familiar with the Diemer Plant chemical systems and its emergency response requirements and that it is reflected in their Area Plans. Specially trained Diemer Plant employees will be available during such an emergency to provide technical support to fire department responders.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nNumerous changes to improve safety (recommended actions) were previously identified for the chlorine process in 1992, 1995, 1998, 2000, 2002, and 2007, when Process Hazard Analyses (PHAs) conducted under the California Risk Management and Prevention Program (RMPP), Process Safety Management (PSM) Program and Risk Management Program were prepared for the facility.  These recommended actions have been evaluated and implemented, as required.  Additional"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000027978,
      "SummaryText": "changes to improve chlorine safety were identified in April 2012, when the 2007 RMP process hazard analysis was revalidated.  It is expected that these recommended actions will be evaluated and implemented in a timely fashion."
    }
  ]
}