{
  "FacilityID": 1000057724,
  "FacilityName": "Franklin International - Polymer Division",
  "FacilityStr1": "2020 Bruck Street",
  "FacilityStr2": null,
  "FacilityCity": "Columbus",
  "FacilityState": "OH",
  "FacilityZipCode": "43207",
  "Facility4DigitZipExt": "2382",
  "FacilityCountyFIPS": "39049",
  "LEPC": "Franklin County LEPC",
  "FacilityLatDecDegs": "39.922222",
  "FacilityLongDecDegs": "-082.991111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "PG",
  "FacilityURL": "www.franklininternational.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4280590,
  "ParentCompanyName": "Franklin International Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Franklin International",
  "OperatorStr1": "2020 Bruck Street",
  "OperatorStr2": null,
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43207",
  "OperatorZipCodeExt": "2382",
  "RMPContact": "Timothy J. Sainey",
  "RMPTitle": "PSM Coordinator",
  "FTE": 395,
  "OtherEPAFacilityID": "43207FRNKL20208",
  "EPAFacilityID": "100000072431",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "P0118183",
  "SafetyInspectionDate": "2016-05-03 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-08-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-08-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-08-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-08-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.92223,
  "FRS_Long": -82.9896,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000072132,
      "AltID": "Polymer - VAC reactors",
      "FacilityID": 1000057724,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000073314,
          "ProcessID": 1000072132,
          "NAICSCode": "32552",
          "_desc": {
            "NAICS_CODE": "32552",
            "NAICS_DESCRIPTION": "Adhesive Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000089059,
          "ProcessID": 1000072132,
          "ChemicalID": 29,
          "Quantity": 2100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000589059,
          "ProcessID": 1000072132,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057724,
      "SummaryText": " EXECUTIVE SUMMARY\n\n\n\nFranklin International is dedicated to protecting the well-being of our employees, neighbors, customers and the environment.  Our Environmental, Health and Safety Policy states:\n\n\n\nWe will comply with the letter and the spirit of the laws applicable to our processes and products, as well as meet or exceed other accepted standards.\n\nWe will continually work with our employees, suppliers, customers and neighbors to evaluate and improve our processes, products and services to prevent accidents, incidents and pollution.\n\nWe will establish goals, objectives and targets for environmental, health and safety performance which ensure compliance with the applicable laws and other accepted standards as well as support Franklin's corporate goals for accident/incident prevention and waste reduction and product safety.  \n\nWe will review and, where appropriate, revise these goals, objectives and targets on a regular basis to ensure that Franklin's environmental, health and safety performance is continually improving.\n\nWe will make every effort to address environmental, health and safety concerns associated with our raw materials, products, intermediates and processes.  Franklin believes that our responsibilities to our employees, contractors, vendors, neighbors and customers extend far beyond the facility boundaries.\n\nWe will communicate this policy by posting in the workplace and in the lobby, and through regularly scheduled safety training meetings with our employees. \n\n\n\nFranklin International is an adhesives and sealant manufacturer with its headquarters, research laboratories, and primary manufacturing facilities located in Columbus, Ohio.  There are four separate divisions at the Bruck street site comprising approximately 180,000 square feet of building on fourteen and one half acres.\n\n\n\nVinyl Acetate monomer utilized only in one division as a major ingredient in the production of the polymer suspension used in many of our products.  Vinyl Acetate monom"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057724,
      "SummaryText": "er is listed on Environmental Protection Agency's (EPA) toxic substance list because of its ability, at certain concentrations, to form toxic vapors in air.  Franklin has taken several measures to prevent public exposure to these vapors.  The raw material is shipped in liquid form and is transferred to underground storage tanks per Department of Transportation (D.O.T.) regulations.  The transfer equipment uses a closed loop system with vapor recovery devices, which minimize the discharge of hazardous vapors to the air.  In addition, Franklin personnel are required to be in the immediate area supervising the unloading of each shipment and are trained in proper unloading procedures and emergency procedures.  As a further precaution the manufacturer places a chemical inhibitor in the vinyl acetate to ensure that an unwanted chemical reaction does not occur.  Vinyl Acetate is transported through closed piping systems to the various process vessels in the facility.  Mechanical systems on the transfer pumps limit the amount of material that would be released in the event of a piping failure.\n\n\n\nIn order to prevent serious release of a hazardous chemical, Franklin International maintains a proactive approach to environmental, health and safety.  Upholding the safety and health of our team members, customers, and neighbors in the community is among our eight corporate values.  Our facility complies with the Occupational Safety and Health Administration's Process Safety Management standard and our employees undergo extensive training to prepare them for the hazards of the chemicals they work with. \n\n\n\nFranklin utilizes detailed operating procedures and checklists to ensure the safe operation of all process equipment on site.  Where feasible, process controls and interlocks are used to prevent accidental releases.  Our management of change and mechanical integrity programs verify that our equipment is operating safely.  Our operators are trained and recertified every three ye"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057724,
      "SummaryText": "ars and our operating procedures are reviewed annually.  We have had no accidental releases of Vinyl Acetate, as defined by EPA's Risk Management Program, and this can be attributed to the safety programs we have in place.\n\n\n\nFranklin International will assess if the response to hazardous material release can be handled by Franklin employees.  As a backup, Franklin has contracted with an outside firm who is capable of responding to large chemical releases.  In addition, we have coordinated with local emergency response units and share information about our facility layout and hazardous chemicals on site with them on a regular basis.  We periodically conduct evacuation drills to maintain a high level of awareness among our employees.  All Franklin personnel receive yearly training on safe operating practices and emergency procedures.\n\n\n\nIn summary, Franklin International is dedicated to providing a safe environment not only for our employees but also for our neighbors in the community.  Capital funds are appropriated every year to strengthen our health, safety and environmental programs and implement continuous improvement projects and process hazard analysis recommendations.  In the process of complying with our federal air permits, we monitor our process emissions to protect the environment.  Franklin is committed to addressing any concerns in a timely manner, and maintains communication with the community through local citizen groups."
    }
  ]
}