{
  "FacilityID": 1000000843,
  "FacilityName": "Smyrna Water Treatment Plant",
  "FacilityStr1": "156 Sharp Springs Road",
  "FacilityStr2": null,
  "FacilityCity": "Smyrna",
  "FacilityState": "TN",
  "FacilityZipCode": "37167",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47149",
  "LEPC": "Rutherford County LEPC",
  "FacilityLatDecDegs": "35.998056",
  "FacilityLongDecDegs": "-086.479722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.townofsmyrna.org",
  "FacilityEmailAddress": "kevin.relford@townofsmyrna.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Town of Smyrna",
  "Company2Name": "Smyrna Water System",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Town of Smyrna",
  "OperatorStr1": "156 Sharp Springs Road",
  "OperatorStr2": "315 South Lowry Street",
  "OperatorCity": "Smyrna",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37167",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kevin Relford",
  "RMPTitle": "Manager, Water Treatment Plant",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000015869",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-10-18 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-07-02 00:00:00",
  "DeRegistrationEffectiveDate": "2012-06-04 00:00:00",
  "AnniversaryDate": "2014-05-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.99576,
  "FRS_Long": -86.48045,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001030,
      "AltID": "Disinfection",
      "FacilityID": 1000000843,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001110,
          "ProcessID": 1000001030,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001084,
          "ProcessID": 1000001030,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501084,
          "ProcessID": 1000001030,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000843,
      "SummaryText": "\n\n\n\nExecutive Summary\nTown of Smyrna Water Treatment Plant\n\n\nThe accidental release prevention and emergency response policies at our facility:\n\nThe Town of Smyrna Water Treatment Plant is committed to the use of safe procedures and prevention of chemical releases. Our Emergency Action Plan applies to the use of chlorine in the water treatment process at the Town of Smyrna Water Treatment Plant.  The purpose of the plan is to aid the Town of Smyrna in its efforts to prevent or mitigate episodic releases of chlorine that could result in the catastrophic loss of personnel and property within the facility and possibly the surrounding community.\n\nOur facility, the Smyrna Water Treatment Plant, utilizes chlorine as its primary disinfectant in the process of treating drinking water.  The building is enclosed and with the only possible leaks occurring at the cylinder.  The room has constant video monitoring and a chlorine scrubber along with constant air monitoring of the room for chlorine.  This chlorine monitor activates the scrubber and sounds an audible alarm and sets off alarm lighting.\n\nChlorine has physical properties and health hazards that would present immediate danger to life and health (IDLH) conditions in the event of an uncontrolled gas release.  The following section consists of a review of the inherent physical and health hazards associated with chlorine for emergency response personnel.\n\nPhysical Properties\n\na.    At room temperatures, chlorine is a gas.\nb.    If chlorine is cooled to 29.3 degrees F, it becomes an amber color liquid.  It is usually shipped as a liquid in order to save space.\nc.    If liquid chlorine escapes from a container it will usually be boiling and convert to a greenish-yellow color gas.\nd.    It has an irritating odor (bleach) and is 2 A? times heavier than air, so it will usually gather low to the ground.\ne.    Chlorine is soluble in water, but reacts with water to form hydrochloric acid, which is highly corrosive.\nf.    NFPA has assigned a hazard r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000843,
      "SummaryText": "ating for chlorine of:\nHealth A? 3      Flammability A? 0      Reactivity A? 0      Special Hazard A? Oxidizer\n\nHealth Hazards\n\na.    The minimum detectable odor level of chlorine for most individuals is 0.3 ppm.  Chlorine will cause irritation of the upper respiratory system and mucus membranes at 3 A? 6 ppm.\nb.    The TOSHA permissible exposure limit for chlorine is represented by a ceiling value of 1 ppm.  NIOSH assigned an IDLH value of 10 ppm for acute chlorine exposure.\nc.    Exposure to exposed skin or eyes can cause serious frostbite burns.\nd.    Inhalation of chlorine gas can lead to adverse acute health effects including:  irritation of the upper respiratory system, violent coughing, choking, nausea, dizziness, headache, vomiting, chest pains, shortness of breath and pulmonary edema.\n\nWorst Case Scenario:  Chlorine is dropped during loading/unloading/handling, resulting in the rupturing of the cylinder or valve stem and the uncontrolled release of the contents of the cylinder.  In the event of a fire in or near the chlorine room that may cause the fusible plug to melt in the cylinder or from a faulty fusible plug.\n \nAlternate Scenario:  The yoke on the cylinder valve is defective, malfunctions or is improperly installed onto a chlorine cylinder, resulting in the limited yet uncontrolled release of gas from the cylinder.  The valve packing leaks from a defective chlorine cylinder resulting in the limited yet uncontrolled release of gas.  The yoke is not properly set and tightened on the cylinder valve.  The yoke was not properly cleaned with the wire brush prior to installing the washer.\n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\nFive year accident history:  We have only had very small releases that are common when changing chlorine cylinders.  We follow a very strong maintenance program to change out all hoses, fittings and seals to reduce the risk of equipment failure.  No one on-site or off-site has been injured and t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000843,
      "SummaryText": "here has no damage to property.\n\nThe Emergency Response Program Chlorine Release Hazard Control Measures:  Engineering controls, administrative controls and personal protective equipment are used to mitigate the hazards associated with the release of chlorine gas.  These hazard control measures were developed and implemented to increase the effectiveness of the emergency response actions and protect emergency response personnel and the public.\n\nEngineering Controls\n    \nA?    Fixed Chlorine Monitor\n\no    The fixed chlorine monitors are located in the chlorine cylinder storage room and chlorine feed room.  The monitors will detect chlorine at 0 to 5 ppm.  The chlorine monitors are connected to the SCADA system to obtain constant readings from the control room.\n\nA?    Personal Chlorine Monitor\n\no    Portable personal monitors for chlorine are available for use during response to gas release episodes.  The monitors will provide quantification of gas contaminant levels which can be utilized to determine the type of personal protective equipment deemed necessary and zones for evacuation purposes.\n\nA?    Ammonia Solution Leak Testing\n\no    Use an ammonia solution to check for leaks within the chlorine process piping or valves.  This is done by discharging ammonia vapor in the area of a suspected leak.  If a chlorine gas leak is present, a whitish cloud will form.\n\nA?    Emergency A?BA? Kit\n\no    An Emergency A?BA? kit contains devices to stop leaks at the valves, fusible plugs and in the wall of one-ton cylinders.  This kit is located outside the chlorine room.\n\nAdministrative Controls\n\nA?    Training of Emergency Response Team Members\n\no    Emergency Response Team Members will receive 24 hours of Hazardous Materials Technician training, which fully complies with the requirements of TOSHA 1910.120 (q) (6) (iii).  The training provides classroom instruction, demonstrations and hands-on application of appropriate response actions for anticipated chlorine release episodes.\n\nA?    Process Safety Management Trai"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000843,
      "SummaryText": "ning\n\no    Facility personnel handling chlorine cylinders, performing maintenance on the chlorine system and operating the system are involved in the Smyrna Water Treatment Plant PSM program and receive training which fully complies with the requirements of TOSHA 1910.119 (g) (1).\n\nA?    Buddy System\n\no    Handling (loading/unloading) of cylinders and maintenance on the process system require the presence of a minimum of two workers at all times.\n\nA?    Daytime Cylinder Handling\n\no    Cylinders are only handled during the daytime.  This safeguard was implemented due to the potential for catastrophic consequences if a cylinder were to fall and rupture, and the difficulties which could be associated with attempting to respond to a potential catastrophic release of chlorine during the night time.\n\nA?    Process Safety Management program Manual\n\no    A site specific PSM Program Manual has been developed and implemented for the Smyrna Water Treatment Plant Facility.  The PSM Program manual provides identification and evaluation of potential chlorine release scenarios and a review of the safeguards in place to mitigate the catastrophic consequences of a chlorine release.\n\nPersonal Protective Equipment\n\nA?    Respiratory Protection Equipment\n\no    Respiratory protection equipment consists of eight Self-Contained Breathing Apparatus (SCBA) back pack units.  Two SCBAs are located at the High Service Pump Station.  Six are stored in a portable trailer which also is used as an Incident Command Post in the event of a release.  These SCBAs will be used in atmosphere containing in excess of 3 ppm.  Each employee of the Smyrna Water Treatment Plant is issued one SCOTT full-mask respirator with acid gas cartridges (suitable for chlorine up to 10 ppm) which will be used in atmospheres of 0ppm to 5ppm.\n\nPlanned changes to improve safety: Continue to provide training annually to personnel and practice repairs and chlorine safety.\n\nFuture Goals and Improvements\n\nThe Town of Smyrna Water Treatment Plant is curren"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000843,
      "SummaryText": "tly pursuing alternative methods of disinfection.  Through the expansion of the Water Treatment Plant, we look to replace the existing chlorine gas feed system with Sodium Hypochlorite (Bleach) on-site generation.  This will remove the threat of potential chlorine gas releases that could impact Plant staff, surrounding community and the environment.  The Town of Smyrna and the Water Treatment Plant staff look forward to the day when chlorine gas and the dangers that go along with it will be removed from the Plant for an overall safer community.\n\n                                                                                                                                                                                                                                                                                                                                                                                                                          \n"
    }
  ]
}