{
  "FacilityID": 1000050324,
  "FacilityName": "Agrium U.S. Inc. - Garner Terminal",
  "FacilityStr1": "2410 Vail Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Garner",
  "FacilityState": "IA",
  "FacilityZipCode": "50438",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19081",
  "LEPC": "North Central Regional LEPC",
  "FacilityLatDecDegs": "43.11371",
  "FacilityLongDecDegs": "-93.55604",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.nutrien.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Nutrien",
  "Company2Name": null,
  "CompanyDUNS": 808957229,
  "Company2DUNS": null,
  "OperatorName": "Agrium U.S. Inc.",
  "OperatorStr1": "2410 Vail Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Garner",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50438",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000148422",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-06-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-06-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-04-29 00:00:00",
  "DeRegistrationEffectiveDate": "2020-04-03 00:00:00",
  "AnniversaryDate": "2020-06-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.114078,
  "FRS_Long": -93.557063,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000063298,
      "AltID": "Wholesale Ammonia Sales",
      "FacilityID": 1000050324,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000078262,
          "ProcessID": 1000063298,
          "ChemicalID": 56,
          "Quantity": 330000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000064460,
          "ProcessID": 1000063298,
          "NAICSCode": "42491",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000052566,
              "Process_NAICS_ID": 1000064460,
              "SafetyReviewDate": "2017-09-25 00:00:00",
              "PHA_Date": "2019-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-08-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-03-12 00:00:00",
              "TrainingReviewDate": "2018-03-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-01-14 00:00:00",
              "EquipmentInspectionDate": "2015-04-01 00:00:00",
              "EquipmentTested": "LIT-1000 Level Transmitter on V-100",
              "ChangeMgmtDate": "2015-02-13 00:00:00",
              "ChangeMgmtReviewDate": "2015-05-28 00:00:00",
              "PreStartupReviewDate": "2015-06-03 00:00:00",
              "ComplianceAuditDate": "2015-06-09 00:00:00",
              "AuditCompletionDate": "2016-09-01 00:00:00",
              "IncidentInvestigationDate": "2015-04-16 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-01-23 00:00:00",
              "HotWorkPermitReviewDate": "2015-03-19 00:00:00",
              "ContractorSafetyReviewDate": "2013-08-05 00:00:00",
              "ContractorSafetyEvalDate": "2015-01-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000064590,
                  "PreventionProgram3ID": 1000052566,
                  "ProcessChemicalID": 1000078262
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000050324,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-05-13 00:00:00",
    "ERTrainingDate": "2014-09-10 00:00:00",
    "CoordinatingAgencyName": "North Central Region LEPC",
    "CoordinatingAgencyPhone": "6414243665",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050324,
      "SummaryText": "rules, Agrium implemented an RMP program at the Garner Terminal and submitted an RMP to EPA in 1999.  The Agrium's risk management program includes an offsite consequence analysis of a potential accidental release, a five-year accident history, a release prevention program, and an emergency response program.\r\n\r\nThe RMP rules required that the RMP be updated at least every five years.  Agrium is updating the RMP for the Garner Terminal to comply with the rules.  Five Year Accident History\r\n\r\nThe five-year accident history involves an examination of the effects of any accidental releases of anhydrous ammonia in the five years prior to the RMP update.  The five-year accident history covers:\r\n\r\n\t- the release of ammonia from Agrium's facility.\r\n\t- the release that caused at least one of the following:\r\n\t\t- On site deaths, injuries, or significant property damage (40 CFR\r\n\t\t  part 68.42(a)); or\r\n\t\t- known offsite deaths, injuries, property damage, environmental \r\n\t\t  damage, evacuations, or sheltering in place (40 CFR Part 68.42\r\n\t\t  (a)).\r\n\r\nDuring the last five years, the Garner Terminal has had no releases that caused death, injuries, property damage, or environmental damage either on or off site.\r\n\r\nRelease Prevention Program\r\n\r\nAgrium has a Release Prevention Program (RPP) in placed to prevent accidental releases of hazardous materials at this facility.  The RPP include:\r\n\r\n\tProcess Safety Information (PSI)\r\n\tAgrium has developed and will keep current working copies of the PSI including information pertaining to the hazards of the process, the technology of the process, and equipment of the process.  All employees are trained in the operation of the entire terminal and all contractors are given training before performing work in the terminal.  The PSI will enable the employees and contractors of Agrium to identify and understand the hazards posed by the process involving anhydrous ammonia.\r\n\t\r\n \tProcess Hazard Analysis (PHA)\r\n\tAgrium is committed to performing PHA"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050324,
      "SummaryText": "lated information to contractors, develop safe work practices related to contractors and periodically evaluate contractors.    \r\n\t\r\n\tEmployee Participation\r\n\tAgrium is committed to involving employees and their representatives on the conduct and development of PHA and on the development of the other elements of plant safety, process safety management, and risk management planning.  Agrium encourages employees to read, review and provide comments on all PSM/RMP documents.  \r\n\r\n\tHot Work Permits\r\n\tHot work is defined as work that could generate a flame, intense heat, or sparks as a result of electric or gas welding, cutting, blazing, abrasions or similar operations.  A permit is required in areas identified by the facility assessment.\r\n\r\nAgrium is committed to the implementation of the RPP to ensure safe operations of its plant and to prevent accident. \r\n\r\nEmergency Response Program\r\n\r\nAgrium is working closely with the local fire and LEPC in responding to emergency.  Agrium also keeps the fire department informed of any new hazardous materials that are introduced into the workplace.  The other outside agencies that will be involved in responding to emergencies at Agrium include the County Sheriff, Highway Patrol, local hospital, and outside contractors that are needed for such operations as containment, cleanup, material handling, etc.\r\n\r\nAll reportable releases of hazardous material will be reported immediately to the National Response Center, State Emergency response Commission, and the Local Emergency Planning Committee."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050324,
      "SummaryText": "Executive Summary\r\nAgrium U.S. Inc.\r\nGarner Terminal\r\n\r\nBackground\r\n\r\nAgrium U.S. Inc. Garner Terminal receives anhydrous ammonia from pipeline and dispenses anhydrous ammonia to tank trucks for fertilizer application.  Both of the transfer processes are accomplished with ammonia transfer pumps.  The Garner Terminal also stores liquid anhydrous ammonia in a pressure vessel within its facility.  \r\n\r\nThe liquid anhydrous ammonia stored in the pressure vessel is pressurized under atmospheric temperature.  The pressure vessel has a capacity of 165 tons.  As the results, the maximum amount of anhydrous ammonia that could be stored in the Garner Terminal is 155 tons.  \r\n\r\nRationale for Risk Management Program Development, Implementation, and Update\r\n\r\nThe 1990 Amendments to the Clean Air Act (CAA) require Environmental protection Agency EPA) to issue a rule specifying the type of actions to be taken by facilities to prevent accidental releases of substances into the atmosphere and reduce their potential impact on the public and the environment.  As the results of the 1990 Amendments, EPA issued the Chemical Accident Prevention Provisions (part 68 of Title 40 of the Code of Federal Regulations (CFR)) that requires affected facilities to develop and implement a risk management program.  The affected facilities include any facilities that handle, manufacture, store, or use above the specified threshold quantities of toxic substances in a process, including ammonia.  The threshold quantities for ammonia to trigger the development and implementation of a risk management program are 10,000 pounds.\r\n\r\nThe risk management program is designed to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that does occur. Since Agrium is handling more than 10,000 pounds of ammonia, it is required to develop and implement a risk management program.  To comply with the RMP"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050324,
      "SummaryText": "te office.  The leader of the incident investigation team is knowledgeable of the plant and have received formal training in incident investigation.  There were no incidents at the Garner Terminal for the last five years.\r\n\t\r\n\tCompliance Audit\r\n\tA compliance audit of the Agrium facility will be conducted at least every three (3) years to evaluate compliance of Agrium's process with the release prevention program (RPP).  The audit team will include one person knowledgeable in audit skills and techniques and team members with appropriate technical expertise.  \r\n\t\r\n\tManagement of Change (MOC)\r\n\tAgrium's MOC system was developed to ensure that changes at Agrium will not result in undetected unsafe situations and employees will be aware of all changes and their implications.  The Agrium's MOC system includes the following considerations before any changes take place:\r\n\t\r\n\t- the authorization requirements for the change.\r\n\t- the technical basis for the proposed change\r\n- the impact of the change on health and safety.\r\n- the necessary time for the change.\r\n- required modification to Operating Procedures.\r\n\t\r\n\tAfter changes are made, all employees will be informed about the change and training will be provided to the employees prior to startup of the modified process.  In addition, the PSI and OP will be updated to reflect the changes made.  \r\n\t\r\n\tPre-Startup Review (PSR)\r\n\tWhen change to the process is significant enough to require a change in safety information under the MOC, Agrium will conduct a PSR.  The PSR Team Leader will develop a checklist and assemble team of key personnel to go over every element on the checklist during the PSR.  All PSR team members will be knowledgeable about the process and trained in the area of change.    \r\n\t\r\n\tContractors\r\n\tAgrium has developed and implemented safe work practices to control the entrance, presence and exit of contract employees in the terminal.  It is Agrium's policy to select safe contractors, provide appropriate safety re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050324,
      "SummaryText": "to identify, evaluate, and control hazard associated with the Agrium's operations.  The PHA is to analyze the potential mishaps, identify the mishaps that could occur, analyze the likelihood that mishaps will occur, evaluate the consequence of these mishaps, and analyzed the likelihood that safety systems, mitigation systems, and emergency systems will function properly to eliminate or reduce the consequences of a mishap.\r\n\t\r\n\tThe PHA will be updated at least every five (5) years to assure that the PHA is consistent with the current process.   \r\n\t\r\n\tOperating Procedures (OPs)\r\n\tAgrium is committed to the development of OPs to assure safe work practices are maintained.  The OPs are reviewed after unsafe work practice occurs.  The unsafe work practice is investigated and the OPs will be revised to reflect the unsafe practices.  \r\n\t\r\n\tTraining\r\n\tAgrium is committed to provide its employee's comprehensive training to assure that the work force can perform their duties safely, efficiently, and effectively.  Each employee has a training file that keeps track of his training requirement.  \r\n\t\r\n\tMechanical Integrity (MI)\r\n\tAgrium has developed a written program of maintaining of the MI of process equipment at the Garner Terminal.  The MI program includes pressure vessels and storage tanks, piping systems and ancillary equipment, relief and vent systems and devices, emergency shutdown systems, controls, and pumps.  All equipment are inspected/tested at a frequency recommended by the manufacturer or applicable code or standard.  \r\n\t\r\n\tIncident Investigation\r\n\tAgrium has communicated to all of its employees that it is every employee's responsibility to report incidents and near misses to their immediate supervisor.  After an incident is reported, an incident investigation team which includes the employees involved in the incident will initiate an incident investigation.  The incident will also be input into a computer program celled \r\nIncidEnter that ties to the Agrium corpora"
    }
  ]
}