{
  "FacilityID": 1000028017,
  "FacilityName": "Braskem America Seadrift Operations",
  "FacilityStr1": "7501 St. Hwy 185 North, Bldg 101",
  "FacilityStr2": null,
  "FacilityCity": "Seadrift",
  "FacilityState": "TX",
  "FacilityZipCode": "77983",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48057",
  "LEPC": "Calhoun County LEPC",
  "FacilityLatDecDegs": "28.507778",
  "FacilityLongDecDegs": "-96.772778",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Braskem America, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 161669049,
  "Company2DUNS": 0,
  "OperatorName": "Braskem America, Inc.",
  "OperatorStr1": "P.O. Box 105",
  "OperatorStr2": null,
  "OperatorCity": "Port Lavaca",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77979",
  "OperatorZipCodeExt": "0105",
  "RMPContact": "Facility Manager",
  "RMPTitle": "Facility Manager",
  "FTE": 36,
  "OtherEPAFacilityID": "TXR000080502",
  "EPAFacilityID": "100000217204",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "TCEQ-O2025",
  "SafetyInspectionDate": "2011-08-23 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-06-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-06-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034164,
      "AltID": "Polypropylene Manufacture",
      "FacilityID": 1000028017,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000034447,
          "ProcessID": 1000034164,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041288,
          "ProcessID": 1000034164,
          "ChemicalID": 129,
          "Quantity": 82000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000041289,
          "ProcessID": 1000034164,
          "ChemicalID": 98,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000541288,
          "ProcessID": 1000034164,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000541289,
          "ProcessID": 1000034164,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028017,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies\n\n\n\nBraskem America Seadrift Operations is committed to operating and maintaining our polypropylene manufacturing process in a safe and responsible manner.  We have developed and implement programs to safeguard the safety of our employees, the public, and the environment.  Our programs not only satisfy applicable standards imposed by government agencies, such as those of the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standard and the Environmental Protection Agency's (EPA) Risk Management Program (RMP), but also adhere to Braskem America's corporate requirements.  We review and, as appropriate, update our Process Hazard Analysis periodically to ensure that process hazards are properly identified, understood, and adequately mitigated.  We also conduct other systematic internal evaluations to ensure the proper maintenance of policies and mitigation controls designed to prevent accidents and releases.  Primary responsibility for safe operation of the facility resides with the facility manager, but this responsibility is shared broadly with all employees through participation in safety related teams, projects, evaluations, and other activities, and through adherence to established policies and procedures.\n\n\n\n2. Description of Facility and Regulated Substances Handled\n\n\n\nBraskem America Seadrift Operations manufactures polypropylene.  Our final product is transported in railcars or trucks in the form of small pellets which are inert, non-toxic, non-hazardous, and do not burn readily.  Propylene is our primary raw material.  Propylene is flammable and potentially explosive if mixed with air in sufficient concentration, and has similar characteristics to propane.  The inventories of propylene and propane in our process are each above the RMP reporting threshold.  Inventories of other flammable materials in our process, such as methane, ethane, ethylene, and hydrogen "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028017,
      "SummaryText": "are below their respective EPA RMP reporting thresholds.\n\n\n\n3. General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nKey elements of Braskem America Seadrift Operations' accident prevention program include:\n\n\n\nEquipment Design:  Vessels (including shipping containers) and other process equipment are designed according to recognized industry standards and/or government requirements.\n\nProcess Safety Information:  Chemical hazard, process technology, and equipment information is documented, maintained up-to-date, and available to operating personnel.\n\nProcess Hazard Analysis:  Process hazard analyses are conducted to identify worst case scenarios and to recommend corrective action(s) needed to prevent their occurrence.\n\nLayers of Protection Analysis:  LOPA's are conducted where warranted by the identified hazards.  The protection layers that are identified are maintained in place to ensure adequate protection is available.\n\nOperating Procedures:  Operating procedures provide detail on how to safely operate the process.\n\nOperator Training / Certification Program:  A formal training and testing program is used to ensure that operators have proper skills and knowledge prior to allowing them to take responsibility for operation of the process.\n\nTechnical Staff Training and Support:  Trained technical staff are consistently available to support operations.\n\nMaintenance Procedures:  Specific procedures are used for maintaining process equipment so that it operates safely.\n\nMechanical Integrity Program:  Vessels and other process equipment are periodically tested and inspected to ensure safe operation of process equipment, following recognized industry standards and governmental requirements.\n\nManagement of Change:  A management system is used to ensure that facility modifications will be safe to operate.\n\nPre-startup Safety Reviews:  Reviews are conducted prior to start-up of new or modified processes.\n\nIncident Investigation:  Accidents and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028017,
      "SummaryText": " incidents are investigated to identify the cause(s) and implement corrective action(s).\n\nEmployee Participation:  Employees are involved in prevention program elements.\n\nHot Work Permit:  Procedures are used to ensure that welding, cutting and brazing are safely performed in areas where flammable or combustible material may be present.\n\nCompliance Reviews:  Periodic audits and assessments are conducted to ensure that process operations comply with applicable standards. \n\n\n\nConsistent with the User Manual for the RMP filing system, this Executive Summary provides only a summary overview of the RMP program at the Seadrift Operations Plant, and is not intended as a comprehensive listing of all relevant program elements.\n\n\n\n4. Five Year Accident History\n\n\n\nBraskem acquired the relevant process operation from Dow Chemical Company, effective October 1, 2011.  Therefore, with respect to actions, evaluations and other information relevant risk management planning (RMP) for the process unit, any such activity performed or occurring prior to October 1, 2011 did not occur during the period of Braskem ownership.\n\n\n\nBased on information available to Braskem, during the last five years, the facility has not had any accident or incident involving an RMP regulated chemcial that resulted in an on-site death, injury, or property damage; or a known off-site death, injury, evacuation, shelter-in-place, property damage or environmental damage.\n\n\n\n5. Emergency Response Program\n\n\n\nBraskem America Seadrift Operations is located in an industrial park within The Dow Chemical Company Seadrift Site.  Emergency Response for the entire Seadrift Site, including the industrial park and Braskem America Seadrift Operations, is coordinated by The Dow Chemical Company Seadrift Site (Seadrift Site).  Some employees of Braskem America Seadrift Operations participate on the emergency responses squad for the Seadrift Site.\n\n\n\nThe Dow Chemical Company maintains a written emergency response program for the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000028017,
      "SummaryText": " Seadrift Site to protect worker and public safety, as well as the environment.  The program consists of procedures for responding to releases of hazardous substances, including the possiblity of a fire or explosion.  The procedures address all aspects of emergency response, including:\n\n\n\n - Proper first-aid and medical treatment for exposures\n\n - Plans governing evacuation and shelter-in-place, and accounting for personnel after an incident\n\n - Inspecting, testing, maintaining, and using emergency response equipment\n\n - Notification of local emergency response agencies and the public\n\n - Post-incident cleanup and decontamination requirements \n\n\n\nThe Seadrift Site maintains a trained emergency squad to handle fires, explosions, toxic vapor releases, spills, and medical emergencies.  The emergency response squad trains and conducts drills to enhance their skills and tactics for responding to an accidental chemical release.  Critiques are held on drills and actual events.\n\n\n\nThe Seadrift Site emergency response program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Detailed Seadrift Site emergency response plans are developed and coordinated with the Calhoun County Emergency Planning Committee and the community.  A Mutual Aid Network has been established with Calhoun County and other local chemical plants to further enhance the ability to respond to an emergency.  The Seadrift Site emergency response program is updated when necessary based on modifications made to facility processes.\n\n\n\n6. Planned Changes to Improve Safety\n\n\n\nBraskem America Seadrift Operations is preparing to enter OSHA's Voluntary Protection Program (VPP), which requires a strong, voluntary commitment to the highest safety standards.  Several projects are currently in-progress to further enhance safety.  The Process Hazard Analysis will be periodically reviewed and, as appropriate, updated to ensure that "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000028017,
      "SummaryText": "process hazards are properly identified, understood, and adequately mitigated.\n\n\n\n7. Braskem's Acquisition of Facility\n\n\n\nRelative to Braskem's development and implementation of its risk management planning (RMP) program, and specifically with respect to its prevention program, Braskem acquired the relevant process operation from Dow Chemical Company, effective October 1, 2011.  Therefore, with respect to actions, evaluations and other information relevant to RMP for the process unit, any such activity performed or occurring prior to October 1, 2011 did not occur during the period of Braskem ownership.  Nonetheless, to the extent that the prior owner of the process operation conducted any relevant evaluation, including a process hazard assessment, with respect to the process, Braskem regards such evaluation as continuing to be applicable to the process operation, since the equipment and process activities have (for purposes relevant to RMP) been retained in all material respects since the date of Braskem's initial ownership.  Therefore, in providing within this electronic submittal information responsive to specific inquiries regarding prior dates on which certain relevant events occurred, Braskem identifies, where appropriate, the date of such event even if prior to Braskem's initial ownership to the extent that such event or activity remains relevant for RMP purposes to Braskem's on-going operation of the regulated process."
    }
  ]
}