{
  "FacilityID": 1000041525,
  "FacilityName": "McLane Southern California",
  "FacilityStr1": "4472 Georgia Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "San Bernardino",
  "FacilityState": "CA",
  "FacilityZipCode": "92407",
  "Facility4DigitZipExt": "1857",
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.168889",
  "FacilityLongDecDegs": "-117.343056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "David West",
  "OperatorStr1": "4472 Georgia Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "San Bernardino",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92407",
  "OperatorZipCodeExt": "1857",
  "FTE": 550,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000157313",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-04-28 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-08-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 34.16816,
  "FRS_Long": -117.34287,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051147,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000041525,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000061988,
          "ProcessID": 1000051147,
          "ChemicalID": 56,
          "Quantity": 20800.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000051653,
          "ProcessID": 1000051147,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000043422,
              "Process_NAICS_ID": 1000051653,
              "SafetyReviewDate": "2014-04-25 00:00:00",
              "PHA_Date": "2013-08-14 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-08-14 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-03-08 00:00:00",
              "TrainingReviewDate": "2011-05-04 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-04-25 00:00:00",
              "EquipmentInspectionDate": "2014-01-03 00:00:00",
              "EquipmentTested": "5-Year Mechanical Integrity Inspection",
              "ChangeMgmtDate": "2010-05-07 00:00:00",
              "ChangeMgmtReviewDate": "2013-12-12 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2016-12-07 00:00:00",
              "AuditCompletionDate": "2018-12-31 00:00:00",
              "IncidentInvestigationDate": "2010-10-20 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-12-12 00:00:00",
              "HotWorkPermitReviewDate": "2013-12-12 00:00:00",
              "ContractorSafetyReviewDate": "2013-12-12 00:00:00",
              "ContractorSafetyEvalDate": "2010-05-07 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000051977,
                  "PreventionProgram3ID": 1000043422,
                  "ProcessChemicalID": 1000061988
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000041525,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "San Bernardino County Fire Dept",
    "CoordinatingAgencyPhone": "9093868401",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041525,
      "SummaryText": "This Executive Summary contains McLane Southern California's administrative and operational programs to prevent ammonia-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is anhydrous ammonia.  The following topics are addressed in this Executive Summary:\n\n\n\n    Accidental Release Prevention and Emergency Response Policies\n\n    Stationary Source and Regulated Substance\n\n    Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n    Five Year Accident History\n\n    Emergency Response Program\n\n    Planned Changes to Improve Safety\n\n    External Events\n\n    Data Elements Notes\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nMcLane Southern California is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the process solution equipment at the facility. \n\n\n\nMcLane Southern California senior management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. McLane Southern California's safety and environmental policies as they relate to the ammonia refrigeration system are administered by the DC Manager, who conducts inspections of the facility to ensure compliance.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe system at 4472 Georgia Blvd. in Riverside, California was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes at the time of construction.  The facility was originally constructed in 1985.\n\n\n\nThe ammonia refrigeration system uses 20,804 pounds of ammonia to provide refrigeration for the Dock, Cooler, and Freezer. The majority of the system is located in the engi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041525,
      "SummaryText": "ne room including vessels and compressors.  The condensers are mounted on the roof, and all of the evaporators are located in their respective cold areas.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe McLane Southern California ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with Cal/OSHA's Process Safety Management regulation.  The facility conducts preventative maintenance and any necessary minor repairs in house, but an outside contractor is hired for major repairs or maintenance.\n\n\n\nThe facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code, which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors in the engine room as well as sensors near the evaporators, and automatic shut down systems.  In addition, the majority of the ammonia is maintained inside the engine room and just outside of the engine room (condensers). All pressure vessels are equipped with pressure relief valves that are piped to the atmosphere.\n\n\n\nIn addition to the Uniform Mechanical Code, McLane Southern California has developed a preventive maintenance program that utilizes the services of a professional refrigeration contractor to complete regularly scheduled inspections and tests of the ammonia refrigeration system as well as repairs as needed to process equipment.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nA review of the facility's accident history was completed to determine if there had been any significant releases of anhydrous ammonia over the past five years (March 2009 - March 2014) that exceeded the Federal Reportable Quantity of 100 pounds. The review revealed that there have been no RMP reportable releases that resulted in on-site de"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041525,
      "SummaryText": "aths, injuries, or significant property damage, or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.  However, there were two incidents in 2010 that warranted an internal investigation. \n\n\n\nApril 18, 2010: \n\n\n\nChuck Hundley, Maintenance Lead, was notified by security guard that the refrigeration system alarm indicator light was on. He arrived on-site at approx 2:07 pm and found that the refrigeration system had failed. Compressor # 1 had shut down and Compressor # 3 had failed on \"High Inlet Oil Temperature\". The Low Temp Recirculator had a high level alarm. \n\n\n\nChuck cleared the \"High Temp Compressor fail to run\" alarm and started Compressor # 3 again, in an attempt to bring accumulator suction pressure below the suction pressure of the low temperature side (freezer) to allow ammonia to migrate to the accumulator. The liquid level in the HPR was low. Due to this, Compressor #3 would not run long enough to bring the suction pressure below the pressure of the Recirculator. At this time, there was no leak in the Compressor Room.\n\n\n\n\n\nAt this point he contacted the refrigeration contractor, C&L Refrigeration. At approx 3:45 pm Chuck returned to the compressor room and found that there was an ammonia leak and contacted the Supervisor on duty, Gloria Rivera and together they contacted 911 and requested that the fire department respond. While they were contacting 911, C&L Refrigeration's On-Call technician arrived on site. Chuck checked the ammonia concentration in the Compressor room remotely via the computer and it read 125 ppm. McLane personnel and the C&L technician donned proper PPE and entered the Compressor Room. They determined the source of the leak and the C&L technician isolated it, by valving off Compressor #2. By the time the fire department arrived, C&L's technician had isolated the leaking valve and allowed the liquid ammonia on the floor to dissipate. \n\n\n\nAfter the isolation, ammonia concentrations "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000041525,
      "SummaryText": "on the ramp at the Electrical Room entrance read 0 ppm, the Electrical Room (room adjacent to compressor room) read 18 ppm, 10 feet inside the compressor room read 40 ppm, and the area of the leak read 125 ppm. The readings were taken by Chuck using both a hand held detector and hand tube. \n\n\n\nThe fire department determined that C&L Refrigeration could enter the building for the purpose of making repairs. The C&L technician tightened the packing on the automatic valve that was leaking at Compressor #2 and replaced the make-up valve to the recirculator. They ran the system for approximately one hour before handing the system back over to McLane. It was determined that the leak was due to contraction of steel, caused by liquid in a vapor line, causing the valve to leak at the packing. The C&L technician tightened the packing nut and stopped the leak. It was determined that the high level in the recirculator vessel was caused by the recirculator make up valve failing to close completely and allowing liquid ammonia to migrate from the accumulator to the recirculator causing the liquid level in the recirculator to increase above the high level cutout. It was determined that approximately 85 pounds of ammonia was released. The release scenario lasted for approximately 2 hours. \n\n\n\nOctober 20, 2010: \n\n\n\nSteve Ray of C&L Refrigeration was attempting to close the isolation valve to the economizer line on Compressor # 1 when the valve started to leak from the bonnet. He had to peel off the insulation around the valve to be able to get to the flange bolts. Once the insulation was removed, he was able to tighten the bonnet flange bolts and stop the release. \n\n\n\nThe release consisted of ammonia vapor and was estimated to last for approximately 10 minutes. It was estimated that less than one pound of ammonia was released based on the pipe  (18\"x 2\"), diameter of the opening, and the duration of the release. \n\n\n\nOnce the Maintenance Lead, Chuck Hundley, was made aware of the relea"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000041525,
      "SummaryText": "se he contacted the San Bernardino CUPA Office and the California Office of Emergency Services. He received the spill number 10-6327. [CCR Title 8, ? 5189(e)(2)(G)]\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe McLane Southern California facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document. This Plan was designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nThe operator of the facility maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations.\n\n\n\nIn case of an ammonia emergency, the operator of the McLane Southern California facility plans to evacuate all employees in the facility and activate the facility's Emergency Response Team (in conjunction with the refrigeration contractor) to respond to the situation.  If necessary, they will alert the local emergency responders (fire department) for assistance. The operator of the facility plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazards Analysis, including a Hazard and Operability (HAZOP) study and a Facility Inspection, provided mitigation measures to improve safety at the McLane Southern California facility located at 4472 Georgia Blvd. in San Bernardino, California.  The McLane Southern California safety committee is planning to complete sev"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000041525,
      "SummaryText": "eral items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n1. Continue to train all employees in the facility Safety Plan/Programs.\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n\n\n "
    }
  ]
}